{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-17", "description": "Cobble Hill classic. A reliable choice for bahn mi, vermicelli noodle salad, and pho. Consistently delicious, reasonable wait/delivery time, relaxed atmosphere. A definite in-and-out environment, this is neither a gourmet stop or a particularly authentic experience, but is always delicious and satisfying. I usually go for the classic bahn mi or vermicelli with tofu and have yet to regret my decision.", "author": "Molly O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-29", "description": "Best bahn mi i've had in NYC so far! I've tried the classic and the tofu, and both are amazing (the soft, crusty bread definitely adds to this!). Good pho and spring rolls too, but the sandwiches are the reason to go.", "author": "Phoebe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-09", "description": "Delicious! The spicy sauce varies in hotness - sometimes the medium is insanely hot and sometimes it's mild. Oh well, I'm not too picky and the place is so delicious.  It's always busy but they are pretty fast. Good customer service as well.\n\nThe vegetarian chicken sando is awesome and its ready in no time at all.", "author": "Ariberry A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "Got the tofu sandwich - really good and at a great value. Plenty of carrots and delicious sauce included among very large pieces of fried tofu. It was crowded as it was lunchtime but the service was fast and efficient. Will totally get again, along with some delicious-looking Thai iced tea bubble tea!", "author": "Dana E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-17", "description": "I'm quite certain that they raised the price on everything since my visit last summer. $4 for bubble tea and $6 for a pork banh mi?\n\nThey do give you a generous amount of tapioca in your bubble tea, so $4 isn't a complete rip off if you like those balls. It's no Ten Ren though, that's for sure. Also, I suggest avoiding the almond bubble tea unless you know you're going to love it because I was not a big fan. I do like almonds but this drink tasted like macarons and milk blended together. It was way too almond-y...why didn't I just go with green tea or taro??\n\nMy pork sandwich was slightly disappointing this time around. The pork-to-veggies ratio was not right in my opinion, and the pork was kind of weird. Some bites were ridiculously chewy...I feel like I must've gotten screwed with some seriously fatty pieces. Gross.", "author": "Kassy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "The classic is all you need! A perfect ratio of bread to meat and vegetables made this the best sandwich. Price is right and the wait time is too little for something so delicious. Good things come to those who wait, however in Hanco's good things come to those who simply enter this place.", "author": "Marland V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "Food- great! Bubble teas-great!  It's never quick, but worth it if you have a few extra minutes to spare.", "author": "Molly G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-22", "description": "Every time I happen to be in Carroll Gardens, I stop at Hanco's for a banh mi and a bubble tea.\n\nTheir banh mi may not be the cheapest ones around ($5.50), but they're really damn good. My favorite is the classic: roasted ground pork, Vietnamese ham, pate', mayo, butter, cucumber, pickled carrots, daikon radish, and cilantro. The carrots and radish are nice and cruncy, exactly the way you want them to be, and the ground pork is very flavorful without being greasy at all. And the cilantro is so refreshing! They could do with a bit more pate', though. The sardine banh mi is also very good.\n\nWhiteys beware: if you ask for a spicy banh mi, you're going to get a HOT sandwich! Not unbearably hot, but enough to make you cry (beware of the big pieces of jalapeno).\n\nTheir bubble teas (milk tea and flavored tea) are $3.75. I particularly like the honeydew and the taro milk tea.\n\nA final note: I see that the banh mi went up by $0.25 since last month. Do they know we're in a recession...?", "author": "Matteo R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-13", "description": "This place has some really good tasty sandwiches. instantly my new favorite the classic bahn mi.", "author": "Jorge V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-31", "description": "As I continue on my quest for the perfect Bahn Mi, I have decided to try Hanco's, which has the best reputation in Brooklyn, for Bahn Mi.\n\nAlthough the bread was not as crusty as Paris Sandwich Shop, this was a better sandwich.  You have options, so there is a bit of customization.  You can have it mild, medium or spicy.  Of course, with my penchant for chile, I ordered spicy and you can even have it on whole wheat, for an extra .75 cents.\n\nThis time, I ordered the Classic Sandwich, made with ground pork, Vietnamese ham, pate and accompaniments.  Their pickled carrots and daikon (at Paris Sandwich Shop, it was only carrots) was perfectly pickled with the correct balance of vinegar and sugar and added so much more flavor than the carrots that were in my Paris Sandwich.  This had large stalks of cilantro, so it had the freshness I was missing at Paris.\n\nIn conclusion, this filling in Paris's bread would be the perfect Bahn Mi!\n\nRegardless, with a lychee Bubble Tea , with the perfect tapioca consistency, this was a fantastic lunch!!!", "author": "Mireille R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-18", "description": "Pros: Fast, cheap and satisfying good value.\n\nDamn you Hanco,! I want to like you so much!!! \nIn fact, i Do like your food, I do, I do!! I want to eat it right now...\n\nBUT:\n\nCons: Suspect NYC health Department Grades....just saying. \n\nFor a place that is that small, how can you have so MANY sanitary violations on file...? What is wrong guys!?? \n\nSoap, water, sinks..sanitize..refrigerate. \nHow hard can it be? \nThere are only like 10 things on your menu!???\n\n+++++++++++++\nGrade Pending...never a good sign...\n\nhttp://a816-restaurantinspection.nyc.gov/RestaurantInspection/SearchDetails.do\n\nViolations recorded in the following area (s) and a Notice of Violation issued at the reinspection conducted on 05/21/2011.\n\"Critical\" violations are displayed in red.\n \nViolation points: 26\n\nSanitary Violations\n1) Cold food item held above 41º F (smoked fish and reduced oxygen packaged foods above 38 ºF) except during necessary preparation.\n2) Appropriately scaled metal stem-type thermometer or thermocouple not provided or used to evaluate temperatures of potentially hazardous foods during cooking, cooling, reheating and holding.\n3) Food not protected from potential source of contamination during storage, preparation, transportation, display or service.\n4) Other general violation.\n\n++++++++++\n\nI simply will not go back until you get better results from your NYC health inspections.\nC'mon, you can do it, you  guys are pros and have several locations...this is a no brainer...", "author": "M. Ward N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-08", "description": "Wow, I thought Baoguette couldn't get touched - but this place comes close, maybe surpassing.\n\nSummer rolls w shrimp are good - as they are everywhere.\n\nBut the winner is the Classic banh mi.  It doesn't have as dirty of a char as Baoguette, but it's equally great, and perhaps more moist.  Also, the bread is nicely baked yet soft.  I'm definitely gonna have to come back.  Yum.", "author": "Kevin W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "Decided to eat here today to taste what all the buzz was about. Approaching the store I saw a B-grade from the health department but still went inside following my gut (or hunger). I wanted to try something semi healthy and new, so I ordered the vegetarian chicken sandwich with medium spicy option. Included inside the French baguette was the veggie chicken, mayo, butter, cucumber, picked carrots \u0026 daikon radish and cilantro. As far as the spice, they added sriracha sauce (instead of the usual jalapeno peppers that traditional Vietnamese sandwiches add). Overall my experience was positive. They provided speedy customer service and the sandwich was warm and tasty. I will be visiting here again in the near future.", "author": "J. T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-29", "description": "Great bubble tea and sandwiches... They are not fast and not friendly.  I go for the tea etc. Not for helpfulness or friendly people.", "author": "DonnaMarie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-23", "description": "Food was good but not better than Chinatown. The grilled chicken was over cooked and not seasoned enough. Thai ice tea was mostly tea. Overall I would come again if I was in the area but wouldn't make a special trek out here. Summer roll wasn't bad. Great location and quick service.", "author": "Angela W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-22", "description": "I love Hancos. I used to live by their park slope location, and would be by the carroll gardens location during work. now, i live by their carroll gardens location, and work by the park slope one.\n\nI like:\nall the sandwiches. even their \"fake\" meat in the veggie sandwiches is really good.\nthe rice vermicelli salad is really good, way filling, and generous portioning.\nthe garden rolls\nmy boo really likes their vietnamese coffee, too.\n\ni've picked up and gotten delivery... a lot. no complaints!\n\n5 stars. keep it up!", "author": "Kathleen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-18", "description": "Strategically located next to Van Leeuwen's ice cream, this joint is not to be missed.  My sandwich with whole wheat bread and stuffed with white meat chicken, carrots, daikon, cilantro.  Yumtastic!  The price was right too....cheap!  When you're done, walk next door to Van Leeuwen and cap off your meal with some delicious (but pricey) ice cream.", "author": "Patti M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-02", "description": "On the site it says it's $6 for a sandwich but when I called to order and got the order they charged me $7. Please update your menu prices.", "author": "Kevin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-23", "description": "Hanco's has some of the best bahn mi's I have tasted. I have tried all their bahn mi's but my favorite definitely is the Classic, the Roast Pork, and the Vegetarian Chicken. Pair that with one of their amazing bubble teas and you are good to go for lunch. A plus is that if you go there often, the 10th sandwich and/or bubble tea is free! But make sure you don't lose the stamp card that they give you.", "author": "Soma M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "This place is AH-mazing. What do you want banh mi, pho, bubble tea - get all that here and it's bomb-diggity-shmigity - my favorite is the grilled chicken sandwich but my husband loves the classic.", "author": "Sam R."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}