{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-12", "description": "You are missing out until you have had the shredded white meat spicy chicken vietnamese sandwich. Black bubble tea with strawberry is deeeelicious! Grab frequent tea and sandwich cards!!", "author": "Pepper P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-31", "description": "I love this place. It's not as good as the Vietnamese places in San Jose, California or as cheap but then that's cause there isn't a huge population of Vietnamese people in NY vs. CA. Why do you think Cantonese food is SOOO good in Vancouver? Or Korean food sooo great in LA? Survival of the fittest.\n\nBut I digress, first off, Hanco's is run by Chinese folks but that doesn't mean the sandwiches aren't good and CHEAP when you compare it with other take out/eatery type places in Cobble Hill. \n\nI'm addicted to the crispy bread, the ground pork pate, the meat, the crispy carrot and radish vinegary radish sticks. It's very fresh and fasssst. It's also better than the Banh Mi's at Nickys.\n\nI just wish they would open earlier so I can place an order for breakfast too..", "author": "Angela G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-23", "description": "Oh. My. God.\n\nI am usually a fairly neat eater, not easily impressed by food, and highly unlikely to rave about a sandwich. But you couldn't tell it by the way I ate my Spicy Classic Bahn Mi at Hanco's this week.\n\nGround pork, ham, a cucumber, and julienned carrots with daikon radishes combine with pate on a toasted baguette for an explosion of flavor. One of the best sandwiches I've ever tasted.\n\nThere was a fair amount of srirarcha around, so I assume it is what was responsible for the spice. Extra points for using my favorite hot sauce.\n\nAlthough the coconut bubble was good enough, I disliked the notes of lavender. Pure coconut milk would have been perfect (and a little less sweet).\n\nI came just before the dinner rush, and grabbed one of the last tables in this 15 seater restaurant. Be warned: if you sit outside, you might be asked to move off the basement stairs.\n\nAmazing pork foodgasm= more visits to Hanco's.", "author": "Emily O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-08", "description": "This tiny little sub shop delivers, no question. The subs are served on crunchy, chewy baguette and are heaped with cilantro, cucumbers, shaved carrots, and, in my case, perfectly cooked tofu. But if you prefer chicken or pork that is available as well! They are dressed with a sweet, tangy, slightly vinegary dressing. YUM!\n\nThe best part about these subs is that they cost less than $6! Finally my quest for lunch for less than $10 has been realized!", "author": "sarah p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-12", "description": "Their mango bubble tea was delishhhh.. Loved it. The actual restaurant is a bit small and seems to be the Vietnamese version of fast food as you go up to the counter to order. Definitely somewhere I'd have to try out as I hear that their sandwiches are delicious and worth the experience.", "author": "Sandra G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-01", "description": "Hanco's, you have the best almond green milk tea I've had in New York.\nwhoopee! I thought I'd never find my almond green milk tea that rivals Cha for Tea's quality. You do!\nI've missed the perfect combination of sweetness, jasmine/almond blend tea INCREDIBLY.\nIn the city, Ten Ren and St. Alps donot suffice to satisfy my picky taste buds for my favorite tea combo. \n\nSandwich: the classic sandwich comes with three different meats (WOW!)- roasted pork, Vietnamese ham, pate, and mayo, butter, cucumber, pickled carrots \u0026 daikon radish and cilantro on a toasted french baguette (the baguette is perfectly balanced, not too dry and not too toasty). Sometimes baguette breads from Viet sandwich shops stick to the roof of my mouth (annoying!) but Hanco's sandwiches do not. Simply, purely delicious!\n\nThanks for an enjoyable meal. Hanco, you are pricey at $5.50 for a sandwich and $3.50 for the drink (same as Cha) but you prove your worth.", "author": "Kristen Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-09", "description": "It turned into a problem, quickly. That's how good these damn sandos are. I had to quit cold turkey.\nI'm super sad about the self imposed ban, but what's a girl to do?\nI cannot believe that these delish little Vietnamese sandwiches have somehow wiggled their way into my life and become my comfort food. Uh...I'm pretty Irish for that to have happened.\n\nPeople complain about the time it takes, I've only experienced that once when the whole office waited and 75 minutes for dinner. I was still OK with that, but I did see some melt downs around me.\n\nI love the tofu sandwich, the vermicelli, the salad, the rolls, the bubble tea- hell I love it all. Makes me crazy!", "author": "Rhubarb M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-27", "description": "The Short: \n\nAbsolutely delicious Vietnamese sandwiches. DO NOT pass this place up. \n\nThe Long: \n\nAdmittedly, I had never had a Vietnamese sandwich before today when I went to Hanco. Friends have continually told me to go here and now I know why. The place itself is very small with a kitchen the size of most NYC bathrooms and about 5 tables. What they turn out of that tiny little kitchen area is magic.\n\nI had the spicy sandwich, which the lady at the counter told me was the regular but with jalapeños. It was AMAZING. The bread was perfect, chewy on the inside and crunchy on the outside. Then there was a layer of ham, ground pork, pate, and then a slew of veggies that added a sweet crispness to the whole thing. \n\nThe garden rolls I would rate a two on here. They were fairly bland and more of a vehicle for the dipping sauce then they were great themselves. \n\nFor those of you who watch 30 Rock, I like to think of Hanco's as the place where the teamsters go to get their yearly sandwiches that Liz cannot pass up. \n\nENJOY!", "author": "Carlo S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-12", "description": "Went for lunch today after reading about it on Chowhound.  I got the Grilled Pork chop banh mi.  The star off comes from the fact that it's $5.50 for banh mi.  These suckers were $2.50 back in San Diego.  If it was $5.50 in Manhattan, then maybe I'll give it a pass, but in Brooklyn, really??  $4 would've been a good price, but disregarding that, lets move onto the sandwich.\n\nGrilled pork was done perfectly, couldn't have asked for anything more, except maybe a little more meat, but the portion was just right.  A tiny irk that I had was that all the meat was piled inside the sandwich, while the pickled condiments were outside the sandwich.  Maybe they should mix it up a little bit, cause I had really lopsided bites, ones full of condiments, and others full of pork.  I got a few perfect bites, which were sublime, but a majority of my bites were kind of awkward.  Topped it off with an ice coffee which was strong as expected, but really good.  Comparing everything back to the west coast, not too shabby.\n\nWill be back, no doubt since it's so close to school.", "author": "Minh L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-14", "description": "Good, but there are definitely much better, more authentic places than Hanco's.\n\nI got the original, but it tasted more like a Cuban sandwich than a Vietnamese one. (Note: Hanco's is run by Cantonese folks.) Real Viet sandwiches don't use lunch meat. Hardly noticed any pate, and the whole thing was really just too... juicy. Mushy, even. I'll admit they've got the bread and carrots down, though. \n\nIt's great that you can sit down inside, and everything feels clean.", "author": "Sandra S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-20", "description": "Ummmm $10 for Pho???? Are you kidding me??? Retarded prices. Who charges $2 for a can soda outside of sports arenas???", "author": "Collin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-05", "description": "Probably the best banh mi I've had in NY. Love the pate on the Classic sandwich.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-08", "description": "Just had lunch here and would't want it any other way.  Ordered two classic sandwhich, small thai ice tea and mango green tea.  Cost me about $27 bucks.  Sandwhiches are $6.50 each.  \n\nBread it toasted and crunchy on the outside, but pretty soft in the inside.  They put extra pickle diakon and carrots to even out the taste of the meat inside.  The ground pork inside seems to have been sautéed.  It was great.  \n\nUsually Bahn Mi sandwhiches don't cost so much, it's typically $2.50, but the sandwhiches here was worth every bite.  Would be great if it was cheaper, but regardless I'll till come back. \n\nI only gave it 3 stars because of the enviornment.  They dont often cleam out the table and when the door is open, there's a lot of leaves on the ground.  Other than that... food is great.", "author": "Debbie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-18", "description": "I love this place! Their sandwiches are tasty and consistent.  The bread is fresh-- chewy with crunch-- and the fillings are flavorful and delicious.  I usually get the classic sandwich, and I have tried the bubble tea.  I wish I lived closer; I'd definitely eat here more often.", "author": "Maria M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-02", "description": "With friendly service with a smile, the lady at the counter greets me and kindly asks me what I would like to order.  I love the welcoming feel of Hanco's.  Without a hesitation, I order the sandwich #1(mild--I'm not crazy enough to test these tastebuds or what's left of them), also known as the Paris special, with 3 different meats(pate, turkey, ground pork), mayo, cilantro, cucumbers, sweet \u0026 tart pickled julienne carrots and turnips.  There are about 4 or 5 tables where one could sit and eat your meal in content.  It's a nice space with art pieces which are the traditional Vietnamese foods that you could order there.  They have the place newly repainted with nicer soothing hues.  I like the beverages that we got.  Having their Thai iced tea was refreshingly cool and their iced espresso with condensed milk was just as awesome.  Last time, I had their iced lemonade, and it was really good with sugar and just enough lemons to make it tart.  My fiancee had the veggie pork, in another words, pork that is tofu, but looks like meat.  He had the extra spicy flavor and said it roared down his esophagus and was worth the blaze that it trailed.  =)  I take it as a good thing.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-13", "description": "Hanco's vietnamese sandwich is great. I believe it tastes more authentic than Nicky's, closer to what I would have at home in San Jose. I really can't pin point the key difference. It might come down to the bread...or probably because it's heavier (more mayo?). Regardless, Hanco's banh mi is delicious!", "author": "Elaine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-11", "description": "I have a (potentially) embarrassing confession to make about Hanco--I have yet to actually try the banh mi!!\n\nI have, however, tried to rice vermicelli dishes several times and am a huge fan. I know that Vietnamese is kind of the new Thai, and I'm a total follower! Sometimes I just need some delicious noodles/fresh veggies/pork in my life!\n\nThe boyfriend and I have ordered a few times and have always been pleased. Food arrives quickly and in large amounts (hello dinner and lunch tomorrow!) and I like that the hot sauce is always provided. I add just enough to keep my mouth tingling, and then dig in to the delicious combination. \n\nMaybe next time I'll order banh mi too..and then I'll have dinner, lunch and dinner again all ready to go!", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-15", "description": "This place rocks! Great banh mi sandwiches :) I am sorry to say this, but their banh mi sandwiches are so much better than the ones at Nickys and...they also have bubble tea! If you are ever on Smith St., you have to stop by here!", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-11", "description": "It could be I haven't had pork in a while, but bf and I shared a pork sandwich after a long day and it was exactly what we needed.  Bread was crusty and delicious.  Pork was well flavored and I really couldn't get enough of those daikons.  We didn't ask for spicy because we were both a little sick, but I added sirracha afterwards and it was great.\n\nA great sandwich for a great deal.  Definitely coming back for the original and shredded chicken.", "author": "Kelly Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-02", "description": "A friend of mine turned me onto Hanco's about a year ago.  Now I go through withdrawls if I dont have one at least once a week. \n\nIt's little hole in the wall joint that does one thing really well. I have tried other Banh Mi throughout the city and use Hanco's as the benchmark.  This is without question my favorite place to grab this tasty little treat.  \n\nI have had cheaper versions but the quality has always suffered as a result.  This is a must have when in Park Slope.\n\n I recommend a classic with a Jasmine bubble tea.  \n\nCrusty Baguette, sweet cuts of pork, chili sauce, cilantro, and carrots = yummy in my tummy.", "author": "Steve S."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}