{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "Rice vermicelli bowl, pho and spring rolls all great. Reasonable prices. They deliver", "author": "Peter K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "DELISH \u0026 NUTRISH.\n\nSo many veg options / so many options in general. It'd take a month+ to cycle through the whole menu. The most convincing soy chicken I've had in a while (maybe ever?). \n\nSo! Much! Coffee and Tea! Covfefe [noun]: the headache you get from too much caffeine, or reading the menu at Hanco's because everything sounds so good and you can't possibly consume it all.", "author": "Katrina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "First things first they have the right hoisin sauce which is extremely important to me. My biggest complaint is that the vermicelli bowls do not come with summer roles, those cost extra. I think around $5 or so. The portion was huge and the food came out fast. It is not a sit down, served restaurant though. More like a Panera style of ordering.", "author": "Maya T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-09", "description": "Stumbled upon here with a few of my girls because we were getting brunch somewhere else but the wait was really long. We were starving and really wanted bubble tea after passing by Hanco's on the way to our brunch spot. To be honest, I wasn't expecting much from this place - I don't know many good places that serve both bubble tea and Vietnamese food together and can do it right.\n\nI decided to get the large Taro bubble tea. When it came out, I thought it was going to be much bigger because it usually is at other places. But I enjoyed it very much and the tapioca balls were good. My girls and I tried the Banh Mi sandwich and to my surprise, it was delicious. It was different from the Classic Banh Mi I'm used to (there's the addition of ground pork, instead of all sliced meat). The sandwich is very short in length but don't that that fool you because the sandwich is wider than usual.  I would say the only downside to this place is that the prices are a bit higher than other spots that I go to.\n\nOverall, I was a fan of Hanco's. The ambiance is chill and our food came out at a reasonable amount of time. If I'm in the area, I will definitely come back to check out more items from the menu.", "author": "Steph Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-29", "description": "The vegetarian options are really great quality here but what made me give this location 2 stars is the bubble tea. I ordered a small vanilla iced latte with bubbles and it was wayyyy to sweet, it tasted as if half the cup was composed of simple syrup. I didn't see any options to change the percentage of sugar so I simply assumed that it would have a little bit of sweetness but that I would be able to actually taste the flavor of my drink but no, it tasted way too similar to drinking straight sweetened condensed milk.", "author": "Khadega S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "I've been to one of the other locations in Brooklyn, a few years ago, but first time here. I loved it. Got the Classic Sandwhich.... omg yum!! Plush passion fruit tea with lychee jelly (no black tapioca bubbles) yummmm again!! Def recommend this place!", "author": "Lilia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "The bahn mi from Hanco's is by far the most delicious one I've ever had. I've never been impressed by bahn mi before and this one was particularly stinky, as it had a lot of pickled radishes and my coworker complained that it smelled like trash but it was DELICIOUS so whatever. When it comes to Asian food, the more flavorful and smelly it is, the better!\n\nIn conclusion, the pickled radishes will most definitely stink up your immediate surroundings and possibly make your coworkers judge you, but still totally worth it.", "author": "Aries T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-09", "description": "I ordered regular milk tea and beef pho \nThey give you a good amount of food. It's good for 2 people. The beef is soft. \nMilk tea was not sweet and too strong. \nI spotted 2 flies though. Overall the food is good.", "author": "Sheng M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "I come here once a month. Can't believe that I'm finally writing a review for this place!\n\nLiterally one of my favorite spots for lunch or dinner. It's simple, affordable, tasty and quick. \n\nAs a vegetarian, it's exciting to me that this place offers vegan soy meat substitutes for their food! I nearly always get the noodle soup with the vegan pork. I prefer the pork over the chicken because it's seasoned/ not plain. The girls working here are fast and sweet. The decor is pretty nice and the food is consistently awesome. \n\nWould recommend coming here especially if you're a vegetarian!", "author": "Marsha G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "Great place. Cheap, unpretentious and healthy. Quick and efficient service. You can also order online. The vermicelli rice is delicious.", "author": "Tomas G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Love this place! Great and inexpensive place to go for a real deal meal! Everything is authentic from the soups, to the teas. Super personalities behind the counter.", "author": "Jack G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-11", "description": "You can not go wrong with Hanco's Classic Vietnamese sandwiches.  I had purchased the grilled pork sandwich and the taste was perfection.  \n\nThe prices are slightly on the expensive side at $8 with tax. The taste and portion is so worth it.  \n\nPlenty of room to sit and enjoy your meal.  I recommend having a Thai Ice Tea as well.", "author": "Freddy V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "I come here fairly often as it is really good and really fresh and for some reason I prefer this location over the park slope location. It is newer and more modern. The sandwiches are always made the way you want it with a lot of options. They have whole or white bread. You can also tell them to limit the amount of dairy (I didn't even know there was butter and mayonnaise on the sandwich is) and then you choose the level of spiciness that you want. The Bahn Mi are definitely the star of the show but they also have really good Bubble tea if you're into that sort of thing. You order and then wait for your food to be called with a number. There are a decent amount of tables but I tend to get my food to go because it's a pretty easy food to eat while you're walking. They also have good summer rolls but I stopped getting those because I find they are quite expensive for not a whole lot of food. I actually feel like the prices here are a little bit more than the park slope location possibly because of higher rent prices -that's my only guess. Either way it has my favorite bánh mì sandwich.", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "We walked by and saw this place on Yelp so we decided to get a quick snack. The wait time was terribly long, we ordered a classic bahn mi and probably waited for like 15 mins.\n\nThe sandwich itself was good, the bread was crunchy and toasted perfectly. I reckon they buttered the bread a lot, cause it was deliciously greasy. The meat was good and the portion is huge.\n\nI'll probably be back next time, but wish they could balance the seamless orders, sit down orders and to-go orders better.", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-02", "description": "I love bahn mi's! I must have one once a week. I don't work to far from this location. I'm kind of in the middle of this location and the Montague location. So I rotate between the two. The bahn mi I always get in vegetarian chicken with medium spice \"for here\".  It's my fave  aka I never order anything else. \n\nIt's crowded here but this location is close to a bunch of cool coffee shops so dessert or coffee is also covered. My faves are Blue Bottle, One Girl, Bien Cuit and Konditori. \n\nEnjoy!", "author": "Carolina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-20", "description": "I love Hanco's. The classic Banh Mi and the Pho are always excellent and prices pretty good. I actually have yet to find a better Banh Mi yet, and am always on the hunt! :)", "author": "maor r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-26", "description": "Though this place has been here for a long time, and we've seen it in passing many times, we never gave it a try and never gave it a thought.  Truth be told, we didn't think banh mi in this area would be as good as it was here.  On this particular day, we need a quick cheap bite before a big family dinner later on the in evening.  So we popped into Hanco's, had a grilled chicken sandwich shared between us and an iced coffee.\n\nFirst impression, the banh mi was packed!  Much meat, so much toppings, such yum.  The flavor was great and consistent with any authentic banh mi place.  The sandwich was hot and crispy in all the right places and the taste was perfect.  We were so glad to tried out this place and kind of sad we missed it in the past at other times we were in the area.  This is one of those places we definitely need to hit up again.", "author": "Leila L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "I'm in love with your\nBanh mi and coffee- no one\nCompares to Hancos!", "author": "ReviewHaiku F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-10", "description": "This review is only for their bánh mìs.\n\nHanco's is cheap, good and satisfies my fulfills bánh mì cravings. You really can't beat the bang-to-buck ratio but there are definitely some better bánh mì shops in the city. Though I love bánh mì, I can't say I'm an expert at dissecting them and there is something that is missing in the Hanco's sandwiches. Is it the lack of mayo? Not enough veggies? Weak flavor? Could be all of the above, or maybe it's something in the bread. Whatever it is it, I've had better but these aren't the worst! \n\nTheir boba shines more than the sandwiches and I've stopped by the shop just for the drinks alone. If you're hankering for a bánh mì in the area, this is your safest bet, however, I don't recommend going out of your way for these sammies.", "author": "Maria J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-05", "description": "My co-workers and I have been here a few times for lunch. The chicken sandwich is amazing. The beef pho is pretty decent as well, though I prefer the sandwiches. The prices are great and service is fast. \n\nWe've also catered from here for a team meeting. Food arrived in a timely fashion and all 12 items were correct.", "author": "Sana A."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}