{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-10", "description": "The best Vietnamese sandwich in the city!\n\nI've tried nearby Nicky's, Baoguette, etc, and those sandwiches taste like dogfood compared. I could eat a classic spicy everyday and sometimes come close!", "author": "Robert R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-13", "description": "Fantastic vietnamese sandwiches. Very fresh ingredients (great shredded carrots and cucumbers). Very timely delivery, friendly delivery man, and this place is CHEAP. I would highly recommend the classic. Its also much more of a delivery place than a sit down place.", "author": "Ingrid M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-05", "description": "Hanco's is fantastic.  \n\nI love the Classic, and the pork sandwich is terrific too. The spring rolls and garden rolls are tasty as well. Everything is extremely affordable. \n\nI just wish they were open later than 9pm.\n\nWait times are by and large pretty fast; however, on occasion, the kitchen can be overloaded with orders and things can take time. It's a small operation, so if you go and notice a long line of folks waiting - be prepared to either wait - or go someplace else.", "author": "a l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-07", "description": "Hanco's has a really terrific tofu bahn mi, and their pork is tasty as well. By default they go a bit heavy on the mayo for my tastes. The sandwiches are well-portioned for a lunch or a light dinner.\n\nI haven't had the bubble tea in a while, but from what I remember I liked it. And it's not like there are too many other places for bubble tea in the neighborhood.", "author": "Jeffrey P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-12", "description": "Tofu sandwich = perfecto!  I haven't found a better tofu vietnamese sandwich yet (and I've tried many).  Comes together beautifully - who needs pork when tofu can taste so good... spicy!", "author": "Julia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-15", "description": "Better than all the places in ctown.  Seriously that good. Even better than the panty/lotto place", "author": "M D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-07", "description": "Was craving a vietnamese sandwich and remembered I had the menu for either Hanco's or Nikki's.  I know there is a big rivalry between the two but I don't have a preference for one over the other and Hanco's was the menu I had, so that is what I ordered.  I was blown away.  I ordered the ground pork (heat = spicy) as well as a side salad and an order of summer rolls.  The sandwich was ridiculous.  SO GOOD.  The spiciness of the pork against the sweetness of the pickled carrots were to die for.  The ingredients were so fresh!!  I want one right now just thinking about it.  The salad was equally tasty - again, served with those pickled carrots.  My summer rolls WOULD have been perfection if the mint was included in the roll the way it should have been (as well as how it was advertised) but maybe they were out of mint that day... whatevs... they were still awesome.  Oh, and this place is a BARGAIN.", "author": "Krista C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-07", "description": "I had this 3 days in a row! I can't believe how good their sandwiches are. I've tried Paris in chinatown which is pretty darn good but this place takes the cake. The meat is plentiful (for a Vietnamese sandwich) and the flavors are done well. I tried their Pork, Classic and faux Pork. I could easily see myself converting to a weekday vegetarian with these guys. They are pretty fast but not fast food fast especially during a rush of people.. I've waited on line longer at a Starbucks though.", "author": "Tony N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-29", "description": "This little sandwich shop makes an amazing banh mi.", "author": "Will D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-21", "description": "Best Vietnamese Sandwich I've ever had. I had the pork, my wife had the chicken, both were excellent with a good amount of spice. If i had to pick one of the two sandwiches i would definitely pick the pork. it was the perfect amount of sweet and savory. I can't wait to go back", "author": "Batie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-24", "description": "Hanco's makes my favorite Banh Mi's around (I've been to Ba Xuyen but it was a little too \"real\" for me)! Sometimes though, I feel like they shove too much veg in there and I always seem to get a mouthful of cilantro stems rather than the good stuff. All in all, I really like it and they're shredded chicken is great too if you're in the mood for something different. The bread is amazing, can't complain about that! They also deliver and they're quick!", "author": "Cat H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-12", "description": "Five for the food!  We orded the Classic and Grilled Pork chop sandwiches; now, this is what Banh Mi should taste like, oh how I wish they'd set up shop midtown.  The little take-out shop consists of nothing more than your typical main counter and several lowly tables and chairs; order, wait, grab your sandwich, bite in and enjoy, let those taste buds relish in the flavors of one of Indochina's greatest exports to The New World!  Need I say more.", "author": "Anita L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-11", "description": "ok, tried the sandwiches and they are just as great as they smell. \n\ndef a bigger fan of the chicken vs the pork... more tender\n\nservice is excellent. the place closes at 9pm and i didn't make it there until 9:30pm to pick up my meal. and they waited!!", "author": "Joanie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-28", "description": "Quick, fresh, cheap, and deeeelisssshcious!  What makes this place even better is that it's located right around the block from my favorite watering hole, Camp.  So I can order me up the Classic Sandwich and their other pork sandwiches and get back to the bar in time before Roger finishes pouring me another fresh pint!", "author": "J L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-06", "description": "HELL YESSS! So delicious- its good when your starving or good after yoga- it is no frills and fantastic.  Whether its chicken or tofu the sandwiches always hit the spot.  I want to hug the hard working staff as I walk out the door past the crowd with my bubble tea.", "author": "KJ B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-03", "description": "Love, love, love bubble tea! If you haven't been here, do yourself a favor and try it out!  My favorite is the mango bubble tea. It's refreshing and the tapioca is fun to chew. It's a pretty small place, smaller than the Hanco's in Park Slope but still good nonetheless.", "author": "Eliana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-08", "description": "It's not as tasty (or affordable) as Saigon Bakery on Mott Street, but I love having this banh mi joint in the neighborhood.  \n\nExtra spicy porkchop sandwich with extra cilantro, please.", "author": "EJ C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-30", "description": "I have been on a search for the best Bahn Mi in Jersey City, NYC and Brooklyn.  This is the winner!", "author": "Tommy A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-22", "description": "These are delcious and so addictive and nowhere near where i live.  When i'm eating one of these sandwiches i always get a little sad realizing that the sandwich will be gone in a minute and that I cant eat another one immediately...", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-01", "description": "Huge, delicious Vietnamese sandwiches for $5.50.  Great lunch spot if you're in the neighborhood.  I had the classic sandwich - very tasty, a little spicy, awesome bread.  My only complaint is that half the sandwich had meat and the other half had the veggies, so there was no \"perfect bite.\" Would be better if they mixed the ingredients more.", "author": "Erica L."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}