{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "Our go-to banh mi sandwich place - legit banh mi's in a neighborhood that has very little authentic asian influence. Soft bread with a crunch that you don't have to gnaw through and generous portions of meat. Good bread to meat proportions which you don't always get with banh mi's. Our go to sandwich is the grilled chicken though I'm not a fan of the mayo sauce they add so I always ask them not to add it. They are also one of the few places in the area that serve pho which is just okay but decent enough to satisfy a pho craving. Always a decent amount of customers at any given time but never a long line.", "author": "Queena T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-26", "description": "What's not to love about Banh Mi: pickled radish, carrots, cilantro, chicken, and sauce, on a fresh toasty baguette! Each ingredient blends perfectly into this amazing sandwich!\n\nAt first, the sandwich looks pretty small, but I actually wasn't able to finish the entire thing.  Way too much goodness in just one sandwich.\n\nGreat place to grab a Banh Mi on the go!", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "Best Vietnamese sandwiches in town. I compare very Vietnamese sandwich to that from Hancos. The drinks and the other food are just okay.\n\nQuick friendly service. Order and pay at the counter, get your food, sit, eat and go. Free Wifi available and a few outlets. Not really a place to linger.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "Excellent neighborhood place: a delicious lunch spot with quick service. The rice bowl with roasted chicken and veggies was 8.25 but other vermicelli noodle options looked good as well! Plenty of seating.", "author": "Maddy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-09", "description": "Stopped by here while I was in BK.  Grabbed a snack with summer roll and original bubble tea.  That was July 4th weekend.  Surprised me. I've been craving the bubble tea since. It's the best bubbles I've had in a long while. The bubbles are freshly made with a hint of sweetness. The Vietnamese sandwich was good too. They have stamp cards for all types of foods: drinks, sandwiches, and soups, so start collecting.", "author": "Howie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "I go here for the noodles in broth with shredded chicken. Always super fresh and tasty ingredients. Whenever I order for delivery the broth arrives steaming hot which is obviously awesome. The salad with chicken is tasty too. My daughter, who is nine, likes their bubble tea but I don't drink that stuff, it's too sweet.", "author": "Ingrid C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-29", "description": "Decided to come here with a friend as he recommended this place for the best vietnamiese  sandwich. \n\nI ordered my first vietnamiese grilled pork sandwich. I wanted to start off without spice but instead I got spicy which was fine. As I took my first bite from the first half of the sandwich, the grilled pork tasted delicious, the long bread and vegetables where crunchy and the sauce melted in my mouth like WOW! as I got to the middle of the sandwich, my mouth felt like as if it was on fire as the spices kicked in as it was pretty strong. So strong that my eyes where red from my friend's point of view, and I had to add the soy sauce paste in the sandwich just cool down the spiciness as well as something cold to drink. What an amazing experience it was as I finished my last bite of the sandwich. Overall it was excellent and delicious sandwich and it pretty much filled me up. 5/5 stars and would recommend to all of you the readers and friends.", "author": "Kevin X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-22", "description": "Not bad at all. \n\nI went here today with a friend and got the grilled pork Bahn Mi and a Honeydew bubble tea. My friend got the beef broth Pho with beef and Taro bubble tea. \n\nMy meal was really good, the pork was nice and meaty with a good amount of sauce, the bread was toasted to perfection and I loved the way the daikon/cucumbers/carrots tasted. My only complaint is that the sandwich could definitely be better constructed. As Peter D. said, you definitely have to eat V-style. I had the veggies coming out of one end of the sandwich falling to my plate and got a huge mouthful of the ones that didn't fall but with no meat when I took a bite the \"normal\" way. And $7 for one is kinda steep, but I get that they have to pay employees, rent and other stuff. \n\nThe bubble tea was pretty good, I got so much green tea flavor that for me it competed with the flavor of honeydew, so it could've been a bit stronger. However, I did have some delish honeydew burps* for a few hours after I was done, so I guess that's a plus?\n\nMy friend loved his Pho, I thought it was pretty good too. His taro bubble tea was seriously good, it was so creamy it was on a low-grade milkshake level. When I go back, definitely getting it. \n\nPlus we scored those plush seats by the window, and were comfy af! That's how everyone should eat their food- in a nice, plush chair.\n\n\n*If you like fruity burps, this is the one for you. If not, seriously rethink your life.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-18", "description": "I was craving some warm soup to make my cold symptoms feel better. I was sneezing all day and even had to call in sick. I found this spot and ordered some pho. The broth was very oily and tasteless. I did not taste the type of broth where it takes hours and hours of prepping and cooking. The vermicelli had a nice chewy texture, however, I had to put lots of hoison and some hot sauce (can't put so much because I was sick) to make the broth to have some taste. Overall, I do not think I will be coming here again to have expensive, tasteless pho again. By expensive, I mean $12-13 for a bowl of pho..", "author": "Kelly Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "First time here, came with my Wife! Its Really Good! \nI had the Grilled Chicken Rice Entree and the rice only was worth it! It was Sweet and Soft! The Chicken Was really soft but well cooked! The Place isnt too loud either! Nice and spacious! Loved the whole experience!", "author": "Gil D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-04", "description": "Been here many times since it's a block away from my apt. Their grilled chicken is one of my favorites.. whether it's in pho, banh mi or on rice. I prefer the sandwiches over anything else but the pho usually hits the spot when you need a post-drinking or hangover cure.\n\nTheir bubble tea is pricey ($4.50) and doesn't compare to Chinatown so I usually forgo getting the BT.", "author": "Carol H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-28", "description": "- Clueless Kitchen Spitter-\n\nI've been to HANCO's a few times and I was ready to make it a regular take out spot, but then I saw something that I couldn't forget...and even worse was the staff's response to it.\n\nOn a busy Saturday night in December, I waited for my order near the front, with a view of the kitchen. I was taking off guard as I watched a chef drink from hit soup container cup and then spit out what he was drinking in the middle of the floor, near the stoves. He then went on to fill up his cup like nothing was wrong. I could not believe he was spitting ( and not small spit) in an active kitchen around open food! \n\nWhen I brought to the attention of staff, I was told there was no manager on staff... and this was a busy Saturday night?. The young staff might of been in shock , or just clueless about customer relations, because they didn't apologize, they just looked me baffled.\n\nI can not go back to place that (1) doesn't pay attention to customers and (2) doesn't manage their staff.", "author": "John C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-19", "description": "I've had the classic and grilled pork sandwiches. The classic comes with ground pork and tasted ok. It's definitely not a traditional Vietnamese sandwich. The grilled pork tasted closer to the real thing. However, I don't like the way the sandwich is constructed: the meat is on the inside and veggies on top, so it's hard to get a bit of everything in one bite. I also think the sandwich is overpriced- I usually pay $6 for the real thing. \n\nThe Vietnamese iced coffee doesn't taste as strong and authentic either. I wouldn't get it here again. \n\nOverall, this chain is ok for a quick bite, but if you're looking for an authentic Vietnamese sandwich, go to Chinatown.", "author": "Yen N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-23", "description": "Have to agree with the other reviews that the wait for your food takes a long time. Maybe I'm spoiled with the fast service that most viet places provide yet I find it hard to believe that there's 6 people staffed to work. I'm no food service guru.\n\nAnyway, don't order the bahn mi. \n\n1. there's mayo (?!)\n2. meat to veggie ratio is 3 to 1\n3. Roll is tiny but tasty (maybe I'm used to the traditional 12 inch rolls instead of 6inch)\n4. Pricey for $8+ tax ($5 normally)\n\nGood place for a quick hunger fix. Oh yeah order the rice dish instead. More meat for those who are hungry.", "author": "Christina Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-09", "description": "Love this Vietnamese spot, especially their vegan pork banh mi sandwiches and the summer rolls...yummy! The bubble teas are also great, my two favs are coconut and tarot flavors.", "author": "Esmeralda C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-15", "description": "Well... I did enjoy the beginning of my meal, it tasted great. Stopped in one evening for a shredded chicken sandwich... ended up with food poisoning, and a night hugging the toilet. \n\nIf you decide to go, avoid that sandwich... but who knows what could have caused it.\n\nNever again.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-05", "description": "A great spot for quick meals! The bahn mi's are delicious--the grilled pork and classic are my faves--and the boba is on-point! If you're looking for good bubble tea in the area, definitely go to Hanco's! So much better than Kung Fu Tea in my opinion, which tends to be overly sweet. Hanco's classic milk tea boba is awesome. \n\nAs for the pho... there's definitely better pho out there. I'd stick with the bahn mi's and rice bowls if you're looking for a bite.", "author": "Annie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "Everyone iz noice! It was a good but not amazing Banh Mi. How is everyone doin'? I had a good time at Hanco's. I wish I took pics but nah I did not.", "author": "Eliza L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "I love the classic banh Mi! First time having it with spicy mayo. That was a good touch! The meat was juicy and the bread was toasted just right . I gave a 4 bc I had asked for water and waited 20 min and had to ask again before they gave it to me.", "author": "Kennedy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-13", "description": "Came here to grab lunch.. the Classic Vietnamese Sandwich (Medium Spicy) taste amazing. Along with the Iced Coffee bubble Tea.", "author": "Amy M."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}