{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-24", "description": "The broth is so plain there's definitely better pho but i got the vegan chicken and it's actually tastes much better than usual places chicken. oh and the staff WILL scream at you if you don't hear your order when they call it (:", "author": "Leen A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-22", "description": "Probably spoiled with the banh mi in 8th ave area, but their banh mi is only 5 dollars and with a whole lot of flavor as well. The classic at Hanco's has ground pork and is $8, which is not commonly found in other \"#1's\" in other banh mis. Although the grounded pork was flavorful and juicy, I would still prefer the typical ingredients you would find in the shops around 8th ave. That includes cucumber, more pate and meat, and a less messy filling. Haven't tried the pho here, but this area overall has pricier foods. \n\nThe thai iced tea was pretty authentic imo!", "author": "Carmen W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-29", "description": "I have the chain location on Montague street 4 stars, but I had to give this location 3 stars because I found a piece of hair in my summer roll. Not on top of it... but inside after I took a bite. Wasn't too happy about that.\n\nOther than that I do really enjoy the banh no sandwiches. Similar to the location on Montague, I like that they actually use big juicy pieces of pork in the pork sandwiches. I've had banh mi sandwiches from other places that use dry ground up hard pieces of pork in the sandwiches which is not for me.\n\nGet a stamp card. If you buy 9 sandwich/pho you get one free. There's a separate card for sandwiches and pho.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "One of the best meals to have after a gym workout!\n\nCame here right after a workout at Blink. It was really crowded with only one table available, the one we took! It started emptying out as we ate our meal, but it's quite popular with the delivery and take-out orders.\n\nHad the grilled pork salad bowl for $9.50 while my friend had the beef pho and a green tea bubble tea.\n\nThe grilled pork salad bowl is HUGE, I eat a lot normally and wasn't able to finish the last bite. The portion size is huge and they aren't sparing with the meat. It's a lot of food but I still felt like it was a light yet filling meal.\n\nNo complaints about this place yet!", "author": "Vincent T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Was looking for a lowkey phô spot in downtown Brooklyn and came across Hanco's with Siri's help. My sister is visiting from MA so I wanted to bring her somewhere really good. Boy did Hanco's do the trick. The flavors were amazing in the beef phô; we both were so full but did not want to stop eating. To compliment a great meal we had a matcha bubble tea and a honeydew green bubble tea.. it was the perfect touch! Definitely coming back soon. May even become a regular!", "author": "Carlina-Soraia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "I order from Hanco's for delivery or pick up my Beef Pho on my way home from work almost once in every 2 weeks.\n\nIt is a shame that there is no vietnamese restaurant in Brooklyn Heights. I live 2 blocks away from Hanco's and this is the closest I got to Vietnamese food. For that, I'm super greatful and will continue to support their business.\n\nMy go-to orders are:\nClassic Vietnamese Sandwich\nGrilled chicken Vietnamese Sandwich \nBeef pho with all types of beef without the raw slice of beef - this is because I usually take it to go or order deliver so the broth is not as hot as what you would get if you were at the restaurant. I think the blood kind of clouds the broth as well. \n\nThey have good bubble tea beverages with so many varieties. Again, the closest I got without going across the bridge to Chinatown.\n\nOverall, they are very consistent in flavor and I always know what to expect when I order food or drinks from here.", "author": "Melanie Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-13", "description": "Super disappointed. I ordered a sandwich and went to pick up in person. They asked me for my name and the sandwich I ordered. Then they proceeded to give me the wrong order....so frustrating bc it's so cold outside, by the time they realized and called, I'm already close to getting home. They didn't offer to deliver a new order, which to me is lazy customer service. Be sure to check what you ordered bc this location will most likely get it wrong.", "author": "Kristen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-24", "description": "Good veggie sandwiches. Not great atmosphere- very crowded and often messy. Service is fine. Prices are fair.", "author": "Sylvia S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-01", "description": "I went on a Friday evening with my two children.  The place was crowded.  The food was fine, but not great - there are better Vietnamese restaurants in the city.  The environment was absolutely awful.  There were a group of 8-10 teenagers who were sitting there before we arrived and remained afterwards and were not eating or drinking anything. They were loud, cursing, and taking up lots of space.  I understand that it's a reasonably priced place where teenagers can go.  But I wish that the restaurant would have addressed them respectfully.  There were people looking for seats and no one even told them, there are other customers that had to be served or that they were disturbing the customers.  It made the evening a total bust.", "author": "Laura A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-04", "description": "I've been here a couple times and the food and service is great! I've had the beef pho and the classic sandwich-- both delicious. They have a wide assortment of teas and coffee so I always get one of those too since they never disappoint. Staff is friendly and approachable, reasonable prices, always a clean seat available. I will definitely come by more often!", "author": "Khai B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-16", "description": "Tasty food albeit not terribly authentic, SLOW SERVICE, okay prices\n\nWhy 3 stars? I ordered a drink and a sandwich and waited for 25 minutes. A cold cut banh mi can still be made in under 3 minutes even if you toast the bread and the tea I ordered was pre-brewed. Seriously, this wait was ridiculous. Even with the people in front of me who ordered bahn mis, they're supposed to be quickly assembled. Anyone who's ever been to a viet super market with a little food court can attest to how quickly these are usually assembled by a pair of quick hands.\n\nCold cut bahn mi: \n1. sandwich bread was legit Vietnamese baguette which I recognized and can appreciate.\n2. I ordered a cold cut sandwich but not only was the bread hot, the whole thing was hot (this is how I knew things were a little off). The primary meat was not a cold cut but a type of flavored meatball/meatloaf. It was quite tasty, but not what I ordered or expected\n3. The pate is either non-existent, or tastes just like plain mayo. There was no visible pate (again, not very authentic)\n4. The quick pickles were nice, but TERRIBLY distributed. I'll submit photos, and you can see how all the pickles are on one side of the sandwich. I literally had to alternate bites on the sandwich and I would get entire bites of pickles, entire bites of meat.\n5. All said, it was still tasty but for the mistakes, I'm not sure it's worth $7.25 (especially when I'm used to banh mi for just under $5)\n\nThe vietnamese ice tea was pretty good, not too sweet, and still pretty milky. Warm boba? Not my thing on a hot summer day.", "author": "Nick H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "Just WOW, had an amazing vegetarian chicken Bahn Mi.  The veggies were abundant and delicious, the bread warm and crunchy just like how I like it.  I have never had vegetarian chicken and I was impressed, I would not miss chicken if I could get this everywhere.  I also got the \"real\" chicken spring rolls, also delicious.  The accompanying peanut sauce was one of the best peanut sauces I have had.  I washed this all down with a Matcha Green bubble tea....YUM! Kinda like a drink and desert all rolled into one, soooo very satisfying.", "author": "Jeanne F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "Location: Located at Cobble Hill, Hanco is a spacious place if you choose to dine in here. Place is simple, with menu on the wall and little decoration. I was quickly processed to the reception desk where the owner expected me to know what I want. But there seemed to be so many great food here, such that I indeed had a hard time trying to figure out what I should have for dinner.\n\nFood: after a sec-careful-consideration, I chose their  vegeterial bahn mi.!!! WOW The sandwich is crispy and inside veggies are fresh as it just picked from the garden in their back yard...\n\nService: very nice. They clearly allowed you to be a first-time customer here. No rush, full consideration, and great food.\n\nOverall: good\nGreat vietnamese food if you are in the neighborhood!!\n4 stars", "author": "Tina W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-13", "description": "Pho cannot keep up with what they serve in Hanoi, but not bad, at least for Brooklyn standards.  Unfortunately they are serving the extra soy sprouts and the leaf of basil on a separate plastic plate.  This is unacceptable and frankly ruined my appetite.  Do we really need to throw away more plastic?  Do we really need a yelp review to point this out to them?  Sadly, the answer is yes.", "author": "Patrick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Love this place! I come here literally every Saturday and get the Veggie Pork Sandwich extra spicy with a bubble tea. Love the veggie pork more than actual pork here. If you get delivery they are super quick. Delicious!!", "author": "Sarbani D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "Great place to try something different! Eat in or take out, the food is the same; fresh and flavorful! I have had the chicken broth soup with shrimp. it comes with noodles, beansprouts, cilantro, red onions and scallion; mmm mmm good! I also get the sardine sandwich and the classic.\nDefinitely worth the trip.", "author": "Jonn B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-12", "description": "Because we live in a west-facing apartment on the sixth floor of our building and don't have air conditioning set up yet, we decided it's time for a staycation before we melted. So we ended up getting a hotel for the night right near Hanco's!\n\nBeing from Montgomery County in Maryland, I'm used to getting really good pho at least once ever couple of weeks. Here in Brooklyn, not so much... and not so authentic. \n\nHowever, for Brooklyn, where I don't get to have Bo Vien and tendon in my pho, this place was good and super fast carry out! I got the pho with grilled pork and the summer rolls, which were super fresh. I also got the decaf iced Vietnamese coffee which was super delicious.\n\nIn terms of stars per each item I'd give:\n- Pho: 3\n- Summer rolls: 4\n- Vietnamese iced coffee: 5\n\nI'd def go back for the rolls and would want to try the sandwiches next time.", "author": "Sahar N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "Yes, the takeout will make your apartment smell like farts but the food is worth it.  Open up a window, get that air circulation going and chow down on delicious Bahn Mi or Pho.", "author": "Samantha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "This is solely based on the banh mi. I got the pork banh mi with medium level of spice and it was extremely flavorful. Granted it was my first time eating a banh mi sandwich but I know good food when I eat them. The bread was so crispy and the carrot and radishes in the sandwich was cold and crunchy with the perfect amount of dressing. The pork was warm, tender and very flavorful with a hint of spice.before i wondered why the vegetables were separate from the meat and now I get it. The cold from the slaw and the warmth from the pork married well on so many levels.", "author": "Achiaa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-08", "description": "Sometimes you just gotta get your Banh Mi sandwich game in check. And Hanco's fits the bill. I used to get the grilled pork, but have since locked my sights on the CLASSIC Banh Mi Sandwich. Why you ask? Because the crumbly goodness of the ground pork, that is why! And you know what I also enjoy? Licking all those lil crumbled morsels, that couldn't be contained in the crispy bread boat, off the paper. Judge not!....unless YE BE JUDGED, unless you are one of those \"classy\" eaters, then judge away.....and actually let me lick your paper.\n\nI finally got to try the Beef Pho. And really it left me a bit underwhelmed. My issues were it wasn't the most flavorful pho broth I've had and second it had TONS of cartilage. I wasn't shocked to find it in a Vietnamese dish since it is often used, BUT I ordered the beef. It should be the SPECIAL or TRADITIONAL if its going to be anything more than the beef. In my case, my wife is more Barbarian than I so she ate each jelly/bone textured bit. I gag just thinking about it. Therefore I will pass on the Pho in the Phuture.\n\nLesson of the day: GET the classic banh mi and let your Barbarian wife chomp on cartilage....SAVAGE.", "author": "Mike S."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}