{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-30", "description": "The food was good as it had been in the past but the staff was incredibly rude, giving us dirty looks just bc we were a little wet from the rain. They laughed among themselves but had not even a faint smile for me when I ordered a bunch of food, and they ignored me and then gave me a scowl when I asked for a plastic bag for leftover food. I guess I'll go to the other comparable Vietnamese soup and sandwich spots for now on. Sorry, you guys suck.", "author": "Andrew W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "Good pork sandwich. Spring rolls were OK. In hind site sandwich would have been enough.", "author": "Tom D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-10", "description": "There are 163 reviews and I clearly don't need to sing its praises but I've never been happier with a sandwich and I loved it so much that I wanted to give it its 164th review.\n\nBe warned: spicy means SPICY.\nIt took us a bit to realize there were jalapenos in the sandwich and we were adding sirracha and my mouth was on fire (in a good way)\n\nIt's a shame though they're only open until 7:30 on sundays.", "author": "Chie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-26", "description": "Tried this place for lunch.\n\nAmbiance is that of a dump, but don't let it fool you.  The food is amazing.\n$7 for a nice sized classic viet sandwich with plenty of sriracha and a bottle of water to cool the flames.\n\nTake a chance in this place. Totally worth it.", "author": "Nicholas G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "now that was good. I have never had a Banh Mi sandwich before so this was the perfect spot for Jim and I to hit up before attending the Yelp Elite event.  For $5.50 you get a generous helping of spicy ground pork, carrots, cucumbers, pate and Vietnamese  ham. I mean this sandwich was literally bursting at the seams.  The addition of fresh cilantro was also a great touch.  \n\nThe restaurant is small and modest but busy.  Service was prompt and efficient.  I recommend this spot for a cheap and tasty meal.", "author": "Natasha U."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-19", "description": "I had their coconut bubble tea, it was horrible. But boba was hard as if it had been out for days, and the tea it self tasted burnt and it was barley sweetened. I was disappointed to know that they did not serve warm bubble tea, since it is cold outside. Many other bubble tea places that I have tried have been much better, for a better price, and have had both hot and cold bubble tea options. I did not try anything else in the restaurant but the place did smell nice and was very nicely decorated.", "author": "Adrianne M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-13", "description": "I make it a point to try new restaurants in New York as much as I can, but I just can't stop coming back to Hanco's. My boyfriend and I discovered this gem a few months ago thanks to Scoutmob. It's our #1 lunch destination now and we don't even live in the neighborhood. (Yet. There's serious talk of moving to Park Slope, and the time we've spent there following meals at Hanco's is responsible for it.)\n\nI always get the tofu banh mi, medium spicy. I had the full spicy my first time and it was pretty delicious until the last couple bites. I guess all the spicy mayo sank to the bottom and upon taking my last bites I literally felt like I had gotten some sort of chemical burn on and in my mouth. I'm no wuss either, I love me some spicy food.\n\nHanco's definitely beats out copycat Henry's down the block. (NPR even did a bit about the blatant rip off: http://ny.eater.com/tags/hancos) I'm ashamed to admit that I did try Henry's once out of curiosity, and although they offer more fake meat options (Hanco's only has fake pork), it just wasn't as delicious as trusty Hanco's. Also, Henry's seating area is tiny and it just generally lacks the friendly and comfortable atmosphere that Hanco's offers. Perhaps most importantly, the bubble tea at Henry's wasn't as good. The almond bubble tea tasted pretty much like plain milk, and my boyfriend didn't much like his coconut bubble tea (although I did. It tasted more like natural coconut milk and less like artificial flavoring. Just a matter of preference, I think.)\n\nHanco's sandwiches are a dollar or so more expensive, but it's worth it. Plus they give you a stamp card that gets you a free sandwich and bubble tea after the purchase of nine.", "author": "Brady Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-23", "description": "Great banh mi sandwiches!  This very small, unassuming place in Boerum Hill is actually a delight.  I chose a traditional banh mi sandwich which I took to be spicy.  The ingredients were of good quality.  I was particularly impressed with the very fresh cilantro.  The ground pork was nicely spicy and very flavorful.  I loved the pate, and the carrots gave great texture.  The bread itself was a touch untraditional though.  Not quite a traditional baguette, but the added texture was still there.  Definitely recommend it.  I additionally had the Vietnamese coffee, but I couldn't drink much of it.  I typically take my coffee black and prefer it strong, so it being sweet was something I just couldn't allow myself to get used to.  Oh well.  I still had a great time!  Be sure to check this place out if you are in the neighborhood.", "author": "Jim U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-19", "description": "Bubble tea is all I got here. They have a loyalty program for bubble tea and banh mi. Interesting. The tapioca is served hard here without much sweetness. The drink flavors are the standard fare. But this is the place to get bubble tea in Park Slope so if you're around I'd come here.", "author": "Mary P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-28", "description": "I've had the Veggie Pork and the Veggie Chicken Vietnamese sandwich and salad. I love them both; but i prefer the veggie pork. Tip: get the salad to take home and make sandwiches with your own rolls, you'll end up with 2-3 for the price of one... \n\nWe had a bubble tea one time that was bitter and just kind of \"off\" tasting. \n\nIts a little cramped quarters. You can order mild, medium, and spicy which is great!", "author": "She Eats Real F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "Excellent food, very good service, and lunch for $7. What a find! The vegetarian pork Vietnamese sandwich a must!", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-18", "description": "They really do turn out one of my favorite Bahn Mi's in the city,", "author": "Thomas H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-18", "description": "YUM!!!!!\n\nMy bf had the pork bahn mi and I had the vegetarian chicken one. I'm a pescetarian and so I'm so glad to find a bahn mi place that caters to this. Delicious! Love this little joint! We will definitely be returning!", "author": "Carmela B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "Cheap, easy, excellent viet sandwiches that are overpriced but good. Same with the boba tea. Good but overpriced. What can you say, you're in cobble hill, you've got to expect to pay an extra dollar or two. Also bring cash, they don't take cards.", "author": "Matt D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-11", "description": "Hanco's sandwiches are just the best. I've been to this location and the one on 7th ave and 10th Street in Park Slope, and they never disappoint. My personal favorite is the tofu, medium spicy with no mayo. But the classic, is, well - classic. I'm from Seattle, a veritable Banh Mi mecca (if you'll excuse the cultural cross-reference), and Hanco's gets five stars. Cash only!", "author": "Claire M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-16", "description": "Delicious! Super flavorful pork banh mi and they made it spicy like I asked. Fresh veggies, good size sandwich. A good deal for $7.", "author": "Molly R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-17", "description": "Came here after listening to an interesting sketch on NPR's \"This American Life\" involving Hanco's.  It's difficult for me to find banh mi I like in NYC, but Hanco's is a great option.\n\nI liked the Pork Chop banh mi more than the classic.  Full of meat and veggies (shredded carrots and turnips) on toasted bread, nice and crispy on the outside.  Order spicy for a nice kick.  Their bubble tea is expensive, $4+ for a 16 oz.  Not familiar with the Brooklyn market pricing on boba, but guess that may be one thing that costs less in Manhattan!", "author": "katie j."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-07", "description": "A solid vietnamese sandwich option in the area. I'm vietnamese. That should say plenty. Also probably the best bubble milk tea I've had in New York although not good in the world of milk teas. It's better on the west coast by a lot. Just keeping it in perspective.", "author": "Alex D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-08", "description": "this is a consistently good bahn mi. \n\nI also always ask for mine extra spicy, and they never disappoint (although if I do this, I think they use jalapeno or some other spicy pepper and then I can no longer add siracha... because in my mind (possibly unfoundedly) they're different kinds of spicy and they'd clash. I also like adding siracha to everything, so this always poses some internal conflict.).\n\nI'm a bahn mi traditionalist, so I've only ever ordered the classic here, but there are still hopefully a couple of tidbits I can add to contribute something to the discourse:\n\n1) when you get the sandwich, position the bread with the opening on top, push it down, and close the opening by pushing the sides on the top together. this corrects the lop-sided ingredient distribution while maintaining the stability of the sandwich. I don't know that anyone else has figured this out yet.\n\n2) the bubble tea is good... the vietnamese ice coffee is better, especially if you go the extra-spicy route on the bahn mi. nothing cuts through a really spicy bahn mi like a milky/sweet ice coffee.\n\n3) last time I was there, they had a wheat bread option!!! \n\n(I guess you can ignore that bahn mi traditionalist comment from earlier, because I'm a sucker for wheat bread.)", "author": "Jake D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-19", "description": "This place has the best taro boba milk tea I have ever had. My fiend had the limeade, which was obnoxiously good too.", "author": "Ms. S."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}