{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-01", "description": "Best bahn mi in NYC hands DOWN. The food is consistently delicious and fresh. Bubble teas are fantastic. I've tried other places both in NYC and around the country and nobody comes close to Hancos in BK. Just the best.", "author": "L I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "Vegan options available. Had the vegetarian-pork Vietnamese sandwich; tasted fresh. Service was friendly.", "author": "Genoveve R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-26", "description": "Best sandwich in town. I think I have dreams about their shredded chicken sammie and spring rolls. Gah. I miss this place so bad.\n\nGo here. It's the best, seriously.", "author": "Jackie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "I ordered the thai bubble tea and got the peppermint bubble tea instead lol. I guess I was misheard. Any who, I decided to take my drink anyway and man WAS IT GOOD. They ask you if you want it sweet/unsweeten and cold/hot. Also, the place is relatively bigger than the one on Montague street. I will definitely comeback and order my thai tea next time haha.", "author": "Ani T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-16", "description": "The store was clean and comfortable. I ordered the Pork Viet Sub for $7 , it came piping hot and Tasty. I will be back to try other dishes.", "author": "Alex W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-08", "description": "First of all, does anyone know why this place smells AWFUL??? Every time we go we can't get over the terrible sewage like smell. Other than that the sandwiches are amazing!! Best for takeout so you can avoid the smelly dining experience. Note: the summer rolls leave a lot to be desired. Definitely check this place out.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-06", "description": "Great Bahn Mi sandwiches, I have been twice, Had the Pork the first time and the classic the 2nd time which has ground pork sausage which is kinda unique and very delicious. All the produce seems very fresh and the Sriracha is not watered down like a lot if other places.", "author": "Rusty S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-26", "description": "The food is usually good when you find something you like but horrible just terrible service. Delivery is never on time, the employees are rude most of the time. I called to check on my order and was asked repeatedly what my problem was, even though I had already expressed my complaints. I was also hung up on. They are overpriced for the portion you get. Decent sandwiches just does not make up for horrible service!! Last time ordering", "author": "Malu C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-02", "description": "I live around the corner from these guys and they are a regular neighborhood stop for me now. Especially since they moved to bigger premises with more and better tables.\nMy staple was the Pork Sandwich on wholewheat bun medium spicy but more recently I've started ordering the Pho soups. I've decided the Pork Pho is my favorite.\nService can be a little chaotic when they are very busy but minot gripe. Overall it's great.", "author": "Mark E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "The perfect lunch food.  This is all you need to read because everything else I say will just reinforce that thought.  Grilled pork sandwich spicy.  Done.  Grilled pork, amazing.  pickled veggies, different texture, very complimentary.  slightly toasted bread, perfect vessel to deliver the food.  All this is enough to make me go there several times a week.  But wait... there is a treat... bubble tea.  Almond tea with skim milk and tapioca balls, sweet and fun.  After this lunch you will feel rejuvenated to attack the rest of your day with gusto.", "author": "Agapito G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-16", "description": "This place has really fresh bread for making the sandwich. I thought classic was good, but didn't seem worth it for the amount they charge per sandwich. I would be just as happy buying an average viet sandwich in chinatown for cheaper.", "author": "Joanne D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "No atmosphere but we usually order delivery. Food is superb: Summer rolls, salad, banh mi, and beef pho! Great dinner for two. Reasonable prices. All food is tasty and comes with condiments. Sandwiches come in varying degrees of spice!", "author": "Marty F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "Love this place; wish there was one in Manhattan.  Vegetarians and people eating less meat will be happy with all the veggie friendly options.  I've had the tofu, veggie chicken and veggie pork banh mis and they were all great.   Bubble teas are good too.", "author": "Alison L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-21", "description": "This is the type of place you would walk past and really never think of stopping in except if it says Vietnamese food, I'm going in cause it's an addiction. That and the recommendation came from a foodie friend.\nI've been dying to try the bahn mi and it was a toss up between the Classic (roasted ground pork, vietnamese ham, pate, mayo, butter, cucumber, pickled carrots \u0026 daikon radish and cilantro on a toasted french baguette) and the grilled pork but I figured for my first time I wanted to go with the staple of the menu and go Classic. I took a seat in one of the 6 small tables and 3 minutes later I realized I made the best decision in the past month of my life. SWEET BABY JESUS!!\nFirst off, go hungry! For $6 you get quite a large stuffed sandwich that will really fill you. I usually take a pic of my food but I was starving and as soon as I unwrapped it I couldn't wait. The bread, unlike other bahn mis, is toasted which holds up to the juices from the pork and doesn't fall apart. Every bite is like fireworks going off in your mouth from the different tastes and textures. The crispy warm bread, the deep Asian flavors of the meats along with the heat (I ordered mine medium because I must add Sriracha so I knew that would give it another bump) then you get the crunch and coolness of the bright, pickled veggies and cilantro. This is one of the best sandwiches I've ever had....really! \nI must go back soon and give the grilled pork a try. This place is a GEM and worth the trip from even NJ or further!", "author": "Monica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "I really love the green tea matcha with boba. It's a really good balance between bitter and sweet.", "author": "Steve F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-24", "description": "it's amazingly delicious.\n\nBUT i'm not sure why they can't seem to hold onto an A rating form the health dept. it seems clean enough to me...\n\nnonetheless they tend to rock a B a little too often for my comfort. \n\nyet, i still go there all the time.", "author": "Justin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-22", "description": "new spot - same great sandwiches! a favorite take out joint in the neighborhood. \ngreat for lunch or dinner (and one of the few cheap options left in a neighborhood who has a barneys and rag and bone in a few block radius) - i had had every sandwich on the menu, along with every bubble tea and can vouch for them all. \ni don't think Hancos are doing anything spesh just serving good, plentiful ingredients on a decent bun. what more do you need?", "author": "Maia D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-03", "description": "If my coworker were reading this--and she might be--she's going to be rolling her eyes hard at this review, because I am once again going to review an establishment based on a secondary menu item, rather than the premiere menu item. Yes, I am reviewing Hanco's based on their sardine sandwich. \n\nHere's why: the classic banh mi is a good thing. But it's also a thing that's hard to get wrong, in my opinion. There's the standard ingredients organized in the standard way, and diners are happiest when the banh mi conforms, rather than flouts, expectations. So better to try the menu item that allows a Vietnamese sandwich shop some flexibility. Like the sardine variation!\n\nAt the banh mi joint in Park Slope (Lotus, I think?), the sardines are very nearly whole. Just nice, savory filets laying in some spicy sauce on a bun. Good. At Hanco's, the sardines are a little more mashed up with some spicy mayonnaise. That is also a good approach, although it means you have to each your sandwich quickly before the bread gets too soggy.\n\nSo by my glancing estimation, Hanco's is good enough for me.", "author": "Pamela B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-12", "description": "The veggie pork here is delicious. Unfortunately that love affair died last week after my friend found a worm in her sandwich. If you do eat here, get the banh mi WITHOUT cilantro.", "author": "Jeanna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-10", "description": "this has become a weekly tradition for our office now because hancos makes the most banging sick 360 flip shredded chicken pho on the planneeetttttt!\n\nshredded chicken - like a guitar solo from 1980 hair metal band 'bubble tea your face'\n\nmocha latte bubble tea - tell starbucks to bury themselves alive because this is the new air you breathe\n\nsriacha sauce everywhere - light your inside on fire with some rooster juice\n\nhancos - for the brave and the bold", "author": "Shaun H."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}