{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-26", "description": "I love Hanco's and usually order the rice vermicelli with tofu -- it's the perfect light meal and the tofu has a nice honey sweetness to it. I'm also a fan of the tofu sandwich, everything about is so fresh and delicious. My biggest problem with Hanco's is that they consistently mess up orders! I really wish they were on seamless, it would make life so much easier.", "author": "S K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "good food, not expensive, worth checking out.\n\nThis is my new favorite bahn mih place in nyc.  Not sure but the french rolls seem either homemade, or really fresh.   They have vegan pork, vegan chicken, and tofu , so it's great if your veggie.  I tried the vegetarian chicken and found it to be a bit chewy.  Loved the tofu banh mih though.  Beware: If you ask for it to be spicy, it will be spicy.  The prices are fair, and it's right off of the F/G Bergen stop.", "author": "J C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-30", "description": "Their spicy tofu sandwich is off the hook!  They lose points because you have to wait FOREVER to get it ... but I keep coming back.\n\nMost items on their menu are $5.25, and their bubble tea is one of the best in the city and also cheap ($3.50) , plus they will make it with soy milk for no extra charge.\n\nThe menu has a bunch of carnivore options which (i hear) are also great.   Perfect on a summer day in the Brooklyn heat.", "author": "Craig R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-17", "description": "This location is not really a Vietnamese restaurant, it's just a Banh Mi and bubble tea shop.  The Banh Mi is actually very good, and I always get mine with that extra butter, I know, fat boy chillin', but it is good.  They should have durian shakes, though and they don't.  Where I'm from you can only get Banh Mi on weekend mornings and it's like a special treat, so the idea that you could get Banh Mi 7 days a week if you wanted just blew my mind when I got to Brooklyn and I think I had one every day my first week in New York.  Conveniently located right on the G too.", "author": "Steven B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-26", "description": "Somehow I've lived this long (and that's a pretty long time), and even honeymooned in Vietnam, without ever experiencing the yummy deliciousness of a banh mi.  Thank goodness Hanco was here to relieve me of my virginity.  So good we dined here three times during our stay in Carroll Gardens - and we felt oh-so-cool when we were informed that Hanco's was the subject of a This American Life piece recently.  \n\nThe banh mis were excellent, served on warm, fresh rolls with the freshest of fillings, and the vermicelli salads were light and perfectly seasoned.  Everything is made to order, and they have a great selection of magazines for those who decide to dine in.  If I lived in the nabe I'd be a regular for sure - and now that I've been turned on to banh mi, I can't wait to find the Hanco's equivalent in SF.", "author": "Katy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-07", "description": "It's nice having a Vietnamese option in the area but it pales in comparison to the superior (and cheaper) spots in Chinatown.", "author": "Albert S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-27", "description": "Wow: if you want banh mi, this is your place.  The sandwiches are large, the service is great, and I can't get enough.  Hanco's, you had me at \"hello.\"", "author": "Raphael R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-22", "description": "I love this place. The speedy service, delishious white meat chicken banh mi, off tha chains,fresh, veggies, way bettah than a Subway sandwich. You bettah believe that I will return to Hancos. Just thinkin' about that sandwich makes my mouth drool.", "author": "Carlos C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-27", "description": "Ever get the feeling that you absolutely must ingest a Vietnamese sandwich immediately or suffer the consequences?\n\nThis condition affects many people (maybe even some of your friends and loved ones). I have been known to experience this feeling from time to time. \n\nHanco's does a pretty good job of helping me out. If it were closer, I would go more often. I usually get the pork sandwich. The meat is tender and tasty - not dry like I've had in other similar sandwiches. The veggies are plentiful (but could use a little more pickling). The mayo level is good too. The bread is soft and chewy, and I'm ok with that. I was also impressed that when I ordered my sandwich spicy, they sure as hell made it actually spicy. Many places say spicy but really mean mild (which is not ideal for someone who looooves spicy food). Hanco's loaded up my sandwich with some tasty peppers that did the job. Good work!\n\nThis place is great for biking over and picking up a quick meal to go. Definitely a place I plan of visiting more often...", "author": "G S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-02", "description": "This is my auntie's favorite spot for bahn mi.  I ordered the grilled pork and it was delicious!  The chicken wasn't bad either but the pork was more flavorful.  I had also ordered a bubble tea which was just ok.  It was a little watery compared to other places.", "author": "Christy A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-01", "description": "This place just isn't the same as it used to be when they only had one location. The flavors are muted and the pickles fall flat. Still okay for a quick bite, but I wouldn't go out of my way for anything on the menu here.", "author": "Ginny B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-30", "description": "\"It'll be eight dollars.\"\n\nWithout really thinking about it, I pulled a ten from my wallet and handed it to the mousy looking cashier. It was only after grabbing a seat that I realized how much my meal cost.\n\nEight dollars, really? I thought to myself. Eight?!\n\nOf course, an eight dollar meal is rather a steal in New York, a city where bars have the balls to charge you that much for a beer. But I didn't order a fancy microbrew or anything fancy-- I got bahn mi!\n\nFor the folks who never got to try the dish, bahn mi, or Vietnamese sandwich, is a baguette sliced lengthwise and stuffed with some sort of meat and ribbons of pickled carrots, daikon, cilantro, onion, and jalapeno. Bahn mis are not only absolutely delicious, but they're also usually really cheap, something like $4 or less for a sandwich (I really like Saigon in Little Italy-- $3.75!). In fact, my love for bahn mis began in high school, because I realized that the local Vietnamese place sold sandwiches that were half the price of Subway subs but infinitely more edible.\n\nIn disbelief, I checked the Hanco's menu-- $5.75 for pork bahn mi, $2.25 for Vietnamese iced coffee. This better be damn good, I thought.\n\nHanco's is a tiny, but busy Vietnamese shop on Bergen Street and Smith. When my friend and I visited on a cold January afternoon, we were first met with a long line. Oh no, I thought, I'd hate to be without tables and be forced to eat outside in the cold. Luckily for us, most of the people in line were ordering to-go, and after ordering, my friend and I were able to snag a small wooden table in the rather crowded dining space.\n\nLooking at the growing line, I began to imagine that maybe Hanco's charged $2 more than I expected because their sandwiches are that much more delicious. Hanco's already had a strike in my book for being expensive, but that could easily be remedied by an exceptional sandwich.\n\nSo we waited. And waited.\n\nAnd waited.\n\nBahn mis, like your deli sub, usually take no more than 10 minutes to be made. At Hancos, my friend and I waited an excruciatingly long 30 minutes as we sat in the overheated shop listening to three 13 year old girls talk about boys. I winced every 30 seconds realizing I used to say the same exact things.\n\nWhen the food finally arrived, both my friend and I dove for the hot sandwiches. Just as I was about to take a bite, my friend commented, \"aren't these things suppose to be on a baguette?\"\n\nWhile there isn't a cardinal rule that states bahn mis have to be on a baguette, the hero-roll type bread that the sandwich was made with was a inferior substitution. Not only was it smaller (less food), but it didn't offer as many texture variation as a baguette (who am I kidding? I, like every other girl raised in America, love a good baguette. End of story).\n\nI hated the sandwich from Hanco's. It wasn't just the bread-- it was everything! While the grilled pork was well cooked, it had that distinctive Chinese food flavor to it that I couldn't shake off. While I'm not a stickler for authenticity, I hated that this flavor ran foul with the cilantro. And unfortunately, because their bahn mi spread used way too much mayo, I couldn't even taste the vegetables other than the cilantro and the jalapeno.\n\nThis already made a really bad sandwich, but what I really hated was their \"spicy\" sauce which was just Sriracha sauce. Had I known that their spicy sauce was just that, I would have gotten the regular and added the sauce myself, instead of being forced to eat a sandwich in which the hot sauce was indiscriminately poured on.\n\nAnd here we come to the embarrassing point in the story. I came here while my lip piercings were still somewhat fresh... and I got Sriracha sauce in.\n\nI almost cried.\n\nHanco's-- bad expensive sandwiches that makes girls cry.", "author": "Sienna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-16", "description": "I am not a Vietnamese sandwich expert.\n\nThese sandwiches are awesome.  Period.  You don't have to be an expert in anything to get this.  The first time I dropped in, I got the Classic spicy \u0026 I kept thinking about it until I went back to get more.  Such fresh and tasty flavors...the pate is scrumptious \u0026 it's overall bangin'...\n\nThe vietnamese coffee is authentic (wonderful iced), and the bubble milk tea is really good--the tapioca pearls taste non-fake \u0026 while it's sweet, it's not overly sweet nor watery.\n\nThe first time I got the summer rolls they were delish.  I got them a second time but had to return them bc they smelled off...but it was prob the hottest day of this summer so I forgive them.  Unless it happens again, which I am optimistic it won't.\n\nIt also makes me happy that this place is in Brooklyn \u0026 that it's so easily accessible by the F/G train.\n\nKeep up the yummy work, Hanco's!  I am a definite fan.", "author": "jay n."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-23", "description": "The \"Classic\" Banh Mi is a genius marriage of flavors and textures. The deliciousness of this $6 sandwich beats out expensive meals we've had at many posh restaurants.  I just wish there was a bit more seating. No matter... I'd gladly enjoying this sammie again even if I had to sit on the curb.", "author": "Unda U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-20", "description": "This is the only Vietnamese banh mi shop I've been to that has proper Vietnamese coffee. And they don't mind adding extra condensed milk for me, either, which makes me extra happy. That, plus the fact that the original sandwich is ABSOLUTELY FREAKING FANTASTIC (just enough crunchy, fresh vegetables, moist and seasoned ground pork, and a kick of spiciness!), are all reasons why I will go out of my way to Brooklyn to pick up lunch. \n\nYeah, there's not really a lot of room to sit, and yes, the shop is really tiny and awkward, and if you drive, the parking in the neighborhood is a crapshoot, but WHO CARES? Just go and get a sandwich and you'll understand. It's allllllll worth it.", "author": "Tina L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-17", "description": "$5.25 for banh mi?! Toto, I've a feeling we're not in Kansas any more. \n\nI'm used to paying $2.50-3.50 for banh mi in DC and Boston. Excellent banh mi, to boot. And usually if you buy 5, you get one free. At $5.25 per banh mi with no volume order discount, this banh mi had better contain kobe beef, foie gras and filet mignon. Alas, it did not.\n\nI had the classic with medium spicy sauce, extra butter, no veggies. The roasted ground pork made the banh mi very sweet. The vietnamese ham and pate tasted fresh. The baguette was too chewy. It was a few inches shorter than the average banh mi but it was packed with meat. It was very flavorful but I feel like Hanco's caters to a western palate. \n\nThe owners of Hanco's speak my language and I'm not Vietnamese. It's Cantonese-owned and run which further detracts from the authenticity. The place is small but efficiently run. There are a few small tables.\n\nHanco's seems to be the only banh mi shop in the hood so hopefully more will pop up soon to drive the price down.", "author": "P W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-25", "description": "At first glance, this may look like just a sandwich shop, but Hanco's serves up the type of food that will haunt you. In that maddening craving, dream-about-it way, not the haunting you get when you go out of town to visit less than gourmand relatives and get stuck eating at Chilis. \n\nThe classic is a large, crispy crust baguette piled high with pork, vietnamese ham, pate, cilantro and marinated carrot and daikon salad. At less than $5 a pop, it's the best bargain on this block and tastier than most of the other offerings nearby. \n\nThe bubble tea is loaded with boba -- Hanco's serves up at least double the portion of chewy, tapioca beads as Beard Papa. You can't beat that with a stick. Maybe a really fat little straw, but not a stick.", "author": "Emma S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-11", "description": "Good bubble tea but their sandwhichs arent as great as people say. The atmosphere is good and the original black tea is delicious. Seating arrangement is a bit limited .\n\nThe sandwich at this place are wacky. Either they can be good or really sucked. I got this microwaves chicken in my sandwhich that smelled kinda bad. Not a fan anymore....", "author": "Hudson K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-28", "description": "Yes.\n\nGather four people, a bottle of Sriracha, beer and water. Proceed:\n\nTwo classic Vietnamese sandwiches, spicy.\nTwo sardine sandwiches, medium.\nThree chicken salads.\nTwo summer rolls.\nExtra peanut sauce.\nFour almond milk teas. Bubbles optional.\n\nHunker down at Carroll Park, share your delicious food, and enjoy Brooklyn. Goddamn, I love this town.", "author": "Miguel d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-11", "description": "About a year ago I was looking for apartments in Carroll Gardens and the broker was telling us about spots in the neighborhood. I had been to the neighborhood for years, but had never noticed Hanco's just off the very busy Smith St by the F/G Bergen subway stop. The broker claimed Hanco's had the best sandwich he had ever eaten in his life. At the time I shrugged it off, but found myself in the area a couple weeks later and decided to give it the test. After all, how good can a sandwich possibly be?\n\nI ordered the spicy chicken sandwich and it was absolutely amazing. Not just amazing, but amazing. As in, amazing. \n\nSince that moment every time I think about Hanco's I immediately begin salivating like a rabid dog. Ok, that's probably a bad metaphor. \n\nI've since tried all of the other sandwiches on the menu as well as several of the appetizers. I highly recommend the spring rolls. The mango bubble tea is very good as well. \n\nAnyways, go here.", "author": "Andrew Z."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}