{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-13", "description": "Picked up a grilled pork and rice plate and summer roll and literally it was just a minute from when I placed my order and they called out my number.  Maybe it was because they were closing in 45 minutes or just amazingly efficient.  It was still warm when got it home and very tasty.  I do like their summer rolls but truth be told, if they had fried spring rolls, I would be there every day.  There's a good choice of bubble tea but I have to be in the mood and it has to be milk free.  All in all, good fast food and convenient.  This Hanco's just a half a block from the Bergen Street subway on Smith but wish they could stay open just an extra hour for us late eaters.", "author": "Wailana W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "Best Vietnamese sandwiches around! I always get the shredded white meat chicken, on a whole wheat baguette, and ask for extra spicy. So delicious, fresh, and filling! Hanco's never disappoints!", "author": "LeAnn L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "Awesome vermicelli salad. Curious if I could ask for less noodles and more lettuce and veg next time. And maybe some bean sprouts. Would be interest to know if they would give me spring rolls on my own plate instead of the plastic container they use.", "author": "A. L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "Came here with my two coworkers last week, after one of them raved about how delicious their tofu bahn mi was. I have never tried a tofu bahn mi before, so I was so excited to eat it!\n\nI have to say that their tofu bahn mi was fantastic, but wish there was more tofu in the sandwich. The sauce was delicious and complemented the sandwich. I also ordered the classic bahn mi, which was delicious as well (super meaty). But when comparing it to my most favorite bahn mi shop (Ba Xuyen), Hanco's didn't beat it. But nonetheless, I really enjoyed the tofu bahn mi and the classic bahn mi. If I am ever around the neighborhood, I would definitely come here to grab the tofu \u0026 classic bahn mi again. YUM!", "author": "Sandra S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "Very authentic Vietnamese restaurant/cafe.  I really like the chill atmosphere and the service is wonderful.  I have had many dishes here but I always keep coming back for their Vietnamese coffee!  It has a kick that reminds you that life is happening all around you.", "author": "Amorsolo D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-13", "description": "That classic bahn mi was pretty damn tasty. \n\nI'll be the first to admit I'm not a huge fan of the bahn mi's out on the east coast. I went to college near Westminster, CA which means amazing bahn mi's for a couple of dollars. But, my quest to find a tasty bahn mi ended up leading me to Hanco's. I think my sandwich was like $7 or $8 which is still under 10. and 5 dollars is like 10 in new york so I'll just say that it was a decent deal. \n\nThe sandwich had all kinds of meats in there, great consistency and mixture of who knows what. The sauce that's in there is really what did it for me though. Bread was crunchy and good and didn't scrape off the top of my mouth like most bahn mi's do. \n\nIt was a really good meal and I would definitely go again.\n\nEnjoy!", "author": "Kevin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "I love a good bahn mi and when I saw the packed storefront as I walked passed, I couldn't help but stop. Tried their roast pork to go and thought it was very solid. Could have been a tad bigger but amount of pork was sufficient for the reasonable price of $7. The thai bubble tea was decent but not great. Probably a little heavy on the milk. Good lunch spot nonetheless!", "author": "Ricky Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-16", "description": "Mehhh. I've had much better pho. \nMaybe the banh mi's are better? I had the grilled chicken with beef broth noodle soup. \n\nThey kinda skimped out on the noodles and the broth was mediocre. It wasn't oily and tasted okay. The Vietnamese coffee was good! I like that it's self service so it's more efficient for everyone. \n\nHowever, I like my pho with a lot more flavor and definitely more noodles. The soup was overpriced and I've had yummier pho at a more affordable price at other restaurants. This one seems to just cater to its neighborhood patrons.", "author": "Sohee C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "Just moved from Brooklyn and this neighborhood staple will be sorely missed (it was actually my very last meal in NY before leaving). Prices are good and service is quick. Great lunch or other quick eat. You can bet your bottom dollar that I'll be back here when I return to NYC next!", "author": "Andy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-19", "description": "Really like this location.\nEveryone is friendly, there's lots of room to sit and relax-which is good because this place gets crowded.  \nTheir teas and sandwiches are delicious and, like all the best places, you can customize your tea.\nOnly thing that stops it being a five star is I work in Chinatown so I've had a lot of great tea and banh mi...after a while, it's hard to decide who is the best! I'll have to come back and try some of their other dishes.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-19", "description": "I frequent this place and usually they do a descent job but the last few visits, the food was not up to par.\n\nThe Grilled Pork Sandwiches (5) that I ordered today was dry and the bread was not fresh. The worse sin was the Green Tea with Honey Bubble Tea. It was watered down tea and you could not get the Green Tea Taste. At $4.50 a pop for tea, they should not be cheating on the quality.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "It was sooooooo cold out and I was HANGRY! I've been wanting to try Vietnamese food and saw this place so I stopped in. \n\nI ordered the grilled chicken Pho which was perfect! Huge though. Geez, I could've fed my family of four with this meal. The broth was tasty and the basil included gave it such a great flavor. This was my first time having Pho and I have to say I'll order this again for sure. \n\nThe place has amble space which is great. They have a lot of items to chose from which I hope to try next time I'm in the area. Service was good too.", "author": "Jessica R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-04", "description": "Quite possibly the worst location in Brooklyn.  Was craving bubble tea so went to the Smith St location.  Upon entering, the placed smelled like the garbage seriously needed to be taken out.  The staff were rude and my taro was chalky and gross.  Wound up throwing it out after a couple sips it was that bad.  There are numerous locations of this Vietnamese snack/ tea place but this location is best avoided.  Dirty, rude and bad inferior quality.", "author": "Anthony G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-18", "description": "Good food and a lot of it for what you're paying. The spring rolls and strawberry bubble tea are a go to if you haven't been there before. It's a perfect place to study and relax as well. A long time favorite.", "author": "Hannah D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-21", "description": "I'm officially obsessed with Hanco's vermicelli bowls with vegetarian chicken. I always order this when I'm in the area.\n\nPro-tip: When you dine in, you get a LOT more food than what fits in the to-go container. I learned that today when I decided to enjoy a late lunch here.\n\nThe vermicelli bowl is filled with cold rice noodles, a big bed of leafy greens on the bottom, jicama, carrots, cucumbers, delicious fake chicken (seriously tastes so good), crushed peanuts and garlic chips.  It comes with fish sauce which I pour all over and this bowl is seriously the tastiest thing.  Incredible filling for a meal less than $10.\n\nGo here!", "author": "Alyssa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-13", "description": "I take Hanco's for granted - whenever I order a sandwich at a place that isn't hancos, I'm always disappointed. Can't go wrong with a mild grilled pork sandwich on white with hoisin sauce. Sooo good.", "author": "A L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "Hanco's is hands down the best Vietnamese food around. Everything on the menu is fresh and delicious. Coffee and teas are amazing. Staff is nice and delivery comes super quick. I don't have 1 bad thing to say about Hanco's!! A must go!!", "author": "Bryn H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "My mom and I come here practically every week. She LOVES her shrimp vermicelli and I'm addicted to the classic bahn mi sandwich. Can get quite crowded at times and be hard to get a seat, but the food is well worth it.", "author": "Liana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-07", "description": "Hanco's\nNY Brooklyn Cobble Hill\n1pm Thursday 7th May 2015\nFive Stars\n\n\nIt's best $15 meal that you can get. I am so ridiculously full right now. I had the vermicelli salad with grilled chicken ($8.75). There was Plenty of Rice Noodles, Lettuce, Cucumber And Mint Leaves. It was then topped with Roasted Peanuts, Fried Red Onion and served with a Vinaigrette on the side.  It was so fresh and light and yet so filling. But since I am a glutton, I also ordered a classic Vietnamese Sandwich which is normally called a Bahn Mi. They take a toasted French baguette slathered it with mayo and butter. Then it stuffed with Pâté, Ham and Ground Beef and topped with thinly cut carrots, daikon, cilantro, and jalapeños. There is so many textures and flavors but it all seems to work in this amazing way. \n\nIf you haven't had one, you need to try one now.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "Oh man this place is delicious.   Had the classic banh mi sandwich with minimal expectations.   Thank goodness because it made this sandwich wayyyyy better.   \n\nCan't wait to eat here again!", "author": "Rhobin D."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}