{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-20", "description": "It's more expensive than viet food in Manhattan chinatown but I did enjoy my time there today with my boyfriend and the food was lovely, the menu is simple and the vegetarian options are very tasty. I will be coming back here! The passionfruit bubble tea with mango star jelly was so good also!!", "author": "Shamah J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-27", "description": "Omg this place is great! Their bubble tea tastes so good and milky. I of course got the coffee one \u0026 I loved it. Their Vietnamese sandwiches are to die for. My boyfriend \u0026 his nephew got the classic \u0026 I got the grilled chicken one. They taste so different but in a good way. Their grilled chicken tastes like teriyaki chicken since its Vietnamese. The sandwich was 7.00 and def. filled me up good. Will be coming back to try different sandwiches.", "author": "Daniela G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-14", "description": "Great for a quick bite on the go. Iced Watermelon Slush is a thirst quencher for hot summer days.", "author": "Den z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-24", "description": "I really like this clean, modern banh mi spot.  Yes, there's a certain thrill in getting a mystery sandwich from a dark dank counter but other times you just want to go somewhere nice.  I think their banh mi is the best one I've tried in the city and maybe better than the street ones in Saigon.  The bread is warm and spot on and the meats are all delicious.  The bubble tea is good, nothing different from usual bubble tea but definitely good.  It's nice that they have soymilk as an option.  Almond milk would be nice but at least I don't get a stomachache from a bubble tea.  \n\nCrowd is definitely on the families with kids side but you're a bitter fuck if you can't deal with that in a quick serve place.  I've never seen anything particularly obnoxious go down and the vibe is chill and laid back in a California/college town way, lots of Jack Johnson and and Maroon 5.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-22", "description": "First and foremost, they do not use actual baguettes, but instead an oblong shaped fairly standard NY deli type \"roll.\" There really is no chew or pull or crackle, and no real actual flavor either, it's just sort of there. When I want a sandwich, it's mostly about the bread, otherwise I would just eat the components separately, so this aspect was definitely a let down.\n\nOther than that, I would say these are typical, mediocre Bánh Mi. For my taste the pickled daikon radish and the pickled carrots were a bit too sweet, but thankfully the cilantro was remarkably fresh as was the rather generously portioned cucumber.\n\nMine came with Sardines (my second favorite type of Bánh Mi, other than Vietnamese Meatballs which unfortunately Hanco's does not offer), one of my friends' came with Roasted Ground Pork (which tasted like Breakfast Sausage) and Vietnamese Ham and an infinitesimal (barely present) amount of Pâté, and my other friends' came with Shredded White Meat Chicken. Gratefully, all had just the right amount of mayonnaise -- just enough to wet the bread.\n\nAfterward, our bellies were full, but that's about it. At $5.75 each, it's the most expensive non-Restaurant Bánh Mi I've ever had, and far from the best.", "author": "David L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-23", "description": "They have some good bubble tea! Pricy but good. So far I've tried 3 flavors , mango, I think green tea, and mocha .... That mocha is delicious lol I can treat myself to a bubble tea once in a while and this is the right spot for it !", "author": "Marie Annick M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-23", "description": "Light and quick meal on Smith Street. Tasty and resonantly priced. Go for the sandwiches, you can't go wrong!", "author": "Gif A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-07", "description": "OMG, somewhat at a loss in rating this location. The food is certainly a four but the service in terms of the chaos in waiting at this hancos location is off the hook.  I used to go to park slope hancos about twice a month, without problem and without feeling like a sardine.  But after two stressful visits at thus location, its enough to keep me from revisiting. Id truly give this a THREE AND A HALF, bc a four feels generous, given the aforestated.  i have now gone to getting delivery from this location, and the delivery time is fair.", "author": "Michelle K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-15", "description": "Pho and rice bowls are great, they taste super fresh and are very filling. I usually get the pho with tofu and vegetable broth which is around $10 but feels like a substantial amount for a main meal. Salads are a bit bland, made of all fresh ingredient and you can add on meat or tofu. I look forward to trying more stuff from their menu, definitely becoming a regular!", "author": "Samaa Skye A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-01", "description": "The classic banh mi was extremely flavorful. I ordered it extra spicy, and it was spicy without masking the other flavors. The meat and aromatics were fresh, and it was very filling.\n\nMy wife ordered the combo rolls: they were fresh and crisp with a hint of mint.\n\nThe Vietnamese coffee was good. I could've gone for stronger, bolder coffee and maybe a little less condensed milk, but it was still fantastic.", "author": "Andrew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-26", "description": "Soft baguette, juicy chicken, lots and lots of daikon and carrots.\n\nSteaming hot.\n\nWhole wheat baguette?! Omg! \n\nIced Viet Coffee -- mhmhmhmhmmmmm, yea I ask for light condensed milk because I love my coffee strong =) \n\nFYI, I believe they're moving their store directly on Smith! I see the signs and stuff.  Can't wait!!!\n\n*heart*", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-13", "description": "Delicious. Delicious. Delicious. Repeat a few more times. The only downside is the space - too small so your plan for having a nice sit down delicious meal may turn into a take out. Can't wait to comeback again.", "author": "I I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-10", "description": "This location is a lot nicer than their old one. I usually grab a classic banh mi and a taro bubble tea. On my last visit they were both great. The Montague street locations  overloads the ice and you barely get any tea, but there was next to no ice in the last one I got from here. It did take a while to get me food this last time and they weren't even that busy, they seemed to have a lot of delivery orders they were prioritizing over their in store customers.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-11", "description": "Great bubble tea, and tasty banh mi sandwiches.  Boba has a great consistency and is sweet.  Had the almond milk green tea which was more on the milky side but still good.  Tried the chicken and pork banh mi sandwiches--both were good but the pork one was the definite winner.  Spicy is not very spicy, although bits of the fresh jalapeño may have a kick.  This place seems to get crowded, as I was here after 2pm and there was still a decent line and no spots to sit.  They have seating for ~20 people.", "author": "Vanessa O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-04", "description": "I love this place! The bread is so fresh and the prices can't be beat! The pho is amazing too.", "author": "Alexis I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-15", "description": "I love this place! Quick and delicious food! I always go for the Grilled Pork Sandwich, you can never go wrong with it! Plenty of options for those who would like to try something else though. And gauging from the volume of clients coming every day at lunch time I bet they are all also fantastic!", "author": "Ana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-07", "description": "Can't come to Brooklyn with out make a stop at Hanco's. Shredded chicken sandwich is my favorite and tastes even better when it's spicy. The rolls are so fresh and tasty. It's about 8 bucks for a sandwich that will fill you up!", "author": "Salil K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "I am satisfied with their pho here. I like the flavor of the veggie pho. I wish it had more variety of veggies in the pho. The veggie chicken tastes like chicken. I still prefer the veggie pho with tofu.\nPS they have a punch card/coupon system here!", "author": "A K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-05", "description": "Good tasty cheap eats.  Not great quality but its very tasty.  I wish they had a sandwich and half soup combo deal.  That would be a great winter meal.", "author": "Evan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-16", "description": "This was my first time trying Vietnamese food. I always thought it looked delicious. Thanks to their worker AJ, I was right. She and the patrons were nice enough \u0026 patient enough to answer all of my questions. Highly recommend this place \u0026 I will be back with family!", "author": "Antoinette S."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}