{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-08", "description": "Hanco's has yummy banh mi sandwiches, a good chicken salad, good spring rolls, and bubble tea in a relaxed atmosphere with outdoor sidewalk seating. Mix in good company which of course is BYO, and you've got a perfect filling-but-light dinner on a hot hot HOT summer evening.\n\nPersonally I like Ba Xuyen banh mi better but some friends preferred Hanco's. Looks like we might need to have a banh mi faceoff!", "author": "Mel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-16", "description": "I ordered the chicken sandwich ($4.50) spicy, and wasn't one bit disappointed. The bread was crispy on the outside, and soft on the inside. The grilled chicken was a mix of white and dark meat and pleasingly juicy. I did not care for the shear amount of daicon radish and carrots they put on the sandwich, but I'll ask them to go easy on that next time.\n\nI'll definitely be coming back for more. The only surprise occurred when I walked into a 'Vietnamese' sandwich shop and all the staff were speaking Chinese. See, I told you all NY is too cold for Vietnamese people. LOL.", "author": "Victor T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-12", "description": "While the freshness of the baguettes does vary from piping hot fresh to a few-hours-old, I'm still giving Hanco five stars for deliciousness, consistency, and a commendable devotion to the judicious inclusion of cilantro in each dish.  The heat rating on the sanwiches has already been deftly explained by Claire B.  The banh mi types also include a \"classic\" which has ham and Vietnamese pate.  I like it, but it's a bit salty and fatty for me.  My favorite is grilled chicken (I get it medium spicy).  There's also a sardine version for those who need their Omega-3s.  \n\nThe goi cuon (summer rolls) are top-notch.  Hanco also offers bubble tea.  I recommend lychee.  Ask for it warm when it's cold outside.", "author": "Katharine H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-19", "description": "I work fairly near this shop. Well as near to this shop as any other, so when I found the reviews for this sandwich shop on yelp, I decided I would venture out and try it.\n\nNow I have always heard about how tasty Banh Mis can be, but I have never had the opportunity to have one. Learning that a Banh Mi sandwich shop was within walking distance of my job, put me in Banh MI mode. For the next couple of days at work, all I could think about was when I would walk over there and finally try these well liked sanwiches.\n\nI was finally able to make it down there last week, and I was not disappointed. Now I have never had any other Banh Mi sandwich to compare this with, so my opinon must be taken with a grain of salt, but!\nWhen I arrived there, I ordered a Vietnamese Iced Coffee, and a classic Sandwich.\n\nThe Sandwich was tasty and filling. Definitely a good deal for the neighboorhood. The iced Coffee was sweet and tasty. When I finished my sandwich and gulped down as much of the sugary coffee as I could handle, I finally sat back and felt quite contented.\n\nI don't know when I will have the chance to get back there as there are many other shops I would like to try. But this was definitely a nice snack, and I am now a fan.", "author": "David R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-07", "description": "ok, if you order spicy... make sure you have some water with you. I downed a 24oz of water after i ate the sandwich. It was delicious with generous amount of grilled pork and pickled vegetables and greens. However, it's a bit pricy for a vietnamese sandwich on Cali standard. Again, I am in NY now, so i guess it's expected to pay over 5 bux for a Vietnamese sandwich. Prob. won't be going everyday but I now know where to go when I crave the Vietnamese styled pickled vegetables and french bread yumminess.", "author": "Ai L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-03", "description": "My BIL took us here for a sandwich while we visited Brooklyn. I am not known for my adventurous eating, but am so glad I said yes to this place!! The roasted pork sandwich was awesome. I ate the whole thing! The pickled veggies on the sandwich mixed with the flavor of the pork was great. I got my sandwich medium spicy and it was perfect.", "author": "Kameron S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-02", "description": "I ordered the summer rolls \u0026 tofu rice vermicelli \u0026 it was sooooo good! Very fresh, non-greasy \u0026 good portion size for the $.  Comes with more then enough sauce on the side. The delivery time was also great, no more the 20-25min. Will be for sure ordering again!", "author": "Katrina T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-03", "description": "I tried a classic sandwich with a taro bubble tea, as well as a sardine sandwich with coffee bubble tea. It was a tad bit expensive at a cost of upwards of $20. Suffice it to say that my taro bubble tea tasted as water does. I asked MULTIPLE times for it to be sweetened. That was the worst part. But after about 3 or 4 times it was mildly decent. The classic sandwich, however, was to die for. The coffee bubble tea and sardine sandwich tasted as it should have, as I sampled them with the intention in mind of writing this review later on (haha). If this review were centered around food alone, it would receive a proper 4 stars. However, the place is extremely small for the vast amount of people that actually enter the place to eat. I had to stay on constant look out for seats; actually, if you are with a friend, let your friend get out of the line and go on guard to find a place to sit - after 10 minutes you might be lucky. The place was really noisy as it was packed full of people. I guess this is a good thing for the booming business out here, but as pretty as the place may be, it is just not a comfortable fit. I actually struggled to get some Sriracha for myself. Bottles were hogged on tables by those not considerate enough to put them back where they were found. BUT all in the all, the classic sandwich makes it 100% worth revisiting, at least for me. I will be back but I think next time I will take my order to go!", "author": "Shoshanna J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-01", "description": "Best Bahn mi that I have had thus far. It was thoughtfully prepared with fresh ingredients served at the right temperature. The ground meat and ham was served nice and warm and tender, while the pickled veggies were cool and crisp. The cilantro matched well and were extremely fresh. The bread was crusty and the sauce added the perfect amount of heat and creaminess. The serving size was perfect and I would not change one thing about that sandwich. At $5.50 it was a perfect lunch and I left happy and satisfied.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-23", "description": "My first Banh Mi sandwich was pretty awesome. I didn't know what to expect, so I was pretty happy with it. It had so many things going on it was alot of fun to eat. It was the classic regular one this place serves up, so the meat was kind of like taco meat, but Hanco style. I also ordered the summer rolls and bubble tea like a fat ass. But it was alllllllllllllll goooooooooooodddddddddddd.", "author": "Richard B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-25", "description": "This is my go-to place if I want a sandwich at my door in 15 minutes or less that is always consistent in flavor.  I always get the same thing here - Banh Mi and the Taro bubble tea.  The place itself is dinky and dirty looking with only a few tables, so I would definitely suggest take out.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "Finally tried this place out - and it's about time. Had the spicy pork sandwich, and it was amazing. How have I lived within 10 minutes walking distance from Hanco's for the past two years without trying it? Best news I've heard in awhile: they're opening a new location on Montague St. in BK Heights. If there is ever a time to appropriately quote Charlie Sheen's  \"winning\" just once, and only *one* time, in my existence... it is now.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-08", "description": "I was excited when a server asked how \"spicy\"  I wanted my bahn mi to be.   A little disappointed with it being a bit mild for my taste bud, I'm proud for discovering this little bahn mi haven in Brooklyn.", "author": "Mo P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-21", "description": "This place lives up to the hype.  Fresh ingredients and lots of flavor.  The girl at the counter was really nice too!  I got the spicy pork and the honeydew green tea.  Both were great!", "author": "Sharon W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-17", "description": "for New York... this is the BEST spicy tofu banh mi i've had. kudos to the quality and SPICINESS!! my lips were burning for a couple of hours. \n\nservice is quick like a deli and there's a seating area for you to devour your banh mi. the bubble tea here is a disappointment, though. very watery and the boba isn't cooked enough. i like my boba sweet and soft/chewy... but this tapioca didn't have that quality. \n\ni actually don't like the pricing here too much, either... but it's New York... what do you expect? i'm used to paying $2.50 in Seattle! oh well.", "author": "Joolie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-01", "description": "This place would be perfect, if only it had some atmosphere.\n\nHaving said that, the food is terrific.  The classic Banh Mi is amazing--ground pork, Vietnamese ham, pate, butter, cilantro, shredded carrots on a perfectly toasted french roll.  mmmmmmmmmmmm.\n\nGood bubble tea--better than the Chinatown joints.\n\nThe vermicelli with shredded chicken is also delish\n\nAnd very inexpensive.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-12", "description": "Why oh why did this place have to open only a few weeks before I moved out of the neighborhood? Amazingly fresh banh mi- the pork and the sardine banh mis are to die for. The baguettes are perfectly toasted, lending that nice crunch when you bite down, with the soft interior perfectly bringing out the crisp of daikon and carrots.\n\nThe spring rolls here are good, and the boba is less than thrilling, but who cares? Come for the banh mi!", "author": "Thea T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-07", "description": "i love everything about the quality of the food here. \n\nunfortunately, since they moved to Smith Street they cannot seem to keep the orders straight. 3 times in the past month they have either gotten my order wrong, or given me the wrong sandwich.  right now i am p****d off because i am starving, it is 13 degrees outside, and i have to wait for them to deliver the sandwich that they didn't give me when i walked there to pick it up. meanwhile, someone else who ordered delivery is waiting for the sandwich i am about to toss in the trash because i don't eat meat.\n\n*it's too bad that yelp does not allow for two ratings: one for food, the other for everything else.*", "author": "kevin f."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-02", "description": "I went there for the bubble tea and wasn't impressed.  The boba was soft and sweet, but the tea had no flavor.  I ordered the jasmine green tea and even asked for some more tea flavor because I didn't taste. I still didn't taste it.", "author": "Ami G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-05", "description": "Thank you fellow Yelpers for your expert reviews. The 4 stars that Hanco has convinced me to walk 8 blocks in 87degree weather with 2 of my adventurous co-workers. I'll tell you at the end of my review if I'll do hike again.\nI'm writing this review as someone who's only had Banh Mi a shameful 2 times (Hanco's is lucky number two) so don't kill me if I'm giving this place too much or too little credit compared to your opinion! :-)\nI ordered the Pork Chop Sandwich and the Litchi (that's how they spelled it) Bubble Tea from the mandarin speaking lady. Personally, I tend to discriminate against a restaurant once I discover that an ethnic cuisine is a bit short on being authentic. So, loss of authenticity contributes to the -1 star of this review.\nBut, Hanco's gets the other 4 stars from me because the sandwich and tea were overall yummy. Funny thing I need to mention - I was reading yelp reviews as I ate my sandwich and James F's review struck me.  He mentioned that Hanco's stacks the meat and veggies on opposite sides of the sandwich. I honestly wouldn't have noticed until I read the review! But he's right - I subconsciously found myself taking one bite from one side, then a second bite from the other side. That led me to notice that the first 1/2 of my sandwich had no mayo while the 2nd 1/2 had enough spice and mayo to make my sensitive tongue tingle a bit more than I like. Anyways - like I said, overall it was a good sandwich - not great - but good.\nSo would I ever do the trek again? Yea sure why not?  I'm going to consider Hanco's as my new go-to to fulfill my Banh Mi cravings.  Why? Because it's the closest good Banh Mi joint in town.", "author": "Melinda L."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}