{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-03", "description": "This place sucks so bad it hurts.\n\nI took one bite of my classic banh mi and threw the remainder of the sandwich at the non-Vietnamese counter girl. Go to Nicky's where you can get a real Vietnamese banh mi made by a real Vietnamese person who knows how a real Vietnamese banh mi should taste.   \n\nAnd, I hate anyone who rated this place above 1 star. I hope I'm not friends with any of those people.", "author": "D W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-04", "description": "I went to Hancos after recommendation after recommendation from a friend. Line with out the door which usually symbolizes good food, but when I got to the counter the place looked very dirty and messy. I ordered the white meat chicken sandwich and when I finally got around to opening it up there was a huge hair in my sandwich. Never again", "author": "Michael L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-24", "description": "Hanco's is WILDLY inconsistent in the time it takes for the guys behind the counter to prepare the sandwiches. A co-worker waited a half hour there once, and I've had to wait 15 minutes.... and other times, less than 10. They kind of go at their own, meandering pace.\n\nBut I dunno, I guess the trade-off is that the sandwiches are amazing, and addicting. I always get either the shredded chicken or the classic-- mild. I can't get it spicy, or else I'm in for a world of hurt.\n\nThe bread's always fresh, the daikon and carrots are always crisp, and I never have any complaints about the food quality. I'd kind of prefer, maybe, if the shrimp-filled summer rolls didn't sit out on the counter, in the non-air conditioned storefront during the summer. I mean, I'm sure they don't sit out all day and aren't full of bacteria but it's just NICER to see your summer roll come out of a fridge. It makes you wanna throw that shrimp back. Room-temperature summer rolls, eh, not so much.\n\nI've also enjoyed the taro and coconut bubble teas, though haven't tried any others. Unfortunately, I had sworn to myself not to buy lunch tomorrow but just writing this review has given me a hankering like nobody's business.", "author": "Danielle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-17", "description": "I have tried all the banh mi here and I would have to say the classic is my favorite. Please do not tell me what goes into the pate; I do not want to know. \n\nDon't bother with the salads or spring rolls. They are pretty bland. Just get a sandwich and a bubble tea.", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "Hell Yea. Good cheap Vietnamese. Had the rice vermicelli with grilled chicken and it was great. Only 4 stars b/c nothing spectacular - but perfect for quick bite.", "author": "Zack F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-26", "description": "This Vietnamese sandwich spot in Brooklyn is outstanding. I typically go with the tofu sandwich (mild) which is served on the freshest of baguettes. Be careful of the peppers if you order your sandwich \"hot.\" A few friends who can handle heat have been burned a few times by the peppers.  The bubble tea is very nice as well! \n\n\nI just wish there was something similar in DC....looks like I have to drive to Brooklyn to get my fill!", "author": "Rob O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-28", "description": "hanco's vs. nicky's?\nHANCO'S\nfavorite sandwich: pork chop.\nperfectly spicy.", "author": "Omar C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-25", "description": "This place is quite clean. The food was just good. I had better pho in other places. I will come back again.", "author": "Sam M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-12", "description": "Fantastic sandwiches. These guys do vegetarian chicken as well as anyone. Some of the drinks could use a little improvement, and the dining room is kind of dank and depressing. I come here all the time, though. Once you're into this stuff, you can't get out.", "author": "X. J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-19", "description": "I usually don't get vietnamese sandwiches since I like to watch my diet\n(carbs, butter, mayonnaise, pork, etc, just not the greatest combination for me) \n\nBUT! they have other selections like grilled chicken and tofu! on WHOLE WHEAT. which is awesome. I know it doesn't taste the same but I think it's good enough for me. Whenever I order the tofu sandwich (minus the butter and mayonnaise with extra hot sriracha sauce) , its especially hot which i love. Steaming hot tofu almost on the verge of burning your tongue at every bite. So much flavor going with the tofu (or chicken, etc) pickled vegetables, cucumbers, cilantro, and sauce. Every bite is filled with deliciousness. The different flavors and textures just works altogether. I love how they're so generous on the pickled daikon and carrots. They give an enormous amount which sometimes its hard to eat the sandwiches. The cucumber and cilantro really gives off a nice refreshing finish to the bite. The sandwich is pretty big, so whenever I manage to finish it, I feel stuffed and ready to hit the road! \n\nI've had the regular banh mi on the white french baguette when I can share it with the boyfriend. It's pretty good I admit.\n\nThe vietnamese coffee. Just yum and it goes perfectly with the sandwich! I usually come here for the coffee whenever I'm in the area and I need a energy fix before work. It's really sweet because of the condensed milk but vietnamese coffee is so nice, distinctly bold, dark and rich. YUM. I even got myself a tin of the coffee grounds with the filter at home but it just doesn't taste the same. I guess I'm not much of a barista eh.\n\nBEST PART, buy nine sandwiches, and get the tenth free!", "author": "Jenn N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-10", "description": "Awesome vietnamese sandwiches, tried 3-4 places around the area and this has been the best, cheapest, and most generous so far.  But this small location can get very crowded.", "author": "Sleepyman D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-17", "description": "3 words. spicy pork sandwich!!!!!\n\nawesome and cheap.\n\nmy favorite.", "author": "Mitchell R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-20", "description": "UPDATE:  I've been back 2 more times to try the original and the sardine bahn mis, both good in different ways.  Will I be able to squeeze in one more trip?\n\nTasty with a capital T!  I have to say I like these banh mis  much better than the ones I've had in the Tenderloin of SF.  Sure it's 2 dollars more at a steeping $4.25, but I feel like the quality of the meat and the freshness of the bread \u0026 veggies is well worth it.  Because of my fear of questionable meat (due to some unpleasant experiences with these french vietnamese sandwiches), I actually ordered a rice vermicelli bowl with tofu..which was good.  I stole a couple bites from my friend's pork chop banh mi and was pleasantly surprised.  Hot, perfectly spiced - salty sweet - and orgasmic!  We had managed to get an order of summer rolls, banh mi, vermicelli with two teas for about $10/each.  Who said NY/Brooklyn had to be expensive?", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-09", "description": "I am newly addicted to Banh Mi sandwiches. I think this place is a little better than the place up on Atlantic (and closer to my place, so maybe I'm biased). You can't beat 5.25 for a delicious sandwich. And they deliver (with a $10 minimum) I was so happy to find a place with bubble tea nearby too! \n\nOne other little thing I appreciated about their location is that there are magazines and newspapers. Nice for those waiting for takeout or eating alone.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-22", "description": "So fresh. So tasty. So good. What are you waiting for? I also must rave about the iced coffe (made with condensed milk- i think)- it was simply delish!\n\nMy wait time, eating in, was def under 10 minutes.", "author": "luckysquid m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "Incredibly tasty sandwiches but also the most I've ever paid for banh mi.... which is fine, because they stuff the living bejesus out of these bad boys.\n\nWhile tasty, the banh mi isn't very authentic.  The bread should be crispier.\n\nI think it's an American trend, but the portions are too much.  You could easily have this for lunch and dinner.  But then again, it's so deliciously addictive, you can't stop yourself from eating it all.\n\nI'd rather them charge less money but for a smaller sandwich.", "author": "Scuba K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-07", "description": "Excellent banh mi. One of the best I've ever had. A bit pricier than your average hole in the wall Vietnamese sandwich shop, but a still a good deal for the neighborhood.\n\nThe rice paper rolls with peanut sauce and super strong coffee are also yummy.", "author": "Sarah I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-16", "description": "I've been coming here since it first opened \u0026 have tried literally everything on the menu \u0026 it's all fabulous. I wept the day I moved out of the neighborhood, only because I wouldn't have access to my weekly pork chop sandwich anymore, but I still use any excuse to go back \u0026 relive the glory days. The baguettes \u0026 veggies are fresh \u0026 they don't skimp on the spice if you ask for it-- heaven for a spice girl like me! Definitely the best bahn mi in NYC (\u0026 I've had lots). \n\nExtra tip: the coffee is sweet \u0026 strong! Drool.", "author": "E H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-23", "description": "I LOVE this place!!! I had never had a Vietnamese sandwich, but they are\nde-lish and so is the bubble tea! The people working there are very nice and friendly. This place is very convenient and fast for something to grab-and-go. And it is super incredibly cheap!!!", "author": "Lauren R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-11", "description": "I literally live and die for this place. The classic banh mi is the most amazing sandwich I have ever had and it is SO affordable.", "author": "Alex B."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}