{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "Incredibly fresh and flavorful bahn mi served by the nicest staff and at unbelievable prices.  Usually I am all about the classic bahn mi, but I have to say there shredded white meat chicken  bahn mi is out of this world.  As someone else noted it is like crack.  We have probably order 50 of these in the last 3 months and every time the chicken is absolutely perfect with no mystery meat or fat....just perfectly cooked chicken.  Get it spicy for an extra kick.  Summer rolls are also done perfectly.  While we still think the best pho is in chinatown, Hanco's is pretty good but not something we get regularly unless we can't make it to chinatown.  Love that they are on seamless and give you no attitude like some places for using.  Make sure you get their sandwich / soup cards as every 10th (i think) item is free.  Another tip is that bahn mi is 50cents cheaper here than their park slope location.  Just wish they stayed open later.", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-01", "description": "I had never tried banh mi before, but now I am sure glad I did!  I got the pork chop sandwich, and it was DELICIOUS.  It was sooo delicious that I was inspired to come post a review on Yelp about it, and I think the last time I posted a review was 4 months ago... it's that good. \n\nThe combination of pork chop, mayo, butter, pickled carrots, daikon radish, and cilantro was like a flavor explosion packed with just the right balance of sweet and spice (I got it medium hot). After every bite of the sandwich I just couldn't stop thinking, \"This is delicious!\" My initial impression was that the sandwich was kind of small and I'd probably need to supplement my dinner with something else... but looks are deceiving. It was surprisingly filling, and an excellent deal at only $4.25.  I can't wait to go back and try the other varieties.\n\nPlus the staff was pleasant and courteous, and I only had to wait 6 minutes or so while they prepared my sandwich. Hanco's also makes some very satisfying bubble tea, and at $3 per drink, the price is right--and it's cheaper than Amazon Cafe's smoothies, though admittedly less healthy. But yum!", "author": "Alaina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-18", "description": "I think banh mi sandwiches are on my top 10 list of favorite foods. With that said, I think that New York is sort of lacking in really amazing ones. \n\nI have tried all the usual suspects - Nicky's, Banhi Mi Saigon, Banhi Mi So, etc. and while they're all good, none of them are mind-blowing. Out of all the ones I've had in NY though I think Hanco's is my favorite (but I'm still searching). Quick note - the people that own and run this place are Cantonese, not Vietnamese. I'm not sure how much that matters but I thought it was worth pointing out. I always find it a little strange but I guess it doesn't really matter?\n\nI've had both the pork (classic) and the tofu and they both had their merits. The tofu one is way better than any vegetarian banh mi sammie I've had at other places. They use firmish tofu instead of tofu skins so it tastes more substantial. The pork one was really flavorful - the pork was kind of crumbly - I don't know how else to describe it but the important thing is that it was good. \n\nOne of the good things about Hanco's banh mis is the bread. It doesn't rip  up the roof of your mouth.", "author": "Alli J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-04", "description": "Very good Bahn Mi and worth the trip from Queens.", "author": "Kurt M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-20", "description": "Amazingly good and cheap food! Classic vietnamese sandwich is my fave. Their rice dishes are also on point. Love their teas too :)", "author": "Lorraine J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-20", "description": "These sandwiches are addictive; I'd have them for lunch every day if I could.  Though they're not the largest, they're more than enough for lunch, and the price is certainly right.  If you're coming during peak times, do yourself a favor and call ahead; they do get busy.\n\nThe spicyness does vary a fair bit from order to order, but that's my only mild complaint -the ingredients are always great.", "author": "Lucien V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-12", "description": "CALL IN your order ahead -- good things take time (or at least a good 15 minutes).\n\nI get MAD cravings for the tofu sandwich, medium spicy. It is one of my top favorite things to eat period.\n\nIf they delivered to my 'hood I'm 100% sure I'd eat so many I'd turn into a tofu bahn mi.", "author": "amy s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-12", "description": "Best Bahn Mi around! Classic Spicy Minced pork is cooked to perfection and toasted in perfect baguette. Choose your how spicy you like it!  Rice noodles and shredded chicken also very good~", "author": "Neil S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-16", "description": "Loved this place - fresh crisp but soft on the inside bread, warm meat and fresh ingredients. Friendly service and cheap.", "author": "Russell S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-21", "description": "(Had the pork sandwich)\n\nPros: Meat is flavorful, just a bit charred, delicious. Bread is quality, crispy, yielding. \n\nCons: They put a whole stalk of cilantro in a sandwich. The stalk is so fibrous that it's impossible to bite it; you just end up pulling a small tree out of your assembly on the second bite. Ditto for the meat; for whatever reason, it just doesn't cleave well.\n\nMeh: pickled bits weren't crunchy, but weren't soggy either. Pickle flavor was a refreshing contrast, but didn't really stand up to the pork.\n\nI have had better, but also much worse. Would eat again if I were in the neighborhood.", "author": "Bret H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-13", "description": "a go to take out place in park slope.  great bahn mi and the summer role appetizer is very tasty. a cut above.  prefer the sandwiches here above the local competition, which we have tried.  the place also has pho, which hits the spot when you get the jones.  they deliver and are usually pretty quick", "author": "Sean H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-13", "description": "According to Robert Fulgram, the first thing that you learn in kindergarten is to \"share everything\".  Like many people, I consider a willingness to share to be  good thing, and for the most part, I do share.  I frequently offer bits of my latest food discovery to friends and family.  Hanco's pork chop sandwich in Brooklyn has put a blemish on my formerly spotless record.\n\nSince I do not live near Hanco's, I make it a point to stop by whenever I am in the area, typically on the way to somewhere else.   Unfortunately, I may have someone else in the car. Before I call in my order ahead of time, I inform my passenger of the quick stop, and ask if he/she would be interested in a pork chop sandwich.  I receive a polite \"no, thanks\"  and a quizzical look.  Apparently, many fast food places have given the pork chop sandwich a bad reputation.  I  then call ahead with my order for one sandwich.  I pull up outside Hanco's, pick up the sandwich and get back in the car.  This is where the trouble begins....\n\nI have to take a bite before pulling off.  The car quickly fills with the mouthwatering aroma of the delicious Vietnamese sandwich.  It is impossible to ignore.  My passenger invariably  comments that the sandwich was not what they anticipated, and stares longingly at my food.  Of course, I have to offer a bite at this point.  It would be  rude not.  Unfortunately, that  single bite always turns into half of my sandwich.  I do not consider myself to be a greedy person, but if I wanted half of a sandwich, I would not have ordered a whole sandwich.banh-mi\n\nHanco's pork chop sandwich is a variation of a traditional Vietnamese banh mi -  ground pork, ham, and pâté on a toasted baguette with cucumbers, carrots, and daikon radish.  Bánh mì is popular in many areas of the country, but not as well known in Brooklyn.  I first stumbled into Hanco's for the bubble tea, but left with a passion for bánh mì.  It must be tried at least once.   There are chicken and vegetarian versions, so there is a bánh mì for everyone.  ** CAUTION - Spicy means SPICY! **\n\nI no longer ask passengers about their sandwich inclinations.  I just mention a quick stop, and automatically order 2 sandwiches.  I figure that if they are not interested, I will have another sandwich for later.  Of course this has never happened, but there is always a chance it might.", "author": "Elle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-13", "description": "This is a hole in the wall restaurant with amazing cheap food. \n\nClassic sandwich super spicy - oh my god absolutely delicous! Plus bubble tea? Best meal ever for under 10 bucks!\n\nA great place to eat by yourself and read from a selection of magazines or come with close friends. Not someplace you'd bring to impress a first date - unless you knew for sure your date was super chill and loved food over decor.", "author": "Helena F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-16", "description": "Wheeee!\n\nGood stuff. I've had my share of Vietnamese Sammiches, but this is one of the best ones in New York.\n\nI am definitely a fan.", "author": "Smog R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-02", "description": "O-M-G.\n\nThis place is so delish, and I am so spoiled to live so close by. You know when you like a particular thing from a place SOOO much that you can't bring yourself to order anything new? I loved their classic bahn mi sooo much that I would never get anything else. That is, until I one day surprised myself and randomly ordered the pork. SOOO good. I think I might go get one now, actually. I also always get bubble tea. \n\nI always love Hanco's. This place helped me survive my finals period.", "author": "Marianne S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-04", "description": "Best bahn mi I've had in a very long time.  Steaming hot!!  I forgot to request the whole wheat baguette because I didn't see it listed on the menu.  I only knew about it from reading Yelp reviews.  Next time...if I'm ever in the area again.  Made a stop here for quick lunch before going to Brooklyn Bead Box down the street.  I ordered the shredded chicken but they gave me grilled instead.  No prob because it was freak'n fantastic!!!  I'm normally a white meat only kind of gal but the dark meat wasn't overly greasy and didn't have that \"meaty\" taste to it.  I ordered mine Medium spicy which was in fact medium spicy.  No extra condiments needed.  I loved how the bread was oh so warm...crunchy on the outside, super soft on the inside.  A very good amount of meat and carrot/daikon mix.  I also got a small Taro Bubble Tea to wash it all down.  That was fantastic as well. It wasn't overly sweet and was actually refreshing.  I'm just sad that I live in Queens and rarely make my way to BK.  I highly recommend this spot for a quick lunch.  Super popular.  1:30pm on a Sunday and it was packed with a continuous flow of customers.  A very good sign.  Yum!", "author": "Kim W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-16", "description": "I love this place, the sandwiches are fresh and tasty; the perfect Sunday lunch. After a weekend of over-indulgence, a meal at Hanco's is perfectly simple and delicious.  You'll feel like you're doing yourself a favor. \n\nThough the place itself is quite small, you can grab a table inside or out, and go for a walk to digest. Or take your food to go and sit in Cobble Hill park, or on the promenade, for a beautiful afternoon!", "author": "Andrea P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-11", "description": "Got their classic and chicken sandwich. Their portions were large, the sandwich was unbalanced, some bites were just spicy. The best thing was the peanut sauce on the summer roll.", "author": "Bee C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-30", "description": "Best Bahn-mi I've had in Brooklyn thus far. I've brought so many friends here and they've all fallen in love. Not to mention, I always come back for their bubble tea. Generous with tapioca, and so delicious. I've never been disappointed with Hanco's.\n\nMouth-gasm.", "author": "Grace H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-30", "description": "Perfect tofu sandwiches.  I'm a meat eater but the tofu sandwiches are so friggin tasty and fresh I only ever order these.  The other sandwiches are great, too.  \n\nThe sauce that comes with the spring rolls complements the rolls perfectly.  \n\nMy little slice of sandwich heaven sits right here.  I'm constantly ordering delivery from this place...", "author": "R O."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}