{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-13", "description": "Having grown up walking distance from one of the largest Vietnamese populations in the United States, Banh Mi sandwiches have been a part of my life for as long as I can remember. I have had several of these sandwiches in NYC, and this is the best place.  The Bubble Tea is great too!", "author": "Andrea T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-10", "description": "This is a great place for a quick bite! The bahn mi sandwiches are made fresh and the grilled pork and the grilled chicken are my two favorites! The bubble tea selection is also very good here.", "author": "Sam C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-04", "description": "OH lordy.  I love Hanco's.  Yummy vegetarian options (i get the garden rolls, salad and tofu sandwich).  Super cheap.  If you don't like your teas too sweet - ask for \"half sweet\" or get the Jasmine Bubble Tea.  Oh - call ahead because even if there isn't that many people in there, it can take a while to get your order.  Probably due to all the other customers calling ahead : /", "author": "Danielle M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-28", "description": "I was glad to find a place where I can get a rice vermicelli salad in Brooklyn. That has to be one of my favorite meals. After getting and eating said salad I was a little disappointed, not as good as Quang in Minneapolis, but overall I'd say it was good and I'll be back. The spring rolls and iced Vietnamese coffee were both very good.", "author": "Ben S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-22", "description": "Two stars because the staff was friendly, the food is cheap, and I think the place has potential, but the three times I've been here, it's failed to impress.  Not enough veggies on the Bahn Mi, and the bread leaves a lot to be desired.  The meat was tasty, though.", "author": "David B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-02", "description": "Finally, a place to get boba tea in Brooklyn!  I used to love getting it back in LA koreatown, and now I don't have to take the D into china town just to get it.  I just had the grilled chicken sandwich today and it was really AWESOME.  They have a couch in the back which is really comfy, and yes, it is VERY stroller friendly.", "author": "Gia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-25", "description": "No two vietnamese sandwiches are the same! Please come to the Chicago area!  Your sandwiches were always so good, fresh, and filling for the price. Haven't been able to find anything here that compares.", "author": "Debbie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-29", "description": "I had no idea Vietnamese sandwiches were this good. I loved this place. The bread they use for the sandwiches is really great, and I enjoyed the bubble tea I had. I recommend the classic sandwich. I look forward to coming back here next time I'm in the neighborhood. Actually, I'd probably make the trip just to revisit this place. It's that good.", "author": "Chris O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-20", "description": "Seriously. I love vietnamese food. I eat it a lot in many different places. But I have never had banh mi like this. The spicy classic is a thing to die for and the spring rolls (minus the peanut sauce, but adding the hot sauce) were fresh and wonderful. The iced coffee was just the jolt I needed for the pick me up of ther day. Too bad they don't sell pho as well - they'd have to do that well. ;-) Hungry? This is your place - great food at a great price", "author": "Stephanie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-19", "description": "kla-DOW.\n\ni eat at this place so often i should probably start paying rent.  i looked up the review for the place on nymag.com and saw a picture of myself in there, no joke.\n\ni usually get a spicy classic and a bubble tea, the shredded chicken is also good.", "author": "michael s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-25", "description": "Hanco's is good, but not to the level of Ba Xuyen in Sunset Park, or even Saigon Banh Mi, on Mott.  The bread is fine, but the vegetables are often sodden.  And nothing is reliable, save for the spicy classic.  By contrast, all the sandwiches at Ba Xuyen are worth trying.  And don't bother with any of the shrimp or summer rolls, either.  Limpid and nothing special.", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-21", "description": "i cannot believe that i've not yet written a review of this place. \nit's delicious. and that's what i have to say about it.\noh, and they're fast!", "author": "jessica l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-18", "description": "Excellent, just damn good vietnamese sandwiches, fast service, cheap prices, fresh ingredients.  Also, the bread is perfect.  Not to be missed.", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-06", "description": "Best vietnamese sandwich in NYC.", "author": "Bentobox S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-20", "description": "I love their bubble tea usualli order the cocnut which is really awesome, however the other day i ordered the strawberry bubble tea and it was amazing! it actually had strawberry bits in it. i guess they actually used real strawberry's. it was a very pleasent suprise. I am not to fond of their sandwiches. but they always have customers ho are eating them. try them at lease once and judge for yourself. but the tea is a ure bet!!!", "author": "Tahani O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-25", "description": "Wonderful sandwiches and bubble tea! I used to get the classic sandwich but recently discovered their tofu sandwich which I was weary about at first but turned out to be so tasty! I also tried the Jasmine bubble tea which is wonderful!!", "author": "Jill H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-20", "description": "both me and my husband love their sandwiches! cheap and fast and incredibly delicious! try their bubble tea (don't have the coconut one it tasted weird)\npork sandwich is amazing!", "author": "Anastasia K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-17", "description": "The put a little somethin' somethin' in their sandwiches. Esp. the spicy ones. And I'm beginning to crave their vermicelli noodles more frequently these days. I'm so glad I can grab Vietnamese food close by without having to go to Chinatown.", "author": "Christine H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-07", "description": "LOVE this place.  The tofu sandwiches are my favorite.  So cheap and easy and relatively healthy.  Quick delivery usually too.", "author": "Eat It B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-25", "description": "They make a good sandwich, but it's overpriced ($5) and small. When I'm hungry and I don't want to go out, I'll order delivery from them, but I would rather go to Sunset Park or Chinatown in Manhattan, as they have cheaper, larger sandwiches. The bubble tea is good, but again, i've had MUCH better.", "author": "Eric C."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}