{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-03", "description": "The food tastes pretty good when you finally get it, but I think they go all the way to Vietnam to harvest and assemble the meals.", "author": "A S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-02", "description": "So when I climbed Half Dome over the summer, our party's staple food-for-energy supply came in a huge bag of loaves of banh mi from the local Vietnamese sandwich shop (tell em to separate the veg to keep from going soggy). Moral of the story---you can't get banh mi past mi.\n\nReally its 4.5 stars because it is expensive for banh mi standards. I guess its okay if its for the best banh mi in all of Brooklyn and prob Manhattan and Queens. The boba/bubble tea are a grade above the stuff you find in Chinatown. \n\nThe place is a little hole in the wall off Bergen and is run by a friendly/rowdy bunch of Chinese people. The pork chop and classic are the ones you have to try, they also have veggie options. \n\nBetter than the one on 7th from what I hear. See you there!", "author": "Will C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-27", "description": "It's very strange.  Hanco's has this bizarre gravitational effect on me.  No matter where I am, I start to subconsciously wander in the direction of Hanco's.  Before I realize what has happened, I am inside eating a delicious Vietnamese sandwich, listening to their surprisingly pleasant emo-pop playlist, sipping a sweet and creamy Vietnamese coffee.  I look around and see all walks of human life are inside enjoying the food - from after school brats who just order rice, to stuffy, older yoga women with their purple mats sticking out of their tote bags.  There I sit (the basically unemployed freelance slacker) who slurps his Shredded Chicken Pho soup while watching the snow fall quietly onto Smith Street (on such a winter's day).", "author": "TJ N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-06", "description": "I gotta admit Hanco's is pretty cool. For instance, take their grilled chicken banh mi, the baguettes are lightly buttered, overstuffed with authentic pickled pickles/carrots/ cilantro and mayo...you got yourself a perfect meal!  The baguette just hits the spot, the bread is soft and warm unlike other Viet baguettes that are pretty dry and flaky. And the green tea is not too sweet or bland. Hub always goes for their traditional classic while I stick with my adventurous route. You'll def taste the difference in quality from the marinated stuffing, meat, and baguette itself.", "author": "Linda W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "Grilled pork sandwich 10/10. They dont cut the sandwich all the way so get a knife if you ever order one.", "author": "Dan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-30", "description": "I think my whirlwind romance with banh mi is ready to settle down for some happily-ever-after at Hanco's.  \n\nI've had other Vietnamese sandwiches in the past, but not ones that matched their savory, tender, juicy grilled pork, or substantial yet unassuming roll.  The pickled vegetables are just perfect, and the mayonnaise and sriracha all work in harmony.  Hanco's, you're the only one for me.  Now can I get mine with extra cilantro??  Thanks, hon!", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "Awesome Vietnamese food.  Healthy too!  Staff are friendly and treat me special.", "author": "Jonathan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-16", "description": "Very quick and easy. Good quality Pho (Tried the tofu with chicken broth) for a very reasonable price. Recommended for a quick dinner or lunch fix.", "author": "David I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-14", "description": "These sandwiches are incredible.\n\nI swear by the veggie pork, medium. No mayonnaise. The \"pork\" is chewy and delicious. The veggies are sweet and crisp. It all comes together on a soft, fluffy roll.\n\nHeaven.\n\nThe pearl tea is nice mostly because it's hard to find in this neighborhood. And goes great with the sandwiches\n\nAlso: be sure to get a frequent buyer card!", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-26", "description": "Ordered dinner at 8:25 with expected arrival of 9:10. I even got a text that it was on the way and it never showed up. 10PM and no dinner is extremely frustrating and it looks like they do this all the time. No longer a customer.", "author": "Betsy P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "This is my actual favorite place ever. They have great bubble tea (the passion fruit, mango and milk green tea are my favs). Their sandwiches are so good as well as their protein bowl (grilled chicken and pork are my favorite-I get that all the time). Very wonderful place. Decent seating too + their seamless delivery is always on time with no problems in the food. My tip eating here would be - Get the extra meat for $3. It's worth it. So very much all the worth it. This shall always be my to go eatery and hopefully yours too.", "author": "Iole Marie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-25", "description": "This Hanco's is just as good as the one in Park Slope.  I asked for a grilled tofu this time, wanting to avoid pork and meat for one day.  I know, what was I thinking??\nThe soft, chewy bread with a buttery crunchy exterior, filled with (extra) spicy tofu and fresh pickled vegetables.  This sandwich hits the spot every time, and I always say I want bubble tea but everyone who knows me knows I have issues with drinking (nonalcoholic) calories.  If someone would go have lunch with me there...then we could split both.  Compromise, sigh.", "author": "Lama B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-31", "description": "Discovered Pho here and I don't know if I can compare it to any other place. Large bowls of noodles. The broth is die for.  I only wish it didn't get so crowded. Great service", "author": "Jeanette L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-05", "description": "Thank goodness for Yelp mobile app! Found this place while in the area. Discovered it's right next to the F/G so I will definitely be coming back.\nThe Banh Mi is delish - perfect sandwich to fill and refresh on a hot summer day. A must try for cilantro lovers. The pickled radish and carrots give the sandwich just the right extra kick of flavor.\nPretty crowded during lunch hour with people getting take out but there's definitely enough seating if you have time to sit and enjoy.", "author": "Winnie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-12", "description": "Getting a seat at Hanco's can be a trick given its popularity. So, for my wife and I, it is strictly a grab-and-dash affair... but we have sat there for lunch/dinner once or twice. The space is decent and clean and the atmosphere is good, if you do manage to snare that open table. Now, let's get to the important part - the grub. I like Hanco's a lot but I don't love it. Bear in mind that coming from the west coast, my bar is set pretty high for what constitutes amazing Pacific Rim food. It's in our dining DNA, like knowing great Italian fare is a birthright for a native New Yorker. So I might be a harder critic than is entirely fair.\n\nWhat does Hanco's do well? They make good banh mi (called Vietnamese Sandwiches on the menu). We've had the Classic, Grilled Chicken, Sardine, and Grilled Pork several times. Of the four, I think the Grilled Pork is the weakest. It is just OK. The other three are quite good - particularly the Classic and the Grilled Chicken. On the menu, you'll see the Classic has pâté, ham, and ground pork. It sounds scary but - trust me - it tastes way better than it sounds and it isn't the gut-busting bomb you might imagine it to be. The flavors play off each other well (especially against the pickled veggies). The combination of flavors leaves you thinking \"what is this?\" because it really doesn't taste like ham or pâté at all... in fact you may even forget it is mostly pork. The french bread foundation of the sandwiches is generally good but there have been a couple of times when it was a bit too hard and left us feeling it was day-old not fresh.\n\nThe other really solid choices on the menu are the Rice Vermicelli Salad (the grilled shrimp is my fave), and the staggering array of teas and flavored or milk bubble teas. You can't go wrong on that side of the menu, truly.\n\nWhere Hanco's is a letdown is in their Pho Noodle Soup. I don't know exactly what it is - maybe they use a canned broth or add a bland nuoc mam (fish sauce) to it - but the result is the same. Their soup lacks the 'personality' or lick-the-bowl addictiveness of a really good pho. They have the ingredients but the 'oomph' just isn't there. It tastes like any beef or chicken soup with a few 'exotic' veggies thrown in. \n\nSo, if you go to Hanco's - try the sandwiches and hit the bubble tea but skip the pho.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-11", "description": "The sandwiches at hancos are a great healthy alternative to fast food. The food comes pretty fast and it tastes consistently great. The prices are very reasonable for the neighborhood. I would definitely come back here again and again.", "author": "Dmitriy Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "Originally from an area in LA with tons of great Vietnamese joints like Golden Deli and Mr Baguette in San Gabriel Valley, I was a bit skeptical about Hanco's in Cobble Hill. However, Hanco's delivers terrific, authentic Vietnamese flavor. The bahn mi and bun cha were both very good. The grilled pork tender and well marinated, full of flavor. I only wish they offered crispy pork rolls on the vermicelli salads. Very happy to have Hanco's in my new neighborhood.", "author": "Rick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-02", "description": "Absolutely loved this place, the sammiches are amazing and the bubble tea is like angels swimming in your mouth!\n\nThis place is so good I'd like to get an apartment close by! The neighborhood is really cool and there is a really classy ice cream shop next door that I wanted to try, after leaving Hanco's I just had no room.\nWe had the classic and the shredded chicken, extra spicy, sooo good. Also had summer rolls which were good too. My first time having bubble tea and I thought Thai ice tea was amazing, didn't think it could be beat, never say never. Reviews for this place are spot on!", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-28", "description": "This is thus far my favorite hanco's location in brooklyn.  The shredded chicken sandwich I had today was simply delicious.  The perfectly toasted bread with quality chicken and lots of pickled veggies + spicy mayo was a feast in my mouth.  Their taro bubble tea wasn't bad either.  Definitely go there if you're craving a bahn mi.", "author": "Sylwia T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "Tried the pho and banh mi: both were excellent. Order and pick up food at front. Cafe seating. Low prices.", "author": "Chris H."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}