{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-12", "description": "I have been known to stay away from pork, coming to Hanco's in the past I always chose the chicken banh mi.  It is good, but i did not understand what the big deal was about banh mi.  About a month ago I found the awful error in my ways. The classic sandwich was excellent.  With a delightful mix of flavors and textures.  I do not see myself going back to our feathered friend.  My only complaint is that upon a return visit, my sandwich was lacking in the vegetable department.  I was jealous of my girlfriends sandwich, all overflowing with pickled carrots and cilantro.", "author": "Ovieh M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-17", "description": "Very good.  I got the \"classic sandwich\" consisting of pokr, Vietnamese ham, pate, mayo, cucumber, carrots and of course CILANTRO.  It was delicious.  And only $4.75. \n\nI got the medium spice, and it was not that spicy... so I'm sure it greatly depends on your chef. \n\nMy two complaints are 1) it took around 8 minutes for my sandwich to come out.  Seems a bit long for a sandwich. 2) the French baguette was slightly hard.  I ordered at like 2:00... so I would assume they make a ton at 11:30 and don't remake until dinner time.  \n\nI have never tried \"Nick\" so I can't compare.  But this was a good little spot for sure.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-23", "description": "I had to check this spot out and compare it to my usual banh mi joint - which is Me and My Eggroll  (not 'cause its the greatest but because its close to my house and reasonably cheap).  Anyway, I almost left before ordering because there were these dorky guys whose extremely loud conversation alternated between the gentrification of DC and discussing which of the girls (who had just left) they thought was cute. Sweet relief when they sucked down their bubble teas and disappeared.  \nI ordered the Classic and I think it was one of the best bahn mi's I've ever had.  That sounds dirty, but anyway... Normally I get wierded out easily by the overly sweet or fatty BBQ pork some of these places use.  But this stuff was amazing, the pate was good, not too greasy and the ground pork was spicy, plentiful and quite succulent.  There were a lot of fresh vegetables, tons of cilantro and the bread wasn't too dry and crusty.  Just delicious!!! I'm already anticipating my next visit...", "author": "Maria M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-12", "description": "In comparison to the classic bahn mi sandwiches, Hanco's doesn't have the standard meat and pate. However I've had 2 sandwiches in the past 2 weeks and have enjoyed them both. The bread is wheat but a bit thicker. The meat is flavorful. I have found myself craving a bahn mi sandwich from Hanco's on several occasions!", "author": "Siv L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-24", "description": "These sandwiches are the absolute BOMB. Generously portioned with prices that are easy on the wallet. I prefer the shredded chicken, medium spicy. Wait . . . just thinking about it, I'm going to get one right now.", "author": "Kristen P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-07", "description": "I have only been here once, but it is a memorable experience nonetheless.  I was here on a trip to NY with my gf during New Year's and heard a lot of great things from my cousin, who I was staying with.  It's about 2 blocks away from her place and goddamn was it cold that night.  I'm from CA so anything under 40 degrees is considered freezing here.  The banh mi was calling me so I couldn't turn it away.  I ended up grabbing two of those and an iced coffee for my last meal in NY before my trip back.  I still dream of those delectable sandwiches.  I will definitely be back.\n\nIt is a tiny spot, but the staff there were great.  I caught them just as they closed and they still helped a guy out.", "author": "Jonathan V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-22", "description": "Just stopped in this past week for the \"Special Spicy Pork\" sandwich and really love this place. I was addicted to it about two years ago until I played it out to  my taste buds. Went there just way too much and had to stop. Since I am back I have to say that the taste and quality have not changed one bit and the pricing is certainly reasonable. The sandwich is not skimp at all and more importantly the flavors are big and delicious. This spot is great for the bahn mi, is small and not fancy. Go in get your food read a magazine grab a bubble tea and bounce! You got to try it.", "author": "Zach K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-26", "description": "I remember having my very first bahn mi somewhere in queens. I thought it was THE BEST. But fast forward that experience 2 years later, I find Hanco's.\n\nI always hated commuting to Chinatown or going to Queens to find some reasonable bubble tea all the way from Brooklyn. But I finally got around to googling \"brooklyn, ny\" and \"bubble tea\" together and there pops the lovely Hanco's.\n\nOrdering the classic, I knew my boyfriend and I were never going to turn back for a mediocre sandwich at Saigon's or at Pho Bac's..\n\nI have to say though, I've become a regular here for about 3 years.\nI've tasted nearly every yummy morsel on their menu \u0026 i usually order the vegetarian chicken (it's extraordinary even for a meat lover btw :)) and a side of the honey dew bubble tea---DE LISH!\n\n..Oh if only I can shake the hand's of the genius who made the original bahn mi *foams*", "author": "Elle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-08", "description": "Oh yes!  I've been there countless times for the Classic Spicy, which is *great*, but today -- spurred on by other reviewers -- gave the tofu a try.  Soft, silken, tastebud glory!  Yum!!!\n\nI suspect I'm going to have to start ordering both, and saving half of each...  they're too good to decide!", "author": "Andy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-14", "description": "Previously eaten Vietnamese at Nickys on Atlantic, and they're fine too, but Hanco's offered a sightly better sammich.\n\nWe showed up with a party of 3 on a Saturday afternoon around 2.  We all had classic sandwiches, iced coffees, an order of summer rolls, and tea for dessert.  Everything was fresh, flavorful, and served up FAST!  I'm pretty white, so the sammich set my tongue on fire in the best possible way, and the peanut dipping sauce for the rolls was delish.  The Iced Coffee is sweeter at Nicky's (which I prefer), but an awesome assortment of bubble teas and flavors (black tea with fresh strawberries) gives Hanco's the edge again.\n\nAs per usual in Brooklyn, it's cash only, so leave your cards at home or take to the ATM ahead of time.  It's small inside, like 6 tables (each for 2 peeps only), with one 2-top outside. Most folks we observed seemed to grab and go.\n\nDefinitely added to favorite places in Brooklyn eateries map on the iPhone.  If I lived nearby, I'd hit this up a couple times a week.  Highly recommended.\n\nA previous reviewer was dismayed by $8 lunch, which I find dismaying.\n\n~benc", "author": "Ben C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-11", "description": "As much as I'd like to stay out of the local debate that has developed for Banh Mi in the Boerum Hill area, I feel that I can't write this review without doing so. There's just no going around it; especially since I visited and reviewed the competition just a few days ago. So here it is. Hanco's vs. Nicky's Vietnamese Sandwiches. Round One.\n\nI'd already been contemplating when I would be able to make an excuse to come to Hanco's. There was no better excuse than coming home from a hike on Bear Mountain and toughing it out through 2 hours of traffic. Just think of it as a reward for my workout and aggravation. \n\nWhen I walked up to Hanco's, I half expected a cramped and stuffy interior environment. Well I got the cramped part correct but it was surprising temperate inside. Look what Nicky's has done to me. It's scarred me for life for every Banh Mi place I visit. There were several tables set up inside and a single table outside for people to sit and enjoy their sandwiches. The problem is there are just so many people coming in that standing room starts to get limited. It's a testament to the popularity of a Hanco's Banh Mi in the neighborhood.\n\nI ordered for myself a Classic Sandwich - Spicy for $5.50, which is their take on the tradition Banh Mi sandwich. My order came a few minutes later. According to their menu the Classic contains all the ingredients in your normal Banh Mi but I also noticed they included the word butter in the middle of the list. That seemed a bit odd to me, although I didn't exactly taste any butter. The sandwich at Hanco's is slightly bigger than the one at Nicky's. I believe the meat ration is the actually the about same and they just stuff plenty more of the pickled veggies in. They also stuffed plenty of cilantro into the Banh Mi. Some people might appreciate the extra cilantro but I'm not a fan of cilantro. Another noticeable difference in a Hanco's Banh Mi is the bread. The exterior was nice and crispy but the inside was soft and fluffy; a little too soft and fluffy in my opinion. When taking a bite, bread on the inside tore off much like you get when you bite into a croissant that's been sitting out for a bit. I didn't like that part either. But they did get my order right and gave it to me spicy. Mmm.. spicy.\n\nHanco's also serves a big list of drink items. I was thinking of ordering a bubble tea until I observed a mother and daughter leave with their drinks only to return a minute later saying their bubble tea (made with milk and sweet ingredients) came out sour. I'm not sure if they said the tapioca was sour or the drink itself. It was enough to make me decide to steer clear of the drinks.\n\nI think Hanco's might be a family owned and run establishment. I took a look at the back where the sandwiches were being made. From what I can tell it seemed like my order was taken by the oldest daughter and her two younger sisters were in the back making drinks/sandwiches. Dad was making sandwiches and serving tables. Even grandma was getting in on the action cooking up the meat. That was kind of cute. It was an \"aww\" moment. And they were actually Vietnamese; I even listened closely to see how they spoke to each other.\n\nOk, so lets break it down and see the results of the debate.\n\nComfortable customer waiting area - Neither \n                Nicky's is really hot and stuffy while Hanco's is really cramped\nBigger Sandwich - Hanco's\nCilantro Situation - Nicky's\nThe Bread - Nicky's\nCorrect Orders - Hanco's\nAuthentic Viet - Hanco's\nPrice - Nicky's\n\nWell it looks like I have a tie from my breakdown. Both sandwiches were delicious. I'll leave this debate to the locals and just continue to enjoy my Banh Mi. Happy eating.", "author": "P C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-22", "description": "Very solid food - would definitely go back. Quick, simple, and delicious.  I went with the classic (extra spicy) which was perfect.  Had a nice kick to it with the pickled veggies as a nice compliment.  Check it out for sure!", "author": "Andrew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-09", "description": "I love Hanco's--they are very friendly and courteous.  Definitely one of my favorite Brooklyn establishments!", "author": "Carla S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-01", "description": "My favorite Vietnamese sandwich shop in NYC.  What can I say, I'm absolutely addicted to their pork sandwiches.  Spicy, succulent, plentiful, fresh...mmmm.  I have never been disappointed after having eaten here many times.  Its not much of a place to look at, and while you could sit down for lunch, its really a mainstay takeout joint my mind. Staff is super friendly and nice.  Go there, you will not be disappointed by the food or the great prices!", "author": "Steven T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-08", "description": "Friendly staff, place looks clean, and they have a few seats for eating in.  Everything that's need to be said about this place has already been said these sandwiches are banging, just think that the sandwich could be put together in a better way.  So that you could take a bite and get a bit of each flavor.  The meat is all on one side and veggies on the other.  So when you take a bite you either get veggies or meat.  I know I sould like a d-bag right now but just saying.", "author": "John C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-09", "description": "The bubble tea was not quite what I wanted.  It was good, but a little too sweet and the pearls weren't the right consistency.  \nThe classic sandwich on the other hand, was fantastic.", "author": "Alicia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-15", "description": "Really good bhan mi, and consistent, which is a big deal.  The bread they use is magical, warm and toasty, and they recently upgraded the critical pickled veggie quotient for a more pleasing meat/veg ratio.  Really, really good, and so cheap I feel like I'm getting away with something.    \n\nI would give it a straight 5 but for the shrimp rolls which are, in my admittedly uninformed opinion, just plain harsh, like noshing on a translucent bicycle tube stuffed with low tide scented mix of too-raw crunchy and too-fishy squishy.  Ew.", "author": "Eric S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-06", "description": "We picked up two Classic Sandwiches super spicy. Ingredients include ground pork, Vietnamese ham, pickled carrots and daikon and cilantro on a very fresh roll. It was delicious, well balanced and very fresh. Dinner for my wife and I for $11. Hard to beat that. I'll be back and you should give it a try.", "author": "Korye L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-16", "description": "Though I prefer the other Hanco's location, the veggie chicken sandwich is so. damn. delicious at either. Remember to bring cash.", "author": "Zubaida S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-05", "description": "I've been here like 3 or 4 times, and each time I was really happy with the service and my food. I go to college in downtown BK so its nice to find a good Bahn mi shop that's not in Chinatown to go to.", "author": "Fatima T."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}