{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-17", "description": "Sometimes ignorance is a wonderful thing. There is beauty in not knowing.\n\n- I don't want to know what goes on in the kitchen of my favorite restaurants. \n\n- I don't want to know if she's faking it (although ladies, sometimes the snoring is a dead giveaway)\n\n- I really don't want to know how cheap a banh mi sandwich is on the West Coast or Canada.\n\nIt's hard to get 2 slices of pizza or fast food for less than $6 , but for $5.50 at Hanco's you get a pretty kick-ass sandwich. Besides being cheaper than fast food the abundance of fresh veggies makes me feel like I'm eating healthier. The pork is well seasoned and never greasy, the bread is fresh and they never over do it with the mayo ( I'm not a fan of mayo drenched sandwiches).\n\nOnly two shortcomings i can think of :\n\n1. While I'm not familiar with West Coast pricing I do know you can get a larger and cheaper banh mi in Chinatown. Saigon Vietnamese is hard to beat for $4.25\n\n2. Balance of meat \u0026 veggies. \nScroll up to peter d's review for explanation. \nToo lazy ?\nOkay. They seemed to put veggies on one side meat on the other. You can't eat meat \u0026 veggies together in single bite. This may be good if you ordered a spicy sandwich and are using veggie side to cool down. Or maybe if you sharing sandwich with a vegetarian. \nBut for the most part the balance seems off.\n\nNot the cheapest, but still a good deal.", "author": "James F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "It was a very warm Saturday afternoon, when I came across this establishment. I was a little hungry and walked in not expecting much. Well, the place has air conditioning! At first I wanted to order to-go, but it was so pleasant inside that I ordered to stay instead. They have a rack of magazines that you can leaf through while eating or waiting for your order. I had the classic sandwich, a smorgasbord of pork meats topped with crunchy shredded veggies all enveloped in a soft toasted baguette. I also had the iced honey green tea, which was not too sweet, but thirst quenching. The place was clean, peaceful, rather large. At the end of your meal, you just don't want to leave. \nThis address does not do deliveries, only pick ups.", "author": "Dullua C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-05", "description": "Two words, pretty awesome. I think about popping into Hanco's every time I head for the Bergen st. stop. The shop is small, with a few seats (translation: no bathroom for you) and a friendly staff.\n\nI have only been to a few banh mi places in NY but this is the only one that I would willingly stuff one down my tummy even when I'm not hungry. \n\nAh, the gluttony. \n\nI have tried all the variations except the chicken, vegetarian and the sardine ones, they were all thumbs up. Their spring rolls are alright, nothing to write about. Bubble tea is ok too, although I obviously prefer Ten Ren's better. \n\nSo apparently Hanco's Vietnamese sandwiches are slightly overpriced but I'm ok with it. Why? Because it is delicious and good enough to fill you up under $6. You get ripped off most of the times when you go have brunch, but hey... you still go for it.", "author": "Isabella W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "there are not enough Vietnamese spots in this neighborhood especially after Nicky's closed a couple of years ago.  \n\ni love hanco's!  it is a great takeout place for both lunch and dinner.  i am never disappointed with the summer rolls or tofu vermicelli.  it's hard to find fresher summer rolls around here...the rice paper is actually soft and chew-able!\n\nlove it!", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "I like this place for takeout.  I stop here for a healthy lunch with bubble tea on the go.  The lychee bubble tea is expecially yummy, the vegetarian sandwiches are delicious too!", "author": "Wanda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-17", "description": "I am obsessed with this place and their bubble teas. Taro bubble tea is my favorite. And have it cold or warm. Great place for vegan options. \nWatch out on delivery, they often make mistakes.", "author": "isaline A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-26", "description": "The sandwiches are delicious , as are the soups. However, this is the second time I have gotten food poisoning from their classic sandwich. The first time I gave it the benefit of the doubt. This time it was 100% from the sandwich. Don't eat here. The taste experience is not worth 24 hours of misery.", "author": "Livvie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-29", "description": "To me, Hanco's gives Lotus a run for its money for the best vegetarian banh mi!\n\nCame here and immediately wanted the vegetarian pork. Unfortunately, they were out and went for the vegetarian chicken instead. Despite being my 2nd choice, it made me totally happy.\n\nThe veg chicken was in nice huge chunks and still steaming. The baguette was perfectly toasted and still fluffy on the inside. The pickled vegetables were fresh and  crisp... and the protein to vegetable ratio was perfect. I finished in one sitting, so it was also perfectly sized.\n\nI will definitely be back... and need to try the vegetarian pork, as it is my new measuring stick.\n\nMaybe I'll even add another star... we shall see.", "author": "Elvir C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-31", "description": "I could live off Hancos sandwiches. \n\nIf you are body and calorie conscious like me, get the shredded chicken sandwich on whole wheat with no dairy (sans mayo and butter).\n\nOne time my husband got me a sandwich on white bread and I refused to eat it. I took the insides out and put it on whole wheat toast and it wasn't the same. Their bread is incredible. All of the ingredients balance compliment each other in just the right way.\n\nIf you get it \"hot\" it will come with jalapenos. I suggest getting it medium and keep the bottle of Sriracha sauce on hand...I pour it on every bite. The vinegar from the veges balances out the spice. It's a sad story when I drop ONE pickled carrot on the floor... \n\nCherry on the sundae: Punch card which gets  your 10th sandwich for free.", "author": "Kim S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-04", "description": "The classic banhmi was good with fresh ingredients.  Nothing too out of the ordinary there.  What surprised me was how good the skim milk original boba tea was! I'm accustomed to the cloying sweetness of condensed milk that the skim milk was a very refreshing change and you got to actually taste the tea.", "author": "Cindy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-06", "description": "Awesome, inexpensive, Vietnamese sandwiches. Perfect for a gourmet picnic at Prospect Park", "author": "Carl L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "Legit Viet in NYC. We got pho and the bbq pork banh mi.  Closest thing to Westminster I've found so far", "author": "Micah F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "I absolutely love this spot. Fast service, they are very friendly. Food is delish!!! My fav is the shredded chicken sandwich and the mango bubble tea. Yummy in my tummy", "author": "Monica V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "For $7 each, the price and taste of these banh mi sandwiches are incredible. We ordered delivery and it came super quickly. The sandwiches are huge and filling - couldn't finish one in one sitting, which means leftovers - always a good thing :) The tofu banh mi was so tasty. Would so get it again.", "author": "D L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-13", "description": "Decent sandwich. At first, the cashier accidently gave me and my husband the chicken sandwich and we didn't like it. The meat was chopped into larger chunks than we liked. We told them they gave us the wrong sandwich and they replaced it with the right one. I had the one that had all the meats and it was minced. I like my viet sandwich with minced meat.  It was good but nothing to rave about. I guess I have high standards when it comes to Viet sandwiches.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "I've eaten the Vietnamese sandwiches numerous times now. Hasn't disappointed yet. Really recommend.", "author": "Jardley J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-14", "description": "Definitely my most consistently ordered from place since I moved to Boerum Hill 8 months ago. I've been limiting the amount of meat I eat for a few months now and their veggie-chicken and veggie-pork (both tofu) banh mi's really help me get my fix.", "author": "Zack L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-14", "description": "Great place to eat at such an affordable price. The spicy option is actually spicy too. Nice place", "author": "Shawn M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-17", "description": "WOO! I've been meaning to try this place out for a while. I know there's a couple of locations in Downtown Brooklyn but never had the chance to till last week. I ordered the classic, which is your typical pate with roast pork. The daikon could use some work, it definitely was not as sour and tasty as I expected. BUT, they make up for that with the bread and meat filling that they use which was practically perfect. Will update this review again once I try the iced coffee.", "author": "Andy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-14", "description": "Hanco's has delicious tasting Bánh mì Vietnamese sandwiches for sure (note that their version of the popular ground pork variety is called the \"Classic\" on their menu). Their \"Classic\" ground pork Bánh mì is served on french bread with veggies (carrots, cucumbers, cilantro, etc.) and can be ordered mild, medium, or spicy. IMHO, although the ground pork is tasty and juicy, there's just too much bread and not enough meat. I saw where Hanco's has an option to add double meat to their sandwiches, but I'm not sure how that would work out because of the shape of the bread. Also, I ordered mine \"medium\" spicy, and it was hardly spicy. At any rate, the sandwich was good... don't get me wrong.... but maybe my expectations were set to high from all the reviews I read on Yelp!\n\nAs an appetizer, I ordered the fresh summer rolls (like fresh spring rolls with shrimp and served with peanut sauce). These were good but far form the best I've had.", "author": "Scott B."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}