{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-13", "description": "God why is your viet coffee so good! I don't have sugar in my coffee so I ask for less condensed milk- always accommodates my request!! I've gone to other places where they have given me crazy looks when I ask for less sweet... This place is just very good and a good treat. Today, that's all I went in for but ordered a grilled pork viet sandwich for a veteran outside asking for help, too bad he left cus i wasn't able to give it to him. Saved it and will be eaten by another lucky person cus it's perfect!", "author": "Gloria M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-30", "description": "Notes I took while walking home eating the spicy classic:\nDefinitely Chinese, paper ticketing system, a ton of microwaving going on, will make your order as long as it's in before closing time (9pm on most weeknights), don't expect a quick wait because there are a lot of pickup and delivery orders, meat had a strange mushroom odor, spiciness unevenly distributed", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-16", "description": "Hanco's sooo delivered on my Asian sandwich craving. Got the tofu vermicelli bowl and grilled pork sandwich. Tons of tofu and pork, awesome grilled flavor and such good value for the money. Also super quick service. All UNLIKE Red Star Sandwich shop down the street who's either shrimp or pork belly sandwich got me sick, but they had the review removed from Yelp, which is bs. (C'mon ppl, restaurant inspection grades are public knowledge. Hanco's has never had more than 12 points = A. Red Star has had the equivalent of a failing grade more than once in the past.) Bottom line, if you're craving Asian food, go for the more affordable, tastier Hanco's and avoid Red Star!", "author": "Mora G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-02", "description": "It's a little blasphemous of me to love their pho as much as I do. It's so wrong.\nWhy? Because you can choose what kind of broth you want, with what kind of protein.\n\nEgads!\nIt's also been a looooooooong time since I've had pho outside of Hanco's that I can actually call \"good\". So maybe my pho barometer is a little shot.\n\nBut eff it, I need my pho fix. If it's cold outside, if I'm sad, if I'm in the mood for something warm but light, I turn to pho.\n\nAnd the fact that you can mix different broths with different proteins. Sometimes instead of beef on beef, I want a beef broth with tofu. As of late, I have been going for a vegetarian broth with tofu (though vegetarians, they have vegetarian meat). And it's still good! It doesn't just taste like salt! And the noodles are the right kind! Side-eyeing you, every other pho place I've tried in NY.\n\nThere are layers of flavors in broth. Admittedly, it is not quite love that's in it, but maybe a \"like you a lot\" feel.\n\nThe price is *decent* as well (decent for NY, not SoCal): $9.25 with tax. For some reason it's a few cents more expensive than their Brooklyn Heights location, but that location doesn't have vegetarian broth.\n\nAdmittedly it's been a while since I've had their sandwiches, but I can't imagine it's changed too much. It's decent. It's no Lee's sandwiches (I really miss the ridiculously hard bread...), but it'll do.\n\nAnd the boba is pretty darn good.\n\nThey have a \"rewards\" card for pho, sandwiches, and boba, which is a little annoying that they're all separated. But if you go there enough, it just might be worth it.\n\nI haven't tried their other stuff. Because honestly, I just needed a pho in my life that's decent, that's easily accessible, and here we are.\n\nAlso, I don't know if this matters to any of you (maybe only to the true pho-ers), but they are Chinese-runned. I grew up on decent Chinese-owned pho places, and this is pretty much like that (meaning, it's good, but you know it's a few notches below what pho could be).", "author": "Melody C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-03", "description": "Great food, bad, unfriendly staff/service.", "author": "Asif K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "Tasty sauce, crunchy julienne carrots and radish, cilantro, and warm chicken served on a toasty wheat baguette that isn't hard enough to rake the skin off your palate. What's not to like? \n\nI've been to two Hanco's locations, Smith Street and Montague Street. At the Montague Street location, I encountered a language barrier at the pickup counter, but persevered to get my satisfying sandwich. The tables at the Smith Street location weren't that clean.\n\nUnfortunately, both locations have an odd smell, maybe due to the tea they brew. Still, they both have A sanitary grades.\n\nI find Hanco's to be better than Num Pang Sandwich Shop, but neither will truly fill you up for long, even though the sandwiches look really big.\n\nAnd I'm not a fan of the peanut sauce that comes with the shrimp roll.", "author": "Zenovia E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-03", "description": "Love Love Love their sandwiches! Very tasty!  And they're cheap too!  Service is quick. I also like their rice vermicelli salad. The portion size is pretty big. Haven't had a chance to try the bubble teas. Good place for takeout! Would definitely go back and try their drinks.", "author": "Lily S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-30", "description": "Love!!!! Best Vietnamese sandwich ever!!! I'm addicted. Everything here tastes fresh and delicious. Very well priced and delivery is punctual. I'm a fan!", "author": "Maria R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "The vegetarian chicken sandwich and fruit-flavored bubble teas are my jam. I make a stop here nearly every time I find myself in Cobble Hill, and though I'm sure the phos and rice vermicelli sate tasty, I always stick with the banh mi because it's that good. The sandwich has the right amount of meat/mock meat-to-vegetable ratio, and just enough mayo dressing to hold things together.  (I'm usually a mayo hater, aside from the chipotle variety, but I can't even taste it in this sandwich.) You can get varying levels of spicy, but they also have sriracha sauce bottles floating around to spice things up even further. \n\nThe bubble teas are sweet without being too sweet, and the medium is just enough to wash down a sandwich. The typically come cold, but you can also get them warm for those cold days. \n\nThe employees are friendly, and I've never waited more than five minutes for my food. The restaurant also has a pleasant, rustic-looking decor inside.", "author": "Dominique N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-25", "description": "BEST BOBA IN BROOKLYN!!!\n\nI'm a Bubble Tea Addict and I've been to SO many bubble tea places, but this one .. takes the prize!\n\nThe boba is so fresh and made right in front of you, I always get the Lychee boba with either Green Tea or Lychee jelly and extra boba of course (You can just taste the freshness in the boba not like other places)\n\nI've tried the chicken sandwich, It's good! I got it spicy with either white or wheat - super yum. But I mostly go for the Boba.\n\nAddicted to Hanco's!!", "author": "Shann R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-30", "description": "This is the kind of food you want to write a song about. Like a song has many notes or even layers of depth, this sandwich does too. You've got the spice, the sweet, the bitter and the freshness all in one bite.\n\nHanco's has become one of my favorite spots to hit up during lunchtime. It's a bit of a walk from work, but since I'm pretty speedy I can make it there and back with time to spare. The inside is small and from what I've seen so far... always packed. And for good reason. These sandwiches are pretty damn tasty. Hanco's has a nice variety options on the menu -- salads, vermicelli, pho, bubble tea and of course... their Banh Mi. \n\nAt $6.50 you get what you pay for. Like others have mentioned, at a first glance the Banh Mi looks small but it's in fact packed to the max. I've had the shredded chicken, classic and pork sandwiches... all equally delicious in their own right. If you want wheat bread (like I always do), they have it. And my favoriteee feature: choosing mild/medium/spicy. Spicy it is! Their hot sauce surely packs a punch so beware. The bread is super crispy, hold the insides well and everything juicy/flavorful. The only con, is when it's gone! (Bad rhyme for ya.) A must try.", "author": "Katie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-08", "description": "Delicious vietnamese sandwiches! Came here for a weekday lunch with a friend visiting from out of town. They toast their french baguettes so the bread is warm, and not too hard. Stuffed full of fresh, pickled veggies and bbq-ed meats. Yum. One of the best I've ever had. We also tried one of the vermicelli noodle bowls, which was good, but not as amazing as the sandwich.\n\nSimple shop. Order at the counter and then grab any open table.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "Hanco's is my \"go to\" lunch spot in the vicinity of downtown Brooklyn. \n\nI can't say much about anything other that the terrific white meat chicken sandwich, which I like spicy. I comes on a nice sized baguette with 'pickled' julienned carrots and some other vegetable. Truly delicious.\n\nOh, and the 10th sandwich is free, which is also nice.\n\nGood luck getting a seat, though. I try to go about 15 minutes before the hour, when some people are heading back to their offices.", "author": "Fred B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-07", "description": "Probably the best bahn mi you can find in this area. Absolutely delicious and authentic Vietnamese food all around. There is no way you can come here, get the bahn mi or pho and not be happy. It's a winner all around. I've tried the grilled pork bahn mi and the original, and honestly the grilled pork is ten times better. Paying for extra meat is worth it. and the Pho is flawless. I would have this every other day if I lived in the area, especially with the winter season coming up.", "author": "Sam T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "This is my favourite place for cheap eats in Boerum Hill. The sandwiches are terrific and the pho is not too bad.\n\nI'm raving about Hanco's because the vegetarian selection is so terrific. The veggie chicken is second to none; the veggie pork is damned tasty, too. (The tofu is only-so so.) Bonus: ask for your bahn mi on whole what. Not traditional, but delicious.\n\nService can be slow during busy times, so it pays to call ahead (or order online) and get take out the lunch rush.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-28", "description": "This is a perfect spot to grab bubble tea and Vietnamese with friends. I generally come here once a month, some of their bubble tea flavors are way better than others, I have been disappointed by their honey and lychee bubble tea, but some flavors like strawberry, taro, and honeydew, are particularly good. I'm also a fan of their pho and summer rolls. The setting is a casual, order at the counter environment, and the service is good.", "author": "Zelie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "Hancos has been a favorite spot of mine for 4 years now. The prices are cheap. The sandwiches are bomb. The pho is bomb. The taro tea is bomb. The bubble tea is bomb. There's a punch card here for the teas. Make sure you pick one up. You won't be dissapointed by Hancos.", "author": "Lauren J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-28", "description": "I have become a big fan of Bahn mi vegetarian chicken and vegetarian pork. I have had here twice and no change in taste, pretty good. I m waiting to try Pho and some actual meat dishes.", "author": "Chinmayee M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-24", "description": "Came to Hanco's after a hackathon. I didn't order any grub, but I did get a fancy tea. The tea was good and priced fairly. \n\nI'll definitely come here again and try their food.", "author": "Aaron L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "This has pretty reliable Pho. I typically order take out from here when the Pho mood strikes me. I always get the vegetarian version and I enjoy it. The broth has good flavor, the tofu is cooked well, the noodles are cooked al dente and are not soggy. There could be more veggies. My family enjoyed their chicken pho and Bahn Min as well. They said it had good flavor. Everything used is fresh. The prices are good as well. Great location.", "author": "Joanna V."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}