{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-19", "description": "The sandwiches are delicious here.  Classic with spicy. Yum.\nBy the way, the owner is chinese/vietnamese even though all workers in there speak cantonese.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-26", "description": "i've been going to hanco's quite some time but the last time i went i saw 2 baby roach crawling by the counter, i look at the cashier and she pretend she didn't see it but brushed it off with her barehands, i told her to cancel my order and just walked out. NO matter how good the food is, if there is any 4 legs crawling around, I would never go back again and i don't know if the cashier would make my sandwich. yuck!!!\nTheir 2nd store is soooo overly priced and the sandwich taste very bad, the bread so  overly toasted that when i bite the bread it breaks in 1/2, the pate has this sourly taste like it was bad, it was just a very bad experience. And I don't like the cashiers there, very bad manners.", "author": "Gloria S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "Truly deserving of its rave reviews. Incredibly, incredibly, incredibly delicious sandwiches for $5.50 (tax included) each. Eat.", "author": "David S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-16", "description": "I like their bahn mi! I've had the classic and the chicken, spicy and not-as-spicy, and I can definitely say that I think I'll go with 1) the classic and 2) the spicy. Their salad rolls are a little meh, but not bad, just a bit boring. Their boba is good and comes in a wide range of flavors. They do lag a little more than they need to at Hanco's, I think, at least for how many people are working in the kitche. I've been there a half a dozen times, in various states of busyness -- it just seems like it shouldn't take that long to make a sandwich, you know? I know, I know, there are people who call in, but all the same, in a relatively slow hour of business, I've twice had to go up and ask if they'd lost my order or something. The clerk both times immediately handed me a ready-to-go bag and said sorry, which is fine, but I'd been sitting there staring, waiting for an indication that my food might be ready.  As someone else complained, Hanco's often filled with high school kids. I'd almost rather there be no seating, no eating-in, because after eating onsite a few times, I've accepted eating there isn't really comfortable.", "author": "Kate M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-13", "description": "vegetarian chicken sandwich is off the chain.  so good.  i am not man enough to get spicy, i can only handle medium spicy.  i love the whole wheat rolls.  this has become one of my favorite lunches on the planet.", "author": "perri p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-25", "description": "What Hanco's lacks in decor, it makes up for in tastiness and speedy service. I have the classic spicy on whole wheat probably once or twice a week, but I could honestly eat one every single day. Awesome sandwich for a good price.", "author": "Meghan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-22", "description": "Their banh mi was insanely good. Like, dream-about-it-until-you-can-have-it-again good. And their summer rolls were pretty fantastic, too. My only complaint is that I live JUST outside their delivery area :-(", "author": "Anna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-12", "description": "Best Banh Mi around. Great bubble tea. Maybe it's a little pricey, but since it's SO MUCH BETTER than its (Brooklyn) competitors, I can happily live with it.", "author": "CJ D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-09", "description": "This place is amazing!  The sandwiches are off-the-charts delicious and the salad rolls are great.  DO NOT, however, go to their new sister store in Park Slope.  The new location is ruining the Hanco's reputation and is not indicative of how great this place is.  They have the same name, but the difference in quality is shocking!  Bergen Street Hanco's is great!!", "author": "jenny l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-07", "description": "This was a fast, cheap favorite when I lived in Cobble Hill.  The shredded chicken sandwich is delicious with their original milk tea. Yummmmm.......", "author": "Angie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-10", "description": "Finally had a chance to make it over to Hanco's and it was my first time ever having a banh mi and it was absolutely delicious! I went with the spicy chicken version (as did my hubby) and we wolfed it down stopping every so often to fan our mouths from the spice (and we love spicy food). Loved the mix of the fresh and warm bread, the spice, chicken, and pickled veggies. Yum! We will definitely become regulars here!", "author": "Urban B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-26", "description": "For those who haven't tried a bahn mi, this place will exceed expectations!  I had my first bahn mi here and it was an excellent combination of flavors (delicious pork with vinegared vegetables, lettuce, etc).  The bread is also very key and this place usually has fresh bread.  I'll usually go for the Classic - Spicy and it nevers fails to be a good quick meal.  Also have tried the vermicelli salads (plain and with shrimp) and they're pretty good.  I like their fish sauce as it's not overly fishy but more nuanced.  Have yet to try a bubble tea - they look ok.  But just note - it's not much for atmosphere.  There's 5-6 tables but it's pretty bare!", "author": "Lina H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-05", "description": "im a big fan of vietnamese sandwiches and a ice cold coffee on the side, this place suits it all. the only downside are the spring rolls and the peanut sauce that comes with it. the delivery is kind of lacking but the sandwich and the drinks there are great!", "author": "linna c."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-06", "description": "Park Slope Location - really great food, but they delivered to us last week and then tonight 45 minutes after ordering they call to tell us they won't deliver to us. This is ridiculous and terrible business.", "author": "A L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-12", "description": "i've never tried a vietnamese banh mi before, but my NY friend said i HAD to try one at Hanco's. O.M.G.!!!  it was the yummiest thing ever!!  i had the chicken with mild sauce.  it was to die for. i especially loved the pickled radish and carrots; they went so well with the sandwich.  and the bread was awesome - perfectly toasted!  definitely will go there again if i'm ever in NY!", "author": "linda k."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-22", "description": "i must say that i was surprised to see people saying that they prefer hanco's to nicky's. hancos has it all wrong and let me tell you why. first and foremost, their meat to bread ratio is off. the sandwiches are over stuffed. and second they fill the sandwiches as if it were a taco with the meat all on one side and the veg on the other making it impossible to get a complete bite of meat and garnish without eating the sandwich sideways. furthermore, they are simply bland city. how about some flavor up in this place?!", "author": "Colin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-05", "description": "Have had the pork, chicken, and shredded chicken sandwiches so far. The pork is hands down the best! The difference between the regular and shredded chicken is that the latter is all white meat and unseasoned. Love the ratio of meat product and the carrots - I think at other places they skimp on both. The bread is perfect. I usually also get the iced coffee. It's always crowded, but I've always managed to grab a seat. It's right off of the F train, so that is an extra plus. Much recommended.", "author": "Daria U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-28", "description": "love, love, love!  i have an unhealthy obsession with both the bun with shredded chicken as well as the spicy standard sandwich.  5.50 for a sandwich worth dreaming about?  totally worth it.  and they are beyond quick.  just remember to bring cash!", "author": "A k."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}