{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-11", "description": "A friend of mine just moved to this neighborhood, and now I'm not sure if I visit because of friendship or Hanco's.  The classic spicy is the stuff of dreams, and it's what a Vietnamese sandwich is meant to be--lots of pork, the right balance of spice, and a fresh, crunchy roll.  Hanco's, I love you. You're perfect.", "author": "Trevor S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-09", "description": "Though Hanco's puts out some solid banh mi, its horribly inefficient kitchen and clueless service scream \"ban me.\" I would put Hanco's banh mi at about a tie with local rival Nicki's. Nicki's has better and more balanced filling, but holy crap, the rolls they use at Hanco's are the real deal. Seriously, where do they get them?!\n\nI once called in an order at 11:30 a.m. on a Saturday and an hour later I still had nothing to show for it. Order after order went in, and next to nothing came out of the kitchen. They even took a summer roll out of my order's almost-finished to-go bag and gave it to an annoyed customer, a minute later explaining that all I was waiting for was a summer roll. Good job.\n\nPhone in your order on a weekday. If you have anything at all to do on a weekend, don't bother.\n\nBanh Mi: 4 stars. The rolls they use are freaking unreal.\nService: 2 stars. Utterly incompetent, though seemingly well intentioned.", "author": "Jeffrey W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-26", "description": "Hanco's is so good! I ordered the classic sandwich and the mocha bubble milk tea. The bubble tea was so good and the tapioka is awesome, its like perfect and not too mushy. Its a little pricey for a bubble tea (4-5 dollars) but I think its a perfect compliment to the sandwich. The bread is really good and the veggies add a nice crunch. Its a 6 dollar sandwich, not bad! So a typical lunch for one person is around 10 to 12 dollars. The food was great and I loved the location. I'm just not into their rolls and the packaging of them. They're placed on a foamy dish then wrapped in plastic /: Oh, and the lady at the Bergen Street is ridiculously cute and enthusiatic. Aw, they're so nice there.", "author": "Maddie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-03", "description": "It's rare when a weekend goes by and we don't hit up Hanco's. It seems that the Yelpers have pretty much covered all it's spicy goodness. The sammie quality ranges a bit but honestly, it's always yummy.", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-08", "description": "a destination\nwhenever i can make an excuse to visit carroll gardens, i go here. its right off the bergen stop. when i lived here, i'd go all the time. i've never waited that long. i'm not a big fan of the bubble tea, but the sandwiches and salads are fantastic. i've yet to find a replacement in or around chelsea.", "author": "Todd A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-08", "description": "Excellent sandwich!  Taro bubble tea is a must to help with the heat if you like them spicy.  Also the spring rolls with peanut sauce, in a word, amazing.  Much better than nearby other Vietnamese sandwich spots.", "author": "stephanie a."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-23", "description": "The classic is a great sandwich! I like the way the vegetables are thinly sliced and carrots are so sweet. It also seems like there is more 'stuff' in this small(ish) sandwich.  Dont be fooled, this small and seemingly simple sandwich will fill you up, and if you ask for it spicy make your nose run. I am pretty sure they put Sriracha on it so if you add that at home you can make it as spicy as you want. Cool down with a bubble tea. For $5, this sandwich cannot be beat. Some people complain about the wait time - just call ahead and walk over.", "author": "Sharon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-10", "description": "I think the only reason I go to work is Hanco's.  I don't eat pork so never tried their classic sandwich, however, co-workers love it.  I usually get the chicken,original bubble tea and shrimp roll.  It's fresh and packed with layers of flavor in each bite.  I love the cilantro and pickled carrots that they put in their sandwiches.  I think they have about 8 different types of bubble tea, so far I tired original, lychee and jasmine.  None of them were disappointing.", "author": "fayza a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-11", "description": "I have traveled wide and far and this is the best banh mi in all of the city. My friends and I come here every Sunday (sometimes Saturday, too) for lunch, and let me tell you, it never disappoints. I can't imagine anything that would make my stomach happier than pork banh mi in medium sauce and a Vietnamese ice coffee. Their spring rolls are delish, too!", "author": "Hong-Nhi D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-11", "description": "Straight up hole-in-the-wall bahn-mi joint.   I chose the vegetarian pork (don't ask why), which I will never do again.  The bread, though, was good as were everything else.  My date's classic was also delicious.  Not my favorite Vietnamese sandwich shop (Saigon Shack on MacDougal), but a worth a drop-by if I am in the area.", "author": "Kamalesh R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-02", "description": "I was in town for the weekend and needed a good pho fix. After a quick online search, my date and I decided to check this place out since she's new to Brooklyn and is also interested in trying out the local food scene. We ordered the grilled pork bahn mi and the charbroiled chicken pho.Whist the presentation was a bit austere in comparison to other places I've been to across the country, it surely made up for it with taste. It was very basic, but the charbroiled chicken was delicious along with the pork, which had a hint of bbq. Again, this was a different take on pho, especially since it lacked some of the side garnishes you usually see (thai basil, cilantro, pickled red peppers, etc.). Regardless, it was all very flavourful and nearly perfect except that the ambiance left much to be desired. This is perhaps not the establishment's fault, since we did not know that this is more of a local cafe-style hang out, rather than sit in restaurant. I generally don't mind this type of setting, but I did mind getting essentially trampled by a knitting club, who happens to meet on Saturday nights, and were not very polite or apologetic at taking our table and seats and virtually driving us out; hence, our dining experience was rushed and a bit uncomfortable. However, we will come back, but perhaps on a different day and time.", "author": "Santiago T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-23", "description": "I live very close and go very often.\n\nYeah, sometimes you might have to wait a little for your order (they get busy), but hey--it's worth it.\n\nVery, very good.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-06", "description": "I dream of their sandwiches. I get off the subway a stop early just to enjoy them on weeknights. They're off the beaten path just enough to avoid wait lines affording me the smallest amount of time between order and freshly made goodness. My stomach thanks me, yours will too. My only gripe - not open early enough for my weekend mid-morning hangover needs. Otherwise I savor these treats on the only outside table if i'm lucky.", "author": "Gordon M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-13", "description": "I just go for the bubble (tea) coffee...the iced vietnamese coffee with extra bubbles is amazing! If I'm spending $4.50 I'd take this over a frappuchino anyday. \n\nBubbles are usually pretty good, but on the oversweetened side, so you might want to tell them to hold the sugar until you taste it.\n\nMy only complaint? They don't have splenda or artificial sweetner, so if you're not a sugar fan there are no options. Small cute place, better for takeout than hangout.", "author": "S S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-29", "description": "Good, cheap Vietnamese sandwich. We get take out once every week! Will need to try their bubble tea.", "author": "Nikki M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-19", "description": "i loveeee their sandwiches. i can't get enough of it. the place is kind of small but i don't really mind that. also, i've tried bubble tea from over a dozen places and with that said, the tapioca at Hanco's is incomparable. really!! go try ittttt. you'll be amazed.", "author": "clementine k."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-07", "description": "The food is not nearly as good and a lot more expensive than other Vietnamese restaurants in Chinatown (e.g. Nha Trang One).  The last time we had the vermicelli noodles, it had a strange soapy like taste.  I called to complain but was told that the noodles were probably still on the wet side (however that doesn't explain the awful taste).  Perhaps that's one reason why they received a \"B\" rating.", "author": "rj s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-19", "description": "I've become seriously obsessed with this place lately. It started out that I would just walk in a get a bubble tea (which is the best I've had) when I happened to be down on Smith Street but ever since I tried my very first banh mi it's become a serious addiction. I have serious cravings for Hanco's weekly. My mouth is watering now actually. I might need to go down there.", "author": "Breanne K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-03", "description": "Hanco's is my banh mi of choice in Brooklyn. They're super quick to deliver and their sandwiches are bombtastical. I'm also hooked on their taro bubble teas! It's my go-to-dinner when I'm starving after a long day at work and I'm too lazy to cook.", "author": "Monica L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-08", "description": "Amazing sandwiches and a bargain, my wife loves the salads as well.  I'm not a big fan of the bubble teas, what the hell are you supposed to do with those damn tapioca balls anyway?  Although the sandwiches take forever to make, good things come to those who wait.  Two words - Classic Spicy.  Ummmmm.", "author": "Brent B."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}