{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-04", "description": "I'm not going to wax poetic on the banh mi's many virtues, but I will tell you that for less than $5, a banh mi will: a) fill you up, b) be delicious, and c) make you very, very happy.\n\nHanco's may not be the best Vietnamese sandwich shop in town, but it's reliable. The bread is generally fresh, the bubble tea is tasty, and when you order an extra spicy sandwich, you're guaranteed enough jalapenos to make your eyes water. \n\nYes, please.", "author": "Krissy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-09", "description": "I am obsessed with the classic sandwich. It is just perfect: fresh baguette with a nice crunch and a bunch of delicious meat and veggies (getting hungry as I'm writing this) and nicely priced for a great lunch. My team orders from Hanco's all the time, and every time it takes a bit longer than I'd like. Understandably so, Hanco's is located at least 15-20 min (walk) from my office. A good trick is to order well in advance!", "author": "Anna G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-30", "description": "Came here with my family and ordered the beef pho, shrimp pho, pork pho, and two orders of the combo rolls. The pho was just okay - a little too salty for my taste. Also, I was disappointed that the combo rolls were pre-made and placed in a styrofoam plate with plastic wrap. It pretty much tasted like it looked. Overall, just okay.", "author": "Victoria P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-31", "description": "The banh mi are fresh and delicious but the staff are lackadaisical and  consequently the tables are dirty. A bit of Windex  and I'd give it 5 stars.", "author": "Saul G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "The environment seems comfortable when going inside and it seems to have enough chairs and tables for people who want to stay in and eat. Ordered the bahn mi, beef pho, and also the thai milk tea which all turned out pretty well. The wait wasn't too bad and  everything was pretty flavorful and yummy. Would definitely come to eat again!", "author": "Sharun L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-22", "description": "I LOVE this place!  I was going to a medical assistant school nearby and would come here for lunch. MY usual order was always the pork sandwich, extra spicy and coconut bubble tea. It was as if I died and gone to heaven!!!!! It sucks when crave hancos because its not really close by for me and there's nothing to do and stop the craving. MUST TRY!!!!!", "author": "Katherine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-09", "description": "*eyes lowered, deep voice*.....Banh Mi....I think I love you!!!\n\nWhy would I pass on eating a Banh Mi is B-anh-d me!  At first sight, the perfect marriage of love and happiness is very apparent.  However, as the marriage deepened, the arguing started.  The meat (very juicy, I might add) and the veggies(very crunchy, I add again) decided they want to stand alone.  So I had to play the role of marriage counselor and bring some damage control into the situation.  I'd rather spend my time on more pressing issues, but my stomach was yelling at me, my eyes saw cilantro and I'm not gonna take a star away for that....no sirree bob!\n\n*eyes wide, happy voice*.....Marry me, Banh Mi!!!", "author": "Ava H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-16", "description": "This place is a huge disappointment. The vegetarian pho came with 3 pieces of broccoli, and the broccoli was tasteless and old. The classic sandwich was terrible - the bread was stale and the meat not fresh. The staff was nice but when the food is horrible it's just not worth it. The people in this neighborhood need to go to Pho Grand to experience authentic Vietnamese food.", "author": "Ryan W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-09", "description": "This place has perfectly good Banh Mi, which is all Ive had there. I would ask for extra hot cause the emphasis on the Vietnamese mayonnaise makes for a pretty tame sandwich. \n\nMy main gripe, and the only reason for 3 stars is that the place closes so damn early, even on weekends. With its location on Smith st, Hancos should be ideal for drunken late night visits, but just like everything else on Smith except diners, its closed.\n\nalso I would say that Hancos is basically identical to Nicky's on Atlantic, and since both close so early its a wash.", "author": "Geoff C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-09", "description": "Fantastic sandwich shop and the iced coffee is perfect. I had their special sandwich with extra spice. It has a hint of coriander and minced pork in a nice crisp bun.", "author": "Chris V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "Great addition to the neighborhood for yummy Vietnamese food and super cheap. My boyfriend and I are both vegetarian and they have tons of options for us - vegetarian pork, vegetarian chicken, tofu or just vegetables. I get either the sandwich or vermicilli salad and my boyfriend loves the veggie pho. All delicious! I like that they have a punch card for when you eat in or take out. This is a great option for a quick lunch or dinner in the neighborhood.", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-06", "description": "I had high hopes for this place but was sadly disappointed from the first bite.\n\nI ordered the Chicken sandwich and my husband ordered the pork chop sandwich.\n\nThe chicken was way too salty, the pickled carrot was soft and was lacking in flavor. It wasn't terrible but it was nothing like the amazing BBQ chicken sandwich Baoguette does in the East Village. My husband was also disappointed with his sandwich, nothing special.\n\nWe also ordered drinks- Vietnamese iced coffee and a coffee bubble tea. Both were WAY too strong and I usually love strong coffee. I drank it anyway and was super jittery and felt sick afterwards. \n\nMaybe we just had an off day but from now on I'm sticking to Baoguette.\n\nSofie", "author": "Sofie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-17", "description": "It was time to order dinner and my vegan boss and I (vegetarian here) were on the prowl for some yummy veggie eats in Boerum Hill. Boss got the vegetarian pork banh mi w/medium sauce and I got the vegetarian chicken banh mi, spicy.\n\nYES.\n\nThe bread was warm and crunchy but not too hard. The pickled daikon and carrots were deliciously tart, sweet, and crisp. The cucumber and cilantro were refreshing to the palette and the mayo mixed in with the spicy goodness was soooo yum! The vegetarian chicken was cooked well and there was plenty of it.\n\nAll in all, this sandwich was amazing. I also tried the veggie pork one the next day for lunch (yup, we're addicts now!) and it was also very good though I preferred the veggie chicken. The faux pork had an interesting sweet after taste that kind of threw me off but that was the only downside to that sandwich.\n\nNow I'm just counting down the minutes until lunch today so I can have me some more banh mi!", "author": "Tatiana E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-07", "description": "The tapioca in the bubble tea was not sufficiently cooked and they got the order wrong.", "author": "Alex H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-10", "description": "I got the Vietnamese pork sandwich and rice vermicelli salad via delivery from Seamless and was SO impressed. Sometimes delivery food can be cold and lackluster. This was AMAZING. The sandwich was oh-so-good to the extent that I craved it the next day. 10/10 - would eat again. The rice vermicelli salad was vegetarian and super flavorful, it came with a light Asian vinegarette-type dressing that softened the noodles and was just delightful. Really excited to go to this place and have a sit down meal, not just take out. YUM.", "author": "Lily A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-11", "description": "Hanco's is good. As a vegan, I am grateful that they are willing to leave off the mayo and butter on the vegetarian chicken, or tofu sandwhiches (which are my standards). I also always always get the garden rolls. Its like salad I get to dip in peanut butter, nothing better. However, I am only giving them 3 stars because even if you eat in, they serve the rolls on styrofoam. Not cool. Also just FYI last night when we were there, the health department grade was \"B\". I'll change ya back to 4 stars, Hanco when you take care of these few minor things.", "author": "CB H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-25", "description": "This place is probably better than Lotus; it has toasted bread, better sauce mixtures and vegetables. I just wish it had more vegetarian meats. Veggie Chicken is a bit odd... (please make veggie pork banh mi!)\n\nDelicious.", "author": "cait l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-28", "description": "I went crazy over taro ice cream when I was in Hawaii a weeks ago, so when I went in Hanco's and saw they offered taro bubble tea, I was excited!\n\nThe place is nice, service is efficient and friendly enough.\n\nThe bubble tea was really good. They prepare the tapioca bubbles in front of you at the counter, so it's as \"fresh\" as it can get. The taro tea in itself was delicious and reasonable priced ($4.25 for a medium size), but I thought the boba was a little too sweet and there was too much of it. Not to worry though, you can ask for less (or no) boba! \n\nAbsolutely recommend", "author": "Camille R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-28", "description": "Fantastic, fantastic sandwiches.  Order spicy and it hurts so good.  \nNot expensive, filling, and so worth it!  Pork and veggie are standouts.\n\nThe bubble tea is pricier but still fairly good.  There is a loyalty card for sandwiches and a separate one for bubble tea.  If you're in the area, you will come back time and again.", "author": "Andy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-11", "description": "Is it me or are vietnamese people ingenious? First, I discover PHO, which if you haven't had on a cold day, you are missing out on the best of God's creations. If you want a gigantic sandwich to take you home, this is it. Get the classic with hot sauce, and a sip of bubble tea to soothe your throat. mmmm! Oh, and the girl at the counter, super sweet just like bubble tea!", "author": "Kimi G."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}