{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-20", "description": "Solid reasonably priced Vietnamese food!\n\nMy wife and I ate:\nApp: spring roll - solid\nTwo meals: pho:\n1) vegetarian broth and shrimp - good. Quality of the shrimp was ok\n2) pork sandwich - delicious!\nDrink: leeche bubble tea.\n\nAmbiance: place was busy - - they need a larger dinning room", "author": "Martin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "This may be one of the best places to eat on Smith Street. And if you know Smith Street, that's a huge compliment.\n\nI love everything in the menu! From the chicken sandwich Vietnamese style, to the pho. You really can't go wrong. The food takes a little bit to prepare but once you sink your teeth into it, it all becomes apparent why.\n\nThere's very limited seating (it stays pretty packed) so I recommend going on off times or grabbing your food to go while you walk around Cobble Hill.", "author": "Shayla C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "Good price, friendly employees and good location from train stations. I felt like I was back in school by bunch of elementary students in there. A really cozy place", "author": "Joo G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-19", "description": "The rice vermiceli is on point. The vibe is nice and friendly. Great spot for lunch. \n\nNow, why it's a 4 star... The only time this place is real nice is if you go for takeout or just bubble tea. The amount of bubble tea customers is ridiculous, causing the place to be dysfunctional as far as space goes. Otherwise, real nice lunch spot!", "author": "Enoch L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-14", "description": "Go here. You won't regret it. I got the classic which was delicious. You get a great sandwich for cheap. The teas are tasty as well. I would be a regular here if i lived in the area. Unfortunately I am stuck craving Hanco's in West Harlem. \n\nThis is a very casual place to get a bite so don't expect something trendy.", "author": "Laksen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "Consistently great food. I eat here almost once a week! \nI usually only get their pho, haven't tried the sandwiches but I'm sure they are just as yummy", "author": "Justine H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-08", "description": "Very slow service, compared to the service i get at my other vietnamese restaurant. not very clean. Tables need a wiping and the floors need sweeping. Has a college dorm room vibe with the people there and there is a wall with ads from ordinary people just like college as well. Sandwich was ok", "author": "John N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "I love this place. The vegetarian chicken pho was surprisingly delicious. Not overly salty, and the fake chicken is incredible! I love all of their bubble teas. I wish the seating area was kept a little cleaner, but the food and drinks are awesome!", "author": "Bree R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-12", "description": "This is the only Vietnamese place around Downtown Brooklyn, so we decided to give it a try. The beef Pho was very bland, and the grilled chicken sandwich is alright. Their bubble tea is not bad, but overall this doesn't seem like an authentic Vietnamese place. It's a small place with 4 tables, so if you're craving some Vietnamese food, perhaps order a banh-mi to go.", "author": "Chi T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-28", "description": "Noisy, screaming children abound. The spring rolls are flavorless. The bahn mi is tiiiny - I would need 3 to get full. The pho is just ok. But it's the only option for Vietnamese place in this area so I'm glad it's here", "author": "Jenna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "I went to try their watermelon smoothie over the summer and LOVED it. It was fresh and quenched my thirst. And then just yesterday I tried their grilled chicken sandwich. The toastiness of the bread, the flavorful chicken, and the coleslaw-like cabbage mix was a perfect blend for my taste buds. Delicious and fresh. My boyfriend absolutely loves their pulled pork sandwich as well. The restaurant itself is really cute too. Very nice and cozy. You can sit down and eat. They've got a very nice list of bubble teas for you to try as well as other fresh beverages. If you're in the area, I suggest you check it out!", "author": "Tallulah W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-18", "description": "I have been here several times over the years.  It's pretty solid.  Their pork is pretty good but the grilled chicken may be even better.  I like their sandwiches, as well as the vermicelli salads, which are a lot of food, and have a good variety of food on them, including some veggies.  On top of that, it's a pretty good value and very fast.", "author": "Craig Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "I've been meaning to stop by here but could never find the time. Today I left class a little early and decided to try it and I am sure this is probably the best decision I've made all year. I ordered an original sandwich and made it spicy to go. It smelled yummy, like the smell can permeate through both the brown paper bag and the plastic bag. The bread was warm and toasty, the veggies were crunchy and didn't overpower the meat which wasn't that spicy, but I have a high tolerance for spicy things. The sandwich looks so simple and I can't understand or begin to try to explain what exactly it is that makes it amazing, but it is. It reminds me of a pork scallion pancake from Prosperity Dumpling (the best scallion pancake ever btw) with cilantro peeking up between bites and shredded lightly pickled carrots and cucumber toning down the sweet pork pieces, but this pork has no fat to it like the pork belly in a scallion pancake does. It's like a fresh, Vietnamese philly cheese steak (meat texture wise). It's a pretty good size too. There is no credit card minimum. The wait time wasn't horrible. The seating is pretty ample.\n\nI have been telling everyone about it and I cannot wait to go back! Their soups seem to be really popular, everyone dining in had a bowl so I'll try that next and maybe their bubble teas, but another sandwich is a must. I'll probably go back before this week ends", "author": "Monique M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "What can I say?  Yelp has not failed me yet!  Was in the area and found this place from its great Yelp reviews, so I am unashamedly adding my review to the list.  \n\nThe classic Vietnamese sandwich I ordered--which comes with pork, mayo, cucumber, carrot, and cilantro--was delicious!  Definitely in the top tier of bahn mi sandwiches I've had.  The pork was really juicy and the sandwich itself was really flavorful.  I had a bit of a hard time eating the sandwich because the baguette was overflowing, but that is what makes a great sandwich right?  It's gotta be a bit messy.\n\nIn terms of the environment, the place was pretty clean and I had no problems finding a seat, although it was a bit early for the dinner crowd (like 5:30ish when I went).  It looked like some others were there with laptops getting some work done--I'm not sure this is a great environment for that, but for a quick and delicious meal, I'd definitely recommend checking this place out.", "author": "Julie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-08", "description": "Good for the price, although not the best I've had! I had the rice vermicelli with tofu - which was nicely constructed with deliciously fresh green onions, herbs, and peanuts on top (served with a side of sweet vinegar to pour over the top). Loved the summer rolls with shrimp and smooth peanut sauce (although I could've gone for a peanut-y, crunchier texture). I'll come back for sure for the speedy service and price.", "author": "Caroline D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "I love hanco's sandwiches. Actually, the montague street one is way closer to my office, butu i like this one better. The other one is wayyy too crowded and it took us 40 min one time to get an order of 2 sandwiches.. Wooo that was the last time i went to that one..\nBack to this one, they are crowded as well but they are soo much more faster. It usually a wait of 10 mins max for anything. I haven't tried their soup yet but will try soon and let you guys know. Overall love their food. 5 STarts for the food.", "author": "Pam K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-24", "description": "Zero stars! Horrible food! I got very sick from their chicken. If you want real Viet food go to Chinatown or Ave U. This place is a damn joke and needs to get shut down!", "author": "Daisy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-16", "description": "How did I not know this place was just down the block?! \n\nI tried Hanco's for the first time the day after gorging myself at Xe May on Saint Marks (if you've never had bahn mi from Xe May, you must. Now.) Needless to say, my expectations were high. But after one bite of Hanco's Classic bahn mi, I was hooked! \n\nHanco's makes theirs a bit differently than most- the pate and pickled veggies are all there, but the pork is actually ground and juicy rather than cold-cut style. Such a nice touch! I don't know how they marinade that pork but it's very flavorful. \n\nMy one criticism is the distribution of veggies. Yes, I know this is me being a bit picky, but the carrots were right up front with the meat so by the time you get 3/4 of the way through, there are no more veggies. \n\nCan't wait to try more sandwiches!", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-27", "description": "Pricy for dried ground meat used in the sandwiches. There are cheaper, more delicious banh mi joints in NYC, would only come again for the convenience.", "author": "Susan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-31", "description": "Had the pho, it was good, but not really anything that stands out to me. I have a feeling they gave me the veggie broth with the grilled chicken, so that might explain why it wasn't the most flavorful. I think I'm a bit jaded coming from Mama Pho in Williamsburg, I found that place to me way better for the same price.\n\nI'd be willing to give it another shot if I'm in the area, but not planning on going out of my way.", "author": "James P."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}