{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-30", "description": "The Vietnamese sandwiches are authentic and delicious! I also love the summer rolls.\n\nDefinitely more of a take-out place, but there are tables.", "author": "Lillie W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-14", "description": "Love the new location, and love that they have a vegetable broth option for the pho-- I never claimed to like anything authentic!  Have had the bahn mi-- solid, though the tofu was a little wet and nothing special.  My husband loves the chicken.\n\nWhen we went to dine in this last weekend, it was impossible to walk through to order with all the strollers, and some dumba$$ dad propped his precious daughter right under the counter where you grab your piping hot soup.   Tables made for 4 diners were al occupied by one person spreading their newspaper/oversized purse/ baby crap all over the table, leaving many patrons holding their trays.\n\nIn any event, I love Hanco's but will be more likely to order out than to dine in.", "author": "Vanessa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-16", "description": "Recently, my boyfriend and I have been extremely obsessed with pho. It's perfect for winter (and,k let's just face it, every other single occasion), and I end up eating it at least twice a week. So from DC to NYC, I have eaten a LOT of pho.\n\nHowever, one bowl from Hanco's in Brooklyn Heights and I am absolutely hooked. It has the most amazing pho I've ever tasted. Just the perfect ratio of tender, thin-sliced beef, hearty soup, and noodles. Did I mention their Vietnamese coffee is spectacular? I am definitely going to be back. Believe the hype. =)", "author": "Bettina B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-16", "description": "I have been to this place couple of time and usually get the bubble tea I'm not gonna lie it's pretty great. But there's two issues I had and it's really disappointing 1, is that they don't have good service they really don't care about there customers and it's like they just want to give an get rid of you which isn't a way to show respect to customers and 2, is there food is dry because i wanted to get a sandwich and I was excited because it was something different but my expectations were wrong and the opposite of my expectation because I was going thru some reviews and it said their sandwiches was pretty good so I decided to try it. Well now I know I should just go and get my casual order which is bubble tea", "author": "John F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-19", "description": "I'm on  a bit of a roll lately.\nI love the classic pork, but the last two have been vegetarian chicken - extra spicey!\nNot sure you can go wrong with any here. Fresh, crunchy bread; crisp and tasty fillings; fast service.\nA neighbourhood fixture.", "author": "Rob S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-09", "description": "Good\nSimple\nSandwiches\nFor 6 bucks each\nIn a small shop for hungry on the go.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "Yum! Had a grilled pork sandwich. Super juicy and great Vietnamese flavors going on, and great sized sandwich for the price (6.50). Garden rolls (vegetarian) weren't special. Bubble tea was good although I'm unfamiliar w bubble tea. And my veggie friend liked her veggie chicken sandwich. I had a bite of the fake meat it was pretty good. Grilled pork s'wich was the star. I'll be back if I'm in the area.", "author": "Katarina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "Love this place. There bubbles tea's are amazing \u0026 the food is really good. I come here like 3 times a month. There is sometimes a 20 min wait which is the only down side but the food is definitely good. Price is good u definitely get your money's worth", "author": "Smith J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-27", "description": "Came here with my gf for lunch on a Saturday around 4pm. Pretty packed at this place. We each got the classic Vietnamese sandwich and iced Thai tea. Food was good. Willing to come back here again if around the area.", "author": "Ace C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-13", "description": "While walking around park slope looking for something to eat, I see hancos. I've heard about this place but never had the opportunity to try it. I entered the store right as they opened and ordered a classic mild spicy and a thai iced tea. They called my number in less than 5 minutes. So fast! I love that. I ripped open the bag and tore the sandwich in half. First mistake - everything was crumbly. The ground pork spilled all over and the daikon radish and carrots fell out of the sandwich leaving me to place the carrots and radish back on top of the sandwich during each bite. The sandwich itself? Pretty standard. The toasted French baguette is pretty good and so is the thai iced tea. For $6.75 a sandwich, I would recommend hanco's simply because where else are you going to get bahn mi in park slope and a really chill location to go to for a date or just for lunch?", "author": "Samantha N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-28", "description": "The best Vietnamese sandwiches in Brooklyn! This place is my jam during the week for lunch. It's not what I'd call authentic (like Manhattan's Saiguette), but for a quick sandwich, coffee, or bubble tea this place does the trick. Best of all is their classic Vietnamese sandwich, ground pork wrapped in ham, pate, cilantro, and jalapeno. Their prices are reasonable, with sandwiches at just $6.50. A must-try if you're on Smith Street and hungry!", "author": "David P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-21", "description": "I live down the street and am guilty of eating here sometimes more than once in a week.  It's not a traditional bahn mi but but it's mighty tasty nonetheless.  I usually get the pork sandwich (not spicy because I'm a baby) and it's pretty much always perfect.  I think once the bread was a little on the burnt and crispy side, but I let it slide.  The taro bubble tea is also a guilty pleasure.", "author": "Kathleen N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-03", "description": "DELICIOUS viet sammies.  dont get the original. get the roast pork i think. AND SUMMER ROLLS!!!! i travel all the way from long island for these!", "author": "Raven C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-08", "description": "Super-fast delivery, very cheap.  High quality  ingredients. \n\nBanh Mi sandwiches should be re-named BOMB MI... seriously", "author": "Alex L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-11", "description": "This place is legit. You want a baller Vietnamese sandwich for cheap- with a hot tea on the side? Then this is your spot.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-12", "description": "If I had it yesterday.... and I'm interested in eating it again right now...does that vouch for it's tastiness? Probably.\n\nI've had Vietnamese sandos a couple times before but these were some of the better ones.  Differently, they were on toasted bread rather than on crusty baguette.  Meat selections are pretty typical but include a few more options like white chicken mean or dark chicken meat.  \n\nThe inside is pretty sparse but whatever it's not Starbucks you're in and out quickly.  Or just grab n go that sucker.  Didn't try the bubble tea but almost everyone was ordering it which must mean something.  \n\nThe one thing I didn't love was that the vegetables were a bit less pickled than I've had in the past providing that necessary contrast to the salty meat.\n\nAt 5.75 it's not the least expensive bahn mi I've had but it was filling and tasty so the price is right.  Will definitely re-visit.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-24", "description": "I've bought lunches and drinks many times here and people who work there seem to be nice overall! I loved this place until they screwed up my drink and it's because my drink was way too sweet even after I asked them twice for making it less sweet. I still went back after that for a few times as I sometimes want something hot to drink and I wanna get something other than coffee, latte or tea. This time I asked for a medium hot almond tea with no bubble, less sweet and skim milk. I actually have the same requests every time I got my tea. I'm not why these Chinese girls who work there found it amusing to make fun of me this time! They started chatting in Cantonese about how I made so many requests for my drink...They thought I couldn't understand Chinese as I always order in English! Can you believe people can be so dumb and so disrespectful?", "author": "Joyce L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-26", "description": "I crave the sandwiches here--the textures and flavors are perfect. If I don't get a sandwich, I go for the pho and I just learned you can get one kind of broth with a different kind of protein. So I recently  tried the beef broth with grilled pork, as recommended by the Hanco's staff, and it was the best one I've had. The one thing that boggles my mind is the time it takes to get your food. I thought when they moved to their new, huge digs and hired a ton more staff that this wouldn't be an issue anymore....but it still is. Eh, who cares. I love this spot and I've learned to call ahead to skip the long wait.", "author": "Alissa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-08", "description": "Best Banh Mi anywhere.  Just go and try the classic, stop wasting your time reading the reviews.  It is an outrageously good sandwich.\n\nFresh bread, fresh ingredients and made with expert care.", "author": "Scott C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "Classic banh mi had really tasty ground pork, nice and juicy. Could've used a little more tang in the pickled veggies, as well as more cilantro and jalapeños to balance out the richness from the mayo and other meats, but still, I was not mad at it. Bread is a bit doughy for my taste, but again, I would have no problem killing one of these sandwiches. Washed down with a Vietnamese iced coffee for dessert (sweetened condensed milk + espresso = heaven), a more perfect lunch is hard to imagine. Pricey for banh mi, but good quality, nice staff, and plentiful seating for hipsters.", "author": "Michelle P."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}