{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-22", "description": "Fresh!  Really great sandwiches.  Fresh, crispy bread.  Fresh cilantro.  Great choice for vegetarians (tofu/fake chicken/pork/or duck).  The counter people are always very nice.  And you'll have room for ice cream, right next door at Van Leeuwen's.  What a great Saturday afternoon in BK.  You're welcome.", "author": "Matt D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-24", "description": "I used to work in Chinatown in Boston, and as such I have had quite a few Vietnamese sandwiches but Hanco's has the best.  The classic is amazing. It comes with ground pork, vietnamese ham, foie gras, pickled carrot strips, dikon raddish and cucumber. All this is served upon a hot baked bagette. The crunch and freshness of the vegetables perfectly complement the richness of the pork. These are great sandwiches, especially considering they are $5.25 each. The only way I could improve the sandwich would be to mix the ingredients more so you got a little bit of everything with each bite. As good as the sandwiches were I was really disappointed by the bubble teas, they were not that flavorful and were overly sweet. My recommendation get a sandwich and one of the bottled drinks.", "author": "Mike O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-01", "description": "I love this little hole in the wall place.  Used to bring their sandwiches and bubble tea home after court.  My wife loves it!", "author": "Bondi J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-27", "description": "This place is so delicious. The banh mi is great but I'm partial to their rice vermicelli dishes. Really big and filling, and very fresh tasting. I love the shredded chicken and the pork, and have been known to pay extra to get both on my noodles. It's a good flavor compliment. The vegetarian sandwiches are also really great. Everything is super fast, just make sure to go to an ATM first.", "author": "Becky S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-26", "description": "Banh mi equals deliciousness. The spicy classic here at Hanco's is just that. Spicy and classic. What a fantastic vietnamese pork sandwich. Throw on some spring-rolls and you have yourself $9 of a meal that conquers most other choices available. I tend to duck in after work on my bike ride home. Grabbing things to go I have my sandwich and rolls in just a couple of minutes. Hooray.", "author": "Carl C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-18", "description": "Love the classic spicy banh mi. Meaty spicy tastiness with pickled vegetable yumminess. Yay! So affordable and satisfying.", "author": "Meg B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "Gimme that PORK CHOP! Badass Vietnamese sandwiches!", "author": "Carlin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-11", "description": "I think this is the best Banh Mi in New York. It has the freshest ingredients and doesn't skimp on the meat. My only complaint is that Hanco's is a little pricey (2 summer rolls for like $5?), but it is Park Slope, so what do you expect? Also, their Vietnamese coffee is pretty yuppified - good, but not traditional.", "author": "Ashley B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-19", "description": "I've heard the legend of the Vietnamese sandwich, but it wasn't until I made my first trip to Hanco that I got to experience it. with so many boring, unoriginal sandwich shops in the neighborhood, Hanco is something special. The house special: the original sandwich, is a great mix of beef, pork, veggies, mayo and more on really fresh bread. The only problem is that I ate mine too fast. Within minutes of leaving I was planning my trip back next weekend.", "author": "dan c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "The important thing to know about Hanco's is that it is better than Nicky's. If you are in the market for a BK Vietnamese sandwich, this is the spot. I get either classic or sardine, but they're all good. You can't go wrong here.", "author": "Bucky L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-31", "description": "Hanco's is a tiny restaurant in Boerum Hill specializing in Banh Mi (Vietnamese sandwiches) and Bubble Tea. The Banh Mi come in the usual varieties - classic, chicken, pork, plus a tofu version. I have tried the chicken, pork, and tofu. All were quite good. The sandwiches are available in Mild (no hot sauce or peppers), Medium (sri racha hot sauce, no peppers), and Hot (hot sauce and peppers). The difference between the different hotness levels is not explained on the menu... I learned it the hard way (when I ordered hot). The prices are slightly higher than at Nicky's but still very reasonable at about $4.25 per sandwich.", "author": "Clare B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-01", "description": "Oh bahn mi, how I love thee.  So full of tangy fresh carrots and cilantro and warm spicy meat.  Spilling out the edges of a fresh baguette.  You pair so well with a cold summer roll and a sweet iced coffee.  You just might be the perfect meal.  And at Hanco's you are affordable and just a short bike ride or bus trip from home.  Don't ever change.", "author": "Liz S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-25", "description": "My bro picked up the sandwiches, so I can't really attest to the \"buying experience\".  He did say that the Chinese dudes working in the back took FOREVER (as in a long ass time) to make the sandwiches.  I thought my peeps were speedy.  Hmm.  Anyway, I'm pretty sure they use a microwave to heat shit up (tacky), and it's a bit pricey for banh mi, but hey, this is the new, gentrified Bk!  Slap an extra buck on there.", "author": "Joan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-02", "description": "Okay, I am not an expert on banh mi but I do know joy on a baguette when I taste it. This is everything I want a sandwich to be -- meal-quality ingredients on fresh bread. I had the pork sandwich, spicy, and my husband had the classic, spicy. Both were revelatory. The sweetness of the pickled carrots and radishes played well off of the spice and the cilantro just elevated the palate. Everything tasted very fresh and very flavorful. We ordered original bubble tea with milk, too, and it was great. Strong tea presence, the appropriate amount of milk and springy, sweet tapioca.\n\nWhile the dining room won't win any awards for decor, any ambiance shortcomings melt away in the depths of sandwich-happiness. I'll be back soon to see if consistency is a strong-point.", "author": "Alexis L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-02", "description": "Love their grilled chicken salad! Not always super fast, but good quality food.", "author": "Sam J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-25", "description": "The sandwiches are incredible, yes, but the real surprise is the salad. I wasn't expecting much from it, considering it was $4, considering it was served in a plastic takeout box, and considering that somehow everyone other restaurant seems to mess up what to me is the easiest thing to make. But this little green salad (with shredded chicken) is always delicious every time I order it. I could eat here every day.", "author": "Jenny G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-27", "description": "Yay! Great food and drinks! I can't wait to come back. My only complaint is that my sandwich was a little dry. I wish there were more sauce. Everything else was awesome.", "author": "Arielle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-17", "description": "Top notch shredded chicken banh mi and thai iced bubble tea..drooling just thinking about them. This place helped me recover from the traumatic banh mi incident of 2006..had an incredibly icky viet sandwich from some hole in the wall that is now closed. Thank you, Hanco's for re-introducing the delightful marriage of pickled veggies and meatz in crusty breads to my life.", "author": "Maysa K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-04", "description": "I finally checked this place out after my husband visiting this place repeatedly. I ordered the chicken sandwich because I'm not big on pate, which is in their \"original\" sandwich. The combination of flavors is scrumptious, I started craving it again the minute i finished my last bite...", "author": "Dana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-20", "description": "Everything has pretty much been said already.  Yes, they're kinda slow at preparing the food, but their classic sandwich is really delicious.  And the bubble tea is well priced.  Definitely check it out -- especially if you're not sure what a Vietnamese sandwich is.", "author": "Jonathan W."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}