{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "great banh mi and love it that they deliver to me. i wish they would stay open for longer, and one of my saddest events in 2011 was that they took away the pork chop sandwich. WHY WOULD THEY DO THIS TO ME?!\n\nsolid sandwiches.", "author": "Tina P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-25", "description": "Oh Banh Mi oh my!!!!!!!!!! \nHow could I have waited so long to try this delicious sandwich? What the hell is wrong with me???????????? \n\nI have decided to make this sandwich my official sponsor.....not sure how the folks down at Hanco's will receive that info ....but ummmm yeah \nMe and my bestestest friend ever DNC decided to try this place out and see what the Bahn Mi hype is all about. \n\nWe ordered the classic and the pork chop sandwich (medium heat). I am trying to increase my spice tolerance but I felt spicy was too much for me..he on the other hand looooves spice but true to his bestestet friend title decided he would add the heat on at the table...via the bottles of liquid fire AKA sriracha. \n\nI took my first bite and I was hooked. Man oh man this stuff is great!!! The pickled veggies add the sweet and coolness for a heat punk such as myself. \n\nAs some other reviewers stated it is kind of constructed in an odd way with the meat to the back so I had to open it up and re-modify it so that each bite was a perfect one. \n\nI also ordered the lemonade and we split a Vietnamese iced coffee which is so strong and yummy I could drink it everyday. \nI am going to use this experience as a start to my Vietnamese food world tour (with DNC my man going each and every place with a banh mi in my hand) \n\nAnyway I need to go mentally relive this experience so umm yeah go already!", "author": "Quana C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-20", "description": "My brother recommended Hanco's (the other location technically - but I wasn't sitting down to eat anyway) and I gotta say he was on point. I had the Veggie Pork sandwich, extra spicy, and it didn't disappoint. I didn't realize they had a wheat roll option until after I ordered, and it wasn't packed, hence my 3 stars (boo to you counter woman!). I think I'll be back though.", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-12", "description": "I prefer Hanco's over Nickys. I think it's the family atmosphere at Hancos, they're all very happy and nice.\n\nFor me the sandwiches are better too and I love the passion fruit tea!", "author": "Nick S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-08", "description": "I waited a while for my sandwich, but damn if it wasn't good when it came.", "author": "Sophie N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-24", "description": "This is the first unenjoyable vietnamese sandwhich I have ever had. And I know my banh mi. I ordered the pork sandwhich. First the bread: its some weird hoagie roll and not a baguette. Condiments: they use regular jar mayonnaise- no spicy garlic mayo at Hanco's. Meat: the pork was underseasoned and seemed to be steamed and not grilly. The pork was also very fatty and tendony and because of the way it was cooked it wasnt a pleasant sensory experience. I had to take some of the meat out because it was that bad. Extras: Theyre light on the cilantro, give tons of carrot but not much daikon. All in all I was very underwhelmed. The ratio of meat to bread was wrong with way too much unpleasant pork to hoagie bread; so much so that the bread got super soggy and not in a good way.\n\nIf you have never had banh mi  before please go somewhere else like Paris Sandwhich or Saigon or really anywhere else in Chinatown. If you are on the hood and MUST have a sandwhich go to Nicky's.", "author": "Anastasia T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-10", "description": "I'm not a sandwich person but I would eat their sandwiches here anytime.  The best I think is pork, which I think is the winner.  The bubble tea is great too but I do prefer Teado bubble tea in chinatown.  If you ever want a quick fix, definitely try their sandwiches.  You can't go wrong.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-09", "description": "I'm very biased when writing this review, because Hanco's was my introduction to the world of bahn mi, and lots of other reviews proclaim that much better bahn mi exists. And yet my gut insists that this must be a special place, or at least a special local chain. I cherish the chicken bahn mi: fresh bread, crisp daikon, juicy chicken...and a super-sweet Vietnamese iced coffee is a perfect way to wash it down. And with a legion (really...a huge crowd) of cooks laboring behind the counter, you know your sandwich is a work of art.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-17", "description": "Hanco's vs. Nicky's?\nAt Hancos, I like their tofu sandwich. Spicy. I don't usually do a bubble tea as I like to pair it with a somewhat spicy ginger beer/ale from the deli on the corner.\nNow, if I am the mood to get my \"pork\" on, I like the 'classic' at Nickys better. I prefer the taste of their meat and the bread at Nickys and Hancos seems to be a bit heavy handed with the vegetables.\n\nAs an aside, when I think back to the Smith street of the late-90's, I am sure I would have never imagined that one day my biggest problem would be deciding which Vietnamese sandwich shop I liked the best.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-03", "description": "Nom Nom Nom\n\nExcuse me while I stuff my face with the most delicious pork chop sandwich and wash it down with a refreshing taro bubble tea. \n\nI walked by this block so many times and I never saw this place. My co worker asked if I wanted to order from here and do a pickup and i said ok. Service was fast friendly and by the time I got back to work my sandwich was still hot. \n\nI cant wait for my next trip to Hanco!", "author": "Tassamai S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-14", "description": "Grilled chicken sandwich is amazing here ! Definitely one of the best I had.", "author": "Sunder S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-05", "description": "veggie pork salad. smells gross but it's a great way to be semi-healthy", "author": "Jacqueline Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-14", "description": "Got delivery from here. Chicken Sandwich was good. I would give the sandwich a 6 rating out of 10 (10 being the best). The pickled carrots were tasty. I ordered the sandwich spicy and although it wasn't spicy according to my standards of spiciness, it was flavorful.\n\nThe chicken meat tasted like the meat you would get in a chicken gyro from a cart on a NYC street.\n\nThe honeydew bubble tea was good. Not super sweet like some bubble teas I've had.", "author": "Mahrukh M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-28", "description": "Got the classic, spicy. Sriracha based mayo with some jalapeños added in for a little extra kick. Just the right spice level. Fresh and on nice bread.  A winner in my book.", "author": "Loren W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-26", "description": "Very good efficient vietnamese place. My partner likes the bubble tea. The seating are is generally clean and spacious. Food is consistently good.", "author": "Myrna M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-26", "description": "I had been meaning to try Hanco's for a while. Then I heard the piece on them on \"this american life\" and was compelled to try them out. \n\nSadly I wasn't very impressed. Perhaps I had unfair hype/expectation that skewed my opinion. \n\nI got the classic and thought the texture of the meat was a little strange. The flavour was just ok. \n\nI think Nicky's makes a much better sandwich.", "author": "Little C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "Um.. Yum! Why I been eating at Nicky's all this time. Had the pork Banh Mi and it was delicious.  The pork was super flavorful and I liked that they loaded it up with lots of pickled veggies. My girlfriend had the veggie pork and she thought it was delicious as well.  I don't know if most other Vietnamese sandwich places have veggie options, but my girlfriend is a vegetarian and she enjoyed the fact that she had more than one option.", "author": "Nana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-27", "description": "Great Bahn MI!\n\nI have had the pork chop and the chicken and have not been disappointed. All the components fit PERFECTLY together. The flavors melt in your mouth in beautiful unison.\n\nThe summer rolls (veggie) are cool, refreshing, and filling as well. The peanut dipping sauce on the side is the perfect  balance. Feeding 4 people for $25 on a Saturday night is not a bad thing!\n\nGo to Hanco's. You will not be disappointed!", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-29", "description": "I am seriously addicted. Bubble tea (pretty sure I've had every flavor) and a shredded chicken bahn mi. I have to have this at least once a week. The prices jumped when they moved into the larger space which is understandable but I've been coming regularly since a co-worker introduced me to the place several years ago.", "author": "L D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "Strawberry bubble tea with fresh strawberries. Why would I ever want to drink anything else?\n\nHanco's sandwiches, rolls, and drinks are always refreshing and I hear there is a knitting group here on Thursdays. Perfect!", "author": "Amy S."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}