{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-24", "description": "In an alternate universe...HBO's \"The Wire\" takes place in Boerum Hill. \n\nIt's the early part of the new millennium. Drugs and drug dealers are a big problem for the NYPD in Brooklyn, and Avon Barksdale's ruthless crew runs the Gowanus Houses, using the apartment buildings to stash their product, cash reserves and even as a sales location.\n\nThe Barksdale crew are cautious and well disciplined. Avon Barksdale's right hand man, Stringer Bell, is a calculating and cunning businessman with a wary eye. He knows the NYPD's policies and tactics well.\n\nEschewing cell phones, they rely on pagers and public phones because along with anonymity, they offer protection from the paper trail that phone bills provide to police.\n\nAfter months of visual surveillance, buy \u0026 bust operations, and data collection, the NYPD finally get the break they've been looking for in their case against the Barksdale crew...a Circuit Court Judge authorizes a wire tap of one of the pay phones outside the Gowanus Houses.\n\nThe following is a transcript of a telephone conversation between Barksdale enforcer Wee Bey and low-level runner, Bodie...\n\nWee Bey: \"Ay, yo, young buck!\"\nBodie:\"Sup, sup.\"\nWee Bey:\"Yo, String n em finna git they grub on and dey want you to go getem summa dem Bonnn Mee joints.\"\nBodie:\"A'ight, coo. Where I get dem joints at?\"\nWee Bey:\"Dey sell them shits ovah on Burrrgin screet, cross from da subway at Smiff screet.\"\nBodie:\"Word, what dey want?\"\nWee Bey:\"Git 5 classics, and make 'em spicy as hell, son. Axe for extra hot sawce.\"\nBodie:\"Yo...I ain't tryna be rude or nuffin, but them shits is greasy as a muhfukka ovah that joint, man. I mean, the bread be all soaked with oil and shit and they be puttin the salad all up in the bread so high so you can't hardly take a bite less you got like a big ass Oscar the Grouch mouth or some shit. AND, dey coss fitty cent more than anywhere else, too! Lemme git them joints from my spot ovah on Atlantic Ave.\"\nWee Bey:\"For real, dough? I ain't never had dem shits before but you know how String be tryin to be all natural and healthy n shit, so I know he ain't gonna dig on no greasy ass sammiches.\"\nBodie:\"Damn scraight. I'm fittin' ta bounce ovah to Nicky's right now and get them joints fuh dem.\"\nWee Bey:\"That's the move, son. I'll hit you back when you get up in here.\"\nBodie:\"A'ight. Bet.\"\n\nBodie was right. The sandwiches at that place on Bergen at Smith St. are indeed greasy as hell, son.\n\nBecause of his ingenuity, Stringer Bell soon promoted Bodie to street-level manager for the Barksdale crew and his bankroll exploded. \n\nYou ought to do as Bodie did, and when in Boerum Hill, bounce on over to Nicky's for your Banh-Mi fix.", "author": "Jason V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-22", "description": "Ba Minh with butter and mayo?????  Is this MORE or LESS traditional?  Somebody Vietnamese, please answer.\n\nMaybe next time I'll ask for \"light\" mayo and butter, but even a hefty slathering of mayo and butter doesn't stop this sandwich from being delicious.  \n\nIf it's a departure from pure French Bread meets Vietnamese Condiments gastronomical infamy...if it's an entire creation unto it's own...if it makes purists run for the hills...or if it's the recipe of champions but done without reverence to it's roots, this all matters not!\n\nIt's delicious.\n\nLike I said...all my Ba Minh has been dry, which I love.  Good French Baguettes as Ratatouille wonderfully points out must be measured by the \"crackle\"...and the crackle is always present in Ba Minh because there is always pride in the gift of the French...that wonderfully airy loaf of bread that starts out in tact and then crackles under the pressure of your hands, your bite and turns chewy!  Enough on bread...even though good bread can make or break a sandwich.\n\nThe meat is different here too...\n\nWe tried the grilled pork and the sardines.  Next time the Classic must be tried because I've never heard of ground pork, Vietnamese ham and pate on a Ba Minh...let alone worthy of being touted \"the classic\".  The grilled pork was savory BBQ'd strips folded one over another...very tender...very delicious.  The sardines weren't too salty and mashed up with a slathering of some mayo...also very delicious.\n\nIn the words of Pete Schwetty \"quick plug\"....... I need to say: quick plug for SARDINES!  Hey people...start eating more sardines!  They are a great source of protein and very delicious...help remove the stigmatism associated with sardines.  Sadly the last US Sardine Cannery just closed in April this year because people associate sardines with junk depression food that is not desirable.  This is hardly the case...people all over the world use sardines as a staple in their diet because they are sustainable to harvest, full of great protein and calcium since you eat the bones as well, and free of mercury because they're small fish!  It's time we step up and promote the Sardine!\n\nI'll start by saying the Sardine Ba Minh at Hanco's is insanely delicious!\n\nHanco's a great value for the neighborhood.  I accept the fact that this is not California and I can't go to Lee's for a $2 Ba Minh.  \n\nI'll notch this one up as yet another example of how the best food to eat does not have to be expensive.  In fact, why pay for expensive food unless you are a huge fan of it.  Don't take the pills that the Media Machine feeds you.\n\nYelp instead!  I got love for my shoes...K Swiss. I've never bought or worn a pair of K Swiss.  Saying that was my way of saying I got love for my fellow Yelpers without actually saying it because I felt it sounded a tad touchy and flinty...\n\nBut then I said it.  I love you.", "author": "Gino M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-03", "description": "this is a great place to drop in and grab a vietnamese sammy to go.\n\ntheir bread is baked right, the meats in the classic aren't \"weird\" tasting like some other banh mi's i've had, and the toppings are perfect.\n\nnot much in terms of environment, but great when you're on the run.", "author": "Crys Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-25", "description": "Came here with my boyfriend to try out for the first time. I frequent the area all the time and somehow never noticed this Viet sammich/bubble tea place. I love both so I had to try it out. \n\nFirstly the coconut bubble tea was great. \"Quickly\" in Chinatown is usually my go to spot for bubble tea but I liked this one much more. It tasted more natural and had the right amount of sweetness. \n\nNow the grub was kind of a mixed bag. I had the chicken sandwich which I thought was the bomb. Even the mild is slightly spicy but I don't care. It tasted very fresh. All the veggies had a nice crunch. The chicken was good. (Though I prefer a more burnt barbeque-like flavor). My lady had the \"classic\" which had pork and possibly some other type of meat if my memory is correct. She said she didn't like it but I'm not going to detract from my rating for her review as I didn't give it a taste. \n\nWe both had the Rice Vermicelli after a recommendation from the counter person. This was the only weak point. The Rice Vermicelli was so bland. It was like eating plain pasta. We had to dump in all of the included sauce to make it \"decent\" enough to eat but it was still pretty bland. We were both wondering why the person recommended it to us. Prices are good and we had this big feast for about a 20-spot. Mixed experience but mostly good food for a good price so I would recommend it and eat there again.", "author": "Rich G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-22", "description": "$6.00 a sandwich. B-health rating. Taste was okay for the summer rolls. Sandwich was a okay to bad depending in which sandwich you pick. I'm disappointed because it didn't match description. Italian hero not French banquette. Pan fried ground meat not roasted ground pork. The meat is one of the most important ingredient, how can they cheap out and screw it up. It tastes off with a pale white coloring, instead of the nice roasted red meat im use to. No green chili on spicy sandwich. Cheap lids on their bubble tea cups. Tea leaked through lid and large opening. How can they get an overall 4 star rating?!", "author": "Alice P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-06", "description": "Incompetent service. Long wait every time. They made a mistake with my order for coffee and refused to fix it. They young women behind the counter do not understand English well and misunderstood my order and refused to fix it. I left my wrong order on the counter and walked out. I didn't want to fathom what would be involved in getting a refund from these people. Service was as bad as service gets. I am dumbfounded they refused to give me a single hot coffee. They preferred I leave unhappy. I would never go there again. I work in the area.", "author": "John D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-16", "description": "My favorite parts of a banh mi are the pickled carrots and the spiciness, both which are all too often overlooked by other sandwich shops.  Not so at Hanco's!  \n\nI had the spicy vegetarian chicken, and it was definitely a five-star sandwich.  The aforementioned pickled carrots were plentiful, as was the cilantro.  There was a prodigious amount of sriracha AND there were jalapenos.  The bread was fresh and crusty on the outside, while soft on the inside.  The soy chicken was tasty and thankfully not rubbery, as some soy meat can be.  The sandwich was also perfectly sized!\n\nHanco's made me a happy, happy girl.", "author": "Kathleen B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-16", "description": "Drop everything and eat here now. Really, really good. I've only been here once but the \"Classic\" sandwich was amazing.", "author": "Andrew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-07", "description": "Fellow Yelpers were right on about this place. It rocks. And it had two veggie options, hooray, a veggie chicken and a sardine(kinda semi-veggie) that are really fantastic. They use the right combo of pickles and marinades and mayo(which I tend not to like but liked here) and stuffing(be it meat or otherwise) and spices like fresh cilantro. The result is one tasty sandwich. The bread is not as crusty as the ones at Paris. You forgive them when you eat the whole shebang. I ordered the sardine one,which is one of the best sardine one sandwiches I've ever had) and the pork. Both get a rating as super yummy. This bahn mi tastes better the ones I've tasted in Manhattan's Chinatown and is worth a trip to Boerum Hill/Cobble Hill.\n\nOh, Hanco's has corrected their strange past habit of putting veggies at one end and meat stuffing on the other. This has apparently flummoxed many Yelpers in the past. I am happy to say the filling and toppings are now spread throughout the sandwich.\n\nOh, and  a plus, they are next to Van Leeuwen ice cream. Ah, life is good...", "author": "Helen Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-04", "description": "The Bubble Teas are fantastic!\n\nThe staff was very lovely and friendly. I even had a chat with the manager-type person about the preparation of tapioca pearls! Which was wonderfully enlightening. \n\nNext time I will drop by for a sandwich, although my friend eats there every once in a while and he likes it. The portions seem good too and there are veggie options.", "author": "Yanina W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-19", "description": "There are multiple locations popping up for good reason!  They make the best bahn mi in NYC,  but their small Boerum Hill location is by far the best.  For some reason the Brooklyn Heights and Park Slope locations don't taste the same.  Still good, but definitely a noticeable difference in taste.", "author": "A H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-16", "description": "It's good to have this place around. I like their soups and bubble teas. Beef sandwich was delicious.", "author": "Rachel V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "This is my go-to lunch spot, and I have been having more tofu pho and vegetarian chicken banh mi sandwiches lately than one would like to admit to.  Bubble teas are yummy, too.  Why is their tofu so delicious??", "author": "Hope M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "This spot is just around the corner from my house. I don't go to it every week because I'm lazy. Well I am actually lazy but that's what seamless is for. I go there because the classic spicy sandwich is on point. I remember vividly going to a sandwich shop in Phnom Penh ordering a sandwich with not a lick of Vietnamese and just happy to get anything back as I was starving. What I got back was probably nothing like their classic sandwich as my memory is hazy and that was in '09. But every time I get the sandwich from Hanco's I remember chilling by the Mekong that day. Now you don't have to have been Vietnam to appreciate a good sandwich. I have non Vietnamese throwback sandwiches all the time and I have to say Hanco's is at the top of the list. It's always fresh and it's at a good price. Throw a bubble tea or Vietnamese coffee in the mix and this is my usual Sat/Sun lunch option. If only there was a view of a river nearby...", "author": "Chris M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "Best bubble tea, bahn-mi and pho in the area! Quick inexpensive and pleasant casual atmosphere. Take advantage of the frequent purchase cards and get your lunch for free!", "author": "Leslie F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-12", "description": "Came here on a Sunday around 1PM - the wait was extremely long considering how basic the menu was (sandwiches and noodles). When the food finally arrived, it was fine, but really nothing special. Don't get the Vietnamese coffee if you've had the real thing. It is nothing close.\nAnd here's the kicker - even the Sriracha sauce is not authentic. They clearly watered it down to get more bang for the buck.", "author": "Linda W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-09", "description": "Decent banh mi if you need to satisfy your craving, but definitely ask for it spicy. The tofu was good but the grilled chicken was dry. Well come back if and only if I'm in the area.", "author": "Yusuf S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-15", "description": "I had high expectations of this place based on the reviews.  I ordered the classic, which I always use to judge how good a Viet sandwich place is and it was just ok.\n\nHonestly I believe it was overpriced at $6.50 compared to $6 at Nicky's because it's the same sandwich.  I am not endorsing Nicky's as it's not great as well but for the price it's better.\n\nI still have not found any place in Brooklyn that comes remotely close to the price and quality for a Viet sandwich as the one on Grand Street in Chinatown, hands down the best ever.", "author": "Jason Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-03", "description": "Why can't Hanco's be like Starbucks and be on every street corner in DC??? Every time I visit my sister in Brooklyn, I have to get my Hanco's fix at least twice before coming back to DC where Hanco's is but a dream! The vegetarian chicken sandwich on the whole wheat baguette is pretty much the equivalent to pure ecstasy. The bread is always fresh and hearty, the fake chicken tastes so realistic and has an unbelievable texture and the carrots and cilantro give a wonderful cooling effect to the hot and spicy peppers and seasoning. It's absolutely to die for and the best hangover cure! This location is so convieniant to lots of shops, bars and is right next to the train. Staff is very friendly and always gets my order right and the prices are insanely reasonable. Until we meet again.... I love you Hanco's!!!", "author": "Natalie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-24", "description": "3.5 stars, rounded up for an implicit BYOB policy. \n\nComing back from the beer store a few blocks away (read: went to the holy mecca of beer distributors: American Beer Distributing and Thrifty Beverage Center), I popped in here for a quickie. \n\nAfter ordering from the nice lady at the counter, I capped open a specialty beer - tasted like wine-beer, and waited for my order. \n\nThe grilled pork chop sandwich was chunky and had good quality meat. The pickled vegetables were not as pickled as I liked them to be and the surface area to volume ratio was low - e.g., not enough finely sliced strips. However, I liked that there wasn't an invasion of mayo on my sandwich and the freshness was right on! \n\nAlso, warning to the pee prone.. there are no bathrooms here!", "author": "Stacy T."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}