{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-27", "description": "Definitely a fan of this place! Came here this past weekend with my girlfriend and friend to find the place totally packed! We ordered our food quickly and painlessly, and were able to grab a seat without any issues. \n\nThe food came out quickly, too! I had ordered a grilled chicken rice entree, and my girlfriend ordered the shredded chicken sandwich. I personally love this kind of stuff, and was already setting my expectations pretty high! The rice entree bowl is about the side of a traditional ramen bowl, half filled with salad, half with rice, topped with some cabbage slaw and your protein. It's a pretty big serving for the price, which I'm totally a fan of, especially considering the options in the area.\n\nThe chicken, unfortunately wasn't the best I ever had. It tasted almost like a kind of better-made mall food court chicken, but the real taste maker was in the rice, salad, and different sauces available.\n\nMy girlfriend had the shredded chicken sandwhich, but was a little let down to see that it wasn't so much shredded, but just cut up into slightly smaller chunks then what I had received. More bland then the grilled chicken, the sandwich was good, but nothing impressive.\n\nThe bubble tea we all got was excellent, though. Definitely some of the best I've had, for sure. I love that they do warm bubble tea, and their menu is pretty huge, too!\n\nI'd definitely come back here again, but would totally order something else. Not a huge fan of the grilled chicken, but that rice entree bowl was perfect after walking around sightseeing all day.", "author": "Scott N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-14", "description": "I had the original banh mi and the Thai iced tea. Wasn't expecting the sandwich to be stuffed with minced marinated pork since at least from my past experience, it's stuffed with variety of hams. Overall though quite tasty! The bread was very very crispy which I loved, flavors were great. Just one thing I wish was that they arranged the ingredients in the sandwich better. All the veggies are all on one side and the meat on the other. Kind of have to have a bite of each side for a balanced mix. The Thai iced tea was refreshing and not too sweet. Will come back to try the other sandwiches!", "author": "Susanna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-29", "description": "Return? Absolutely\nAtmosphere (3) no frills formica\nFood (4) - shredded chicken sandwich (.4+) \nDrinks: got a thai iced tea once - didn't like it\nService (3) Standard\nCost = $7 before tax/tip", "author": "Will S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "Pretty good pho and Vietnamese coffee! Their prices are less pricier than other restaurants and their pho is always good. It may be a little crowded during lunch so I would just call ahead.", "author": "Rocío M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-23", "description": "So my friend and I were super hungry we needed wifi and a place to charge our phones and decided to eat here, I've never had Vietnam food so I was a little scared I asked for something with noodles and chicken and I had a great enormous dish I think I spend like 11 usd with a coke it's NYC so I don't think it was expensive, they have free wifi and a nice view so this is a 5 and I'll definitely go again :)", "author": "Maribel A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "My favorite of the Hanco's locations all of which I frequent depending on where I am. This is my before getting groceries spot. It's generally clean (though all the Hanco's could be better about wiping down tables when ppl leave) and efficient. Nice and open. Decent amount of tables. Food is cheap, filling, and delicious. Wish I could try the pho but they only have animal broth.", "author": "Bea L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-12", "description": "Decent Bahn Mi but certainly not the best. At nearly $8 for the sandwich, I'd say that's pretty overpriced. Given the area, I guess I understand...\n\nThe problem I have with Hanco's Bahn Mi is simply the way they stuff the sandwich. It's not possible to get a bite that includes all of the meat plus the pickled vegetables at the same time. This defeats the purpose since the combination is what makes Bahn Mi taste so good. \n\nOrdered a matcha green tea bubble tea and thought it was pretty good. The bubbles were still warm so I had to wait for it to all cool down. Didn't like that. \n\nI will stick with Ba Xuyen.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "Good food, good service, good pho, good bubble tea. Fairly big portions, and not too pricey. I'd definitely come back.", "author": "Kegan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-20", "description": "never a disappointment!\nbubble tea amaze\npho amaze\nsandwich amaze\n\ncant wait to try the vermiceli", "author": "Nic C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "Hanco is a blessing. The food is quality. The service is pretty good (just make sure if you order through seamless that they actually get your order). If you plan on ordering or getting there for lunch avoid the 12-1 lunch rush. It can get pretty crazy- even though the wait and lack of seating would probably be worth the scrumptious food.", "author": "Thalia H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-06", "description": "I order from Hanco's AT LEAST once a week.  I've had the classic bahn mi, the vermicelli salad, the pho, the regular garden salad with shredded chicken.  All of it's delicious.  Always consistent.  The bahn mi is the best I've had in the area.  I crave the pho and/or the vermicelli salad at least once a week.  Delivery is quick.  Highly recommended.", "author": "Jenny S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "Hmmm... Where do I begin? Hanco's is my life. I've had probably 100 sandwiches, 80 bubble teas, 40 phos. Everything is so delicious. This is the one place I never get sick of. I love their classic and shredded chicken sandwiches. I love their beef pho. \nTheir bubble teas are great. \nThis is my favorite place!", "author": "Lynn M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-31", "description": "Consistently good pho, usually order beef broth and grilled chicken.", "author": "Kristeli Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "Great if you need a meal in a jiffy.  If you deciding between the two types of chicken get the grilled!  It's dark meat but it's much more flavorful than the shredded chicken which is really just boiled and chopped into strips, ha.", "author": "Gabriella K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-18", "description": "Got the classic banh mi. The bread was crispy and warm on the outside, soft on the inside. Meat was warm, and average, vegetables crispy and cool. My biggest gripe about the sandwich was that, due to the way it was assembled, did not allow for a bite including both meat and vegetables. As far as beverages are concerned I played it safe with a lemonade with lime, on the advice of an elite yelper friend who informed me that the quality of the bubble tea here is lacking. The lemonade was fine, of course it is difficult to mess up. They have free wifi and a bathroom and as such are an ideal establishment to sit and study/do work in.", "author": "Celia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "After wandering through Court Street/Boerum Hill/Cobble Hill looking for places to eat, we settled on Hanco's. Have had Hanco's a few times and it's really good, if not a tad expensive.\n\nThe first time we went to Hanco's sis and I pondered about what we should get after looking at their menu for a while, but decided on the Grilled Pork Banh Mi sandwich (Get this sandwich all the time ! ^~^ )\nWe actually debated on the rest of the Banh Mi's too but those didn't appeal to our appetite as much.\n\n-What I've tried-\nGrilled Pork Sandwich : 5/5, $7\nClassic Sandwich : 4/5, $7\nSummer Roll's : 5/5, $5.24, (Hanco's you could use more shrimp and put more rolls in the plate. 2 small rolls !?!?!?!?)\nBubble Tea's : 5/5 ($4 to $4.50, other drinks range from $3 to $5) \n\nIt actually did not take us long to receive our order, which is usually about 10 to 15 minutes wait.\n\nWe got our order to go so we could take a stroll while eating, although we have eaten inside the restaurant before.\n\nI've had Banh Mi sandwiches from other places such as in Chinatown and I enjoyed this one just as much as that, if not better.\n\nOne thing I would prefer they change though is that they add less pickled carrots/daikon, as it tends to make a mess if too full.\n\nOverall, I would recommend Hanco's to anyone craving some tasty Vietnamese food :)", "author": "Jenn Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-10", "description": "The sandwiches are fine, the soups are sub par. It's not a place i go to unless I'm in a hurry. This is coming from someone who knows Vietnamese food intimately. For all others with a novice palette this will do.", "author": "AR A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "The food is very good but service not so. I have been many times to the Montague store and suggest you try there. We met up with some friends and 7 of us ordered dinner. My 5 year old didn't like the grilled chicken but was starving and wanted to eat since everyone else was. My husband asked if they would sell him the sandwich baguette only and  they said no. Thinking it was a mistake I explained he was hungry and could we buy a sandwich baguette with some butter on it  (I'd pay any price, she could charge me for the full sandwich but put nothing on it) so we could finish our meal and he could eat something. The woman at the counter said no we don't do that. My husband had to leave and walk down Smith St to find him something somewhere else.", "author": "P C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "I love their grilled chicken soup. It is really tasty. However, their to-go soups are really a project. You literally have to \"build\" your soup. The broth comes in one container and the soup contents are in a separate container. I guess it wouldn't be a big deal for some. However, for me, especially when hunger kicks in, it's a huge inconvenience; hence the 4 stars.\n\nBubble teas = amazing!", "author": "Nadia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-01", "description": "Hancos is pretty awesome. They used to be around the corner at a hole in the wall next to van leeuwen.  But New Yorkers have a way of discovering a good thing. \n\nWhen they moved to smith st they got a larger sit down space in front. Meanwhile they only marginally upped the prices!\n\nTo my mind they are one of the best deals on smith st.\n\nConsistent \u0026 tasty. Fast service \u0026 all the while being a very healthy choice too. :)", "author": "Sean S."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}