{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-14", "description": "I can't believe I haven't written a review for this place yet, but it's definitely one of my favorites in the area.\n\nLoves:\n+ Your girl needs to get hooked up with a banh mi every now and then and this place delivers. I mean, even their vegetarian chicken is good.\n+ Price. $8 for a sandwich that gets you full? Hook me up.\n+ Location. Stone's throw away from the subway (and in my 'hood!)\n+ Friendly staff.\n+ Clean space.\n\nI will say I have only gotten sandwiches here thus far (I mean, they are SO reliable), but there are other items from rice dishes to bubble tea drinks that looked good. I know, I'll have to try it next time! :)", "author": "Connie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-29", "description": "I came here for lunch and asked for 2 orders of summer rolls to  go. I've made this same order a couple of times in the past, and both times they put all 4 rolls in one container. When I got back to work I noticed that they'd only given me 2 rolls, so just one order. They were eh. Didn't taste like much, rice paper wasn't fresh. I went back after work and explained the situation. They have several people look at the receipt and then tell me they have to look at the camera. I'm a little annoyed, but shrug it off and say ok and sit down.  But then I'm thinking \"soooo they don't believe me.\" They believe there's a possibility I came back hours later to try to get $5.25 worth of free food.\"  So I ask them, \"Do you not believe me?\" The young man at the cash register tells me they just have to check. I tell them that if they believed me, they wouldn't have to check. He then says \"well it was 6 hours ago\". So actually defending it. It just felt insulting, and I said so. So I wait about 10 minutes and one of the staff was very nice and apologized, and acknowledged she's made a mistake, and hands me my food. I tell her I want a refund (I know I should have said this before, but I originally wanted the food, I changed my mind after what happened happened). The guy at the front wordlessly hands me my refund. No apology, just the refund. I looked down and away from him, so I'm not sure what else he did. \n\nI get that restaurants have a small profit margin. I get that they have to protect themselves. I do. But to be made to wait 10 mins over $5.25 felt insulting. And honestly, it made me feel really sad.", "author": "Dana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-26", "description": "I liked everything about this place!\n\nI was in the neighborhood with a couple of friends and one of them suggested we go to Hanco's for a quick bite. The space is small but clean and cute. I ordered the classic Vietnamese sandwich and thoroughly enjoyed it. Unlike a traditional banh mi made of baguette that's so hard it hurts your upper jaw, the bread they use is soft and pillowy, toasted to perfect crispiness, which goes really well the roast pork and pate and their \"mayo\"-like sauce. If you are into spicy, you can also stuff some jalapenos in your sandwich and drizzle as much sriracha as you'd like. \n\nMy only wish is that they put their pho broth on their menu as a separate soup/side option. That would make me really happy.", "author": "Qianying Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-30", "description": "My go-to pho place in the neighborhood. I'm really glad that I live close to Hanco's. The store is nice and clean, but usually order delivery through Yelp or Grubhub. Delivery is always quick (never took more than 30 minutes) and there has never been any issues with apps or whatever. The beef pho and summer rolls are my favorites. Also really appreciate their decaf Vietnamese coffee.", "author": "Renee C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-30", "description": "Love this spot! The pho is especially good when it's a bit chilly outside.", "author": "Elvin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "I kept hearing that the bahn mi is consistently great here so naturally I order the pho instead. I was hesitant to try the pho, but I was immensely craving it . The flavor in the broth was so intense and flavorful, alongside the grilled pork. I was absolutely shocked that I can get quality pho around this neighborhood, and I felt envious for the people living around here.\n\nThe grilled pork was seasoned nicely and it was not greasy. The noodle had a nice chew to it and all the ingredients were fresh. Service was fast and the workers were polite. Absolutely nothing to complain about. I will be a repeat customer.", "author": "Canny F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-22", "description": "Favorite spot for a sandwich and bubble tea. Can't beat the price. Fun little authentic place to grab a quick lunch or dinner around $10-$15 for food and drink.", "author": "Adrianna J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-24", "description": "I was craving some pho during my lunch hours at work and stumbled upon this spot. After reading through some of the reviews I decided to give it a try. I ordered the beef pho and I must say it was pretty solid beef broth. The noodle texture here is better than many pho restaurants that I've been to. Considering that many of the Asian restaurants within walking distance from where I work are mediocre at best,  I was surprised to find out that this place surpassed my expectations. I will definitely be back.", "author": "Phil L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "These sandwiches set the benchmark for Bahn Mi. We walked over on this rainy night and the spicy tofu sandwich is unbelievable. \n\nIt always seems busy. Tonight a lot people were having the noodle soup. Maybe next time...\n\nI would have loved milk in my bubble tea. Still, the sandwiches are truly incredible. We had ours with no mayonnaise or butter. Incredibly delicious. \n\nHighly recommend.", "author": "Diane W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-16", "description": "The pho here warms my heart. I order delivery, I eat in, and I'm always happy. I think I've had almost everything on the menu. The vermicelli salad is a light, crisp option in the summer and bahn mi is always fresh. \n\nDelivery is prompt and always with a smile.", "author": "Julia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-16", "description": "I don't frequent Hanco's much since it is sort of out of my way. However, whenever I get the chance to, I undoubtedly do, with the loyalty card in my hand!! You get a free sandwich after achieving 9 stamps, each of which is collected upon the purchase of 1 sandwich. Totally encourages you to indulge in more of their delicious banh mis! I love that they have a wheat bread option for the healthier souls. They make great sandwiches with different meat selections and concoct a great iced Vietnamese sandwich. Their pho is decent as well, but I prefer the banh mi over pho. Either way, they're fantabulous!", "author": "Maggie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-16", "description": "My go-to lunch spot whenever I'm in the area or I would make a little detour so I can order a Classic sandwich, or a nice hot bowl of beef pho which is perfect when the weather is cold. Green tea iced bubble tea or the hot Vietnamese coffee with bubbles are my go-tos for drinks. Have tried everything on the menu. Simple. Straightforward. Comfort food to me \n\nClassic sandwich (7.25 before tax),\nPho 9.50\nBubble tea  3.75 small, 4.25 medium\nHot drinks about the same prices \n\nIf you're vegetarian  \nI highly recommend the vegetarian chicken sandwich or the vegetarian pork sandwich- so good!!!\n\nThey have vegetarian chicken pho (9.50) \u0026 veg pork pho too (9.50)", "author": "Yun Chun C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "First time trying a Vietnamese sammich and it was soooooooo good. I tried the dark meat chicken sammich and it was good but when I took a bite of my husbands pork sammich, I liked that one better. The pork was softer than the chicken but they were both delicious. The veggies were fresh and the sauce is excellent. \nWe had the summer roll too, which was excellent. The only bit of turn off was that the shrimp weren't deveined. \nI had the honey and lemon iced drink and I believe I am hooked.", "author": "Georgia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "Stepped in after randomly walking by one Sunday afternoon for a pick me up.\n\nWait was very quick. We ordered a honeydew bubble tea, an almond bubble tea, and the classic bahn mi.\n\nThe bahn mi was so surprisingly full of flavor and ingredients--all fresh. Baguette was perfectly toasted and crunchy on the outside, there was plenty of meats in the sub.\n\nBubble tea was aromatic and not too sweet. They seem to cook their tapioca in a sweetened sugar to allow for the bubbles to taste yummy too.\n\nI can't wait to go back to try their pho!!", "author": "Maggie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-15", "description": "Very average taro boba.\n\nI stopped by this place for a quick boba when I was running errands in Brooklyn. I love taro boba in LA but after disappointing run at Boba Guys was hoping to be in luck. Sadly, this was very mediocre boba. It was sweet but didn't have that taro flavor I was hoping for. The boba itself was okay. An average place.", "author": "Ilonachka N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "Best banh mi and pho I've ever had!!! The banh mi had amazing pickled radishes in it with such a beautiful aroma I almost cried. And the bread was the perfect thinness and crunchiness!\n\nFor pho, I had the traditional version and it was quite good. Next time I come I'll have to try the anchovy one, which my friend recommended, and their bubble tea! Will definitely come again whenever I'm in the neighborhood!!!", "author": "Julie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-14", "description": "i had the beef brofF pho for the first time since i moved to new york and I gotta say it hit me with that nostalgia wave for the pho ba co i had at home/: the noodles were thick and girthy and the broth was pretty good. lacking in condiment selection however I would stock it up with some hot chilioil ‍ but that's just my tea\n\nBoba was pretty good", "author": "Shannon L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-24", "description": "I love Vietnamese food. Then again, it seems I enjoy/love all cuisines.\nI've been to Hanco's many times so it is  odd I missed reviewing it. What's more odd is that I have always gone to their BK  Heights location.\nSince both locations are the same owner, I'll review as one entity. \nHanco's is an express Vietnamese establishment --either eat in or to go.\nThere's much to select from the menu---summer rolls (one of my all time faves), salads, Pho  soups and sandwiches. They also have a variety of great teas---hot or cold, bubble/non-bubble.\nSolid place \u0026 satisfying for your Vietnamese fix.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-29", "description": "Vietnamese is an awesome choice for vegans and vegetarians looking for places they go with their carnivore friends. I got the vermicelli salad this time. The only thing you have to do is say no fish sauce cuz it's in practically everything. \nThe bonus is the bubble tea. They have the milk subs if you prefer!!\nLove love love this place.", "author": "Kateria N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-30", "description": "Everyone knows Hanco's around here because the place is solid. My review is going to be simple and straight to the point. It's the mock chicken. If you're going to offer it as a vegetarian alternative, please make it taste good, otherwise it ruins your otherwise beautiful bahn mi. I don't know if they microwaved this stuff but it was just nasty. I could and should have returned it but was short on time and needed to eat. It was bland, had the texture of warm, soggy bread and just shouldn't be consumed. The taro bubble tea I got without sugar was definitely perfectly unsweetened for my taste, though.", "author": "Kat D."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}