{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-01", "description": "I used to order from here all the time - only dish I really get is the grilled chicken rice vermicelli, and the summer rolls.\n\nThey recently moved to a new location on Smith Street - I've only ever ordered in, but their last spot didn't even have a kitchen; they would heat up the dishes in a microwave.\n\nThe meat usually has at least one knuckle / ligament type piece in it. \n\nTheir bubble tea is top notch.", "author": "Chris L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-22", "description": "I'm borderline obsessed with this place. Their vegetarian chicken bahn mi' is the best I've ever had. It's simple, delicious and I'm always willing to get it. \n\nAt the other location, they have a yerba matte bubble tea that's fantastic too.", "author": "Julie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "I love Hancos!! You can't go wrong here. Everything is good and the service is great.", "author": "Ari C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "One of the best pho i ever had. The veggie chicken was amazing and so was their vietnamese ices coffee. Friendly, fast service and huge portions.", "author": "Karim N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-06", "description": "the bubble tea there is sooooooooooooooooooooooo good they don't just have tapioca but they also have lychee jelly balls,mango jelly stars ect.\nthe grilled chicken is amazing!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "author": "Lulu B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-05", "description": "Their original bahn mi sandwich rivals that of Bahnmigos, and is actually better than theirs.  The only issue I have with it is that when I requested the mild hot sauce on mine, they left out the spicy sauce.  Maybe it's that they don't put enough of it.\n\nSeeing as I haven't tried the other options here, I can't say that it is superior to its direct competitor.  I do love that there is seating and that I can lounge by the window, but seating is on high demand.  \n\nThe eye contact avoidance doesn't work here; people will stare and stare and then approach to ask if you're ready to leave.", "author": "Jenn F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-30", "description": "Hanco's is simple, good food prepared consistently.  \n\nThe service is friendly, if a touch disorganised when the rush begins.  But they recover well, and are always very helpful.\n\nThe summer roll are very refreshing, and the pho is ample.  But the real star here are the banh mi.  Particularly, the classic with it's mix of sliced and diced meats, pickled veggies and crusty toasted bread is a deceptively large meal in a small package. \n\nThe Vietnamese iced coffee is also deli delightfully refreshing in the summer heat.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-20", "description": "for ten bucks.  \nClassic bah mi.. extra meat.  and a classic bubble tea.\n\nThis was not the other banh mi's ive had.   This was was defiantly more of a man.  Big and meaty.  Juices flowing.  Good bread.  Good crunch from vegies.  This sandwich had it all.  Even the bubble tea was very good.\n\nInside is nice dirty and authentic looking.  hard to believe this place is a chain.  But they do make one hell of a sandwich.", "author": "Chris D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-25", "description": "One of the only bahnmi places I could find near Brooklyn Heights, I had to try this place. I had the regular bahnmi sandwich with the taro milk boboa tea. Nothing to complain about the food. I've had better at Chelsea market, but this is a nice place to stop by and enjoy lunch.", "author": "Jonathan E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "Went back, and did not receive sauce on the sammidge.  It was a substantial upgrade.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-16", "description": "It's ridiculous how often I crave Hanco's. Can't go wrong with the classic sandwich.", "author": "Stephanie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-12", "description": "Get the sandwich, skip the bubble tea\n\nOriginal Bubble tea: lackluster amateurish homemade quality. black tea base too strong, creaminess missing; quantity about 60% of typical Chinatown size; price 50% marked up; server failed to fulfill low ice request. Only thing you will taste is the resilient tannin in your palate. \n\nClassic Sandwich: thick and rich layer of pork, layered with ham and turkey. Very generous, savory bite; mayonnaise and grease in the pork blends well; however, about an inch and half short from typical saigon sandwich.", "author": "John D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-24", "description": "Good God I love this place.  The pho is delicious, they always have HUGE bottles of sriracha ready and available, and their classic sandwich is the stuff that dreams are made of.  Their new location is beautifully decorated and bustling.  \n\nHanco's please marry me", "author": "Emily S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "The soup and noodles were delicious! Fast service, great food, and very well organized!  We ordered 2 soups for 4 people, shared it.  Perfect amount.", "author": "ilana P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "Yass slayy! I love Hancos the food here is GREAT! BOBA TEA FTW!", "author": "Park Soo Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "So I've been back several times since my first review. And yes, the soup is amazingly delicious and fresh! Just the right amount of spices.", "author": "Alycia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "I used to eat here 5x / week for lunch when I lived nearby. Their pho and bubble tea are on point and made quickly. \n\nThey have 3 main seating spaces that begin with outdoor benches. Inside a small corner section can confortably seat 10-15 patrons. However, the additional seating upstairs proves to be more spacious and fit for noodle consumption. \n\nPro tip: call ahead to place a pick up order during lunch time. Thank me later.\n\nToodaloo", "author": "Will P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "Come for the sandwiches! Love Love Love the classic viet sandwich and the dark meat chicken sandwich. You get a choice of three spiciness levels (going spicy means jalapeno slices). Plus, if you're like me, someone who relishes in eating thru the pain of spice and heat, then grab a bottle of sriracha and squirt away! Huge variety of drinks but my personal fave is the Vietnamese Iced Coffee. \n\nAs for the Pho, I wasn't too impressed, especially with the cuts of beef and the variety of cuts. When you're at Hanco's, stick with the Banh Mi. \n\nAlways friendly service, bread is scrumptious, and the sandwich is stuffed to the gills!", "author": "Patrick K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-20", "description": "My boyfriend and I came here after we had Pho and a sandwich from Nicky's, and I have to say:  Hanco's sandwich is better.  The ground pork is so juicy and the bread is awesome (it could be a little toastier).  \n\nThe spring roll was really fresh, but I wish the peanut sauce had peanut crumbs in it!\n\nWe liked the sandwich after we had a full meal (Or it is just me, because my boyfriend said he still wants to eat 3 burgers from Shake Shack after this, and trust me,  he would do it if I give him the permission)", "author": "Juan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-27", "description": "The classic bahnmi hit all the right taste buds and the beef pho had the most glorious tendon pieces, possibly the most beautiful pieces I have ever seen. My buddy ordered the grilled pork sandwich which had plenty of meat, but was apparently an afterthought compared to the Classic. I was not a fan of the shrimp spring rolls, not sure what was wrong with them--maybe too many noodles and not enough cilantro? And the sauce was too peanutty. However overall, the meal was aces, it was freezing cold outside so just what I needed. A tad overpriced, but given no other vietnamese options nearby, willing to pay. Will definitely be back!", "author": "Suzi G."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}