{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "I  this place.  are amazing. The dark meat chicken is suggested. Bubble tea! The rest of this is just filler words. What else can I say? ‍", "author": "Denise H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-01", "description": "Bubble tea is really good here . \nThe pho, really delicious and you get a lot. So much flavor. They also have really\nGood rice salads. My fav is the shredded\nChicken rolls with the peanut sauce , it's sooo good and this place is really cheap . It's a college students dream for cheap and good\nFood", "author": "Brittany D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "I've tried a lot of different Vientamese spots in New York, and the dishes at Hanco's were impressive . Everything was flavorful and fresh. Recommend the summer rolls (very thin and moist skin), Pho, and Vermicelli Noodle Bowl with BBQ pork. Only qualms is that the portion sizes aren't comparable to Chinatown and they don't offer tendon in the pho choices.", "author": "Ann L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "Love this little joint.\n\nNot many seats make this a to-go place but there are just enough to allow two small groups and some individuals to sit and eat.\n\nThe food comes quick, the ingredients are fresh, the bread is deeeeelicious.\n\nMy fave of course is the Classic Banh Mi, warm layers of complimentary meats and a delicious sweet vinaigrette make this a great Vietnamese spot. \n\nRecommend iiiit", "author": "Arthur W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-24", "description": "Wow \nSo good !!!   The Perfect crunch bread and tangy veggies in the grilled pork sandwich was awesome !  $7.25 for a generous portion . Will be back ! \n\nWatch your step if you head down stairs !", "author": "S Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "I'm a big fan of this place and this location in particular. For over a year, I have been ordering take-out from the Hanco's in Brooklyn Heights. There has always been something wrong with the delivery from the Hanco's in Brooklyn Heights- either the rice would be too mushy, the baguette on the bahn mi would be too soggy, or the food was just cold (most likely because it was delivery). But, this location in Cobble Hill strangely doesn't deliver to my neck of woods in Downtown Brooklyn.\n\nMy friend and I happened to be walking around the ritzy side of Cobble Hill and decided to sit down and have lunch here. Both my friend and I ordered a grilled pork bahn mi and a Vietnamese iced coffee. I also ordered a pork chop rice entree to share. The first bite of the grilled pork bahn mi sandwich was heavenly. The baguette was crisp and had just the right amount of carrots, radish, hot sauce and then some- Sriracha sauce available if you need some more hot sauce. The grilled pork chop rice entree was also delicious. The rice dish comes with obviously rice, mesclun salad, carrots, radish, and pork chop with a side of fish sauce, and of course hot sauce.\n\nThe price of their food is definitely on the higher end, since you can probably get a similar bahn mi sandwich in Chinatown for about $5. But nevertheless, the food is still delicious. I am hoping that in the near future they will deliver to my area.", "author": "James W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "I found Hanco's during a random search for pho in Brooklyn. For some background, I am from DC and eat pho at least once a week (I'm obsessed). I was not disappointed with this selection. I got the beef pho and Vietnamese iced coffee to go. The pho portion is great and filling. The broth is very good (so tasty)! \n\nThe staff is nice and smiled. I realized that I didn't have a bowl at work, so they gave me an additional container. \n\nI will be coming back for sure!", "author": "Chris A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-09", "description": "My go-to for a bowl of Pho or tradition Bahn Mi craving! Isn't the best I've had, but definitely hits the spot. They got the basics right. Great value, and decent flavors.\n\nThe Beef Pho broth could do with more depth, but gets you there in terms of taste if you've had authentic Vietnamese pho before. The Bahn Mi uses ground pork, but traditionally uses different slices of cured meat. Still tastes good and will do for now! \n\nPS: I'm from Melbourne, Australia so I've been spoilt by the high Vietnamese population keeping it really traditional.", "author": "Ronald L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-16", "description": "Out of all the Vietnamese restaurants I have been to, this is by far my favorite!! Between the sandwiches (white shredded chicken I prefer), pho soup, and rice vermicelli (one of my favorite dishes), they all taste fresh! I love trying new foods and the woman at the register was very helpful in helping me to decide what to try next. I have only had 2-3 drinks from here but they were great as well. I definitely recommend this place for lunch.", "author": "Abigail G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-25", "description": "3.5 stars.   Fast and nice portion.   Ordered pork rice vermicelli.  Pork portion was small, but verm was large.  Tasted good.  Summer roll was good too.  Would come back", "author": "Ninja M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-06", "description": "What a phenomenal bowl of pho.  I've tried MANY viet places in the area and thus far I'd have to say Hanco's is the most authentic place I've eaten at.  I ordered pho for delivery the other night and the broth was still piping hot - enough to cook the raw sliced beef.   The banh mi sandwiches are also really good.", "author": "Tim N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-17", "description": "I knew before going to Hanco's that I would be a bit disappointed. Besides the fact that it was closer to where I live than other, more authentic Vietnamese restaurants, I really would try to avoid it. I", "author": "Allie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-15", "description": "Bubble tea drew me into Hanco's on a sunny day! Hanco's is a take out type of joint. Not really a restaurant. I ordered a thai bubble tea. It was by far the worst thai tea I have ever had. Eek! Methinks not!!!", "author": "Amy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "This place made me a Pho addict. The Beef Pho I get is out of this world and my partner consistently gets the vegetarian Pho, which she also loves. The garden rolls are a nice light side too. A+ bubble tea as well. Not a bad thing to say about this place.\n\nYou order at the register and can sit or take food  to go. Seating is pretty chill/casual and the service is quick.", "author": "Kayla G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-02", "description": "I have only come here twice, and both times I have ordered their Pho which is super flavorful and comes in large portions.", "author": "Anna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "On the search again for Pho, I think I'm addicted.  I found this place based on Yelp suggestions. Can't go wrong here. It serves a good Pho and well filling. The place is Cute, a bit small, but very friendly service. \nI had a Pho ga and summer rolls, which are fresh rolls, not fried. I took my order to go and in all honesty it would have helped if I had an extra empty container to mix up all the ingredients. By the time I was done mixing it up there was very little liquid left, as there were so many ingredients to add   Needless to say I had to eat it in stages to avoid a big mess on the table hehe. \nGets flavor, not greasy. Tons of veggies and herbs to add to the broth. Very filling.", "author": "Olivier D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-10", "description": "BEST VIETNAMESE SANDWICHES SO FAR. \u0026\u0026 PHO's.\nI haven't been able to find another place that makes the best sandwiches and Pho soup base. I say soup base because that's the highlight of a Pho noodle soup. I hate going into a place and ordering a PHo and the soup base is super bland. Not at Hanco's though their soup base is pretty tasty and the best so far for the price we are paying. \n\nI love the bread they use for their sandwiches not too hard that it cuts the roof of your mouth like other places. perfectly toasted so its warm but not hard. If you cant decide what kind of sandwich to order go for the classic with med spicy or the tofu sandwich with med. spicy. Those 2 are my go to pick.", "author": "Patricia N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-14", "description": "Was just nearly run down by one of their delivery guys speeding down the sidewalk on an illegal e-bike! Guys, have some respect and keep it on the street. Or you'll be answering to city officials directly.", "author": "A E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-07", "description": "Great price and pretty good taste but not impressive enough. I definitely had better pho with much better broth. The dip for the summer spring roll is pretty good though. In a nutshell, it's a quick, convenient, and affordable vitamin restaurant in this neighborhood.", "author": "Xinyu L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-02", "description": "Hanco's is our go to when I do not cook dinner...  The pho is amazing and the food is fresh. The bubble tea is also very tasty. The staff is great and the atmosphere is really cool.", "author": "Paola S."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}