{"aggregateRating": {"reviewCount": 659, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-04", "description": "Generic pho generator with rude staff should be avoided unless you like undercooked food. I dined in and their kitchen staff propped the doors open three times while they restocked their kitchen with supplies. I closed it the first time because it was around 29 degrees outside and the restaurant was already cold. When they saw me closing it, they looked like they wanted to fight me. They were visibly irritated with customers that got in their way, as well. I finished my bland, generic pho as I decided that I will never step foot in this generic pho generator again.", "author": "Veggie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-07", "description": "Have not had Hanco's in over 2 years because Nicky's used to quench my sweet pickled thirst for Banh Mi within the area. However today my co worker and I hopped on the bus en route to Smith street. Three Banh Mi's and a Thai Bubble Iced  tea later and I couldn't move...We shared the Banh Mi's mind you. I'm happy to be back with Hanco's and am content with it being my go to spot for Banh Mi's. Next time I will try the Pho.", "author": "Danny S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-09", "description": "This review is only for the bubble tea.  I was passing by Hanco's on 134 Smith St \u0026 spotted a sign for bubble tea so I stopped everything \u0026 ran over to get some. I have a serious bubble tea addiction which I am battling unsuccessfully. But hey, there are worse things in life. I had the Original - black tea with milk plus extra tapioca bubbles. If you don't like tapioca bubbles, Hanco also offers lychee jelly, green tea jelly, herbal and mango jelly. They also have soymilk and a nice selection of flavored teas without milk. I liked their bubble tea. They were very busy that day, the tea was good but I wished they'd given me more bubbles. Seemed like a normal (not extra) amount of bubbles. Will have to return \u0026 try again.", "author": "Marie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-02", "description": "I have tried the Hanco's on Montague Street and I honestly love it better than this one, much better. When I entered this hole-in-the-wall restaurant, it was so hot inside and it was so dark as well. \n\nFor lunch: I ordered a Banh Mi with pork and when I brought it back to work, I wasn't too happy with the way it looked. I've been to places where the Banh Mi's were assembled a little nicer. I asked for a non-spicy Banh Mi and although many people before me expressed this Hanco's is great and their sandwiches are delectable, I just didn't feel that way.\n\nMy favorite place to go for Banh Mi's is Banh Mi Saigon. They specialize in authentic Banh Mi's. The likelihood of me returning to this Hanco's is very unlikely.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "Friendly quick service. A very hearty original sandwich that will please a carnivore (the most meat I've ever had in a banh mi?) and vegetarian with every other bite. The bread was toasted and soft at the same time- a good texture. The prices are reasonable for the amount of food you're getting. Recommended for the occasional lunch.", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "We ordered two classic bahn mi sandwiches for delivery, which were really tasty! The food got to our apartment at exactly at the estimated time, which is always nice too.", "author": "Albert A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-25", "description": "It s. Good place to have bubble tea and Vietnamese Iced coffee. The vietnamese iced coffee is made with condensed milk, coffee and ice. It is a very alternative to ice latte. However it is very sweet (with more fat too). They have a large selection of bubble tea and if you don't like tapioca they have a tons of different Jelly to accommodate everyone. Now the only thing they need to work on is the decoration of the place otherwise a good address!", "author": "Thalie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "Fast service, decent food, limited seating. I always get chicken pho. Although the grilled chicken is always on point, the broth is rather bland. Like the fact that they provide lots of veggies for your pho. Friendly staff.", "author": "Shirley Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-11", "description": "My coworker and I had ordered their tofu-vegetarian Bahn Mi and Chicken Pho. It was delivered on time and still warm! I had the Bahn mi and even though I wish there were more stuffings in it, it was overall very tasty! I'm absolutely in love with the bread they used with it. My coworker was in love with their chicken pho and wants to order it again next week. We also had their thai tea (hot) \u0026 viet iced coffee. That coffee.. was the BOMB. Something I'd love to have daily!", "author": "Lydia W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-13", "description": "Pretty great place with very reasonable prices. Got the grilled pork Bahn MI which was great. \n\nThe wait was a bit long Tho. They forgot my order and had to actually start the order when I asked when my food was ready. (They had called a few numbers after my number.)", "author": "Al L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-07", "description": "I usually like Hanco's, but tonight the chicken on my chicken vermicelli was so overcooked it was practically inedible. It was like stale chicken jerky. If your chicken is old/overcooked, don't serve it. Make more.", "author": "Gerard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-08", "description": "Simple, small menu, but to the point and delicious.\nWe order here from work often during the spring.\nI LOVE...cannot express how much I LOVE the coconut Bubble Tea!! I don't know what they add to it, but it just had this absolutely delicious taste. I constantly crave it. I will say that there isn't much volume difference between their sizes..either that or they've just gotten my size wrong every time I order the larger one.\nThe white meat chicken sandwich tastes fresh and the bread is my absolute favorite. (I'm a fan of any bread for Vietnamese sandwiches so that may not say too much.)\nCan't wait to order from here again once spring comes around!", "author": "Alexandrea C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-07", "description": "I usually like this place, and it's one of the good restaurants in the neighborhood. But one time, I ordered like I usually do and when I brought it home I bit into it and it had veggies in it. I DIDNT ORDER VEGGIES!!!! I even asked for no veggies. WTF?!?!?!?!?!?!?!?! I'm allergic to carrot, and there was one on a slice of ham. Luckily, I took it out before eating it. But I'm highly allergic to it, so I had to throw the sandwich out just in case there were any hiding. Overall, one of the worst restaurant experience of my life. Though, I do still like this place for some reason\n\nCLICK OR COPY AND PASTE LINK FOR MY REACTION:\n\nhttp://i1.kym-cdn.com/photos/images/newsfeed/000/181/778/simpsons-donotwant.png", "author": "Jj T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-07", "description": "I've been a fan of Hanco's since they were on Bergen St. I can always rely on a tasty chicken sandwich and almond or any other flavour bubble tea. The service is always great and the food never disappoints. I only wish they had a food truck that was parked outside of my job or a location closer to my home.", "author": "Fee K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "Super Tasty Ban-Mi it was drizzling with sauce and well made tofu. Bread was extremely yummy in my tummy. This is one of those sandwiches I am obsessed with now!!!\nI would definetly try their matcha bubble tea.", "author": "Sehr Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-04", "description": "Delicious pho with grilled chicken and grilled beef and rice vermicelli salad. Taro, passion fruit and,iced thai bubble tea to wash it all down.", "author": "Ken S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-20", "description": "I had never been a banh mi enthusiast. Do not get me wrong, I used to enjoy an occasional Vietnamese sandwich from time to time. All that changed after I had stumbled to this little hole-in-the-wall on the corner of Bergen and Smith St.  The way they prepare this bad boy has opened my eyes on how good a sandwich (not just a banh mi) can truly be.   \n\nThe heap of the pickled daikon radish \u0026 carrot provide the perfect acidity countering the savory elements of ground pork, pate, and Vietnamese ham. The trio of the meats work beautifully with the mayo in this sandwich. The baguette is fresh and the cilantro adds herbal freshness and crispness. The spiciness(they fine tune the heat level based on your preference) provides a great rush as well.  I recall having it for the first time ever and being awe-struck from the disbelief of how good it was.  Did I tear up? Did my eyes roll in the back of my head? I cannot recall exactly, but it was one of those rare experiences that  us, food lovers, seek out. It made me the true banh mi believer - i was converted from that first bite.\n\nI remember once trying their grilled pork sandwich, for the sake of variety. It was pretty good but failed to amaze and did not stand out  to me like their staple, the classic did. Since then, I have never made another attempt to try any of the other sandwiches on their menu (no need to experiment when you have a great thing going already).  \n\nI work a 5 minute walking distance away, so I feel truly lucky to be able to frequent this place at least once a week.  I have been to Nicky's Vietnamese Sandwiches on Atlantic Ave, which is not far away from Hanco's and as far as the banh mi goes, I don't even have to tell you who the clear-cut winner is. \n\nHanco's is a no-brainer.  Stop by, order a classic (or even 2, should you be really hungry), with a summer roll.  You will not be disappointed.\n\n~This review is mainly directed to the classic banh mi at this particular spot on Bergen.  I have not been to the other Hanco's establishments in the city.", "author": "Dmitry C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-13", "description": "So far I've only had their Vegetarian Pork Bahn mi. But it was very good!  It was a busy lunch hour, so service was a little slower then I would have liked, but the ingredients were fresh and tasty, and the bread nice and crispy.  Their Rice Noodle salads looked really good and I'll have to come back to try them!", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "After taking a 5 year hiatus from yelping, here goes...\n\n\"I'm Hankering for some Hanco's!\" That has been my motto since last week when I \"discovered\" this wonderful oasis of cheap, yummy asian food in the desert of Brooklyn Heights crammed with more costly Japanese and Thai cuisine. \n\nI just moved into Brooklyn Heights for the summer and was craving some bubble tea. Thanks to Yelp I found this place and just when I was going to step out the door to explore, serendipitously my bf brings home a honeydew melon one from Hanco's.\n\nSince last week, I have been back there 5 TIMES. For the meals, I've only gotten the chicken sandwich which is chock full of goodness. When I bite into the toasty bun and savory chicken with pickled carrots, it transports me to Nirvana. At $6 a 'wich, the passage to Nirvana is quite economical and so-worth-it.\n\nI think the ladies recognize my face because of my frequency and one of them gave me a sandwich card the other day. I'm actually embarrassed but I keep returning. I've been meaning to try other dishes but I just can't get enough of the bun's toasty goodness. \n\nTips: \n1) I got the whole wheat today to be healthier but I regret my decision. It's not as toasty/crunchy as the white bread. So do yourself a favor and just get the white!\n2) If you call in advance, they will usually have your order ready by the time you swing by. I know! I have them on speed-dial (hangs head). Considering I live less than 5 minutes away, it's pretty sweet to just walk in and pick up my meal in a seamless transaction. Pay-stamp-carry-and-go\n3) The drinks are meh. Although I know better iced thai tea and bubble tea exists elsewhere, I find myself ordering here only because of its convenient location\n4) You can customize your dish per degree of spiciness: mild, medium, and spicy", "author": "Susan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "I ordered a lunch to be delivered to me at work and the vegetable soup with tofu was hot and deliciously made. The soy drink with grass jelly was delightful and I will definitely order again.", "author": "Melissa W."}], "servesCuisine": "Vietnamese", "priceRange": "Under $10", "name": "Hanco’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "134 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/N3l6obrY6QZNhueAeuwRiA/ls.jpg", "@type": "Restaurant", "telephone": "+17188586818"}