{"aggregateRating": {"reviewCount": 18, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-30", "description": "Great breakfast wraps - this is my go to place in Brooklyn Heights. Quick, easy and the staff are friendly.", "author": "Samantha S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-17", "description": "Was having a late lunch in the area later in the day but after having skipped breakfast my hubby and I needed something in our stomachs asap. Had been driving around looking for parking for 15 min and gave up and ended up in the garage across the street from the cafe. \n\nWe walked past the cafe and it was packed which was a great sign. We popped in not knowing what to expect. Pretty much a standard deli with all their meats and salads in the left side coupled with seating. The lady taking our order was patient as we were looking up and down the menu items. We both got bagels- one with eggs, cheese and extra crispy bacon and the other eggs, cheese and sausage. This was probably one of the better bagel breakfast sandwiches had. Not sure if they make their bagels there or have them delivered but they were nice and chewy. Appeared they used 2 eggs than the standard 1 and the meats were cooked perfectly. It was one gooey good mess. \n\nThe sandwich menu looked good and if I were in the area again I wouldn't hesitate to try one. Def good breakfast place!!", "author": "Michaela P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-08", "description": "Great options for food and fast service! A nice place to grab a quick bite to eat.", "author": "Margo C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-26", "description": "Good sandwiches and good prices. What more could you ask for in a take away brekky or lunch? My favorite is the breakfast wrap w/ ham, eggs, avocado, and pesto on a whole wheat wrap! Nom!\n\nAs for the interior, it's nothing to write home about.... but, hey, it's a simple deli, so simple works for Plymouth. Note that the sandwich maker guys are fast and make a mean sandwich... and they're kinda cute :)", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "It's a cozy place. Perfect place for quick bite before heading town to Brooklyn Bridge Park. My family got Bagel with Salmon and Cream Cheese, Roast Chicken Hot Sandwich, and Grilled Cheese. A lot cheaper than the delis I have visited in Manhattan.", "author": "Victoria Subin H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-04", "description": "They gave my food to someone else and when I came up to ask where my food was, they remade my food but had an attitude about it instead of being apologetic for making me wait. Finally got my onion rings and they were soggy and the onions did not taste fresh. Tuna melt was average, to be expected, but the service was poor. Won't return.", "author": "Connor J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-17", "description": "Good, clean, pick-me-up after a morning jog across the bridge. (It's just a few blocks away from the bridge entrance, b/t the A \u0026 2/3 trains)\n\nI'm originally from CA, where I had taken fresh produce for granted. The nice man behind the counter (owner?) seems the taciturn type, so I didn't ask, but I remember wondering to myself where they get the fresh veggies for the salad (the crisp factor was high).\n\nFavorites are the roast beef and the breaded chicken (after the longer runs). \n\nDelicious food and no frills. Glad we still have a down-home but clean option in this neighborhood.", "author": "James L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-19", "description": "Pretty good breakfast menu. The bacon, egg and cheese here was pretty good. Service was great but there's a lack of beverages here. They make their own juices and stuff at a rip off price. Their fridges has a small variety of drinks. From the outside, I kinda expected more out of this place. They have a good location and their space inside is pretty large. The lady behind the counter just gives a impression that she doesn't want you there. She's not very nice. \n\nIf you wanna get drinks, there's a deli and supermarket right across the street. For a place that calls themselves a cafe, they're terrible at offering and making drinks. They're more of a breakfast/lunch/sandwich quick stop. It's nothing close to a cafe.", "author": "Gary L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-06", "description": "I just wanted a sandwich. And I can get behind the fact that you name sandwiches after local sports teams; I happily ordered the \"Mets,\" with its chicken cutlet, bacon, muenster and ranch dressing (it sounded like more of a winner than its namesake, to be sure). \n\nPlease believe that I understand Ricardo is probably a regular, and deserves some sort of special treatment. However, as a new customer, I was a bit peeved that, despite my having ordered several minutes before he even walked in, you blatantly made his sandwich first. \n\nNormally I wouldn't worry about such things, but your favoritism caused me to miss my train by seconds. This, in turn, set off a chain reaction that inadvertantly resulted in the death of a puppy. Next time you fuck up the order, please, think of the puppies. \n\nThe sandwich was decent, though.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-24", "description": "Grateful that this cafe is two blocks away from the BK courthouse for jurors to crash at during lunch hour! There is a good amount of seats available; they have decent sandwiches but their $1.25 coffee needs a pound of sugar to be drinkable. Customer service is aight.", "author": "Darya S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "This has been my go to breakfast joint in Brooklyn Heights, the food is short order and delicious, the staff are helpful, polite and very quick. My favorite breakfast sandwich is an egg sandwich with bacon on a wheat bagel, all under 5 bucks, can't beat it in this neighborhood.\nDefinitely give this a place a try if you're close by, you won't regret it.", "author": "Rick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "Go-to spot for breakfast when I'm  in Brooklyn. They have very fast service, low prices for this area and a polite staff. \nThe coffee is not that awesome...then again I'm not a coffee drinker, I only buy it when I feel like I'm in a coma. That isn't enough to deduct a star because they don't care if you sneak a free refill lol. I didn't but I've seen it! X-D \nI had a tuna wrap with the spinach tortilla and it was massive and delicious. I've seen the bad reviews from a few years ago and I believe that this place is under new management. Definitely give it try for breakfast.", "author": "Shanora S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-22", "description": "MY sister had raved about this place. i lived by this place for almost 6 years and walked by it daily because it appeared closed or empty all the time. The wrap I got was nothing to be wowed away by but the customer service here is A+ !!! **HIGH FIVE", "author": "Asiah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "Several seats suitable for people watching.  Cheap, fast and good.  Great breakfast sandwiches.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-23", "description": "I have discovered a deli in my new 'hood where for $3.10 each Saturday morning I can order the PERFECT scrambled eggs and bacon sandwich in the city.  It's never crowded.  The service is friendly.  The food comes fast.  And everything is pretty reasonably priced.  I'm just sad it's not open on Sundays.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-28", "description": "Are these guys for real? I mean, what can possibly prevent a place this size, in a neighborhood this expensive, from going belly-up? Is this a soup kitchen? Do you offer free food for the indigent? Because, if  you don't, there is absolutely no pressing reason for you to stay in business.", "author": "Nicolay S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-01", "description": "Just cannot understand this deli, do they have a special deal with the building owner? I can think of 100 better food based stores to open on Henry in the very wealthy BK Heights. Plus a better deli exists across the street! Place is large and beyond mediocre, needs to be replaced.", "author": "Jeff W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-11", "description": "Looks dingy and unclean, which should have deterred me, but I ordered anyway.  There was a hair in my sandwich.  Yuck. Also, they don't accept credit or debit cards.", "author": "lauren j."}], "servesCuisine": "Delis", "priceRange": "Under $10", "name": "Plymouth Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "90 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_d9sXe2l84fu5fybAnes5Q/ls.jpg", "@type": "Restaurant", "telephone": "+17186240074"}