{"aggregateRating": {"reviewCount": 32, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "Nothing makes me happier than finding a small hole in the wall spot that makes authentic food, and does it extremely well. This spot makes perhaps  THE BEST al pastor taco in New York. They have 3 types of taco, your standard chips , salsa and guac(but again, extremely well, super fresh), a corn in a cup, and two types of aguas. You can get 3 tacos for about $12, they are your smaller, street food size, but overloaded and very filling.", "author": "Christy I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-06", "description": "Food is really good and speedy. Legit Al Pastor tacos. I work in the area and come here often. But the MUSIC is always headache inducingly LOUD. I love music from around the world, I work in the music industry, but they always have this intense Mexican music with the tubas and whatnot and did I mention IT'S REALLY LOUD, like you have to SHOUT your order to the guy who is one foot in front of you. It's unnecessarily stressful and is the one thing deterring me from coming more often. You're at a 10, just take it down to a 6 so people can enjoy your tasty food and not feel they are getting punched in the head by a Luchador.", "author": "Jacob B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-15", "description": "They charge $4.75 for guacamole and chips and then proceed to throw a massive pit in the container. Total rip off!", "author": "Mi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "Even though there were 2 low points I'm gonna give this 5 stars. The first is that the cashier is not not good at his job. When you order, you walk your ticket over 5 feet and give it to the cook. This would be fine, but there's no sign telling you to do this, and the cashier doesn't tell you to keep the ticket and give it to the cook. I watched 5 people do the same thing we did and fish their crumpled up ticket out of their pockets. He also did not acknowledge any parts of our order the first time. As if nothing we said registered. But anyway, you're not here to get waited on by Stephen Hawking.\n\nLuckily they've invested in the important labor, the cooks. They have a tortillera slapping out homemade tortillas and a guy working 2 vertical roasting spits. You can tell everything is made fresh in-house with quality ingredients, but unlike, say, the ridiculous nori wrapped bullshit up the street at Taco Dumbo, this carries the appropriate amount of grease and full-fat dairy. So the 2nd thing is: this burrito bowl that they're obligated to have because all food must come in bowls now has sushi rice in it. But my guess is that the burrito bowl is for all the tourist rubes taking the same photo of the Manhattan Bridge with the Empire State Building in the background. If you order that at what is very clearly a taqueria you deserve an unwitting Mexican-Asian fusion experience.\n\nJust get the tacos al pastor. They are 75 cents too much because Dumbo, but they're legit, with richly spiced meat, onions, cilantro, and a little baton of pineapple. They have 3 salsas, all of which are good. The chips and guacamole are a relative bargain at $4.75, as are Mexican Cokes at $2.75. Don't overthink it.", "author": "Steve C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-27", "description": "When the taco craving hits, and I can stop by during lunch hour from work? Win win, if you ask me. I've only had the pork taco's so far, along with the chips \u0026 salsa or guac - the chips are always cooked to perfection and the salsa, just right. Yes, it's pricey, yes you have to bring your receipt with you from cashier to cook (and the toppings area towards the end can get congested at times), but I am still a fan!", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-16", "description": "This is a direct ripoff of Los Tacos no. 1, down to the name, logo, font, signage, and ordering style. Why not get your own ideas? It's too bad as the people are nice but it's hard to be okay with someone blatantly taking someone else's intellectual property. The food was okay, a bit dry but I won't be returning. I'll stick to the original.", "author": "mary m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "Reading some of these comments, honestly you guys are complete haters. You can't please all the hipsters who live in the area and all you guys are doing is unnecessarily deflating their rating since there are only 4 reviews. This place is really good. Dumbo needs more spots like this where you can get a quick bite to eat on your way home. Sure it's $12.35 for 3 tacos, but honestly for anyone who lives in Dumbo that's pretty standard, if not, cheap lol. Chicken Al Pastor is something I rarely see and it's on point here. I've only gotten the burrito bowl once, and thought it was pretty good, however the Tacos are so damn good. I usually come 1-2 times a week since it's pretty much the only option for a quick bite in the area. \n\nTLDR: Don't listen to these hipster food critics who are rating it 1-2 stars since they think it's unfair that they were charged 11 cents extra (which is standard for anywhere that uses Square readers). This place is great, and I highly recommend. It's definitely not cheap but understand that it's a pretty good deal considering where you are.", "author": "Yash B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-15", "description": "Tacos are very good, but the charging a cc fee even when customers use cash is a serious problem. This has been mentioned before in other reviews, but it seems either it has still not been addressed by management or worse, they have chose to be willfully negligent to the matter.", "author": "Joey L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "I started out with 3 tacos and promptly ordered--and devoured--2 more after polishing off the first ones. The menu is as simple as they come, which lets the owners/employees focus on making perfect pastor tacos. The chips and guac made for the perfect side, too. This meal hit the spot and it'll pretty much scratch that taco itch. No frills, no bs. Just perfectly cooked and constructed tacos.", "author": "Niki G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-30", "description": "The tacos were amazing. As a Californian, these are the closest I have gotten to Mexican food in California in the city.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-17", "description": "The tacos are delicious but the prices are deceiving, the tacos are actually about $3.86 each. If you do not math the restaurant actually charges more than the sales tax of 8.875%. I know it isn't a lot of money, but I think this is really dishonest. I eat here maybe once or twice a week and just realized this. I love that everything is homemade and the Salas are fabulous. I hope they can be more honest with the prices.", "author": "Karen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-21", "description": "Best food in DUMBO. Excellent Mexican!!", "author": "Baby Elephant P."}], "servesCuisine": "Tacos", "priceRange": null, "name": "Los Tacos Al Pastor", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/vTCJqsb0gP4tmzwnrUJOcQ/ls.jpg", "@type": "Restaurant", "telephone": "+13479160190"}