{"aggregateRating": {"reviewCount": 32, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-22", "description": "Ordered from here when I was in the area for work. It was a quiet shop and I was in the mood for Mexican. The shop looked authentic and it had decent reviews on Yelp. When you first walk in there is low mariachi music playing, and there's a bunch of cute decor.\n\nNow its on the pricey side, but i'm not surprised because it follow the Dumbo pricing. \n\nOrdered a chicken burrito bowl with guacamole and all the fixings! The pico de gallo was super fresh and just the right amount of spicy and lemony. The chicken was juicy, and plentiful. Sometimes going to places like Chipotle, they skimp out on the meat, but not here! I also opted to sprinkle some chili pepper to give my bowl a heat kick! My favorite part of the burrito bowl was the bit of pineapple mixed in with the rice!\n\nWould try again if I'm in the area!", "author": "Darya M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-29", "description": "Don't even bother coming here. Horrible ripoff of the famous Los Tacos No. 1. This place should be ashamed, and probably sued by the original place, for blatantly copying every last detail of the original Los Tacos, down to the font of their menu. \n\nThe food is mediocre at best. The person behind the register as well as the owner treat customers absolutely disgustingly. I walked in once and ordered a few tacos, and for some reason the cashier had put in a few more tacos than I had originally ordered, and he said there was absolutely no way I could get this fixed or get a refund for this, so I left a complaint through their own feedback system. My feedback was fairly polite and straight to the point (\"Was charged more than I ordered and was refused a refund\") \nThis is what the owner had to say in return \"You ordered five and three according to the cashier and this is exactly what you received when you realized that you had too much food you decided to get a refund so please ....and your signature is not done properly but I do have you on camera just in case you choose to dispute this thanks have a good one ....\"\nThis is absolutely not how I expected this experience to go because I assumed this place was another location of the place I have loved for years. Wouldn't recommend this place to anybody.", "author": "Jerry W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-12", "description": "It's good, but could be better. The good first: generous amount of tasty guacamole and awesome salsa bar. The salsa, especially the spicy red, is delicious. Chips \u0026 guac are my go-to here, although the amount of chips you'll get ranges. Sometimes 1/4th of a brown paper bag, sometimes half. They shrugged their shoulders when I mentioned this. Inconsistency and subpar customer service, -1 Star.\n\nThe tacos are good but not mind blowing at the price point. I wish the cactus tacos were a little cheaper than the meat tacos. Would also love another veggie version, grilled portobello or seasonal vegetables would be nice. Limited menu \u0026 price -1 Star. \n\nThere's lots of potential here, and I'd like to see them succeed. More consistency, veggie options, and better customer service could help here.", "author": "Kaylyn A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-06-01", "description": "Quick service, delicious FRESH food/salsas, reasonably priced, great location. Absolutely would recommend!", "author": "Isabella B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-24", "description": "Rude cashier with attitude issues. The music was loud and interfering with ordering and clear communication so he took out his frustration out on the customers. Not professional at all. Plus I found out later they didn't disclose for credit cards there's an extra charge. The food is not good for me to come back to endure the crap treatment.", "author": "Ivan Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-12", "description": "Came across this cute taco joint after checking out a pop up near by in Dumbo Brooklyn. The place looked spacious, clean \u0026 welcoming so we took out chances since we were hungry! The tacos were fresh \u0026 absolutely delicious! I love how they gave us the tacos \u0026 we got to dress it up to our liking with the pico de gallo \u0026 sauces! We can't have pork so our only other meat option was chicken so we had the pollo al pastor \u0026 loved every bite! Worth the try! Although we wish they had beef, it was still pretty good.", "author": "Samina C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-21", "description": "Don't move the tables or you will get yelled at by the owner. \n\nMy colleagues and I were having lunch ahead of the daily lunch crowd. There were 3 of us but the tables really only accommodate 2 people. The establishment was empty at the time so we moved a table over for more space -- without any objection from anyone working the register or the prep area. When we were finishing up and getting ready to leave the owner, a stocky man with glasses, came over to my colleague and rudely told her to move the table back. Had he taken a moment to pay attention he would have seen that we were cleaning up our space. Instead, he felt it appropriate to make his patrons uncomfortable. \n\nThe stars are for the food only but it's not worth coming back to such inhumane treatment.", "author": "Dani K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-21", "description": "Decent food, rude owner. Too many options in the Dumbo area for management to get nasty -- specifically with customers who are paying $13+ for a piece of shredded al pastor on lettuce. Will not be returning.", "author": "Nadia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "ON POINT! Taste, music, pico/salsa bar, taco making system... all 10/10.\n\nI was surprised to see this place nestled in the building where I work in Dumbo and was impressed with the vibe and flavors. The first thing that hits you is the smell of glorious grilled meat and the lively sounds of mariachi. You walk up to a counter in front of a wall of colorful sodas and sparking waters and a giant \"Bienvenidos.\" The menu is simple - choose your meat/filling of choice and tortilla form (taco v burrito). Add on some chips if you'd like some crunch or esquite if you're feeling fancy. Bring the receipt over to the taco counter where they'll ask whether you want it \"con todo,\" a lovely mix of guac, cilantro, onion, and pineapple. \n\nYou can watch your fresh tortillas slapped onto the grill to heat up and the al pastor meat spinning luxuriously on the spit grill. After you get your food, you can dress it up at the salsa bar with their homemade pico de gallo (fresh, colorful), red/green salsas with a good kick, and lime and chili pepper.\n\nAs a bonus, the ground is made of this pastel colored geometric pattern that was lovely. The only downside for me was the price - $3.75 per taco! As my coworker put it, this place is \"spicy and pricey.\" Any time I'm craving some al pastor tacos though, I know where to treat myself.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-06", "description": "My favorite nyc mexican joint opening in brooklyn? This is better than a white Christmas! The menu here it a bit different (tacos, salad bowls, or burrito bowls ) compared to their Chelsea market location. \n\nFood was great, as expected. This is a take out or quick eat in location (there are 3 tables with 2 chairs each). \n\nMy only gripe is that I realized my salad didn't have pumpkin seeds in it as advertised and when I asked the cook, he said they don't have them. The cashier should have informed me when I was ordering if they didn't have all the ingredients listed. Hopefully this is just one of those kinks related to being newly open.", "author": "Stacey F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-01", "description": "I was hoping this place would be good but I didn't even get a chance to enjoy my taco. \n\nNot sure who's fault it is but they charge a credit card fee without telling you, EVEN IF YOU PAY IN CASH!  \n\nSo I ordered a taco that's listed as 3.75 and the total came out to 4.20. It sounded weird because I know that tax on that should only be about 25-30 cents. I paid it but went back and asked the Einstein working the register how it became $4.20 when 1 taco is $3.75. So with tax, the proper amount should be $4.08 after adding 32 cents in tax, since NY tax is 8.875%. So the guy shows me the computer screen and I see a credit card fee for 11 cents. I asked why did he charge me a Credit card fee when I paid in cash? He response was something like, \" I don't know, that's what everyone pays.\". So I told him you can't charge people a credit card fee when they pay in cash and he just repeated what he said. I asked if he can take the fee off and he didn't seem to know how to or he didn't want to. I can't deal with incompetent workers, so I just took my money back and walked out. \n\nThe issue here isn't the money. I'm already paying $4+ for a taco so 11 cents isn't a big deal. It's just the principle of them charging everyone a credit card fee when they shouldn't and the fact that this kid was too dumb to realize it was wrong. If he had said, \"You're right, let me fix that for you.\", then we would be fine and I would have written a review about the taco. If my order was much larger, that fee could equal several dollars! So whoever the owner is, I suggest you retrain the kid or change your pricing policy if it was your intention to steal an extra 11cents or 2.9% from everyone that pays in cash.", "author": "Dennis C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-26", "description": "Love the Spanish songs they play here. Décor is welcoming and makes you feel comfortable although it is a bit small. I love the spicy red salsa and tacos and chicken burrito. Mm, so delicious! I am a huge fan of Mexican food and thankfully this place did not disappoint. The  only thing is they charge a fee even if you pay in cash so you got to remind them that you are paying cash so no extra fee.", "author": "Liz A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-30", "description": "Los Tacos Al Pastor is a new taco joint in DUMBO, not to be confused with Los Tacos No. 1 in Chelsea Market. Their best seller is go figure al pastor tacos. However, they also have pollo and nopal. Tacos will set you back $3.75 a piece, but I guess that's the going rate in DUMBO. They are tasty and worth the price. Al pastor tacos came \"con tado\" with guacamole, onion, cilantro and salsa. We also ordered chips and guac for $4.75, but I preferred the salsa in their salsa bar (green, pico, smoky red) to the salsa they served with chips. There's also Mexican soda Jarritos ($2.75) and Agua Frescas for sale. Los Tacos Al Pastor is a great addition to the neighborhood.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-19", "description": "I really liked the tacos at first however a few hours later I was met with very bad stomach cramps, nausea and vomiting. It's been two days since I've eaten there and I've only now begun to feel a little better.  It was good at the time but definitely eat at your own risk!", "author": "Khadijah F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-19", "description": "Direct rip off of los tacos no. 1 in Chelsea. They even use the same font.. sadly the tacos don't come close in flavor. Normally don't give yelp reviews but had to warn people about this unoriginal knock off taco spot", "author": "Adolfo G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-12", "description": "Great taco spot! Very authentic. I highly recommend the corn side it was DELICIOUS.\n\nThe atmosphere was also great. A little small but good for grabbing a quick meal.", "author": "Ana K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-09", "description": "Direct rip off of a nyc staple. Not cool. Tacos not the same. Prices are high as well to pay for a knockoff taco", "author": "Zak K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-07", "description": "Very ok food. Good amount of guac, 2 Tiny tacos, and a drink for $16, not really worth it", "author": "Ariel C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-23", "description": "Dry, tasteless, and overpriced tacos. If this place is related to Los Tacos #1, they need quality control. If not, #1 should sue them. Lame", "author": "Logo S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-12", "description": "The very fresh ingredients and cute clean space are excellent for NYC. But the limited menu has not improved since it opened in early 2018. All the tacos are the same price, (even the non-meat one?) at $3.75 each. \n\nThe taco options are pork, chicken and (for vegetarians) nopals... which is cactus soaked in cold vinegar... not that great. But the homemade tortilla are really really good.\n\nI would love if they would add a breakfast item to the menu (maybe all day) ... how about some huevos rancheros?", "author": "John C."}], "servesCuisine": "Tacos", "priceRange": null, "name": "Los Tacos Al Pastor", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "141 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/vTCJqsb0gP4tmzwnrUJOcQ/ls.jpg", "@type": "Restaurant", "telephone": "+13479160190"}