{"aggregateRating": {"reviewCount": 158, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-17", "description": "I like this bagel place. They have a lot of bagel and cream cheese options. There are also a bunch of tables to sit and eat at. The staff is friendly and nice. There are a lot of good bagel places in NYC but if your near Atlantic Barclays area this is good place to go.", "author": "Vicki G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-16", "description": "La Bagel Delight\nNY BK Fort Greene\n10am Saturday 16th July 2016\nThree Stars\n\nIn a quite convenient area, La Bagel Delight is standard above average bagel and deli. I was able to Immediately order a Bacon, Egg, and Cheese on a Toasted Everything Bagel. I did have to wait for 7-8 people to get their food first. During that time, there were some confused interaction between store and customers. My order was perfect. The bagel was overly toasted giving a strong burnt onion and garlic taste. Both sides had the everything season which was good mix but could have used more salt. The bagel itself was too dense and chewy. The eggs were freshly cooked but have no salt or butter. The bacon was pre cooked but lacked any crunch. The cheese was standard American but not very melted. Overall, it was cheap and filling but not on the same level as other New York Bagel places.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-07", "description": "My Fort Green bagel spot! \nYou're definitely moving up the list.  \nWide selection of breakfast and gourmet deli sandwiches which I have yet to try, this is based solely on their bagels. \nAmple amount of cream cheese selections: \n- 3 diff types of jalapeño cream cheese\n- 2 types of lox \nand your standard affair of strawberry, tofu, etc. \nWide selection of bagels behind the register: \n-everything\n-sesame\n-poppi\n-whole wheat\n-whole wheat everything\n-oh and the infamous rainbow bagel, they got that too. \nI personally got the sesame with bacon and herbs and it hit the spot. My friend ordered everything with jalapeños and she was ecstatic too. \nCouple tables and a quaint environment perfect for afternoon chat or when looking to get some work done.", "author": "Yannie E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-28", "description": "Food Wasn't All That Great, Got My Order Wrong Twice. Tasted Like They Put There Foot In It. Went Back For A Refund And Manager Told Me To F*** Off, So Unprofessional.", "author": "Kevon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "Really good bagel and sandwich place.   One of the few places around this area that are still fairly priced.   Breakfast and lunch special are really good, they don't hold back on their sandwiches or bagels.  I recommend the roast beef hero sandwich, white fish salad and lox salad on a bagel.  The service is usually fast and courteous too.", "author": "Fabian G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "I officially found my Brooklyn breakfast spot! There's no secret why I chose this place. \"La Bagel Delight\" is, well, delightful! Walking here with my brother after the gym I was starving. I checked my bookmarks and saw that I had added this place. It wasn't a bad walk from my job, but it was definitely worth every step I took to get here. Once we arrived, we wondered into a place that was extremely busy. Nonstop traffic in and out of the deli. Every seat was full. What was going on? My stomach needed to find out. After a brief wait I got to the counter. The lady that took my order was wonderful and pleasant. She asked what I wanted, wrote it down and asked my brother. I was in such a good mood after dealing with the employee, I paid for my brother. The wait for our breakfast was a little long, but that's because of the amount of business they do. The wait wasn't so bad because they played great music. I listened to the sweet sounds of Perter Cetera and Foreigner while they prepared my breakfast. Once they called my name we got seats and pulled out the goods. I couldn't believe what I was doing. I was eating a work of art! The croissant alone was worth it. It was fresh, warm and flaky. I fell in love instantly. They also added the right amount of cheese (did I mention I love CHEESE) to make the sausage and egg not disappear. This was the egg sandwich I have been searching for my entire life. This place gets a well deserved five stars. I strongly recommend and true Yelper, head over here and see if I'm wrong.", "author": "Evan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-25", "description": "Fuck yes. Fuck yes. Need I say more?\n\nBEC on everything bagel. How the OGs do it. It was god damn good.", "author": "Matt L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-15", "description": "They are extremely rude after not completing our order and having us wait for 45mins for coffees and bagels. So many negative words to describe their customer service.", "author": "Sammy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-27", "description": "It's odd that two different locations are sooo different but that's definitely the case with La Bagel Delight. Actually, that's the case with most of this chain's locations. This one is near where I used to work so I do find some joy in going here even though it is overpriced. That said, they do have good healthy options for eating small things as opposed to some of the other places in the neighborhood. And the seating, though I've only eaten in once over the past 9 years, is a great simple option. Their egg white salad in particular is top notch. \n\nThe quality of the staff is sporadic though. Never bad enough to warrant a boycott, but questionable enough to halt my visits from time to time. I've thankfully never found the bagels to be bad or even mediocre (though not refuting the other reviewers), and their treats are pretty decent, so when I need a breakfasty meal or some light natural food, I'm all in. Wish I was able to grant an extra 1/2 star.", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-15", "description": "I try to never give bad reviews, but this place has the worst customer service.  No clear way to see where to order, cashier completely rude, didn't take in the right order, wait is about 25 minutes for my bagel.  Wrong order.  Terrible...What a waste of time and money!", "author": "Christina H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-05", "description": "The reason this place is so busy is that it's the only bagel place in this part of the neighborhood.  The food is fine. The bagels are just okay but the headline is that the manager is simply terrible. I've not ever had an interaction with him but I've witnessed him be demeaning to his employees and flat rude to customers.  It's a shame really.  There just isn't a good reason to publicly belittle you're employees.", "author": "Stephen A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "I stopped by this place at about 3 PM on a Saturday afternoon. I was craving a sandwich after returning from a particularly disappointing brunch party where the food was no good. \n\nThey have a huge selection of sandwiches, the basic ingredients are the same, the combinations differ.  The bread and bagels they use for their sandwiches are hand made and very nice. They do offer salad options as well and allow you to customize or make your own sandwich.\n\nI had the Italian chicken sandwich which consisted of grilled chicken, grilled pepperoni, peppers and mozzarella. It was quite a huge sandwich, the chicken and other ingredients were good. I wasn't particularly wowed, but wasn't disappointed either.\n\nI had my sandwich to go, the cashier girl was very friendly and helpful, the guy taking the order to make he sandwich not so much. They have some seating space, I've walked by the place quite often and haven't seen it overly crowded.\n\nI will definitely by stopping by again to try another type of sandwich.", "author": "Subodh M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "Love this little neighborhood gem! Their bagels are fresh and soft, they have a good variety of cream cheeses - at least 3 tofu options - and I swear they make the best iced vanilla lattes!!", "author": "NiCo R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "It felt like the bagel was melting in my mouth. The staff was also very friendly and nice. If I would live in this area I would definitely stop here every day.", "author": "Elena B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-15", "description": "Manager would not replace a $10 bad chicken salad.. insulting, unwise and pathetic. My wife bought a Curry Chicken Salad here (it's ok) a week ago and it was already bad the following day. I put it (full) in the freezer so it wouldn't stink until I had time to return there and ask to replace it. The cashier had to call the manager to perform this $10 transaction and the manager flat out refused to replace it, claiming that I should have come back immediately. I confronted him about this and he basically flat out said he didn't believe me.. over $10. I have spent at least a couple hundred $$ in this place previously. Never again. How insulting, how short-sighted, how pathetic. Stay away from this location.", "author": "Lidor G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-27", "description": "people preparing the food in the sandwich area a re pigs  they dont change their gloves while prepping the food  and when you arent looking they grab the food without gloves  \n\nPatrons at the Bagel Delight when you touch  a surface before preparing the  sandwich with old gloves you most change gloves asap. \n\nYour employees need training in handling food  also you people should be preparing the food in front of the clients and not hide behind the counter where customers can't see what is done. \n\nim calling the health department today about this situation \n\n\n\nnever coming back", "author": "Fico P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-26", "description": "The bagels here are not good. It's a shame since it's the closest bagel shop to my apt. I'm giving it 2 stars because it seemed clean and the service was great. And to be fair I haven't tried anything else besides the bagels. But the name implies I will be delighted from the bagel. That was not the case. \n\nI won't be coming back sadly.", "author": "Leilani L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-23", "description": "Ordered a mr. bagel and breakfast #2 around 10:45am and received it 30 min later. During the 30 min wait, the majority of customers that came in after us, were receiving their orders before us. By the time we got our order, the breakfast #2 bagel was cold. There is usually decent service here, but this time we left very disappointed.", "author": "Lexi B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-05", "description": "I'm not sure why this place gets good reviews from people. This is by far the closest bagel shop to my apartment, but the bagels are so bland that I refuse to go here and would rather walk to Prospect Heights or Park Slope and get a good one.\n\nIn addition to the bagels just being bad, the servers are super slow and at times rude. \n\nI saw some people comment that the breakfast sandwiches are big which is true, so if this is your only criteria, and you don't mind an everything bagel having the barest amount of flavoring and possibly egg shell in it, then it's for you.", "author": "Jeremy E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-11", "description": "The service in this place sucks! They never have a delivery person! They have these lunch and breakfast specials and they tend to run out of ingredients (smh). The food has certainly changed over time \u0026\u0026 not in a good way. The home fries (or potatoes) tend to have more peppers and onions then actually having potatoes. They used to be really good but they aren't any more", "author": "Sheira C."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "Under $10", "name": "La Bagel Delight", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yuuA4hrvwe9tTH9xayZjUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182463744"}