{"aggregateRating": {"reviewCount": 158, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-16", "description": "Great bagels. Not dense on the inside like many bread items that try to pass themselves off as 'bagels'. Confusing at the counter. What appears like a line is just people milling about waiting for their order. Listen for the counter to call NEXT! and dont be bashful- go get that bagel! Nice staff too.", "author": "C S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-04", "description": "This place was fantastic! I took my daughter there before we went to the citywide high school fair at Brooklyn Tech. It was super crowded but the service was great and the staff was really friendly and put up with my daughter changing her mind on her bagel sandwich. We both ended up with a bacon, egg  and cheese bagel. I had mine on pumpernickel since I didn't want to be breathing garlic on students and teachers at my daughter's potential new high school :) The pumpernickel was fantastic...very flavorful with both rye and caraway seeds. My daughter got an everything bagel which was almost as good. The bagels had a crunchy exterior and a soft chewy interior and were some of the best I've had in New York. The sandwiches were loaded with bacon and the best part...there was a huge amount of cheese that was literally gushing and gooing out of the eggs because the cheese had been folded in between the eggs, kinda like a cheese omelet. Delightful!\nThe coffee was also very good. I don't normally come to Brooklyn but if I ever am anywhere near this place again, I will definitely go. The selection of cream cheeses was awesome!", "author": "Tara L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-07", "description": "Stroller friendly, clean, efficient, and decent food.  Staff is good too.  Nothing too memorable, but nothing too bad either.", "author": "M F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-24", "description": "To my surprise this location has scaled back their portions. i purchased a bagel with lox and cream cheese.  The cream cheese was only on one side of the bagel and the lox was on the other side. I called them and was told \"that is how we do it\", i explained how I have purchase this sandwich numerous time and never had it made this way. I was told \"that is how we do it and if you want cream cheese on both sides you must ask for it\". Well the way you do it is not acceptable, your way makes a very disappointing dry sandwich. The way I do it is to never return....", "author": "andre m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-08", "description": "The best bagels in the neighborhood.  No one comes a close second in Fort Greene.  From their selection of fresh-made cream cheeses, I would recommend the Strawberry and Blueberry flavors.  The Scallion cream cheese is another good option if you don't want something too sweet on your bagel.   They are very quick with preparing your orders and the staff is friendly.  There about 8 tables inside to eat and relax on a weekend morning.  I am usually here at least once a week and it has easily become one of my favorite places for breakfast.", "author": "Kevin G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-07", "description": "This is my favorite bagel chain in the city. Any location I've been to always has fresh, great bagels, at least 8 different varieties at any one given time. The bagel sandwiches are awesome.", "author": "Leah Shane D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-23", "description": "I tend to go to a bagel shop that's not as good, but is closer to my house. Been here probably a dozen times over a couple of years and it never disappoints. Delicious properly made bagels with a wide selection of tasty cream cheese. Line is always long, but the service is always quick. I always get confused over who to order my coffee from (the guy who makes the bagels or the guy at the register), but that's probably my fault.", "author": "Nathan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-14", "description": "Super-fresh bagels--always--pretty good coffee, lots of seats, helpful staff.  Yes, this is a great find.  They have WHOLE WHEAT Everything Bagels by the way.....I cannot oversell the coolness of that.", "author": "John W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-12", "description": "Good bagels and coffee.  Nice selection of cream cheeses, including ones that are dairy-free.  For breakfast or a mid-afternoon snack, it's a great choice.  For lunch, however, I find them to be a bit overpriced and little under-imaginative.", "author": "Amy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-08", "description": "amazing sandwiches!!!!  the best bagels!  awesome and curteous staff!", "author": "Sean O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-02", "description": "What if they made tiny bagel baguettes? And a little bag that it can stick out of, to go around your wrist or your dog's neck? The streets would be more beautiful and life would be delicious for all of us again. Go to La Bagel, their product is excellent and the atmosphere is nice.", "author": "Nasal F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-08", "description": "you can get a turkey/egg/tomato wrap during breakfast hours for 5 bucks. at lunch that price launches to 9 bucks. \nonly difference? no egg. \n9 dollars for a turkey wrap and not even a reach-around? thanks la bagel delight.", "author": "perry w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-10", "description": "I'm just going to come right out and say this - there's no easy way - I AM ADDICTED TO BAGELS AND LOX!  There, I said it.  Now I can say that this 'delightful' little establishment more than sufficiently satisfies in that particular addiction department.  Waiting area is cramped and a little stressful - particularly before I've had my morning coffee.  Other than that small complaint, this joint is among the handful of Brooklyn Bagelries that create the finest bagels anywhere in the world.", "author": "Jesse K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-03", "description": "No bathrooms available to wash hands. No antibacterial hand cleaner dispenser in the store either. I came in for lunch from a dirty moving job, and eating with filthy hands is just plain gross for everybody.", "author": "Seth H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "never had an  order wrong. good quality bagel.", "author": "Sam G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-07", "description": "Giant portions and brooklyn friendly staff make this semi-chain bagel shop one of my favorite \"daily routines\". Tofu options sit along side piles of meat that make the holland tunnel friday night crowd look like a vegan convention. Home made ice teas and fresh brewed coffee are delicious. The muffins have great tops but mediocre stumps (Otherwise known as the butter-stump muffins). Speed is one of La bagels most crucial elements. They will blast your lunch out so fast and with enough force you will think it came straight from peter north.  They now have Hummus as well! Who doesnt like a hummus bagel?", "author": "Lukas P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-28", "description": "This is one of my favorite weekend treats.  I've had some really great bagel sandwiches here.  The staff and owner are always energetic and welcoming. Ft. Greene is such a great little neighborhood, and La Bagel Delight is a great spot to read the weekend paper.", "author": "Tanya D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-21", "description": "It is really hard to find something negative to say about La Bagel Delight. Perhaps closing too early would be possibly one thing to complain about?! I used to live in Park slope area, every single weekend my brunch was almost always picked up from La Bagel Delight there. When I moved out from that neighbor 5 yrs ago, one of the saddest things was to say good bye to La Bagel Delight. But then the miracle happened. They opened one in my new neighbor soon after!!! I was sooo happy the 1st day they opened their door. I stepped in, it was even better than the one in Slope. It was new, spacious, had tables and chairs and it had everything the Slope one had and more!!! I get my usual which is everything BLT or eggs, cheese and sausage on bialy. Their weekend special, asiago cheese bagel, love love love.. When I had one of those rough days, walking back home around 4PM, stopped by there for some late lunch pick-up, the guy who worked there offered me w/ extra bagels. I said, why not, and I ended up walking out w/ two full bags of bagels. Oh, and sometimes they have their daily special dishes and I tried their meat loaf last winter, omg, one of the best meat loaf I've ever had! If you live in Brooklyn and you still haven't tried La Bagel Delight, you've been missing out a great deal.", "author": "JW S."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "Under $10", "name": "La Bagel Delight", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yuuA4hrvwe9tTH9xayZjUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182463744"}