{"aggregateRating": {"reviewCount": 158, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-15", "description": "This place is truly terrible. I ordered a simple bacon egg and cheese on a bagel. Every layer of this sandwich was so over cooked that it was still steaming when I unwrapped it and let it sit for a few minutes. The bacon was just by if burnt- so over browned that it flaked apart- far beyond what would be considered \"crisp\". I ordered the egg medium and it was still rubbery and brown with grill marks indicating it was on the grill for far too long. The cheese was slop melted over the whole mess. And the bagel was a dry disappointment. Not chewy at all. How can you get this wrong? I suggest you skip this spot if you're trying to satisfy any bagel cravings and instead get a slice at Not Rays, which is always on point.", "author": "Odetta S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-03", "description": "Place is ok, weird pricing model where a slight variation and price sky rockets. Anything not on their prearranged menu is astronomically priced. It's a bagel shop on fort Greene, not in soho.", "author": "Mohammad A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-22", "description": "What do you expect from a bagel place? Fresh warm bagels, a good variety, a smear of butter, fresh coffee, speed... I bet you can think of dozens of things. The most important thing I expect is the bagel. On a Tuesday morning, I waited on the bagel order line, ordered a cinnamon raisin, buttered not toasted. That's it. I paid and stepped aside to await my order, \"soup nazi\" style and then waited about 10 minutes. I was getting antsy, but they were busy. I get it. She calls out, \"Buttered cinnamon raisin.\" I step up and she says, \"We're out. Want something else...or your money back.\" I don't mind you ran out, but don't make me wait 10 minutes to tell me. I got my money back and walked out into the rain. Been there a dozen times or so, decent but not great. I won't be back.", "author": "James O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-12", "description": "I was looking to eat and kill some time. Of the 3 locations I had now been to (this one, Park Slope, and Brooklyn Heights), this was my favorite. It by far was the nicest and the cleanest. Also, it has a lot more table space so it gives it a more cafe feel. Moreover the space isn't cramped and it feels airy (might be the high ceilings). \n\nI ordered a whole wheat bagel toasted with scallion tofu cream cheese plus a small coffee with soy milk (yes, I'm lactose intolerant). I was pleasantly surprised they had soy milk there but either way, very good meal (for $5). The bagel was toasted perfect and was just delicious. Definitely enjoyed eating there. Would probably go back if it were closer. \n\nThey take credit took! HOORAY!", "author": "Jane R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-20", "description": "working in the area  on monday 12/19 so looked for a real bagel shop, found this. had chicken salad on a bagel, about 11 am. The only thing I ate all day. was sick a few hours later, violently. slight fever, chills, stomach cramps and ill spare you the rest.   leaning more towards food poisoning than stomach bug because once i finally got everything out of my system i was able to go to sleep and woke up fine.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-07", "description": "I occasionally get a bagel at this place while doing laundry next door on a Sunday[1].\n\nMy plain bagel with vegetable cream cheese ($3.25) was light and fragrant, and toasted to perfection. The generous serving of cream cheese, however, was very fresh but a bit lacking in taste. Overall I think I prefer the bagels at Bagel World on Dekalb[2].\n\nThe cute girl at the counter had a wonderful smile, was super-friendly, and fast.\n\nSooner or later I'll have to try one of those cheese cake brownies that always look at me so amorously...\n\nDespite the retarded name, La Bagel Delight is overall a solid option for food on the go while in the neighborhood. One thing I could do without is the '90s dance music they like to play here. It can get crowded[3].\n-------------------------------------\n[1] That's the glamorous life of a jet-setter, folks!\n\n[2] http://www.yelp.com/biz/bagel-world-brooklyn-4#hrid:T2RjIA4NH0huD2by-2CPJQ/src:self\n\n[3] Not that people flock to La Bagel Delight like at a club a club once they start playing dance music from the '90s, mind you. The two events are likely unrelated.", "author": "Matteo R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-29", "description": "Definitely don't make a delivery order to this place (i.e. Seamless or otherwise). We've experienced long wait times, hidden fees, incorrect orders, and should you ever dispute an issue, quite poor customer service (manager will most assuredly try to put the blame on the customer). Better to walk-in. Whitefish is excellent. Sausage and cheese is delicious. Bagels are actually not our favorite. Bagels can have too hard of a crust, and on occasion, we've found doughy spots within the bagel/flat bagels.", "author": "Bea S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-05", "description": "Let's get right to the point. Food fine, pastries good, coffee good, but waited over 20 minutes for a turkey sandwich with mayonnaise. That's it. Food not worth th", "author": "Alyssa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-22", "description": "This definitely satisfied my NYC bagel craving!\n\nThere is just something special about a bagel in NYC, and La Bagel reminds you exactly what you're missing when you haven't had a good bagel in quite a long time.  They are big, fluffy, spongey, \u0026 doughy.  I had the everything bagel toasted with lox cream cheese on one side and bacon and chive cream cheese on the other.  Great flavor, everything you want from an everything bagel.\n\nThe cream cheeses were spectacularily displayed, they almost looked like gelato, they were soooo cool!  I do have to say that I would not order the lox cream cheese again.  I love my salt, and I have a pretty high salt tolerance, but this was just toooo much.  The bacon and chive was amazing though!\n\nAll in all, a great little spot, good value and nice outdoor seating in a nice a neighborhood.  It's a winner!", "author": "Trevor C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "My American hero was amazing, it was two meals.  I will come back to enjoy other items when I return to Fort Greene.", "author": "Angela G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-23", "description": "I honestly don't know why I come here. The bagels are mediocre (go to Bergen Bagel instead) and the service is atrocious. There is usually one qualified person working with 12 teenagers who take forever to fill orders.", "author": "Ben K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-29", "description": "This place is pretty OK. The service and staff are super friendly and nice, and the cream cheese is delicious. The bagels are actually pretty thick though- and not a lot of ingredients that are actually on the bagel. I'm not a fan of bigger bagels like that- but if you are I would definitely pay this place a visit.", "author": "Priti R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-10", "description": "Been to La Bagel Delight many of times. If you are well aware you are paying a bit extra for no reason and cool with that, come right in. If you feel every bagel store must be inexpensive, this is not your place. They have a large staff in there who are usually friendly and helpful. I'm not going to sell you on their sandwiches because they obviously have nothing to do with boars head other than slicing the meat. They do however make some great dishes and sell them for a lunch special. They have great tuna, egg and chicken salads. They have a cranberry chicken salad which I'm usually in the mood for around Thanksgiving. The prices have gone up over the years but if you're in the neighborhood and willing to pay a bit extra it's not a bad option at all. I would say however if you strictly want a cold cut hero, you're better off going somewhere else in the neighborhood.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-15", "description": "I had a poppy-seed bagel with butter and a small green tea.  The total came to $2.52. (I presume that tax was included, although I didn't get a receipt.)\n\nThe bagel was thicker than average and tasted okay, but there were hardly any poppy seeds on it.  The green tea was from Celestial Seasonings. \n\nOne thing I didn't like about this place is that there are multiple menus on the walls and a chalk-board with stuff on it that is hard to read.  Although there are lots of prices listed for lots of items, I couldn't find any prices for anything that I wanted.", "author": "Jamie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-18", "description": "This place is horrible. Bagels are stale and the \"staff\" is rude and dismissive. Go to Bagel World on DeKalb! Much better and competent staff.", "author": "James S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-06", "description": "This place is constantly busy on the weekends, and for good reason.\n\nThe bagels are freshly made, the wide selection of spreads/toppings is impressive, and most of all the bagels are awesome. They are a bit on the fluffy side (not a bad thing, just pointing it out) and have this unique sweet aftertaste, almost as if there's an extra pinch of sugar in each one.", "author": "Roy K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-16", "description": "If you are going to have a loyalty program it has to make sense otherwise you are hurting your business (at least with me). The breakfast sandwich card says \"After Purchasing 8 Breakfast Sandwiches, get 1 FREE\" but in practice they only allow you one 'stamp' per purchase. I just purchased 2 sandwiches and got credit for one. I don't really care about a free $5 sandwich, but I get very frustrated with poorly executed programs. I would actually have a better experience if there was no program than one that didn't follow its own rules.\n\n-annoyed Fort Greene regular", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-15", "description": "Want a REAL Brooklyn bagel?  At Le Bagel Delight they make some of the best bagels ever, they make bagels they way they are supposed to be.  A bit oversized, the crust had a nice crispiness, the inside is soft and a bit chewy.  And the dough has a great flavor and aroma, not like those cardboard bagels you get in some places.  They have nice cream cheeses and sides too,", "author": "Cary R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "I wouldn't be able to call this place home without a bagel store close by. Great weekend assemebly line to keep the rush going. Lives up to a classic New York bagel taste.", "author": "Alexandra Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-01", "description": "This is exciting because I get to review every La Bagel Delight I love individually. La Bagel Delight bagels are the best in NYC. The egg sandwiches are the best, the selection of cream cheeses is on point and they have seating!!! The crew manages the line efficiently, so it isn't a disaster despite the crowd.\n\nLa Bagel Delight For Life duh", "author": "Luv2 L."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "Under $10", "name": "La Bagel Delight", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yuuA4hrvwe9tTH9xayZjUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182463744"}