{"aggregateRating": {"reviewCount": 158, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-13", "description": "So this is a pretty okay but mediocre breakfast sandwich spot. It is a step above the smoke shop/ deli that's why I gave them 4's. The Philly steak and eggs sandwich was okay. I wish they added peppers and onions but was scared to add it myself due to there extensive up charges. I had to pay extra for a croissant instead of bagel and provolone instead of American cheese... At the end my sandwich cost an extra 1.50. $7 for a breakfast sandwich, no mimosas or bellinis? Could have went to a brunch spot and at least get served eggs, bacon etc. for that price. It was nothing special that made me want to return to this spot. Students do get a discount, that is a plus... Right?", "author": "Crystal G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-20", "description": "If I were to give this rating purely on bagel marks, it would receive 5 glowing stars. The bagels are excellent, a necessity in a neighborhood where good bagel shops are surprisingly few. These chewy bagels are slightly crispy on the outside and fresh out of the oven, a perfect 10 on the bagel scoreboard. \n\nMy critique is small, much like the shop, which for this reason doesn't have the largest selection of spreads.  You can get your typical chive, dill, vegetable, or lox shmear, and a few low fat and tofu shmears, but a greater variety of tofu and low fat options is not be found.  I might sound picky, but I have fond memories of the glorious Ess-a-Bagel formerly on 1st and 21st, which had more shmears than shades of colors in the rainbow. The coffee is also not so tasty.\n\nI must compliment the excellent (but small) selection of sweets, including many flavors of rugelach, hamentaschen, black and white cookies, brownie bars, and those teeny little slivers of multi layered rainbow cake.\n\nStill, there's a reason why this little bagel shop has stood on the block for 30 years.  It has a new regular customer.", "author": "Risha L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-21", "description": "If you're craving a bagel this place is good. The bagel isn't out of this world but I can't complain about it. The jalapeno cheddar cream cheese on a plain toasted bagel is my go-to.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "I stopped by here because it's on my way to work and now I can't stop. Bagels are fresh. My favorite is the blueberry bagel with peanut butter. And I've tried some of the lattes which were really good. Love this place.", "author": "Vanessa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "Extremely good bagels. Made fresh daily, everything you would hope in a bagel store. Best bagels I have ever eaten.", "author": "Eli B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "I would definitely come back here. I got a whole wheat bagel with veggie cream cheese and bacon. They didn't put a ton of bacon on but that's ok. They did put a good amount of cream cheese. The bagels are thick but tasty. My iced coffee was decent, a little too much milk but not bad. I think they have flagels (flat bagels) which I wanna get next time.\nThe customer service is really good and efficient. They were really pleasant.", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "Bagel Delight is the only breakfast to go place that I walk by on my way to work and I've found it to be well suited...tons of cold and hot drink options, bagels galore, other baked goods (cupcakes, cookies), and quick service. The staff really hustles things along and tried to get you in and out as quickly as they can. There's also a handful of tables to enjoy your food inside or do some work.  I've recently tried their lunch offerings (sandwiches, salads) and found the quality to be excellent. Would highly recommend for a lunch on the go!", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-11", "description": "I'm dropping them down from 5 stars. When they used to have friendlier register staff, it masked the fact that they're slow as molasses for every. single. order. Now there's now denying it's an average bagel place that cannot adequately support it's foot traffic at any time of day. One sandwich 15 min, consistently. Pity to give a poor review because of this reason.", "author": "Josh A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-22", "description": "My neighborhood lunchtime staple.  What would I do without you La Bagel Delight?  Awesome bagels, and skinny bagel options (for those kinds of people), and lots of cream cheese options.  They have a great sandwich menu - I personally LOVE the Bourbon Street - which is spicy turkey, mozz, jalapenos, and grilled onions.  Also the chicken fajita pannini is a delicious deal and comes with a bag of chips and a can of soda for something stupid, like $6 total!  They also have HUGE-O ice coffee cups if you ask for it.  Sometimes you just need a ginormous ice coffee.  They've got a case juices and drinks, and all sorts of goodies.  Tons of chips.  I love this place.  VERY friendly people behind the counter too - props to them!  \n\nI've also ordered catering from them for an event at my theatre, and they delivered it, it was beautiful, delicious, LOCAL, and worth the price. They also have a new rewards type system called Belly, just scan your card and earn free stuff.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-13", "description": "The bagels are amazing. It was super early and the girl asked me something, I didn't hear her, and she called me out for ignoring her. Pretty embarrassing. I also made a somewhat large order and asked the guy to do me a favor and cut them in half as our conference space wouldn't have a big knife. He did not. That was a let down. The bagels are huge, and super tasty.", "author": "Viki B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-27", "description": "Decent place for a pic me up, bagel \u0026 schmear, iced coffee, air conditioning, while reading philosophy books! Best mention: plays Q104.3fm --- best of queen, scorpion, anthrax and guns and roses. Sort of random in this neighborhood, but frequented by die-hard locals.", "author": "O P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-29", "description": "The cashier is very rude and nasty. Once you placed an order, don't order anything else you will get yelled at!!", "author": "Rose G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-02", "description": "I know this is a chain but the bagel with lox I had from La Bagel Delight was one of the best I've had in a long time. The fresh bagels are really fat and super filling. I was so happy we got a baker's dozen to take back home to Boston!", "author": "Ladyjane S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "One of the best whole wheat everything bagels I have had in Brooklyn! Perfectly baked, topped and toasted! Tons of gourmet cream cheese and tofu spreads, and super friendly and attentive staff.\n\nOne star is lost however for a lack of seating and super-confusing ordering process. Nearly everyone in the line was completely baffled as to who was waiting in line for what, which could definitely pose a problem during rush periods.", "author": "Kev O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "Amazing whole wheat with everything bagel... And thw white fiah salad is also excellent... Lots of sitting space even has good wifi and a couple of sockets. They even have gluten free bagels", "author": "Ronney L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "Great selection of bagels and spreads with a neighborhood feel.  They get pretty busy on the weekend, but move the line quickly. They don't take call in orders on the weekends, unfortunately", "author": "Estée R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-08", "description": "Food is pretty good. Service is terrible. They seem to have more staff than anywhere else yet get simple orders wrong and take forever. \n\nThey need to improve their system: you should be able to pay when you order and then pick up the food when it's ready in a different place. Needs better management.", "author": "E J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-17", "description": "Good bagel, and quick service. For those of you who love options for their bagel toppings, this place is for you. Me, I rather standard cream cheese on my bagel. There are also several good looking options for tuna salads, and they also have a salad bar. My rating wasn't higher than 4 stars for this place just because the latte was not the best at all, which I expected better coffee from a bagel spot. But, given the vicinity to my apartment, I'll be going back for more of their yummy bagels!", "author": "Julie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "This is the best bagel you will ever have in your life.\nEnd of story.\n\nQuit reading yelp reviews and go eat a bagel!\n(also every cream cheese you could imagine)", "author": "Becky B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-01", "description": "Chaotic, order was wrong, lox were far from fresh, bagel was ok. Stick to the basics here.", "author": "Tim S."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "Under $10", "name": "La Bagel Delight", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yuuA4hrvwe9tTH9xayZjUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182463744"}