{"aggregateRating": {"reviewCount": 158, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-12", "description": "Pretty good little deli for the area.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-12", "description": "This is one of my favorite spots for a breakfast run. Usually on weekends or whenever I'm in the area.  Past few visits, the prices are always different for the same thing I order all the time. As if they make it as they \n go along. If prices change for reasons, fine ..post them or make your menus/prices legible.\n\nWell today I ordered a breakfast special $3.99 and asked to add on ONE egg white - not expecting to pay nearly addtl $4 for the ONE egg white!\nRang it up first time $6.40 - THEN oh now - its $7.67... ARE you kidding me? I asked how much addtl is the one egg white - response \"oh when u add the egg white is not the special anymore\". That's not what I asked you... then you give me two different prices!  I should have just left the sandwhich...\n\nGet it together , I hate to have to ask how much is everything before I order!", "author": "Eulelia J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-24", "description": "I didn't wrote a review after the first time and decided to give it a fair chance. The bagel I had here the first time tasted like old fridge water. Coffee is never good here. I think the beans they use are burned and the taste is always off. I didn't dare to get more bagels bc the first time it wasn't good but I did get coffee here several times and it's always bad. The place is conveniently located and the stuff is pleasant that's why I didn't give it one star. If I'm being charged $5.95 for a cup of coffee I expect decent coffee.", "author": "Daria Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-10", "description": "Reliable place to get a Brooklyn bagel. Their bagels are always fresh. They also make sandwiches too. Good location and option in the neighborhood.", "author": "Deirdre L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-13", "description": "Decided to get an egg white vegetable omelette from here- without cheese. The restaurant followed all my instructions and delivered within 30 minutes. So kudos for that.\n\nThe food itself was nothing special. Omelette was cold and the  Avocado was brown in places. Tomatoes were not fresh. \n\nAt 7am this is one of the better places to order.", "author": "Shruthi R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-01", "description": "SOLID OPTION via uber eats for my hungover self on the 1st day of 2019 haha. Not a fan of the French toast but the bagel breakfast sandwiches were perfect. Bacon egg and cheese on an errthang bagel 100%", "author": "Aly O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-30", "description": "Standard bagel place - open since the 1980's! Bagels have a slight crisp on the outside and are moist and chewy inside. The everything bagels were good, but we had them twice in the same week and they weren't consistently seasoned. Plenty of cream cheese toppings to choose from. Got a freshly baked croissant today and instead of light and flaky, it was thick and doughy. Interesting!Coffee: not great, but they have a fresh juice and smoothie bar onsite. When you enter - note the line on the left is for ordering, the line on the right is for waiting for your food.", "author": "Familia S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-22", "description": "Awful customer service - 50/50 split on good to rude staff. Food ok. Bagels are average. \n\nGet your degree in bagel ordering and know what you want before you walk in. Uncertainty met certainly not a smile. \n\nNo labelling on the muffins so best just taking a guess at what doughy contraptions are Saran wrapped.", "author": "Craig B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-24", "description": "Been coming here for the last 2 years and it's solid every time! I only ever get the Mr. Bagel, which is the perfect breakfast sandwich (egg, bacon, ham, and cheese on your choice bagel). The downside is I think they serve that sandwich after 11AM; I only come on the weekends. It gets very crowded here on the weekends so be prepared to wait. Also, I think since it gets really crowded, people don't know where to order/wait for their orders. That can be a bit chaotic.", "author": "Kim D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-24", "description": "Was out of everything bagels, so forced to get an egg everything bagel. Read a review the egg sandwiches were the way to go. Underwhelmed. Egg and ham on a toasted bagel. No butter/spread,  no cheese. Disappointing to say the least.", "author": "William S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-07", "description": "Food is fine. Cashier is rude. Dropped the coins I gave her and pretended like I didn't give her any. When I asked for bills back instead of the loose\nChange (because I had given her the coins) shook my change at me when I took a second to take it. Rolled her eyes and audibly sighed when I asked for a knife.", "author": "Katie O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-17", "description": "It seems that every other time I go there my ordering process is a nightmare. And it's very obvious that it's being run terribly. There always seems to be too many people working very chaotically behind the counter. The big thing that I ALWAYS see them do is lose track of someone's order, or my own. They write it down and then after what seems like a while they ask what you ordered. Sometimes they make you pay when you order sometimes you pay after. And they often mess things up, no tomato, wrong coffee, wrong cc spread. They're not really rude, but they are very clueless and don't offer any apology when they screw things up because it seems to be the norm. \n\nI've been going there pretty often recently because it's close to my job and my regular place, Bony's on Hanson Pl, closed down. It was much less refined but it wasn't like a circus every time I wanted a bagel and a coffee. Someone else mentioned this and it deserves to be addressed but I've also seen the guy who appears to be the manager being really rude to the staff. I will add that the quality of the bagels is always fantastic. The iced coffee is not. I can see going there once and having a fine time but going every so often before work can add a bit of chaos to your commute.", "author": "Trey W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-15", "description": "Never ordering here again.  Delivery on weekends, is abysmal.  Over 2 hours  to receive 2 bagels.  They charge an additional delivery fee which to me just goes into the business pockets, not to improve service.  Last time I ordered, the order was 1.5 hrs late and the guy on the phone lied that it was already out.  Calling again 30 minutes later they claimed to have lost the order and would remake it.  2 minutes later delivery guy knocks.\n\nThis place is so badly managed. \n\nFor any restaurateur - the neighborhood needs an alternative bagel spot with a marginally better business sense to take care of your customers and you will do very well here.", "author": "Austin V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-25", "description": "I ordered something based on the menu they have outside, a bagel and a coffee for a few dollars. However, when I had to pay, the bill was much more than the initial price. I asked the cashier about that, and he told me he had no idea what I was referring too. I therefore went outside, took a picture of the sign, and showed it to the manager. He said \"sorry but this sign is outdated\". This is completely illegal to advertise false prices. This business should be closed.", "author": "Joe D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-15", "description": "Chaotic ordering experience. Strollers and people randomly standing around. \nExperience was pretty much ruined before we even received our food. \n\n\nBagels were priced well and decent. The cinnamon raise tasted like it was cooked next to the onion bagels, which wasn't awesome. Everything bagel with plain cc was solid.\n\nThere are some pretty simple changes they could make that would greatly impact the experience.", "author": "Katie P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-27", "description": "La Bagel Delight is nestled in a cozy corner of Lafayette. The bagels aren't that special, but I appreciate the amount of cream cheese they will slather on for you. Their service and food are better than Sunny's though if you wanted to walk a little farther, there's Bagel World (which I think is the best out of the three options).", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-24", "description": "I wish I had just gone to the bodega for my bagel with bacon and cream cheese. Sunday morning 11:15, out of everything bagels! Menu was unclear, surprisingly expensive, long wait time after I ordered. They seemed to prioritize cranking out  take out orders over the few customers waiting. Bagel had very little cream cheese and skimped on the bacon.", "author": "Jennifer R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-03", "description": "I was in Fort Greene today to go to the Brooklyn Academy of Music -- BAM to see a movie, \"Sorry to Bother You.\" \n\nWhat surprised me was to see the team from Myrtle Bagel in Clinton Hill now at this location. I spoke with the owner and he said he sold the other store and moved. \n\nThis place is a fast bite to eat, and it looks like the owner smoothed out some of the rough edges from the last place. For example, there's more room in the line, and there's more room for seating. He also cut out some of his cold drink offerings, which I think is a great idea.\n\nI wish this company great and continuous success in the coming years.", "author": "Gordon E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-08", "description": "As a tourist, this place is what we were expecting from local bagel spot. Generous portions, fresh ingredients and friendly service.", "author": "A C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-06", "description": "This is my local bagel shop in Ft Greene. They have the best bacon egg and cheese in the neighborhood. The deli ones were not half as good. The bagels here are good as well. It's disappointing but they close the grill in the afternoon so if you get there too late in the day (we went around 3/4 pm) you cannot get an egg sandwich. What is nice about La Bagel Delight is that it's not hipster or anything it's just a straight forward bagel shop.", "author": "Carina P."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "Under $10", "name": "La Bagel Delight", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yuuA4hrvwe9tTH9xayZjUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182463744"}