{"aggregateRating": {"reviewCount": 158, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-14", "description": "Great sandwiches, freshly made bagels, endless variations and very reasonable prices. One of the best sandwich joints in NYC.", "author": "Mike E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-30", "description": "I prefer Bagel World around the corner. But the Bagels are still very good. i like to get cream cheese and bacon. If I am feeling extravagant I will get the lox deluxe which I highly recommend . I love bagels and this place provieds a high standard of bagel.", "author": "Spencer D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-17", "description": "Got an everything bagel with cream cheese and lox on a trip back to NYC after a year and a half on the west coast. It was everything I dreamed of and more. The only thing I could have wanted more was perhaps capers, but that's the fussy New Yorker in me coming out. I'm glad to know it's still in there somewhere and hasn't been bleached out by all this sunlight. I still dream about these bagels.", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-11", "description": "Their website says they open at 6am. Well this is now the second time I have been standing outside for 20 minutes past waiting for them to open. They should. Hangs when they open if they can't open on time. Also make sure you watch their employees very carefully.  The girls will mix up your order and get it wrong and when you go to complain and ask for a refund or exchange the owner will tell you it's too late and not his fault.  I only go here when Bonys Bagels is not open.", "author": "Karen H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-20", "description": "So the bagels are good. Not great, good. I can think of quite a few others that are better (Ess-A-Bagel, Bagel Hole, etc.). First, I've found the quality to be inconsistent. I've been here quite a few times now - and sometimes, even reasonably early in the day, the bagels seem stale. Second, the bagels are thick and chewy, but often don't have that crisp outside that you want in a great bagel. This is a problem given how thick the bagels are. Normally a plus, it's a bit much - a bagel with cream cheese ends up being 90% bread. Third, their deli sandwiches and variety of spreads, etc. are just average. Finally, I don't like their service process. No matter what you're getting, you pay and pick up your order in the  order you placed it. Equitable in theory, it is incredibly frustrating when all you want is a 1/2 dozen bagels and you're forced to wait until people getting BECs, various sandwiches, etc. have their orders prepared while yours is just sitting on the counter and the cashier won't let you pay \"out of turn\" (I've had this happen several times).", "author": "Alex G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "Been coming here for six years.  This is my neighborhood bagel shop and I cherish it.  The way any New Yorker/Brooklynite comes to cherish his reliable, no-frills, recognize-you-when-you-walk-in-even-if-they-don't-know-your-name kind of places.  Friendly staff, quick service, dependably good bagels.  Always fresh, even if you get there late in the day.  One of the few places where I can find a proper multi-grain bagel, and they are definitely not stingy with the toppings.  Lots of cream cheese offerings (garlic is my fav).  If you get there during rush hour on the weekend, the line may be a bit long, but they keep it moving quickly.  And you need to pay attention for the next person to yell out \"Next on line!\"  This is definitely more of a grab-and-go kind of spot, but there are a few small tables if you want to try your luck.  I love getting the coveted table by the window, perfect for people-watching along Lafayette.", "author": "Jaydan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-29", "description": "Not really the equal of its Park Slope brother, but this La Bagel is still probably the best bagelry in the neighborhood. The bagels are a bit too doughy, but slather them with cream cheese (of which they will, naturally, give you way too much) and they're about as tasty as they should be.\n\nSeeing as I finally and somewhat surprisingly got sick of bacon/sausage, egg and cheese bagel sandwiches a while back, I appreciate the rotating breakfast specials, which are priced nicely and usually have at least one thing that will let me pretend I'm eating healthy (like turkey, egg whites, gouda and spinach on a whole-wheat bagel). I haven't had lunch here nearly as much but the couple sandwiches I have tried were pretty satisfactory. Also, they once agreed to make me a cheeseburger and fries at 9AM, even praising me for my choice, which makes them A-OK in my book.\n\nIt can get crowded here at times, but the staff does a fair job of managing the random clumps of customers, any of whom may or may not actually be in line. The staff is also quick, and friendly enough, but can be kinda forgetful, sometimes asking me to tell them my order again literally 30 seconds after I first placed it. Still, that's preferable to their old system of being too shy to ask again, letting me go home and find a completely different order in my bag. Also praiseworthy is the fact that no one's leapt over the counter and strangled me yet for consistently using this place as my change-dump (bringing a large pocketful of dimes, nickels and especially pennies to pay for the non-whole-dollar portion of my bill), so props for that.", "author": "Galvin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-16", "description": "I prefer going here, a few more blocks away, than the place on Dekalb.\n\nThe staff is super nice and there is never a wait. One time I called in an order and since I had my dog with me, she brought it out to me with a smile. \n\nBagels are always fresh, which I can't say the same for other places.", "author": "Jay L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-01", "description": "Place seems good, but unfortunately I tried the lox bagel and it was the saltiest lox bagel I've ever had ... little too much for me so I don't think I'd get it again. The bagels were relatively expensive, but the portions were large and the service was great. I'd say give it a try!", "author": "Arika S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-01", "description": "This place is just so cute and perfectly Brooklyn, it feels like you've walked into the Street scene from Seseme street.\n\"Hi Mr Hooper\"\n          \"Hello young man\"\n\"Hi Gordon.\"\n          \"What's happenin'?''\n\"Hi Snuffleupagus. \nWait i REALLY need coffee\"\n\nThe staff are great, the food is great (they ACTUALLY have capers for your Lox bagel!!) and i have not tried it (yet) but the Bronx Bomber sandwich looks out of control!!...go there\n\n\nhttp://www.allmenus.com/menus/250304/La-Bagel-Delight", "author": "Furyk C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-29", "description": "La Bagel Delight is my favorite bagel place in Brooklyn!\nThe hand rolled whole wheat everything bagel is sooooo gooood--soft yet crunchy, warm and tasty!! They have so many great options for cream cheese including the tofu spread, veggie, lox and even bacon \u0026 chive cc---All of which are delicious!! I always get half a dozen bagels to bring back to Boston--being that Boston lacks good bagel shops  =(\n\nThey have reasonable prices and top quality food. My bf loves their egg and sausage sandwiches. Everything here is great! \n\nThe staff here is fantastic! They are definition of service with a smile =) The service is super fast and accurate (very important for multiple orders). The shop is very clean and well decorated. \n\nLa Bagel I will miss you until we meet again!", "author": "Deanna D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-30", "description": "Good stuff!!! Can't believe they were open so early after hurricane Sandy-- amazing!!!", "author": "Maria F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-13", "description": "Bagels and prices are average at best, but creating a cozy looking cafe with no bathroom is not cool! Really, guys? You have tables for us to relax and enjoy our coffees, but no where to go when the inevitable coffee shits strike?", "author": "David D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-24", "description": "I adore La Bagel! It's a great fast lunch/Brunch/ Breakfast  place. \nThe Salads and Sandwiched are made to order, which makes my dieting Low-Carb life easier. \n(Plus There are many pretty Muffins/ Bagels and Pastries that I will only admire). \nIt's fast, Good, inexpensive and perfect for picky eaters as myself! \n\nI just wish there was a better selection of drink. \n\n\nPS: There is a student special of Sandwich + Soup during the week.", "author": "Fer M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-09", "description": "This is THE place for the quintessential New York Bagel experience. Highly recommended! Service is super quick, too.", "author": "Paul V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-29", "description": "I am consistently amazed by how fast they get my order out at La Bagel Delight.  No matter what I order.  And (almost) always perfect.  These guys are the superheroes of bagel places.\n\nAnd the food is as described: delightful.", "author": "Ryan J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-29", "description": "Special on a chicken roll for $6.99. I order the special and I asked if they could put it on a roll. They said yes. Then the wrap came and the bill was $10.28. Then was told the manager said its not the special on the wrap so the regular price. I was upset because they never said that when I placed my order. So I left the wrap and walked away without purchasing. \nSo then I came in 2 days later for the same chicken roll. Instead of asking for the wrap I just order what was offered the chicken on a roll for the special. But I do not like tomatoes,  lettuce  and bacon on my sandwich, so I asked to leave then off. The lady at the register said if I don't get lettuce/tomatoes on the sandwich it's not the special. And she told me that the manager said I personally can not change the order because he was upset from the previous day. I was upset because it was a mad manager expressing attitude towards a customer. That is  not respectful and not fair. I never eat tomatoes/lettuce/bacon on my sandwiches, but they said I had to get those on the sandwich if I want the special. I had to call 311 and filed a complaint. In addition, the main manager of the 3 delis won't be in til after holiday so I am calling next week. \nIt was rude how the manager was acting to a customer and being not fair but treating other customers with respect. I asked the lady next to me what she thought and she had no idea why they would do that. She thought they would do it because I wanted less on my sandwich which cost less money. \nI probably will never go back until the owner/manager apologize about being discriminate and not respectful to me. Ruined my lunch.", "author": "Jake C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-25", "description": "workers are very efficient and friendly. theres also a nice selection of breakfast sandwiches. This is a deli, don't get me wrong, but it's clean, and they have ample seating and it's a clean local crowd. The workers remember you, and they know how to make a good egg white breakfast sandwich. Check it out.  Their minimum for credit card purchases is $10.", "author": "Grace Lee A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-20", "description": "Love it. Clearly, New York has the best bagels in the world, and this place is tops in that category. Hand rolled, authentic, nearly perfect. \n\nService is super fast, super friendly. Cheap for what you get - egg\u0026cheese on a toasted bagel is less than $3 - cheaper and better than anywhere on this strip.\n\nP.S. They deliver.", "author": "Jacqueline K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-07", "description": "The bagels are just fine, and the coffee is legitimately bad. A bacon egg and cheese on a bagel and a small coffee costs about $8. The order/pickup process is a mess. You walk in and get funneled straight into a counter with two cash registers and no dedicated cashiers. There is a meaningless divider sitting in the middle of the room, around which customers ask each other, \"Have you ordered yet? Does the line start here?\". There are five people behind the counter on a Saturday morning bouncing off each other like bowling pins, again all asking \"Can I take your order? Who's next?\". One wanders around with a coffee cup, the other with a coffee cup sleeve. Eventually they find each other. It's not like the wait for your food is long, but the experience is so unpleasant and unnecessary. Anyway, it's a shame that this mediocre chain store is representing for Forte Green. To all the tourists I saw today in La Bagel Delight, please go to Bergen Bagels instead if you can--solid breakfast and great service. Or for the best bagels in the world, make the effort to visit The Bagel Hole on 7th avenue between 12th and 13th.", "author": "Peter M."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "Under $10", "name": "La Bagel Delight", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yuuA4hrvwe9tTH9xayZjUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182463744"}