{"aggregateRating": {"reviewCount": 158, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-10", "description": "La Bagel Delight has an amazing amount of variety. From bagels to cream cheeses, there's a wide range to choose from. The bagels are always fresh and the pastries are extremely tasty as well. Delivery is fast and the employees are quick to redo your order if you are unsatisfied in any way. You'll definitely find something you enjoy on the menu at La Bagel Delight!", "author": "Sharon C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-13", "description": "I have been a fan of LBD for years, frequenting the 7th Ave location in Park Slope on a regular basis. However, the staff at this location (Ft Green) was incredibly rude. \n\nI brought two out-of-town visitors there for an early dinner at 5:15 last Mon and after we got our bagels, two of us went to sit outside while the sat inside to answer a phone call. At 5:40, we were asked to move from the benches outside because they were \"closing\". We apologetically complied and moved to go inside, which is when I noticed that the sign on the door said the closing time was 6:00. The woman working inside told us they were closing, so I asked her about the sign on the door (thinking maybe I had missed something?). She said, \"Well, I want to go home.\" I explained that my friend was finishing a phone call and asked if it was ok if we stayed until closing time (typically, this isn't too much to ask of a business that has clear Open-Close times posted). She walked over to the man closing the cash register and said loudly, \"They don't want to leave.\" \n\nWe were offended enough to 'honor' her request and leave. Find your bagel elsewhere until they restaff. These people don't want your business.", "author": "Meg F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-24", "description": "It's pretty standard except that they didn't have a lox combo which is disappointing.", "author": "Rick P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-07", "description": "Great service 100% of the time, great bagels 50% of the time. Some days every bagel is soft and fresh, other days some of the bagels are hard and almost stale.", "author": "Adam M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-17", "description": "I've been here twice and both times weren't that good. Egg and cheese was overcooked and the whole wheat everything bagel leaves a bad aftertaste. I tried it again a few weeks later in case they had an off day but it tasted the same. The cream cheese was the only good part.", "author": "Alaa A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-04", "description": "Favorite tuna salad in the neighborhood. Decent bagels. Unfortunately the manager feels the need to berate his staff in front of customers. He seems to have a short fuse, which is too bad because the employees are otherwise attentive and nice.", "author": "Blair S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-12", "description": "I was so relieved to find another La Bagel when I moved to Fort Greene from Brooklyn Heights... I still miss the Brooklyn Heights owner but I need my La Bagel saturdays!!!", "author": "Jaime G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-13", "description": "They are always messed up with coffee. I always ask to put a just a lil bit of cream, and mentioned twice, and all the time they put a cream a half size of my cup. But bagels are good.", "author": "Adel N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-13", "description": "I don't know what to say. It's really hit or miss with this place. Sometimes it's actually really good, but today was just awful. The cream cheese they put on my bagel tasted like it had been sitting out for days and had the consistency of mayo. Also, my cafe au lait was practically purely milk. Barely any coffee at all in there. UGH", "author": "J T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "New neighborhood, new bagel place! La Bagel Delight, if only you delivered...sometimes even those few blocks from my apartment seem endless after a night out on the town. Yet, I still drag my tired, aching self over to La Bagel Delight.\n\nI LOVE the Everything bagel! Hand rolled definitely makes a huge difference. This is not your run of the mill breakfast truck bagel. These are fresh, and wonderfully soft yet chewy. When you break the bagel apart, you can actually see the \"hand rolled\" swirls!\n\nMy usual- (Everything bagel with Sun-dried Tomato Cream Cheese- Toasted) is always awesome. But if you're looking for that extra filling breakfast/brunch I highly recommend one of the bagel sandwiches. I had the Egg-Sausage-Cheese on and Everything Bagel. The eggs were SO FLUFFY, the cheese melting into the egg, and the Everything of the bagel seasoning the whole thing perfectly.\n\nGreat selection of different cream cheeses and tofu spreads. My friend lactose intolerant friend Carol L. was actually worried that they messed up and didn't give her tofu since it tasted SO GOOD that she couldn't tell!\n\nThere's room to sit down too, and enjoy the sunshine pouring in through the wall to ceiling windows, or if you're lucky, you can grab a spot on the benches outside.\n\nNext time, I want to check out the Avocado, Muenster cheese, Sprouts \u0026 Tomato Sandwich Lunch special.... I'll be back!", "author": "Juliet C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-29", "description": "Good bagel and flagel (flat bagel) sandwiches for a decent price. My coworkers and i order from here often because it is one of the only lunch places in the FG area that: \n1. Takes credit\n2. Takes orders for breakfast/lunch as early as you need them too (8am?)\n3. Has super fast delivery (20 minutes)", "author": "Maia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "Great prices on the lunch and breakfast specials. Had a very satisfying eggplant Parmesan roll. Free wifi too.", "author": "Zee K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-15", "description": "Great local bagel spot.\nConsistently good spreads and service.\n\nQuick service, good coffee, and yummy bagels. \n\nNo need to say more!", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-27", "description": "Their food and ingredients are decent, but unfortunately they are completely overshadowed by the lack of customer service, chaotic order/payment system, and inconsistent pricing (usually over pricing). \n\nI ordered 2 toasted bagels with cream cheese - the girl at the register even wrote it down. 15 minutes later, people who had ordered after me were getting their orders, which were also just bagels with cream cheese or else a more complicated bacon and egg and cheese. I came up to the girl I had ordered from to check on it, and she said \"yeah they're working on it right now, other people got their stuff because they ordered eggs.\" At this point, I would have really appreciated an apology instead of an excuse - and one that was clearly a lie at that. \n\nI then had to essentially repeat my order several times and she got people around her to work on it - clearly she did not put in my order when I had ordered it (what was the point of writing it down then?)\n\nWhen she rang me up, she input a bunch of random numbers that I couldn't tell if they correlated with my order at all. I've been here a number of times, and I've almost never paid the same price for the same exact order. \n\nI'm a pretty patient and understanding person - this morning was a busy one in the store, and I can totally understand that an order sometimes gets lost in the mix - but you have to own up to it, and not lie to my face about it, have an attitude, and then overcharge me. \n\nSad to say I won't be back - it's the only bagel shop in my neighborhood. Someone please take over this place and manage it better, or else open up another bagel shop in the neighborhood - if it even has an iota of organization and customer service, it will take away La Bagel's market share within a week.", "author": "Kat T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-11", "description": "Yay! The lox spread here is off the hizzy.\n\nNay! My poppyseed bagel only had about 15 poppyseeds.\n\nI do have to say that the bagels are the perfect size and crispiness on the outside.", "author": "Callie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-29", "description": "Here's yet another place that's around the corner from my new/temporary home this summer and I've stopped in a few times already because bagels are simply a staple of my diet. I pretty much have one every single day or at the very least, 5-6x a week.\n\nSilly name aside, these are some GOOD, fresh bagels. I've run into a little bit of trouble here though: one time I asked for a toasted bagel with butter, and while it was a little *too* toasted (read: burnt) around the edges, it was still doughy, warm, and delicious. Another time Margot G. and I were in here and opted for two bagels, not toasted, with cream cheese. I highly recommend not toasting your bagel here because the non-toasted variety is still warm and awesome. However, I'd also suggest asking them to go light on the cream cheese because I think I ended up eating my weight in cream cheese with this order. I was seriously dipping the top half of the bagel into the mountain of cream cheese on the bottom half of the bagel.\n\nThese snafus + being a little spendier than I'd like to pay for a bakery item with a hole in the middle = the knocking off of one star. Service is always nice and pretty speedy here, and the bagels are really good, but make sure to learn from my mistakes and skip the toasting of the bagel and ask for light cream cheese if you're asking for it.", "author": "Shea D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-20", "description": "When in Fort Greene, hungry for a big bagel, may I suggest La Bagel Delight?\n\nLet neither the large, amorphous blob of people standing in front of the cash registers nor the servers screaming \"NEXT ON LINE!\" to such a large and unorganized blob of people (who subsequently look at each other with looks of \"were YOU next in line, or was it me?  Oh dear, I'm so lost!\" in their eyes) deter you from enjoying La Bagel Delight, because once you get the bagel, you'll say \"Line, schmine!  This bagel is freaking fantastic!\"\n\nWith an assortment of bagel types (your typical everything bagel, your egg bagel, etc.) and an excellent array of cream cheeses (from traditional to light varieties, to the chocolate chip cookie dough cream cheese...), La Bagel Delight truly offers a cheap, if hectic breakfast experience.\n\nI've never been disappointed, and I doubt you will be either...", "author": "Ryan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-05", "description": "Great hand rolled bagels that are super fresh and chewy!  Also get bonus points for all the seating inside too.  Making this place one of my regulars!", "author": "Jameka A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-25", "description": "Terrible coffee. The bagels are fine. A little pricey. I wish they had a better system for ordering and paying.  On weekends, orders can get backed up and waiting for/paying for orders can get a little chaotic.", "author": "Louis F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-19", "description": "The bagels here are above average. The same can be said for the spreads and the sandwiches. All rather solid.\n\nSo, Mr. Leprechaun, why only three stars?\n\nSimple: My order is screwed up AT LEAST 50% of the time. It's to the point where I'm having to check in the store so I can alert them to get it right.\n\nIt's to the point where it's laughable. I am surprised when the order is correct.\n\nBut it's the best bagel option I know of in Fort Greene, so I will continue to go, but I don't have to give it 4 or 5 stars...", "author": "Stranger D."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "Under $10", "name": "La Bagel Delight", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yuuA4hrvwe9tTH9xayZjUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182463744"}