{"aggregateRating": {"reviewCount": 158, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "Loved their breakfast specuals and good fresh coffee. Quick, friendly service and cute little tables to eat at.", "author": "Dalayce S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-19", "description": "Placed a order on delivery.com. Waited over 2.5+ hours for our order and called the restaurant three times asking for an update. Food never showed up and never recieved any updates. We had to ask for a refund sinve they would not remake the order. I asked to speak to manager and was told that no manager would be available until the following Monday. Apparently this store is only managed one day a week and customer service is a not a priority for them. Don't waste your time ordering delivery from this location. They will only give you the run around and act like they don't know what is going on.", "author": "Daniel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "La Bagel Delight serves breakfast, lunch, and old fashioned kosher pastries in a cute section of Fort Greene. The set up encourages you to peruse the vast menu, order at the far back counter,  and take your meal to one of the 14 seats they have or outside. I've eaten in the park, which is nice when the weather is warm.\n\nPrices are cheap, and in line with other old school NYC bagel joints. Two bagel sandwiches plus a coffee run about $10. Service is fast but fairly hands off.\n\nI've tried:\nSesame flagel with spinach eggs and mozz\nEverything flagel with chicken salad\nSteak egg and cheese bagel\nTuna salad\n\nBagels tend to be thick... but with a crisp chewy exterior and fluffy middle.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-07", "description": "I've been coming here for almost a year now ams I'm never disappointed. They have a huge selection of cream cheeses, salads, and deli items. The bagels are big, fluffy \u0026 fresh. My favorite thing here is a bacon, egg \u0026 cheddar in croissant with hot sauce. Their sandwiches are delicious as are their bakery items. \n\nThe only negative is that there's usually a few minute wait, but that's hardly their fault for being popular. Their their employees are polite ams they move quickly.", "author": "Trevor L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "Well made bagel that is quite nice toasted (everything with tofu scallion cream cheese is my recommendation)", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-06", "description": "This place does not listen . I ordered scooped out bagel with butter and ice coffee which I asked for twice. Bagel took a really long time and they insited I ordered hot coffe when I asked twice for my ice coffee.vI was the only one in the store", "author": "Barbara H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "Awesome place, friendly faces, amazing food.\nLoved the muffins and cinnamon rolls. And it goes without saying that the bagels were bomb!", "author": "Roxy G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-18", "description": "Schmear the bagels, not your customers.\n\nI give this place one star because the quality of service was shockingly abysmal - and as selling bagels is, in general, a commodity business, the relationship between the business and its customers becomes that much more vital.\n\nI ordered a breakfast bagel 40 minutes in advance this morning so that I could pick it up and proceed from there directly to work. When I arrived, the employees at the front counter said they didn't have my order. I asked them to double check, and they said it wasn't there. They then said that if I wanted them to make it, I would have to wait another 15 minutes - time which I did not have. So I left the store, and later called the manager on my towards work. I let him know what had happened, that I was a regular customer, and that I was disappointed with the service, and, as a long-time patron, would appreciate some kind of gesture of good will on their end.\n\nThe manager then said he sees my order in the store, and says that it's my fault for not seeking him out directly and asking him. He then starts to get upset, and complains that now he has an order that no one will eat and suggests that I owe 'him'. \n\nI advise anyone to take this story into consideration, as you risk being subject to the same unprofessional treatment from the employees and managers alike.", "author": "Yanik J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-15", "description": "The bagels are decent, We go there because it's literally around the corner from our house. Went in this morning and ordered two breakfast bagels and two iced hazelnut coffees. We ended up waiting over 25 minutes for our order. When we inquired about our order they asked what it was we ordered which indicates to me they had lost the ticket but then told me they dropped the bagel which was the reason it was taking so long either way s**t happens that's not why I'm upset. I'm upset because as a restaurant owner myself this situation was handled appallingly. Even after I had stood at the counter clearly upset after waiting that long, after they admitted they had made a mistake they still rung us up for our two bagels and two iced coffees. I reminded the guy who seemed to be in charge (the one who told me they had dropped our bagels) of our wait time and he told me \"everyone's waiting.\" I said you can't even throw in the coffees? And he shrugged his shoulders and proceeded to help the next customer. Those two coffees just cost him our loyalty.", "author": "Jonathan L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-22", "description": "I stopped in for lunch and had a plain bagel toasted with cream cheese and lox. My bagel was 'warmed' but not toasted. When I went to pick it up the woman told me it was a salt bagel and I told her I had ordered plain. Then she insisted I had ordered salt. Next to me a woman was so angry because she had waited over 15 min for her bagel and the person working there just kept yelling back at her that it was almost done. \n\nHow was the food? Not good. My bagel was all bagel. Very little cream cheese and almost zero lox. Service? Worse. I don't recommend coming here. This place makes me miss H\u0026H bagels.", "author": "Christine L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "This is my jam. Still new to Fort Greene and I know I should be exploring a bit more, but my old man always told me that if you find something great you need to hold it close. So that's what I do with my bacon, egg and cheese on everything bagel, nearly every day of the week. \n\nIf you want to go the traditional route, they have enough \"schmears\" to set your heart alight. Everything's fresh, and the service is quick and efficient. At first I was a bit confused by the ordering process, but I have a tendency to overthink things, so you can understand how I might get confused by something as simple as two lines, one designated \"order here\" and the other \"wait here\". I've got it down pat now.\n\nIf you're in the neighborhood (or remotely nearby) this place is worth seeking out.", "author": "Chad T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Came here for breakfast on a Wednesday morning from a recommendation from my friend, and enjoyed my experience! The food came out fast, and the lox bagel was delicious. They have about 5-6 tables in the back of the restaurant, which made it really convenient. When I am back in town, I'll definitely visit again!", "author": "Rachel Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-25", "description": "I don't really understand why this place has the Yelp score it does -- the bagels just aren't that good. It's almost like they merged a good new york bagel and a mushy kaiser roll. This place is literally on my block and I'll still walk to Bergen Bagels or even Bagel World if I want a simple bagel with cream cheese.\n\nThe one thing they do do well are breakfast sandwiches; they really don't skimp on the eggs and meat, so you end up with a pretty big meal given the size of the bagels themselves.", "author": "Jonathan C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-21", "description": "Bagels are not good. Tried an everything bagel sith strawberry cream cheese, and didnt relly like it.\nMuffins are decent.", "author": "Bárbara H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-24", "description": "Loveeee La Bagel Delight. They know how to make a mean sandwich. \n\nSince I'm new to the area, I went on the hunt for a nice spot for lunch. La Bagel Delight was the first place I ventured into. It's not too big, there's not much seating yet they really bring in the crowds. It's always busy when I visit. They may be a bit on the pricey side, but I think it's completely worth considering the quality of the foods there. \n\nOne item I want to highlight: Their flagel. It's probably the best one I've had so far in BK. I like mine toasted with light veggie cream cheese. That and some OJ? Best breakfast.\n\nAnd in the last few visits I've had the opportunity to try their sandwiches. Take a look at the specials board since they usually offer some pretty sweet deals. One of my favorites was their Grilled turkey with brie, sliced granny smith apples and their chipotle mayo on a baguette. It was scrumptious.\n\nThe workers are so friendly and work fastttttt. I haven't waited for more than 12-15 minutes at most. I'll definitely be back! What a great find in Fort Greene.", "author": "Katie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "Fast, efficient, affordable, and very very tasty!\n\nI came here for brunch but will definitely be back for a lunch sandwich another day!\n\nThe staff is great as well, they know what they are doing and I enjoyed interacting with them.", "author": "Nicholas M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-17", "description": "I usually go here for my breakfast before I go to work but todays experience has made me never want to go back. Today I took all of my coworker's orders and had a great experience with the person taking my order and charging me for my order. I got the avocado toast (usually around $3-4). Today it was $5, I had no problem with the price but when I got back to work and opened my food, my bread was not toasted, the avocado was not smeared in, and it was not filling. Every time I have gotten avocado toast, there has not been a problem. I went back and spoke to the manager (he's a short Asian man). I told him how unhappy I was with my order and showed him what it looked like. The cashier was empathetic but the manager was so rude. He told me, \"we don't smear the avocado, we don't do guacamole here.\" I also informed him that I come there frequent and spend a fair amount of money for breakfast and it doesn't matter if I ordered guacamole because avocado toast is usually smeared and there were only 5 small slices of avocado smushed into the bread. He was very rude about the whole situation and made me never want to spend a dime in there again. I'm all about customer service and his was very poor. To the owner who hired this manager, I recommend having him go to a customer service training or seminar so he can see how to talk to customers spending their money. Thank you for your time.", "author": "Kristin O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-17", "description": "Terrible customer service over the last few weeks. I've been going here for a while and the more and more I go the worse my experience is. The manager (Asian man) is completely rude and disgusting. Once he caught an attitude with me because their toaster was broken and it wasn't communicated when I made my order. Had another terrible experience this morning, it's a shame this is happening at a place I used to once love.", "author": "Chanel A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-06", "description": "Dropped in for a pick me up cafe and decided to feed my not so hungry self.   What is it with bagels that the majority are like eating hard dough and completely tasteless?? The last time I ate a decent  bagel was back in the day London 1996 or thereabouts at the Brick Lane famous bagel shop which is open 24/7 and is a great place for a very late after too much alcohol moment in East London.  This bagel was thick with cream cheese which saved the day as  I ate the cheese and left 3/4 of this hard dumpling like bagel.  3 stars for the cafe and service ZERO for the bagel.", "author": "Sokari E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "This place makes my favorite bagels in Brooklyn. I recommend the food unreservedly. \n\nThe only problem is the layout of the store: you have to order, pay, and pick up your food all in the same place. The result is that there is often a big, disorganized crowd of people surrounding the counter, and it's hard to tell who's in line and who's waiting for food. It's really annoying!\n\nIt would be so easy to fix this problem by just moving the place where you order and the place where you pay to opposite ends of the counter (like every other bagel place in the city). I can't believe they haven't done this.", "author": "Daniel H."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "Under $10", "name": "La Bagel Delight", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "73 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/yuuA4hrvwe9tTH9xayZjUg/ls.jpg", "@type": "Restaurant", "telephone": "+17182463744"}