{"aggregateRating": {"reviewCount": 147, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "Had a beef and lamb doner bowl with fries instead of rice. Probably should have gone with the former as the fries weren't that good.\n\nThe beef/lamb were both good. Not as greasy as the carts. It could have used a little more seasoning. The white/hot sauces were both good though not extraordinary \n\nThe red cabbage was excellent and the salad was solid also. I found the tomatoes however to not be that good, not juicy. Pickles were good \n\nNice people. I'd give this place a 3.5 if I could", "author": "Glenn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Bruh! We need this in Astoria. I know we have great Greek places in qns but this place was really good. I came here for a quick lunch (btw shake shack and doner kebab ) and boy it didn't disappoint. Staff was quick and friendly.  Food was fresh. And price was reasonable. Of course, I'll go again, but BK is too far and NY still don't have a good system that connects qns to BK (just venting)!", "author": "Justin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Fabulous fast casual spot! We did a loop around the block and we didn't want any of the unhealthy stuff like Shake Shack, Burger King or Potbelly and we thankfully ran into this cute spot! \n\nIt looked very new so we checked on Yelp and the reviews were glowing, and rightfully so! My boyfriend ordered the chicken bowl and I decided to go with the chicken kebab bowl. The kebab is made to order so it took an extra 10 mins to grill. My bf got all the fixings and both white and spicy sauce. While we waited for mine to cook, I tried his and I was shocked. The chicken was so juicy and the pickles and jalapeño peppers really gave it a great kick. If mine was cooked to order, I could only imagine how much more juicy my chicken would be. Yup- I was right! My bf wished he ordered the same but honestly, if I didn't want to wait, the regular chicken was tender and juicy too! The portion was great too for the price. \n\nToo bad I'm never really in the area but next time I'm back, I know exactly where to go!", "author": "Cynthia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "I was craving a kebab so badly and I was so glad I came here! It was so good and they give a lot! The price was not bad either and it was so delicious. Will come back here again so satisfied", "author": "Milena M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Wait, I've never reviewed Doner Kebab! That's unbelievable, as they have my favorite Mediterranean food in downtown Brooklyn. No offense to some of the past favorites, but this spot consistently has amazingly fresh vegetables, toppings, everything that you can want with your food. And the staff is always on point as well, helpful with any questions and very genial in their service. I've actually never eaten in here, however the wonderful communal tables are very inviting and seem very comfortable...people dig being here.", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "Went there last night to pick a dinner for myself and my husband. I got 1 wrap and 1 bowl both with chicken doner. \nThe chicken was succulent and delicious. The rice was fresh and all the vegetables were fresh and tasty. You get to choose a white yogurt based sauce or a red hot sauce or both. I chose both. You also get to add hummus for an additional dollar.\nOverall impressed by the place and it is going to surely become one of my go-to pickup spots. It is really nice to see downtown brooklyn's food scene improving so much!", "author": "Nisarga M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-03", "description": "As coming from Middle East, I can tell you this is not a good Doner or Shawerma..... it doesn't taste as I expected.... the first half of the sandwich is red cabbage salad and onions with parsley and then the second half is the meat...which means you need to eat so many bites to get you to the meat \nI tried both the chicken and the beef with lamb.... the chicken is tender but under seasoned... the beef and lamb combination tasted horrible really dry and the meat tasted old to me.... and it's way over priced", "author": "Bian M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "Meats are well flavored, juicy, and staff is attentive. The Lamb/beef is a nice blend. Homemade hot and white sauce are tasty and mix well with the food (when used in moderation) without taking over the original taste. Rice and Pita are also fresh and not dry. \n\nGive them a try as this place beats out all the halal carts (even the famous ones) and the few Mediterranean sit-down restaurants I have ordered take-out from in Manhattan. For the price and portion size, this place is a winner in the fast-casual market and should force the other restaurants to up their flavor game.\n\nLayout of store nice. Menu is simple to understand, space is clean, and seating is spacious. Three things hard to have in New York.\n\nI have not had the hummus so I can't comment on that but will try that next time!", "author": "Robin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-06", "description": "This Turkish Doner spot is the best gyro or doner (whatever you wanna call it) in americas! Not only NY.", "author": "Baris A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Today I had a random craving for Doner Kebab which is odd because I haven't had Doner since 2011 before I left Germany. On a whim I googled places near me and Doner Kebab NYC popped up. So, I went for lunch. I was not disappointed. Walking into the place I was immediately returned to my younger years pub crawling in Germany and ending the night at some Doner shop. This place does Doner right. From the Turkey bread to the Beef \u0026 Lamb meat and to fresh vegetables and white sauce. Each bite was as delicious as the one previous. The bread was soft and tender yet crunch from the light press \u0026 toasting. The meat was juicy and tender. The vegetables were fresh \u0026 crispy. And the white sauce added a zest of tang and freshness that married it all together. \n\nSorry, for not having a picture but you must understand how anxious I was to try it.", "author": "Antonio N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "I love this place, I could have dinner here every night. It's savory yet nutritious and economically priced. It's pleasant and clean, everything is very fresh and flavorful. It's also really fast, very convenient and I literally can eat here every night and not grow tired of them menu. LOVE.", "author": "Kat A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "Unbelievably Delicious!!! The chicken Doner was so moist and seasoned to perfection. I can eat here daily. Very clean place and awesome customer service. Highly recommend", "author": "Bob B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "I was in the area for a training. Stopped in for lunch and ordered a chicken wrap. The wrap is warmed up in a press. Then your main ingredient is added, followed by toppings and sauce.\n\nThe chicken was juicy and flavorful. I also liked that they were generous with the meat, and the cut slices of chicken were crispy. I practically asked for all the toppings, which included iceberg lettuce, cucumber and tomatoes, onions, jalapeños, pickles and red cabbage. They offer two types of sauce: garlic and yogurt sauce, and homemade hot sauce. Personally, I did not find the hot sauce hot; it tasted more like watery tomato sauce.\n\nThe food was very yummy. I recommend this place.  Plus they seem to keep the place clean.", "author": "Erika Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "I had the chicken sandwich and it was ! Great service and food, really friendly people.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "I had this 3 days in a row. Thats how good it is. I had such a craving Since Souvlaki House on Lawrence shutdown. #1 How unbelievably clean it is. Immaculate.  #2 it was DELICIOUS. I had the beef lamb. They're generous with the meat . The Lentil soup is best I have ever had . Its vegetarian made fresh daily. This place real deal and Ill enjoy everytime Im downtown", "author": "Nurys J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "Excellent new kebab house that reminds me of being back home in the U.K.! A small selection and simple food which is very well executed. Shish kebab is cooked to order and the chicken is very moist and tender, nicely spiced. The salad is crisp and fresh, and the fries (again, cooked to order) are perfect!", "author": "Gavin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "I love this place! The chicken kebab is delicious and fresh! Very friendly staff and reasonably priced. Definitely a go to for a quick healthy lunch. Highly recommend!!!!", "author": "Lizzie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "I like their falafel. Food is fresh.\n\nThe service is overall very good. Highly recommend.", "author": "Nobama y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-19", "description": "Simple concept. Chose your meat in wrap or bowl. Pick toppings. Lastly, add magical white/red sauce if you choose. Came here during lunch time. Line was moving pretty fast. Not too much seating inside. These guys have a good system going and are also pretty friendly. I chose the lamb bowl with rice. All the toppings and white sauce. Portion was generous for $11.55. The lamb was bit on the dry side, but the flavor was still good. Toppings were fresh. Mmm..those jalapenos. Although not the best Turkish food I've had, it is still a welcoming addition to the neighborhood. Will come back to try the other meats on the menu. Ask for pita on the side. That was free.", "author": "Cory D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "The best and cleanest fast food around. Healthy food, friendly crew. You have to try it at least once", "author": "Masih T."}], "servesCuisine": "Mediterranean", "priceRange": "$11-30", "name": "Doner Kebab NYC", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "34 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/yQse9LrPx9fxyb5dxOh1pQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182223434"}