{"aggregateRating": {"reviewCount": 147, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "I swear, if I read another review comparing them to Chipotle...\n\nAnyway, fast casual doner is something I can definitely get behind. Although, if you really think about it, all doner is pretty fast food. It's like... right there. Anyway, at Doner Kebab, you can get wraps or bowls. They have beef/lamb doner, chicken doner, kofte, chicken shish kebab, and falafel.\n\nI went with the beef/lamb. There's just something about watching people slice meat off a spit that's so satisfying. I got it over rice with a side of pita (no extra charge). You get to choose what other side veggies you want (I think the only thing that costs extra is hummus).\n\nTo say the portion sizes are generous would be an understatement. Definitely a next-day leftover kinda meal. The red sauce is tangy and not overly spicy. The white sauce is exactly what you'd expect from white sauce. Veggies were fresh and crisp. Meat was perfectly charred.\n\nStaff is friendly, and there's a ton of seating.\n\nDefinitely stop in if you're in the neighborhood!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-15", "description": "I came here around 1:30pm and wanted chicken shish kebab but had to wait 10 mins since it wasn't ready so I went ahead and tried falafel for the first time, \nIt was ok, maybe falafel is just not my thing.\nBut the customer service was great, I appreciate how the first person in line to take orders was patient enough to answer my questions also the cashier was very nice and friendly to every customer as they checked out.", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-18", "description": "I had the falafel sandwich and it was delicious. Very moist and flavorful. It was only $7 and it came with tons of veggies, hummus, tzaiki, and hot sauce. It was def good for that price.", "author": "Marya R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-03", "description": "I went here today for lunch since I was in the area . Got the beef/lamb bowl with rice and hummus on the side .   First off, the halal carts gives you a lot more portion than here . The meat does taste better than what you'd get at a halal cart .  But it's not the true Doner style of thin slices of meat . I would say it's more shawarma style than anything else .  The hummus was okay, but not the best.", "author": "George B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-08", "description": "very delicious Beef and lamb donner sandwich. I was a little bummed that they didn't carve it hot off the rotating meat but took it out of a container in front of him. guess it saves time. Other than that it was delicious. And the hot sauce....wow", "author": "Pat W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-11", "description": "Wow, the lamb doner wrap blew me away. The lamb from the spit was tender, moist and delicious. It came on a wrap instead of a pita and was filled with your choice of vegetables including lettuce, tomato, onion, cucumbers, purple cabbage. You can add cheese and hummus for extra. And the hot and white sauces are handmade.\n\nThe no frills shop is located a stone's throw from the Jay Street metro stop in Downtown Brooklyn. A short line started to form after I ordered because there was only one person manning the front. But the food is worth the wait.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-01", "description": "No.\n\nNo flavor, no seasoning, no mannerism, No I will not return.\n\n-Extremely bland \u0026 dry food. Unauthentic.\n-Small portions\n-The staff are odd \u0026 rude.\n\nLiterally just another restaurant with a modern interior that accommodates the palates of sissies.", "author": "Danielle A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-30", "description": "Mediterranean is one of my favorite cuisines! I do not come to Downtown Brooklyn often but I was in the area for a company-wide training today - so hello there! This area changed a lot since my high school days with more variety of food options and factory outlet stores popping up. My sidekick who works in the area, met up with me for a lunch date here to catch up. We got there at 12:00 pm sharp and beat the crowd!  \n\nChicken Doner Bowl. This came with a generous amount of sliced chicken pieces with rice pilaf, purple cabbage, Israeli salad, onions, pickles, lettuce, and hot pita bread with their amazing garlic yogurt sauce. Chicken shawarma-like pieces were really tender and had a nice char on the sides. Vegetables are really fresh and healthy tasting. Needless to say, I devoured the entire bowl and I was really stuffed! \n\nService is very friendly here! Staff was quick and precise - they packed my food so neatly. The girl behind the register made sure I got my free hot pita bread to go with my meal when I was about walk away without it. That was really sweet of her!", "author": "Cynthia D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "RECOMMENDED\n\nDuring my work as an attorney, I find myself often at the Supreme Court in downtown Brooklyn. This court is notable for its inefficiency. Every time you peacefully and amicably agree to an order with your adversary, it takes 45 minutes or an hour to get a judge to \"rubber stamp it\" so you need to find useful ways to fill that downtime. Sometimes coffee, sometimes Trader Joe's, sometimes Sahadi Importers but sometimes delays extend into the early afternoon and you just want to get a quick and decent casual lunch so you can get back to the typical pile of paperwork at the office. Hurray for Doner Kebab!!!\n\nOn May 4th, I was bored with the typical choices along Court Street and went looking for a casual lunch on Willoughby Street, across from Adams Street. I saw Doner Kebab and entered. The place is brand sparkling new and clean. It even has some seating. The layout for ordering items is familiar. Think \"Halal Subway\". Three large vertical spits containing beef lamb and chicken are to the rear of the food service station where the pleasant workers apply toppings and assemble sandwiches or platters. \n\nI chose a lamb/beef wrap, adding very fresh and tasty hummus as a topping for an additional buck or two, along with hot and white sauces. I bellied up to the communal bench seating looking out the window onto the street and dug in. The restaurant put a generous portion of thinly sliced lamb and beef in my wrap. The meats and topping were fresh and tasty but I thought the meat was a little under-seasoned. That being said, the meat was markedly better than halal cart \"street meat concentrate\".\n\nI devoured that very satisfying sandwich and began my subway trek to Manhattan a contented man. This was my first visit to Doner Kebab but, since it is one of the best fast casual dining options near the Brooklyn courthouses, it won't be my last!!!!", "author": "Thomas C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "Wow. This is like the chipotle chain version of turkish/ Mediterranean food . We came in on a Sunday afternoon when it was dead. Service was super attentive. The foodstaff gave me a heads up that the meatballs would be a while and that since me and my family were paying together we could sit and they would call me when my food was ready. It was no rush and felt super relaxed.  While I was waiting, i leanerld that the location only opened about a year ago, and they genuinely seemed to want to strike a conversation to get to know me and my family better so that we could all be nicely familiar with each other.\n\nThe food itself was fresh and so flavorful. For 11$ ish I got the meatball bowl with rice. The rice is nice and buttery like you expect. The fries were super fresh for my cousin's lamb and shish bowl. The salad sides are not wilted at all. The only downside is that the heat was blasted full blast near the entrance where we were sitting and that made eating uncomfortable. But all in all, I'll definitely return here when I want delicious turkish food and to say hello to an awesome staff .", "author": "Jemi J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-24", "description": "Wanted to thank the crew at Doner Kebab NYC for making eating here a great experience for me and my girlfriend. They really went out of their way with customer service and friendliness. Really a great group of guys hustling and making sure their customer is well-taken care of. Food itself was reasonably priced, great bang for your buck, lots of protein. We came in a so-so mood on a rainy day and left amazingly happy. Highly recommended!", "author": "Brian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-04", "description": "Very nice example of eastern fast food place in Downtown Brooklyn. Good pricing, tender lamb döner and fragrant taste of condiments. Keep it up! See you soon.", "author": "Nikita I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-01", "description": "Ordered a mixed meat wrap. It was very good and the price was reasonable (~10$ wrap+coke can). The guy in the counter was very nice and friendly; also, the man that was cooking asked me about how I liked the wrap after I was finishing it, so it was very nice. \nThe place is very clean and not crowded; the place is not too big thought, so I would not recomend it for groups bigger than 6 people if you want to eat on the site. You can also order to go and in Uber eats.", "author": "Claudia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-15", "description": "My husband took me here today because he guaranteed I was going to love their falafel sandwich, and boy, was he right!!! The hummus was so delicious and fresh. The falafel balls were crunchy on the outside but moist on the inside. And the rest of the ingredients were so fresh!!! Love the fact that you can customize your falafel sandwich with whatever you want. Definitely coming back!!!", "author": "Adriana T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-22", "description": "While working downtown Brooklyn, I was in search of fresh, fat free eats for a late lunch within the Jay St Metrotech area. The options were few with options such as hot dogs, heros, hot Wings and burgers. My feet led me to Doner and my intestines are doing the stanky leg, to thank me. \n\nWhenever ordering Mediterranean, I always order Falafel platters. It's light and filling at the same time. I ordered the Falafel bowl. The falafel was prepared Fresh for me and topped off with the works. White rice, purple cabbage, lettuce, Israeli salad( cucumber, onion, tomato in vinegar), white seasoned onion, sliced pickles and hummus. This was very comparable to Roti Grill. The only downside to me was the salad. I wish they had more vegetable options and spinach instead of iceberg.\n\nThere is plenty of communal bench seating available to dine-in, but I can imagine during lunch breaks it can get crazy.\n\nI will definitely be back to try the lamb and pitas.", "author": "Marissa M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-04", "description": "The chicken kebab is excellent, probably the best chicken I've ever had at a fast food joint that doesn't specialize in chicken (moist and tender, with a tiny bit of char at the edges). But be warned, they make it fresh and it takes 10 minutes (unlike all of the other meat options, which are pre-prepared).\n\nThe fries are weirdly bland, even if you get fresh fries that are straight out of the fryer. You can fix some of the blandness by seasoning the fries yourself, but the fries are also strangely soggy for fresh fries. Parts of the fry seem undercooked even though they're quite brown at the corners. Maybe they're just cooked at the wrong temperature or start out too soggy to begin? Whatever the reason, skip the fries, and if you have time, get the chicken kebab.\n\nService is hit or miss. One time, they screwed up my order and overcharged me, and after doing so they didn't want to fix it. Another time, the bathroom was totally out of toilet paper and they just didn't GAF (good thing I checked before using the toilet, but I doubt everyone was so lucky).", "author": "Dan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-09", "description": "Tried them for several times already. Every time was very happy with my experience here. \n\nStaff is very friendly and polite. Always smiling and it actually makes you feel comfortable. \n\nThey are very very fast compared to many other places. Even during the rush hour the line is moving pretty quick. \n\nSalad options are very decent. Most pleasant is that veggies are always fresh and that the guys are lavish in adding whichever option you want. I believe you can even order from every option they got, as long as it fits in your bowl. \n\nMeet is ok. They got chicken, beef\u0026lamb gyros, meet balls, and falafel as a vegetarian option.  \n\nI would suggest them to work a little bit on the prices for the bowl option and also on the amount of rice and meet they add. I am not saying that it is bad, all Im saying is that it would be great if they could work a little more on that part, even though it is still pretty decent.\n\nOverall a very good experience every time. The place is good for a quick and delicious lunch. If you get mad hungry like me towards the lunch time they also offer a pita bread for free and it definitely wont let you stay hungry.", "author": "Henrik L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "Awesome food. That is all needs to be said. \nIf it comes to Doner (gyro), I have 40 years of experience as a consumer and these guys are awesome.", "author": "Alper G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-20", "description": "Healthy lunch options galore! Doner is basically a\nMediterranean Chipotle. The food is fresh and tasty. Doner's meat and falafel is super flavorful. I wish they had options other than white rice but you win some you lose some. I mostly get the falafel and top it with cabbage cucumbers pickled peppers and garlic sauce.  \n\nThere is seating for about 10 inside so definitely get it to go. If youre looking for a healthy option near fulton mall definitely try this.", "author": "Charles K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "Doner Kebab NYC joins the wave of fast-casual restaurants hitting the city, where you build a bowl / wrap / sandwich in a manner similar to Chipotle. Here, however, you'll find beautiful rotating spits of beef/lamb and chicken and a variety of fresh and pickled vegetables.\n\nI went for the chicken doner bowl ($12ish with tax), with white rice, pickles, pickled cabbage, lettuce, tomato/cucumber, and some raw onions. I also got a huge spoonful of hummus, which does cost an extra $1.\n\nThe verdict? Pretty good! The meat wasn't the most flavorful I've had, but it was juicy and went well with the rest of the toppings. The pickles and cabbage added a nice acidic bite while the other veggies were fresh. While I would probably skip the hummus next time, the bowl also came with a fluffy and warm piece of pita which was AMAZING. Seriously, I want to hunt down their pita supplier and buy a pack for myself.\n\nYou'll shell out a few extra dollars here for a meal, but portions are large and the food is fresh; you're definitely paying for quality ingredients, which I don't mind. It's a great fast, healthy, and fresh option for all the office workers in the area who are tired of waiting for 30+ minutes at Shake Shack or Chipotle.", "author": "Marina S."}], "servesCuisine": "Mediterranean", "priceRange": "$11-30", "name": "Doner Kebab NYC", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "34 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/yQse9LrPx9fxyb5dxOh1pQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182223434"}