{"aggregateRating": {"reviewCount": 147, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "This place rocks. Food comes quick, delicious and reasonably priced. Great stopr for a lunch meal with coworkers. Take out is great too. They always greet you will a smile.", "author": "Giovanni M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "So happy this placed opened up. With so many bad gyros in area, finally a place that does it right!  I recommend the beer and lamb doner.", "author": "Jon A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-04", "description": "Delicious relatively healthy option ...would def go back for lamb bowl ...yum. Only wish they could provide nutritional values.", "author": "lilian s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-29", "description": "After living in Germany for 4 years I missed a good Döner. The spicy sauce isn't very spicy so don't fret if you aren't sure of your tolerance and if you like really spicy food try asking for extra. The added salad and other veggies are top notch as well. The place is very clean and the workers very friendly. A welcome addition to the neighborhood.", "author": "Will N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "Super accessible, near many subways and buses. I got a chicken bowl and a beef/lamb bowl to takeout for 2 people. Nice, friendly service. The bag was relatively heavy and when I got home two of us finished one of the bowls. The serving of meat, rice, salads and hummus was very, very generous and tasted good. A satisfying meal! I put the chicken bowl in the fridge. When I was ready to start on that I noticed that the chicken and rice were on one side of the bowl. This made it easy to take it out and reheat that part while the salads stayed crunchy. The place is next door to a wing place, skip that and come here instead.", "author": "Ellis S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "Saw this place on lunch break so I tried it today and it's definitely going to be one of my spots for lunch at work. I had the kofte (meatballs) on a wrap. I must say I was impressed how perfect the meat was. Very fresh and tasted excellent. My co-worker had the falafel platter with rice and salad and loved it also. I'm excited to try everything on their menu. And the workers there are all smiles. I definitely recommend it!!", "author": "Arzu A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Really delicious doner kebab, tastes like the places in Europe.  I like how they give you veggies, hummus, and pita all included in the bowl.  Recommended!", "author": "Ryan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Awesome customer service and great food! Very original and creative method of serving the food. I usually get the lamb and beef over rice and it does not disappoint! As a Turk, I'm critical of Turkish food, but this place is as close as it gets to the food from the motherland", "author": "Fatih C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "I really enjoyed the lentil soup. It was great! I was too full already to order anything else. The staff was also really friendly!", "author": "D L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-22", "description": "I went to this newly opened Turkish restaurant last night. Place has a good vibe and really great Turkish street food. I tried the doner sandwich and my friend tried the kofte kebab. Both were delicious. The manager who I think is named Keenaan was super nice and friendly. This place is worth trying If you are in the neighborhood. I recommend it!", "author": "MoJo I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-05", "description": "Decided to stop by for lunch to try out the falafel and hummus with rice. I'm a huge falafan, so I was eagerly waiting on line for this bit. The ingredients were delicious, but I would caution them not to overcook it. While it was pretty dry on the outside, the contents inside redeemed themselves. Agreeing with others, I found the salad and hummus to be nice complements to the main feature.", "author": "Maria L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "Always fresh. Good Beef and Lamb Doner. Highly recommend", "author": "Jonny S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-03", "description": "Regular cart-gyro food for much more money; this restaurant is rip-off. You better buy the same thing for lass than half the price just next to that same store.\nAVOID!!!", "author": "Terry B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-24", "description": "This place is fantastic. Have been craving döner since I moved back to Kentucky from eastern Germany and have had no options until this trip to NYC. The quality of the meat is fantastic and even surpassed the average German döner and shocked my girlfriend (who is German). This gave us a taste of home that we were desperate for and it did so deliciously. If you are in NYC, take the F train to Jay St. and find this place", "author": "Chris B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Excellent doner kebab,the best around very good concept good luck  Mehmet. .all the best", "author": "Gourmet K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-29", "description": "Been there twice. Good sized portions and very tasty. My only complaint is their beverage selection. I like unsweetened Iced Tea and they don't offer it. Found some green unsweetened tea at the 7-11 about 1/4 mile away. They are packed during lunch and the seating is cramped but that's because most people are very happy with food and return as repeat customers. I come into NY for exercise walking in Central Park so when I arrive at Penn Station I take the train over to Jay Street to eat at Doner. Restaurants like Doner are really taking off with the spread of the Verts and Naf Naf Grill chains to the East Coast. Still can't find a Doner Kebab place like they have in Italy where they put french fries inside the pita along with lamb or chicken, vegetables and sauce.", "author": "Drew S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "I stumbled on this place today looking for a light bite.  Brand new Turkish restaurant in downtown Brooklyn in the soft open phase.  The owners are very very nice and have a restaurant in Turkey with this their first US venture.  Fast casual with very fresh and tasty food.  Had a kofte sandwich and it was fantastic with fresh ripe tomatoes, seasoned onions and a salad of chopped herbs, lettuce, onions and cucumber.  Shwarmas look good too.  Clean, tasty, fresh.  Prices are decent, similar to better fast casual chains.  A real welcome addition to downtown.  If you live nearby or are shopping downtown, this is a great new option.  I wish them the best of luck.", "author": "Sandra B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "I was in the area for a conference at the Marriott, and this place was a great escape for lunch! The service is great, the employees were enthusiastic about answering questions, and the food was delicious! I had the kofka wrap. It was very tasty, and worth the 5 minute wait.", "author": "Jim C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-09", "description": "The food is Turkish for the masses. There is far, far better Turkish and Middle Eastern/North African Food in Brooklyn: Karam, Kotti, Pita Palace, La Goulette, and Tacis Beyti.", "author": "V J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "Finally a good halal spot near City Tech. The place is clean, the food solid, and the staff is nice. I had the falafel sandwich with hummus. I will definitely come back here in the very near future.", "author": "Amanda P."}], "servesCuisine": "Mediterranean", "priceRange": "$11-30", "name": "Doner Kebab NYC", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "34 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/yQse9LrPx9fxyb5dxOh1pQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182223434"}