{"aggregateRating": {"reviewCount": 147, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "Stumbled upon this on ny Eve from out of town on the way to a church service at Brooklyn tab. Excellent beef lamb gyro with all the toppings!!!! Fresh and hot fries. Staff very friendly and nice. Bathroom clean. Would highly recommend this place!  Got served quickly and everything very clean. Excellent!!", "author": "Christy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "This place is a GEM in downtown Brooklyn. The meat is super clean, not oily or dried out. I've had the chicken, lamb \u0026 beef, and they were all excellent. The meat had absolutely perfect flavor. The rice pilaf is some of the best I've ever had also. All of the sides are super fresh, and the portion size is great. The space is modern, bright, and extremely clean. This establishment is a can't miss for either lunch or dinner.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-02", "description": "I liked the owners (husband and wife) who were working hard. Some of the workers are just working frantically and never failed to give me something different than what I asked for. Food is very average . However don't get rice - instead of using regular natural rice they use some sort of parboiled rice type that are plain gross.", "author": "Nina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "Solid spot. True middle eastern food. Family business, fresh food and affordable. Definitely part of the rotation going forward.", "author": "Food Jerk X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-28", "description": "It's a ok place for gyro and wrap needs.  Not as great has I thought it would be.  Not going back unless it's the only restaurant open in the area.", "author": "Food P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "I have tried middle eastern food all over the city and this is now one of my top three. Their food was fresh and tasty and they have a perfect sized bowl. The people working here are very nice, they will also grill your köfte as you order.", "author": "Santiago S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "really good and fresh food. and the staff here is so unbelievably friendly and helpful -- they made my day!", "author": "Trish P."}], "servesCuisine": "Mediterranean", "priceRange": "$11-30", "name": "Doner Kebab NYC", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "34 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/yQse9LrPx9fxyb5dxOh1pQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182223434"}