{"aggregateRating": {"reviewCount": 147, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "My supervisor has gotten lunch from here a few times and she raves about how good the food is, so I decided to stop by for lunch. \nIt's small, the lines can be a bit long, but it goes quick.\nI wanted to try the falafels, but they're not gluten free. So I decided to get a chicken bowl; which consisted of rice, chicken and various toppings such as onions, Israeli salad, red cabbage, onions and lettuce. \nThey have a few sauces as well. The rice was perfectly cooked. The chicken was tender and well seasoned. The various toppings went well with the meal. \nAll in all, this was really good. The service was great as well, they were patient and helpful with my questions.", "author": "Shaima C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-18", "description": "Right around the corner from our hotel we found this little gem. Very reasonable and clean. We ordered a wrap with beef and lamb. The wrap was  basically a large tortilla that they threw on the griddle for a few seconds to brown a little bit. \n   You choose your own veggies and we went with the pretty standard LTO and pickles. We had them put their homemade yogurt garlic sauce in the wrap and had a small side of their homemade hot sauce on the side. \n   I'm just gonna day that this was one of the best bites I had the whole week. The meats were both juicy and tender a and I got several pieces of lamb that had crispy edges. Yummm! The lamb had great flavor and wasn't muttony tasting as sometimes it can be. Veg was all fresh, and that yougurt garlic sauce was outstanding. The hot sauce was not that hot and complimented the wrap. If you are near this place it is for sure worth the trip. Clean, and very friendly staff.", "author": "Terrell B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-24", "description": "yesss finally a affordable amazing middle eastern \nfast causal place! \n\nthere are a lot of good sitdown restaurants but sometimes you just want to eat alone after a long days work and chill \n\nthis place has amazing food for the price and comfortable seating area for single persons\n\nthe price was around 13$ for a huge platter \nso much food for one\n\nalso their white sauce is FLAVORFUL \ntons of garlic and spices \n\nI will be back!", "author": "Andy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-19", "description": "Very delicious beef and lamb wrap with everything esp the sliced banana peppers \u0026 jalapeños. It's a bustling lunch line that moves quickly. Can't get over the charred crispy ends of the meats that jus puts a wrap over yummy to delish! (And they are generous on the meat)", "author": "Elisa H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-13", "description": "Very disappointed at the new guys they hired. H was so stingy with the sides, plus he hands were so dirty. My wrap was like a 1/2 wrap. Price went up but portion is smaller? Make sure the mexican guy is the one adding your add-ons and sauce. They put like 3 drops of sauce on my wrap. When I asked for me he put 3 more drops. I think I'll go to cava from now on", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-04", "description": "When I saw 15 take away bags down the street it was clear that I needed to go there. Surprised that even during the lunch hour, I had trouble getting a place to sit. Really enjoyed the fresh and delicious meal.", "author": "Tim K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-09", "description": "Pretty quick and easy\n\nI dropped by Doner Kebab as a \"healthy\" option. I say \"healthy\" because I was about to go to either Shake Shack or Burger King. \n\nDuring this visit, I had the lamb and chicken doner bowl, and I was pretty pleased with the food. Was it amazing? No. But, I was not going for amazing (as you can see above, I was about to go to Burger King). My visit was on an early Sunday afternoon, and there were about two other people in the restaurant so there was no wait. For my bowl, they pack quite a bit of food. I would say that one bowl is enough for two people or for two separate feedings. My large bowl and with bread was about 13 bucks. Not too bad for a quick lunch. The environment of the restaurant is pretty chill and, mostly importantly, clean. My only small compliant is that the restaurant was kind of cold. I belive that the back doors were open because it was plenty drafty inside.", "author": "Kwame S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-23", "description": "Clean restaurant. I went during lunchtime and thought there would be a wait but the employees work fast which is great. I was helped almost immediately and ordered the lamb doner on a bowl. You get to choose between about 4-5 different meat and then you can chose what veggies you would like on the side. It was really good, meat was nice and tender and fresh. Also you can chose if you want bread on the side which i HIGHTY recommend. Turkish bread is AMAZING it's so soft and delicious.", "author": "Shabnam D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-14", "description": "Simplistic, fresh and very satisfying is how I'd describe Doner Kebab. You get your meat and veggies over rice or you can get your sandwich that's afew dollars cheaper . I like rice so I went with the chicken bowl about 13 bucks .They really pile on the cheaper veggies and rice and leave you to fend with the limited and very cleverly ,extremely thinly -sliced pieces of chicken .The amount of meat per portion should be greater which is one of the few ,less than perfect things about this restaurant. As I found myself with about 1/3 of rice and veggies left and no meat. So did the wife's meat portion btw. That issue , along with their very sub par bread and their pricing ( you pay extra for hummus ) sorta turned me off . When compared against the likes of skewr kebob in the city for eg which offers hummus for free, better bread and more variety, ends up clouding my vision of ever seeing this place worthy of its five stars .", "author": "Kern C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-29", "description": "We came here from the city following a recommendation. Well worth the trip since the food was delicious, quality was markedly high, doner is authentic.  Great job Doner Kebab NYC.", "author": "Timur O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-23", "description": "This place is sooo good, every time I am in the area I must eat here. Food is delicious, hot and fresh. Staff is very friendly and line moves quick.", "author": "Laurie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-16", "description": "Delish Doner chicken sandwich. They put a heaping amount of the chicken and everything I put on top of it was very fresh. The bread being warmed first was also a nice touch. I would suggest more drink options. They were very limited on juice options. Otherwise a very solid choice if near the Jay Street Court House area.", "author": "Mickei M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "Good spot for lunch in the area. Definitely higher quality/ fresher produce than street guys. \n\nThe falafel was made to order and was really good. White sauce red sauce are good. \n\nLine moves fast, service is good for a fast casual environment. Good seating, spacious, pretty clean. \n\nGive you a nice thick pita bread too. \n\nGot exactly what I wanted, comfortable warm spot to enjoy falafel and rice.", "author": "Howard C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-25", "description": "Every time I come here there is a long line. And for good reason too. Their chicken doner is tender and packed with flavor, probably the best chicken doner I had in nyc. The rice is fragrant and they have a great selection of fresh vegetables. I really enjoyed their hot sauce which goes perfect with the chicken. It's a bit on the pricier side but well worth it.", "author": "Phil L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "LOVE DK NYC. \n\nDoner Kebap (or Kebab) is TURKISH (street food) folks. Not Egyptian, or Syrian, or Yemenese, Algerian, Moroccan, or any other version of TURKISH. So most of these reviews comparing this spot with Halal Cart/Halal Guys (which is all hype by the way) are to be ignored. \n\nIt would be fair to compare Doner Kebab NYC with Kotti Berliner Doner Kebab, which is located in Dekalb Market Hall. However, I think Kotti is 3 stars at best. Kotti is replicating the Turkish immigrant Doner Kebap carts which are ubiquitous throughout Germany. Their accompaniments are fine, but the meat there is bland. \n\nNow back to Doner Kebab NYC. It is fresh, flavorful, juicy meat with 'the' rice that reminds me of Iftar dinners at the Mosque from growing up. I adore their hot peppers and the yogurt sauce and hot sauce are the absolute best that I have had. I prefer the bowl because of the white rice (see above). \n\nIt's my new lunch spot, for reals.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-18", "description": "Very good food and very clean.  Service with a smile in this high volume restaurant.  It's not fast-food but it is fast.", "author": "Tommy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-21", "description": "Such a great experience. The staff were super friendly and the food is so FRESH and delicious. I ordered the falafel with hummus in a bowl. It also came with rice AND a side of pita.... I paid $9 for a meal that would've been $15+ easy at other \"make your own bowl\" type of restaurants. The veggies, salad, and other toppings were all added at no extra cost. My favorite part: the falafels were made fresh to order. It came with six pieces. It's so much food I had leftovers for the next day. \n\n\nAlso, it's super clean and bright inside with lunch table seating. The bathroom was clean too! I can't wait to try other stuff on the menu like gyro sandwiches!!!", "author": "Sohee C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-28", "description": "One of favorite places in Dekalb market. Generous portions of meat, will not go hungry. Fair price for rest of dekalb. Food always tastes fresh and great. Highly recommend stopping if in dekalb.", "author": "Robby A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-11", "description": "The staff here are incredibly helpful. It's almost as if they know everything. The night time cashier Akobirhon is a neuro-psychologist.", "author": "Ryan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "It's like going to a halal cart, but with better vegetables and a much smaller chance of a bacterial infection.\n\nThe fast casual explosion is slowly taking over Downtown Brooklyn, and if you work in the area (especially if you're up on MealPal), you probably already know about Doner Kebab. \n\nThey offer up tasty, balanced combos with generous portions of meat and all the different colorful options that make for a great lunch.\n\nPersonally, I haven't strayed from the chicken and lamb bowls/wraps/pitas, but I don't know why you would. Well-seasoned and spiced, the flavors are big, the delicious meats are carved off a vertical spit (my favorite thing meat can be carved off of), and they are fast and friendly.\n\nIt's one of the best lunch options in the area.", "author": "Peter D."}], "servesCuisine": "Mediterranean", "priceRange": "$11-30", "name": "Doner Kebab NYC", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "34 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/yQse9LrPx9fxyb5dxOh1pQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182223434"}