{"aggregateRating": {"reviewCount": 147, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-26", "description": "This is based on the food and workers. I walked into the place at 1120 and upon walking in I was greeted with stares. As if I had a giant penis drawn in my face. I asked if theuopened because if u comfortable I felt, they said no and open at 1130. I didn't make a big deal so I was walking away. They shouted \"hey lady\" first  at me for me but then a worker stopped and stated they can take my order.  I wanted something relatively healthier being this area lacks it. I ordered a chicken rice bowl. The chicken was hard and the texture was weird. Almost as if it was fake. I thought the spices of it will mask it but the chicken lacked flavor. I asked for hot sauce and white sauce. That didn't taste like anything either. The decor is nice and simple sure but the service and food isn't the best. For 14$ I could've spent my money somewhere else.", "author": "Chicken F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-15", "description": "Yum. Visiting my sis at NYU and stopped over this space as it's conveniently in walking distance.\n\nI like that the menu is easy and limited. I kept going back between a bowl and a wrap, and the associate was super friendly and patient with my indecisiveness, even with it being the end of the day. He guided me through the suggested fillings and kept the process fun, overall just loved the kind and comfortable vibe in this space. From service to presentation, to food quality. And, they have fries! Wrap was tasty and perfect in size, will go back to try the bowl next time.", "author": "Nisha S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-10", "description": "Good addition in the town with delicious food.\nGrilled yummy meat and fresh salad.....awesome.", "author": "Fahed W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "I absolutely love eating here. It's always consistent. Staff is hard working honest and very friendly. Food is fresh and reasonable. My friend got me hooked to this place and I thank him every time I see him.", "author": "Harun K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "Great doner lamb and chicken. Make sure to get the tasty french fries too. Its a really hip spot. The hot sauce is addicting!", "author": "New Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-06", "description": "Even before I talk about the food, I saw something pretty gross. There was one worker who was aimlessly walking around, had his hand on the door to the entrance, and he did not wash his hands after. He was not serving anyone and seemed on his break or something. BUT he reached into the fries container (where they mix the fries with salt and falafels) with his BARE hands!!! Just picked one up and kept asking the other server if the food was for him. I had ordered the fries but needless to say, I did not take them. The other servers had their gloves on, but for a server to reach into a communal dish with his bare, unwashed hands, and then for them to expect to serve it to other people, that is disgusting for a commercial food establishment.", "author": "Tanya T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-22", "description": "Highly underpriced!  I'd pay an extra $2 easy and so would pretty much everyone staying on these long lines.  This place is amazing.  Best place to eat in the area.  Amazing food.  A+++++.  Lines are outrageously long because food is amazing!", "author": "Abe M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "I've been here twice and the overall experience and food was amazing both times! I personally prefer the bowls --you can pick out the meat , rice or no rice and choose veggies. The last time I was there , I wasn't sure I wanted the hummus and the gal behind the counter was kind enough to give me a tiny bit to try. Love the attentive , kind staff there!", "author": "Happy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "I had the chicken kebab bowl it was freshly served.   The baba ghanouj and hummus was amazing. I would definitely recommend everyone to try it out", "author": "Tasia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "This is the best vegetarian spot in the area. Fresh and crispy falafel and fries. The staffs are very friendly.", "author": "Achyut T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-29", "description": "Doner Kebab is brand spanking new, and has a lovely clean and modern decor. I felt the food was not as flavorful or as good quality as it could have been. I had the beef and lamb bowl. I felt for almost $12, the portion was very small and that it was also more beef than lamb. There were several pieces of fat in my bowl that I had to spit out. The meat itself was not that flavorful. I think I would have preferred to eat from a street cart for $5.  What DID really shine here, versus a street cart, was the salad. You got to pick and they had a very nice and flavorful cabbage. The salad options were crisp and appeared fresh. I think I would try other options in the downtown brooklyn area before returning, but Doner Kebab is a solid option if you are in the immediate area.", "author": "Sharon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "I had the Chicken Doner with white sauce and veggies. So good and fresh and healthy! And the staff was super friendly.", "author": "Kathryn H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "Very fresh ingredients and flavorful meat. Not at all greasy and the quality of the ingredients really comes through. Really nice staff. This will be a lunch time staple going forward!", "author": "Noelle K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Found this place on a whim, the food was very good. I ordered a Falafel with Hummus and Rice with salad and Red Cabbage.  I loved the Red Cabbage, it was tasty. The Hummus and Rice complimented each other,  the falafel was a little dry but overall the meal was good for the price.", "author": "William C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "This place is amazing! Incredibly well priced, fresh delicious food, and a friendly staff to boot. Highly reccomend!!", "author": "Sophie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "It's is the best !!!! I had Adana kebab also lahmacun . It was so goooodddd!!!!  Also I had desert ,it was good too.  Service is really fast and the food is really good.", "author": "Gamze A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-07", "description": "Delicious fresh Mediterranean Cruise. Definitely will be back soon for a fresh meal. Extremely tasty and good  prices.  Staff was friendly, efficient and establishment was clean.", "author": "Tes T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-27", "description": "The food really was fresh. I had the beef and lamb sandwich with the additional veggies. They really did put a nice amount of meat inside so you feel like you are getting your moneys worth in that aspect. I got my order with a side of fries its was 2.50 and really wasn't a proper amount for the price and that is where I take a star off (would take half if possible). Lastly I would like to add is the staff is very courteous and makes you feel welcome which is just as important as the food.", "author": "Richard G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "There is a magic to the falafel sandwich made in Berlin.  My favorite is a chain called Habibi.  This falafel sandwich is probably the closest to that Berlin falafel I have found in NYC. Awesome baclava as well!", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "Went for lunch, a little busy, but well worth the wait! Got the chicken doner bowl, and was the probably the best chicken I have ever tasted!!! Staff is friendly and quick. Yogurt sauce was amazing too!", "author": "Kelly K."}], "servesCuisine": "Mediterranean", "priceRange": "$11-30", "name": "Doner Kebab NYC", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "34 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/yQse9LrPx9fxyb5dxOh1pQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182223434"}