{"aggregateRating": {"reviewCount": 147, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "I had the falafel bowl and loved every bite - service was super friendly too! Will be coming back soon!!", "author": "Brittany D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Juicy chicken, fresh veggies, speedy service, and nice seating area.  Place gets crowded during lunch but the line moves really fast.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-26", "description": "A cleaner and \"healthier\" version of those halal carts around. It's usually is quite filling. Can ask for the white sauce if you want it to be a bit tangy.", "author": "Abhichandra R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Fresh and delicious. Kid, as he wolfed down a chicken hummus wrap, made the \"yum yum\" noise he makes involuntarily when he's eating something he REALLY likes. Can't beat that.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Great quick bite place that serves delicious and fresh Mediterranean food. It was so good that I didn't have a chance to take a nice picture of my falafel.", "author": "Inna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Happened upon this little spot while searching for something a bit healthier than the other fast food places around. I'm extremely happy I found it!\n\nYou have the option of getting just a sandwich or a bowl.  I opted for the bowl and the staff was very friendly and helpful. They even let me sample both the chicken and lamb doner as I couldn't decide.  The bowl comes with either rice or fries and you too with your veggie options. I'm doing keto so no rice or fries for me. They were happy to give me just veggies and let me pick. I had to go with the lamb but the chicken was just as good.  They also have chicken shish kebabs, kofte and falafel as other protein options.  \n\nI can't comment on the fries, rice or pita as I didn't have it but everything was delicious! I do hope they open a location in Manhattan or even Queens as this would be a nice option to have.", "author": "Lanie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "You're damned if you do and your damned if you Doner. Actually you are damn silly if you pass by this place and don't try their lamb and beef pita or platter. Crispified to a glorious outer crunch, shaved as thin as the mighty blade will allow, and then smothered in a heavenly yogurt sauce. There is nothing wrong to profess about Doner Kabab. They have won my heart in the Turkish dish market.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-23", "description": "Very pleasantly surprised, I passed by this shop on the way home from school and decided to try it. Glad I did. I am used to the regular halal food that we all love from those carts littered around manhattan but I gotta say this is way better. The food has a way fresher taste and way less greasy. When I am in the mood for some good lamb, rice and chicken I will definitely be coming back. Highly recommend it. It was also fairly packed but they move the line along pretty effectively so it's a good option even if you just need a quick bite.", "author": "Ricardo G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-12", "description": "Stumbled across Doner Kebab while walking to the train and I'm so glad I stopped in.  I was immediately greeted by three smiling faces and happily noted the incredibly clean establishment. It has a chipotle-style theme - pick your meat, sides and sauce as you work down the line. I took the staff's advice and had their special of the day, turkey and lamb. I've never seen turkey and lamb as an option before and was a little hesitant to sway from the usual, but the staff was so friendly that I couldn't say no to them. I'm so happy I took their advice! Meat was so tasty, not oily and tender. The rice was perfect and the sides added great color, texture and flavors to my bowl. The whole meal was under $10, pita included!!\n\nI also chatted with the staff as I was ordering. They said they've only been open for three weeks but I would have never guessed from their professionalism, cleanliness and overal operational flow. I really hope they do well. I would definitely stop by again whenever I am in the area!", "author": "Anna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "One of the best doner wraps I've had in a very long time. The meat is succulent, the veggies are crisp. Amazing home made pickled cabbage. Beautiful space. All in all, a great addition to the neighborhood.", "author": "Mark M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-05", "description": "I stopped by this place on a lunch break and had a quick chat with the owner. He said they have been open for about three weeks. He was very kind and excited to have his restaurant open. \n\nDefinitely a fast-casual ambiance. Restaurant is clean but sparse, with a few communal tables. Feels like a Chipotle - you order at the counter and go down the line telling the server what to add to your meal. You can get kebab served as a pita sandwich or in a bowl. They also have falafel as a vegetarian option.\n\nI was really impressed by my lamb and beef sandwich. Meat was really clean and flavorful; sometimes kebab can be too greasy or too dry but this was neither. The hot sauce added to the meal without being too spicy and all of the topping options looked fresh - I got lettuce, tomato, red cabbage, and hot and white sauces. A couple bucks more than my local falafel / souvlaki stand but much better in quality.\n\nI hope these guys survive. I would make it a common lunch spot if I lived nearby.", "author": "Charles S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "Love this place !! Food is authentic and tastes so good . Love the chicken gyro wrap and fries !! Workers and owners are polite and welcoming !! I could eat there every day if possible", "author": "Soner O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "If you enjoy Mediterranean food, this is where it's at.  I got the chicken doner bowl.  It came with rice, a bigass pita, assorted pickled veges, and chicken right from the giant rotating skewer.  The meat was juicy and tender much better than your average chicken.  The veges were crunchy, flavorful, sour but not overwhelmingly sour.  The contrast between the salty rice and chicken with the sour veges was next level.  Everything about this meal was amazing.  Oh and be sure to add Hummus for an extra buck.  Will definitely come back, not sure how I did not find this place sooner...", "author": "William N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "Wow. This is really delicious! The chicken smells just as great as it tastes. Great addition to the neighborhood. Also, they are more than happy to do no carb options. \n\nWelcome!", "author": "Mike P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-01", "description": "This place. This place is awesome.  Everything is so fresh, so yummy and they totally give you your moneys worth. You know it's great because the place is so clean and the owner is almost always on site. \nIt's like the chipotle of Turkish food except it's healthy. ;-). Just try it - it's worth it.", "author": "Jaybird N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "This place is EVERYTHING  I've loved every single thing I've tried. My favorite is the Doner Chicken bowl with brown rice, hummus, all the veggies and feta of course. The bowls come with a free pita and it's a large portion of food, usually good for two meals! The falafel are delicious also and made fresh to order. Can't go wrong here!!!", "author": "Meghan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "I've been on a 32 year search for the best falafel and I found it here... \n\nI move from city to city for work and was so excited to find Döner Kebab in Downtown Brooklyn, I couldn't recommend them enough! You can actually taste the parsley and cilantro...  Makes my mouth water just thinking about it... ;)", "author": "Annie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "Delicious, friendly staff, decently priced. Spicy, not spicy, however you want it. What's not to like?", "author": "Brendan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-05", "description": "Food was great! Big portions, great staff, cool spot. I got a steak donner and it was on point! They were closing like in 20 minutes and had a great attitude still. If your a tourist or a local I recommend this spot for a night or mid day meal. Only con is that the food is pretty expensive and maybe not justifiable for the price, if the food was about $4 cheaper it would be perfect. \n\nBiggest PRO's:\n- Clean facility \n- Great Staff \n- Cool vibe \n- Excellent food\n\nCONs:\n-pricey food (I paid $14 myself)", "author": "Jonathan C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-21", "description": "Grabbed pick-up for lunch. The service was good, although it was fairly empty so I can't speak for what it's like when they're busy. I got the beef and lamb bowl - the meat was a bit dry and bland. The sauce (I got both red and white) didn't add that much to my bowl either. The pickles and vegetables were fresh and enjoyable. Overall, I was underwhelmed - which surprised me because of the good reviews, but I can't say I'll be tempted to visit again.", "author": "Jennifer C."}], "servesCuisine": "Mediterranean", "priceRange": "$11-30", "name": "Doner Kebab NYC", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "34 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/yQse9LrPx9fxyb5dxOh1pQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182223434"}