{"aggregateRating": {"reviewCount": 147, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-03", "description": "Grabbed a falafel platter for a quick lunch while site seeing in downtown BK. The restaurant is pretty cute and has some nice seating, but the food was lackluster. The falafel was freshly fried and I enjoyed that, but all the other toppings and pita were super bland and the toppings weren't very generous for price. Not sure if this is just a different style of middle Eastern food than I'm used to, but none of the veggies (cabbage, cucumbers, etc) had any seasoning or dressing, they were just raw and chopped up. It ended up being a dry and flavorless platter, made palatable only by the white sauce and highlighted by falafel.", "author": "Natalie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "I absolutely love this place! Although it's twice the price of the halal food from the trucks, the taste is so much better. The fries were hot and crispy. The pita bread was delicious, especially with the spicy sauce. The hummus was really good as well. They give you a lot so I think it is worth paying extra! Would recommend this place to everyone.", "author": "Rina I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "If your in this area and need good food fast this is the place. I had the beef lamb combo with rice and cucumber salad and it was delicious. Beef and lamb were moist and tender and all together it was the perfect meal at a great price.", "author": "D M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-30", "description": "The beef and lamb doner bowl is usually my go-to item on the menu. The portions are just right and the food isn't too bland or too salty. It rests perfectly in between. I can't complain about paying $10+ because it's worth every penny. The line is pretty quick although I never went during the typical lunch hours.", "author": "Vincent S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-25", "description": "Try this place out. \nGreat healthy options and great service. It's like a Chipotle but Mediterranean style. I wish they had more options. Platters are a bit pricey, $10 for meat and $8 for falafel. Also most of the sandwiches are $8. \nGiving it four stars because of the friendly service and the healthy options. But if you are looking for cheaper options, there are halal stands everywhere.", "author": "Yasmine E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-05", "description": "Took them a half hour to realize that they would not be able to deliver my order.\n\nIn all honestly, Berliner Kebab in Dekalb Market blows them away. Save your time and go there. That's what I'm doing.", "author": "Andrew V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-24", "description": "Had me a delish doner plate for lunch here at Doner Kebab NYC.  The chicken was very juicy, and the portions are large.  I loved the white sauce that came with it.  Space was really clean, and the prices were on par w Brooklyn Heights area at lunchtime.   There are a few bar tables and stools if you want to dine in.", "author": "Crystine W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "Went here after a doctor's appointment and got the chicken shish kebab. The chicken was moist and I loved the garlic sauce they put on top of it. It was not your typical tzatziki but something special with a real zing. The salad ingredients were very fresh and the rice was delicious. I left quite satisfied and quite full! Staff is friendly and there are long tables for seating, great for bringing your laptop and getting some work done. Will definitely be coming back on my next journey to the area.", "author": "Sam E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-18", "description": "A friend of mine and I went on Thursday around 6:00pm and it was empty, after trying the food I was surprised as to why... it was really good! At DK NYC, you essentially choose what protein you would like in either a pita, wrap or a bowel and then you choose your toppings and sauces. I opted for a beef/lamb wrap. The meat was seasoned well without being overbearing or salty. The place looks nice and has good seating.", "author": "Naomi T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Went for the first time last weekend. I grew in the area and realized that the other spot wasn't there anymore. \n\nThe food was amazing - I had a rice bowl w/ Chicken. I've tried a couple other spots with similar bites, but this spot tops them ALL. I work in FiDi so I'll definitely hop on the train and take it two stops just to have Doner Kebab...finger licking good!", "author": "Chanique S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "The best gyro in town. Falafel and salad are really yummy and delicious!!! They used real meat for gyro !!!I I love this place.", "author": "Andrew R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "Friendly staff, seasoned meat and great portions. Clean and quick Greek spot when in a hurry.", "author": "Christina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-23", "description": "An upgrade version of Halal Guys. If you like food truck but doubt about its sanitary condition, come here to grab your workday lunch!\n\"Doner\" is the \"meat pile\" cooked in the grill rack. For meat, they have lamb\u0026beef combined, and chicken. For protein, you can choose rice or pita bread. \nWhat I really like about this place is their meat. Unlike the cold and hard chicken and lamb from food trucks, their meats are fresh, tasty, and well cooked.\nThe environment is clean with wood table and seat. The server here is very friendly. To sum up, it's a great experience.", "author": "Bingdi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "I highly recommend this place as a healthier option for lunch. I've eaten at more Mediterranean, build your bowl places than I can remember, and while nothing can come close to dear old Roti, this place doesn't disappoint. \n\nYou can get either a wrap (in a pita) or a bowl (with fries or rice), and the bowl costs between $8-$11 and is $2 more expensive than the wrap. I stopped by during the lunch rush but the place wasn't really full, and the line still moved slowly. The staff isn't very organized, and they kept bumping into each other while getting orders, thereby slowing down the process.\n\nI got the chicken doner bowl with rice, ALL of the vegetable toppings (they're really generous with the serving size!), and a splash of both the spicy sauce and the garlic sauce. The chicken was so well sliced, juicy and cut into just the right size. The vegetables weren't all seasoned and were hits and misses. The sumac onions, the pickles, and the onion, tomato, cucumber salad were worthy additions to the bowl but pretty much everything else was just filler. The sauces were A-okay, neither very garlicky nor very spicy. The rice was kind of watery and bland. I skipped the pita. Also, there are no soft drink dispensing machines, only cans which are obviously overpriced.\n\nA healthy, wallet friendly option for lunch!", "author": "Shivani P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-14", "description": "I had beef and lamb doner with rice with all the veggies and both sauces. A fairly good size portion, the meat was rather bland but the sauces helped. Friendly staff and the place looked clean. Not bad but to be honest I'd rather get food from the Greek Xpress, which is 1 block away, or Chipotle, which costs less and is tastier.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-08", "description": "After moving back to the USA from Germany I've been on the HUNT for good döner! This place was AMAZING! I felt as if the price was so reasonable for the amount of food we received. Flavor was so fresh and it truly hit the spot. I would only recommend that the staff drizzles the sauce more evenly so it reaches the bottom of the sandwich.", "author": "Zoë M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-18", "description": "so far this was best meat that i ate at a fast food place. inside is so neat and lovely workers. definetly will come back again, thank you for the food.", "author": "Caglar C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-30", "description": "Doner Kebab is a solid lunch time option not far from my office.  They are reasonably priced, you get a good portion of high quality food.  I usually get the lamb and beef bowl with brown rice. Their hot sauce and yogurt sauce are both very good.  Their pitas are also very good.  I like mixing my bowls up and then throwing some inside of the pita before having at it.  I tried the lentil soup on my last trip in and I didn't particularly care for it.  If you're in the area looking for some quick quality eats head on over.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-30", "description": "I really wanted to like this place more than I did, but the quality of the food is just not there. Overall I feel like everything was just kind of bland. Mediterranean food is supposed to be packed with flavor and Doner's just isn't. It's also kind of expensive, though I guess their pricing is in line with a place like Chipotle. On the plus side the restaurant is very clean and the service is fast. I love the idea of having fast casual Mediterranean food, but they need to be more bold with their seasonings.", "author": "Devin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "This place is great;\nGreat food made by great people who actually care about the world is what you get when you come here.\nI had the chicken shush kebab pita sandwich and it was great,\nI reccomend the garlic yogurt sauce and sumac onions \nFries were great\n\nOnly reason it wasn't a 5 star review = no soda refills, only cans... but better for me because I couldn't refill endless times.", "author": "Seriously D."}], "servesCuisine": "Mediterranean", "priceRange": "$11-30", "name": "Doner Kebab NYC", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "34 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/yQse9LrPx9fxyb5dxOh1pQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182223434"}