{"aggregateRating": {"reviewCount": 86, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "I got the crispy chicken rice bowl and I really enjoyed it! The chicken was crispy on the outside and super tender on the inside. It was also very flavorful with the salt and pepper seasoning, but it can be a little too much without the rice to complement it. \n\nAside from the food, the owner was super friendly and personable. He made an effort to learn everyone's name--you can tell based on his interactions with repeat customers. He engages with everyone to ensure that they have a pleasant experience. Honestly, one of the best and friendliest customer service I've ever experienced. The price can be considered to be little bit on the pricier side at $12 but it is pretty standard midtown pricing. I would definitely come back based for the customer service alone so definitely doesn't hurt when the food is good too!", "author": "Danny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-07", "description": "Can never go wrong with having lunch from Yumpling! Just wish they weren't always sold out of the beef bowl....\n\nChicken bowl is amazing!", "author": "Ashley R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-04", "description": "Yum.. are you kidding me? I just had the one of the best dumplings I've ever had! Perfectly pan fried on the bottom, filing has great flavor and the mildly spicy sesame cilantro saucey stuff is perfect. Oh, and they are nice too :)", "author": "Dee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "I have had both the chicken sandwich and the dumplings. Both dishes tasted great and you got a lot for the money.\n\nAlso, the truck cashier is cute AF.", "author": "Matt C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "Love this truck! Yumpling has easily become my weekly lunch staple. My coworkers and I would walk together to get this from the Rockefeller location every Tuesday and Thursday. There's always a line of 30+ people on queue before me when I go during lunch. Today we had the idea of getting there before they open at 11:30am. We arrived at 11:26 and there were already 10 people on line with the same idea. I tried the chicken sandwich, chicken rice bowl, dumplings and the braised beef bowl. I have yet to try the eggplant, perhaps I'll try that during my next visit. The chicken sandwich is made with dark meat and comes with a delicious basil green sauce. The braised beef is cooked very well, the meat is tender but I wish there was a bit more meat sauce on it. I will definitely come back for the chicken sandwich next week!", "author": "Jamie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "Suchhh good food! The dumplings are perfect - a little chewy, a little crispy, not too salty, not too sweet, super juicy. The lines are usually long (worth it), but it goes by pretty fast. Service is A+, as well!", "author": "Catherine K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "I was taking a walk towards the west side pier when I noticed a line of people waiting for a food truck, also noticing that none of the trucks next to it had anyone waiting on line at all. I decided what the heck, let's give it a try. I ordered what looked most appealing to me, the fried chicken burger and dumplings. I'm not the type to really get impressed that easily, but the chicken sandwich was outstanding. It was super crispy, juicy, tender - and was well balanced with scallions and greens. The dumplings were also phenomenal, juicy, and crazy good flavor. The service was also great as well, as the staff were super friendly. I would definitely recommend Yumpling!", "author": "Brian T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "I've only had the dumplings, but they were awesome. Juicy, plump, flavorful, just really on point. Sucks that by virtue of being a food truck, they're always not there when you want/need them, but you keep playing hard-to-get, I'm into it.", "author": "Chef B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-26", "description": "I saw a long live form about noon. So after my event we decided to see if the food truck was there at 2pm on 49th St. Everything was sold out except the dumplings (good thing I wanted dumplings. Lol) We ordered two large orders (12 dumplings in a large). They were nice and crispy on the bottom and covered in sauce and scallions. I dipped mine in sriracha too. Yum-meeee  (Next time I want to order the chicken. When the chicken ran out, many people left the line. But the beef and eggplant sold out first.)\n\nBtw - the guy who you order from is super friendly and super nice.", "author": "Theresa Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-10", "description": "Probably the nicest people in nyc first off, second off it's a great price for your food. The entrees are huge and the chicken bowl is CRISPY with amazing sprinkled in", "author": "Anna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "One of the most delicious food trucks I have tried in a long time. Pork Garlic \u0026 Chive dumplings are a clear winner here, your tastebuds will thank you! Their fried chicken and veggie eggplant options are also very delicious.\n\nThe service is also excellent, the guy in charge remembers all his customers and is very friendly (sometimes overly friendly :)) which is so refreshing \u0026 rare for this great city of ours. \n\nDefinitely warrants a repeat visit.", "author": "Irina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "Chris is the owner/man behind the window and he could be serving rats on a stick and I would come back every day he is SO nice. Luckily he serves amazing food which is also a great reason to be a loyal customer. I got the fried chicken sandwich and it was like a chick-fil-a sandwich on crack with an Asian flare. I could also go swimming in the green sauce that is on it. 10/10.", "author": "Torey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-05", "description": "I decided to try this today, the service was REALLY friendly. I've never seen anyone smile so much, not that it's a bad thing. It's pretty refreshing tbh, nice change of pace from the typical \"grrr what do you want? how dare you ask me to get you a soda\" you get at alot of places.\n\n I got the braised beef with rice and cucumber/pickle. The braised beef was incredibly tender, it was on par with the beef texture you would get if you slow cooked it. The cucumber/pickle was really fresh and tasty. Their seasoned egg was not bad, unfortunately i don't get excited over hardboiled eggs. To me, the prize was the beef. Definitely worth going to again.", "author": "James B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-09", "description": "Here's the deal. I have been to many food trucks since they because a recent craze and far and away, Yumpling is my favorite truck. Since my first review, I have tried the entire menu. Food quality and original presentation, attention to detail, and outstanding customer service puts this truck in a league of its own. In my first review, I stated, \"I've seen the truck on 49th Street many times, but the 20-person line at 11:45 caught my eye. So I glanced at the menu and asked the nearest person, \"do they take cards?\" and he said \"Yes, and it is worth the wait.\" So I got in line and am happy I did. Tried the Crispy Chicken Rice Bowl with Edamame and it was delicious. Good amount of food. Good price. However, the thing that stood out is just how friendly the server was. He seems to know all his customers and what they order, so when it was my turn he said, \"First time here?\" Well, I can guarantee it will not be my last. Except next time I am going earlier.\" Since then I am a weekly customer, ordering the best Dumplings I have ever eaten, and I begin to cue at 11:15 even though they open at 11:30. Tell Chris that Peter sent you.", "author": "Peter G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "Update: \n\nWent back for more dumplings - wow! He remembered me, saw my review, remembered I ate their the day before my review. Wow- he has really mastered the art of the dumpling AAAND customer service. \nSo good.", "author": "Heather G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-18", "description": "incredible food (highly recommend the crispy chicken rice bowl) and the owner is one of the nicest guys ever! \n\nIf you want the beef bowl, make sure to get there early- they sell out within 15 minutes", "author": "Claudia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "This is exactly what NYC needed.  An authentic Taiwanese style food truck that has amazing service, fast, and affordable.  Do yourself a favor and eat the lunch box and dumplings.  The biggest surprise may be the chicken sandwich which is unapologetically massive", "author": "Derek K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "Great food truck near midtown / hell's kitchen / rockefeller. \n\nI arrived towards 2:30pm so they were out of most things. The host was super friendly and was great at keeping everything in order and done quick. \n\nI had the chicken bowl and it was great. The chicken was dark meat, fried maybe a little too much for some (perfect for me), very crunchy, and super flavorful. \n\nI highly recommend them, I'd show up earlier than I did so there's more options to order.", "author": "Ethan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "As others have already mentioned, GREAT food and customer service! Tried the basil eggplant rice bowl today when I visited NY for a work trip, and it did not disappoint. I was going to get the fried chicken rice bowl at first, but since I'm a lover of eggplant I decided to give this a shot. It was delicious!! The eggplants are very nicely cooked and the portion is very reasonable. The red chili paste gives it just the right amount of heat. On top of that you also get some nice side veggies to go with it. I've had similar dishes before and it's usually a hit or miss. I'm happy that I decided to try it and am also glad that they're expanding to add a vegetarian option that's equally delicious. I'd even recommend meat-eaters to give this dish a try if you get a chance! I know I'd definitely get it again.", "author": "Christine Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "This food truck was outside my office building in West Village three times this week, and today it was calling my name when I was craving some Chinese food. I got the crispy chicken rice bowl and was pleasantly surprised. The crispy chicken on top of rice was juicy, tender, and NOT nasty chicken breast that I hate. Also whatever the pork belly sauce they put on top of rice was amazing. It reminded me of the Taiwanese braised pork over rice ( lu rou fan). Definitely a very solid lunch option and quite authentic Taiwanese food.", "author": "Lu H."}], "servesCuisine": "Taiwanese", "priceRange": "$11-30", "name": "Yumpling Food Truck", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "10020", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/lMRmUP6nJZJGeCtLrHV0_A/ls.jpg", "@type": "Restaurant", "telephone": ""}