{"aggregateRating": {"reviewCount": 86, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-06", "description": "Hands down the most delicious Taiwanese food I've had in NYC! I have had all the dishes on the menu (yes, I've been there many times, girl's gotta satisfy her cravings) and they are all absolutely AMAZING AF. \n\nMy favorite dish has got to be their dumplings, so juicy and bursting with flavor with every bite. The sauce it comes with just elevates it to the next level. As a self-proclaimed dumpling enthusiast, I can honestly say that no other dumplings in NYC compare to Yumpling's. I am drooling just thinking about it.\n\nMy next fav - Their crispy chicken sandwich. It is so freakin good! The basil aioli sauce complements the chicken perfectly and I can't emphasize enough how CRISPY the chicken is. The sandwich itself usually fills me up but if you are starving, you could order it with shoestring fries. It's the best comfort food!\n\nI love all their rice bowls equally. They are all perfectly flavorful and yummy! I love that they give you the option to choose a side dish (either cucumbers or edamame+tofu). Portions are huge too and super worth the price!\n\nLOVE Yumpling!!", "author": "Karen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-12", "description": "This was recommended by my friend, and since I was in NYC, I had to check this place out.  Plus, I'm Taiwanese so the food that they were selling were so familiar to me.\n\nSince they're a food truck, be sure to check out their IG page as they change locations during the week from M-F.  I went on a Friday lunch and there was a decent lineup, so I had a good feeling I was in for a good lunch, and right I was.  Yumpling's an identifiable red food truck, so the truck really sticks out.  \n\nI found the cashier there very kind, all smiles and very good at bringing in new orders while food-running the orders for those waiting (after they've ordered).  \nThey've only got 5 items on the menu but based on the 1 thing that I've ordered, I can only imagine that the 4 items were just as spectacular.\n\nI ordered the fried chicken rice bowl, which comes with a fried chicken steak, marinated cucumbers (or edamane beans if you prefer), a half soy sauce egg, mustard greens and a bed of rice, which comprises of a pork belly/meat sauce.\n\nOverall taste was just so good, everything on that dish served a purpose and balances out the entire dish.  You get the acid/crunch from the mustard greens and then the salty/savoury/fatty bits from the chicken steak and pork belly sauce.  And then the sweetness from the cucumbers (and extra crunch).  My only regret was that I didn't eat the dish immediately, because I was trying to find a bench to sit down and that took me at least 15 minutes lol.  So I take it that the chicken could have been crispier at the time it was served.  But regardless, chicken had perfect seasoning.  Also, small detail (or maybe a big detail) is that they had perfectly cooked rice, I can not tell you the number of times how food can taste amazing and then be completely ruined by the texture of the rice (especially when it's mushy).  This rice, just the right amount of stickiness to soak up the sauce and all the other flavours, but yet you can see the individual rice grains, and have a slight resistance to it.  I really wanted to go back and have more food, but you know...self control and all that. \n\nIf you're in NYC, check this place out, you won't regret it!", "author": "Alex C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-23", "description": "Loved it! There is pretty much always a line but it goes pretty quickly and is worth it. I arrived maybe 15 minutes after opening, and the beef bowl was already sold out - so get there before opening to guarantee getting the bowl. \n\nI ended up ordering the Crispy Chicken Rice Bowl (with cucumbers) for $12 and it was tasty with a decently sized lunch portion - enough for maybe 1.5 meals if you're not super hungry and a solidly large lunch if you are. Will definitely come back to try the beef bowl.", "author": "Judy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-02", "description": "Had them over in the DUMBO Food Truck Lot. The line was long, and after trying their food, I can see why.\n\nTheir portion sizes are pretty insane (not quite 2 meals, but definitely more than 1.5!). I didn't get their famous fried chicken sandwich, but the rice bowl instead.\n\nI subbed out the garlic cucumbers for the edamame/tofu \"salad\" and it was a good choice. Gotta get that protein!\n\nIt was basically a chicken cutlet fried katsu-style. Over a bed of rice that had minced pork mixed in! Really filling and delicious. Especially on a cold day.\n\nWill definitely come back next time they're around!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-02", "description": "Really good! Got the braised beef rice bowl with cucumbers. The meat is super tender and cucumbers are crisp. Good portion as well. They change their location every day (check their website for info) and open at 11:30AM, but line starts forming well before, so make sure you come early before the beef bowl sells out!", "author": "Susan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "The chicken bowl is their signature dish. The skin is crispy. The meat is juicy and savory. Rice is always good. The veggies are al dente and slightly bitter. Put is all together and you have a party in your mouth. The other good are also good. Dumplings from a truck... who would have thought such goodness could be so convenient. This truck is always busy and has a long line at least an hour before they open. And that's justified.", "author": "Agapito G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-27", "description": "The dumplings are delicious and surprisingly filling. My coworkers worship this place and although the line can be deterring at times, the food is well worth the wait, and twelve large fried dumplings with scallions for twelve bucks is a great lunch deal.", "author": "Trevor M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "I've heard about this food truck from yelp and a lot of my co workers. Everyone loves this taiwanese food truck so I decided to give it a try. The line is always long but it's worth waiting for! \n\nThe owner of this place embodies amazing customer service. He always has a smile on his face and is very sincere. He remembers frequent customer's names and always addresses you by your name! \nEveryone should learn customer service from the owner. He is SO nice. \n\nI ordered the fried chicken bowl ($12) with pickled cucumbers ($1 extra during the week I got it because of shortage of cucumbers). Chicken was crispy and flavorful. It wasn't greasy which is a plus! The rice was cooked perfectly (not too soft, not too hard). The pickled cucumbers were good and the meat sauce was delicious! The tea egg was also very good!\n\nFor taiwanese food, $13 is a little bit on the pricier side BUT this is in midtown so I would say the price is very reasonable. Taiwanese food in the area is also a nice change from all your basic fast casual spots. I would most definitely come back and try everything else on their menu!\n\n* I suggest you get there early (once they open or a few minutes before) if you don't want to wait in line. People start lining up 10 minutes before they open!\n\n* The braised beef is always sold out so if you want to try that dish, I recommend going earlier!", "author": "Flora L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "One of the best value food truck meals I've ever had! The bowls have good variety, quality, and diverse Taiwanese flavors! \n\nI tried the crispy chicken bowl, which comes with the exquisitely fried chicken (with salt and pepper and not too much oil), mustard greens, cucumbers or tofu and edamame, soy sauce egg, all over rice with a pork belly stew! This is all throwback Asian comfort food for me and it totally worked. The portions are huge and I honestly didn't think I could finish. But it was that good. \n\nEverything was cooked very well and I appreciated just how much one bowl comes with. In a way that feels crafted and intentional, not just a Chipotle assembly line style throw a bunch of stuff into a bowl. That's great too, but I love how yumpling has curated a small but thoughtful set of menu items. All with cute cartoon drawings to go along with.\n\nIf you have a chance to try Yumpling, take it. It's definitely worth it for tasty Taiwanese flavors - especially the bowls.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "Awesome food truck that shows up on Tuesdays and Thursdays in the heart of Midtown on 6th and 50th! Takes card, has a cheery person running the front, and most importantly great Taiwanese food...what more could you ask for?!\n\nThe line will likely dissuade many people for going here, which I can understand, and totally get. But the wait is worth the journey, because this is easily the best Taiwanese food in the area, albeit the only haha. I got the eggplant bowl, and man is it spicy! Generous amounts of eggplant with healthy amounts of veggies on top of a good portion of rice. Everything was well cooked, rice wasn't dry, and that spice! Too good. Added a piece of fried chicken, and I have no regrets! Good ratio of fried to chicken, juicy, and great spices for flavoring! My only complaint is that there isn't an eggplant/chicken bowl, now that'd be the best seller!\n\nThe food truck scene in Midtown is decent, but it could be a lot better, especially since most of these fools don't take card. If you're looking to support a good mobile eatery, get in line on Tuesdays and Thursdays, because there will be a wait, but oh is it so worth it!", "author": "Brian C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "This truck appeared in front of 375 Hudson Street one day, and we were blessed. Not only did the food taste great, the guy behind the cashier is over the top NICE. \n\nThere are usually 4 or 5 other food trucks on the block, but this day the only line formed was for Yumpling. Of course we just queued up in the back of the line without much thought. What was actually funny to see was the stack of parking tickets on their windshield, but they make a killing to care obviously.  \n\nMenu [as of 5/4/18]:\nPork And Garlic Chive Dumplings \n8pc : $9 \n12pc : $12\n\nRice bowl\nCrispy Chicken : $12\nSlow Braised Beef : $12\n\nChicken Sandwich \nSandwich Only : $9 \nSandwich w/ Fries : $12\n\nMy co worker and I both decided to get everything on the menu. A chicken bowl, a beef bowl, dumplings and a sandwich. It was only the 2 of us, and I don't recommend anyone doing this. It was way too much food! They ran out of beef, but they added the couple of pieces they had left to the top of the chicken bowl. \n\nThe beef was melt in your mouth good! \nThe chicken bowl had a generous portion of chicken breast that was moist and fried perfectly. I feel like the rice could've used a lil bit of more sauce or seasoning but it was good. Dumplings were juicy and big. And as for the sandwich..we never got to the chicken sandwich. We gave it away to another co worker and he loved itttt. I hope this truck is a regular on the block.", "author": "Daniel F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-27", "description": "Yumpling is perfection on wheels. There is no other word to describe the food and the customer service. My colleague kept going back to Yumpling every Tuesday and Thursday when the truck sets up on 49th Street between 6th and 7th Avenues, so I had to try it for myself to see what kept him going back week after week, even with the abundance of other dining options in Midtown. \n\nThe owner, Chris, does his very best to remember all his customers' names, and his enthusiasm is sincere and his smile infectious. The line can get long, but the service is quick and efficient, so don't be discouraged by having to wait behind 10-15 people at any given time because the payoff at the end is totally worth it!\n\nWhen it comes to the food, the chicken sandwich is my personal favorite. The sandwich is the size of a Frisbee, and I would venture to say it's one of the best sandwiches I've ever eaten anywhere: the chicken is juicy and tender while crispy, and is perfectly complemented by the basil aioli.\n\nThe chicken and beef rice bowls are also superb and the pickled cucumbers on the side are excellent. The portions are rather large so the money you pay will be worth every cent. The pork and chive dumplings are also fantastic, and you will want each and every single bite for yourself! All the food  is very well made, full of flavor, and consistently delicious.\n\nOne of the best food trucks around town. Highly recommended!", "author": "Danesh I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "The line was long but the wait was definitely worth it. We were a group of 4 so we ordered one of everything except the beef bowl (it was sold out). Everything was amazing! The chicken was so flavorful and crispy. Dumplings were perfectly done with a crisp bottom and soft steamed top. And the basil eggplant bowl is now my favorite vegan dish. Never knew eggplant could be so good. \n\nWould def recommend to anyone in the city during lunchtime.", "author": "Sue Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "The guy on the truck is so incredibly nice! You can tell he really wants everyone to love his food. Their food is so much better than the food from this Taiwanese food truck called Bian Dang, which is now closed.\n\nI got the crispy chicken bowl for $12, which made for a very filling lunch. It comes with a piece of fried chicken, rice, Taiwanese minced pork over rice, half an egg, cucumbers, and pickled mustard greens. It looks like they use chicken breast for the fried chicken. I prefer fried chicken thigh for the Taiwanese chicken over rice dishes, since chicken breast is usually drier and soaks up the less flavor. Their fried chicken didn't soak up as much flavor, but it was surprisingly tender. I loved the flavor of the breading though. I think that's where most of the flavor came from. Their minced pork over rice was tasty and had a good salty flavor. And thank you for putting pickled mustard greens on the rice. They are usually too far from where I work, but I'm glad I got to try this truck. If they come down to the East Village area, I would come to this truck often.", "author": "Jocelyn K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "This food truck was recommended to me by a coworker. It comes by our office on 49th street on Tuesdays and Thursdays from 11:30am-2:30pm. At first I wasn't really sure why the lines were so long but after experiencing it for myself...WOW I finally understood. \n\nI was greeted with a smiling face (I think the owner) and his shining personality really impressed me (he remembers everyone's names!!!!). I got the pan fried dumplings, the crispy chicken rice bowl with edamame,  and a refreshing Hey Song drink. The wait for the food was not long at all.\n\nPan Fried Dumplings: These come in a serving of 8 or 12. Their bottoms were fried to perfection and drizzled in their chili oil. Each bite made me hungrier....\n\nCrispy Chicken Rice Bowl: This came in a regular sized bowl and were topped with perfect size fried chicken slices. It also included half a soy egg and some pickled veggies. Hidden under the chicken was a nice surprise....a nice layer of Lu Rou over the rice. This authentic dish really reminded me of Taiwan and brought back joyful memories of pigging out on the streets of Taiwanese Night Markets.\n\nI'll definitely be coming by every Tuesday and Thursday.", "author": "Brian C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "This place lives up its reputation, the service and the food deserves a 5 stars review for sure!!! \nIt's actually my second time visiting yumpling, I would say no words can describe this other than home! I had the crispy chicken bowl, it was amazing!!! the chicken was actually thicker than most of the bento boxes that I had in Taiwan, which I like a lot and it was so tender and crispy!! One other thing made me really surprised was the sauce under the chicken, it was braised minced pork full over the rice, it made me finish the entire bowl, well, diet... can wait", "author": "Viv Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "This is the pinnacle of what a food truck experience should be. From the incredibly hospitable, energetic, and swift customer service to the mouth-watering dumplings, chicken, and beef, you really cannot ask for a better way to spend your lunch break. They even have a vegan-friendly eggplant option, and while I'm quite the carnivorous competitive bodybuilder, I highly enjoyed this dish as well. I will not be surprised if this business continues to thrive immensely in the coming future!!", "author": "Mark P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-21", "description": "I have been here several times and have gotten the basil eggplant over rice. IT IS SO GOOD and flavorful! And it is VEGAN - woo hoo! I love having a delicious vegan option right next to my office. I have recommended this dish to several colleagues (who are not vegan) and they have all loved it.The people in the truck are also always friendly which I appreciate.", "author": "Elizabeth E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-14", "description": "This food truck comes by my office about once a week (on Hudson St) and after seeing all the rave reviews, I decided to try it out one day! The line was super long, but it moved pretty fast. I decided to try the fried chicken sandwich, because I figured it'd be a safe bet. The guy taking the orders was super nice - he sees your name on his iPad after you swipe your cc and he makes a point to thank you using your name! You don't get service like that often!\n\nThe wait for the chicken sandwich wasn't too long. I received my order before some people ahead of me who ordered the rice bowl. The flavor of the chicken is delicious and this sandwich can definitely be amazing however my sandwich was just too oily to enjoy. Not sure if it just wasn't cooked properly, but judging by all the amazing reviews, I'm assuming this isn't usually the case. I will have to try this place again one day, but for now I'll have to give it 3 stars :-/", "author": "Anam B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "Great taiwanese food ! Even though the fried chicken rice bowl looked small, it was very filling (i couldnt finish it!). The chicken was fried perfectly and is not dry, and all the toppings go really well with the protein \u0026 the rice.\nThe dumplings are great too..not the best I had but I would order them again.\n\nMost importantly the service was great! I have only been in NYC for a few days and he's definitely the first one who asked how my day was going..... :)", "author": "Grace S."}], "servesCuisine": "Taiwanese", "priceRange": "$11-30", "name": "Yumpling Food Truck", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "10020", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/lMRmUP6nJZJGeCtLrHV0_A/ls.jpg", "@type": "Restaurant", "telephone": ""}