{"aggregateRating": {"reviewCount": 86, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-18", "description": "Dumplings are good. I like that they're topped with cilantros. The chicken bowl is not good. The chicken was tough and there wasn't much meat on it, mostly batter.", "author": "Ai O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-21", "description": "Really surprised by how good this place was. The owner was incredibly friendly and even remembers people's names and favorite orders.", "author": "Ming L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "Really delicious for a quick lunch idea. Happy with the portion. Staff is so friendly. will come back anytime soon.", "author": "Sha H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "Completely obsessed. This truck's food and service are seriously top notch. I've stopped by a few times but can't seem to stay away from the chicken rice bowl. I keep meaning to try new items on the menu but the rice bowl is my favorite! I have tried their vegetable dumplings on the side though, which are just as delicious. I'd add an extra star just for the truck's aesthetic. If you're ever in the mood for really good Taiwanese food- go here!!", "author": "Michelle S K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "The food truck was outside of my office building so I decided to try it. Line was exceptionally long today but it went very quickly. I ordered the pork dumplings. Wow, probably the best dumplings I've ever had. So full of intense flavor, topped with chili oil and scallions and cilantro. Nothing bland about this dish. I am definitely going to be a regular from now on.", "author": "Susie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-22", "description": "Hand's down the best dumplings in the city! Their chili sauce is amazing. The owner is a super nice guy - I always leave with a smile.", "author": "Annie M."}], "servesCuisine": "Taiwanese", "priceRange": "$11-30", "name": "Yumpling Food Truck", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "10020", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/lMRmUP6nJZJGeCtLrHV0_A/ls.jpg", "@type": "Restaurant", "telephone": ""}