{"aggregateRating": {"reviewCount": 86, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "Best Food Truck in NYC hands down!  Can't go wrong with the Chicken sandwich, chicken bowl or of course the dumplings.  If you want the braised beef bowl (I personally never had it), but would recommend that you go early between 11:30-1pm the latest, as it usually the first thing that gets sold out, so I assume it must be awesome.", "author": "Monique C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-18", "description": "This food truck offers the best dumplings I have ever had. The taste just blew my mind. I chose the regular size and I am regretting why I didn't choose the large one. The service is quick and the guy at the counter is full of energy serving his customers with joy. I am definitely going back over and over again.", "author": "Varun P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-20", "description": "After reading so many positive reviews I was anxious to try the crispy chicken rice bowl and the pan fried dumplings. They were parked on 49th St. between 6th and 7th Ave which is nearby my office. \nAs many others have said, the owner is super friendly. Other business owners could learn a few things about proper customer service from this guy.\nAnyway, I ordered the crispy chicken rice bowl and the pan fried dumplings. I started with the chicken bowl dish. Although all the ingredients were fresh and cooked very well, I didn't really care for the pickled mustard greens. I don't eat pickles or anything pickled because I just don't like the flavor so I didn't care for that part of the dish at all. But I did enjoy the chicken very much and finished most of it except for the pickled mustard greens and some of the rice.\nThe dumplings were good sized and filling. For $9 you get 8 dumplings or fort $12, you can get the larger size which gives you 12 dumplings. I liked the dumplings, but did wish they were fried a little more crunchiness.", "author": "Mike L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "There always seems to be a rotating group of food trucks outside my office building (49th and 6th) and Yumpling is one of the newest additions. Their menu is small but that just means they make everything very well! \nToday I tried the chicken bowl with pork belly, cucumbers and a soy sauce egg. It was deliciously decadent and very filling. \nCan't wait to try their chicken sandwich next!", "author": "Bonnie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "I've tried every food item available from Yumpling - it's almost all amazing. The beef bowl (which runs out soonest each day) is my least favorite as there's not quite enough sauce for the rice and the meat is very \"tendon-y,\" though if you like that, you'll love it.\n\nThe crispy chicken bowl (think Korean fried chicken, sliced) is phenomenal with the reduced pork belly sauce, pickled mustard greens and garlic pickled cucumbers. The chicken sandwich is phenomenal as well. Still, my absolute favorite are the pan-fried dumplings. Crispy bottoms, soft \"steamed dumpling style\" casings, chili oil drizzle - a serving of 12 could easily feed two for lunch.\n\nThis food truck is on 49th between 6th \u0026 7th every Tuesday/Thursday, and on 41st between 6th \u0026 7th on Monday. Between super-happy and welcoming Chris at the pass, and the fresh, delicious food, I know I'll be back!", "author": "Shanee O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "Like the other reviewers said, the owner is super friendly and makes a concerted effort to remember customers. I've come here on a semi regular basis with my friend and he remembers both of us. I've actually been asked \"where's your friend?\" when I come alone. \n\nOnto the important part though - the food. I love the chicken rice bowl. The pieces are perfectly seasoned and the meat sauce is absolutely delectable. I also love the dumplings and the fried chicken sandwich. Like the other reviewers said, the sandwich is humongous and I was barely able to eat it.", "author": "Evelyn W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "Very tasty carnivore oriented Taiwanese food truck sometimes found on 49th between 6/7 Ave. It's hard enough finding real Taiwanese food in NYC but it's even more rare that a food truck actually serves its food hot and plates it as nicely. \n\nEverything on the small menu is prepared, cooked and seasoned deliciously -- although there are some minor disappointments such as the relatively tasteless boiled egg, or that the crispy chicken can be over cooked (dry) sometimes.  Terrifically enjoyable pork and chives dumpling prepared \"gyoza\" (jen jeow or CH. jiao zi) style instead of the thin elongated (guo tie) style frequently more associated with Taiwan.\n\nAttention to detail is impressive as can be seen in their accompaniments like cucumber or an excellent edamame stir fried with typical Taiwan pressed tofu (doufugan) and salt preserved leafy greens (xue cai) and with pickled mustard greens on the side, or the crispy chicken being served over lu rou fan (braised pork over rice).", "author": "TokyoGeo B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-09", "description": "Really authentic Taiwanese cuisine. So excited to finally have this option! The stir-friend basil eggplant rice bowl and crispy chicken rice bowl were both great. The slow-braised beef rice bowl was sold out at 12:55 pm - I hope I get a chance to try it next time!", "author": "Sandra K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "This is my go-to lunch place on Mondays when they park on 41st between 6th and Broadway. Dumplings are juicy on the inside and crispy on the outside- absolutely delicious. The chicken rice bowls are also great- it's crispy and has that great chinese salt and pepper flavoring. Mustard greens are the perfect side. Highly recommend.", "author": "V Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "So grateful to my colleague who showed me this truck. Now I will forever crave their crispy chicken and pickled veggies *drool. Seriously tho, the chicken is amazing. Actually crispy with the right amount of saltiness. It really hits the spot when I'm craving some of the motherland food. Their dumplings are also really good. The dumpling wrapper has great texture. Good portion for the price point.", "author": "Joanne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "Saw a huge line waiting to order from this truck down in DUMBO and had to try! Liner moved very fast. I had the crispy chicken rice bowl and the dumplings, which I had to get since it's in their name, and was not disappointed! The food was great and I would definitely recommend! Also as others have noted before this might be the friendliest food truck I've ever been to, I loved it!", "author": "Sean M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "The guy taking orders is super friendly like way over the top friendly; no one in new york should be this happy to be here it makes me sick.\n\nThe dumplings were decent; good flavors even without sauce. Would be great if they provided some chili/oil sauce to go with it. I recommend getting 2 orders of dumplings since one is not filling.\n\nAlso the name is so cute. I saw it while walking to work and thought about it all day until lunchtime.", "author": "Li Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Like other reviewers have mentioned, the service is super friendly. I ordered the braised beef with rice and wanted to buy an extra egg to go with it, but they gave one to me free of charge which was really nice!\n\nThe braised beef was delicious and the pickled vegetables and sauce were very flavorful. My only complaint is that the soy egg could've used more flavor, but overall this truck will continue to be a top lunch choice for me whenever they're close to Rockefeller Center.", "author": "Julia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "my god...what a pleasure to have this food truck right by my office. I was swamped with meetings and needed to grab a quick lunch- I'm thrilled to have stopped a tried a fried chicken bowl from Yumpling. The chicken was deliciously seasoned, the pickled vegetable nice and tangy, and the cucumbers perfectly crisp. \n\nI never write reviews- the reason I'm taking the time to is beyond the food- it's the service. It's such a pleasure to see genuinely nice folks that run businesses and take pride in that work- you can tell that's the case here. The guy who runs it is truly a sweetheart and I can only wish him a bunch of success with this truck.", "author": "zack m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "The crispy chicken bowl is unreal. The portions are huge, so definitely worth the money. This bowl is basically two lunches for me! The chicken is so crisp/juicy and the cucumbers and scallions are so fresh. The guys working the truck were also super nice! I'd recommend this to anyone looking for a big meal with lots of great flavor!", "author": "Jackie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "It was definitely good, don't get me wrong, but I didn't feel it is deserving of 5/5 largely due to the value/price\n\nI had the dumplings and the beef shank (my friend and I shared the two entries)\n\n-the dumplings were well prepared and flavorful\n-the beef was pretty good\n-also -- the owner  was really friendly (I suppose I would be too if I had as sweet a gig as him)\n\n-for $12 in this part of town for a truck to get 5/5 in view, it has to be pretty transcendent or be a huge portion - it was neither (that said, I only know of one truck I'd give a 5/5 on that entire physical block...) \n\n-I might go back to try the fried chicken but I doubt it", "author": "Jeff S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "I am from Taiwan and I really like their Fried Chicken Rice bowl. It's authentic and really good portion for lunch! Their service was pretty impressive, especially in the rush hour, they still made sure everybody was taken care and got the food just in time.", "author": "Zara C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "When I first found this truck, I tried their chicken sandwich and it was awesome ! The chicken was so juicy and crispy along with the sauce that came with it was excellent. I actually have been back there 3 more times recently and have tried their dumplings and the chicken rice bowl. The dumplings were also very juicy and tasty, but the rice bow was absolutely delicious. It had the same juicy and super crispy chicken as the sandwich along with pork belly, some greens and a soy sauce egg. The portion of the rice bowl was also huge and worth every penny.", "author": "Peter M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "He is crazily friendly! The food is very nice, not the best, but pretty good fast food! Price is a little high though. I give it 4.5 overall.", "author": "Shuo Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Update on my review, I wish there was a 10 star button!! Yes, Yumpling is THAT GOOD!! I have had all the dishes and they are all the bomb-diggity! Of course my favorite is the Braised Beef and right behind that is the Chicken bowl. I bought the Eggplant for a friend who didn't get to eat it and I was like if you don't eat this, I will, lol!!! and it was delicious, Chris the owner did mention to me it may be a bit spicy, and it was, but I still ate it, very flavorful! The chicken sandwich is the second most popular after the beef bowl, I had it and it is so delish, it was yummy! Don't let the lines deter you, it is worth the wait and more!!  Recent improvements Yumpling has made is to let the queue know if items have sold out, but many do not leave the line as there is something for everyone to enjoy. And the dumplings, always great! The do cater if you want to  have some amazing food for an upcoming event or party!! Keep up the fantastic work Yumpling!! Love you guys!!!", "author": "Linda B."}], "servesCuisine": "Taiwanese", "priceRange": "$11-30", "name": "Yumpling Food Truck", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "10020", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/lMRmUP6nJZJGeCtLrHV0_A/ls.jpg", "@type": "Restaurant", "telephone": ""}