{"aggregateRating": {"reviewCount": 86, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "Today was my first visit- they're here at 41st St/6th Ave often. Delicious. I will be back ASAP! The dumplings were screaming hot (not normal for NYC food trucks to serve hot food lately it's barely warmish), crispy, juicy and flavorful. Oh and for food served in a plastic container, they actually attempted to make the presentation nice too with beautiful stems of cilantro across the top. I wish there was an acid component but seriously, it will not stop me from buying these again and again.", "author": "C G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "Ordered a crispy chicken rice bowl and dumplings. My favorite crispy chicken bowl so far in NY! The dumplings are good too but not as amazing as the crispy chicken. The cashier is very friendly! Everyone is welcomed with the biggest smile! I wish the line isn't that long every time since I only have 1 hour lunch break.", "author": "Annie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "This is the third time I've gotten food from this truck - man if you want to get awesome food and order it from the nicest guy on earth, then hell this is the place for you! As you can probably see from the other posts, this guy is just the bees knees and is always graciously kind AND THEN he gives you dope ass dumplings, like yes I will be back again and again and again. Thank you so much!!!", "author": "Sky H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "This place is genuinely delicious. Great food for the price, and also generous portions. Freshest food truck dishes I've tried in a long time! Also, service is super fast and they are very nice people. Must try if you're in Manhattan. 5/5 stars.", "author": "Humphrey F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-29", "description": "Found you guys in Dumbo today. The gentleman taking orders and greeting people was extremely friendly, and greeted almost everyone by name. Food is flavorful and the beef falls apart when you bite it. Wish I could give more than 5 stars. Will definitely look for you guys again. Thank you for the delicious food.", "author": "Matt R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-08", "description": "The guy taking orders is probably one of the nicest people that I've ever met! Made me smile that my being there was so appreciated. \n\nI had already brought my lunch to work but when I saw the dumpling truck outside my office I knew I had to get some. I ended up ordering the regular pork dumplings and they were really good. They're supposed to come with nine dumplings but I only got eight. I forgave them since the guy at the truck was so nice it made up for the missing dumpling lol Loved the sauce that they put on them. \n\nI'll definitely be back to try something new on the menu!", "author": "Ruby L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "Tried this truck for the first time for lunch today and am so happy that I did! The chicken bowl was so so good - crispy chicken seasoned to perfection, fresh and made to order. The line was long but service was super quick and friendly too. Portion was so generous that I didn't even need dinner. Can't wait to try the other items on the menu! Please continue to come to 55th \u0026 Broadway on Mondays!", "author": "Jenny Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "These dumplings are incredible! The service was super friendly and extremely fast. It took less than three minutes to place and order and receive my food. I can't say enough good things about Yumpling!", "author": "Faith E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "I am an event planner and I hired Yumpling for a big event with 6 other food trucks, after trying them in Dumbo. Their food was by far the best of the trucks and their level of hospitality and service is extraordinary. They also have the best dumplings I've ever had and their vegan rice bowl is a great meal. I look forward to more visits to the truck and to more events wit them.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "Had their chicken sandwich which was  10.00.  My original thoughts was another food truck with over-priced sandwiches, but OMG was this sandwich absolutely fantastic. Fried to order (please don't ever change that!!), a little spicy, had a green aioli (basil?) and was perfectly crisped on the outside and tender/juicy on the inside.  The sandwhich was pretty big which definitely justified the price tag.  \n\nFantastic find and an overall great experience!!", "author": "Joshua F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-25", "description": "There are a lot of things going right for this food truck!  They keep their menu simple in order to facilitate a quick n efficient line for their truck.  I've eaten here twice now, first time getting both dumplings and the beef bowl..on the 2nd time I tried the fried chicken bowl.  I am Taiwanese and i must say, the flavors are pretty authentic when it comes to each component they put in...the face of the truck is a really friendly dude who makes a real effort to send you positive vibes.  Whatever he drinks to get him like that, please tell me what it is...i need it before meetings. Only gripe i have is i found that their dumpling menu item wasn't priced consistently with the rest of the rice bowls, in other words- its a bit expensive for what you get.  They could really up-sell customers by offering a 3 dumpling add-on to their rice bowls for a marginal incremental cost...", "author": "Howard M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "Yumpling is phenomenal.  I've tried the dumplings and the crispy chicken rice bowl and both were really good.  The chicken bowl is standout and has a lot of food- the chicken is fried perfectly and their marinade for the rice is really good. The cucumber was a great added touch to the meal.  There are not many Taiwanese restaurants (can't think of any) in NYC so did not really know what to expect but I was really happy with my two experiences there!  There was a bit of a wait both times but the line moves quickly and it is well worth the wait!  The cashier was also extremely friendly on both occasions which was nice to see.  I will definitely go back anytime I am near 49th St and 6th Avenue for lunch.  I know their schedules changes everyday so may want to follow them on Instagram @yumpling or Twitter.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "Wowowow amazing , what can I say take extra sarachai sauce and enjoy . There dumpling are yummy there beef or chicken bowl yummy . This is one amazing flavor filled food truck .", "author": "Eric D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-20", "description": "These folks right from the start were super friendly. Food was prepared hot and fast. Pork and chive dumplings were flavorful. The fried chicken rice bowl was also flavorful. Crispy and fresh. Rice bowl included lightly pickled cucumbers that rounded out the meal perfectly.", "author": "bonnie l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "REALLY good dumplings. skip the basil eggplant bowl.", "author": "Xin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "Tried their veggie dumplings and they were well worth the wait! Fresh and tasty. The staff were awesome. Will be back!", "author": "Claudia V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "Best dumplings ever! Perfectly seasoned, pan fried delight!! Customer service was amazing. I'd definitely recommend.", "author": "Carisa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "These are my favorite dumplings I've ever had! I can't recommend them enough. I found out about Yumpling when they had a stand at the LIC flea market during the summers, but I now get their pork \u0026 chive dumplings every Friday from their food truck in Soho. The dumplings are delicious, perfectly seasoned and cooked, and are filling (without being greasy)! And the guys are always extremely friendly and accommodating.", "author": "Courtney K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "My brother and I agree, this food truck serves some of the best Taiwanese food in the city, if not THE best (and we grew up eating Taiwanese food in Flushing all day everyday).\n\nWhat makes the food so good? The traditional dishes (I had the dumplings and the fried chicken rice bowl with stewed pork rice) are super authentic representations of the dishes, but it is also clear that the owners of this truck place an extreme amount of care into getting every detail right (and to be honest, most places in Flushing don't anymore). The ingredients are fresh, the dumplings are super flavorful and delicious, the rice is cooked perfectly, the fried chicken is crispy, not dry, and tastes like the best I've had (on par with some of the best in Taiwan).\n\nFor the non-traditional dishes (I tried the chicken sandwich), the same care is taken, and the combination of flavors and textures was magical.\n\nBest of all, the price point is great for what you get (when I went, it was like $8-$13 per item for tons of food per item). The workers on the truck are also super nice.\n\nProps to the owners for creating something so great for Taiwanese food fans in NYC!", "author": "E C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "WOW!! I have always saw this truck but never thought to stop and order anything, well One of my colleagues brought me back lunch, it was the braised beef bowl!! I have NEVER had such a tender piece of beef!! So good!! Seasoned to perfection with the rice and hard boiled egg.  So Delicious and I am FULL!! you just got yourself a new customer!!", "author": "Melissa V."}], "servesCuisine": "Taiwanese", "priceRange": "$11-30", "name": "Yumpling Food Truck", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "", "postalCode": "10020", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/lMRmUP6nJZJGeCtLrHV0_A/ls.jpg", "@type": "Restaurant", "telephone": ""}