{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-07", "description": "If you want quality japanese food Ki should be  your first choice! The food is very expensive, but you definitely pay for what you get. I completely reccomend the black cod if your a fish lover or koma soba soup if you like duck, its full of vegetables and amazing noodles.", "author": "Mark K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "A nice atmosphere, low lights, and good fresh sushi.  Try the creme brûlée, this is the one place I make room for dessert!  This is a great date spot in Brooklyn!", "author": "Nia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-28", "description": "This place was IMPRESSIVE. Excellent hot sake and dragonfly roll, as well as ornately sculpted \"sushi regular.\"  I couldn't have been more astounded by the presentation of my companion's dragonfly roll. Service was on point and polite.  We never felt rushed yet we never felt like we were waiting for an eternity.", "author": "Elizabeth W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-08", "description": "I just tried KI SUSHI after reading such great reviews on Yelp.  Note that I only ordered for delivery.\n\nThey have a nice selection - nothing earth shattering but was in the mood for some basic sashimi and sushi with the beau.  Very nice on the phone.\n\nI ordered the Sashimi Regular and he ordered spicy tuna rolls, dumplings and edamame\n\nThey delivered very quickly which is a nice thing in the area.\n\nThe presentation was beautiful - and everything looked fresh and delicious.  It was another story when I started to eat my meal.  I was greatly disappointed.  Both of our meals were very bland and my sashimi was tough.  The fish was fresh and it was not bad but it was... blah.  blech almost.\n\nThe only thing that I ate was the rice, miso soup and edamame.  A very expensive meal that I had to throw away.\n\nSorry to say I won't be trying them again.  ...and I was really in the mood for such good sushi.  *sigh*", "author": "nycsep n."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-21", "description": "Pretty damn good. I just spent $40 on the chefs selection and a fairly generous seaweed salad app. I opened the bag was expecting more. In fact o took pictures pissed that this nothing was $40 before tip (delivery). It's very fresh great sushi.", "author": "mj b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-06", "description": "really good sushi, average price, clean, good service, and some \"not boring sushi\" if you want some change. Best sushi place in the neighborhood for me", "author": "Nicolas R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-07", "description": "It has taken me a while to settle on a fav for sushi in my 'hood, but this is going to be it.  Dark decor, a wait, but not too long, and friendly knowledgeable servers with great rolls.  I ordered a grapefruit/shrimp salad and a roll without rice (wrapped with thinly sliced cucumber) as a light dinner and left feeling full and happy.  The special rolls are pricey at around $15 each, with a few basic rolls around $6.  I'll definitely be back.", "author": "Angel D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-10", "description": "Ehhh. The rock shrimp tempura was tasty but felt very heavy. Too much of the \"spicy sauce\" (some seasoned mayo tasting thing - this sauce appears in many dishes it seems).\n\nI had the Dynamite roll based on other's recommendations - wasnt really impressed, it was kind of falling apart. I really liked the jalapeno tobiko on top! \n\nEel and Avocado was really good- i had stopped ordering eel and avocado for awhile because of some chewy pieces I had at other restaurants in bk. basic but i have had it go wrong at places like Kiku and Taro. \n\nI would like to go back to try nigiri sushi instead of rolls.\nFish was fresh - but i wasnt like omg this is the best ever.", "author": "Sharon K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-12", "description": "Delicious buuuut I wouldn't trust the freshness based on my experience with the Ikura. Ikura never lies, if it's old, you know. And if they have one old product how do you trust the other raw fish?", "author": "Ericka C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "The rolls are very good if you are craving westernize sushi. The kitchen items are not as good. Stick to the rolls great variety and fresh ingredients.", "author": "Steve B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-11", "description": "Ki has the best sushi I've had in Brooklyn.  (I promise to amend this review should that change.)  Honestly, I haven't had particularly good sushi in Brooklyn, so let me start again.\n\nKi has great sushi.  Also it's in Brooklyn.  Since discovering it last week I've eaten there three times.  The sushi is quality.  The service is top notch.  I can't get enough of the mushroom soup.  The standard Japanese green salad with citrus dressing tastes much better than the standard Japanese green salad with citrus dressing.\n\nMost importantly, the Scottish grilled salmon entree is perhaps the best thing that ever happened to a fillet of salmon.\n\nAlso, 2 times out of 3 I wasn't pressed to leave immediately after my meal.  I was able to sit back and enjoy another cup of green tea.  My server did me the courtesy of not bringing the check until I asked for it.  I love that.", "author": "lee v."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-19", "description": "We were SO happy that we chose this spot over all the other possibilities in the hood. Since hurricane Hanna was spending some time in Brooklyn the night we went, wherever we ended up had to be worth the sloshing around the hood. Clearly since all the other maniacs were home, hiding from the rain, we can't attest to the normal wait time. We waltzed in, left a big puddle on the floor and were ready to go. A recap:\n\nYellowtail App: 3 stars\nNegihama: 3.5 stars\nDynamite: 4.5 stars\nSpicy girl: 4 stars\nLobster tempura roll: 3.5 stars\n\nWe'll definitely be back!", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "I mostly just want to review the sushi Omakase.  \n\nLet me say to start, the Miso Eggplant was awful.  A fried, soggy, too sweet mess.  Almost impossible to eat with chopsticks.  No taste of miso at all.  Compared to the same thing at Blue Ribbon Sushi (which is divine) this is a disappointment.  \n\nI got the Special Omakase, apparently from Tokyo.  I'm not sure what was actually from Japan, but I can tell you this: it is as good as sushi gets - anywhere in the world.  The chef prepared a perfect mix of taste, texture, appearance, and color.  The plate itself is a beauty to behold.  The flavors vary from very light and sweet - and deliciously succulent, to powerfully rich packed with of flavor.  Each piece was so distinct from the next.  You really had to savor each bite.  If you follow the right order - each piece will build on the next.  One of the pieces was scarred, blow torched, and salted and was amazing.  The grand finale was the Uni from Hokkaido.  I am not a uni guy but this was *the* best I've ever had.  It almost has the texture of foam, yet was full of rich umami flavor.  Total knockout.  Everyone has to try the sushi at least once - especially if you think you don't like nigiri sushi.  If this won't change your mind, nothing will.", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-21", "description": "Best sushi in the area, hands down!  I have been here 3 or 4 times, had several different rolls and apps, and it's always been wonderful!\nI personally love their seaweed salad and the boyfriend always gets the seafood soup that is seriously a meal unto itself - the thing is stuffed with mussles, shrimp, white fish...etc.\nMy roommate gets their takeout a lot, and they are always really quick and never mess up her specialty order.  \n\nCool atmosphere (altho small inside) and quick service top off this great restaurant!  \n\nI also love how the sushi chefs always say hi to you!  It makes me feel welcomed and loved!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-09", "description": "Date attended: Sunday Feb 8 2009  \nWent with: Group of approx 10 ladies who love Sushi :)\nTime: 5pm\n\nHello All;\nKi had a nice brunch-dinner ambiance. The food was \"delish\" and I made a point of trying dishes I had never had before. \n\nTo start off I had the cold Nigori Sake which I liked very much since I never had Sake before. For my appetizer I ordered the Jalapeno Yellow-tail Sashimi which was awesome, then the Peach Roll, followed by the Green tea ice cream for dessert. And that's all I could handle...I was fulll.\n\nOur waiter was pleasant but the food was brought out in a rather sporadic manner which annoyed a few of my friends. Either he was new, wasn't used to serving groups, or was just disorganized. Apart from that we had a great time because the food an atmosphere was awesome.\n\nThanks Ki Sushi for helping to make my Sunday afternoon meet-up with friends enjoyable!!", "author": "Lizzie J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-21", "description": "I also don't understand why this restaurant receives such glowing reviews. My husband and I found the experience to be rushed, extremely overpriced, and ultimately unsatisfying. \n\nWe ordered the salmon skin salad and the TNT roll as appetizers and they were inventive and yummy.\n\nHowever, for our main course, we ordered \"Omakase.\" By definition, omakase should be the equivalent of a chef's special. The chef is supposed to be innovative and surprising using a selection of high quality fish to create something memorable for his guests. Often omakase includes different courses. \n\nFor our omakase, we were brought 8 pairs of nigiri!!! The selection included standard fair such as salmon, mackerel, yellow tail, and eel, the only \"exotic\" piece being the toro fatty tuna. Some pieces had a hefty dose of wasabi underneath so that we couldn't even taste the fish. We were scraping wasabi off the fish in order to taste it.\n\nOur final bill with two drinks each came to $110!! \n\nWith all the creative things listed on the menu, I was shocked that the chef did not take the time to make our experience memorable and that the wait staff didn't bat an eye either.", "author": "Joanna W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-29", "description": "I typically get their take out, which is a bit more expensive than the other sushi joints in Cobble Hill but their quality is also a bit better.  The place is pretty popular so their take out does take a while but the fish has always been fresh, which I can't say for some of the other places on Smith.  If you're looking for a cheaper alternative try Osaka, Hana or Nanatori.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-11", "description": "Not impressive after my meal earlier in the week at umi sushi in Manhattan.  The spicy tuna was not spicy \u0026 the seared tuna roll was boring.  You can find much better prices and better sushi elsewhere.  The only reason I'm giving it two stars is because the staff was very friendly and on top of things.", "author": "Lauren P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-04", "description": "I've been here several times, and the meals are always consistently delicious.\n\nMy personal faves:\n\nOshinko - pickled vegetables\nBroiled Black Cod glazed in saikyo miso sauce - incredibly tender and full of umami goodness\nMiso sea bass - perfectly cooked fish\n\nI'm deducting a star because I've had some passable sashimi but service is always great.", "author": "Scuba K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-30", "description": "pros: It's just so good. For a first time at any place, if all the dishes you order are good, chances are they'll be good consistently. We ordered the sushi deluxe, a salmon roll, and the tempura entree, and between two ppl, it was plenty.\n\ncons: There's nothing bad I can say about the food, but the place itself is somewhat small and cramped. This is not the place to get intimate as the people next to you will hear everything you say. It will only come in handy because the stranger sitting next to you will be able to hear you apologize when you inevitably bump into them.\n\noverall: I'd go back again and take whoever wanted to come with me. If I had no one to go with, I wouldn't hesitate to go to Ki alone -- the food's great, and overheard conversations are bound to be entertaining.", "author": "augin s."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}