{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-20", "description": "Ki Sushi is my jam for Japanese in this area. The rolls are always really fresh. The mushroom soup is one of the best I've ever had. The restaurant is airy and nicely decorated. I just wish they had more non-sushi options, but everything I have had has been A+", "author": "Adrienne P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-05", "description": "No clue why anyone would deprive Ki Sushi of five stars. No clue at all.\n\nOh, wait? The prices? Yeah, they're steep. It's annoying. But the Fantastic roll, in all its spicy tuna, tempura, yellowtail and salmon glory is worth it. Tuna roll with avocado and peach? Yes please!\n\nAnd you may think carrot-ginger dressing is the same everywhere, but you, sweet friends, are wrong. The dressing for the green salad at Ki is light and creamy. Somehow it even makes overpaying for a bowl of iceberg lettuce OK. When I get Ki to take home, I may (or may not) drizzle some on my sushi. Don't judge.\n\nAs for the service? Can't complain. Ki squeezed in a party of eight for me with a half hour's notice and the staff couldn't have been sweeter to my group. Other pluses? Warm hand towels at the beginning of the meal and a phenomenal bathroom.\n\nThe ambiance is great -- a perfect date spot. And, if you're lucky enough to work or have a day off in Cobble Hill, check out their lunch special. No, you can't partake in one of their specialty rolls, but it's not all bad -- even comes with soup and the aforementioned salad!", "author": "Lesel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-04", "description": "Normally I try not to eat sushi at places that are not Japanese owned and run.  I am Chinese and can definitely tell which places are owned by my people.  However, I was craving sushi tonight and decided to try out Ki Sushi.  At first I stopped by Kyoto Sushi directly across the street from Ki, but noticed there wasn't a soul in there so I walked across to Ki.  The place was packed on a Sunday night.  I ended up sitting at the sushi bar and watching the chefs make their art work.  All of the sushi rolls and dishes they were putting out were really beautiful and looked delicious.  I ended up ordering the sushi deluxe and a spider crab roll.  The fish used in the sushi was absolutely fresh and high quality.  The rice used in the rolls had just the right amount of rice wine vinegar to give it a nice light sweet flavor.  The dish had a variety of fish including, two salmon, two tuna, two white fish, mackerel, and hamachi along with a tuna roll.  I left the place completely satisfied with my decision to give Ki Sushi a shot.  I will definitely go back.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-08", "description": "This is a really top notch sushi place.  Okay, it's not truly authentic, but really -- it is superb.  A wonderful representation of the \"American\" sushi place that combines excellent Asian fusion cooked dishes, awesome creative rolls, and fish and other seafood the quality of which would be rated well even in Japan.\n\nWhile the raw fish is of excellent quality, you would be missing out if you go there just for the same old sushi platter as you do anywhere else.  I strongly recommend that you try a few things off their cooked menu as well.  The bluefin toro appetizer with the ponzu vinegar and truffle oil dressing is my favorite, and I keep the sauce to dip some more sashimi in when I'm done with the toro -- eating raw fish with ponzu sauce -- a mixture of citrusy, fragrant yuzu and soy -- rather than wasabi is a traditional Kansai thing, and the addition of the truffle oil really elevates this classic to the next level.\n\nBut of course, their sushi is also really, really good, some of the best in the city, and though it is priced higher than most in this neighborhood, it is not at all outrageous for New York City as a whole, and you really do get very, very good food.\n\nThe only bad thing I could think of is that they do not have a selection of draft Japanese beers to complete the experience (people in the States don't ever seem to know that hot sake is actually a horrible pairing with sushi, because the sweetness of sake, amplified by being heated, completely obliterates the taste of the seasoned rice, and the best pairing for sushi is actually just plain green tea or beer, the bitterness of which actually complement the taste profile of sushi perfectly).  But with a selection of bottled beers and a small but well-represented wine list, I can forgive that.", "author": "Frank L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-05", "description": "There isn't much to be said about Ki Sushi that has not already been mentioned. The food is consistently wonderful.  The only occasions when my fellow diners were not satisfied with the food was due to a difference in taste, as opposed to the quality.  The selection of fish is great.  The items from the kitchen are comparable in quality as the items coming from the sushi chefs.  In particular, the miso cod and popcorn-style shrimp are wonderfully prepared.\n\nThe staff are always friendly and attentive.  The zen-like space is very relaxing and spacious.  Since the birth of our son, my wife and I haven't been dining-in as much as we used to.  Thankfully, their take-out service doesn't compromise in quality.", "author": "CalebK D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-09", "description": "Pricey - but delicious!\n\nHad salmon sushi (smaller than normal, but like butter), oyster sashimi, volcano roll, and tnt roll - superb flavors, well put together ingredients, and absolutely fresh.  \nIf you can drop $$$ on quality sushi, check out this spot.", "author": "sm T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-06", "description": "By far my favourite sushi restaurant in the neighbourhood. Good ambience, reasonably-priced menu, attentive service, drinkable house wines, delicious Miso, and most importantly, sushi I'm not scared of.\n\nAfter a few incidents with raw fish, I'm quite fussy where I eat now. So many restaurants leave their fish standing around so long that it actually loses it's bright colors. So when there's a 5-minute wait to get a table, as there often is at Ki, that's the first good sign that food is moving through the restaurant instead of standing around oxidizing.  Every time I've been to Ki, the fish has been fresh and delicious.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-28", "description": "Great dinner spot in Carroll Gardens. I've been here at least 20 times and it's always good to great. The food, ambiance and service are consistently exceed my expectations. Highlights include the specialty rolls, the garlic broccoli and the Waketake (not sure of spelling) sake.  Bring your family or a date.", "author": "Liz M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-10", "description": "Great option for sushi in the neighborhood. I wouldn't say it's the absolute best in Brooklyn, but definitely a solid choice.", "author": "A R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-15", "description": "Best sushi NYC. Fresh fresh fresh. Inventive delicious rolls / dishes. (TNT Truffle starter and roll are TO DIE FOR). Friendly attentive wonderful staff. I simply cannot say enough good things about Ki. I lived around the corner for nearly 8 years and went through phases of visiting once weekly. I still make the trip (from vinegar hill) whenever possible. It's just that good. GO", "author": "Joani P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-08", "description": "really good sushi. the ki roll might be the best roll I have ever gotten. Getting the sushi/sashimi special plate and a ki roll made for a great meal for my girlfriend and myself. this place is not cheap, but it is really good quality fish. The sashimi was very flavorful, especially the tuna and salmon. The decor is descent, and it was crowded for dinner which is a good sign that people want to eat here. I say check it out", "author": "Eugene R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-24", "description": "The atmosphere was rather pleasant. The tables were spaced well-enough apart that I was able to have a normal conversation. It was pleasantly dim. \n\nThe waitstaff was friendly and was average-attentive.\nThe sushi chefs were pretty cool dudes.\n\nThe food was great. I don't think it was over-the-top amazing, but I was pleasantly surprised. I had the Pikachu roll, and it was cute, but it wasn't fantastic. The TNT appetizer though was very good.\n\nThe sake was disappointing and expensive to boot. I had the \"devil-killer\" one...meh. \n\nIt is nice, and I would've given it 4-stars but it didn't blow me away enough to make me a loyal fan.", "author": "Yanina W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-08", "description": "Okay--this has to be the best sushi place that Cobble Hill has to offer at this point, and that is not a title that I bestow lightly.  Not only is one embraced by the cool zen-like atmosphere of the dining room upon entering the restaurant, the service is very attentive and the sushi is extremely fresh and generous in portion size.\n\nI've been here for dinner about 10 times since it opened a few months ago and it's become one of my favorite places to dine.  And as far as Osaka fans are concerned: do y'all know the background story on how these two places share a connection?  The old sushi chef at Osaka left and opened his own place--our very own beloved Ki Sushi.  You will see him on most nights, quick with a smile and humble demeanor and diligently making his creative rolls.  I love supporting entrepreneurs.  \n\nTry the Spicy Girl roll.  The spicy tuna hand roll is a wonderful standby-- edamame and one of those is a light meal in itself! I did not really care for the eggplant appetizer when I tried it a few weeks back.  Their white wine selections are good.  I'm not a sake drinker, so can't help you there.\n\nA great place to have dinner alone, with friends, or on a date.", "author": "M V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-14", "description": "We ordered omakase sushi and tempura dinner. Tempura was okay, nothing out of the ordinary. Sushi, which I heard compliments, well, good quality fish -- yes but not as fancy as in Manhattan Japanese sushi places. I'll go back if I want to eat sushi in Brooklyn but I wouldn't send someone from Manhattan (or elsewhere) to go all the way to Brooklyn for this. Does it make sense?", "author": "Yumi I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-22", "description": "Goddamn this was a pleasant surprise. \n\nWent out for a birthday dinner with my girlfriend and got bumped from this French place down the block because they only take amex.  And so we walked a few steps and noticed this gem. \n\nNow, I'm normally not one for fancy looking places mostly because the overbloated prices usually don't merit the food. But the prices at Ki Sushi are low, the taste is amazing, and the staff is always around. \n\nOur glasses of water never reaches half empty, our food was brought out in a very timely manner, the taste, again, was amazing, and the plates were cleared and bill brought out without a hassle or wait. \n\nI recommend this place and will go back again just to get more.", "author": "Trevor N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-31", "description": "Ki Sushi is a high quality addition to Smith Street dining. I splurged and got the Ki Choice omakase sashimi platter ($25). It had 15 pieces of really luscious and fresh sashimi that I would not have thought to get myself. I hadn't realized how long it's been since something made me pause and savor.  No regrets at all. (For reference: the sashimi regular platter is $16, deluxe is $18. Regular rolls are $4 - 10, $5 average. Special rolls are $6 - 12, $10 average.)  There are several options for sake and wine (also by the glass), but I chose beer. \r\n\r\nService was quite attentive and they were busy.  As soon as I finished a glass or a dish, it was quietly whisked away. The decor has a modern Asian feel with sleek dark woods and a fountain. The sushi bar is brightly lit, while the front of the restaurant is more romantic. Music is techno remixes, but not so loud as to be a distraction. \r\n\r\nMany will compare to Osaka (given it's proximity and target customer base). Ki Sushi is sleek (even the bathrooms), while Osaka has a homey feel and a lovely back deck. I do think Osaka still wins for presentation. But the fish was so wonderful at Ki and the tasting menu offers a chance to alter your choices. You are not going to lose with either, so I'd recommend giving Ki Sushi a try, even if you are a hardcore Osaka loyalist.", "author": "Bridget C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-20", "description": "Yummy and super fresh! Ki Sushi never lets me down. Worth every penny!", "author": "Angie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-24", "description": "The best sushi place in Brooklyn!\n\nYou must try their amazing Ki Roll!  It melts in your mouth.", "author": "Peggy O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-20", "description": "Fantastic Sushi. The best place I've been to in Brooklyn. Ki and Pikachu roll were tasty. We ordered  a bunch of rolls and sashimi for the table and it worked out well.  \nDelicious. Couldn't recommend it enough", "author": "Matt M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-03", "description": "This place was fantastic!!  I had the Spicy Girl Roll, Rainbow Roll, and Lobster Tuna roll.  Easily the best sushi I've ever had.", "author": "Megan H."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}