{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-21", "description": "The service was really terrible.  It took 45 min. to make 1 tuna roll, 1 yellow tail roll and 6 pieces of sushi.  There were 2 couples that were seated after us at the bar and both were done with their food and left before we got our food.  When we asked our waitress what was going on with our food, she pointed to tjw chefs and didn't say a word.   Still took another 10 minutes.  This is ridiculous and the sushi was average.  I don't get what the hype is about.", "author": "Husam G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-18", "description": "I routinely impress my friend by ordering delivery from here. They expect delivery to be sub-par, or un-fresh. And then it comes and they gobble it up in awe. Friends from other neighborhoods are jealous that this is my local sushi delivery place.\n\nFresh, decently priced good portions. (not so much a *bargain* anymore since they updated their menu, but how long was that gonna last?).\n\nThey also come very quickly. Very fast delivery.  \n\nNever eaten there in person. That's how good their delivery is. But I've stepped inside. Seems nice. Modern, etc.", "author": "Glen T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-11", "description": "Easily the best sushi in the neighborhood.  The fish is fresh, the rolls are creative, the ambiance is pleasant and the service excellent.  Highly recommended.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-08", "description": "Great sushi.  I loved the effort they put into their rolls and the quality of their fish was really fresh.  The prices were good, and the ambiance was also well done.  I'm not sure if I'd say it's the best sushi I've ever had, but it's definitely worth the price.", "author": "Nina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-26", "description": "Decent prices and great service. Sleek, modern design. Get the dynamite roll. It's one of the better rolls I've had. Ever. Highly recommend this place.", "author": "joshua w."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-07", "description": "This was the worst sushi I've had in my life. The fish was tasteless and mushy. I ate with three of my friends and none of our rolls were good. Highly disappointed after seeing such good reviews.", "author": "K S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-20", "description": "With 350+ reviews and a solid rating Ki Sushi doesn't disappoint. we came here for a group dinner and everyone was very pleased. I can not write a review that was not previously covered. Just go and enjoy.", "author": "Anu And Austin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-08", "description": "Why, oh why did I waste a meal here with a guy? My buddy and I decided to grab sushi so we walked into this joint on a Friday night and sat down at the sushi bar. One of the sushi chefs took care of us - we told him we'd eat whatever he gave us. We had some eggplant appetizer, arctic char nigiri, Japanese mackerel (aji) sashimi, bluefin toro, some other stuff, and the clincher - Japanese uni flown in that day (and only Fridays) from Osaka. The uni was like cool, creamy butter and probably the best thing that's ever touched my mouth. Including a couple of bottles of sake and beer, it set us back about $100 each with the tip. It was damn well worth it. If only I could get a date, I'd have taken her instead...", "author": "Albie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-27", "description": "I'd give this place a 3.5. Great service, pretty creative rolls (if you like fun American style stuff), and overall fresh sushi ... except for a salmon roe sushi my man got (so fishy, it ruined his appetite!)", "author": "Kate F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-03", "description": "I had to stop coming here when i noticed that I had spent $1000 there in three months. The prices are insanely low when you consider the quality and freshness of the fish. I'm a little bummed that they use bluefin tuna since it is endangered but there is nothing comparable in the borough, and for that matter (when taking into account the price) in the city. Taro doesn't come close, although I would say it comes closest in the vicinity The service is fantastic. I have had maybe two sinewy pieces of fish in the year that I have been coming. The steak is also superb, but who can sacrifice sushi for the steak? The rolls are inspired. I have had the Omakase a couple of times but actually prefer the lower-fi sushi special. All the toro is too rich for me.", "author": "Delilah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-15", "description": "We were looking for a place in the neighborhood and were won over by the reviews on Yelp.  Ki Sushi turned out to be very good.  The restaurant itself is done quite nicely, design wise.  For food, I had the spicy maki combination which came with a good salad, spicy tuna, spicy salmon, and spicy california roll.  The tuna in particular was really good.  The fish was fresh, melt in your mouth, and tasty.  For dessert we had the tempura green tea ice cream-- pretty good but i would try something else next time as it was not the kind of green tea ice cream i like.  The service was really good and i would definitely go back again.", "author": "Complicated Syrup Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-25", "description": "3.5 stars\n\nki didn't live up to my expectations, but with so many people raving about the place, the bar got set pretty high. still, 3.5 stars for high quality food, attentive service, and nice atmosphere.\n\nwe started with the grapefruit and prawn butter leaf salad: eight plump prawns, shredded beets (?) and a nice chili oil dressing to finish it off - totally recommend it! then followed the supreme omakase, which was also great quality-wise but left me feeling a little unsatisfied wallet-wise...\n\ni knew ki's prices would be higher than most other brooklyn sushi joints, but $34 for 8 pieces of sushi?! albeit, large pieces of fresh, delicious melt-in-your-mouth sushi... it just rankles to know that for about the same price i could've had more variety with 16 pieces and a roll at Taro OR the 10 piece sushi/sashimi \u0026 roll combo at Tomoe. yes, the fish was amazingly tender and yes, i don't think i've ever had unagi that delightfully crispy. BUT i've never ordered a 'supreme' omakase and gotten 8 pieces of fairly typical types of fish: tuna, salmon, red snapper, toro, unagi, scallop, aji, and sea bream. the chefs must not have had their creative caps on that night...\n\ni'd like to try other items from their menu, especially the ki and fashion rolls (saw neighbors' rolls, and they're HUGE -- maybe that's where i'll get my money's worth!), and their salads i've heard are fantastic (and entree sized), so i'll be back sometime.\n\nside note: anyone else notice that the name of the restaurant on the bill is 'ikki sushi'? i don't blame them for adjusting the name! :)", "author": "Jacquelyn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-22", "description": "Hard to improve on what everyone has already said in their reviews. The decor deserves some love too, it's kind of dark for a sushi place, and that adds some intimacy \u0026 mystery. The staff's great. I got the Dynamite Roll, which seems especially well suited to warm weather, due to the shrimp. And despite all the complaining about the prices, they're not really that much beyond most sushi places. If money is tight just get a roll or two \u0026 no booze, you'll be fine.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-11", "description": "Bridget C. took me here for my birthday so 5 stars off the bat for atmosphere since I was sharing such lovely company but even if it was not my birthday and I was dining alone and the busboy kicked me in my shins I'd still say the atmosphere is lovely (although I might suggest more stringent hiring guidelines).  Very, very, nice vibe.  The sushi for two consisted of an excellent variety of very fresh fish although I was pretty hungry so we ordered some rolls as well which were delightful.  Our server was helpful and knowledgeable and had a good sense of humor.  I still love Osaka but I'm pretty pumped that Ki Sushi is several blocks closer, that means more sake, less walky...always a welcome advantage.", "author": "Katie Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-30", "description": "I can honestly say, it is my favorite sushi perhaps that I have ever had.  I order it weekly (almost all pieces) and I have never had a bite that was anything but perfectly fresh.  Highly recommend.", "author": "Dan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-05", "description": "the dude next to cara and i was so weird, he kept making these bizarre jokes and when i proclaimed, relatively quietly, that the salad she got was delicious, he went \"heh, better than sex? doubt it, you know what i mean, shush now don't tell my wife.\" um, i really need to shave this black hair off so it will once again be unmistakable that we are BROTHER and SISTER and thus shouldn't be subjected to weird old man comments about sex.\n\nthat's beside the point: rolls = 8 ginormous peaces. i thought i was going to explode. i had three rolls and eight pieces of sushi. WAY TOO MUCH GOOD!!!!\n\nyum to all three of the types of eel, yum to the delicious anari tofu sushi, big time yum to the gyoza and I love me some fucking gyoza. yum to the quick, friendly service. \n\nyum to the price? well, it's night quite cheap enough to be an everynight place (taste of tokyo, how i'll always miss ya) but it is definitely not a bunker buster.", "author": "Scott P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-11", "description": "Thank you Yelp for another great suggestion.  Sushi was fresh, and the entrees were great.  I ordered the miso marinated sea bass, and it was perfect!  Will definitely be coming here again in the future.", "author": "wendy c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-10", "description": "Great service and a real gem in Brooklyn!! Not one seat was empty, it's def. a packed house when I went. I love Ki! I went with family and we shared appetizers and sushi. The service was really great and attentive. they give you hot towels in the beginning. I mean, despite the regular appetizers like gyozas and shrimp tempura, the rock shrimp tempura was pretty good! It has quite a spicy kick. I think the Ki special rolls are really what makes this place so good! Ki roll for $12.. is so worth it!! It's huge and satisfying.. tuna, salmon, caviar and gold leaf!! You have to get this when you come! It's my favorite!! Also, dragonfly, fashion roll, and pikachu is pretty good. I think you get your moneys worth when you come here!Very original creations and the decor is minimal but inviting. Love it!!!", "author": "Susan Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-04", "description": "Excellent sashimi (omakase plate, sashimi appetizers) including delicious, tiny Kumamoto oysters.  Great service and pleasant, low-key appetizers.  Highly recommended!", "author": "Katharine H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-21", "description": "REALLY yummy sushi.. this is my first entry and I decided I wanted to start off with a local favorite and Ki came to mind immediately.  I go here at least twice a month for dinner and it is always worth the price.  Not incredibly cheap, but not over priced either.  Fish is always fresh, service is great, and the sake is priced well with a decent selection.  I do have to say that dining in here is much better then getting Ki delivered.  I have ordered lunch for delivery a couple times and the sushi came carelessly packed and at a very warm temperature.  Granted, it was summertime but I live just a 2 blocks away from the restaurant.  Anyway, I highly recommend making a trip to Ki for a great sushi dinner experience:)", "author": "Victoria C."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}