{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-25", "description": "I cannot stress enough how wonderful this place is. I live in manhattan but come here all the time. The sushi is super fresh and service is impeccable. I always walk out feeling incredibly happy. :)", "author": "Stan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "This is the only place in Brooklyn that I trust to eat fresh sushi", "author": "YumyTummy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "Great food. Love their miso cod, pikachu roll and chirashi. Service can be slow sometime.", "author": "Tazmun N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "This is a nice neighborhood place. Great atmosphere. Excellent service. The food was exceptional. Seaweed salad to start was excellent. Their miso soup was flavored better than I've ever had. Isn't miso soup always the same? This was different and much better than usual. I had chirashi. It's my go to dish. This was a particularly nice preparation. Lots of fish. Egg. Pickled vegetables. I also had a rainbow roll. Very good. And one of the best salmon hand rolls I've had. Everything came out as it should. Not rushed in this busy place.  I'll go back for sure.", "author": "Seth K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-22", "description": "Very fresh sushi. The rolls I had were amazing and the King Salmon nigiri was too. The service was very attentive, although at times felt a little pushy to order. Not terrible but just enough to take a star off.", "author": "Gabe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Best sushi take out hands down. We are a good 1/2 mile away and they are usually 30 minutes or less. If you don't want to spend a fortune stick with the non exotic rolls and sushi. I usually order 4 spicy rolls and 4 pieces of sushi for the two of us and it comes to $65 with tip. Pricey but so worth it as I no longer order from our bargain place that I got sick from. Remember to get extra ginger--super fresh!", "author": "MR S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-14", "description": "Hibino was super packed so we opted for here, but I'm glad because we were seated immediately and it was delicious.  My friend apparently gets takeout here all the time.\n\nSimple but solid, tasty sushi.  I got the miso soup, spicy tuna, and salmon and avocado roll.  I was happy with the amount given as well because I was definitely full afterwards.\n\nAnd my friend got this crazy friend banana sushi roll dessert with carmel sauce which was amazing.", "author": "Amelia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-07", "description": "I came here on a Friday for lunch and got the sashimi bento box, which came with 8-9 pieces of sashimi, 2 pieces of gyoza, a California roll, rice, miso soup, and salad. The salad and soup portions were much bigger than other sushi restaurants. Most of the fish was delicious--the tuna could have been more fresh. This was definitely a filling meal. \nService was also good and fast. I will definitely come back to try other specials.", "author": "Yen N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "The ambiance in this restaurant is very nice especially for a Brooklyn sushi spot. I love the water wall and the orchids that are decorated around the restaurant giving it a nice zen atmosphere. Word is that Ki Sushi gets their fish flown in straight from Tokyo's famous Tsukiji Market. \n\nWe started off with the TNT tuna tartar ($16) as an appetizer. It's basically chopped blue fin toro wrapped with tuna in a truffle soy sauce and topped off with caviar. This was an excellent dish to start our meal. The presentation was nice and the tuna was melt in your mouth fresh. We decided to give their specialty rolls a try and opted for the Ki roll ($18) and Fancy roll due to its popularity. The Ki roll was visually fanciful with the tuna, yellowtail, salmon, spicy crunch king crab, caviar, and gold leaf. However, taste wise it wasn't all that impressive. It was definitely lacking in some sort of sauce component since it was a tad dry. The Fancy roll on the other hand was much more enjoyable. In addition to this, we ordered their supreme omakase for two which included both sushi and sashimi ($55) and the sushi omakase ($35). You also have the option of ordering a la carte for an additional price. The nigiri lineup we had included basic omakase pieces such as king salmon, toro, fluke, scallop, amberjack, horse mackerel, Hokkaido uni, and Santa Barbara uni.  Unlike most omakase places that I've been too, each nigiri here is kept pristine without aging, add-ons or garnishes so we would be able to taste just the fresh flavors from each fish. I loved that we were able to compare both types of uni's. \n\nOverall, this is one of the better Japanese restaurants I've been to in Brooklyn and would definitely return. I can understand why this remains as one of Cobble Hill's neighborhood favorite.", "author": "Annie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Best spicy tuna roll EVER! The service is great and the plum wine sweet and savory, I also recommend the spicy girl roll. Everything on the menu sounded amazing, shame I don't have a bigger stomach haha", "author": "Sandra Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "So glad I came across this lovely sushi spot... after class I was starving and looking for something delicious to eat. Thanks to yelp I found this sushi spot. Fish is fresh and generous as well. I usually order my go to Rainbow roll, spicy salmon, or alaska roll. It is always fresh and very delicious ! Love the miso soup as well. It is more on the pricey side, however you get what you pay for high quality fish !", "author": "Romina G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-26", "description": "DO NOT GO HERE.  I have never written a yelp review before (you can check) but I have also never been treated like this before.  The delivery never showed up. They started laughing when I called after 2 hours and then stopped answering my calls. Then I finally got it and had terrible food poisoning. Shame on them!", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-27", "description": "always love ki for the variety of rolls. the tnt and angel rolls are delicious, though i think i may favor the tnt appetizer more - just a yumsome mash of blue toro. the ki roll seems to have everything under the sun, and looks oh so pretty with gold flake, and tastes pretty great too.\n\nthe restaurant is ridiculously dark, even during the day (save the one lover's table by the sole window), so is especially great for first dates where you want to look mysterious/don't really want to see if they are ugly or not/you may not look your best/etc. a bit on the expensive side but tasty all the same.", "author": "Han C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Very clean restaurant and the food is consistently delicious and fresh ! Best Japanese restaurant in the neighborhood. Lunch portions are huge with 2-3 different appetizers included depending on what you order. Def recommend !!", "author": "Aziza S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-15", "description": "This is my favorite sushi spot in Brooklyn. It's better than a bunch of spots on the upper west side that I use to frequent when I lived there.  Everything I've had there from sashimi to maki to special rolls has been fresh. The service is attentive as well. I would recommend making a reservation because it is always crowded and there is always a wait on the weekends if you don't have one.", "author": "shana l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-29", "description": "It's obviously more expensive than your average sushi spot in Brooklyn but it was fresh, pieces were large, and you get a really tasty sushi.  The rolls were interesting too. I'm borderline between three stars and four because three seems bad. But it wasn't amazing but I'm impressed and wouldn't mind going again. \n\nNice atmosphere vs a quick sushi restaurant for 3$ a roll. Omakase looks worth it!", "author": "Danielle T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-09", "description": "Possibly one of the best Japanese restaurants I've been to and I've been to many.\nI introduced many friends to Ki Sushi and they all shared the same opinion and really enjoyed their dining experience here. Ki Sushi serves high quality sushi--fresh and delicious. Since I dined here many times, I will not provide a break down of what I've ordered or what you should order.\nJust know this---food is delicious ( I usually stick to the raw stuff--and also Tempura which was out of this world) , ambiance is really inviting and clean and the service is en pointe.\nThere are many Japanese restaurants along Smith Street but I always find myself going back to Ki Sushi---b/c it's really good.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Their sashimi are so fresh. I love the roll and fish, the spicy tuna roll is great . I also tried this red ice cream as dessert, it is amazing. High recommend this dessert.", "author": "Sissi G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-21", "description": "I came here for lunch when a colleague recommended it highly. For $16, I ordered the sashimi lunch ( it comes with two shumai, a salad, miso soup, rice, a california roll, and a variety of super-fresh sashimi).\n\nEverything was lovely - the price was a bit much for lunch (I wished there was a \"sashimi lunch\" option that was just miso and sashimi...) - but I cant complain on a day I knew I wanted to splurge. The quality was great... The wait for food took a while (they dont have a menu online, so I walked there, ordered, and had to wait for it. Next time, I know what to get!)... so if this is your first time, factor that into your arrival and bring home a takeout menu!\n\nI look forward to heading back there in summer, when its too hot to put anything steaming into your mouth mid-day.", "author": "Heather H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-16", "description": "My new favorite sushi spot. I love sushi and I have paid more for good sushi before but this place is amazing!\nThe fish is shipped from Japan and New Zealand, wild caught and extremely amazing in quality. The fatty tuna melts in your mouth. Wild caught salmon is incredible and the umi - sea urchin smells like canna butter and tastes like happiness. Now the bill for a party of four was close to 300$ but that included 2 appetizers two salads 4 supreme omikases 4 deserts and 4 alcoholic beverages so I think it was absolutely fair for the quantity and  quality of food. We will definitely be back here and will sing this place praises - best sushi in NYC and this is coming from a sushi lover. Also big kudos to the staff - accommodating and friendly - I called at 9:30 for a 10pm reservation they were able to accommodate  even though the place was packed out. Server and food and drinks all arrived promptly and the waiter was very nice and went on to describe what fish was which on the omikases and where it was shipped from :) I am impressed and delighted", "author": "Maxi M."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}