{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "Absolutely amazing! Great service, savory and delicious choices!!! Highly recommended.", "author": "Sabrina D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-01", "description": "Kikiki\n\nGenerally, sushi rolls are a huge turnoff to me.  You know, most rolls are just variations of California rolls with lots of fried stuff and sauces.  But Ki's rolls are a lot better.\n\nSince we went for lunch, we decided to try the 2 roll lunch special for $11 per person.  The meal started with an inexplicably delicious bowl of miso soup.  The tofu was perfect, the seaweed was great, and the flavor of the miso was the best that I've ever had. Next, came the salad.\n\nThen, our beautiful rolls came out.  I had the Shrimp Tempura Roll and Spicy Salmon Roll.  He had the Eel Avocado Roll and the Spicy Tuna Roll. All 4 were fabulous but if I had to pick a winner, I would say that the Spicy Tuna was the best.  The tuna was incredibly fresh and the mix was actually kind of spicy.\n\nAt first I thought I'd be hungry but I soon realized how much food it really was. Service was good and the price couldn't have been better.", "author": "Yi Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "I am super impressed at this non Japanese owned Japanese restaurant. I am always skeptical about dining at a non Japanese owned sushi place. After reading all these reviews, yelpers are right.\nOwner paid alot attn on food presentations, details and service. Fish was fresh and dessert was delicious. Price also very reasonable.\nWill definitely return soon.", "author": "FU F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "Fancy Roll - Uni\nFashion Roll - Eel\nSpicy TNT Roll - Tuna\n\nThe sushi was fresh and the combination of flavors was good. This is great place for rolls and entrees. Waiters were very attentive and accommodating. \n\nWe came here before a concert at Barclays and were seated right away. \n\nThe dining room was a bit dark for my taste which is why I am giving only 4 stars.", "author": "Sunita S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-13", "description": "Really incredible sushi at a fair price. The Truffle TNT was AMAZING. A ball of crunchy, truffley, tuna covered deliciousness. The sake reccomended to us by the waiter was dry and super smooth; a great compliment to the meal. The fish was impeccably fresh, and it was obvious from the way my Naruto roll looked that it was some quality tuna!\n\nSince my first visit here over the summer, this has become my go-to sushi place in Brooklyn. In fact, everyone i've brought here has agreed this may be the best sushi place in the neighborhood! It's also not a struggle to get a seat here on friday/saturday nights which is a major bonus as reservations are generally non-existent or just a major headache in the area.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-06", "description": "To date the best sushi I've ever had. Never have I had a single piece of sashimi or sushi that had a foul taste. Appetizers are all amazing from Tartare to mushroom truffle. I've even had friends who ordered teriyaki steak and loved it. \n\nThe menu is massive and there's always something different to try. The restaurant has a laid back feel to it and the service is always on point. Prices for specialty rolls can be more than most sushi restaurants, but the final product is well worth it. Dessert, also, outrageous. \n\nMy preference would be to share platters with those that you are dining with you.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-06", "description": "This is some of the best sushi I have ever had. It was packed when I walked in which was obviously a good sign. The staff was friendly and the environment nice. I would definitely be back.", "author": "Perry T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-20", "description": "Very crowded Brooklyn establishment. I came here on Friday night and had to wait about 15 mins for a table even after calling ahead and putting our name in.\n\nThe sashimi was good, the \"special\" rolls were only OK. \n\nThe decor is nice, the service only ok. Beer and wine only - no alcohol.\n\nI would go again, but change my order.", "author": "Sasha B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-30", "description": "Really awesome sushi. I came here a few times with my boyfriend and we both loved this place because it was small and served really fresh sushi. The sashimi is super fresh and the sushi rolls are really creative and delicious. Totally recommend if you are in Brooklyn.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-20", "description": "Service was great, attentive and very fast. Food was reasonably priced, and arrived quickly, sushi was fresh and nice variety. My roll however was a bit large, that may not bother other people but I like my sushi to be bite size, and gigantic rolls detract from the experience for me. A solid option for the area.", "author": "Sara L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-20", "description": "Best sushi I've ever had! Expensive but so good and fresh. The restaurant is small and dark. Go here for a romantic date and for some delicious sushi! Worth the price.", "author": "Edyta K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-16", "description": "This is my favorite sushi spot. I always get the chirashi bowl. The sashimi is always fresh and the rice with vinegar is always on point. Also, if you don't like sushi, I recommend the duck udon noodle soup. I think it's strange to go to a sushi place and not get sushi but the duck is perfectly cooked and absolutely delightful.", "author": "Carolyn H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "Great sushi and atmosphere!! Best tuna tartare I've ever had!! Loved the plum wine too!!", "author": "Linda L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-11", "description": "Excellent service, delicious food (I ordered the Supreme Sushi Omakase- I have been to Japan and the fish used was delicious!) The waiters explained every part of the meal and were polite and accommodating. I look forward to going back and trying more things.", "author": "Elana A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-05", "description": "What a decadent dinner from start to finish! I'm a long time sushi lover and critic. I've have had sushi in many countries and states and this maybe one of the best places I've eaten. The fish is extremely fresh. The TNT lovers roll is so perfect. This place may actually beat out Nobu and blue ribbon... The service was also quick and friendly.. The best part: we made a reservation and were seating immediately ( when is the last time that happens??!?)", "author": "Julia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-08", "description": "Absolutely excellent. Incredible quality and remarkable value. The omakase is delicious.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-04", "description": "Took my husband here for his birthday. The presentation for all our food was beautiful! The Ki roll comes with gold flakes on top and a rich array of colors. The Ki roll melted in my mouth, it was so decadent and velvety. My husband really enjoyed the Pikachu roll, which had tempera shrimp, tuna, salmon, yellow tail and caviar inside. \nWe also ordered a eel roll and King crab roll. The crab roll was horrible. They used fake crab meat instead of King crab. \n\nThe specialty rolls are worth eating. Will definitely come back for lunch.", "author": "Doreen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-29", "description": "Perfectly decent takeout sushi. Fish was a little chewy. Stick to the simple rolls.", "author": "Ben W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-04", "description": "I'm back on yelp after a hiatus and giving the honor of my first review in a long long time to Ki Sushi. As a semi-newbie to the nabe, I had been to Ki once before years ago and recall being impressed. I can say that it definitely lived up to how I remember it.\n\nI went there with a girlfriend for a light dinner. We started with the edamame, which was perfectly cooked and well-salted. My friend ordered the seared tuna salad, which she's had a number of times and raves about. She topped it off with a spicy tuna roll.\n\nI ordered the peach roll off the special menu. I'm not big on special rolls generally - I often find them to be cumbersome and messy, but this one was simple and delicious. I also ordered my go-to salmon avocado roll, and a piece of yellowtail sushi for good measure. Everything was super fresh and tasty.\n\nOur waiter was friendly and my water and green tea were never empty.\n\nCan't complain about a thing, really.", "author": "Marissa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "Best sushi spot in Brooklyn, and arguably the best in the city apart from a small handful that are mega expensive (think Yasuda).   Highly recommend for any occasion whether lunch special, delivery dinner, or romantic dinner for two or even large groups at the restaurant.  All of the rolls are solid, but suggest you take special note of their Miso Cod and Magura Avocado dishes as exemplary plates.  \n\nA long-time regular, Ki has ruined all other sushi for me as I can no longer eat at the standard places and thus have made Ki as a top 5 local establishment for dinner whether deliver (stick to rolls) or in-person.", "author": "Eric L."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}