{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "Pretty good Sushi. Great Shrimp tempura roll! I also had the avocado salad which, welp is just salad and avocado, can't go wrong. California roll is good too. Nice for a date and just good food.", "author": "Mallory A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-19", "description": "We were there in Valentine's day and I must say I was surprised how good it was.\n\nExcellent food, really good service even with the place full. I really recommend it.", "author": "Marcelo E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "I first gave Ki sushi a three star rating but upon further review its a four! The sushi is just so damn good. Sushi deluxe is fantastic and the Ki roll is my favorite roll ever! It is a more expensive sushi restaurant than most places in brooklyn but the quality is well worth it. Clearly my go to place for sushi dinner. You probably want to reserve a table on friday and saturday nights.", "author": "Anthony P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-17", "description": "Waiters/waitresses are very attentive! Been here many many times and the food is always fresh and delicious. Cozy date place-one of our absolute favorites!", "author": "Elaine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-12", "description": "This place is awesome (thanks Yelpers for the recommendation and truthful reviews). It is a second to Morimoto's but the prices are competitive.\n\nI highly recommend the Ki roll, beautifully presented with ground tuna, shrimp, and salmon, two types of Tobikko (red and black caviar), and leaf of gold. It is structurally designed like sushi and not a roll. Also tried the shrimp tempura, which is topped over salad, and dressed with a spicy-mayo sauce. Also, generous portion of uni sashimi (It is not on the menu, you have to ask for it).\n\nUploaded the photo of the Ki roll, but it is hard to miss at the restaurant. You'll see platters around.", "author": "A H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-13", "description": "I came here last night after reading the praising reviews on Yelp and after  trying out the food, I was a bit disappointed.\n\nDecor - when you walk in, you immediately notice the decor.  Hard wood floors, Hard wood tables, dimly lit.  The restaurant at that time was empty but after an hour, had a comfortable number of people.  \n\nWhen the waiter came up to us to take down our order, I was not too sure what to order in terms of sushi.  So I asked the waiter for any recommendations from the sushi bar and he gave me a blank stare.  I repeated my question and when he heard the word \"sushi\", he pointed towards the menu.  So it was obvious that he was not fluent in english so I just ordered Chicken Teriyaki and Spicy Tuna roll.  My friend ordered the Sushi Deluxe.\n\nWhen we received our soup/salads, he asked me how my soup was and I said \"eh.. \" and I asked him how his salad was and he reponded \"eh\".\n\nOur entrees then came.  My Spicy Tuna roll was a good mix of Mayo, Tuna and crunch.  The overall taste was okay, nothing out of this world.\n\nThe chicken Teriyaki was nothing to rave about.  It was thinly sliced chicken strips with teriyaki sauce and some veggies.  It reminded me of \"Go Sushi's\" chicken teriyaki for $7.00, not much texture to it.  \n\nI've tasted my friend Sushi Deluxe (Tuna and Japanese Fish) and that was pretty decent.  I would not say it was the best sushi in NYC but it wasnt bad either.  I believe my friend wasn't too impress with their food either, in considering the price of everything.\n\nWould I go back - Probably not and recommend to try out other sushi locations around the neighborhood before going to this restaurant.", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-07", "description": "Reasonably priced, amazing salmon, toro, uni and scallop nigiri and you can usually get a table quickly. I'll be going back here for sure.", "author": "Paul C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-27", "description": "Best sushi in the neighborhood hands down. The Fashion Roll. That's all I need to say.", "author": "Elyssa S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-18", "description": "On my last visit, Ki Sushi was a huge disappointment. I went for lunch and ordered the Chirashi. It was beautiful with huge pieces of fresh fish in a bowl with generous amounts of sushi rice. Unfortunately, 3 pieces of sashimi had bones. We informed the waiter who said he would replace the pieces of fish for me but imagine what could have happened. Choking hazard! I hope someone that works there knows CPR. Also, the service was lacking. My cup of tea was left empty the entire hour we dined there. I used to love this place.", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-12", "description": "You are smoking something pretty heavy if you give this place anything under a 4 star rating. And in that case please share it with me because life gets rough sometimes.\n\nEVERYTHING I have eaten at this place was just ridiculously amazing!\n\nThe black Cod = 10\nThe Chilean Sea bass (have not tried the one with the noodles YET) = 10\nThe Lobster Tuna roll in wasabi cream sauce OMG = 10\nThe seafood dynamite = 10\nThe sushi Slap your mama 10\n\nAnd I've tasted my friend's entrees and they were equally as tasty\n\nLove the ambiance sweet!\n\nSo the Asian staff has limited knowledge of English big surprise! As long as you bring me what I want then we're in good shape.\n\nIt can get pricey. Average Appy is $10, Average meal $22, glass of wine about $10. Meal portions are smaller (Just enough for me) but just letting you know don't expect your Mama's size plate of food. \n\nDid forget to say that I love this place? Wonder if it is single?", "author": "Chris M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-24", "description": "So you really want to try Japanese cuisine... Then you'll find the right spot at Ki Sushi at 122 Smith St in Brooklyn. I can't say I'm a food expert, but I've been searching and searching for a real traditional Japanese style restaurant around New York City and was never truly deeply satisfied.\nBut tonight, on Christmas Eve, my hubby and I were talking a walk around Carroll Garden and ended up eating in this small cozy restaurant, where we ate the best sushi and an overall Japanese food ever...I would say the best price-quality in town. Kind smiling staff, real Japanese master chefs preparing food non-stop behind the bar and a modern Feng-shui taste environment.\nAt the beginning when they brought us a very small yellowtail tartare, we were a little disappointed for the price-quantity; but then after tasting this delicious dish, we decided it was totally worth the price because the fish is fresh and you can taste it! Then we ordered the Ki roll and what Japanese restaurant in town uses real crab meat instead of surimi? Only the expensive ones. And this one. Everything is fresh! \nHighly recommend! Highly satisfied!\nOther than that, it's always nice to go for a romantic walk in Carroll Garden...\n\nMarina \u0026 Andrew", "author": "Andrea B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-20", "description": "I got very bad food poisoning last night from this place  1/19/2015. Had yellow tail tartar and 2 rolls. Been throwing up all night. Now in bed with a fewer", "author": "Marie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "I was really impressed by the quality of the food here. I ordered delivery from Ki for lunch and was not disappointed. Their lunch boxes are a great deal and come with soup, salad, rice, and shumai. The sashimi lunch special came with about 10 thick slices of fresh fish. I admit that Ki is pricier than other sushi joins in the same area but you definitely get what you pay for. The rolls on the menu also sounded yummy. I will try them next time!", "author": "Tiffany T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-10", "description": "This is my favorite sushi restaurant. I have never had anything there that I didn't like. The Ki Roll is the best flavor experience that I have tasted. I recommend going with a group and try the different rolls and appetizers. The service is great as well, I don't think that you can take two sips of tea without someone refilling your glass. The banana spring roll is an excellent way to end the night.", "author": "Milena M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-11", "description": "Best Japanese I have had in Brooklyn.\n\nVegan / vegetarian options out the wazu. The veggie rolls were good, and there were plenty to choose from. I REALLY recommend the Warm Wild Mushroom Salad and the Oshinko Salad from the appetizers section of the menu - delish + generous portions. I shared these + 2 rolls just for me and was very happy.\n\nFish eating boyfriend offers a thumbs up as well - he says the fish is solid, and the salads were special.\n\nWe spent what we usually spend at a Japanese restaurant.", "author": "Stephanie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-27", "description": "The sushi is fresh and delicious. Some of the best I've had in NYC including Gari, Yosuda, Sekki, Bako.", "author": "Brad H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-08", "description": "I really wanted to like Ki Sushi, and came here for a nice anniversary date.  The food was OK.  If you have never had homemade miso soup, or udon that was not made with a broth packet, then it would be hard to tell that this food is not made from scratch.  Also, the sushi was just not good.  The fish (tuna especially) was almost tough and metallic tasting.  The rice was also a bit over-seasoned for my liking.  I know this place has a lot of fans, but it really is hard to get good Japanese food in Brooklyn, even when the establishment has Japanese owners (this place doesn't).  I won't go back because the basic flavors and preparation were too inauthentic for me, but they did have an extensive menu with a lot of different choices, so maybe other dishes would have been better.  I don't recommend this place for people who have enjoyed food in Japan.", "author": "Misa M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-14", "description": "Pad Thai sucks, it totally smelled like FART!!!!  The waiter told me it was the Basil lol Funny that the other Pad Thai on the menu had Basil... NOT the one that I ordered... My girl loves sushi and even her plate sucked!!! I honestly think that this place is being ranked way above it's true intention. Will NOT go again... Blah!!!!", "author": "Bklyn B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-21", "description": "It's a complete rip off!! $15 for 2 scallops. The sashimi was ok but too little for too much money. Go somewhere else!", "author": "Simon H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-09", "description": "Really excellent sushi. Besides flying in fish from Japan, little things like the salad dressing and the hot towels make this the best place in the neighborhood. Safe for gluten-free folks (they have tamari and never mess up a GF order). The chirashi lunch special can't be beat.", "author": "Max F."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}