{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-04", "description": "The ambience and service elevate this place from being just another mediocre sushi joint with a bunch of funky eel-sauce covered, tempura-flake-filled special rolls.\n\nSure, these rolls tasted pretty good, but they really weren't anything special, and are definitely on the more expensive side.\n\nWe got the Salmon Skin Roll ($5), one of my standby favorites, which was done pretty well here. The Dragon ($11) was a little bland, and nowhere near some of the better ones I've had. The Peach Roll ($13) sounded interesting, as it had sliced peaches on top, along with tuna, avocado and caviar inside. I expected the deliciousness that you often get with combos like these, such as the more commonplace rolls that are made with mango, but this one also tasted kind of bland. Maybe the peaches were going bad or something, I dunno. Lastly, I also had the Angel Roll ($16), which was definitely the best one. This had seared tuna and asparagus inside, along with salmon, avocado, eel and tobiko on top. This was the tastiest of all, mostly owing to the eel and the eel sauce slathered all over the top.\n\nAs mentioned above, the atmosphere in here is very nice. It is dark and intimate, and would serve well for a nice date, or a night out on the town alone to sit at the sushi bar. The service was also very good. There seemed to be an army of waiters and busboys that refilled my tea every time I took a sip, but they did it in a nice, non-obtrusive way that I appreciated, even though I had to go to the bathroom constantly for the rest of the night (also, this is another huge plus, as it wasn't one of those annoying sushi places that charges you $5 for a tiny pot of tea that gives you two cups worth).\n\nI guess I might come back here, maybe to try the omakase next time or at least get some of the sushi pieces instead of the special rolls.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "This place is such a hidden gem in Brooklyn! I came during lunch and was welcomed into a peaceful oasis. The restaurant it dimly lit which makes it very intimate. \n\nI ended up getting the sashimi lunch special, California uni and Hokkaido uni (which is the FIRST time I've ever seen it in a restaurant!) \n\nTheir fish was fresh out the ocean alright, every piece of sashimi was great. It came with salmon, tuna, stripe jack and yellowtail. Their uni was fantastic and I was informed that it gets delivered from Japan every Tuesday and Friday morning. \n\nI loved being able to compare California uni with Hokkaido uni. In terms of looks and taste, there really is a difference. Japanese uni is much more orange and bright. It has a semisweet after taste that makes it better than California uni. Boy I could only dream of one day going to Japan to eat it on a daily basis.. \n\nBoth the uni were creamy and fresh, the shapes of the uni were different too based on its origin. While I looked at their menu, I saw they had blue fin tuna from Spain! I didn't have a chance to try it since I was pretty full from the sashimi special that came with a soup, salad, california roll, gyoza ( which was more like shu mai ) and rice. The miso soup was great, you could definitely tell it was made fresh and not packeted miso where people add water to it. The soup even came with enoki mushrooms, that's the first time I've ever seen anyone do that. The California roll was one of the better ones I've had compared to my history of California rolls, the avocado was really fresh and smooth. \n\nI could see myself coming back here to try more of their nigiri and possibly omakase. \n\nDefinitely not a place to miss if you're around the area.", "author": "Virginia Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-10", "description": "Went for dinner with a friend. Was pleasantly surprised. The tables are standard sushi spot close, but somehow I didn't feel like I was sitting on top of my neighbor. Most importantly the service was great. No one hounded us for what we wanted to eat. \n\nThey allowed me to modify one of their speciality maki rolls, the spicy girl (I don't like spicy tuna.) And the food was amazing!! It came out super super fast. I ordered a second roll after devouring the first. It was so good\n The fish was like butter. It almost melted as soon as I put a piece in my mouth. \n\nI will certainly be back. The prices are great, food was tasty and the service is good. I would avoid the 7 pm hour, it gets really busy and you have to wait.", "author": "Mikki D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "This is my favorite sushi restaurant in town. I live all the way by bay ridge and I drive to this restaurant at least once a week. The sushi is amazing. When it comes to rolls, I'm very basic. Salmon roll, toro roll.. etc.. so when I found a place that made the \"basic\" rolls excellent, that's exciting. It's very fresh. The appetizers are also really good. The waiters and staff are super sweet. Definitely one of my favorite places in Brooklyn.", "author": "Aspen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-29", "description": "My favorite sushi in Brooklyn easily.\n\nWell priced. Great staff. Try the Shishito Peppers and the Fantastic roll.", "author": "James G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "This is the best sushi that I have had in NYC (for the price point I can afford). \n\nDefinitely the best in Brooklyn. \n\nYou cannot go wrong - from the miso soup, seaweed salad (which I don't usually like at other Japanese restaurants), to the sushi or the handmade inaniwa udon soup (great when you are under the weather).\n\nThe service is top-notch. The food is always nuanced, subtle, fresh and bursting with flavor. \n\nWe recently had the Supreme Omakase for my spouse's birthday dinner and it was SO fresh, interesting and tasty (Note: we asked them to substitute sea urchin).\n\nThis is one of the rare restaurants where I can say \"pretty much everything is good\". \n\nTip: You can make reservations! This is a good idea, because it is always packed.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "Went for a late night dinner last night.  Hostess was prompt n friendly. Service was fast. Sushi rated fresh.  Eddie and I enjoy the meal so much we will definitely go back again.", "author": "Diane V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-07", "description": "SPOILER ALERT: Nothing BASIC was ordered.\n\nWe ordered the Supreme Omakese each at $55 and WOW. Just WOW. \n\nOmakese is a Japanese phrase that means \"I'll leave it to you\". So basically, we told the chef that we would let him decide what to feed us and boy, oh boy did we make the right choice. \n\nAll of our fish selections were air shipped from Tokyo, according to the menu, which simply added to our excitement. Once we got our dishes, the server explained what every single piece was and we were in heaven! \n\nWorth every penny, the sushi is the freshest sushi and sashimi I have tasted in ages. We had some wine (me = french malbec, and her = pinot grigio). My Malbec was smoooooth and silky. \n\nI decided that I will be back to indulge in the greatness of the sushi quality here, once a week. \n\nImpeccable experience.", "author": "Cyrus P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "We were going to go to a place in our hood, but glad we traveled. \n\nThe atmosphere was nice for a date and the fish tasted high quality. We got the sushi platter, Ki roll, TNT lover and fancy roll. The Ki roll was our least favorite, only because it was so hard to eat. The TNT and spicy girl didn't need anything added to it, it was so tasty. \n\nThe best part was the price, to stay just under $100 with all that sushi is rare, especially when the sushi is actually good.", "author": "Sean C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-13", "description": "We were very impressed by Ki Sushi.  We were wandering around Cobble Hill, looking for a good place to eat, and I found this place on Yelp.  Seeing as how it had gotten 4 stars with hundreds of reviews on Yelp, I thought it couldn't be bad, so we decided to check it out.  We were both skeptical at first, given the prices and the fact that this place looked \"trendy\" in the sense that it was trying a bit too hard to be cool.  However, once we had our first bite of sushi, we were both sold.\n\nBetween the two of us, we ordered the garden salad (extremely fresh and a very generous portion for just $3, and it came with an amazing ginger salad dressing that was like none other), spicy tuna roll (so fresh and very large and generous 8 pieces, full of fish), spicy salmon roll (again, very delicious, large, and generous!), Pink Lady roll (salmon tempura, yellowtail, tuna avocado and masago roll in soy bean paper) and the Fashion roll (spicy lobster, yellowtail jalapeno topped with yuzu tobiko and fresh scallop).  The Fashion roll was by far my favorite - the spicy lobster and the combination it came with was just simply out of this world.  There were fireworks in my mouth.  Wow!\n\nWe were very impressed with Ki Sushi.  The fish was fresh, the portions were generous, and customers truly get their money's worth.  It is my new favorite sushi restaurant in NYC.  Amazing!", "author": "Pegah Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-04", "description": "I ordered a takeout, the lady called my phone twice when I was on my way there (it took me less than minutes to walk there), she was very rude on the phone yelling at me \"are you gonna pick it up or not?\"...When I got to the restaurant, she immediately gave me an attitude and \"blamed\" me for showing up late (it literally took me 10 minutes to get there), I realized she was rushing to leave work which explained why she kept calling me to pick it up. Wow, I am very amazed by how someone like can still be working as a server (worked as server during my college days, I know the drills).", "author": "Qing J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "I'm not sure what took me so long to discover this place. I pass it every day on the way to work and they're known for great delivery. But I finally went for dinner and it was well worth the wait of 30 minutes on a Friday.\n\nThe reason I passed it so many times without looking up? You'd barely notice it. The restaurant is typical New York (deep, not wide) and barely takes up much storespace. But once you're inside it's cool and perfect for sushi consumption. \n\nThe price? Moderate. The service? Fine. The food? Amazing. I'm not one to spend hundreds of dollars on raw fish, so I can confidently say this is the best under $40 sushi meal I've had east of the Mississippi. Really anything you order will be fresh and melt-in-your-mouth good. \n\nIf you're a person who orders delivery in Cobble Hill (I'm looking at you, parents) then why leave the house? THEY WILL BRING THE FOOD TO YOU. Next time I'm on a Netflix binge, I'm calling these guys.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Absolutely phenomenal. Salmon perfectly glazed, sashimi and sushi rolls immaculate. Hot and cold sake had beautiful flavors. Dessert was perfectly balanced. Quaint ambiance and wonderful presentation. Professional service.", "author": "Dallas L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "I was in the BK area and decided we wanted sushi. I looked up places and found Ki Sushi. We showed up around 6pm on a Saturday. The place was busy for dinner. We didnt have a reservation. So we left our name. Hostess told us 30-40mins. It actually took 20mins. Which was great. \n\nOnce we got seated we received a hot hand towel. That was a nice touch. Then we received lemon water.The place was dimly lit and the decor looked very modern and unique. We ordered the Fantastic Roll, Angel Roll, salmon avocado and salmon skin roll. Wow from the 1st bit to the last bite, the sushi was so delicious and amazing!!! Just wow. We are so very glad and thankful we decided to pick this sushi restaurant to go and have dinner.\n\nThe food and the service was top notch and the prices were reasonable. For the freshness of the sushi and the quality. its definitely worth it. I would come to this place over and over again. Everything on the menu look great. You cant go wrong with any items off the menu\n\nThank you for the great service and the amazing sushi. We will be returning very soon!!!", "author": "Johnny A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-04", "description": "Love this Japanese restaurant a lot!!! Great portion and very nice quality for the price. I do not like much rice in my sushi in general (I always peel the rice layer off because for me  it's always thick at other places, I just order sashimi instead). My boyfriend ordered sushi roll here and it was amazing! Thin rice layer but you can still taste it. The filling is amazing. We even ordered two more rolls to go and finished it in a second the next morning. Highly recommended! We're definitely going back.", "author": "Lutao X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "This place was recommended by an employee of the Marriott. The service was excellent, prices reasonable, sake menu needs to be expanded. The atmosphere is very nice, tables are a bit close, however it is the city. The place was filled with locals, couples, and a few businessmen. The sushi was well prepared and would definitely recommend and plan to visit this place it the future again.", "author": "Thomas H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "One of the best in Brooklyn, except for the exorbitant prices. The supreme omakase hasn't changed since I began going there when it opened. Madai, fresh saba - tart, but not overly pickled, the ever so luscious toro, buttery as I've ever had it. And it's like their anago is boneless! It's got like, a fluffy consistency, soft in the mouth. And I never pass up the opportunity to get a Kumamoto oyster with sour ponzu sauce! The shredding, sweet king crab is another gem as is the Hokkaido uni - the latter being denser than its California and Maine counterparts. Something new I found in my omakase was a blowtorched botan ebi with yuzu tobiko. A pleasant surprise! I always make sure to get an extra piece of toro and anago (which come with the supreme).\n\nIgnoring the prices, the Fashion roll is great with fresh raw scallop on top, spicy lobster with yellowtail and a sliver of noticeable jalapeno, and yuzu tobiko. So is the peach roll (I'm usually a purist, but sometimes I crave fusion (it's a shameful pleasure). What used to be called the Red River appetizer (now the Tuna Lobster appetizer) is as its (new) name suggests. Spicy lobster wrapped in tuna, no seaweed, no rice. Black caviar and, pointlessly, gold leaf adorn the top. The creaminess of the tuna on lobster is one-note, but pleasant, so it's good, while the black tobiko burst in your mouth.\n\nThe other ridiculous thing besides the prices is the lighting. Make sure to bring a headlamp. Like, even by date standards, it's dark. And then they have small children running around in this \"romantic\" atmosphere. Weird.\n\nStill, it's amazing sushi. The people that call it mediocre, crap, unworthy of takeout are insane. Truly. It's not perfect, but it's damn close.", "author": "Russell L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "Nice ambience and interior! The waiters are all very friendly and attentive. When we sat down they even gave us fresh hot towels to clean our hands! \n\nWe got the TNT Truffle appetizer and it was amazing! And definitely get the Ki Roll -- yes, those are gold leaves on your sushi! In contrast, the Fancy Roll pales in comparison.", "author": "Jessica T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "Hands down one of the best sushi restaurants in Cobble Hill. These guys are packed every night and rightfully so. I've literally never been disappointed at this spot. Great sushi. Low key vibe. Nice neighborhood feel. Friendly staff.", "author": "Kitten T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-30", "description": "Went with my father because he introduced me to sushi as a child, and it was really a great experience. Very calm, classy vibes, the staff was super nice.", "author": "Nina F."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}