{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-23", "description": "Favorite sushi place in Brooklyn. The rolls are delicious, the sashimi is super fresh. The restaurant has a real nice atmosphere, and the the wait staff are efficient and friendly.", "author": "M V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-30", "description": "Amazing service love the seat at sushi bar men making sushi so polite and helpful but most times large line", "author": "Lizzi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-14", "description": "best sushi in BK. Lunch special is amazing deal!", "author": "Mike D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-14", "description": "This place is great!  The food is excellent, the service is prompt.  The fish was so fresh and, as a former sushi chef (yes, I know that I am a woman and not Japanese) the rice was excellent!  Loved everything.!", "author": "Trina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-08", "description": "Let me just start by saying I'm not a raw sushi kind of girl. I'm fine with plain California and cucumber rolls, miso soup, and maybe some mango ice cream. That stuff is pretty much the same everywhere, right? \n\nThe atmosphere is awesome. It's tiny and dark and warm and friendly. That's why I'm giving this place a 4 instead of just a 3. The service was awesome and started out with a hot towel to wash our hands. What a great idea! Walking around a city and riding the train can be a disgusting adventure and I like nothing more to wash my hands before I eat. Being able to do that at my table is fantastic.", "author": "Elle L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-04", "description": "This place is so good and is such a great value I can hardly contain myself.  The lunchboxes are a ludicrously good bargain and their stake dish is absolutely fantastic.\nI like this place so much I was hesitant to review it.", "author": "Jeffrey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-14", "description": "you know you've picked a good place when you're getting the delivery and your next door neighbor says, \"good choice.\"  As a first-time customer, I was impressed with the service on the phone, prompt delivery and really delicious food - the sushi is excellent.", "author": "Christiane C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-21", "description": "I went to Ki Sushi after the recommendation from my Japanese hair stylist. My husband and I decided to try this place on a Friday night. We ordered our typical mix to test out the quality of their food. Since this was our first time dining at this restaurant, we went with some popular items...we figure that if they can't get the basics right, we might have a problem with this place.\n\nAppetizer\n- Shrimp \u0026 Vegetable tempura (I know, how boring): The batter was excellent, flaky, and not too crunchy or oily either. The tempura sauce was ok, although too little horseradish. The sauce was not too sweet or too salty either which is perfect for my taste.\n\nSushi and Sashimi\n- Fantastic roll (Special roll) - this is an excellent roll and perfect for sharing especially for people who loves spicy rolls like us. The roll was good size and what's special is the jalapeno tobiko on top. 4 stars\n- Spicy salmon roll (Basic roll) - I always ordered one basic roll. Like I mentioned some restaurant really mess it up with chopping the salmon (or tuna) and premixed with spicy red sauce. It totally kills the taste of the fish and then the sauce just overwhelms you. Not this spicy salmon roll. The fish was not chopped, the sauce was not overwhelming. 4 stars\n- Sashimi: we ordered 2 pieces of fish specials flown in from Japan. Both was so great (Golden tail and Alaskan something).. mild in flavor and a hint of sweetness. We also ordered a piece of Unagi (this was ok) and Anchor Char which was excellent.\n\nAll in all, I have to go back to Ki again soon to try my other favorites. The price was right. Best sushi I've had in Brooklyn!", "author": "Nikki M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-12", "description": "Wow.  There are a lot of wonderful sushi places in New York, but Ki Sushi is hands down my favorite.\n\nEven though there are 5 or 6 other sushi places within a 6 block radius of Ki, I always go to Ki -- and take all sushi lovers there.\n\nApart from delicious food (even for non-sushi eaters.... the Scottish salmon entree with baked yam fries is awesome), their service is spot-on.  Upon sititng down, you are handed a warm towel and your water glass never goes unfilled.\n\nHighly recommend the Pikachu roll, Volcano Roll, Peach Roll, and garlic broccoli appetizer.", "author": "Andy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-17", "description": "Food: 5 stars. Price: 4 stars.\nLove the food here. Can be a bit crowded at times but they consistently have good sushi. Have taken friends here from out of town and they enjoyed it. The only downfall is it is a little pricey...I have gotten sushi this good for less.", "author": "John H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-07", "description": "What can I say about Ki Sushi? One word \"Amazing\"!  You have to try the Ki Roll, not on the cheap side but definitely the best sushi in Bk if not in NYC.", "author": "George U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-04", "description": "One of my favorite things about Japanese restaurants in NY is the service. fast, friendly, and free of any fake niceties. Although this place is always full it only takes a few minutes of wait to get a table. \n\nAside from the great service, the food here is excellent. I have tried every specialty sushi in this store and highly recommend the Peach sushi. \n\nThe size of the rolls are immense and flavorful and one should be careful for ordering too much.", "author": "shak p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-11", "description": "Awesome atmosphere - Calming waterfall, dim lighting, relaxing music.  Enjoyable experience.  Eel \u0026 Avocado Roll - delicious!  Sapporo - nice and cold. Lunch was reasonably priced.  We ordered the two roll special which came with delicious miso soup and ice cold salad with thick ginger dressing.  The rolls were a great size.  All for $10!!  Service was excellent.  Will definitely go back", "author": "Yessica G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-25", "description": "Excellent food. Excellent staff. Fast and friendly. The only problem is the noise level. I could barely hear my friend while at dinner on a saturday evening.", "author": "cary s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-14", "description": "Will only note that it is more expensive than the 2 stars on the list. To really experience the offerings and not nit pick the menu- my solo meal (chef's selects) with sake finalized at $80. I enjoyed the experience but would agree with some of the average reviewers that felt it is extremely fresh but not innovative.  So why not honor another restaurant that prides itself on fresh and not location or atmosphere etc. I will recommend it to others and travelers, but it won't be a local hero for me.", "author": "Suzi W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-19", "description": "I'm obsessed with their evergreen roll - easily the best veggie sushi roll I've ever had.  That and a few of their ginormous sake-in-bamboo carafes, and I'm pretty much in heaven!  \n\nA few complaints tho': \n\n1)   Comfort: it's ALWAYS really cold in there.  I guess that's good for fish, but I will go back into my apt to grab a sweater/scarf (year round!) if I know I'll end up there later.  The banquet is really uncomfortable to sit on and the pillows are like flat bricks.  I'll take the chair, thanks.\n\n2)  I really wish they would offer brown rice on their rolls.  I can see the purists (quite possibly the staff too) rolling their eyes, but why not just make a little brown rice?  Debaucherous health nuts like me would be soooo happy.  And I'll take another bamboo carafe thing too, wheeee!", "author": "O R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-21", "description": "The rolls are delicious here.  A little pricey for what you get considering there are better options in the city (ie. Yama), but it is still a great option for the area.", "author": "d t."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-12", "description": "My rating is really between 3 and 4 stars. It's good and fresh sushi. A good selection of special rolls that wasn't a long list of 50+ to choose from, like some restaurants can have. Fish was fresh and tasty. Unlimited green tea (first time in all the sushi places in New York so far). The only disappointment was the salmon, I was surprised at how fatty and how much marble there was. Salmon left little to be desired, but other than that I would go back. I went on a Sunday night at around 8:30pm. Not crowded at all, but not empty. Service was good.", "author": "Olivia P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-28", "description": "Ultra friendly staff, even the sushi chefs wave hi/bye to you. Went during lunch, had the chicken terrkayi lunch special - which includes seaweed loaded, delicious miso soup and super fresh salad. My chicken was thin and nearly crispy(not the thick and chewier type), which included two juicy 'dumplings' and 8 pieces of freshly made california rolls. (Their roll is 8 pcs) The rolls were made beautifully, rice was nice and soft, and cucumber/imi crab was fresh. I am sure their other sushi would be scrumptous like that too.\n\nAlso had the Chairisu lunch special(just raw fish placed on top bowl of rice)which included fresh tuna/salmon/whitefish/2 egg pieces,etc. The only thing i didn't like was that it was cut too thick. But very fresh.", "author": "Mr. Met s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-23", "description": "I was impressed with Ki Sushi overall -- great, fresh fish, good presentation, and decent service.  The peach roll was the highlight for me... what a great combination of flavors (tuna, avocado, peaches)!  My husband is allergic to fish so he had the soba noodle soup with duck breast and the \"evergreen roll\" (veggie).  He was very happy.\n\nI'm not sure why so many people think this place is so expensive.  Their prices are standard for a nicer Japanese restaurant... if you're looking for \"cheap eats,\" I would just skip sushi altogether.", "author": "Cynthia S."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}