{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-07", "description": "I only order take outs for lunch. Pretty good for neighborhood sushi. Fair. Standard.", "author": "Liz H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-22", "description": "I travel to Brooklyn a great deal for work, and get sushi from Ki almost every time I come up. It's among the best I've had, and certainly the best I've had in Brooklyn (and I've eaten at a few shops in the Downtown/Brooklyn Heights/Cobble Hill areas.)\n\nStrongly recommend the seared tuna roll (tuna is still nice and rare, just has a nice char flavor, along with the asparagus) and the pork gyoza!\n\nThe atmosphere has always seemed nice when I've gone there, but I admittedly only get takeout. But the takeout is GREAT: it's always ready in about 10 minutes (they do deliver, but I usually stay nearby so I just walk there); they give you a small foil tin for soy sauce (so you don't need to use the top of the container); and they provide both regular and low-sodium soy sauce. It's the little details!\n\nAnyway - strongly recommend!", "author": "Patrick B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-03", "description": "i love this place. greatest sushi ever.  However on my last visit since 2011 i think i might have to rethink this place.... there is more rice, less sushi....i hate when they do this. Tuna Roll App is a DEFF!!!", "author": "Raven C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-29", "description": "We highly recommend the \"Ki Sushi\" rolls. They were out of this world. The saute broccoli had a very light nutty and buttery flavor. Yum Yum! I would recommend this huge size appetizer to the vegetarian friends! Definitely worth to check it out!!!", "author": "Chih-Yu S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-12", "description": "Very nice place! Not too expensive, especially by New York merits (business lunch $12). The rolls were delicious and the portion size and presentation were excellent!", "author": "Eugenia Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-05", "description": "I went here to escape the West Indies parade.  The sushi was fresh and the staff was very attentive.  They have a good sake selection as well.  The resturant was very dark though.  I understand dinner by candlelight, but it is not ideal when trying to read a menu.  I had to use my Iphone as a flashlight.  The meal over all was good.\n\nWe had a sake craving one night and decided to get some sake from here.  We forgot there was no Bar to sit and drink at and decided not to take up a table in case there was hungry patrons who might arrive.", "author": "Sam N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-15", "description": "OutStanding!!! i just want to go on th record and say that i never thought of going to brooklyn to try a new sushi restaurant, when i have amazing and favorite local spots all around me in the city, but this place is divine.\n\nThe warm mushroom salad, the the dynamite appetizer were incredible...The speciality rolls that my date order were interesting, and the black cod was delicous...", "author": "M.A. U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-02", "description": "Best sushi in Brooklyn, hands down.  I've eaten here more times than I can count on two hands and it's consistently delicious.  I even came in quite late one night- twenty minutes before closing, and not only did they warmly welcome me in, the service and quality were excellent, even at 1am.  Run, don't walk.", "author": "Elizabeth F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-08", "description": "The sushi was excellent! Presentation was spot on. I had the Spicy Girl Roll; excellent! The salmon was mouthwatering.", "author": "Chad H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-24", "description": "The Best in Brooklyn. Do not wait, just go.\n\nWhile it is on the pricer side, there is no substituting delicious, fresh and tasty sushi. Ki has hit it right on the nose when it comes to sushi. They also have amazing appetizers that are not only pleasing to the eye but delightful for your belly.\n\nMy recommendations:\n- Seafood Dynamite\n- Seared Duck\n\n-And seriously...any of their special rolls. Haven't had them all, but wanted them all. Tried the Ki Roll and the Spicy Girl Rolls...amazing!", "author": "Hilary L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-06", "description": "GREAT sushi, which is what I expected based on so many good reviews... my first Brooklyn sushi experience will keep me coming back, that's for sure. Simply put: the fish was good, and it was definitely priced reasonably. All of the special rolls we ordered hit the spot. I can't wait to go back and try more variety.\n\nAs for the details... what made me like Ki Sushi so much was the service. Our large group (11 drunks) was not an easy bunch. Calling around 7pm and easily obtaining an 8:45pm reservation seemed too lucky to be true. Plus, we showed up late and with 2 extra people -- even that wasn't a problem. We were given a big table with a dedicated waiter who knew exactly how to handle us. He was not only friendly and helpful, but he also seemed to understand what kind of experience we wanted -- he suggested the right amount of beer, sake and sushi, without pushing us to over-order (a common pitfall). Even small touches like treating us in a pretty laid-back manner stuck out to me...\n\nNext time: I will try one of the omakase options (supposedly shipped from Toyko?), the prices of which seemed too good to be true. I'm skeptical, yet intrigued...", "author": "Marshall H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-17", "description": "This is one of the places in the neighborhood that I go to for Sushi. Lots of really good options, and really fresh! And not too expensive!\n\nTry the sea scallop sashimi. Absolutely delicious. I love the opportunity to eat good scallop sushi... and I usually don't come across it... but I can here!", "author": "Jason G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-24", "description": "Ki Sushi is a great way to soothe the weekly craving for spicy tuna rolls and miso soup.\n\nIf you live in (or are stuck in) the neighborhood, it's the best sushi option.  However, it can't match the best sushi joints in the city (see Sushi Yasuda) and isn't worth a special trip.\n\nThat said, I get delivery from here frequently. The delivery is always fast and the food good.   Perfect for chowing down while watching a movie....", "author": "Kurt V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-30", "description": "I clearly don't work for the competition.  I'm offended that you, the people of Ki Sushi, saw it fit to flag my negative review. \n\nIt seems very clear to me that Iris G is another shill for Ki Sushi.\n\nI work out of the Family Court on Jay street and would be glad to prove that to anyone interested.\n\nI don't work for the competition, and I resent that there are crooked establishments like this one in my neighborhood.", "author": "Bondi J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-06-20", "description": "I'm pretty torn over this place. I went in with high expectations, and starting with the positives, I will say that when our Omokase supreme sashimi for two arrived , it was very good, if not overly unusual. They offered us:\n\nHotate (live scallop) - sweet, creamy \u0026 fresh\nAji (horse mackerel) - fresh and good, less fishy than other Ajis I've had\nJapnese Rainbow Trout - surprisingly steaky, with subtle but nice flavor and a pleasing texture\nSockeye Salmon - HUGE pieces, tasted very fresh and totally devoid of that too fishy taste larger pieces of Salmon can have, very fresh\nBluefin Toro - one of the fatiest pieces of Toro I've ever seen - totally creamy and jaw dropping. It literally was riddled with white ribs of fat. This came from a very large, prize fish\nWild White Salmon - first time I tried this, was mild, fresh and pleasing\nYellowtail - Huge triangular cut pieces\n\nI might be missing one or two things.\n\nHowever, we dropped the $40 for their premium omokase, advertised \u0026 pushed to us by our server as offering lots of imported fish from Tokyo. I didn't really see it as overly interesting or THAT exceptional. I also noticed they had king crab legs behind the sushi bar, and none of that appeared on our plate.\n\nThe service was slow and generally inattentive as well. I asked our server if the omokase came with soup after waiting 20 minutes post-order without a visit from anyone or any sign of food, and he said no, but he would offer it to us since we were waiting. They did comp us an extra bottle each of their sparkling water, but we still waited a long time, and since we ordered the most expensive thing on the menu, you'd think a little service would be warranted.\n\nThe room itself is pleasant enough - has that faux kitschy zen Japanese thing happening. And, the hostess was lovely. But one can only stare at a woman for so long while you are hungry and no food has arrived! ;)\n\nThis is certainly not a never-go-back sushi place, but as is often the case, the hype isn't 100% on.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-01", "description": "Love this place... Fish is always fresh and the people that work there are very nice. Not cheap but also not expensive. I come here once a month.", "author": "Ruslan Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-16", "description": "Not only is it the best sushi place I've been to in the neighborhood, It's one of the best I've been to in the city. The fish is always incredibly fresh and the rolls are consistently delicious, even when we get delivery from here. Try the Pikachu roll. \n\nAlso, the staff are always very pleasant and the last few times I've been there the entire staff (including sushi chefs) wish us a good night as we leave. A little weird, but kind of refreshing in NYC.", "author": "Joshua S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-05", "description": "Excellent service. A waiter noticed that our table was a bit wobbly and within seconds a swat team was under my table at work. Did they ask me to move? Nope just jumped right under the table and fixed it. Was there 4 or 5 of them under there? I don't know it all happened so fast.\n\nFood:\n - wild mushroom soup - mushrooms that float plentifully in clear, not too salty soup\n- Lobster tuna roll appetizer was refreshing. Three pieces of chunky lobster wrapped inside tuna atop a puree of avocado  \n- Garlic broccoli was a good choice to mix things up a bit - simple dish but assembled nicely and decorated with roasted pine nuts \n- Great deal for sashimi. 23 or so dollars gets you 18 pieces. \n- Volcano roll to finish off an excellent meal. More rolls should be topped off with sweet shrimp. I think they nailed it.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-20", "description": "An omakase menu for ridiculously cheap? Yes please.\n\nA gorgeous sushi bar? Yes please.\n\nUnpretentious, comfy decor? Yes please.\n\nGracious and helpful servers? Yes please.\n\nA grand selection of sake and other delicious beverages? Yes please.\n\nAwesome sushi? Yes please!\n\nFour stars? I gotta keep coming back for the fifth, yo. Take-out is pretty standard. Stick with what you know.\n\nBut you see that? Keep. Coming. Back.", "author": "Miguel d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-23", "description": "Wow!\n\nI think it's the best sushi in Brooklyn.  Such a good place.\n\nYes, it's great for a date.\n\nYes, I ate there alone at the bar and still enjoyed it (I brought a copy of The Economist, and since it's 23 December, not many friends are in town).\n\nSo they have toro (fatty tuna), and it was quite good.\n\nThey serve sake (mostly cold) in 150mL and larger volumes.\n\nTheir appetizers are worth trying.  I had some tuna with jalapeno slices in a special soy sauce.  Great stuff.\n\nWhat really surprised me (pleasantly), though, was the warm mushroom salad.  I don't know what it had in it, but it was such a pleasant surprise, you will definitely see me going back for more.\n\nI paid $57 + tip for 2 apps, 2 beers, a sushi roll and some of the best sashimi around.  I think a normal price is $30 per person.\n\nPlease, other yelpers--what's your favorite item on the menu?\n\nNOTE the following morning: I figured out why the mushroom salad tasted so good.  I still smell like garlic.  Nothing a bottle of listerine can't fix :)", "author": "Tony M."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}