{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-19", "description": "Found this little gem on a business trip to the Big Apple ... what a pleasant surprise. When in town I rarely venture out of Manhattan, but hotel space (or lack thereof) forced me just over the bridge. Checking yelp for a good meal in walking distance led me to Ki.\nWonderful ambiance \u0026 decor, waitstaff attentive but polite (as it should be for sushi). There was not a dish that disappointed. I went all in ... the omakase (while only traditional selections) was absolutely first class fish.\nWhy 'only' 4 stars? Well, I've been there only once ... would have to make sure they can deliver consistently to warrant the highest honor. Should be easy for them, though.", "author": "Matt K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-24", "description": "THE BEST sushi I've had no doubt. This place is a gem. It blows all these over-priced, over-rated, trendy places like (Nobu or Haru) out of the water!! If you are into quality food you would love this place. Try the a la carte sashimi menu to get the full effect of how fresh and amazing their fish is.", "author": "Lori P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-22", "description": "Really good sushi and portions.\nI had a lunch special here with my coworkers and I thoroughly enjoyed my meal. Complimentary salad and miso soup. The salad dressing is really kind of addictive.\n\nI got the salmon and eel with my lunch special and they gave a generous portion. And they kept my glass of water in check. I'd recommend to anyone in the area.", "author": "Eugene K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-05", "description": "Super fresh!!! Great roll combinations always my go to spot when im in the hood.", "author": "Olena P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-07", "description": "Gah, I bounced off of The Know It Express (shout out!) and strolled down to Ki for my sushi-hunger fix.\n\nThe quality, service, ambiance combination beats every other sushi haunt I know.\n\nThanks to the yelpers who rec'd the warm mushroom salad.  I repeat, warm mushroom salad!\n\nMy water glass stayed full, which was amazing considering I had deprived myself of water during my bus trip up from DC.\n\nHope ya'll in Cobble Hill will keep this place going so I can hit it up again next time I'm in NY!", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-08", "description": "Beautifully decorated, intimate and surprisingly comfortable. (with a sparkling clean bathroom too) You're greeted warmly by the hostess and seated near immediately. It gets crowded but you'll get a seat any night of the week. With a warm towel to wash your hands, your experience begins. Easily the best sushi I've had in Brooklyn (been to Hibino but have yet to try the sushi there). The must try is the Ki Roll. It has gold flakes. \n\nIt's pricier than some of the other local sushi joints but you get what you pay for.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-18", "description": "I'm allergic to seafood!.. why the hell would i go to a sushi spot?\nwell..maybe because everything else here is amazing... service staff and food all get 4 stars! . we had a ton to eat without paying much. best table in the house is in this small crevasse all the way to the left once you walk in. waiter was extremely helpful and patient in helping me select my non-sushi dishes. i definitely recommend the beef! and the seaweed salad. pretty tasty! sushi rolls were humongous so don't fill up on appetizers\n\nenjoy", "author": "Manny F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-15", "description": "*Drooling* this is by far the best sushi restaurant I've been to since I moved out here! \n\nThey have $10 lunch specials: 2 rolls, a miso soup and salad; you can't go wrong with that! \n\nVery beautiful decor inside; if I could rate is 10 stars I would :)", "author": "Isabel C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-08", "description": "1 star deducted because they serve an endangered species (bluefin tuna, critically endangered though not yet voted onto the CITES list).\n\nI was really excited to try Ki, after reading all of the great reviews but my two sushi-loving friends and I were all very disappointed.  We had the sushi omakase for 3 and it was just okay.  It was an average sushi platter and the rice was a little dry.  We had the much-lauded mushroom appetizer which was oddly sweet, and some garlic broccoli which was mushy.  Service was eager but slow.\n\nThe sushi at Taro honestly blows this away.", "author": "lexi a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-14", "description": "Best sushi I've had to date. (and trust me, I've had a LOT of sushi...)\n\n$110 (with tip and tax) for a bottle of Sake, two appetizers, three specialty rolls, and dessert. We left with full bellies, and dizziness from the Sake ;)\n\nWalking in we were greeted right away. We arrived on a Monday night for our anniversary and it was perfect. We were seated near the window- which was a private little area in a corner. \n\nThe Sake dispenser was made from a bamboo structure- very cute. It was my first time having Sake. It paired wonderfully with the food.\n\nFor appetizers we got the seafood dynamite, (mussel, shrimp, scallop, squid, shitake mushrooms lightly sauteed and broiled with spicy cream) and the garlic broccoli (sauteed broccoli with garlic and toasted pinenuts). Both were very tasty- although it was a little difficult to distinguish between the different types of seafood. The broccoli portion was huuuuge but very satisfying.\n\nIt took us a really long time to chose only three rolls from the seventeen special rolls. They all sounded delicious. We decided to get the Ki Roll (tuna, salon, yellowtail inside, topped with spicy crunch king crab, avocado, caviar and gold leaves), Peach Roll (tuna, avocado, caviar, and peach), and the Foxy Lady (sea eel tempura, tuna, salmon, avocado, tobiko). Words cannot even begin to describe how amazing each roll was. They were so creative and worked well with all the combination's. Amazing amazing amazing!\n\nFor dessert we got the tempura ice cream with green tea ice cream. In Toronto, their version of tempura ice cream consists of an ice cream scoop with tempura bit crumbled on top. Ki Sushi puts Toronto sushi desserts to shame.... The ice cream was phenomenal. It was actually, well, tempura ice cream! It was amazing.\n\nI look forward to my next trip to NYC, simply to come back for the best sushi I've ever had.", "author": "Krista L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-04", "description": "This is damned fine sushi. \n\nWhen some friends from out of town found that their favorite sushi place is now out of business, I suggested we go to Ki Sushi. My wife had been there once before, and it was not terribly far from the Bell House, where we were going for a show later that evening.\n\nI really like the atmosphere--dark, but not too dark. Light music and splashing water in the background. Silent-but-deadly serving staff, and friendly sushi chefs. The menu is laid out simply, requiring no explanations or strange mathematics.\n\nMy wife and I ordered a couple of special rolls, including the Angel Roll and Foxy Lady Roll. I have to say, this is the first time I had crab in sushi. I effing HATE crustaceans, but the presentation and everything just made me want to eat them until I exploded. And I nearly did.\n\nBonus: house hot sake (large) - $10.\n\nIs it the best sushi on the planet? No. Best I've ever had? No. Best sushi I've had in NYC so far, and compared to all the other sushi I've had, ever, it ranks in the top five. Considering the price, it bumps up into the top three.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-04", "description": "I am not a sushi know it all, but I eat whenever I have a chance.\nThe Ki rolls are very good... fresh, tender and full of flavor, melts in your mouth.\nMy wife, who is not a sushi fan, had the chicken teriyaki - although the dish had a very clean taste, seemed to lack a little bit of flavor.\nVery clan place, but be prepared to bring a sweater - the air conditioning was set a little bit too low.\nProfessional, clean service but maybe a bit impersonal.\nFor sushi, 4 stars, teriyaki and service 3.", "author": "Dan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-23", "description": "I came here with a large group (20 people) for a birthday. \n\nService: Amazing, the waiters are very tentative and helpful.\n\nFood: The miso soup was very flavorful. The sashimi was very fresh.  I ordered the Sashimi Deluxe ($27.00) which came with 18 pieces as oppose to the Sashimi Regular  ($25.00) which comes with 15.  They have an assortment of rolls to choose from.  Although I am usually not a fan of uni, the fancy roll was my favorite.\n\nFresh Sushi, great service, great ambiance, would def. come back here again.  Thank you Ki Sushi!", "author": "Somey H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-19", "description": "Their food deserves a 3.5 star but service deserves a 1, so it averages out to a 2.\n\nWe found this place on yelp when we wanted sushi, and found this place. I called the place to see if they take discover card so I can take advantage of my 5% cash back, a lady with heavy chinese accent answered the phone and confirmed that they do take discover. So we were there an hour later, asked the hostess for a table for 2, she said sure, just wait  for about 2 minutes. 15 minutes later, she informed us that there's a table available. We sat down, a waiter came over and offered hot towels to clean our hands. Then we went ahead and ordered an appetizer, cold sake, several sashimi and a dragonfly roll. The appetizer was ok, I think it was seafood something, it was basically a plate of cooked seafood covered with cheese. Our waitress walked by 5 times to ask if we were done with it when we were still picking food from the plate. WTH? \n\nOur sashimi and roll came, we ate, and loved the live scallop sashimi. I originally wanted to order divers scallop sashimi, but our waitress said that they were out of it and only have live scallop sashimi, that's 4 slices per order, instead of 2 pieces. Its price is marked MP on their menu, so I asked how much it is, twice, but our waitress never gave us a price. It was super delicious, so I asked for another order.\n\nWhen our heck came, the live scallop sashimi is $12 an order, compare to their diver scallops that are $3 an order. It tasted good, so we let it slide.\n\nI gave our waitress my discover card, and she came back to inform me that they do not take discover, she said \"Visa and master only\" in heavy chinese accent.\n\nI hate it when restaurants lie or mislead people just to make money. Even though their food was great but the mishap with their price and credit card is such a huge turn off.", "author": "Dee C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-17", "description": "This is my new favorite sushi spot! Everything about this place was on point. Very elegant decor, service was immaculate and the sushi was the best I've had. All the good reviews I read held true. We had gotten the standard miso soup along with seaweed salad for starters and for the entree we went with a volcano and foxy lady roll. It just melted in your mouth and the portions were substantial. Service was consistent and super fast as well. This one goes to the top if my list, undoubtedly this place will be regularly supplying my sushi needs.", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-03", "description": "Very, very, very tasty sushi! \n\nThis review is for takeout and I ordered quite a bit of food: Lobster Tuna Roll*, Fashion Roll, Fantastic Roll, Volcano Roll, Fancy Roll, Ki Roll and Spicy Seafood Soup. \n\nEvery single item was delicious and well-made. The flavor combinations of the rolls were just delish and the fish was very fresh!  I found the soup to be a tad sweet (although it was supposed to be spicy).\n\nYes, Ki is pricier than other sushi restaurants, however, the quality is far superior. \n\nOh, and the Lobster Tuna Roll is topped with black caviar and gold leaf... ohnotheydidn't! \n\nI'll certainly be back to dine-in. Highly recommended... \n\nLexyloo ;-)", "author": "Alexis H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-27", "description": "Everything about this place is low key and very 5 star worthy.\n\nCame here on Sunday night for dinner with my boyfriend and sat at the sushi bar. The service is SO attentive and friendly and nice. \n\nWe started with a glass of riesling each. We ordered the fried tofu (so yummy! and it came with small pieces of sliced seaweed), the seared duck breast (also so yummy!), the cod (SOOO yummy and it came with a seaweed salad - delicious!) with a side salad, and the ki roll (which I thought was OK). We topped it off with an order of the green tea tempura ice cream to share (so yummy!). \n\nAll in all, a very delicious meal and I would definitely come back because the service is also very great!", "author": "Siv L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-02", "description": "....I wanna be a billionaire so frickin' bad....\n\nIn steps the restaurant Ki. \n\nMy night went something like this... I strolled in and ordered a dish of caviar and 24k gold flaked sushi to go. Before leaving I screamed \"Buy me a yacht full and deliver an order to my brownstone door daily!\" in a shrill and obnoxiously high English accent as I laid my razor sharp black Amex on the counter and stroked my painfully small pedigree dog who was resting in my high end, designer purse.\n\nSigh. Only one part of that retelling was true. \n\nA. The gold flakes and caviar sushi\nB. Yacht and brownstone\nC. English accent\nD. Black Amex card\nE. Painfully small pedigree dog\n\nThe correct answer is, of course, A. The Ki roll, topped with gold flakes and caviar (!!!!!!) gave a small bit of luxury to an already phenomenal dish. My friend ordered the spicy girl which brought just the right amount of heat. We also ordered the shumai appetizer which was warm and yummy. \n\nThe service was attentive and the decor inside was clean and modern. \n\nFor a small bit of luxury, come here and get the Ki roll. Then when people ask or don't ask you what you had for dinner, you can casually but loudly say, GOLD FLAKES AND CAVIAR SUSHI !!!! \n\nChampagne wishes and caviar dreams!", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-30", "description": "***this review is only for take-out \n\nLove this place! Wish I could've came here for dinner instead of doing take-out but it was an evening filled with errands! Boyfriend raved about the Ki roll. I loved their fantastic and spicy girl rolls. Sorry, I'm drooling already. I need another sushi fix, gah.", "author": "Diana F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-21", "description": "Ki Sushi was a welcomed addition to the neighborhood. I mainly stick to the sushi and sashimi - my all time favorite is the scallop sashimi. Beautiful.\nThey have a nice selection of filling rolls with clever names. They are all quite tasty.\nKi is a great local place to get your sushi fix on. Friendly service and a fairly handsome space. IMHO better than Osaka and Cube 63.", "author": "Rich B."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}