{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-27", "description": "Nice sushi. Great mushroom salad and a quiet place .", "author": "Max S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-20", "description": "The food was great, I ordered koni salad, a warm wild mushroom salad, eel and avocado roll and lastly the spicy salmon roll. Everything was delicious and came out of the kitchen quickly. All the ingredients tasted freshly prepared, especially the spicy salmon roll there was so much salmon it was almost overflowing. \n\nThe atmosphere was modern romantic, good for couples. Slightly dim, wood and brick walls, and some dry flower decor. The only thing that bothered me slightly was I felt watched the whole night. the waiters were standing against the wall watching my every move, even though service was prompt because of this but it made me a little uncomfortable.", "author": "Jessie D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-07", "description": "This is a run of the mill sushi place, plus they recently redid the wood sealant or something inside and that's all you can smell. Not very appetizing.\n\nTry Hibino on Henry St - Much better!!", "author": "Joshua H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-20", "description": "I went to this restaurant because of the good reviews this place has received in the Yelp community, and I was sure I made the right choice. So my friends and I were starving for some real sushi experience when we visited new york for the weekend since our small in-the-middle-of-nowhere town has nothing like it. I searched sushi on yelp around me and I saw that Ki Sushi was one of the best reviewed, therefore we decided to have our lunch there. \n\nI was pleased with the atmosphere. It was a nice decor, dimly lit, gave you some kind of cozy if not romantic feeling. Almost everything was wood-made, giving it a classic feel. The waiters were exceptionally nice and helpful towards us. I gave them 2 thumbs up for their excellent service. \n\nSo I ordered and was surprised that we were actually right in the lunch special time. It was around 1 if was not mistaken. So I could order any 2 rolls in the lunch special section for around 9$. OMG. Okay, how much better this restaurant can get? So I ordered spicy tuna rolls and spicy salmon rolls. I also ordered their special according to the waiter's recommendation, the Ki Sushi Roll.\n\nWe were served our miso soup and salads which were included in the lunch special set. The miso soup was seriously (I am not exaggerating at all here) the best miso soup I have ever had in my life. Simply the best and my friends agreed with me, and one of them is not even a fan of japanese food. So another 2 thumbs up for them. \n\nThen in a timely manner, our orders were served. I was delighted, very delighted. Despite its competitive price, it was not just some cheap small half-hearted sushi roll. It was really beautifully made and served. How about the taste though? I put the first piece on my mouth and I bet I was crying with tears of joy at that moment. I was moved. My heart was moved. It was one of the best sushi experience I have ever had in my life. The fish was a top quality. The Ki Sushi Roll is exquisite. \n\nSo at the end, we walked out there full and happy. Not just our tummy, our wallet was also happy. If you say that something well-priced is not in good quality, for sure you haven't tried this place. I am going to visit this place again in the future.", "author": "Andrew S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-02", "description": "We came here on a Saturday around 9pm and there was a 20min wait.  They give you a warm towel to clean your hand before you order your food.  The staff was attentive.  The sushi was fresh, I order a uni and it melted in my mouth :) the Ki roll is pretty and tasty. \nBut I'm not sure if the owners were japanese or chinese...... still a nice dinner.", "author": "Amy J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-09", "description": "The waitstaff is fabulous!  The regular rolls are great because the quality of the fish high.  The specials rolls detract from the flavor of the fresh fish.", "author": "sarah h."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-22", "description": "The sushi is okay if you're looking for an Americanized sushi restaurant in Brooklyn. Their fish quality and freshness is \"so-so\".  I've been here several times and the ahi (maguro, tuna whatever you want to call it) was a dark burgundy color. \n\nTheir prices are decent, but I would prefer to go somewhere in East Village and eat a more authentic Japanese meal.\n\nOverall, their service is good but I'm not sure if I would rant and rave about this place like other yelpers have.", "author": "Mai Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-21", "description": "Reasonably priced given their selection.  Portions are pretty small, however the quality is pretty good.  \n\nMy recommended  dish: Shrimp Tempura. It's my overall favorite for any sushi place, so it was destined to be ordered from the start. Not bad for a quick fox, but not one off my top pick", "author": "Samuel C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-28", "description": "Went here twice. \n\nAppetizers: \n\nScallops with spicy mango dish - this was probably the biggest disappointment of the evening. For $9, we received 2 cold scallops. I was really, really sad. They could have at least be warm. \n\nLobster with Tuna Tartare - Melt-in-your-mouth awesome, but very pricey. Came with 3 pieces. \n\nDynamite - Very good - spicy, has good chunks of scallops in it. You can share this with four people, given that those people are not greedy. \n\nEntrees: \n\nThe omakase is not great. If you are not sitting at the bar, you will simply be prepared a plate of the chef's selection. The first time I came here, it was just a lot of  varieties of yellowtail. However, the fatty tuna, is of course, always buttery, melt-in-your mouth good. \n\nThe fish in the rolls are overall fresh. But I did not think the combination of rolls itself was that spectacular. \n\nDessert: \n\nThe tempura fried ice cream however was delectable. Perfectly fried tempura on the outside with green tea or vanilla ice cream in the inside, coupled with a side of caramel. \n\nOverall - Okay!", "author": "Stacy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-27", "description": "Hands down the best sushi in Brooklyn! Everything is always fresh and the service is fantastic too. Love all the special rolls, especially the passion roll and the American dream roll. Highly recommend this place for any sushi lover!", "author": "Bianca M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "I pretty much go to Ki sushi only. Why? Because I know I will always get the best sushi and fresh fish even in summer time . Try their lobster tuna roll it's the killer on the menu.Never tried anything more creative. Been going there for 5 yrs and never left disappointed. Must visit!", "author": "Alex D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-23", "description": "Amazing sushi, great service. The quality of fish melts in your mouth. Heads up you need reservations on weekend evenings.  Its definitely my favorite sushi spot in Brooklyn.", "author": "Dima G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-14", "description": "Great spot.  Went on a sunday night and didn't have to wait for a table.  Attentive server.  Very good sushi and appropriately priced.  I had sashimi entree which came with salad/soup and side of rice (sorry, no brown rice at this place).  All was delicious.  I'll def be back.", "author": "Krista C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-24", "description": "Average.. just average. I'd rather take the drive to Amber village then to go back there. I tried all of the rolls that were recommended through out the reviews on Yelp \u0026 I was not impressed by any of them.", "author": "Nafeesha P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-24", "description": "This is really great sushi, and not exorbitantly priced. If you get the lunch special, it's $10 for 2 rolls, with a generously sized salad and soup. I only get the lunch special because I'm cheap-- but hey. I really recommend this. \n\nNotably, their tempura stuff is not disgusting. Which is kind of cool. \n\nIf their individual rolls were less expensive, I'd give another star. Service has always been fine, though. And they've never messed up my take-out and accept credit cards.", "author": "Kathleen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-20", "description": "Best sushi in Brooklyn. Kevin is a master of his trade, and his fish is awesome. This isn't the usual semi-authentic sushi that's become the NY standard. It's the real deal. Do yourself a favor and eat here.", "author": "Jean M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-16", "description": "This place was always packed when I walked by it so we finally got there early on a Friday night and I must say it was good but I thought it would be better especially because it's on the pricey side! The service is very good but it is \"city-like\" with the tight seating! I had the miso soup which was very good and not salty at all, and the sashimi deluxe which was also good! My wife had the garden salad which seems to taste the same at every sushi restaurant and the chicken teriyaki which she loved but I thought it was just ok. Not my dish when I eat at a sushi spot so it doesn't matter to me... The decor and price is what stopped me from giving it 4 stars, but I will come back to try some of their rolls and update this review in a few weeks!!!", "author": "Jimmy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-04", "description": "My boyfriend and I are so pleased to have finally found an amazing sushi spot in the neighborhood! The service is great and the fish is fresh and delicious. \nWe have called on Friday and Saturday nights to put our name on the list before walking over and they'll take it an extra step and reserve us a table. \nThe warm mushroom salad is to die forit! My boyfriend loves the TNT Truffle appetizer. The sashimi is excellent and one order comes with two pieces. All of their specialty rolls are really innovative and yummy! \nEveryone needs Ki Sushi in their life!!!", "author": "Lindsay M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-04", "description": "I had just gone to the gym and wanted to avoid spoiling this effort with my true craving- greasy pizza- so I decided on sushi, and Ki was the first place I stumbled upon.\n\nLucky me! From the outside, it looked like it was closed- but once inside, I saw the place was packed (a good sign for 1pm in the afternoon!) We were seated right away.\n\nI ordered the tempura bento box (ok, so I didn't avoid spoiling my workout altogether...) which came with an obscene amount of food- \n\nMiso Soup- typically I avoid said soup, because I find it slightly bland. This Miso, however, was absolutely delicious. It was buttery-tasting, and packed with seaweed and tofu.\n\nSalad- very fresh, amazing dressing, and a good portion!\n\nShrimp and Veggie tempura- The shrimp was melt-in-your-mouth-fantastic, and the tempura was light and crispy.\n\nThe pork Dumplings, California roll, and the rice were all super fresh, and very tasty. \n\n....All for $9! I will most certainly be back to Ki.", "author": "Amber S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-16", "description": "The night started off with the potential for disappointment and possible disaster when we arrived at 8 pm on a Sunday without a reservation and were told maybe ten minutes because, although there were two tables, they had reservations for them - understandable, but I was hungry. I really was not expecting to need reservations for 2, even on a Saturday, but good for them. Turns out they put together another table and seated us in two minutes.\n\nService was attentive all around, especially on the water and that does not go overlooked. When you are drinking delicious unfiltered sake, it is real nice when your water glass is continually full. The place is nice inside, not too big and not overdone like some sushi spots with many commercialized alleged sushi decorations. Small, nicely lit and comfortable interior.\n\nThe food was good as well. Not sure it is possible to mess up edamame, but they were fine, the correct amount of salt. The shumai was run of the mill, but nothing wrong with it at all. When it came to the rolls, they were well-made, large and extremely flavorful. From an American Dream roll (shrimp tempura etc) to a Rainbow roll to some spicy roll they were all really packed with a variety of strong flavors. The rolls were made consistently well and obviously with care, the kind you know they took their time making.\n\nA nice sushi spot in a good couple blocks on Smith St. I would definitely come back.", "author": "Jonathan G."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}