{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-25", "description": "3 star for 1, 1 star for service\n- food: normal, nothing special, rice of sushi is way too cold and hard. Meat cooked way too salty\n- service:  bad, bad and bad. A host not wearing a suitable clothes for work - who knows she is host? Not welcoming. Wait too long for the food. \nNot recommend!", "author": "Mieo N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "AMAzing Favorite sushi spot! Always fresh and Sushi melts in your mouth! \nD E L I C I O U S", "author": "Jaime B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "3 of us walked in here at 8pm on a Thursday evening. The place was full with maybe one or two tables open. I booked a table a few hours earlier so I was able to get a seat right away anyways. \n\nThe environment of this place is very elegant and upscale. It has a dark and fancy feeling to it all. Definitely a great place for a date. The sushi was very well done and well presented. The staff was also very nice and even hands out freshly steamed hand towels to wipe your hand before you begin your meal. The menu is comprehensive as well! The reason for a 4/5 rating is because I feel that the price was a little too steep. Perhaps that is because I have a strong background in Vancouver, Canada, where the sushi is nearly a third of the price and just as high class. For Brooklyn though, this place is definitely a must try. \n\nWould highly recommend to others looking for a great date night!", "author": "Gabe F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "Most importantly, be aware that Ki does NOT honor reservation times.\n\nWe had a reservation for 9 pm on a Saturday night. When we arrived, there were about 10 other groups also waiting to be seated (the restaurant is small), including people who had not yet been seated for 8:30 and 8:45 reservations. That was the first bad sign. \n\nThe hostess was also not equipped to handle this in the slightest. To everyone who walked in (with or without a reservation) she told them that tables would be available in about 15 minutes, which was blatantly untrue. I also overheard a group come in who had put their name down on the list an hour or so before and she claimed their name had somehow been removed and that their reservation had been lost. Hm....needless to say, they were not pleased.\n\nThen a couple who had been waiting for awhile asked her how much longer until their table would be ready and I overheard her let them know that since they had not originally had a reservation she had had to move them further down the list after all the 9 pm reservations arrived. She had done this without bothering to tell them! I was quite shocked by all of this. Extremely unprofessional!!!!! \n\nBy 9:30 pm we were seated and decided that since we were not likely coming back due to the hot mess over reservations/tables, that we should go all out this one time. We ordered the supreme sushi and sashimi omakase for 2 people (fish flown in from Japan). Thanks to the unbelievable fish, I am giving Ki 4 stars rather than 2 or 3. The fish was superb. Each piece melted in your mouth and it was lovely to get to try so many different types. The toro (fatty tuna) sashimi was incredible, as were the scallop sushi, eel sushi, and yellowtail sashimi. The omakase also came with a delicious oyster. Surprisingly, it did not come with a small salad or miso soup, which I found strange as we were paying $55 per person. Anyway, as I said, it is the excellent quality of fish that saved this rating.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-25", "description": "Amazing service. Hands down. Food is a little pricey for me but great quality fish. I was wearing overalls and I felt super underdressed so FYI it's a little dressy. Lemon in my water, a hot hand towel..... The service was really spectacular the end", "author": "Chrissy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "Clean, sleek, modern, Chinese-run Japanese restaurant. Really enjoyed the $12 chicken Katsuhiro lunch special! It came with miso soup, salad and even desert.  Come hungry and leave full!", "author": "Gwendolyn P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "Very solid sashimi for reasonable prices (might I even call it \"low prices\" - especially considering the neighborhood). The fish is very fresh and consistently good.\n\nI will have to come back to try the omakase (and it's only $58 for 2 people!).", "author": "Carol H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-16", "description": "The experience overall was good. Got seated for two right away. The place was intimate with a light dim to it. The fish was exceptional but not like amazing, and was quite pricey for the quality of fish served. For the same kind of quality of fish and sushi, I feel like I can get that somewhere else for cheaper. I ordered the supreme omakase sushi and sashimi for two. The only thing that stood out was the scallops, which were very fresh. Other than that, the uni and the rest were okay. The rice under each piece of fish fell apart easily. We also ordered the Fancy Roll, which also had scallops on top so it made the roll more acceptable. I got the Honey Plum Wine which I have to say, was great. The service was at standard, waiter kept our water cups filled and making sure everything was okay. \n\nOverall I give it three stars because I wasn't wowed by the fish considering the price we had to pay for it. It wasn't amazing, it was normal. Other than that, it was more or less a regular sushi place. I will probably not return for the second time.", "author": "Tom L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "Loved the selection of appetizers and sushi rolls are very fresh. Recommend the King crab appetizer. The Fantasy roll.", "author": "Inessa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "This is good sushi spot. The customer service was very good... and the sushi was great. They give you warm towels when you arrive, very attentive and helpful waiter, and the sushi\nWas delicious. There was a family with messy loud kids near by that was slightly annoying and a customer who was waiting 30 mins for his takeout that was yelling at staff which is why I probably only gave 4 stars but the place is solid. Will be back.", "author": "M L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-05", "description": "This is the kind of sushi experience you dream of. The sushi is very fresh, not too cold but just right. If you haven't tried the garlic broccoli, ORDER IT. Not only is it delicious in a \"what did they even do to this?!\" kinda of way, the portion is huge. The chicken wings are on point and not overly sauced. Not only is it a beautiful place, the staff are extremely attentive and so kind. One of my favorite places to eat in the 'hood, hands down.", "author": "Feather A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-25", "description": "I was pleasantly surprised by the fresh taste of the sushi I had here for dinner last night. I had the sushi deluxe which was a tuna roll and 10 sushi piece combo. It was $25 and honestly very much worth it. I will definitely try the omakase next.\n\nDecor looks like your neighborhood pan-asian sushi restaurant but the quality of the sushi itself really makes it worth your trip if you're in Cobble Hill. \n\nBy 8:30pm on a Wednesday night it was completely packed with a line waiting outside, so you might want to get a reservation.", "author": "Nina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-18", "description": "Really tasty sushi. I just wish their wine list was better. Okay - it's only beer and wine but how about not shitty wines and more selection? Again- sushi - delicious. Service - excellent.  Alcohol options - shitty.", "author": "Heather M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-28", "description": "Delicious sushi!!!! More elevated than your standard delivery joint. Usually on time too.", "author": "Lila D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-21", "description": "My friend took me here and at first I thought \"oh just another sushi spot whateve\"\n\nBUT I WAS WRONG! This place is incredible. \nThe fish is flown in from Japan and you can taste the difference. It melts in your mouth like butter. \nThe TNT truffle appetizer was beyond magical. \nWe even got the randomly selected sashimi and it was so good. Overall the best dinner I've had in a while. They even have an interesting beer selection I haven't seen elsewhere. \n\nRECOMMEND 100%", "author": "Lizzi A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-14", "description": "Ki Sushi is just stone's throw away from us. I am glad that we came here for lunch over  the weekend. Of all the Japanese restaurant that I've been to in the area, this place is probably the best. The noise level is average for a very pleasant dining experience. The decor is truly upmarket while the ambiance seems sophisticated. In reality the price was comparatively to some posh Sushi restaurants around.\n\nThe Staff are commendable for attentiveness and are genuinely friendly. We were seated right away and we need not have to ask for water ones we got settled (the temperature outside was 85 degrees). We ordered ice cold beer and 2 choices of Sushi rolls which was included in the lunch special that came with Miso soup and Veggie salad with ginger sauce dressing.\n\nMy tempura and spicy tuna rolls were both delicious and served fresh, I will definitely come back here for a date night. 1 star back for being super dark inside the restaurant. note: not all customers has 20/20 vision!", "author": "Reggie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Delicious! \n\nWent for a birthday dinner and we had multiple apps and sushi rolls to share- it was all amazing! We ordered probably 10 rolls, including a gold leaf Ki roll which could have been tacky if it wasn't so good! \n\nThe service was great - very warm, approachable, yet quick and efficient. They brought us a dessert on the house and were very sweet about it all. \n\nCan't wait to be back!", "author": "nina s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "This place is legit. Food is amazing, service was on point, and price is not bad. We had the bento box lunch,  food arrived quickly, and was awesome!!! I will come back again and again", "author": "Jonathan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "This is hands down one of the best sushi places I've ever been to - and I've been to many. My boyfriend took me hear for my birthday. Our typical order at any place is three hand rolls - spicy tuna and 2 spicy salmons - and a shrimp tempura. On a special day, we even order a special roll. That is usually a good amount of food between us ( we love to eat!). So we ordered just that at Ki sushi and that ended up being wayyy to much food. The rolls are huge, the fish is so well flavors, and the rolls are just overall perfection. We were super hungry and barely made it through two rolls. This place is definitely out of the way for me but I definitely keep coming back because it is so worth the trek!", "author": "Ayesha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "Small joint with huge flavors and quality fish!\n\nThe freshest fish and most tasty sushi I've ever had!  A friend introduced me to this place and I can't stop thinking about it.  \n\nNow they opened the second location so I hope it'll get less crowded in there.  Be prepared to wait a while to be seated, but trust me it will be worth it", "author": "Dana D."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}