{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-09", "description": "I am obsessed with this place! The food is yummy and the service is impeccable! Definitely my favorite sushi place in NY.", "author": "Nicole C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-22", "description": "Used to be great.....got really sick eating there last 2x. No more ki for me", "author": "Faye B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-06", "description": "Great restaurant. Some of the friendlies restaurant staff I've ever come across! \nI put in an order of edamame, a spicy tuna roll, and a dragon roll for pick-up. I was offered water or tea while I sat at the bar, waiting for my order, which was ready in no-time on a busy Sunday night. \nAll the rolls were loaded with fish and tasted fresh and delicious! The order of edamame was enormous (I suppose it better be for $5). \nThe rolls weren't cheap, which is my only qualm with this place. $7 for a spicy tuna roll, no matter how tasty is it, is a bit steep, but I guess I can't complain too much. This part of Brooklyn is, after all, kind of an extension of Manhattan, so prices like this are sort of the norm...", "author": "Diana P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-07", "description": "Sushi here is delish.  the specialty rolls are fantastic and served beautifully.  Try the spicy girl or the dragon.  Deliiiissshh!\n\nOnly reason they don't get 5 stars is no hard alcohol and I love me some sake bombs.", "author": "Melody G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-25", "description": "This is my favorite sushi place, a delicious meal every time.  The wait can be daunting, especially with a big, hungry guy in tow, but they take reservations, so plan ahead! \nBest thing is the Lobster-Tuna Roll appetizer, we get it every time and we are never dissappointed.  It's served in an avocado, wasabi, honey sauce at the bottom of the plate, it's out of this world, and even better than the tobiko and gold flakes on top.  \nOther stand-outs; the broccoli appetizer, don't ask me why, it's only broccoli, right?  The warm mushroom salad, and the array of sushi rolls are excellent, and big.  You won't leave hungry.\nIf you are looking for a bargain meal in this neighborhood, this is not it.  $100+ for 2 people, but you get great quality and service.", "author": "Ricki Jean T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-21", "description": "Finally had the chance to try this place after hearing so much about this place. This place is definitely busier than most Japanese restaurants during the lunch hour. We were seated promptly and was given both tea and water (with a slice of lemon in it). Service was attentive throughout our meal.\n\nWe had the blue fin tuna in yuzu sauce as an appetizer. Didn't know what to expect from this dish. It wasn't spectacular nor was it bad. We continued on with the Ki Roll, Salmon Terriyaki Bento box, and a piece for Uni (for me).\n\nThe Ki Roll was delicious. The combination of minced tuna,salmon sashimi and the sauce worked well. And just the right amount of rice to support the raw fish on top.  The salmon in the bento box was excellent. Probably the best salmon terriyaki I've ever had from a Bento Box. The terriyaki sauce wasn't too sweet nor too salty. The salmon was not overdone or dry. Just perfectly cooked while having a slight crunch to the edge of the filet. The Uni was top notch. They certainly don't skimp here. We finished off with the fried banana and ginger ice cream. A nice finish to a very satisying lunch. Will definitely be back for more!", "author": "Elaine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-20", "description": "This is my favorite sushi place in the Brooklyn area, BY FAR. I always leave stuffed full of every sushi roll imaginable because I always want them all. Very fresh, friendly service and reasonably priced. \n\nIf you know of any other delicious sushi places that are better than this, message me! I'm willing to try them!", "author": "Leigh F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-26", "description": "Sushi afficionado here.\n\nmm... have mixed feelings about this place.", "author": "Elf Ninja .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-21", "description": "The sushi here *never* disappoints me. Ki sushi is casual, relatively inexpensive, and offers inventive rolls. I love the TNT roll.  The decor is very nice.", "author": "Vitaly L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-27", "description": "Sushi is great--best in the neighborhood, and this is thankfully clean; but why is it so dark in here? Does it need to be an underground burial cave?", "author": "Jane S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-06", "description": "The BEST sushi in Brooklyn - and honestly some of the best in all of NYC at this price point.  The fish is so fresh, so tender and flavorful - every roll is beautifully prepared, delicious and melt in your mouth fresh.  \n\nI travel from Queens just for the Dragonfly roll and the Fantastic roll.  For my taste preferences these are the most incredible specialty rolls you can get - and they balance each other out perfectly.. The sweet, buttery unagi on the Dragonfly melts in your mouth while the crispy shrimp tempura crunches between your teeth - a taste and texture phenomenon!  And the jalapeno tobiko on the Fantastic roll gives just enough heat to compliment the plump yellowtail and salmon that surrounds the spicy tuna.  The portions are generous without being too overloaded (very balanced - not overdone)\nThey also have the most addictive ginger dressing on the salad - I buy it by the pint!  \nHigh quality, lovely peaceful setting, prompt and friendly service, generous portions, affordable.  What a delight!", "author": "Julia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-06", "description": "EXCELLENT SUSHI!  I've eaten here twice and would not hesitate to return. Fresh fresh fresh and the service was very good.", "author": "Joseph O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-30", "description": "The best sushi i tried in united states!! amazing!!! this is really as good as it gets, the menu is amazing and well though! standing ovation!! please please try you won't regret it!!", "author": "Vick T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-03", "description": "While I haven't been all of the sushi spots that litter this area of Smith Street, I would surely go right back to Ki Sushi!\n\nThe food and service were excellent.\n\nRock shrimp appetizer = crisp, hot and nowhere enar as \"greasy\" as other places.. served over nice bed of greens with a spicy mayo\n\nSteamed Veg Gyoza = pertty standard but hot and fresh\n\nMiso Eggplant = might be my favorite Miso Eggplant ever.. served super hot and sweet.. this should almost be a dessert! \n\nThe Special rolls are very big and the combos to choose from are plentiful\n\nDecent sake selection as well..", "author": "Adam S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-01", "description": "OMG!! anyone that gave 5 or 4 stars to this restaurant never been to real Japanese restaurant!!!! I order an udon but instead I get a rice noodle in Chinese cabbage soup!! Also ordered couple of spicy rolls. Not spicy at all. I have no idea why they call it spicy n when I complain I get some spicy mayo on the side....... I must say this is over priced Chinese restaurant!!!! If you are going to imitate do a better job next time.", "author": "Andy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-14", "description": "Came back to Ki Sushi after a while and I gotta say their lunch specials a great bang for your buck.\n\nFor most jap restaurants with lunch specials  the sushi rolls are usually so small that a 2 piece roll magically got reincarnated into 6 pieces. Last time i checked rice wasn't worth that much was it?\n\nKI Sushi makes sure that for 10 dollars, not only can you get a chicken teriyaki, but also a decent sized salad, great miso soup, 2 piece gyoza, and 6 giant pieces of california rolls as a side with your chicken teriyaki. Now that's a bargain. Everything tastes great here as they don't skimp out on their quality. \n\nI will definitely be back !!\n\nNote: great atmosphere and decor for dates", "author": "Isabel L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "At first glance, this restaurant seemed to be just another regular sushi restaurant.  I even thought the menu was a bit overpriced.  However, once our sushi came, I realized that their prices were actually cheap considering the freshness of the fish.  I ordered the Sushi Deluxe which consisted of 9 pieces of sushi and a tuna roll (which they changed to a salmon roll for me at no extra cost).  It also came with a larger than average side garden salad (or you could order miso soup).  Nobody at my table had any complaints with their sushi.  The waiters were all very attentive, and the ambiance was lovely.  What impressed me most was the fact that they served fresh wasabi which you almost never see with the prices that they charge.", "author": "Stephanie Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-16", "description": "This place is always ridiculously packed with long waiting times but this does not at all mean that you'll be blown away by the food. You're peddled by rushed service and sushi is just average at best. Lots of better sushi places in Brooklyn and far less hectic. I once made reservations and had to wait for 35 minutes after arriving on time with a small kid. No apologies, no attempts to make my evening better by offering something complimentary. I showed I was upset but the hostess didn't seem to care very much.", "author": "Artem F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-05", "description": "Excellent service, nice romantic atmosphere, fresh and delicious sushi. More at the $$$ price range but we'll worth the price. The special rolls are amazing. Will definitely return back.", "author": "Rach W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-22", "description": "Excellent. Some of the nicest sashimi I've had in a long time. You know quality when you taste it. I had big eye tuna, yellow tail, salmon, eel which were amazingly fresh and delicious. Spicy tuna roll was excellent, too. We were doing back flips over the broccoli with garlic appetizer - very simple, no oil or barely detectable at least, light garlic flavor. We want this recipe and we want it now. Pickled vegetables were crispy, lovely, fun with a range of flavors from black tea to pungent mystery sourness. I don't have the words - just come here. Come here now and order these things!", "author": "Modemme X."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}