{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "Excellent place to eat. Attention is the best thing I've seen when you arrive they receive you they make you sit down. They give you a hot towel for your hands the service of the waiters is an attack few is an excellent place to eat. and the food is delicious.", "author": "Miguel H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-18", "description": "One word: Disappointed.\n\nCame here to try omakase for the first time hoping I'll be completely blown away by it but that was far from the experience. \n\nOrdered a glass of honey plum wine and white wine with the Supreme Omakase - Sushi and Sashimi, which was 16 pieces of sashimi and 4 pieces of sushi. The sushi didn't stand out one bit except the scallop. The scallops were extremely fresh and sweet. I couldn't get enough of it. The salmon and tuna tasted like any other sashimi I've had before in other sushi restaurants that are way cheaper. The sea urchin was good but wasn't mind-blowing. They only gave us one so we ordered another one on the side. Aside from the omakese, we ordered the Fancy Roll. Again, it wasn't anything special. \n\nThe total came out to be $114 plus tips (for 2), which I didn't think was worth it. I knew I would be paying over $100 for dinner but what I didn't expect was the letdown. Definitely won't be back for sushi here.", "author": "Winnie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-30", "description": "This jumped to a 5 in my book! This can take any omakase place in New York pound for pound. Since my first time here I've been here maybe a dozen times after and hasn't disappointed once.", "author": "David G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-03", "description": "Not bad for Brooklyn. Hit the spot. Waitress made a few mistakes, didn't know the menu but she said she's new. Oh well. Food is good for its price. Would consider dropping in again if in the area.", "author": "Lila H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Good quality sushi for a great price. My girlfriend took me here for my birthday and we both got the sushi and sashimi omakase (150 total after tax/tip). We both thought the meal was excellent and we were both plenty full afterwards. \n\nOur favorite piece was the seared salmon sashimi. One of the best things we had. \n\nOverall, a really good value for its price point. We had about close to 18-20 items on our plates. Everything had a unique flavor. Oh! Their fish is flown in from Tokyo, so its pretty cool to try out if you're wondering what fish from Japan tastes like!\n\nWould highly recommend. \n\nTip: Try to make a reservation and sit at the bar", "author": "Alan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-23", "description": "Sushi meet Ki, now say \"I do.\"  It is that perfect marriage, honestly. Living in Carroll Gardens for 19 years and I've seen a lot of evolution. Not only from the housing market (obviously) but from the food. \n\nBefore there was ever a Ki, there was Osaka (still there), and it was our go-to for great sushi. Ki came into town and after a few tries it was hard to look back. If you want top quality fish, adventurous \"special rolls\", spot on service (in the restaurant or delivery) on a continuous basis you've found your place. Now I'll warn you that you'll pay for this privilege, but it's worth it 100%. \n\nIf you're visiting them, you'll find an intimately lit Japanese focused restaurant. They have a good amount of tables, but if you're just two you'll likely be pretty close to your neighbors. Sitting at the bar is an option too if you want to watch them make their magic in front of you. There is a nice sake menu and a few interesting cocktails to start you up.\n\nBut if you're at home... This is now THE ONLY restaurant we'll order from that doesn't support Seamless/GrubHub/Eat24/Caviar etc. It's that good - rephrase, it's that GREAT. They'll at least save your credit card (if you want) and previous order (if you're a creature of habit) which can make the call to them a bit more efficient. \n\nWhere should you start? If you like Tuna, you deserve to treat yourself to the TNT Truffle appetizer. They are soft, plump little barrels of wonderment consisting of chopped blue fin toro, caviar, scallion, tempura, flake, wrapped with tuna in truffle soy sauce. To. Die. For. The Jalapeno Yellowtail Sashimi is also great, but more of what you'd expect vs. the mind-blowing you'll get from TNT Truffle. \n\nFor a main make sure you try one of their Ki Special Rolls. I always sway toward the Pink Lady (but substitute with marble paper) which is spicy salmon (used to be tempura), yellowtail, tuna avocado and masago roll in a pink soy bean paper. My wife often gets the Fantastic Roll crunch spicy tuna \u0026 avocado inside, topped with salmon, yellowtail \u0026 jalapeno tobiko (I get the caviar from her since she doesn't really like the little popping eggs of delight). Also a favorite, but less exotic is the Peach Roll. Of course their \"regular\" rolls and straight up sushi/sashimi is top-notch. Always a nice idea to throw one in for good measure. \n\nWhile I wouldn't suggest ordering dessert if you're getting delivery, they have a yummy Banana Chocolate Sprint Roll with ice cream. Not too heavy and a nice end to a wonderful meal. \n\nIt's by far the best sushi in Brooklyn and while not a bargain, the value is truly there. Treat yourself to Ki and you'll be a convert too.", "author": "anthony r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-24", "description": "Really enjoyed by experience at Ki Sushi Friday night. Went in with a friend and there was about a 15 minute wait. The wait seemed to go by pretty quickly though! \n\nI started off with a green salad and then ordered the American Dream roll. The salad was nothing special, but the roll was excellent! The roll was shrimp tempura with spicy tuna wrapped in soy bean paper. It was also 10 pieces and pretty filling. The only downside is the roll was a bit pricey ($16), but totally worth it! \n\nThe ambiance was great and loved the decor. This is a little bit pricier than your average sushi restaurant, but considering it's a little bit nicer than most and the sushi is good quality, it makes sense. If you're in the area I would definitely check out Ki!", "author": "Alexa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "I love this place. I love how fresh the sushi is. I love the cold ice water with the lemon. I love that even if you have to wait a little while you get a table essentially or you go and sit at the sushi bar. I've done both. I always order my go to salmon avocado, shrimp tempura, tuna avocado, yellowtail rolls. My friend ordered a dragon roll the last time we visited and it was awesome. I am going there tonight cause I NEED A PERFECT SUSHI FIX. Prices are great worth every roll. My go to sushi place.", "author": "Karla A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "This is, hand down the best sushi I have ever had (and I had so much sushi!) The fish is high quality. The rolls are delicious. The service is friendly and quite fast considering how packed the place was. Something interesting to note is the difference in their wasabi. It has a crumbly quality to it and is especially delicious. The pickled ginger is also a very high quality with a nice spicy kick.\n\nI've been thinking about this place ever since. On my list of favorites for sure!", "author": "Maya T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "Great omakase! I had the sashimi and sushi option for $60. I like the staff and fish all tasted very fresh!", "author": "Jasmine M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-08", "description": "We order from here all the time. I'm allergic to raw salmon and for some reason they included salmon in the roll. I asked them to make it right. They would not. I'm asking them to take care of it on the next order they would not. They aren't good managers of their business dedicated to serving their long time customers. Not a good experience.", "author": "Amman B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "delicious high quality city like omakase for a much reasonable price.", "author": "Laynee M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-12", "description": "love the salmon skin salad. attentive staff, good food, and great menu in general.", "author": "Robot.m. D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Delicious sushi and great service!!!!! So happy I'm so close to it!!! Def will be going back with my friends", "author": "Jess N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-23", "description": "Terrible customer service. Food was late for 1:15 minutes.", "author": "Eda B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-12", "description": "Waitlist was a mess. Came in at a little past 7 on a Friday and the place was packed. Good sign of a good place but that also meant the hostess said it'd be a 40-50 minute wait (just for a table for 2?!? But okay). Put my number down and she said she'd call/text so I left the super small waiting area and took a walk around the neighborhood. Maybe she thought this meant I'd left, because I come back 40 minutes later, no call/text. I get the hostesses' attention and check my name, she says \"oh \". Finally got seated 20 minutes after I showed up again (this is now a whole hour for a table for 2). Age dashi tofu was light and fresh, lacking a little salt or something but better that than soggy. A la carte sashimi (toro, salmon, yellowtail) was all a little too cold. I get that you'd prep all the fish for the day and keep it refrigerated, but when your fatty fish is solid, it'd be nice to let it thaw just a little. Wish they had online reservations to get that waiting system more organized next time.", "author": "Rachel W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "Quality sushi at  a  great price! I was craving sushi on a Friday night and my brother (sushi aficionado) had highly recommended this place for a reasonably priced omakase. We both chose the sushi/sashimi omakase for $60, where the fish is flown in from the Japan's fish market. There's a lot of fish and all very fresh. The toro was especially delectable and fatty! The sea urchin was delicious. And the unagi was also another favorite. Overall, Ki Sushi is really the place to go when you're not looking to blow $300/person on a quality omakase experience. The service is also excellent. We got there around 9pm and the restaurant was still packed. There was just one table open, so we didn't have to wait. But around 10:30pm, the restaurant was almost all cleared out.", "author": "Stephanie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-01", "description": "Most sushi is pretty much like every other sushi at the restaurants I've been to lately. Not so Ki Sushi. The sushi here is two cuts above. Very fresh, fairly priced, and efficiently served. Called for 9:30 reservation on a Friday. Boom, seated at 9:30. The sushi deluxe was generous and featured melt in your mouth Toro and a few other slightly off the radar pieces of fish. I'll definitely return to this unusually good sushi spot.", "author": "Moe B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-28", "description": "Quality going down. We've ordered and gone to Ki religiously for the past 8 years. Our past few orders we've noticed the quality of the fish has not been as high. I assume it is because they've changed their vendor, which is quite unfortunate. Probably going to find a new go-to spot as I don't think the recent quality warrants the price.", "author": "Becca G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-30", "description": "The ambiance at Ki is great. They have sushi but hot entrees are also an option. They have a nice saki menu as well if you're into that. If you can make a reservation, I would, the place gets pretty busy. I had the sea bass entree and it was really good. The group I was with for an assortment of different rolls and each enjoyed theirs very much. If you're looking for a nice meal with a fun atmosphere Ki is your spot.", "author": "Amanda D."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}