{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-05", "description": "This Sushi restaurant is soooooo great.   I often order but it is worth it to go in.  The service is some of the best I have had.  I used to be a New York City Server at some rather famous restaurants so I am picky about service and I really enjoy when it is good.\n\nThe Uni is fabulous.  I once went to Taro for lunch with a friend then to Ki for a second lunch to compare.  This place is definitely better!  \n\nI want to go there now!", "author": "Elle G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-25", "description": "Nice atmosphere. Came in right before lunch crowd so was quiet. Lunch brought families and kids in but still nice experience. Food was good, worth a visit", "author": "Jerome Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-19", "description": "Delicious sushi. Fresh and quickly prepared. Reasonably priced. I got the \"sushi regular.\" Six pieces of nigiri with a tuna roll plus miso soup. It was a fantastic meal. Waitstaff were all friendly, helpful and attentive. It was my birthday and they gave me free tempura battered bananas with ice cream and caramel. I'll be coming back to this place again!", "author": "Carla M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-09", "description": "Found this place on yelp thnk u yelp one of the best if the best sushi place me and my wife have gone to", "author": "John Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-24", "description": "Superb service. Tasty and nicely presented. Lunch boxes, rice bowls, combos, with usual favorites. The fountain and techno background music kept our one month old baby sleepy and calm all through the meal.", "author": "Christopher B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "GOD my favorite sushi place in the city.\n\nI first came here over a year ago-- my friend went to culinary school and told me that it was her favorite sushi place in Brooklyn.  I immediately could see why:  the fish is so completely fresh, the rolls are really creative, the lunch special is super affordable, you can actually read your tea leaves in your cup after your tea is finished*, the presentation is impeccable, and the ambiance is fantastic.  Hot towels scented with jasmine are lovingly placed onto your table the moment you sit, your chopsticks are gracefully perched atop a polished stone, your waiter has a smile, and there's a small waterfall in the restaurant.\n\nYep, life pretty much doesn't get much better than that.  All these reasons are why it's my go-to sushi place.\n\n*(If you know how to do that-- I just kind of ooh and ahh and try to imagine that they say something philosophical.)", "author": "J. K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-24", "description": "There's not a whole lot I can say about Ki Sushi that hasn't already been said.  So here are the Cliff Notes:\n1)Warm Mushroom Salad with Truffle Essence is delicious\n2)Their lunch specials are a good deal\n3)I've never seen Nigiri so fresh, high-quality and generous\n4)The Pikachu roll is epic.\nThat's it, get in there!", "author": "Erik W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-09", "description": "THUMBS UP\n- Attentive service, without being annoying\n- The garden salad was pretty tasty\n- They put effort into making the dishes look nice\n- The SHRIMP \u0026 VEGETABLE TEMPURA entree was yummy. They did a good job with the tempura. It was also kind of fun trying to figure out what the vegetables were. I think they had asparagus, taro, pumpkin, broccoli, sweet potato, etc. I might be totally wrong.\n\nTHUMBS SIDEWAYS\n- Zen decor\n- Too much ginger dressing in the garden salad. But unlike other salad dressings, the ginger dressing can get away with it.\n- I ordered the \"sushi regular,\" which consisted of 7 pieces of sushi and one tuna roll. The sushi was good, but the rice was a bit too warm, which I did not like. \n- The SEARED TUNA ROLL (seared tuna with asparagus, caviar \u0026 wasabi sauce). The texture of the asparagus was an interesting mix to the otherwise soft roll.\n\nTHUMBS DOWN\n- MY DATE GOT A BLISTER ON THE ROOF OF HIS MOUTH BECAUSE HIS EGGPLANT APPETIZER WAS SCORCHING HOT.\n- Said eggplant appetizer had too much sauce on it, it was kind of overwhelming the eggplant.\n- MY AGE DASHI TOFU APPETIZER WAS SCORCHING HOT TOO. But I didn't get a blister. When it cooled down after about 7 minutes, it was pretty decent.\n- Our waitress Shirley reaching in front of us to get plates off our table. I HATE THAT.\n- Lemon in our water. I like my water plain. I wish you had asked me first, Shirley.\n- As usual, it upsets me to go to a Japanese restaurant and not see a single Japanese soul working there.\n\nNote: In case you were wondering, the blister in my date's mouth popped during dinner. I felt bad for him but it was kind of funny how quickly he got this blister upon attempting to take a bit out of that eggplant. If I were him I would've complained and gotten some free shit. Tsk Tsk.", "author": "Kassy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-10", "description": "I never knew NY could have such good sushi, but apparently Ki Sushi has some amazing rolls!!! Thanks to one of my friends, Angelica L., who introduced me to this place during one of my visits to NY, I'm addicted!\n\nI LOVE the KI ROLL!!!!! KI ROLL! KI ROLL!\n\n- ki roll: tuna, salmon, yellowtail inside, topped with spicy crunch king crab, avocado, caviar, and gold leaf ($15)\n\nOthers dishes we tried:\n- tnt lover: chopped blue fin, toro, caviar, tempura flakes, scalion, asparagus, topped with tuna, served with soy sauce truffle oil ($14)\n\n- mushroom salad: warm wild mushrooms salad with truffle oil essence ($10)\n\nhttp://www.menupages.com/restaurants/ki-sushi/menu\n\nThis place can get packed during the evenings. The price is quite reasonable and the quality is good. Everytime I've been here, the service has been very fast!", "author": "CeCe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "I've never had Japanese food before (seriously), so I can't really judge the food. I can say that Ki Sushi is a beautiful restaurant with good service and very good lunch specials. Unfortunately they close between lunch and diner everyday so you have to be careful when you get there. Some of the ala cart items can get quite pricey but the lunch specials are really worth going there for. For about $10 I got miso soup, a salad, 3 little fried dumplings, a california roll, and some chicken teriyaki. Again, I can't really judge on the food, especially because I generally wasn't a big fan of it, but the place seemed like a great spot.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-05", "description": "Ki Sushi is definitely among the best sushi I've had in Brooklyn, and I feel lucky to have it in the neighborhood. Rolls are out of this world and the sushi itself is always fresh, tasty, and well-prepared. Minus one star for how they handle reservations. I have shown up several times on a Friday or Saturday night with a reservation and have still had to wait upwards of 30 minutes. I really do love this place, but they probably should just not accept reservations if they can't honor them.", "author": "Jess M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-26", "description": "Irresistible and irreplaceable, this tavern of Tokyo is situated between countless amounts of competition, yet it still reels in an incessant amount of clientele.\n\nThe dark and cave-like interior compliments the beautiful and bright presentation of the sushi; they are sliced and garnished to sensational perfection. The fish are fresh and delectable; they look and taste as if they'd just been caught from the Pacific. \n\nThe sushi chefs are friendly and fun; they were flattered when I'd asked about their slicing skills and were more than happy to show me how to do it at home. Sushi-slicing really is an art; it must be discovered and developed, which is precisely why my hands will stay far away from the honyaki; I like and intend to keep all of my fingers. But that's okay. If I learned how to make my own Japanese food, then I wouldn't have to come here. And then I'd be sad.\n\nSo there you are, America. If you're trying to have an exceptional experience, come to Ki. The service is diligent and astute; they are quick and to-the-point. They are attentive and around but not invasive and annoying.\n\nAnd like I said, it's a popular place--sometimes there's a bit of a wait. I say: stick it out; it's definitely worth-it. However, if you happened to be starving and simply can't stick around, no worries, save it for another night. Don't preoccupy the restaurant by calling or trying to reserve a table; they're small and busy; you must wait in line like everybody else.", "author": "Khalid M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "I can't say it's the best sushi in NYC but I'm sure they have the best sushi in Brooklyn. Very fresh sashimi and sushi. Appetizers are very good. Great staff and decor.", "author": "Asa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-11", "description": "I was initially skeptical that I can get good fish for $$ in Brooklyn. I was very, very wrong. \n\nPink Lady is funky--for me in a good way. My friend didn't like it, but she's tough with food. Get it to share in a big group I guess. 10 very large pieces.\n\nI got the sushi+sashimi combo. $30. Comes with a cali roll. I hate cali rolls, I happily ate these. Every piece of fish was fairly fresh to very fresh. I got some nice cuts like red snapper and a type of yellowtail. Eel was very good (sushi), my partner enjoyed it even though she doesn't like eel. We got a few pieces a la carte, the $8(!) bigeye toro was awesome, as was the amber jack. I would definitely do omasake next time, these chefs know what they're doing!\n\nService was speedy, but not particularly rushed. Short wait for a packed house as well. Very friendly wait staff. A small spill of soy sauce on my dish and chop sticks was immediately corrected (not that I cared).\n\nFor $80 total, 2 people were full. . . of epic delight. Ki Sushi is special.", "author": "Eddy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "I went to Ki Sushi for my belated birthday lunch with my relatives after reading the great reviews on Yelp.  All the rave reviews were true! There, the waiters are attentive and give you service with a smile. As soon as we went into the restaurant, they saw us with a baby, the waiter, without us prompting him, said, \"I'll bring a baby chair for you right away.\" For a lunch time crowd, they were a bit busy for Brooklyn than I expected (I live in Brooklyn), but that's a positive sign.  It took us a while to decide what sushi or other dishes to get.  They have a lot to choose from! \n\nMy aunt had their chirashi lunch special ($15). My cousin had their salmon lunch special ($15). My mom had their sushi rolls lunch special, which gives you choices of 2 rolls, soup and salad ($12). I chose the Ki roll ($18), which had a combo of salmon, tuna and shrimp with caviar on top.  It was really delicious, fresh tasting and colorful.  Just overall, attractive to the eyes and mouth!  Even for their specialty rolls, their prices were not over the top.  I've had sushi at plenty of places in NYC, and in other states. Their prices are fair for quality sushi.  I would definitely go back to Ki Sushi for dinner, a date, or to celebrate a special occasion with friends or family. Even my mom who do not care for sushi in general (she had eel rolls) enjoyed herself and tried a little of everything that we ordered.", "author": "Jennifer Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-08", "description": "Ki - if I cared more about the restaurant, I would translate what this meant in Japanese and see if the translation matched my experience or the ambiance the restaurant created.  However, I'm pretty sure no one would name a restaurant that translated into boring and overpriced in Japanese.  Not even these guys.  \n\nIt's not that there was anything wrong with this place per se.  it's just that if you are going to be an overpriced Sushi place - you need to deliver on something.  It's sort of like those guys who don't have a great job, don't have great bodies, and aren't that funny, yet they still expect to date models.  No - this is why you're at home by yourself on a Saturday night.  Pink wrote a song about this.  \n\nAnyway, Ki's ambiamce is fine.  They try to resemble a Japanese forest with plastic mini fountains and a darker, greener theme throughout the restaurant.  I suppose this is fine (once again, the restaurant is entirely normal), and the fear of having a Koala bear come out of the trees and attack you might add to an otherwise eventful evening, but still does not justify the price point for the restaurant. \n\nThe service was slow.  The food was ok, but just like any Sushi you've had, and worse than any good Sushi you've had.  \nSpecifically, we ordered Rainbow and Dragon rolls, as well as Philadelphia and Avocado rolls.  The portions were meager and the bill (with edemame) came out to ~80 bucks.  Yes, and that was without wine.  So, if you are looking for an overpriced mediocre experience - I think you have found your Sushi spot. \n\nThe one thing I suggest you order is the edemame.  The green beans were on steroids - and delicious.  Too bad no one should ever pick a restaurant based on appetizers.", "author": "Anushri M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-16", "description": "Ordered for delivery and everything was just okay. Had the seaweed salad, spicy tuna roll, yellowtail roll, and a salmon roll. The fish didn't taste fishy, but it wasn't fantastic. A bit pricey, but not too bad.", "author": "Victoria P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-15", "description": "The lobster tuna roll was to DIE for. I usually judge the cost of something based on the quantity and quality of the product, and even though you only get 3 pieces for $12, it was absolutely worth it. The presentation of the dish was nice, especially with the gold flakes and the caviar. What really made the dish was the wasabi cream that was JUST spicy enough to have the tinge of wasabi bearable, and just sweet enough to make you keep wanting more. I had so much cream left over that I wanted to eat my other sushi with it! One of the best sushis I've had. \n\nAside from the appetizer I also ordered rolls from the lunch menu which did not amount up the lobster roll I got earlier. I tried their chiraishi as well and that was pretty  good, particularly the tuna that melted in your mouth the moment you started to chew it.", "author": "Emmanuel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-10", "description": "It's always nice to have relatives visiting from out of town. I get to go out! Yay!!! \n\nSo at 100 degrees weather, the best places to simmer down and cool your body temperature are japanese sushi bars. Sushi buffets are great, but it's not hibernation time so you don't need to stuff yourself in preparation for eternal slumber. When it's this hot, people rarely have the appetite to eat. \n\nWhich is why Ki Sushi is a great affordable sushi place that makes their dishes aesthetically appealing for you to swallow.  \n\nSomeone at the party ordered a roll that has uni (sea urchin) in it. I am not a big fan of uni. You must have an acquired taste to enjoy that slop of yellow tongue-looking sea-slug creature with no eyes. And if it's spoiled, oy! it will take a whole bottle of sake to erase the burning rotten garbage taste that has forever imbedded into your amygdala. Brrr....frightening. However, if it's fresh, the slime tastes like sea water and fresh cucumbers. I know...50/50 chance. \n\nSo when I ate the roll that has uni in it, surprisingly, I didn't throw up! Because the uni served was fresh, I give this place 5 stars. \n\nPlus, we were a big party (8 ppl) and the waitress served us without any cavalier attitude. Yeah...we rarely get such treatment. Maybe we are loud. Perhaps we leave a big mess (that's why we don't go to places that serve us bread!! - except for Red Lobster, those rolls rarely leave crumbs. But come on, with the amount of butter they put in. Adhesive butter rolls.). I don't think we tip poorly. 18% seems about right. These days, restaurants want you to leave your arm behind. \n\nSo thumbs up for the person suggesting the place (I know who you are but you won't know who you are since you haven't friended me here. : P )", "author": "Harley Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-22", "description": "GF and I came out here in Brooklyn putting our trust solely on Yelp.  Most sushi joints in Manhattan are either super upscale or cheap and haphazardly made (those 50% off places in St. Marks).\n\nThis place is a happy medium with pretty damn good sushi.   I ordered the Sushi Deluxe dinner which was great but not anything spectacular.  However GF's Sashimi Deluxe came out very amazing ($25).\n\nThe sashimi pieces were in thick generous cuts.  They were vibrant in color, firm to the bite, and 'springy'- indicative of super FRESHNESS.  They plain melted in your mouth and it was heaven when chased by a shot of hot sake.\n\n2 large bottles of house sake, 1 edamame, 1 beer, \u0026 2 quality dinners = $85 + tip.\n\nNot bad.  Definitely coming back here again.", "author": "Andrew J."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}