{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-25", "description": "Came by for a quick and healthy sushi meal after eating greasy food all week and was quite surprised! Accompanied by my normal crew, M.Y. and N.S., we dropped in for what I thought would be a run of the mill sushi place with middling quality but we were wrong and delightfully so!\n\nWe ordered the Chiraishi, the miso cod entree, and the sushi combo entree. As per my usual, I ended up with the chiraishi which had excellt quality sushi, moreso than I had ever expected. The tuna was lovely and meaty, the yellow tail had a beautiful texture, the tamago (egg) was a little sweet for me but still good, the salmon was super fresh without the usual fishy background that you get in most sushi joints, and the toro was, like the tuna, a wonderful high quality fish. Atop a bed of seasoned rice, my night was complete. I could have easily just eaten that bowl of chiraishi and then went to bed. \nBut wait! N.S. ordered the miso cod which was the most buttery beautiful piece of fish I've had in ages. The meat fell apart with barely a touch and revealed a juicy well cooked belly of meat that was airy but flavorful, definitely something to order again.\nM.Y. ordered the sushi combo which came out with three different rolls but standard ones, tuna, salmon, and a combo roll which I can't remember at this point. She noted that all of them had, again, good quality fish and were all quite filling. \n\nSo why 5 stars? Hell I'd give it 6 if I could. The price was amazing for the quality of the fish, service, ambiance, and overall restaurant. Definitely a place to come to to get high quality fish without breaking the bank. (For reference, my Chirashi was 28 dollars but had 21 pieces of fish.)", "author": "Caroline L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-20", "description": "My son was craving Sushi, and since we are staying a few blocks away we thought we would try this place out.\n  Super clean, friendly and personable staff. They bring you a warm cloth right when you are seated, which is very traditional Japanese, which was awesome.\n  Met friends tonight since we are visiting and they wanted to go here, so we went two nights in a row!\n  Being from Kauai and having fresh fish all the time brought to my door, we are spoiled, and We loved this place that much! Really cool vibes too", "author": "Ronny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-18", "description": "I've been to the other location of Ki Sushi and they're both excellent- amazing menu/food with an intimate ambiance and friendly service. My favorites are definitely their Ki Special Rolls and their appetizers. Everything tasted really fresh and delicious :) \n\nSeared Tuna ($14)-5/5 Seared tuna was delicious, no fishiness to it, beautifully and simply decorated, and topped with avocado crispy garlic chips and truffle soy \u0026 herb wasabi oil- YUM! \n\nTNT Lover ($18)- 5/5 My favorite of the special rolls! Made of chopped blue fin toro, caviar, tempura flakes, scallion and asparagus, and topped with tuna and served with truffle soy sauce. You can definitely get hints of truffle soy sauce. \n\nToro \u0026 Scallion (M.P)-3/5 I was addicted to eating this in Japan and hoped that it would be the same here. The difference is that the ones in Japan minced the toro while here its just a chunky piece. I think minced toro would be a lot better. It's still decent though. \n\nAmerican Dream ($18)-4.5/5 Pretty generous portion with 10 pieces and it's a pretty bulky sushi. This was a soy bean paper wrapped sushi with shrimp tempura, spicy tuna, avocado, tobiko and topped with spicy mayo and eel sauce. I do like the combo of crispy shrimp tempura and then a soft soy bean paper wrap.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-24", "description": "Very disappointed to come here for dinner. The ambiance is extremely low lighting. You can't see your food or menu. Patrons needs to use their flashlight from their cell phone in order to view menu and food. The waiters also have a hard time even noticing you because the restaurant is too dark. Very hard to enjoy your meal and have a good dinner experience.", "author": "Shirley W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-24", "description": "holy cow, this place was amazing!!!\n\nit's a very cute and intimate space, great for date nights but also family outings (saw a few large groups) when i stopped in on a sunday night.  my dining companion and i both opted for the sushi omakase, then shared a lime ginger creme brulee to wrap things up.\n\nthe sushi omakase came with 10 pieces of chef's selection, all of which were great, fresh and tasty.  personal highlights were the fluke, amberjack, salmon, fatty tuna, and scallop pieces.  the rice were also perfectly seasoned with vinegar.  according to my dining companion, i was cheesing very hard as i ate my meal lol.  the lime ginger creme brulee was creamy and a nice ending to my meal.\n\nnice atmosphere, attentive staff, great food, i can't wait to be back!", "author": "Wen Jin G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-30", "description": "Not your traditional sushi spot. Sushi and apps are suited for the modern palate. Not a bad thing, if you like the more fusion side of Japanese food. For example, most of the pieces served were torched and has sweeter toppings/garnishes. The sushi were also more reserved leaning towards salmon and tuna pieces. Again, not bad if that's your thing. The age dashi tofu doesn't have the sticky dough as traditional Japanese joints but definitely not high quality tofu. For the price though, $40 for 10 pieces of sushi (omakase) is not bad at all. No doubts on the quality of fish, it's the good stuff but the rice needs work because it was cold and a bit tough.", "author": "Florence V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "5+ stars!! Ki is the best! The sushi is absolutely delicious and melts in your mouth. Ki hands down uses the freshest fish and you can absolutely taste the difference between Ki and other sushi spots. The service is always impeccable as well. \nI have been going to this location for years and then started coming to their Flatbush location, as the Smith Street one was under renovation for some time. I just returned back with my dad this past Friday (and learned that they've been back open for about two months already! - RUN!!). Both locations are equally great but this one is just more convenient for me in terms of getting to and parking. \nAside from our regular order of the special rolls, my dad and I tried the chef's supreme sushi and sashimi platter ($60- well worth it!) this time.  \nI highly, highly recommend Ki to all my friends and family, and now to you too! :)", "author": "Daria D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-20", "description": "I came here with my parents on a Saturday night. First of all, my parents ain't the easy going type. The hostess seated us immediately. The decor is modern and darker than most sushi joints. \n\nGood: \n- seafood dynamite: the name is cheesy, but it was awesome. The seafood and the bit of cheese just worked. It wasn't over salty to kill the seafood taste\n- omasake: I ordered this and I was initially skeptical. It turned out to be quite good with fresh fishes that you won't normally get from typical sushi set order\n- seabass with miso: my mom ordered this and I had a few bites. The sauce was delicious and the fish was fatty. Nicely combination.\n- service: my parents don't drink ice water. They asked them whether they wanted hot tea and came to refill and check our cups like every 5 minutes!!\n\nOK:\n- terayaki steak: my dad ordered this, and I had a few bites. It was good, but not mind blowing. \n\nNeeds improvement: \n- none\n\nTldr; I will definitely come again because they have great service and they have different types of food for the whole family. Also, considering that the location is relatively close to my parents', it's a solid 5 from me.", "author": "Patrick N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-30", "description": "The ambiance and establishment were on point.  It was intimate enough but still open for groups.  The service was awesome and amazing.  I don't remember seeing my water glass less than 1/2 empty.  They cleared our table of the empty dishes and plates in a timely manner and without any disruption to us. \n\nThe food was spectacular!!  The Omakase was chef chosen and consisted of various fishes flown in from Japan.  Even the wasabi for the Omakase was magnificent!\n\nThe regular Sushi and Sashimi Combo was great.  There is a definite difference in the texture compared to the Omakase but it was still great!\n\nBetween the food, service and ambiance, Ki Sushi is definitely worth a visit!!", "author": "Patti P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "What a great find! Nice, cozy, intimate decor with polite and attentive service.\n\nWe ordered an array of food. The highlights were a particularly tasty miso soup and a specialty roll based on a shrimp tempura roll with avocado and something else crispy. The rest held its own, although the spicy salmon could've had more flavor and/or spice to it.\n\nI'll definitely return and try to make a reservation in advance since we did have to wait about 15-20 minutes for a table since we must've arrived at a rather peak time and the place was quite full.", "author": "Charles B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-20", "description": "This place is amazing. This was my second time at the Smith Street location. Making a reservation is a must because they do get busy, you can even call in a hour or two before. I cannot wait to try more things from the menu! Fish is super fresh.", "author": "Tamara D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "Ki Sushi is a solid choice for some high quality Japanese eats in the Cobble Hill area. I wandered over for a weekday lunch, as most of the Japanese restaurants near my office in Downtown Brooklyn are solidly mediocre.\n\nThey have a variety of lunch specials, from sushi and sashimi combos to bento boxes. I went with the 2 roll special ($14), with an eel avocado and salmon avocado roll. Basic? Yes. Delicious? Absolutely.\n\nThey start you out with salad and miso soup for lunch, which are both sizable portions. As for my rolls, I was pleasantly surprised by the freshness and quality of the fish. The rolls were massive, with much more fish than rice. The rice was seasoned perfectly, while the salmon practically melted in my mouth. You usually don't find high quality cuts of salmon in basic maki rolls, but these were solid.\n\nI think I've found my new favorite sushi in the area! Ki Sushi is definitely worth checking out, and I'm already looking forward to returning for dinner soon.", "author": "Marina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "food was great in person then i ordered deliver the next day and it came prompt and still really good.", "author": "camila p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-03", "description": "Highly recommend this restaurant. My boyfriend and I have been coming here for 4 years since moving to the neighborhood and this place has grown from a decent neighborhood joint to a reliable place that we eat at and/or order takeout from every single week. The unfortunate thing is that every time we want to eat at a restaurant and not be disappointed, we always come back to Ki, and never end up trying anything new on Smith St! \n\nI've noticed constant improvement here. For example, even though the agedashi tofu is always fried perfectly, they have been slowly tweaking the dipping sauce over the years from sometimes too bland, sometimes too sweet, to now, perfectly on point every single time.\n\nI'm pretty picky about the quality of food and have never complained about the dishes here. I just want to point out that their sushi, nigiri, cut rolls, and hand rolls all have a very satisfying fish/neta to rice ratio, and they take care thinking about not just the flavors, but also the textures, of the rolls.\n\nBig shoutout to the server Eddie and also this Latino busser whose name I never caught (sorry!!): they are always quick on their feet and always remain smiling and friendly even when the restaurant is crazy busy, and I've seen the former go out of his way to say hi/ chit chat with customers he knows. Yes hospitality/service is their job and the job of every server, but not every server achieves this, esp at these neighborhood restaurants. I find this to be rare especially at Brooklyn restaurants/stores.\n\nLastly, to whoever preps the rice at Ki: your sushi rice is cooked to perfection :)", "author": "Jenny J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-18", "description": "Great ambiance and feeling inside. The appetizers are creative and not just the same old. The rolls here are on point. Very interesting and different from the usual sushi places around Brooklyn.", "author": "Igor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-14", "description": "Delicious and so fresh! Great to eat there and just as good to order in. Worth the slightly higher price.", "author": "Corey W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "This place is definitely better than any sushi joints in South Slope Brooklyn and all the other sushi spots up 5th ave in prime Park slope. \n\nKi Sushi has high quality ingredients which just tastes fresh and the prices are not bad at all for the quality of the food. (Unlike Katsuei up on 7th Ave) \nI came here for family date night and me and the husband decided on Omakase while my daughter had the rock shrimp tempura. The rock shrimp tempura was not the best, I've def had better, but my daughter still housed the whole plate. What I was surprised and amazed by was the Omakase. I got the sushi \u0026 Sashimi combo. My husband got the sushi Omakase and order a special roll.\nI have never seen uni or oyster served for Omakase and it was SO DELICIOUS! Both the uni and oyster was so sweet, not briny or fishy tasting at all. I've had bad uni and oysters before at other sushi places and let's just say it's gross and I won't give you a description that you will never forget. \n\nI thought just the sushi or just the sashimi won't be enough to fill me up so I got the combo and it was definitely more than enough food for me. The best part is that combo was only $60. That's almost unheard of for Omakase AND for that quality of food.\n\nI will definitely be back to try more of their specialty rolls and this will be my go-to if I ever want Omakase.", "author": "Janet Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-08", "description": "Fantastic local sushi spot for fresh fish and special rolls. They have many different kinds of rolls and love the Japanese beer selection they have. Cozy, intimate atmosphere. Usually a wait on a Friday night, but no longer than 40 mins. The service is also great, never waiting too long for the next roll to come out or the drinks \u0026 water.", "author": "April A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-07", "description": "Delicious and fresh sushi! The sushi and sashimi combo had a nice variety of cuts that weren't your average salmon and tuna nigiri. However, they did included a melt-in-your-mouth toro piece in our combo which made it especially savory. Everything was fresh and the wait staff was always speedy clearing our plates and refilling our water. Would highly recommend.", "author": "Elysia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-26", "description": "Very good sushi spot in Brooklyn! The sashimi was very fresh and included a great variety of various fish. The Njiri rolls were also stellar some of the best yellowfin tuna I have had.", "author": "Jake W."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}