{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-26", "description": "This is just another reason why Brooklyn is becoming my new favorite place to explore.  One of the newer additions to Smith Street (seems a new thing opens every other day!) Ki is a great find. Tastefully designed, with stone and exposed brick (really couldn't tell if it was authentic or they designed); not to big, not to small, I really enjoyed the experience.  Make sure you listen to the specials, because its one of those places that even though you love the fun roll (and the have PLEANTY creations-- foxy roll a must do), they have some not so easy to get types of fish to try.  Prices are reasonable and the red bean ice cream worth leaving room for!!", "author": "Michelle F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-29", "description": "Best sushi I have had in Brooklyn to date! Fresh delicious Tuna.... yes please!!\n\nI'm so pleased with this place I had to write a review! As a rule, I am incredibly picky about the sushi that I eat (whole foods or trader joes sushi? no thanks), so I initially approached this restaurant with more than a few reservations. Dinner was lovely- great minimalist, dark hardwood decor, friendly and accommodating staff, and, what I soon realized were top-notch sushi chefs. Although the restaurant was about half- full, the chefs were skilled enough to produce our orders in what seemed like seconds. I started with their \"Spicy Girl Roll\" (spicy salmon, spicy yellowtail and avocado, topped with spicy tuna and tempura flakes), and they won my heart. I will certainly be returning to try the rest of their Specialty Rolls. It's certainly true that the Special Rolls, while scrumptious, can run a little pricey, so if you want the same awesome fresh sushi without the hit to your wallet, just ask for a traditional kind of roll, and even if it's not on the menu, they will be ready and willing to accommodate you- and it will be much cheaper.\n\nA final note-- this place is also great for takeout. I dropped by to order take-out one evening, and not only were they ready in under 5 minutes (granted, it was early, around 6), but the price ended up being quite modest. One six-piece order of Spicy Tuna rolls and One 8-piece order of avocado rolls was exactly $10, including tax. Perhaps the biggest surprise of the evening. The other big surprise was when I called to place the order, and my phone got disconnected-- not only did the lady call me back (incredibly unusual behavior of an over-taxed hostess, oy), but she also insisted on apologizing profusely for what was obviously my fault. Just generally nice people.\n\n________ UPDATE, 3 WEEKS LATER______\n\nI just keep coming back here. No regrets. Other places in the area just don't cut it. Holla.", "author": "Katya N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-21", "description": "I really enjoyed dinner here. The fish is exceptionally fresh and everything was nicely presented. Some of the best sushi I've had in NYC (the tuna was especially top-notch). I mostly had nigiri, but I feel like you can't really go wrong here. Two thumbs up!", "author": "Irina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-19", "description": "The only reason why I don't eat here every day is because I don't have the cash (also I had a bad experience dining there). Their sushi is really good--and I recommend their fancy roll (uni in a roll, heeeaven) but their prices have been going up since it opened and I can't really afford to eat here. I really wish they had specials more often...and not just dinner bento boxes!", "author": "Cat H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-09", "description": "Amazing sushi! I have to say one of the best if not the best I've ever had.  The sushi almost melts in your mouth.  Place is clean, great ambiance, decently priced.  Two thumbs up!", "author": "Melissa A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-09", "description": "Our to go place when we want a good sushi that is not overpriced.... we love ki sushi!!!!", "author": "clio z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-14", "description": "Blue Fin Toro roll, stuffed with lobster, topped with caviar and tempura!? Win all the way!!", "author": "Kenny H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-18", "description": "We have eaten there a few time.  A bit pricey but you get a good meal for your money.  Professional service.  Call to reserve as they often sell out.", "author": "Miriam K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "Standout sushi in a neighborhood with a few above-standard spots. Fresh \u0026 inventive food served in a sleek dining room - though it can get a bit noisy. My out-of-town sister has declared this a requisite spot to hit up whenever she's in town, it's that good.  Favorites include: Jalapeno Yellowtail appetizer, Ki roll \u0026 Spicy Girl.  The special rolls, in particular, are beautifully plated.  Though the sushi is the main attraction, the kitchen spits out some great eats as well, especially the mushroom salad and the broiled black cod.", "author": "Erin H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-30", "description": "i'd say i'm more of a casual sushi fan than a fanatic, but this is probably my favorite sushi restaurant in brooklyn (though, granted, i haven't been to many of the artisanal places around). fresh, flavorful ingredients; nice variety in their specialty rolls; \u0026 a great lunch special. whenever i have a visitor from outside new york ask me to take them out for sushi, i bring them to ki.", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-26", "description": "Very fresh sushi! The spicy tuna roll was so soft and melted (not literally but the texture was amazing) in my mouth. I think their prices are really good too, i got two eight piece sushi rolls, a miso soup, and salad for 12 dollars. Super refreshing meals, especially on a hot summer day. The lighting is a little dark for my taste, but that's my only little complaint. Food and service were excellent and this is coming from someone who took a 50 minutes subway trip from Queens. Totally worth it. :)", "author": "Maddie A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-18", "description": "this is the place to go if you want fresh sushi. i will never again go to neighborhood's hana, osaka and hibino.  just stick with ki.\n\nloved the dynamite roll (yellowtail), and cant wait to try the fantastic roll (tuna). also had the angel roll, which was so great bc you could taste all the different ingredients meld together. we also go the usual: spicy tuna roll and sashimis. \n\nits a great date place, and the wait staff is friendly.", "author": "Yvonne H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-04", "description": "Holy shit! As a California transplant, I thought I had had good sushi, but I guess I thought wrong. The fish here is *incredibly* fresh and the rolls are creative and even whimsical. Who knew sushi could be funny? Highly recommended: the unagi (I honestly thought I would have an orgasm upon eating) and anything with spicy tuna. I also recommend the lobster appetizer -- the meat was out of this world. The one thing I found slightly dissapointing was the Prawn-grapefruit salad, which I ordered for its originality but ended up not being terribly innovative (or as innovative as the salad in my mind). Finally the prices here are unbeatable. It's worth every penny!", "author": "Cortelyou K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-06", "description": "Really fresh, delicious sushi.  The fashion roll has to be my favorite... thinking about it makes my mouth water.  The appetizers are delish too - try the miso eggplant or the broccoli (it's simply prepared with garlic \u0026 pine nuts but so yummy).  Servers are very friendly, as is the chef/owner Kevin.", "author": "Christine H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-14", "description": "Cheap and delicious lunch box special. Comes with edamame, salad with ginger dressing, pineapple, california roll, miso soup and entree of choice. I've had the salmon which is great as well as the tofu tempura. All for around 9 bucks.", "author": "Helena F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-05", "description": "This place has super good sushi! You gotta try Ki Rolls. They have gold on top... Very delicious.", "author": "L P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-07", "description": "This is my favorite sushi place in the neighborhood, so fresh, good service, a big smile behind the sushi bar... try the omakase for a splurge.", "author": "Stacey G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-12", "description": "3.75\n\nVery impressed with the Mushroom and Tuna salads\n\nSpicy Tuna above average\n\nToro was an absolute disappointment.\n\nOne of the better Sushi Rest. in BK", "author": "Nick Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-21", "description": "A friend and I went for dinner at approximately 5 o'clock today.  the overall ambiance of the restaurant was very nice,very modern looking almost like a posh  New York City restaurant on Smith street.  we both ordered sushi and shashimi combinations and the rolls were enjoyable however I have to say that the quality of the fish was on average.  It was nothing spectacular about the freshness of the fish nor the portion sizes but did love the service. The waitstaff was very attentive to our needs.  I would definitely come back but I notice that it's probably more appropriate to come back for a lunch special, rather than for dinner.", "author": "Neil P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-18", "description": "Ki has amazing Japanese food. They have a sushi bar, tables, and booths. They have excellent waiter service. Also, Ki has a very wide variety of food. The extremely great thing about Ki is if it's not on the menu, they will do the best they can to make it for you. Now that's what I call great customer service.", "author": "Johnnie C."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}