{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-19", "description": "Hands down, this sushi restaurant in Brooklyn is the best.  I have no regrets traveling from Washington Heights to come here.  I found this place on yelp and decided to come at night with my friend.  I have no other words to describe it other than a \"must-try\".\n\nWhen I came to this restaurant, the ambience was traditional, yet trendy, and it was nice enough to be a good date night place.  The wait staff was very kind, the menus were clean, and the sushi chef was very meticulous with their preparation.  I called in advance for reservations, and they honored the time right to the minute.  Once we ordered, the sushi arrived right after it was done and the quality of the ingredients are seen up front.  There are no funky smells or anything, the fish is fresh, the rice is fresh, the seaweed is very good.  Overall, just wonderful flavors, very fresh, very clean.  I usually do not eat sashimi when I am out, since I do not trust the quality of the fish at many sushi places; however, this one won me over.  I trusted them to have the highest quality salmon and tuna, and they did not disappoint.\n\nWhenever I am back in town again, I will definitely try this place again.  All of you should visit this place at least once.  You will not be disappointed at all.", "author": "Thomas Ticha P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-14", "description": "Easily the best sushi in the neighborhood and a competitor for best in the city. All the fish is extremely fresh and they have some of the higher end sushi (e.g., real king crab, not crab stick) not found at your average sushi place. Prices are high but you get what you pay for.\n\nUpdate... demoted to 3 stars because of inconsistent quality lately. Hoping they step it back up to previous levels. May be better to go there on a friday or saturday when the fish is fresh.", "author": "Bkduc D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-29", "description": "One of the better sushi restaurants in Brooklyn and a reasonable price point. Always ask to sit at the sushi bar and ask the chef what is fresh and if he has anything in from Japan - you might be pleasantly surprised at what he will conjure up.", "author": "Chris N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-03", "description": "I've been told great things about Ki.  Given an opportunity to dine solo at the bar I ordered the Supreme Sashimi Omakase for $45.  I guess I'm a fairly experienced sushi eater, but I expected more.  True, there was a single kumamoto oyster that was delicious.  True, there was a \"live\" scallop, and toro.  The three of which would not make it to a normal sashimi plate.  And all the fish was very good (though the toro was tough).  But there was nothing exotic or new.  No roe of any kind, no shrimp, no eel.  If I'm ordering their most highly priced entree which is supposedly telling them to be creative... I'd expect more than this.  I kept wondering if there was going to be another plate or something.  When it became evident that I would be leaving hungry, I asked for a bowl of rice.  They added $1.50 to my $45 entree that came with nothing else.\n\nIn total, I would skip this and either go to Sugiyama in Manhattan (for real quality and variety) or to Hana Cafe and order the all-you-can-eat (that way you can pick what you want).", "author": "Dave N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-04", "description": "this place is pedestrian, they serve a fake seaweed salad, the kind with food coloring you find in delis.  but much worse, they are padding bills as another Yelper called out.  I had a modest $24 tab which showed on the receipt but was ingeniously stapled below where I could see, only to receive a bill of $42.  If this place needs to make money that badly I would say it isn't a safe bey for sushi, or even miso soup.", "author": "Lance G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-14", "description": "Great service, delicious hot appetizers (miso eggplant) and fresh carefully crafted sushi at a moderate price.", "author": "Mani N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-03", "description": "If you think this is the best sushi in Brooklyn, then you may have confused getting a hot towel for eating fresh fish. \n\nsome of these rolls i had were so odd, mushy and confused that I had to control my gag reflex.\n\npresentation of this place is good, but ambiance and hot towels doesn't make up for shit japanese food.", "author": "Daniel D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-31", "description": "I'm still not quite sure why this place has such great ratings?  Perhaps brooklyn just doesn't have that many decent sushi spots?  I'm not trying to insult brooklyn with that comment.  After seeing the great reviews I was pretty psyched about trying this place out... and really there was nothing that wowed me or stuck out to my like this is great sushi.  So perhaps I thought the prices were cheap or what you're getting, again NO that's not the case. \n\nWhile there's a great selection of food here and the fish quality is decent, nothing at this place warrants the 4.5 stars rating.  So still I am very much confused about the \"great following\" this place has.  I guess this just means I need to go back and try it again?  HOWEVER, after eating my meal here the first time, I remember not being impressed, nothing blew me away, and nothing was memorable so really do I want to come all the way to brooklyn to try this place again?  Not really.  Maybe if I lived in the neighborhood, I would have a better appreciation for this spot.", "author": "Red J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-18", "description": "Is it wrong to go to the same restaurant twice in one weekend? \n\nKi's fish is so goddamn fresh I couldn't help myself.   \n\nWhile I do like their rolls, as rolls go, I definitely think Nigiri is their strength. Those \"special\" maki rolls have WAY too much going on. I prefer giving each delicious piece of fish it's time to shine. Friday night I went to Ki with the ladies. I ordered the Sushi Deluxe platter, 9 piece of Nigiri and one tuna roll (I subbed for salmon). This was amazing. Two pieces of melty salmon, two of tuna, one Spanish mackerel (an unbelievably close second to the salmon), one yellowtail, one butterfish, one fluke (i believe) and I forget the last. Whatever. It was all wonderful. \n\nNext visit we ordered the Sushi/Sashimi platter. I wasn't SUPER impressed. The salmon sashimi featured a leaner, more dull fish. All of the sashimi (yellowtail, tuna, amberjack) was pretty good, but nothing mind blowing. Tuna was best. Along with the sashimi, we received 5 pieces of sushi. Eel, butterfish, spanish mackerel (again, amazing!), yellowtail and what i believe was a snapper. These were awesome. My boyfriend was eying the \"pikachu roll\" forever, so we decided to get it in addition to the sushi. It was definitely delicious, but again - there's way too much going on in these rolls! Pikachu features salmon, tuna, and yellowtail, alongside avocado and shrimp tempura - all these wrapped in a marbled seaweed. The ingredients were high quality and fresh, but hard to appreciate! Despite that, I love this joint. Best sushi (and service!) in this part of Brooklyn, maybe in the entire borough. Doooo eeetttttt", "author": "Briana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-02", "description": "Best sushi place in Brooklyn!  My bf and I always go to this place and it never disappoints! Their rolls are amazing and so is their chicken katsu", "author": "Liana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-01", "description": "Score another one for Yelp reviewers! One of the most delicious salmonyaki bentos I've ever had. Perfectly bbq'ed salmon skin handroll too. When I say I miss Brooklyn, what I mean is I miss this place.", "author": "Dan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-25", "description": "My absolute favorite sushi spot in Brooklyn. Incredible fish quality and the waiters are always on point.", "author": "Daniel L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-07", "description": "My husband just confessed to me that he got super diarrhea from their Grilled Spicy Miso Sea Bass.  I guess we won't be going back......", "author": "Su S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-18", "description": "This is one of my go to spots in the neighborhood. I love the ambiance, the service, and the fish is always so fresh. I've been for the omakase (shipped in from Tokyo!!!!!!!) and it was super delicious and reasonably priced considering it comes in from Tokyo! I've also been for sushi off the menu and is delicious and fresh. My favorite part is when they bring you the warm nice smelling towels once you sit down. I love that you can make a reservation which I recommend because it can get busy on the weekends.", "author": "Rebecca K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-04", "description": "Best sushi I had in a while. The service is excellent. Try the Omakase Supreme for a memorable experience. I'll be back...many times.", "author": "A C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-24", "description": "I had a decent meal here, probably 2.5 stars would be fairer.  But those who are gushing with five-star reviews must have been to a different restaurant.\n\nI walked in with my girlfriend on a Friday night, and we sat at the sushi bar.  The place was fairly crowded but had space for walk-ins.  A bit too loud, but for two people it was okay since we could lean in.  Decent atmosphere -- and since I was facing the bar I couldn't judge more than that.  \n\nFood: She had the tempura ($16), and I had the sushi deluxe ($23).  The tempura was very crispy and relatively dry, which is good (IMHO), but there was not much flavor to the shrimp or vegetables, underneath that excellent crust.  The sushi deluxe was a reasonable portion (10 nigiri and a roll), but:\n- nori was soggy on the roll\n- serving a tuna roll with all nigiri is pretty unimaginative and offers almost no variety to the meal.  Remind me what \"deluxe\" means?\n- the nigiri did not seem to have much flavor, and several were chewy.  The salmon was great, oily and fragrant, but otherwise each bite just wasn't memorable -- I could hardly discern from one fish to the next.\n\nLet me add that this was the first time I've eaten sushi in *months*, and I was craving it!\n\nService: brusque, nothing special.  On two occasions the waiters had the amazing insight and tact to serve and clear plates from *between* us, rather than from the side, with an arrival so abrupt that it felt like they were literally forcing us apart.\n\nOne other note: I was glad to learn that all the tuna they serve by default, at least in the sushi deluxe, is Big Eye, not Bluefin.  Apparently the Big Eye is a little less threatened (though I'm sure the restaurant's reason is mainly price, which is fine).", "author": "George S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-05", "description": "The service at first seems great until you realize they want to get you in and out as soon  possible. We were hurried throughout an amazing meal. Go tos are on the appetizer menu with the lobster tuna roll and the TNT. Considered dropping to a 3 star because we were annoyed by the above and may just amend it.", "author": "Kosta V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "As for the fish, its great.  I had the sashimi omakase and the Hokkaido Uni which they get delivered from Japan twice a week.  The fish is definitely worth the price  here.  For myself however, I was not a fan of the ambience of the thumping club music and low lighting that makes it seem like they're concealing something inside.  To each his own.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-08", "description": "Have been here one time. Ki has a great ambience and their sushi is good but not excellent.", "author": "Eddie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-08", "description": "Wow.  Amazing food.  I'm sure there isn't a bad thing on the menu.  People have really hyped up the lobster-tuna roll, which is why I/we got it.  Compared to some of the other things we got, this definitely wasn't my favorite thing.  That's not to say the LT roll was bad.... it's just a testament to how good the other things were!  The mushroom soup was great (but you should only get it if you're mushroom guy, or gal).  Other highlights were the Foxy Lady roll and the Ki Roll.... wow.  Both just melted in your mouth.  Some of the best sushi I've ever had.\nFood aside, it was also a very nice place with fantastic, polite service.  Bargain hunters beware.... this is not your place!  It's not cheap, but you at least get what you pay for.  High quality food, top end preparation and service, in a nice atmosphere... a very well run restaurant.", "author": "Brandon R."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}