{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-21", "description": "I popped Albie's meal-with-a-girl-at-Ki-Sushi cherry and I'm proud of it!  I came here on Friday after hearing rave reviews about the incredible Japanese uni that gets shipped in \"only on Fridays\" and waiting a painfully week (I flew in Saturday craving uni).  We had Albie's go to man, Kevin, take care of us for the evening .  The meal was perfectly orchestrated from the piping hot miso soup with fresh mushrooms, the incredibly buttery toro \u0026 avocado bowl sprinkled with thin slices of dried seaweed, a gorgeously presented sashimi platter of the freshest and tastiest fish (Japanese mackerel, hamachi, red snapper, wild salmon, sweet shrimp, scallops) i've ever had.  We tried to get the uni but Kevin admitted although they had it we \"should wait until next motn as it was out of season\" and \"wasn't that good.\"  Kevin is our man, the man and he sure knows his stuff.  I know I'll be coming back for more, come May.", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-24", "description": "I live in Manhattan and have access to many Japanese restaurants.  However, I travel to Brooklyn to inhale the wonderful sushi, fantastic service and good prices.  It is one of the best Japanese restaurants I have eaten in.  The fish is always fresh and definitely top quality.  The sushi chefs are very creative constantly adding new dishes to the menu. I continue to recommend Ki  to all of m friends.  Try them....I know you will enjoy the experience..   .Marilyn Z", "author": "marilyn z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-26", "description": "Beautiful. Nice attention to detail. Warm mushroom salad is a must. Spicy Girl roll also a must. WE LOVE this sushi.", "author": "Mel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-06", "description": "The freshly-grated wasabi is probably the one aspect of Ki that I think is the most emblematic of the fact that they're better than your average neighborhood sushi bar.  My one caveat is that it can be pretty loud inside during dinnertime.", "author": "Joshua H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-15", "description": "I have been going to Ki Sushi over 50 times. The sushi is generally  above average i would rate an 8. Recently i ate there and there was a fish scale that was not removed from my sushi, i was mildly upset, everyone deserves a break, i mentioned it to the waiter and he started laughing and did not take me serious. Then the !@#$ hit the fan there was a HAIR in my sushi I was irate i called over the simple waiter and he did not take it seriously. He went to the owner, who replied to the waiter to offer me a dessert. (WOW). Being that i was a frequent customer i was expecting a sincere apology not a @#$% Bow or accomidation. I got neither and i know the owner personally. He will for sure be reading this. I am not ashamed of writing this review because they only care when you write a review, otherwise they only want your money. So to wrap it up good Sushi, usually clean except the hair and some bad odors. Totally inept customer service.", "author": "Gabriel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-09", "description": "I LOVE Ki Sushi! It is the only sushi place near Brooklyn Heights that I actually like to get sushi from. The only reason I sometimes go to any other place is that they are less expensive (i.e., Nanatori on Montague St.). The fish at Ki is of the highest quality and the rolls are creative and delicious! The only reason I am giving 4 stars instead of 5 is that they frequently ignore my request for NO WASABI and I hate getting my $50 sushi meal delivered, biting into my $3 piece of sushi and tasting the nasty green stuff. They were a bit rude on the two occasions I brought this mistake to their attention (although it has happened more than twice, I have only had the energy to deal with it twice). Other than that, the service is great, and the food is amazing! There is one sushi chef in particular who smiles at customers and is very friendly (I think he stands all the way to the right.) Oh, and they are open late, which is great!", "author": "Kelly A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-07", "description": "from the other review i thought ki sushi is suppose to be different than other japanese restaurant.\n i'm a sushi eater . i've been to so many japanese restaurant at manhattan, when i moved to brooklyn, i tried ki sushi ...its was nothing so special about it. \n\n its pricey.its more expensive than other japanese restaurant  near. \nwith the same price i can get more nigiri sushi and rolls from other place with the same quality fish.", "author": "Emily L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-17", "description": "I honestly think this is some of the best sushi in New York- creative rolls, excellent quality fish, great atmosphere, and reasonable. Reading this to check for spelling errors makes me wonder why we are not going here every single night. Perhaps I will.", "author": "Tyler P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-14", "description": "i was excited to try out KI Sushi after reading the reviews.  i like this place, they has variety of foods, and sushi is good too. But, last week i try out koto sushi restaurant in henry st, they have very good A La Carte Sushi. The fish here is so fresh and every thing is fantastic. if you like sushi you should go to koto sushi to try, i think you will like it.", "author": "amy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-07", "description": "After living in San Francisco, it's taken awhile to find a really quality sushi place.  We tried some other sushi places, only to be disappointed (Blue Ribbon Sushi in Soho is WAY overrated), but Ki Sushi definitely hit the spot.  As for the price, Ki Sushi isn't really any  more expensive than other quality places in NY. I ordered the hamachi sashimi, salmon sushi and the Ki Roll. All were amazingly fresh despite the fact most of what we got was flown directly from Japan.  The Ki Roll definitely tops my list  as one of the best i've had, as far as rolls go. My husband got the supreme sashimi omakase and he loved every bite (the only thing he said was that he's used to a little more variety of fish in his omakase). Service was friendly and attentive. I'm still looking for a place here in NY that does fresh live uni (yet to find it at any, but would love to hear of a place if anyone knows of one).", "author": "Angie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-10", "description": "one of the more authentic and fresh sushi restaurants in nyc at a reasonable price.  consistant superb service.  great menu, relaxing atmosphere, good lighting, definitely worth traveling into brooklyn to check this place out...", "author": "Ruth K."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}