{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-17", "description": "No other place I have been to has service like Ki sushi does . They greeted us gave us hand wipes . The cucumber water was really refreshing . This is a late review I went in the summer . Long story short ; \n  \nPros : The place is nice , peaceful, welcoming . The people are nice the atmosphere is great \n\nCons : The sushi was not the best I've had . The price steep for 2 orders of sushi . The sushi rolls my date ordered kept falling apart it was a mess . Not the tastiest . \n\nMost likely won't go back .", "author": "Rae C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-08", "description": "So we were coming out of the movie theater on Court St, and lo and behold we were in the middle of a crazy summer storm that was blowing in.  The wind blew a fist full of Atlantic Ave grit into my face, and I suddenly felt like I was running from a tornado.  We had 2 options.... race to the F train and try to beat the storm home, or make like a bandit over to Ki Sushi and wait it out... guess what we chose.\n\nAnd man we were glad that we did!  A little pricey as far as sushi joints go in Brooklyn, but well worth it.  Some very creative rolls.  The Ki roll was well worth it... gold and caviar and all.  The fish was very fresh and at the end of the day, that's all you really want from a good sushi place.", "author": "Ajay R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-06", "description": "Fresh fish! Fresh fish! Fresh fish! \n\nNo, it's not newbies reporting to Shawshank prison, it's a declaration of top quality fare from Ki. I absolutely love the place and the staff. Thanks for proving Brooklyn can have great sushi without the Manhattan price.", "author": "Helen C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-09", "description": "Came here for New Year's Day hangover lunch and needed me some Miso soup fast. \n\nHad the 2 roll lunch special which came with soup and salad. Nothing extraordinary with the food but the fish was fresh. The spicy tuna had a nice crunch at the end. \n\nThe staff were attentive and polite. We were seated in a nook by the window but they never forgot us. Nice ambience although it was too \"clubby\" for lunch. Especially hangover lunch. It should be nice for dinner though.", "author": "Jon L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-19", "description": "Best sashimi and special rolls I ever taste!\nI ordered the fashion roll and with the fresh scallop on the top it was just divine. When they write fresh they really mean that! You can feel the freshness and all the best flavors of  the fish. Besides they have  good variety of fishes. They were out of monkfish liver, but we were late and we will come back to this place because we don't want to miss it again!\nThe Toro tartare was delicious, maybe too tiny...\nThe sea urchin, perfect!\nThe place is beautiful, cozy and clean, perfect for couples.\nI was about to rate 4 stars because of the service. The waitress was not very helpful and smiling but generally the staff knows how to treat their customers.", "author": "Karine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "Love this place. Very nice staff. Sushi is top notch and always fresh! My favorite are the Ki roll and spivey girl roll. Maguro avocado salad is also really yummy! Their sashimi and sushi is also great! It's gets very busy so deft recommend making a reservation!", "author": "leona k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-27", "description": "A and I ordered 6 maki - it was way too much food.\n\nWe ordered the following:\n\nSalmon Skin maki - decent, but standard.\nYellowtail with Jalapeno maki - good\nFantastic Roll crunch spicy tuna \u0026 avocado inside, topped with salmon, yellowtail \u0026 jalapeno tobiko - this wasn't as good as I imagined it would be, but still good.\nTNT Lover chopped blue fin toro, caviar, tempura flakes, scallion and asparagus, topped with tuna, served with truffle soy sauce - we missed the truffle soy sauce, so A and I first thought it was a bit bland, but this was really good with the truffle soy sauce.\nSpider Maki - miss eating this stuff\nEel and Cucumber Maki - good \n\nWe ordered too much - definitely only needed 4 rolls.", "author": "Ro R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "Thank God Somebody introduced me to this place!!! First of all atmosphere is great. I usually get a bento box. The tofu is always cooked. Sushi Is soo yummy too!!! When You take youre stuff to go they organize it soo great. At times I wish I can sit there for hours because ambiance is comfortable. If you want to go on a date definetly try this place.", "author": "Sehr Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-17", "description": "This was just average.  \n\nWe had one fancy sushi-roll and that was the best thing.  The avocado melted beautifully.\n\nThe deep frying oil was not quite fresh, and the hot sake was vile - tho they slightly grudgingly changed it for a (much more expensive) cold sake, and only charged for the more expensive one.  The simple nigiri platter was passable.\n\nIf we're in the area and want some wildly inauthentic sushi rolls, then might give it another try.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-07", "description": "I came here because I'm finally in Brooklyn (\u0026 not Williamsburg) while craving sushi so I figured might as well try a place with great reviews. We got in at 7:30 on a Friday night and waited about 30 minutes for a party of 3. You can leave your number with them so they call you when there's a table that opens up. I ordered the Ki Roll... there's plenty of pictures posted of it and yes it is delicious. My friends ordered the ice cream tempura and spicy girl (grill?) roll. \n\nThe rolls here are huggeee. They're about 1/3 bigger than the usual rolls and the price reflects that. Although the rolls are bigger, I don't think it justifies the premium of their sushi. My friend ended up paying about $32 for 2 rolls at this place... you can eat AYCE pretty good sushi for less than that.\n\nOverall food, ambience, and service were good but the price dampens my enthusiasm for this place significantly.", "author": "Ruby C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-09", "description": "Came for the sushi, stayed for the sushi. Ki offers some of the highest quality sushi you can get in the city; the price is reasonable as well. I've shared the Omakase for 2 for under $60. It featured toro, uni, scallop, and other quality fish. The miso soup was delicious as well. Definitely one of my main go-to Omakase joints.", "author": "Mark F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "My favorite sushi spot in the cobble hill area and among the top in NYC. \n\nTheir Omakase for $30 is a steal as are their lunch specials. They fly their fish in from Japan and it is consistently fresh. \n\nAlways have had good service \u0026 their sushi chefs are friendly. Never had a problem with delivery either. \n\nThe space is simple and cozy with a touch of high end decor that makes it a perfect ambiance for a casual or more special meal.\n\nHighly recommend Ki Sushi!", "author": "Jade D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-20", "description": "We have visited Ki since it opened many years ago and the food quality and flavor consistency has remained high  - we sat at the bar last night and the owner was working away doing what he loves and watching his staff like a hawk - he worked in another Sushi restaurant on Court for many years so he paid his dues before he opened his own place on Smith.\nGreat service as others have commented - we were in and out in 45 mins (no dessert).\nA real deal neighborhood staple. \nSpecial shout out for the Volcano roll 'twas crunchy and delish.", "author": "Jp M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "PROS:\n* High-quality sushi\n* Large selection\n* Great lunch specials\n* Hands-down best atmosphere in all of Brooklyn\n\nCONS:\nThey don't deliver to Carroll Gardens.", "author": "Sandra G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "Very good sushi and service. Went here for valentines 2015 and ordered Omakase. Great selection of fresh fish, in particular their white tuna. It was my first time trying eel sushi and since then I haven't tasted any quiet as good.", "author": "Joe M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-22", "description": "Had dinner here last night with a group of five. Enjoyed TNT truffle, Ki roll, Dragonfly roll, spicy girl roll. Fantastic quality, delicious.", "author": "anne g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Came in on a Sunday night...Great service, rolls, and atmosphere. Short wine list. We will be back!!", "author": "Jacque B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "The best sushi I've found in Brooklyn so far!!! The service was great and the food was even better. I can't wait till I go back again", "author": "Jenna W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Definitely the best sushi in the area. I would eat here every night if I could. Yum!", "author": "Chloe B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-07", "description": "I'm astonished by the \"low\" Yelp rating...  Yes, by the 4 stars it's getting, I consider that low.  The reason being is that this place is too good for 4 stars.  this is the best bang for the buck as far as sushi places go.  No you're not going to get some top quality stuff from a $15 roll or $8 sushi.\n\nThis is why this place is great:\n\nBEST value.  It's almost priced like those crappy fusion roll places, but 10x the quality.\n\nFresh fresh fresh!  They claim the fish is shipped overnight from Japan's fish market.\n\nKi roll -- http://www.yelp.com/biz_photos/tT6teP3ZfCAfvdPdDoqG4A?select=TlmqT4J6sh1HmqWSE1jhpA\n\nDelicious and just $14!  So fresh so sweet so tasty.\n\nLobster tuna roll with wasabi cream --- http://www.yelp.com/biz_photos/tT6teP3ZfCAfvdPdDoqG4A?select=kf_Z38PcXlxvh5k1wYyLAA\n\nAmazingly sweet.  The wasabi cream is wonderful.  It has a nutty flavor that's so perfect with the lobster.  they tried to take my friend's plate away but he insisted on holding onto it for the wasabi cream so he can dip his other stuff in it.\n\nChirashi bowl -- http://www.yelp.com/biz_photos/tT6teP3ZfCAfvdPdDoqG4A?select=HRWvqQL00gITcpnHxLEuZQ\n\nLunch special for $14.  Comes with miso soup and salad.  Seriously, this much fresh sashimi for $14???  Amazing.\n\nI wish I lived nearby so i could come here everyday...", "author": "Darren T."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}