{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-24", "description": "I am definitely hard to please when it comes to sushi. Well, not that I am a hard ass about it, but I do know what quality is, and I don't like to waste time with sushi that isn't.\n\nBefore anything else I have to say that the staff here is probably the most friendly you could encounter. The fish was nice, as were the portions. I ordered a lot of stuff ala carte and was happy. Won't go down as the best ever and the fish selection doesn't bring anything really unusual or unique, but who cares. It's good enough to return to. The decor is really nice and there is a positive energy that just seeps out of the walls. \n\nGood spot.", "author": "John S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-15", "description": "Strolled into this restaurant while walking around. It was a bit late for lunch and definitely too early for dinner. But they were open and had a few patrons already there... looked like a late lunch crowd.\n\nI had the standard Chicken Katsu fare and it was fine and tasty. The decor was clean and comfortable with pillows against a bench on the side. Service was attentive. I'd go back if I was strolling around the neighborhood again.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-17", "description": "This is my favorite Sushi place. The hands down best roll is the signature Ki Roll (tuna, salmon, yellowtail, crunch king crab and avocado) Another notable roll is the fantastic roll. For an appetizer get the rock shrimp definitely. Did not like the scallop appetizer or the roll that has scallops in it (but normally I like scallops) Love the salad with the ginger dressing and the gyoza. The staff is friendly, especially if you come in a lot.", "author": "Karen D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-11", "description": "Went here for anniversary dinner, it was great. The service was good - not too overwhelming but always available. We sat at the sushi bar and the chefs were very nice. The place was clean and the meal was delicious! The prices were good for the quality level. I would recommend Ki sushi as a solid eat-in sushi place.", "author": "Grazina S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-12", "description": "Unfortunately, we may be slightly biased because we DID walk in a little late, but that does not excuse the low level of quality in both service and food.  We liked the restaurant's decor, but not the arrangement of the tables.  Although we were some of the only people there, it seemed like the place would be much too crowded on a busy night.  The menu was extensive, with lots of different types of fish to choose from.  However, the sushi did not taste fresh, and the service bordered on rude.  We should probably try it again sometime, considering the other reviews, but it will be after we've tried every other sushi restaurant in NYC.", "author": "Erin and Maurice M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-29", "description": "The food is well-crafted and you can tell true sushi aficionados were TOTALLY down.  I enjoyed sitting and watching the food be prepared.  I had a volcano roll and it was something I could tolerate since I'm not a real sushi person as a whole.  I went to please someone else, and she was all over it.  The place is very cool aesthetically and the service was good.  It's pretty hip and the crowd was quite diverse.  I'd go again if someone else really HAD to go, and like I said, a TRUE sushi lover would be in heaven here.", "author": "Jonah F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-17", "description": "We ordered from here last night after vetting it thoroughly and concluding that this was the consensus \"Best Sushi Around.\"  Our experience was, in a word, ghastly.  While I'm sure we would've been better off dining at the restaurant, I think that's a poor excuse behind which to hide, as, if you're offering delivery, you should be endeavoring your darnedest to create the same tastes as if someone were seated at the sushi bar at 122 Smith Street. Delivery (at 5:30pm!) took over an hour and the fish was disgusting on both a textural (chewy) and flavor (old, dragged-across-the-dock fishiness) level...and that included the chef's special omakase, which should've been nothing less than sublime.  I believe that other reviewers have enjoyed this place, but we can't \"hope\" that it'll be good.  Sushi can't waver in quality. It needs to be excellent, every night and in every medium, for it to be worth the price and the risk. Sadly, Ki Sushi was not worth either.", "author": "Jay R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-10", "description": "Zero stars if that is possible. Don't believe the hype and cannot understand how this place has any good reviews, let alone several!! Went for an early dinner today around 5:30 and had disgusting, rubbery sushi deluxe. The rice was hard, old and tasteless and the fish was comically un-fresh. After several trips to the bathroom we can confirm that this place is NOT. GOOD. Avoid at all costs.", "author": "S A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-09", "description": "deserving of 3.5 stars....great apps and fresh fish.  Would def recommend going back!", "author": "Ricky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-06", "description": "I've always been skeptical of non-Japanese sushi bars, but this place is fantastic. Great service and food. Innovative dishes that aren't that fusion bullshit. Highly recommend this place, and it's Michelin rated too. Be sure and get the Ki Roll.", "author": "Hank M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-25", "description": "DEFINITELY the freshest fish I've had in Bklyn, by far. Taro Sushi, eat your heart out, you suck. For dinner, I was going to hit Nicky's for some Banh mi close by, but on our way out of the Yelp Elite Event @ Deity, Lady Jane suggested that we go to Ki Sushi around the way. After checking in on my iPhone, I come to find out that she and Peter had gone there earlier for dinner before the Yelp Event. Jane suggested that we have to get the Ki Roll, which is raved about here, but I thought there was too much going on with that roll. The contrarian that I am, I had to go against the grain, naturally. There was roughly a 10min wait for 2 on a Friday night. The genmai tea tastes watered down but is hot. Service is average. The staff looks predominantly Chinese. For 2 bucks a piece, how can you really go wrong? Qualitywise, this definitely beats Takahachi for the money. You guys were spot on with the ratings, but more a 4 than a 5 IM humble O. \n\nOrdered:\n-Ki Sashimi Omakase ($34 x 2) - not to be mistaken w/ the Super Omakase, which has yet more exquisite ingredients, for 2ppl, you get 4pcs of hamachi, kanpachi, shima aji, ama ebi (6), hotate, blue fin tuna, salmon (CRACK!), sea bream, my fave of which was def the salmon although it def tasted farm-raised, silver goes to the blue fin, hamachi gets the bronze \n-Fashion Roll ($12) [spicy lobster, yellowtail jalapeno topped with yuzu tobiko \u0026 fresh scallop] - very fresh, expected futo maki sized roll, instead got cali roll size, two pcs side by side, you get 8 total, a tad expensive but the freshness makes up for it, one of the freshest rolls I've ever had!\n\nTotal came out to $50/pp after everything", "author": "Jeff C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-19", "description": "Simply the best sushi restaurant in all of NYC!!! I've been to a lot of sushi places but this is by far the best one I go there at least twice a month, usually get Ki Roll and TNT lover the fish is almost always fresh and tasty. The warm mushroom salad is really special.", "author": "Anna S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-21", "description": "I knew I shouldn't have stayed the minute I walked in and looked at the menu, but decided to give it a shot anyway since how can you go wrong with 4.5 stars on Yelp and a \"Best Sushi\" rating from L Magazine, right?   (If you're a foodie, you would have picked up on the hint of sarcasm implied in the previous statement.)  The truth is, I was in a hurry, craving sushi, and needed to have dinner with friends in this particular neighborhood since it was a convenient spot for all of us to meet before a concert.\n\nOverall: \nInauthentic sushi restaurant run by Chinese sushi chefs and Chinese waiters.   How can you tell whether a sushi restaurant is authentic?  Look at the type of wasabi used, the type of tea served, and whether there are Japanese people in the dining room.  Their wasabi and tea were mediocre, and I was the only Asian person in the dining room (I'm Chinese).  I'm not a sushi purist; I'm all for creative funky rolls and fusion Japanese food as long as it's done right, but this place is neither.  Stay away unless you're content with below average take-out quality sushi at ~$7/roll.  The grade of fish they used was extremely poor.  The spicy tuna tasted rotten, this is a roll that is really hard to screw up unless you use really really bad fish... I wonder how many days old the tuna was.  Minor complaint:  Sashimi was sliced too thick.  Although this doesn't really matter in Ki's case, bad fish is just bad fish, no matter how you dice it.\n\nMenu:\nIn English only.  Ok, they half-heartedly put some romaji next to the fish names, but the variety of appetizers and sushi served screams \"delivery sushi for undiscerning gaijins\".\n\nQuality of sushi/grade of fish used:  \nC-.  Barely passable for delivery sushi.  \n\nPrice:  \nExtremely overpriced for the lackluster product delivered.  Sushi/Sashimi Combo for $27, Chirashi for $21, Spicy Maki Combo for $18.\n\nPricing Structure:  \nDesigned to profit from people who don't know anything about sushi.  Case in point:  Chicken Teriyaki $15, Shrimp Tempura $16, Spicy Tuna Roll $7.  It's absurd to price Spicy Tuna Roll at $7 and Negihama at $5, since spicy rolls traditionally cost less to make than regular  rolls.  i.e. Sushi chefs can use odds and ends or fish from the day before to create spicy tuna rolls since the spiciness masks the fact that the fish is not as fresh.\n\nWhat we ordered:\nScallop Sashimi Special ($12 for 4 pieces):  C\nSalmon Sashimi:  C+\nSpanish Mackerel Sushi:  C-\nUni Sushi:  F\nUnagi Sushi:  C-.  Overly glazed.\nNegihama  Roll:  C+\nSpicy Tuna Roll:  D-\nShrimp Tempura Roll:  C\nChicken Teriyaki (ordered by a friend who doesn't eat sushi and was dragged there):  C-.  Overly glazed mess.\n\nDécor:  \nC+.  Clean but lacking in character.\n\nDon't let the décor/reviews fool you, this is just a dressed up delivery joint.  \n\n(Props to Ki's business/marketing manager for being such an astute businessman.  Your margin structure is ingenious!  And good job on finding a clientele willing to overpay for delivery-grade sushi, yelp about it, then come back again.)\n\n__________________________________\n\nMy rating system:\nA/B = not worth mentioning since nothing scored in this range for Ki\nC = delivery quality if you live in a neighborhood with no viable sushi restaurants  (think Battery Park/Financial District)\nD = not quite sushi grade, but edible if you're homeless, starving, and haven't eaten in weeks\nF = questionable whether the fish is sushi grade at all, chance of food poisoning\n\nTo give you an idea of the type of sushi restaurants I like.  Here are my recommendations for: \nA big splurge:  I can't quite afford this yet\nA mini splurge:  Sushi Yasuda, Sushi Azabu\nSushi at a non sushi restaurant:  En Japanese Brasserie, Matsugen\nCasual dinner:  Kanoyama\nWhen I'm poor, but don't want to settle for supermarket sushi:  Yama\nSupermarket sushi:  Make my own using salmon/hamachi purchased from Sunrise Mart\nLow-key, in Brooklyn:  Bozu\n\nFor great Japanese food (whether it be traditional, fusion, or creative) on a budget that is not sushi, try Sobaya, Ippudo Ramen, Momofuku Noodle, Taisho.", "author": "Coconuts B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-06", "description": "I have heard many good reviews of this place so I can't say it completely met my expectations, but the service and atmosphere are the best of any brooklyn sushi joint I've enjoyed. When I ordered the plum wine and found it waay too sweet for my liking, they switched my order with no problem and there was never a push to get out of here even though they were plenty full of patrons.  The peach roll and garlic broccoli app were my favorite!", "author": "Brooke S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-04", "description": "Caveat: this is coming from a complete sushi rube.\nSorry, yelp hypetrain: I don't see the big whoop. Cheap, I guess. Nice decor, I guess.\n\nThe deluxe sushi dish had 9 sushi on it, and 2 of them (the tuna) were inedible (indescribable funky flavor)  and 4 of them were blah whitefish. \nI will say the miso soup was more interesting than most I've had, but for my next sushi excursion I'll be going elsewhere.", "author": "caitlin o."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-10", "description": "OMG Im sooooooooo impressed.. great sushi.. really fresh.. had the chicken teriyaki but it was good .. not as good as the sushi.. the spicy tuna and the special rolls are great! and def nice romantic setting inside", "author": "Dima L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-15", "description": "We went twice to Ki for dinner.  The first time it was okay but not stellar, American style with a focus on \"inventive\" rolls rather than nigiri.  Pretty much as expected for a Japanese place run by non-Japanese people.\n\nThe second time was a disaster.  We went back for a no frills dinner thinking it would be an easy table to score.  The hostess made a show of taking our phone number and told us the wait would be 20 minutes.  She told us we could have a drink elsewhere and that she would call when our table was ready.\n\nWe waited respectfully for a very, very long time.  60 minutes later we had not received a phone call.  We returned to the restaurant to check in, only to find that our name had been crossed off the list.  The hostess then promised that we would get the next available table in no more than 5 minutes.  She pointed out exactly which table it was.  After that table was cleared a seated party scooped our table, and the hostess watched mutely.  This is not acceptable, especially after 1 hour 10 minutes' wait.  Yet the hostess asked us to wait again.\n\nWe ultimately gave up because the staff made no effort to make this right. I would have happily endured this experience for exceptional food.  But in this case, the restaurant staff's behavior is inexcusable considering that the food is only so-so.\n\nBottom line: never entrust your evening to people who don't care.", "author": "K L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-17", "description": "True to my coworker's promises, Ki serves up some of the best neighborhood joint sushi I've ever had, for just a little bit more than you'd normally pay.  Super fresh fish.  HUGE salad that even includes mesclun greens (and not just that iceberg lettuce stuff).  The miso soup had (gasp!) mushrooms.  And, no skipping on the pickled ginger.  Even the place is pretty and totally makes me feel like I owe myself a proper sit-down lunch instead of rushed takeout.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-17", "description": "Went there this evening, after doing a google search for \"good sushi brooklyn\" and finding the review on yelp here....\n\nI was not dissapointed.  This was on a Wednesday night in September, so definetly not a busy night... the couple of other sushi places I drove by (including Taro) looked deserted.... Ki was doing a good business...\n\nI was greeted by a great staff that made me feel comfortable \u0026 welcome, I'm from PA, here in Brooklyn on business, and by myself.  I sat at the sushi bar.  I ordered a seaweed salad to start, some tea (sorry, just not into sake on a Wednesday by myself) and I ordered two rolls, the \"Fancy Roll\" and the \"TNT Roll\".  \n\nYea, it may not have been super adventerous, but the rolls did have eel \u0026 sea urchin... I will definetly go back \u0026 try omakase, but didn't feel quite adventerous enough.. plus I didn't read all the reviews beforehand, as I looked it up on my phone.  \n\nThe rolls were LARGE by the standards I'm used to \"back home\".  The seaweed salad + 2 rolls left me STUFFED, and I'm not a small person (not huge either).  The TNT roll was definetley the better of the two rolls... it felt like I was eating huge pieces of prime beef... really just a flavor explosion.  \n\nGreat decor, nice ambiance, great service, clean, excellent food, NICE neighborhood... I found a parking spot down the street really easily, got seated immediately... overall and excellent experience \u0026 I plan to go back if I am in Brooklyn again on business.", "author": "Mel W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-26", "description": "One of the best sushi places in NYC. I've eaten there or had it delivered probably 50 times in the last few years.  I used to only get the Ki choice but now I tend to just get the sushi deluxe because it's a better value.  I generally don't get rolls so of that is your thing I can't really provide much insight other than they look great. In general I would say that ki's sushi pieces are larger than most other sushi places that are more expensive. I've been to places like blue ribbon and nobu and thought that Ki was just as fresh and tasty but a much better value.", "author": "Dave K."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}