{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-08", "description": "This is defintiely my favorite (within reasonable price range) sushi joint in all of NYC. We've been here several times and always love everything. Had the omakase here and the toro was like BUTTER -- melts in your mouth. And we always always order the Ki roll -- it's incredible.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-05", "description": "I cross my heart and promise to speak the truth! This place really  deserves 2 1/2 - 3 stars at most!  -- What does 3 stars really mean??  It means that I'd go here only if I was in the area and starving for japanese food.\n\nMy experience-  The Omakase was a sushi deluxe(tuna, salmon, yellow tail, white fish)  Okay omakase means \"it's up to you\" meaning it is up to the chef to serve you the freshest dishes and in this case fishes, but for some reason I think they serve the same boring fishes everytime an omakase is ordered. hurmm....  \n\nThe rolls -- We ordered 4  rolls that looked great I give them 3 1/2 stars for presentation. Each piece toppled over with different kinds of fishs, roe, gold flakes, life savers, you name it, it was on it....all for a wow factor when placed on your table --  the taste was 1 star.  They used too many mashed fishes in one roll, the fish did not compliment the rice and the rice was too soggy for roll making.  arg...\n\nThe Sake menu --- Very small sake menu, and  poor quality selection.   They do not serve by bottle, they pour their cheap sake in a pastic Pier 1 green bamboo container @ $27 - $29 a pop.  Seriously over priced for crap sake, please refrain from ordering.\n\nThe Value- I came here thinking that the bill would be cheap but it was $520 for 4 people.  We should have went to Ushiwakamaru instead! :(", "author": "Jan Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-21", "description": "The most QUALITY sushi place in the area. Their wasabi is not made from powder. It's so good. The best-looking sushi place too. Restaurant is nice, modern and very clean. I wish there were more locations throughout Brooklyn!", "author": "Haj da P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-11", "description": "Amazing service - from the warm washcloth to constant tea top offs.", "author": "David A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-16", "description": "Bar none, best spicy tuna roll I've had yet.\nGreat atmosphere. They have flowing water, dim lighting, simple elegance. Mix of brick and stained wood. Friendly service. Attention to details. Great!\nLunch special: $10 for two rolls (select rolls), miso soup and salad. Worth the money.", "author": "Jeremy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-03", "description": "Wow!  I've walked by here a hundred times but never when I was in the mood for sushi.  The service was superb, from the hot towel when I sat down to the friendly staff.   The sushi was fresh, tasty and very reasonably priced.", "author": "Richard S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-19", "description": "Pretty good bento boxes, no better or worse than Osaka or Kyoto.\n\nBUT - they just put the prices up! $11 for a bento and $14 for a roll.  Are you kidding me, $14 for the same roll that was $11 a few weeks ago?\n\nSorry, last time I order lunch.", "author": "A Brit In Brookly N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-30", "description": "I ordered delivery here the other day with my roommie and we were both very satisfied! Large selection. Fresh sashimi - melts in your mouth good! Relatively reasonable prices for sushi. \n\nWe ordered miso soup, eel and avocado roll, spicy tuna roll, salmon sashimi, and mackerel sashimi. The spicy tuna roll is the only thing I thought was ok. Everything else was really good and FRESH FRESH FRESH. \n\nI would definitely go back.", "author": "Elaine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-28", "description": "Came here for lunch and dinner many times. it has won my favor sushi place in Brooklyn. I generally get the chef special to get the full authentic experience and never thus far I had been disappointed. I would come again and in fact, I brought many friends to this place. They all seem to like it. The only thing that I don't like is the low dim light .", "author": "Jia Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-23", "description": "Lots of options and everything is delicious! The ambience is lovely, dimly lit with a low noise level, it's a great place for a date or lunch with a friend. Staff is really nice and helpful. I hardly ever write reviews but had to for Ki Sushi because it is always such a great dining experience whenever I'm there.", "author": "Tacie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-23", "description": "Best Sushi I've had in NYC....definitely my spot hands down...Ki Roll is F'in delicious...great staff ambiance is kool CLEAN CLEAN CLEAN ....I dragged my Buddy VERONICA C. at gunpoint lol and she is also hooked", "author": "Sand S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-19", "description": "I love this place!! This is not your regular sushi spot.  Come dressed as you like and you will still get first class sushi.  Ki offers the most appetizer and roll options containing Toro.  Their sushi is always fresh as well.   Definitely try the jalapeño yellowtail and the TNT Truffle appetizers and any roll containing Toro.  Can you tell I like Toro?", "author": "Tina J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-02", "description": "Some of the best sushi I've had. Nice atmosphere and the sushi is worth the price. It's fresh, good quality, and they don't try to fill you up by putting a thick layer of rice on their rolls. I had Plum Wine with miso soup, Ki roll, TNT roll, and finished with green tea ice cream. I will def come back to try some of the other menu items.", "author": "Aisha D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-20", "description": "Super awkward walking in here at lunch, expecting a casual place. Ki is anything but. Dark, with a thoughtfully-lit interior (the main lights are on the sushi chefs), it is stark, simple, and beautiful. The music is on the louder side, better for dinner/after dinner drinks.\n\nI loved my sushi here. This is by far  the best I've had in the area- better than Hibino and way better than the other sushi places on Smith. The sushi is slightly pricier than your average - say $7 bucks for a spicy tuna roll - but you get what you pay for, in the best way possible. The rolls are much bigger than most I've had in other places, and they are SO FRESH. Uber fresh. I loved the salmon, I loved the tuna. They were perfectly prepared and just wonderful.\n\nThe SO got chicken teryaki - he still is hesstant with sushi. Happily, he enjoyed his dish a lot as well.\n\nAlso, as a side note - the free tea here is pretty good, comparatively.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-08", "description": "Dee-licious!!! Try the green tea tempura ice cream", "author": "William S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-10", "description": "This place is amazing!\n\nThe lunch special is an amazing deal - lots of food, good value and pleasant experience. The sushi is some of the best that I've had in NYC and you can't go too wrong with whatever you pick. If you opt for the lunch box, the tempura is prepared just the way it ought to be - served hot, right out of the fryer. With the lunch boxes, you get miso soup, salad, and then a box with a california roll, your selection of meal (e.g. tempura, teriyake), two vegetable dumplings, and rice - for just $10. It seems too good to be true.\n\nService is good and the staff isn't up in your face while you're eating.\n\nThe environment is dark and lit in a way that the place is warm and relaxing. It's a good place for a midday lunch break or an evening date spot. I can't wait to get back there!", "author": "Julia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-24", "description": "Best rolls I have ever had! We had 4/5 rolls and they were all divine! Very fresh, beautifully prepared. Service was great, ambiance is classy. A little spendy, but so worth it!", "author": "Chantelle E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-05", "description": "I had the Omakase.  As far as traditional sushi goes it was pretty darned good.  The fish was fresh and cut properly, not too thick, not too thin, and the right angle of cut.  The vinegar in the rice was a tad overpowering, which too away from the flavor of the fish.  They did get the consistency tight which places them in the upper echelon of sushi restaurants.  Best I've ever had? Nope, but I'd go back again.\n\nThe decor is really classy, the lighting is nice without being overly bright and the staff is very attentive and friendly.\n\nI'll definitely have to explore the menu further next time.", "author": "Tosh K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-23", "description": "Grabbing a quick take out meal at the highly rated Ki Sushi was difficult only because the restaurant and staff were so inviting. Despite every inclination to sit and stay awhile, our time was short and they managed to get our sushi order out in less than 10 minutes. \n\nOur meal:\n\n- The seaweed salad was huge - definitely more than a single person could finish. Perfectly delicious though. \n\n- Yelpers are correct, the Ki Roll was wonderful. Tuna, shrimp, and salmon mashed together and topped with black and red caviar and a light stripe of gold flakes. Tasty and beautiful.\n\n- The tempura roll was huge. Two shrimp tempuras cut into each piece. Awesome, but though I'd be better off just ordering tempura straight away.\n\n- Gyoza - perfect mix of crispy and savory. \n\nI'll gold off on the last star until I have a chance to dine at the restaurant itself but for now, I can easily admit I'm a fan!", "author": "Jane K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-23", "description": "Excellent sushi and food.\n\nAfter eating sushi all over the city I can attest that Ki is better than most.  The fish is fresh and the portions are very good-the sushi is full of fish-not full of rice.\n\nIn addition-some of their food is good too.  I always get the garlic broccoli which is a nice healthy start and super flavorful.  The standard edamame and seaweed salad is done as good as it can be. \n\nPortions are good-prices are fair, service is prompt and professional.  The lunch prices are fantastic-two rolls, soup \u0026 salad for about $10.  This is my go-to spot when I'm in Brooklyn.", "author": "Alex R."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}