{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-08", "description": "Highly reviewed and for good reason. I went in on a Wed at around 8 and it was pretty quiet. The sushi bar was full and about 1/4 of the tables were filled. I ordered Spanish mack, hamachi, amberjack, uni, butter fish and tuna. The uni was from Cali and was ridiculously fresh. As for the Sawara and the Uni...I ended up re ordering and doubling up it was that good. Overall , all the sushi was incredibly fresh! The mackerel melted in my mouth and the uni was sweet , creamy and firm. Again, all the way around, super solid , fresh, delicious. As for the service, nothing but good things to say. Busers were attentive and you never had to think twice about having your water run dry or a plate being swept away. The waitress was very good as well, and last but not least the sushi chefs churned out the order in light speed. Cant say enough about this place. No doubt best in Brooklyn and certainly fish to fish will rival any Manhattan dealeo. \n\nIll go back again and again....Delish-ous!", "author": "Steve R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-06", "description": "Delicious food! nice ambiance. Have the tempura ice cream dessert.", "author": "Shannon H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-12", "description": "Started out with a Sapporo and seared duck breast with herb spring roll and fig glaze.  The duck was perfectly cooked served on top of a nice sauce.  The herb spring roll and mushroom was a nice touch.\n\nContinued with the shipped directly from Tokyo Supreme Omakase.  I don't remember exactly what each type of nigiri I was served.  All of it was good.  Each velvety piece had just the right amount of wasabi.  The slices of fish were quite big.  Toro, arctic char, and unagi were the items that I remember the server telling me about.\n\nThe servers were very attentive and helpful.  Would like to come again.  Might even consider take out if I can't stay.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-05", "description": "The best sushi in Brooklyn, period.\n\nI'd give it 5 stars, but:\n\n\nKi is inexcusably loud.  You cannot have a normal conversation with the person across the table.  Plus there's music.  The place is essentially a big brick box which amplifies and reverberates all sound.  I shouldn't be able to hear conversations from the other end of the room clearly.\n\nAnd that's why I don't go more often.  I've mentioned it to the owner, but since the restaurant is doing so well I don't think he cares.  $1000 in tasteful acoustic treatment would change the dining experience completely.", "author": "Scott R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-01", "description": "One of my favorite spots to grab \"non-traditional\" rolls. Its right around the corner from my apartment, and despite eating in or taking out at least once/week, I have never been disappointed.", "author": "Seth L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-13", "description": "Stupid good.  This place used to be one of my little secrets, but now the cat's out of the bag.  The head chef gets ridiculously good-quality fish, even for the pieces you don't expect (their hamachi is like eating freshly churned butter).  Big, fatty, and well-priced pieces of toro that the chef tells me he has flash-frozen in a special process from fish in the Tokyo fish market in the two weeks of the year that he considers the fish's peak.  Tastes better than half-sized pieces that cost 3x in some of the midtown sushi temples.  And rich rolls that will reset your expectations for NY sushi.  Makes me miss San Francisco.", "author": "Carter P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-18", "description": "good quality sushi and great take-out option.  i cannot favor this place over my beloved yama, but very good nevertheless.  i live very close so this is always my go to sushi spot when i want quality fish for a decent price.\nyumbo!", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-20", "description": "Went here on a Saturday night. Was packed but comfortable. Sushi was extremely fresh. Rock shrimp  tempura app was great, as was the Lobster Tuna Roll. The entre rolls were very good - Volcano Roll, Fantastic Roll, the American Dream and the Fashion Roll. We also had desert which - fried green tea ice cream, creme brulee and banana something or the other. They were just ok. Service was also just ok. Sushi is great here though.", "author": "Bjorn P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-20", "description": "This place is not worth the hype. Just another \"sushi\" place that makes outrageous rolls. The fish wasn't very fresh and the food was mediocre. Not an authentic japanese sushi place.  Will not be returning again.  I would much rather spend the money and go to an authentic sushi place like Yasuda in the city.  Can't be compared.", "author": "Yukie P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-16", "description": "So I was really excited to try out Ki Sushi after reading the reviews here, but I was a bit disappointed by the size and quality of the food.\n\nSupreme Omakase - promised me fresh sashimi flown in from Tokyo - 12 slices in the dish, it had 6 different types of sashimi - but it was basic: Salmon, Blue Fin Toro, Yellowtail, etc... it was not worth the $35 dollars.\n\nSteak - cut up into slices, it came cold - so enough said\n\nKi Sushi Roll - amazingly delicious\n\nLime \u0026 Ginger Creme Brulee - TINY !!! It is smaller than usual portions of dessert\n\nGarlic Scallops appetizer - two scallops on a bed of mango salsa.. i was expecting a bit more, so that came off disappointing.\n\nI mean - this place gets 3.5 stars, i think i was disappointed mostly by the size of the food.. I think I would have been happier if I just ordered rolls instead of the Omakase, and the steak was just plain disappointing.  Also - our food came out all at different times, so my bf who had the steak finished it before my Omakase even came out.", "author": "Diane L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-19", "description": "A great addition to Brooklyn.  Ki Sushi has a hip lounge-like feel to it.   Service was friendly, attentive, and perfectly timed.  \nThe rock shrimp tempura rocked.  The fish was really fresh, and good value for your money.  These were almost like huge Yama slices here, but with double the quality.  You also get alot of pieces in your roll.  When I saw a huge tray of food coming my way, I though I had overdone it....but the food is so delicious, go ahead and order more than what you need!  The sashimi and sushi was delicious and I loved all the rolls, with the exeption of the Ki roll with gold leaves (there was just too much going on and I couldn't appreciate the various flavors).\nGood sake list.  Put Ki Sushi high on your list of places to visit!", "author": "Jasmine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-29", "description": "I really like Ki Sushi -- gorgeous atmosphere, great service, and an all around great time.  I prefer Taro Sushi (http://www.yelp.com/biz/taro-sushi-brooklyn) when i'm in the mood for omikase or feeling adventurous to try some weird raw fisheees.  But when i'm looking for a hearty and fun meal with great special rolls, Ki is the place to go.\n\nTheir edamame is the best i've had in nyc -- perfectly salted and never overcooked.", "author": "Jonathan W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-07", "description": "The delivery service is awful.  It has been an hour and a half and my order still has not arrived.  When I called an hour in I was told my order was already sent out and it would be a few minutes.  When I called again 20 min later I was told it was sent out and they would call the delivery man to tell him to deliver my order first.  There was no apology and no attempt to rectify the situation.  The sushi is delicious but the customer service is awful.", "author": "Leah W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-10", "description": "Got the ki omakase. A nice variety of fish - all fresh. A little pricier than the avg Brooklyn sushi bar but well worth it. I don't usually eat cooked food as entrees at Japanese restos but the beef teriyaki was unique and nicely done. \n\nIf you love sushi, go sit at the bar at sushi yasuda. But at this price range, ki sushi is highly recommended.", "author": "Ack J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-03", "description": "perfect food and great service.  everything i tried in that restaurant has been great so far. the Ki sushi is the best", "author": "Sara D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-16", "description": "Great sushi, always fresh and delicious. Particularly enjoy the TNT and Fantastic rolls. The popcorn shrimp appetizer is pretty delish, too!  Delivery always prompt and friendly. It's our go-to neighborhood sushi place hands down.", "author": "Alia S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-07", "description": "The quality of the sushi is fairly good and colorful.  However, I have a real issue with the service.  It is ruthlessly efficient and distinctly unfriendly.  I sat at the sushi bar, and they were in such a rush to get me in and out as quickly as possible, so that they could seat other people,  that it was extremely unpleasant.  I had a full beer left when they slapped down the check and then tried to collect it a half minute later.  When I said I wasn't ready to leave, the waiter apologized.  A half minute later, another waiter tried to collect and received the same answer; no apology this time - he clearly did not care.  This place leaves the impression that they are out to milk you for as much money as possible as quickly as possible and that they couldn't care less about the feelings of their customers.  I ain't going back there.", "author": "Peter M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-31", "description": "Just divine. Perfect date spot. Perfect quiet serene ambiance. Perfect sushi. My date and I shared gyoza and four of Ki's specialty rolls. They're bigger than usual rolls -- arrived with about 8-10 pieces to a roll. So delicious!!! Each one was better than the one before. I've been here a few times, and it never fails to deliver. Best sushi in the area.", "author": "Nadine K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-31", "description": "Try the broccoli appetizer, YES, I know it is a sushi joint but TRUST me, it will change the way you think about the vegetable. Also, only order from the sushi section in the back where you can select the Tokyo Fish market selection. There is no other option or you might as well go eat pasta at another location. The -1 star is for a crappy experience I had on my birthday when our reservation was made to wait 30 min, given a bad table and were pushed out early to seat another table, come on, it was my birthday!!!!", "author": "Edward W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-02", "description": "im of the opinion that if this place was transplanted into manhattan, tripled their prices, and renamed \"morimoto's ki sushi!\". the place would be considered one of the top 5 sushi places in the country. i'm curious, who are all these people that dined at ki then walked away thinking \"meh i've had better. ill give them 3 stars.\" could you lot please direct me toward a better all around sushi spot? no really, message me.\n\non to the review.\n\nlike most other reviewers i feel ki sushi is top shelf. the exceptional craftsmanship of their sushi chefs is readily apparent in ever piece/roll they put out(i was a(n incompetent) sushi sous-chef a few years ago. i know all too well what things are \"supposed\" to look like). The fish they use are always fresh, and the flavor combinations that i've tried work well together. the decor and atmosphere inside the restaurant is sophisticated yet relaxed.\n\nmy favorite items are the warm mushroom salad, ki roll, sun dried tomato and avocado roll, fancy roll, and eel avocado roll.\n\nki sushi. i recommend this place.", "author": "Ricky R."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}