{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-03", "description": "You know what... 3 out of 5 stars is more than OK in my book.  This is not a bad review. I  had the Sushi Omakase. Sat at the sushi bar.   It all came out on one plate,  no complaints as I was kinda not feeling like one piece at a time.  It was of good value and the service was very attentive and welcoming.  No complaints. \nIn this neighborhood, delivery service was very busy, and I attribute that to a Rainy Monday night.\nI ordered a few individual pieces, all of the fish was good.\nMy only disappointment was that the Sushi Chef's did not season the rice with Wasabi under the fish.  I guess I am just used to that presentation and taste, I do wonder why they don't season the fish, but it could be the clientele or the target.  If they've been asked for years for more wasabi and soy sauce at the table, then they've adjusted to that. I really can't blame them. I just like it the old school way. \nregardless, I really enjoyed my meal at Ki Sushi, I would return, but It's not supplanting my  favorite places.  \nFor people who like Rolls , the menu seemed creative and interesting, just not my thing. \nOtherwise, the fish is great. I came, I ate", "author": "Matt C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "TNT all day!! Best appetizer of all time! Coming back for sure and not sharing with my date anymore!!!", "author": "Monty B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "One of the best. The rolls are delicious and created by experts. The traditional way to eat a simple roll  is without soy sauce because the rice already contains a little soy. Try it...you'll see that too much soy just ruins the flavor. This restaurant knows what they're doing and I'll continue to come back every time I'm in Brooklyn.", "author": "Hay J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-28", "description": "** 3.5 stars **\n\nMy standards for sushi, related to the quality of the rice, the fish/topping, the preparation, flavors, size, temperature, and the like, has essentially limited my sushi eating to only those places that take the art of sushi making very seriously.\n\nSo why was I having an unlikely lunch at Ki Sushi?  A bit of curiosity, perhaps, at a sushi place consistently considered one of the best places in Brooklyn, even if that moniker does not mean comparability to the best of Manhattan.  More specifically, to please my sushi-seeking sibling who can't be bothered with my highfalutin talk of standards and is perfectly happy with her local Chinese-run sushi place offering half-price spicy tuna rolls all the time.\n\nKi Sushi is attractive, a brick and stone paved space with dark wood furniture.  The lighting, just a bit dim for lunch, lends to a warm, sophisticated ambience.  Seats are comfortable with room between tables.  The sushi bar sits near the end, lined with a row of seats.  The staff are responsive and courteous.\n\nAn assortment of lunch specials includes sushi, special rolls, and bento boxes.  The full menu abounds with random Japanese classics (gyoza, yakitori, agedashi tofu, miso soup), dishes with non-Japanese touches (truffles, lobster, gold leaf, fig glaze, pine nuts),  and a long list of special rolls that looks like most typical Americanized sushi restaurant lists, but more polished with consistently better ingredients.  Many salads, soups, appetizers, and entrees, in addition to choosing from sushi and sashimi.\n\nWhen in doubt about the sushi skills of a restaurant, my go-to dish is chirashizushi, where \"chirashi\" literally means \"scattered,\" a bowl of vinegared sushi rice topped with fresh fish and just about anything else.  As a way to judge both fish and rice without the sushi commitment, its a good way to go.  Ki Sushi's chirashi was beautifully presented and topped with good, very fresh fish; nothing fancy, just the common maguro, hamachi, sake, mackeral, tamago, and a bit of oshinko.  With pickled ginger and wasabi, it can be mixed all together before eating, or not as you like.  The rice was decent, with a hint of vinegar.\n\nTheir special rolls are also well presented, and better in every way from the low-end cheap sushi places, expected as the quality of their ingredients is a good step up.  I prefer simplicity over theatrics, so I tried one piece for the record but will prefer a classic negi fish roll from a top tier place anytime.\n\nKi Sushi is an excellent mid-tier sushi place, and one of the best sushi places in Brooklyn.  It is not for those seeking rigorous technique and attention to tradition, nor for those who only want the very best (head to Manhattan, there's plenty to choose from there).  It is not cheap sushi, and is priced accordingly, but there's good quality fish to be had in a lovely setting with good service, without long lines to get in.", "author": "Valery C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-28", "description": "Ki is hands down my favorite Japanese/Sushi restaurant in Brooklyn and possibly Manhattan. Their service is always impeccable, fish is consistently fresh and my dining experience is always on point. \n\nI've been to Ki 10 times or so over the past year and I've never had a bad experience. If you're looking for a great meal with an explorative menu, I would highly recommend Ki. Enjoy!", "author": "Jonathan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-17", "description": "I've been a patron here for more years than I care to count... They've always had extremely fresh and tasty fish, creative rolls and dishes, and a solid menu. A few years back, they raised their prices... I didn't really notice much at first - until I found another almost-as-good sushi spot in the hood, and then realized I was paying more than twice what I should have been for years... \n\nThis is def one of the top 2 places in this area, but I'd rather pay $14 than $32 for the same rolls and apps on a normal delivery night. The food is great - just think about where you wanna be throwin' your cash...", "author": "Brad D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "This review is mostly centered on the supreme omakase (35?), but I also had a Ki special roll. \n\nTo start, I wanted to say that this place was really packed. I read a couple of reviews saying that they did not honor their reservations, but I did not have a problem. The waiters and servers were quite attentive and knowledgeable. \n\nI was seated at the counter because I wanted the full omakase experience, (one by one) but I didn't expect it. Of course, it did not happen, but I do not blame them one bit. The omakase experience here is very... touched up with business ethics. Of course, this place is not solely an omakase joint because it needs to make business by doing local deliveries and offers specials and etc. I mean, their primarily going to be focused on those regular rolls and local deliveries. Basically, it is like any other sushi joint, except that it serves omakase. \n\nI had a couple of appetizers like gyoza, and the toro tartare. It was pretty standard stuff, but the toro tartare, albeit really good and showed me the fresh quality of the fish, was not worth the money. It is about 1/4 the size of my palm for 14 dollars. My advice is get the gyoza if you want, which was pretty good, but skip the toro tartare. \n\nAs noted above, I talked about the business like ethics of Ki sushi. With that said, the business-like ethics of this sushi joint dis not deter them from serving a great \"supreme omakase.\" Although I did not get the full experience, I got the freshest fish available and the best tasting items available. \n\n**side note: In a full experience omakase, the chef hands you the pieces one by one and makes sure he caters to your taste buds. That is why, the most special pieces are not served at the beginning of the meal. He has to make sure to get the exact ratio of wasabi, soy sauce, etc. At ki sushi, and I suspect at every other classier sushi joint that offers omakase, you will get all the pieces in a plate which will be delivered to you by a waiter. Of course, as I said, this version of the omakase does not mean it is any less tasty. \n\nThere were 4 super special pieces along with 5 other pieces. \nGolden eyed snapper\nCalifornia Uni\nToro\nScallop\n\nThe other five were:\nArctic something\nSaba\nSomething Mackerel\nAmberjack\nSomething\n\nI really enjoyed every single one of their special nigiri pieces. I cannot stress the quality of ingredients used. My favorite of course was the Uni, but the Golden eyed snapper was very good too. I suspect that umami taste came from a torch though. The toro was on point and so was the scallop. I did not have high expectations for the scallop, but I was proven wrong. \n\nThe regular pieces were quite delicious too, except that I do not like mackerel at all. To me, it always tastes so fishy, and honestly, I have had mackerel at top tier sushi joints, and they are also fishy. I think it is just the nature of the mackerel to be fishy. \n\nOverall, these things were quite delicious, and so I asked for another piece of California Uni and golden eyed snapper and then another Ki roll. \n\nFor the uni, they had wanted me to try Hokkaido uni instead, but charged me for a California uni, which was very very nice of them. The hokkaido uni was just as good as the California uni, but it has a distinct flavor which tasted more like an ocean breeze. I loved it. \n\nNow for the Ki roll.... to me, it was like a special roll from any other sushi joint's. This is where the -1 star comes from. No offense, ki sushi, but you guys served me an greatomakase, and I'm sure your Ki roll tastes amazing to people who haven't had your omakase but it pretty much showed me the difference between the quality of fish used in your regular orders and the omakase. Like I said before, if you are not coming here for the omakase, then you are coming to just another sushi joint. I'm not trying to say don't come here for rolls, but the supreme omakase is THE thing to get here. So if you really want to see what the hype with this place is, or if you REALLY want to taste superbly made sushi, don't get the regular sushi rolls, drop some extra cash and try the supreme omakase. \n\nI am definitely going to recommend this place for Omakase. I will be back to try the Ki omakase, which is not made with ingredients flown in from japan.", "author": "Edward M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-13", "description": "In an effort to get away from the neighborhoods (sheepshead bay) typical sushi joints, we ventured out to Cobble Hill one night. We were not disappointed by Ki, the fish and ingredients are very fresh. \n\nThe service is welcoming and friendly. You can't go wrong with the ambient atmosphere, either.\n\nYou are definitely not spending as much as you would be at other hip NYC sushi joints. \n\nYet, you're still getting quality food, great service and an ambient environment.", "author": "Sibel K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-09", "description": "We ordered 3 specials rolls: ki, pikachu and American. The first two where perfect texture, color, presentation, super good toro tuna! Same as the ones I was used in Tokyo", "author": "Marco P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "Had a great dining experience here. Great for dates, atmosphere is dim but vibrant. Price-wise, it is a little more expensive for Brooklyn sushi but less expensive than your city sushi. I ordered the sushi deluxe and it was great. Each piece of sushi had it's unique flavor and was great. Also got the toro hand roll which obviously melts in your mouth. Staff and service was great. I'd definitely come back again!", "author": "Chris L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-06", "description": "A famous Yelp Ambassador has Ki as one of the \"Best Date Restaurants in NYC: If you don't get lucky, it's not the restaurant.  It's you.\"  So, of course - I have to try it right?  It's Yelp and like all things you read online, it's gotta be true!\n\nSo my fine friend was craving for sushi, so we got the famous Ki roll, Rainbow roll, and a Sashimi deluxe.  First off, the service was awesome.  Beyond having a warm wet towel to wash up before eating, there's a slice of lemon in our water.  Only 8.53% of all the restaurants I've been do actually gives lemon in your water automatically so that's a big win for Ki already.  FF was not impressed.  The Ki roll was awesome to me, but FF was a bit apprehensive about eating a gold leaf.  Like the Ki, the Rainbow roll was also packed with fresh fish.\n\nSashimi deluxe came and FF apparently isn't really into salad - odd I thought, seeing how she's so... fine.  Every single piece of fish I found was freakin fresh.  But FF was not impressed.\n\nFor dessert, I wanted to bring FF to a cute place I know with some pretty awesome Chocolate cake - surprise her with a candle in it for her Birthday.  She shows me a picture of a slice of chocolate cake she had the day before at Peter Luger... with a candle in it.  *sad face*  Instead we stayed and ordered the banana and ice cream.  That she liked.\n\nI went home with a *sad face* and later in the evening I had two pieces of the Ki and Rainbow roll left over that was doggie bagged.  Opened up the paper bag to find a menu wrapped in a rubber band with a tiny dish, 4 packs of soy sauce, wasabi and ginger in my sushi container.  Never in my entire life in my doggy-bagging career have I ever had utensils included in my take home bag.  I got lucky alright.", "author": "Albert W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-11", "description": "Awesome neighborhood sushi spot, and one of the better places I've had the pleasure of eating raw fish at.\n\nTo start:\n\nSome of our party had Miso and others had Wild Mushroom soup, both were simple, earthy and tasty.\n\nThe edamame was cooked perfectly, topped with sea salt, and I got the house ginger dressing to dip them in, it's just how I roll...\n\nWe had a few newcomers to the Japanese/Sushi experience, so we also got a shrimp tempura roll as an app, to ease them into the whole thing.  It was crispy, fresh and delicious.\n\nFor Mains:\n\nWe orded the Lobster Tuna Roll, spicy lobster wrapped with blue fin maguro, topped with caviar and gold leaf, and sitting on top of a bed of whipped wasabi avocado. \n\nWe also had octopus and blue fin sushi, some California rolls for the new comer, \n\nAnd for dessert we went with the vanilla friend ice cream, served with some of the most decadent house made whipped cream, and a caramel drizzle! \n\nService was also fantastic. And the decor was inviting, with the right amount of an upscale vibe to it.  And the pricing seemed reasonable for the quality and freshness of the fish.", "author": "Bryan F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-12", "description": "Definitely not bad, but I would say that I was slightly underwhelmed with the flavor of many of their rolls. Their sashimi was slightly above average quality but I would say their specialty rolls were slightly below average. The service overall was excellent, but for the price, especially if you are seeking specialty rolls instead of sashimi, I would recommend finding other places.", "author": "Dave T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-27", "description": "My friend Danny literally could not stop giggling after taking a bite into the uni from Ki. He looked like the happiest kid on earth. Then again, he just admitted to me today that he has a serious uni addiction. Today was like 5th day in a row he needed Uni. Someone put him in UA.\n\nAll jokes aside, I was thoroughly impressed with Ki Sushi. \n\nThe warm mushroom salad was absolutely delicious - what a great way start the meal. I highly recommend this! Truffle oil heaven.\n\nFor the rolls we had the Naruto (cucumber wrapped choice of fish, we picked salmon) and the TNT which was made with toro.  TNT was much better than the Naruto. Not a huge fan of cucumber wrapped rolls, the cucumber takes away from the fish.\n\nWe also order blue fin toro from Spain and it was uh-amazing. Melted in my mouth.\n\nEverything tasted better with a warm bottle of sake.\n\nService was great as well. \n\nThis is definitely a bit pricier than other sushi restaurants, but the quality is also of a different caliber. Worth every penny!\n\nPS - lunch specials are the best in value!!", "author": "Diana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "I've been so Ki Sushi a few times and the service has always been incredible. \n\nHighly recommend the Ki Roll -- it even comes with gold flakes on top! Delicious! \n\nIt's a bit pricer than the rest of the area, but TOTALLY worth it. The decor isn't fancy, but it's cozy and clean. The fish is fresh and their chefs are really friendly and happy people in general. \n\nIt's my favorite sushi place in NYC!", "author": "Tanya M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "I come here for the pretty fancy decorated special rolls and great value lunch special deal. They make really good special rolls. I wouldn't come here for regular sushi though because I have had better. The staff are polite and service is pretty good. I enjoy their green tea. The black cod entre is very good.\n\nMy favorite items are:\n- TNT Truffle (appetizer)\n- Mushroom salad (it's just good!)\n- Seafood Dynamite\n\nRolls: TNT lover and Ki Roll.  They are all awesome!\n\nI feel like they are very consistent with their food and service.", "author": "Cheny N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-23", "description": "In my experience, most sushi in this city seems to fall into one of two categories:\n\n1. The legendary, prohibitively expensive places like Nobu, Yasuda and the like. \n\n2. The cheap, occasionally decent but also potentially revolting spots that do 1/2 price sushi, and/or for some reason serve Chinese, Thai, Korean and sushi out of the same kitchen. \n\nThis leaves a gaping hole in the NYC sushi scene, where there should be moderately priced, good quality sushi.\n\nEnter Ki. It is not only decently priced, but everything I've ever eaten here has been of extremely high quality. All types of nigiri, sashimi, rolls, salads and hot dishes have been outstanding. You will even notice the difference in the wasabi. \n\nI'll echo everyone else in saying that the Ki Roll is a favorite, but really anything you order will be a winner. Even their simple, garlic broccoli appetizer is amazing. I'm normally skeptical of spicy tuna rolls, but here I don't even sniff it to make sure it's not rancid; I trust them implicitly.\n\nIt's official, this is my favorite sushi spot in NYC.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-26", "description": "Great little Brooklyn spot. \n- Jalapeño Hamachi was wonderful - 6 good pieces in ponzu\n- Spicy girl roll was huge and great!  The tuna was bulky and a lot.  With the crunch it was a great roll\n- cod entree was one of the best I have ever had, super soft and smooth with just enough miso glaze.  Served with seaweed salad. \n- Duck appetizer was good - I'm not a huge fan of Duck, but I really enjoyed it.  Good taste and very well cooked.\n- Unfortunately, the Shishito peppers were okay - not the best, they didn't have a lot of flavor", "author": "Isabella R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-07", "description": "Came in for a quick lunch.\n\nThe tempura was dough heavy but it was served while it was still very hot so it is good. There are better places if you really like tempura, but Ki Sushi has reached the standard for the price, no complaint! \n\nHad tried the Ki Roll and Foxy Lady, really unique and tasty rolls. You can actually enjoy and taste what's in it. It is not like some other sushi place, a roll means a big scoop of rice with some raw meat. \n\nSetting was ambient and the service is just about average, will definitely come back for more, yum :P", "author": "Hilton H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-04", "description": "I've been to Ki Sushi twice. I'm a hard core lover of anything chicken teriyaki and Ki Sushi certainly did not disappoint in that regard. I wouldn't say it was exceptional, but on par with most other good Japanese restaurants that I've frequented in my time.\n \nEach time we had the same waiter. He was incredibly friendly and nice and definitely set the tone for having a comfortable dining experience. It's something that I appreciate very much and made it quite evident with my tip.\n\nThe interior has a very romantic setting. I went with my girlfriend so the atmosphere was proper for the two of us. However, if I were in the mood to get Japanese with a friend, I'm not certain how the intimate environment would suit. \n\nOh, and the first time we went, our hostess had quite an attitude; I was very pleased to not see her the second time around. Good job on that part, Ki Sushi. I like seeing proper changes made (Or it could have just been her day off. I'll give them the benefit of the doubt).", "author": "Anthony T."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}