{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "Really like this place. The manager is friendly. We usually get the chef's tasting (Omikase) of sushi which is reasonably priced and enough to get you full. I also recommend for a hot appetizer the chicken yakitori and the crispy rock shrimp.", "author": "Steven L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "My favorite sushi in the city. It always tastes so fresh and I never get order envy because everything they have is amazing,  stop reading this and go there already.", "author": "Matt A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "Great for sushi lovers\nLocated on the smith st. in Brooklyn, Ki sushi serves delicious and authentic Japanese cuisine. They offer a very wide selection of both sushi and sashimi, all of a high and excellent quality. The set lunch is incredibly great value for money and everything comes beautifully presented. \nThe only problem with Ki sushi is not knowing when to stop eating.", "author": "Kuma I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-17", "description": "Terrible Delivery Order.  90 minutes. And then the lady just hangs up. Customer Service - come on people.", "author": "D R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "If you like tender sushi and crispy lettuce, Ki is the place for you. \n\nAt $16 something (tax included) their salmon sushi lunch special (6 pieces of sushi + 1 roll + soup + salad) is a good deal. Especially if you are craving sushi but don't want to drop major $$$.\n\nI ordered take-out and the devil was in the details with their small soy sauce dish; packets of regular and less-sodium soy sauce; a real plant leaf served as the divider between the sushi and the roll instead of the usual fake, plastic grass you may get elsewhere; and thick napkins = major approval", "author": "Susan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-27", "description": "This place is pretty dope. It was recommended to me by a friend, and it's a great neighborhood sushi spot. The service was efficient and the sushi was fresh. What else could you need?", "author": "Amanda K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "The best sushi in the neighborhood. We arrived at 6 on a saturday night, just after they opened and were seated right away. Within the hour they were slammed and for good reason. The restaurant is warm, ambient and efficient. The sushi is fresh and everything was delicious from the ice cold water with lemon to the perfectly balanced miso soup + gyoza, to the endless platter of rolls. Ever Green vegetable roll is a favorite + the little nigori sake was nice. This is our new go-to sushi spot. The price is spot on for a classic, satisfying sushi evening. It's not flashy, it's just damn good. \n\nFor anyone with kids, we brought along our 6 year old and it was great. Plenty of classic dishes to satisfy her self-imposed, limited palette. And of course, tempura ice cream for the win.", "author": "Nissa E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-07", "description": "We have been meaning to try this Sushi spot for a while. We came on a Saturday around 6pm, just after they opened.  The ambience is gorgeous, very serene with dim lighting, and a sense of privacy. And even better than this was the very attentive service. \nUnfortunately I have to give the sushi itself about 2.5 stars, mainly due to one 'Special roll' that we ordered was clearly off \u0026 fishy tasting; this basically spoiled the meal for me.  I wish the chef's could taste test all the fish before they send it out, but I guess that is not realistic. \nThe other rolls we ordered were quite tasty and fresh, although nothing that memorable that I would return for given all the other choices out there. \nOverall Service and location= 5 stars.  Food is 2.5", "author": "Tara K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-02", "description": "Unpopular Opinion Alert: here goes nothing....\n\nKi is just fine. After reading all the 4/5-star reviews with slight trepidation, we stuck to some of the basics to vet this place out. Basic rolls, some sashimi, nothing crazy. I was surprised how ricey and sticky the rolls were! WAY too much rice. The fish was fresh and delicious, but the rice was overkill. Also, their wasabi here is weird (and I know real wasabi, man).\n\nFor such mediocrity, they sure do charge Morimoto-style prices. $7.50 for a salmon avocado roll? That's about $3 more than any other sushi joint in all of Brooklyn! Found that to be strange.\n\nStill, service was impeccable and everyone was friendly and courteous. The sushi chefs were shmoozy, too, which I like. Will return for Omakase and promise to update this review.", "author": "Cerca T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-18", "description": "Great service and delicious sushi. I ordered seared tuna off the menu and was brought a delicious plate! Great warm welcome upon entering with even the chefs waving hello as you seated. I highly recommend this place.", "author": "Tanya G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-06", "description": "Just order take out. The rolls are not sticking together. I asked for an extra soup instead of a salad, but they didn't make it that way. They could have done better.", "author": "Jing Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Ki Japanese restaurant  . The food was so delicious and the service always good , if you love sushi you must go there.", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-16", "description": "When I was younger, I was more of a risk-taker when it came to sushi. There was always the threat of food poisoning, but rolls for $2.50?!?! I was hooked. The older I get, the more cautious I become when someone asks me to recommend a sushi place. And this is the one I truly love. You really get what you pay for- I've never been disappointed, and I know the sushi will always be fresh.", "author": "Roksolana K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-26", "description": "Amazingly flavored sushi! Normally I can't tell most restaurants apart but these place has good with a very distinct, salty garlicky amazing flavor. Must try!", "author": "Zainab M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-20", "description": "I have eaten at Ki and the service and ambience is very nice.  However we primarily are too lazy to go out on Friday nights so we regularly order sushi.  Ki is our favorite in the area.  It is definitly more expensive than the others but worth it.  What makes it special are the rolls.  The Pink Lady is my fav. \nEnjoy", "author": "C K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-19", "description": "No words to justify my first visit here! \nJust the salad and soup alone, let me know my taste buds were in for a treat! \nI ordered the lunch/bento box with chicken teriyaki and oh boy, was it great! The chicken teriyaki also includes a sweet surprise underneath, really fills you up and your taste buds happy.", "author": "Enoch L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-06", "description": "Fresh, delicious, finger licking sushi! I will definitely go back for more. We had TNT - AMAZING! Ki roll, spicy girl and one more. I think all of their specials are worth a try. The regular tuna roll was not too tasty - the only down thing from the entire experience. The atmosphere is romantic - great for a date and a get together with friends (they have bigger tables). The staff was very attentive to all our demands. They always made sure we have tea, water. \n\nI called to make reservations 10 mins to my arrival  and they told me 40 min. However, I decided to walk in and I got a table right away. SO ...just a small trick.  =]\n\nExcellent - definitely going back!", "author": "Mary S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-11", "description": "A sushi place in Brooklyn?  You must be talking about one of those all you can eat places or the places that do discount sushi that taste like store bought stuff right?\n\nNope Ki Sushi is where you can take your family to for a celebration for high quality Sushi without having to head to the city or breaking the bank.  The food was fantastic I ordered the Pikachu roll the sushi was jam packed with all sorts of goodness and a good treat for a celebration.  The specialty rolls are definitely the highlight at Ki Sushi.\n\nThe restaurant was well renovated and stylish which makes all the other Brooklyn sushi dens look even more tacky by comparison.\n\nMy buddy and I both got a little bottle of sake just the house sake and it was served warm and packed quite a punch.  My buddy drank it like it was a shot and telling him it was better to sip it and taste the alcohol. \n\nA good night out, since we came here my buddy's been back a bunch of times and was surprised I haven't gone after moving to the city but Ki sushi is a place I would venture into Brooklyn for.", "author": "Kwai L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-25", "description": "4 stars for the Chirashi Lunch Special! $15 for a soup, salad, a generous portion of rice and assorted raw fish -- Yum!\n\nThe fish is pretty fresh, and it will keep your tummy very satisfied for lunch.", "author": "Diane Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "So very good! Ki serves up some amazing, melt in your mouth fish. High quality, great texture and all around delicious the likes of which I have only found on the West coast. I would suggest something but everything here is good. But, if you have room for dessert the banana chocolate thingy is TO DIE FOR! Service was standard and it was a smidge too dark for my liking...but the food! Definitely worth a visit!", "author": "Liz L."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}