{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "Best place for sushi in new york city! The sushi is fresh, the wait staff is very professional and the presentation amazing.", "author": "Susan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-26", "description": "One of my fave sushi places. Always fresh and delicious. The agedashi tofu is crisp but not oily, Fashion Roll, Ki Roll, Foxy Lady Roll, are tasty, and the seaweed salad is yummy too. \n\nI would go there at least twice a week if I wasn't feeling so guilty about eating out/ordering delivery all the time.", "author": "Stacey P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-30", "description": "Food deserved 4* but service 2 - hence the 3 *.  We had reservations at 8 for a party of 8 on a Monday night.  We all arrived on time and when I went to the hostess she had that \"oh crap\" face on.  She said something like a large group came in and are waiting for them to finish.  She said 10 mins.  Okay- we waited the 10 mins and 15 mins later we were still not seated.  She said the table just got their bill and a few more mins..... so 20 mins later we are finally seated.\n\nThe food is good!  all the fish is fresh.  My group loved the ki roll and fried oyster.  Oh yes- the fried ice cream (green tea) was pretty darn tasty too.\n\nOk- back to the service.  Our waitress was all over the place.  We had to constantly ask for water and when they thought they brought all the food out- they didn't.  \n\nWould I go back? hmm... probably not with a big group.  maybe with 1-3 other ppl.", "author": "Hoi I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-20", "description": "The restaurant looks really nice, a nice classy and zen interior design help to set the mood. The staff was also caring.\n\nBut I have to say I was expecting more of the food after the reviews I have read on yelp. I have taken the lunch special with california and philadelphia rolls:\n- the miso soup was good\n- the ginger seasoned salad was really interesting, I think I would try to prepare the seasoning at home\n- but the rolls were just okay, I mean good, but definitly not the A-grade kind of rolls I was expecting. I think I probably prefer some rolls at the \"All you can eat' buffet at Ichi Umi.\n\nSo in my experience the restaurant was good, but I was disappointed to see the basic rolls were not better than the one you could find in buffet places.", "author": "Sammy B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-19", "description": "I was hoping for some real good Japanese food when I was reading all the good reviews right before I place the order.  This place was just about 10 - 12 mins walking distance away from my sister's apt, so I decided to pick the order.\n\nWhen I got back to the apt, all the food was well organized.  The salmon skin salad was on top and all the sushi and the sashimi was in a bigger box right below it.\n\nWhen I open the salad box, I could barely see any green.  There were too many Salmon skins on top.  The Uni/sea Urchin and the fatty blue fin tune was just ok.  The spicy tuna was kind of falling when I tried to pick it with the chopstick.  \n\nEveryone mention how good was the Ki roll.  The combination of all the fish was good, but I didn't really like it.  It was just a 3 starts for me.\n\nBtw, they gave me a lot of wasabi, but it wasn't spicy at all. I really prefer the good quality wasabi that you can buy in the Japanese supermarket.  For the money that I spent, I really think that I could find another better Japanese restaurant in Brooklyn.", "author": "Jay B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "Amazing sushi!! Best in Brooklyn, the freshest fish. The service is wonderful too, a gem.", "author": "L L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-30", "description": "Don't get delivery.  They don't tell you the truth about the time it takes, and the time it takes gets you sushi that has been out of a cooler for more than 45 mins.   The sushi is good but not cheap.  So if you are concerned to eat sushi because it takes so long to get it after it is prepared, don't order from Ki.  I ordered this evening, it took over 1.25 hours and was told the delivery person had been out for over 45 mins.   And they don't have their delivery in cooler bags.  Buyer be ware", "author": "Ben C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-29", "description": "Great atmosphere and love that they still do the real (hot) towels. Prices have gone up a tad lately, but I didn't mind at all. Amazing!\n\nGet the fantastic roll. Yum!", "author": "Bella A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-27", "description": "Wow.  and again wow.  Perhaps one of the best sushi meals I have had in the US.  We had the supreme omakase.  The one disappointment was that the selection was not terribly exotic.  That said, the fish was very fresh and Ki was very generous in portions.  The slabs are probably 50% bigger than what you find in Manhattan.  \n\nThe must have is the TNT roll.  Tuna and truffle.  That is really all one needs to know.  It is a game changer.  The live scallop was also very fresh with 4 nice sized slices per order.  Both must haves.\n\nThe side dishes are what makes this place a stand out.  The garlic sauteed broccoli had incredible depth of flavor for such a simple dish.  Also, the spicy seafood soup is a nice warm addition to the meal.  The soup was a flavorful broth filled with plump prawms, mussels and fresh vegis.  It had lots of flavor without being heavy.  It leaves plenty of room to pack down more sushi.\n\nThe service was also top notch.  It is rare to have servers so attentive and pay so much attention to detail.  My napkin fell from my lap and before I even noticed, a waiter handed me a clean napkin and picked up my original one from the floor.  Also, I was wobbling the table a bit and before I could ask for any help, the hostess came by with two doorstops to stabilize the table.  I really didn't need to ask for much, they pretty much figured it out for me.  \n\nI can't wait to go back.", "author": "Scott C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "Ambiance is great. I loved the dark atmosphere. This is the place I go to bring visiting friends and family- the best!", "author": "Liz C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-21", "description": "My favorite new discovery of 2012.\n\nThe quality of the fish is exceptional, far above anything else I've tried in the neighborhood.  It's not cheap, but considering the quality it's a good value.  I'm a huge fan of the Fashion Roll, the Fantastic Roll, the Volcano Roll, and even the humble Spicy Tuna Roll.  The ginger creme brulee is tasty too.  \n\nIn addition to the food, the folks here are super nice, especially Joe the sushi chef, who always says Hi to me, even when I'm just stopping in for take-out.\n\nOne quibble:  The music is really too loud, and also, pretty awful.  Who wants to waste energy tuning out bad, outdated, pop vocals when there is such sublime food to be enjoyed?", "author": "Katie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-24", "description": "We went here for lunch and had the TNT truffle for appetizer which was pretty good. It comes in six pieces and actually came to our table pretty quickly. \n\nThe atmosphere is very nice, great for couples. We also ordered the ki roll, the volcano, and the foxy lady. The ki roll and the foxy lady was the best out of the three in my opinion. The volcano roll was decent. \n\nWe ended the meal by getting the ginger and lime creme brûlée. It was beautifully plated and was very good. I've posted up photos of the meal so you can get an idea of the food. \n\nOverall the food and the experience was great. Definitely recommend this place if your looking for sushi in Brooklyn.", "author": "Peter C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "I always get the chicken lunchbox is around 14$ for rice, chicken, dumplings, california roll, miso doup, and salad. Its more expensive but the quality is very very good, which is why i keep going back.", "author": "Dan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-14", "description": "BEST BEST BEST !\nNo offense, but when I see people rating this place less than 5 stars I understand why there are so many mediocre restaurants out there...people just don't value great food, great service and awesome prices! \nThis place has it all. You just can't go wrong.\nTheir spicy maki combination is AMAZING and made my husband and I decide to never go to a different sushi restaurant again!  It's a huge plate with three rolls (each roll is made of 8 inside-out pieces) and comes with a delicious miso soup. The price is $ 18 !\nTheir fried banana dessert is just AMAZING ... as everything else I tried.\nPlace might get crowed in the evening and on the weekend (even on the quite days when all the other restaurants of the area are deserted).", "author": "Foodlover N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-01", "description": "It was ok. I've had better.\nNothing special\nNice ambiance and good service but i was disappointed due to the high 4 star reviews", "author": "Peter M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "The seafood soup (not miso soup) was amazing and by far the best we have ever had at any asian restaurant.  Our sushi was fresh and well made.  We ordered dragon rolls, spicy tuna rolls and a couple of hand rolls.  We also shared the edamame and garlic broccoli.  All worth the money.", "author": "Sharon V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-05", "description": "this is one of my favorite sushi spots in brooklyn.\nBlue fin torro is the item in this place.\nAll the fish is fresh and the waiters are hella nice.\navacados are always delicious and soft.\nFried ice cream for dessert.", "author": "Jose S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-24", "description": "I am happy that such a place exist so close to my home! I picked this place at random for dinner with some gfs one night and I've been back twice now! The service is good, Michelin-star good...warm/hot towels, dishes explained by waiters- good. :) I had the sea bass with the noodles the first time, I was impressed at the portion of it. My gfs had the sashimi/chirashi entrees and they were pleased at how fresh it was...and the selection of it. None of that fake crab meat aka orange sticks! \n\nIt's my go-to Japanese spot in Cobble Hill, a bit pricey but totally worth it! :)\n\nTip-bits:\n\nMake reservations on weekends, they do get busy!\nIt's dainty and classy enough for a date night in BK!", "author": "Florence Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "Ki sushi is a great sushi spot. Every time I come here the fish is extremely fresh. I really enjoy coming here. The TNT truffle appetizer is amazing!! The rock shrimp tempura is also really good. My favorite sushi pieces are the amberjack, scallop, and uni. They sometimes have japanese uni. You have to try it. Highly recommend this place! My go to sushi spot when I am in the area!", "author": "Jessica K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-23", "description": "Consistency is something that should be expected.\n\nFirst time at Ki sushi was great. Probably top 5 sushi places I've ever had in NYC.\nMoney Well Spent.\n\nSecond and LAST time: Girlfriend literally choked on a fish bone. \n\nI don't know... maybe it's a new and trendy way of eating sushi but I don't expect to de-bone my sushi or perform the Heimlich on my date.\n\nReally wanted to be a regular here too...", "author": "Richard V."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}