{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-14", "description": "Fantastic specialty rolls, the daily specials (non-sushi) like the mushroom salad (if anyone reads my reviews, you will notice a consistent predilection for all things fungus, sorry) are esp. great!  The only reason I don't give it 5 stars is bc I have had better sashimi albeit for a much higher price.  Don't get me wrong, the fish is great \u0026 probably the best in the entire Bococa area if not Brooklyn.  But with so many amazing sushi restaurants in NYC, I can't give it a 5.", "author": "Joan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-16", "description": "Tried this place for the first time the other night... Pretty tasty.  We stuck to the basic rolls which were all very good.  Some of the specialty rolls sounded really tasty, but they are a bit pricey.  Good tempura, awesome miso soup... It had those little stringy mushrooms in it, a nice addition.  The spicy tuna had a really nice texture.  My only complaint is that the spicy tuna could have been a little spicier, but I'm willing to chalk that up to taste.", "author": "John E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-05", "description": "Five stars, phenomenal sushi. Better than Hibino, and kicks that overpriced highway robbery joint called \"blue ribbon\" right in the ass. The fish was fresh and delicious, the servers were polite, attentive and gracious, and the place itself is pretty, simple and comfortable. Definitely worth braving the rickety F train, hell, I'd probably ride on top of the train if I had to, just to get back. And best of all, the price is right, this place isn't trying to rob you, they'll just feed you so well you'll have waking dreams about going back.", "author": "Bee P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-20", "description": "I miss the old Ki. Fresh, delicious. The past 2 times we've eaten here/ordered takeout it's been mediocre at best. Both times the salmon was too fishy (so strong I was afraid to eat it), the rolls fell apart, and there was way too much mayo in the spicy sauce. I LOVED Ki and had high expectations every time I went, since it was consistently good for so long. Guess I'll be searching for a new place...", "author": "S V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-02", "description": "Hands down the best sushi in Brooklyn, and amongst the best in all of NYC.  The fish is fresh, the service is fantastic, and the experience is always fantastic.  In truth, for the cost, absolute best \"relative value\" in high end sushi.\n\nLeave your meal in the hands of the chef and go with the tasting platter, you will love the delectable sashimi and sushi selection.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-07", "description": "shrimp and vegetable tempura were light and fresh and crispy (also, first time I've ever had non-burned broccoli tempura). great selection of basic and specialty rolls--our favorite was the Pink Lady, with salmon tempura, yellowtail, tuna, avocado and masago in pink soy bean paper.", "author": "Maude J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-05", "description": "I love this place!!! Great atmosphere, clean, nice design, fresh food, that was my first time I tried Garlic broccoli, it was so delicious ( and you don't smell garlic afterwards), seaweed salad was good and my fave Cafilornia rolls were so yummy, polite waitresses that bring you hot wet towels for cleaning your hands. I'll  definitely  go back there:)", "author": "Masha B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-05", "description": "Ki Sushi is the absolute go-to spot for sushi in the neighborhood.  The fish is fresh and delicious, and the portions are sizable and satisfying.  I think it's still worth it for dinner (which, given the prices, speaks to the really remarkably good fish), but the lunch special is an incredible deal--between $11 and $15 for sizable portions and incredible quality.  (I know, I know, you can find cheaper sushi, but you most certainly can't find better sushi for the price, and really, who wants cheapo raw fish?)  The two roll special is sizable with good cuts of fish, and I'm a huge fan of the chirashi.  The ambiance is tranquil and perfect for talking quietly, and the service is friendly and fast.  I also recommend the delivery.  Really, this is far and away the best sushi in brownstone Brooklyn, and the price to quality ratio renders it spectacular for lunch.", "author": "Adria L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-29", "description": "Ok, but not exceptional. The only roll that really excited us was the Ki Sushi Roll namesake. One roll is not enough to get us to come back.", "author": "Michele W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-14", "description": "With Hibino so close by, I'm not sure how Ki gets such high ratings. Best sushi on Smith street... but there's not a lot of competition.", "author": "Tabby M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-28", "description": "Best sushi in the area.  Fresh and tasty!  The service is very attentive as well.  It's good for those that like sushi and sashimi, and the rolls are pretty unbelievable too.  We had a Ki roll which was very impressive (actually had edible gold on it), and I highly recommend the Volcano roll!  My sashimi was awesome.  Got a buzz and left stuffed for $65 (2 people) on a Friday night  :)", "author": "Katie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-27", "description": "Fantastic quality fish!!!! Love the rolls - I usually get the volcano roll which is so creamy. I used to get miso soup then ordered the mushroom soup which is delicious. They often have Kumamoto oysters and sea urchin from Japan - worth the splurge.  I happily try new things here since their fish is always so fresh and good. Big fan!", "author": "Angela M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-07", "description": "food is ok. their salmon skin salad is a must have! sushi was good. will go back there? probably not. had some other options for best sushi in town...", "author": "Bernadette M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-31", "description": "my favorite sushi place in Brooklyn - emotionally it might be my favorite in all of NYC - and I know sushi.\n\nthe air-conditioning system does smell a little weird sometimes... but, i can roll with that.", "author": "mark s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-22", "description": "Omakase sushi or sashimi are superfine and highly recommended.", "author": "Danielle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-03", "description": "my favorite in Brooklyn!  the dynamite roll is.... well, dynamite... worth every penny.  the ala cart Sushi is fresh and delicious.   Delivery is fast and ordering by phone is friendly and easy.", "author": "Bobbi M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-02", "description": "Great sushi roll place.  Atmosphere is great and service is great.  The warm mushroom salad is amazing.  Other great appetizers are the TNT truffle and the seafood dynamite.  This place is known for their special rolls.  I have tried most of them and they are all good.  They also have a pretty good lunch special deal.  Highly recommended.", "author": "Bryan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-01", "description": "I really hope that this sushi gem doesn't get exposed too much.  The fish here is so damn fresh and never disappoints.  Getting a table without reservation had never been a problem so far.\n\nDon't miss out on their Omakase.  It's so cheap and includes Blue Fin Toro.  It's definitely one of the best sushi place I had been to in Brooklyn.", "author": "Loretta H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-09", "description": "If i could take Ki Sushi home to bed after a every visit, i will.\n\nSimply put one of the best Sushi places in brooklyn. I don't know if its because it has just opened so the employees haven't had a chance to slack off yet but this place is simply divine.\n\nThe decor is phenomenal, exposed bricks and holes at the top of the bricks for candles to set the mood. Even during lunch time the place is still lit with a glow...unlike say other sushi places that i shall not name *cough - Sushi Tatsu...but i digress.\n\nThe servers are simply fantastic, they are attentive and pamper you from the moment you walk in.\n\nThe best part? unlike most sushi places, there rolls are generous and there are 8 pieces in a roll, beat that Sushi Tatsu. The taste is simply divine.\n\nWords really cant describe how great this place is....you really have to experience possibly the best sushi at $4 a roll.\n\nIts become my new default date spot...you know what i mean, the place you always go on first dates because its comfortable and you know no matter what atleast you will end the night with great food in your stomach..but alas in my zeal to try to induct every friend(mostly male) i have to the spot...i may have come off as a kinda sleazy to the staff who know me well, its all good though at least i still have good sushi, lol.", "author": "Abby L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-09", "description": "Best sushi I have had so far in NY.  I moved out here from California in November and most of the food is better out here than Cali, except sushi.  Ki is the first restaurant I have found so far that the sushi tastes so fresh.  Kevin the sushi chef is a delight.  The service is excellent and prompt.  Prices are medium affordable.  I highly recommend their sushi.  It's the first place my sister from California wants to come while visiting NY.", "author": "Jaime K."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}