{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "My new go to restaurant. It is on the expensive side but what you pay is what you get. Fish is extremely fresh. Customer service is attentive. I went during lunch hour at 1pm and it was PACKED. I went alone so no biggie to sit at the sushi bar. I ordered my life away lol. Ordered eel avocado and spicy tuna from the lunch menu. Their rolls are 8 pieces. And then I ordered the passion roll from the special rolls section. I went in there hungry and came out with a whale belly. Happy customer. I already recommended to several friends :)", "author": "Jenn J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-14", "description": "Ki used to be the best sushi in the neighborhood. Always fresh, reasonably priced, everyone there was friendly.  Not sure what happened, but on a recent visit, after not having been there in about a year, it seems like everything changed.  The waiter was rude, sushi took over 30 mins and -- this is where it really sucks - it was warm, tasteless and mushy.  Tried to flag someone down to ask what happened, but it didn't work.  Hope it was just an off night.", "author": "Atlantic A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "Ventured to Ki for a night out with the family. The service was good and on point. The only downside was the wait for our meal. It took a little while before our entrees came out but our appetizers were out in no time. I had the mushroom soup which was hot, mild and delicious for my app and the the Spicy Sea Bass as my entree. The sea bass was fresh and well done. I did expect it be a little more spicier though. The description did not match the dish but the dish was exceptional. Overall a good experience and everyone enjoyed.", "author": "Dana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-04", "description": "Ki is one of the better Japanese restaurants in the area but they are not run by Japanese but rather by Chinese.  Still, they put out a good effort and the fish is fresh.  Not pictured was a chirashi which had large and prime pieces of hamachi and tuna.  I always judge a good sushi place by how generous they are with their chirashi because that's how a place shows off its fish.  My teriyaki was basically sliced rib eye steak in a pile which I had to dip the slices into a sauce individually, a little unusual and deconstructed but it worked.   The hamachi tartare with caviar was a good starter but not as much compared to the chirashi that we ordered.  Perhaps next time, we should get a warm starter if ordering sushi for dinner.  I would come back but next time I'll bring a flashlight.  The place is way too dark and the opaque plastic covers on the menus blur the writing rendering it nearly impossible to read the menus.", "author": "Wailana W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-25", "description": "Finally back open!  Happy to report that everything is still delicious, fresh and top quality and that the entire wonderful wait staff are still there also.", "author": "Conni M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "You Yelpers don't lie. This place blows other Japanese restaurants out of the water. I will try to piggy-back off of what everyone else is saying without being too repetitive. Let's just let it be known that Ki puts the ISH in fish. \n\nI was visiting Brooklyn for the day with my mother. It was her birthday and we were both craving sushi. Having somewhat solid sushi joints in Long Island, I was hoping to stumble upon a decent lunch spot during my travels. Seeing as Ki was so highly-praised, we had to eat here. \n\nTheir ambiance really separates itself from other sushi restaurants. With the sounds of cascading water and low lighting, I truly felt relaxed. Feng shui just radiates from here. It was decently crowded for a Wednesday lunch but we were lucky enough to get a seat right near the window. Their lunch prices are extremely reasonable considering what they give you for your meal. It was $12 for a chicken teriyaki bento box.\n\nHere's what a $12 lunch includes at Ki:\n-Ridiculously good miso soup\n-Ginger Salad\n-Chicken Teriyaki, White Rice with black sesame, 2 Gyoza, steamed veggies (that included butternut squash. unusually amazing pairing), and a california roll.*\n\nThe food looks so artfully prepared. You can tell it was made with precision, care and only the freshest of ingredients. What I appreciated most was the amount of fish to rice ratio. And that they give you 8 pieces instead of 6. Many places skimp on the fish but not Ki. I was not only thoroughly impressed with that but also on the aesthetics on the plating! If you're a big green tea drinker like me... there's unlimited re-fills. Huzzah!\n\nKi, you have now climbed your way to the top of my list of \"favorite sushi places\". \n\n*If you'd like you can substitute your california roll with another for an additional charge. I was craving the philly roll and it only cost $2 extra. Don't be afraid to ask!!", "author": "Katie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "All I can say is WOW! \n\nLooked up a sushi restaurant in Brooklyn and this one came up! So glad I went in for sushi.\n\nOrdered the tuna avocado, spicy salmon and dragon rolls. They were all delicious. The fish was so fresh and I was so glad to see that they did not overpower the rolls with spicy sauce.\n\nIf you're in Brooklyn, you should check them out!", "author": "Karen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "Please please PLEASE try the lobster tuna roll from this place at least once. \n\nThe spring green wasabi sauce it rests on is like a perfect cushion to the roll, creamy and not overwhelmingly spicy (save that sauce to dip the rest of your sushi in later!!!). The lobster inside is delicately flavored and contrasts beautifully with the succulent, buttery tuna wrapped around it. And it's all topped with black, gorgeously glistening caviar.  It's seriously a dreamy, foodgasmic roll!\n\nThis place rocks. I've been here twice now just to make sure the food and service was consistent.  \n\nOverall, I would definitely recommend this place to anyone who enjoys fresh fish,and intimate ambiance.", "author": "Chasadie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "Stop. Staaawp. Hot towels to wash your hands before you eat? Am I on an international flight? I've never been offered at a hot towel at dinner before... I mean, I still had to wash my hands since I'm weird like that, but in all seriousness, what a special touch!\n\nMy friend and I came here for dinner around 8:00p on a Wednesday night and this place was busy. There were multiple people waiting for tables, and it took us a while to get seated- no problem because the sushi was well worth it!\n\nFor a glass of wine, salad, miso soup, and a pink lady roll my total was about $35 (not including tip). Is this what it's like to be an adult? Haha\n\nThe wine was served in a chilled glass, which was a nice touch, but what got me was the salad! I am a sucker for a good ginger dressing, and this ginger dressing was DELCIOUS! The miso soup was okay... I wouldn't get it again :/ \n\nThe sushi roll (Pink Lady) speaks volumes for itself- just look at the photo! The salmon was sliced very thin and the tuna melted in your mouth. The roll had to be one of the best rolls I have had in a very long time. I can imagine the sashimi at this place to be very high quality. No wonder Ki was so busy because the sushi is so freaking good! If asked, we would have stayed for dessert and another glass of wine, but no problem- it just means I have something to look forward too next time", "author": "Karen F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "Freshest sushi I've had in New York (well, that I can afford anyway). My favorite is the TNT roll, and all the different rolls my boyfriend has gotten have all been delicious too. Pretty excellent date spot.", "author": "Adriana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-13", "description": "Went to Ki Sushi on a busy Friday night and expected a wait. We put in our name and were told 30 mins, so we decided to head out for drinks while we waited. We had barely made it down the block when Ki sushi called us back and said they could seat us at the sushi bar. The service was excellent, the sushi was superb, the prices are very reasonable for the atea. 5/5!!\n\nHighly recommend the shishito peppers or maguro avocado as appetizers and dynamite roll or fashion roll for sushi.", "author": "Lucie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-09", "description": "Best sushi in Brooklyn highly recommend!! The service is on point, decor and quality of fish is excellent.", "author": "Lana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "This is one of the best sushi places I have been. Everything is on point. Started with garlic broccoli and peer shrimp. Amazing. Service is fast and presentation is great. Servers are very attentive and I recommend the Chefs selection of sushi or sashimi for main course. It is something to write home about right in the heart of Brooklyn.", "author": "Troy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-25", "description": "3.5 stars- Incredibly tasty sushi but wasn't as blown away as I thought I'd be. Maybe I just ordered the wrong stuff. \n\nAnywho, came solo for an early weeknight dinner and walked into what truly felt like an *oasis.* Really. There's a fountain near the entrance and everyone inside is so calm. \n\nI ordered the hamachi tartare and the yellowtail tartare. Yes, I couldn't decide which version of the fish I wanted so I ordered both. It was that kind of day. I was expecting more from the hamachi because, well, you're dealing with some awesome fish potential here. But it was just a bit bland. The yellowtail was also slightly lacking. \n\nBut the sushi rolls were outstanding. I'm coming back to try more specialty rolls the next chance I get. \n\nOverall, Ki sushi is a welcome addition to the Smith street dining scene and a much-needed quality sushi restaurant!", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "I decided to give this place a try since my friend highly recommended it. Let's start off with the service. The service was good. They made sure your glass of water is never empty. Also, they put lemon in it without you asking for it. I got the age tofu and it was delicious. The tofu came in cube size where you dip it into the sauce. It was also hot and crispy. The seafood dynamite was full of flavors. The sauce was a good combination with the large portion of seafood. The duck breast was decliciois. It was tender and juicy. The rib eye steak was decliciois. It was cooked more toward medium well. If you're not a fan of it than you should suggest medium rare. Now, let's take about the sushi!! We got the omakase for two and the sushi and sashimi Deluxe. The fish was really fresh. I enjoyed every bite. I also got the pikachu roll since it was interesting. The tuna, salmon and yellowtail made a great combination for this roll. I'll definitely come back. Service and food were awesome for both times we went back", "author": "Cristina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-07", "description": "Ki is my current vote for best sushi in Brooklyn. I've been here for both a tranquil weekday lunch and a group dinner amid a more energetic (and packed) dining room. Considering the quality of the fish and other ingredients and the beautiful presentation, the two roll combo lunch special is a steal here compared to that of the standard issue sushi places that fill this borough. The miso soup is a piping hot generous portion, with a rich mouthfeel, sprinkled with Einoki mushrooms, fresh tofu, seaweed, and scallions, and the salad, topped with a vibrant homemade ginger dressing, was made with fresh greens rather than the typical iceberg. My friend and I really enjoyed the salmon and spicy tuna rolls. The chef even accommodated my friend's three (arguably price-altering) alterations/additions to her sushi rolls for no additional charge.\n\nFor dinner, I sampled some of the crispy, pan-fried Gyoza as well as a beautiful array of Nigiri, my favorites of which were the Salmon, Arctic Char, Yellowtail, and Spanish Mackerel. My more adventurous friends really enjoyed the Uni and fatty tuna.  I also experienced the signature Ki roll, which, consisting of generous amounts of tuna, salmon, and yellowtail, topped with spicy, crunchy king crab, avocado, and caviar in the color combination made famous in the Stendhal novel, and finished off with a gold leaf, resembles a gifted jewel box filled with treasures from the sea.", "author": "Lisa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "First time here and ordered omakase here. It was great! The fish was so fresh. Made me feel like it was the first time eating sushi. Also had a special roll called the Ki roll, I believe, it was also great. The atmosphere was relaxing. Service was great. Explain what each fish was. \nSecond time decided to order sashimi deluxe and it wasn't as impressive as the omakase. Still fresh though. Also had spicy seafood. They did not go cheap with the variety and it was the right level of spicyness. And again fresh!", "author": "Meyliani J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-18", "description": "Ki Sushi\nNY Brooklyn Cobble Hill\n1pm 18th May 2015\nFive Stars\n\nI was craving a bento box for lunch and decided to check out Ki Sushi. The place is a bit too warm and pretty dimly lit so I thinking a romantic dinner would be more suitable time to come here. The wait staff was quick and efficient. Ice water with lemon was placed on the table without asking. The waiter unsheathed my chopsticks for me. I ordered the lunch box with chicken teriyaki ($13). First course: \nMixed green salad with classic ginger type dressing and a single grape tomato. Second course was a light Miso soup with bits of honshemeji mushrooms. It had a nice flavor without being over salty. Third course: Bento Box: A) two freshly fried gyoza (it was already sauced so I would recommend eating them before they get soggy). They were crispy outside and juicy inside. B) 8 pieces of California Roll. The rice was bit under cooked but had a slight vinegar bite. They use very little Krab meat but whole lot of Avocado which is way better than the other way. C) chicken breast, Japanese squash, Zucchini and broccoli smothered in mildly sweet teriyaki sauce. The chicken varied in size but was moist throughout - a fete for breast meat. The squash added a nice filling element. The broccoli was perfect but the zucchini was overcooked. D) perfectly cooked plain white rice. \n\nEverything was delicious and I was able to get in and out in less than 30 minutes. \n\nI will return for dinner and actual sushi.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "Walked in on a Monday night and we were seated immediately. This restaurant is dimly lit giving an intimate feeling. Great date night spot. The waiter recommended the Omakase for the both of us and I'm glad we listened to him. For two people, the Omakase costs $58 and it comes with 8 pcs of sushi for each person. I must say, it is so worth it. We start off with the TNT truffle and it was delicious. The omakase comes with Blue Fin Fatty tuna, Fluke, Japanese Butter fish, Japanese Mackerel, Sea Urchin, Striped jack yellowtail, Horse Mackerel and the Striped Bass. Every piece of sushi was very fresh. I would definitely return and try the rolls.", "author": "Ellen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-26", "description": "You guys, Ki is where it's at.\n\nI'm done paying $100+ for an omakase unless it's my last meal on Earth. Especially when Ki has an omakase for TWO for $58, which is incredible value. Still thinking about the fatty tuna. But I actually think the sushi rolls are where Ki shines. I'll get to that later.\n\nRewinding a bit -- the reason we came to Ki is because I've had it bookmarked for ages. It seemed like a casual but delicious Japanese restaurant that would not cost us an arm and a leg. We had a promotion to celebrate, so we decided to feast.\n\nThe restaurant was packed, but fortunately for us, the sushi bar was completely empty. We got two seats there and ordered a bunch of things, including...\n\n+ TNT truffle ($16) as an appetizer. Chopped blue fin toro with caviar, scallions, and tuna? Oh YES this was good.\n\n+ Ki omakase for two ($58). We were deciding between the regular and more expensive supreme omakase (where they air-ship fish from Tsukiji, apparently!) but decided to go the cheaper route. Let's be clear: This wasn't the best or freshest omakase of all time, but it's good and hits the spot at a fraction of the price I'm used to, so I will still recommend it.\n\n+ Special rolls: Fancy Roll ($17) with sea urchin and eel is the best roll of MA LIFE. Passion roll ($16) has spicy crunchy scallop with mango, seared salmon, avocado -- good but less unique than the Fancy roll.\n\n+ Uni from the a la carte menu (again, not the best I've had, but hits the spot! Do you sense a recurring theme here?)\n\n+ Lime and ginger creme brulee -- wonderful way to cap off the meal. Loved the chewy ginger candies on top!\n\nAlso, service was excellent. Everyone from our waiter to the hostess and sushi chefs were incredibly helpful and nice. \n\nOverall, come here if you're looking for good sushi in a casual, fun setting. If you want the best, most ornate omakase, look elsewhere. I love Ki's special rolls and wouldn't mind just sticking with those next time.", "author": "Valerie L."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}