{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-26", "description": "The food is normal. The ki roll looks pretty, but taste just ok nothing special. Dislike the soba: the soup taste like just have the seasoning pack from the quick ramen noddle bag; the soba is the way too soft.", "author": "Fang H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-23", "description": "If you love sushi/sashimi and want to experience it way beyond the ordinary, try the Omikase sushi or sashimi.  Incredible fish served as fresh as possible and a fine size portion cut perfectly.  \n\nA cooked entre :black cod, was judged to be as good as fish gets in a restaurant.  \n\nWe had a fine experience", "author": "Gary A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-14", "description": "Sushi wasn't what I thought of when going to Brooklyn...but this place surprised me.\n\nFantastic Roll and Spicy girl were def good. Sushi is fresh and I loved that the rolls had a good amount of fish in them and not over powered by rice.", "author": "Marcus Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-30", "description": "Best sushi ever.  All the rolls we had were amazing, but I think the best thing I ate was the warm mushroom salad.  Sounds weird, but it's out of this world.  I love this place.", "author": "Emily D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-02", "description": "Five stars because Brooklyn finally gets a sushi win. R.I.P. Rockin' Sake. I will continue to mourn your loss, but at least Ki Sushi is around to help me through this difficult time.  I have not found anything quite as comforting as enjoying a few glasses of Asahi and a Spicy Girl or Foxy Lady roll.  I have dined here on more than one occasion and have not been disappointed.  I also must comment on the sconces.  I imagine the decorating conversation went something like this:\nDecorator 1: Ok tiles check, and for lighting accessories we can just throw in some sconces...\nDecorator 2 aka Sconce/Lighting Genius:  Wait! Just hear me out on this one.  What if, and this is an amazing what if by the way, we rip out  parts of the wall and throw candles in them.\nDecorator 1: ...my god...it would be the anti-sconce.\nOn a more food related note there is a must try banana spring roll dessert that adds a lovely ending to the meal.  I almost never have dessert at Japanese restaurants as they usually disappoint, but Ki is the exception.", "author": "Kasey B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-16", "description": "What a gem.. I lived nearby for 3 years and never went in. You can't easily see inside but apparently it gets packed on a Tuesday night. Whats awesome? The wait staff is super attentive. They noticed our table wobbling and fixed it without us even asking. At just right the moments they refilled my water or asked if everything was ok.. and the food was delicious. It's a few dollars more than some other sushi places but still very reasonable.", "author": "Adam S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-18", "description": "The atmosphere was very nice and the fish was good or great. If you like talking to your sushi chef this is the perfect place.\n\nI would rate the following sushi pieces I ate as follows:\n\n4 stars - Red Clam, Big Eye Tuna, Arctic Char, Pacific Mackerel\n5 stars - Japanese white salmon, Hamachi tuna\n\nI'm sure it changes every day , but overall the fish quality was very good. I would definitely eat here again.", "author": "John L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-18", "description": "Outstanding sushi! Very reasonably priced as well - especially for New York. I started with the salmon skin salad with jalapeno salad - I couldn't believe how much salmon skin was on a salad for $6! Plus it was delicious... I split the sushi/sashimi pre-set meal and everything on it was top notch - fresh and high quality. We decided to get another roll and decided on the Spicy Girl Roll - it was HUGE. It also came out in like 2 seconds. The service was fast - next time I want to sit at the sushi bar because the sushi chefs looked like they were having fun.\n\nOne recommendation - get dessert! The chocolate banana spring roll is super good and not too heavy so it won't leaving you feeling gross - just fat and happy! I will be making this a weekly spot for sure. We had a ton of food (no drinks) but our bill was only $70 (2 salads, soup, sushi platter, a $15 roll and a dessert - not too shabby).", "author": "Jammy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-02", "description": "Return - Yes, I think its better sushi than Hibino but my wife likes the latter better\nAtmosphere (3-) - Std no frills sushi ambiance - could use a refresh, a little dated/drab\nService (3) - Friendly, attentive\nFood (3/4) - seaweed salad (3), miso soup (3), salmon roll (3+), teriyaki chicken (3+), sushi regular (3+)\nDrink - $6 draft, $9 white wine\nCost - $62 w/ wine + beer before tax + tip", "author": "Will S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-04", "description": "To give this place a rating less than 5 stars means you must be a sushi chef or you've never had sushi.  While it is pricey, it's worth it.  You can go down the block and get \"Sushi:  50% off\" but that would be a mistake.  Ante up and pay the extra $ for good sushi.  I highly recommend their shumai, Volcano roll, and Pikachu roll.  Service is excellent also.", "author": "JT P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-29", "description": "Disclaimer: I am a sushi snob.  I have been fortunate enough to eat at some of the most renowned sushi establishments both here and abroad and, as such, my standards for sushi and sashimi are pretty damn high.\n\nThat said, Ki Sushi is the best sushi joint in Brooklyn, and in the Top 5 for the New York Metro-area.  It just edges out Blue Ribbon for the Brooklyn title, and is up there with Soto and Sasabune when your scope is widened to the 5 boroughs.\n\nKi shines in both Dine-In and Take-Out--but you need to approach the place very differently depending on which experience you choose.\n\nDine-In: I'd recommend the higher-end Omakase.  The fish is consistently fresh and diverse, and freshly grated wasabi is just perfect.\n\nTake-Out: Do the ordinary rolls and pieces thing, and keep it pretty standard.  You'd be hard pressed to find a place that does these basics any better.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-06", "description": "This place was great. It really met all my expectations. And I was really pleased with the bill at the end. I was really expecting a bigger hit to my cash flow, but that wasn't the case. \n\nI went there with my cousin. She had the edamame app and some kind of seafood soup. I snaked on the edamame with her and really enjoyed it. She loved both of her apps only saying that she wished the soup had a bit more flavor. I reminded her that she forgot to add soy sauce! I had the garlic scallops with mango relish. It tasted great, but had a few downfalls: 1- only two scallops (cooked to perfection), 2- I had a wee bit of shell in one of my bites and 3- the salsa was chopped too finely, I could barely get any on my chopstick!!! Being the mango fiend that I am resorted to pick up a few bites of my salsa with my fingers. Either way, I would try it again. \n\nFor our entree my cousin got the California roll. She said it was good. I got the Ki roll and I recommend EVERYONE try that at lease once. It was grreeeeaaattttt!!! I was satisfied after 4 pieces, but made myself finish it all. \n\nWe decided we may as well go for desert and both went with the ginger lime brulee. It was tasty... BUT not quite firm enough and the sugar was not as hard as it should have been on top. The candied ginger made up for what it lacked in texture in my opinion. If I ever order it again (which I probably will) I will just ask they bake it until firm! \n\nOh, I also tried sake for the first time. Wasn't pleased with not getting a buzz, but I did dig the flavor! \n\nI will definitely go back here!!!  I love being able to sit somewhere and have great food and atmosphere while wearing jeans!!", "author": "Tenine M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-28", "description": "Would definitely go back.  Nice atmosphere, good service.  The spicy tuna role was good, but not fantastic.  But the Volcano roll was delicious!  As was our shrimp tempura app.  Can't wait to go back!", "author": "Meredith K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-09", "description": "Best sushi lunch in Brooklyn. Why? Because for $11 you get quality miso soup, standard but tasty ginger dressing salad, 5 pieces of fresh sushi, cali roll (for $2 I always upgrade to spicy tuna) and if you're lucky, sometimes you'll get pieces that you never expected would appear on any $11 lunch special platter (e.g. chutoro, aji).  On those days where I get the aforementioned pleasantly atypical pieces, I tend to inadvertantly blurt out \"No freakin' way!\" like when I did after getting a Nintendo for my 6th birthday despite the fact that my parents said they would never ever ever get me a video game system because it rots your brain. Hmm.. in a random kinda mood today", "author": "andrew c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-13", "description": "The wild mushroom salad was crazy!!! My while meal could have consisted of 2-3 plates of that and I could die a happy lady. Meanwhile the sushi and sashimi was super fresh and the texture was great. The unfiltered sake made me want to drink sake and this is coming from someone who swore off sake from a very bad experience. Anyways, this place was worth the trek to BK!! Coming back again!", "author": "Siwei L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-24", "description": "I almost wanted to give it a 2-star... my pseudo girlfriend convinced me to go 1.  And she's right... this place is bad. We started off strong... steamed veggie gyoza... good... not great but good. Then came the forgettable tea and flat watered down coke... definitely shoulda gotten a beer but the hangover had me doubting. Anywho, the rolls came... it was as if they messed them up. Flavors were clashing and it seemed ingredients missing. How does a shrimp tempura roll with spicy tuna and eel sauce \u0026 spicy mayo not taste good? Beats me. The tempura tuna roll was plain horrible.  Oh then the bill came and the guy charged me for two cokes.  I get the no free refills thing when we are talking about bottles or cans, and even at nicer spots when we are talking about fountain sodas, but don't come over to the table and ask if I want a refill then bring my glass with remnant ice over to the soda gun, fill it up without putting in fresh ice, and then charge me again when I don't touch the drink... that is just rude... and 4 out of 5 times that is coming straight out of your tip... think servers and you will make more money.  Would I ever go back?  Nope.  Did I tell people outside on the street to not go in?  You bet I did.", "author": "Kevin O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-01", "description": "Went there for a friend's birthday party.  My boyfriend and I split a toro taretare appetizer which was amazing and probably my favorite part of the meal.  The toro in it was cool, meaty, smooth, and delicious.  Then, charmed by the name, for my entre, I ordered the Pikachu roll.  There were a couple different kinds of fish in it, the bites were huge, and I loved the fact they used shrimp tempura for pickahu's ears.  It was tasty but I would say $16 was a bit high for the pikachu roll.", "author": "RoRo C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-27", "description": "heard such  good things but I got food poisoning from their sashimi.\n\nwill never go back\n\n-wish there was a 0 stars option", "author": "Jack S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-21", "description": "Ok so my girlfriend and I got a chance to visit this Sushi establishment and it was quite amazing from the very start from the time you walk into the place the ambiance is quite cozy. It's quiet and very intimate.... It's dim almost dark ambiance will ignite a fire and is guaranteed to set any mood! The atmosphere was very smooth and sultry and place appeared to be very clean. While the customer service was off the charts! I myself marveled in amazement as I watched the waiters and waitresses beckon to my every whim and were very attentive to the needs of myself and my lady! We indulged in the Spicy Salmon which was absolutely tantalizing and concluded with the Salmon Teriyaki which tasted out of this world! Anyone looking for great sushi,great atmosphere and wonderful customer service then I truly reccomend Ki Sushi be your destination", "author": "Jason W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-18", "description": "Best place to get sushi in Brooklyn.  Classic sushi dishes.  The kitchen items are good as well.  Sushi deluxe is wonderful.  Sushi a la carte is great too.  Very fresh fish.", "author": "L C."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}