{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-30", "description": "Solid, but not spectacular last couple of times I've been.", "author": "Julia R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-22", "description": "The hype here might be because it's dark inside (feels like a lounge, probably to hide the grease and dirt) and that there aren't a lot of Japanese restaurants to choose from in the area. The sushi here is below average. \n\nWe made reservation for a birthday dinner and they made us wait an hour before seating us. Their reservation is a total sack of bull-s__t. They don't honor it. It was Friday night and we thought we were being smart by reserving a table. It didn't matter, people who walked in behind us got the same wait. They smile and say just a few more minutes...an hour later.\n\nThe food is not worth the wait and it's not authentic Japanese, as well. Never again!", "author": "Gee B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-13", "description": "I have not been to many sushi restaurants but the service, portions and ambiance alone were 5  star worthy. The outside is rather unassuming but when you enter you see a nice ambiance. It is dimly lit without being dark which I hate at some places. All the staff was very friendly and professional with even the chef greeting hello as we walked nearby but far enough away to just ignore us. \n\nWe started out with the trout fish cakes which were really great and fresh tasting. Then we shared 2 entrees, steam Chilean sea bass with a salad and the passion roll. The waiter asked us if we would like to share everything which we did so it's nice he beat us to asking for extra plates.\n\nEverything was well timed and each dish really refreshing. The sea bass had a nice sauce to it and really let the natural flavor come out without being fishy. The sushi had a nice mix of flavors including mango, caviar and like a flavored mayo on top. It just went really well together.\n\nI was so jealous of a couple nearby though because of their sushi for 2 meal. So much great looking sushi. I will come back again for that meal alone.", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-23", "description": "GREAT service, nice atmosphere, but just decent sushi. We came on a tuesday night and as you'd expect we got seated right away.", "author": "Noor T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "Excellent food, reminds me of the sushi i had in japan. Have both authentic classic sushi as well as contemporary modern fusion sushi. Two thumbs up for these excellent food. Try their lobster tuna roll. I have the ki special for one, they were very good too. Heck, even their tempura ice cream deserves an award.", "author": "Shawn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "The sushi is absolutely AMAZING. \n  I often come in for the lunch special. The rolls are always so fresh ! They practically melt in your mouth. Best sushi I have had in Brooklyn so far. \n\nAtmosphere is warm and staff is friendly. \n\nI am looking forward to come in and explore their dinner menu.", "author": "Lauren A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-06", "description": "Great, fresh sushi at reasonable prices...I could stop here but I won't.  \n\nAs I sat waiting for my friend to arrive, I enjoyed the quiet, dimly lit interior and day dreamed while I watched whole fresh fish be carried into the kitchen.  I thought that was an excellent sign of things to come, and I was right.  \n\nMy friend and I both got the lunch specials: 2 rolls, miso soup and salad for $13.  The salad wasn't the typical iceberg lettuce fest--this was an actual mix of baby greens!  The miso soup was tasty, and my salmon and eel rolls were great.  We also got green tea but it didn't show up on our bill for whatever reason, score!   \n\nThe staff was very attentive and kept our water glasses and tea cups full, and I look forward to trying more items from their menu.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "Great sushi, the fish is fresh and clean and high quality, the roll variety is expansive and the appetizers are delicious.  definitely try the garlic-broccoli-pine nut appetizer, it is out of this world.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-12", "description": "Can't go wrong with this place for lunch! Quick service coupled with delicious and plentiful food! The sushi special for lunch comes with salad and soup and two rolls for $12. Though I can shave $2 off that price at Yamato in Park Slope, the quality is on par and ultimately worth it! \n\nFYI, the salmon skin rolls here are out of the world! Not sure what their secret is but OMG.\n\nAlso, they open at 12:30 for lunch... sometimes a few minutes earlier, but the first time I arrived at like 12:15 and had to wait a few minutes for them to open... obviously worth it!", "author": "Sam A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-20", "description": "Good sushi. A little bit on the pricy side but hey, you're in Boerum Hill. Had the omakase. It was your garden variety of sushi and sashimi but it was good quality.", "author": "G C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-09", "description": "This is my favorite sushi place in Brooklyn!\nThe fish is always super fresh and tasty. The prices are very reasonable. \nThe miso soup here is extra flavorful, and the special rolls are beautifully done. What makes it all even better is the Smith St. location, nearby are several great bars to get a drink after dinner.\n\nIn short: I don't understand how the totally inferior sushi place across the street even stays in business.", "author": "Tina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-26", "description": "This is by far the best sushi in the neighborhood.  I typically order the omakase, which is absolutely delicious.  If you're hungry, do the sashimi omakase.  Very fresh fish, cut well, and nicely presented.  \n\nFour stars instead of five is only because I've been spoiled by Sasabune.", "author": "Phil S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "The best sushi I've had in a long time! We ventured out to Cobble Hill because we had heard so many good things about Ki Sushi, and it did not disappoint! We tried the Volcano Roll, Ki Roll, and two smaller rolls and all of it was DELICIOUS!! The Ki Roll melted in my mouth, great combination of Fish \u0026 King Crab. The Volcano roll was also yummy and the sweet shrimp was surprisingly tasty. \n\nThe ambiance was great - a good crowd, dimly lit with nice decor. The service was wonderful. The waited took time to answer some of questions and made great recommendations. The prices are a bit steep, but well worth it. I would HIGHLY recommend this place.", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-08", "description": "TNT truffle: out of this world!!!!!\nthis place is amazing! I'm never disappointed every time I go there! in my top 5 of my best sushi place!", "author": "Anne S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-25", "description": "Very nice people here. Food's great.  The Spring Jamie Roll is to DIE for.  Reasonably priced food and drinks.  Would recommend highly.  We've been eating here about once a week since we moved to the neighborhood a few months ago.", "author": "Briant L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-19", "description": "Very impressed with this place. They were right on the ball with service and quality of food. The ambiance is really nice; it would be good for a first date or a catch up with a friend. A step above your average looking sushi joint.\n\nThe sashimi was very good and the chef cut the pieces the right size...none of those 1/2 lb pieces that are impossible to eat in one or two bites. The Sashimi Delux platter had 18 pieces of a unique variety of fishes (I believe around $28). We also had three roll, which were pretty massive. The Fantastic Roll was, well, fantastic.\n\nBe warned the portions are quite large, especially sides such as edamame and some of the veggies, so order accordingly. The prices might be a few $ more than some other places on Smith St, but you're really get a significant amount of food that is super delicious, and nice atmosphere", "author": "Juju J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-23", "description": "Surprisingly, it's not overhyped.  The sushi really is THAT good.  The mushroom salad appetizer, was also delicious; the decor is alluring--dark but inviting, with a cool-looking fountain and fake flowers--and the service friendly and helpful--the waitress gave me a roll suggestion that did not disappoint.  But the star of the show is the sushi.  The fish is that fresh, melt-in-your-mouth quality.  The salmon and avocado roll was one of the best I've had anywhere.\n\nTwo bottles of beer each, four generous special rolls, a large appetizer, tax and 20% tip for south of $100 in NYC = a trek to Brooklyn that's totally worth it.  Can't wait to come back!", "author": "Adam M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-13", "description": "Five star quality and presentation.  I was impressed with the fast food service and amazing staffs.  The place is cozy, romantic and clean.  We ordered mostly appetizers and each dish is amazing.  You can not find any more fresher fishes and the taste was stunning...  \n\nI will recommend this place to all my friends and looking forward to go back really soon...", "author": "Pearl C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-06", "description": "Walked by this place a thousand times, but only came in here after a few drinks at Sample.  The food was pretty decent, but too expensive for my liking.  I think it is a little outrageous to  price spicy tuna at around $7.  Although it came with eight pieces and the roll melted in my mouth.  My leftover rolls were even good the next day.  The rice wasn't hard and the fish was not inedible.  I got the $20 maki combo.  Again, pricey, but it came with a miso soup and I had enough for lunch the next day.\n\nMy buddy's salmon was on the money.  The cooked fish was nicely cooked, not overly done where it would be dry, and not too raw where the it would lack substance.  Loved the sauce!\n\nMy appetizer, the toro tartare was spectacular.  The thickness of the wasabi soy  sauce made the entire so rich. \n\nAbove all the service was commendable.  Everyone was attentive, but I hope it was not because they were not too busy at 10pm.  Our waiter even ran out after me to hand me my doggy bag when I walked out without it.  I call that dedication.", "author": "Jess M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-13", "description": "I want to update because people are getting the wrong idea about me giving it 4 stars. No it is in no way what so ever worth a trip from Manhattan or Queens. It is just that for Brooklyn which has substandard sushi it is better than most others. But no fresh Uni from California or Japan just regular cuts of fish that you get anywhere. But the fish is fresh.  It is clean unlike Osaka. http://www.osakany.com/\nWhich I have yet to review. By just looking at the menu for MoMo sushi shack  totally fuggazzi. But Ki at least has fresh fish and it is clean! \nMost Brooklyn reviewers really know nothing about sushi from what I have seen though not all. I need to update this so I can even out the star ratings as I have gotten so many messages from people just looking at the stars and not the review. The 5 star rating system is not useful funny or cool! Ki though is better than most I have been to in Brooklyn or Queens. \nHere is my NY sushi list-http://www.yelp.com/list/nyc-sushi-new-york-2\nMy NY Japanese list-http://www.yelp.com/list/japanese-restaurants-in-nyc-new-york\nand my nation wide Japanese list-http://www.yelp.com/list/my-nation-wide-japanese-list-new-york", "author": "Pinky And The B."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}