{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-28", "description": "Good specialty rolls; slightly pricier than other offerings in the area but also slightly better. Bonus: the decor isn't cheesy and the saki selection is great.", "author": "Erin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-19", "description": "Very accommodating and quick service. I came here for lunch today and inquired on if they had any rolls without rice. The server suggested the roll lunch special and my two rolls could be done as hand rolls without rice. I opted for the shrimp avocado and the eel avocado hand rolls and both were quite generous in fillings and delicious. The lunch special also came with both a soup and salad and I was actually quite full at the end of my meal. Great place in the neighborhood for sushi and I will definitely be back.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-24", "description": "Very good and very fresh sushi with attentive service. The basics here are excellent and the special roles are well crafted, as well. I highly recommend trying the Ki roll. Tried the peach roll, but it was canned peaches and just didn't jive well. All in all, a spot I would come back to and would recommend to all of you.", "author": "Elveera K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-10", "description": "Ki sushi is Brooklyn's hidden gem! This is by far the best sushi restaurant in the area. The fish was very fresh and the rolls are absolutely delicious. I would recommend the magura avocado, TNT truffle, Spicy girl roll, fantastic roll. All of the salmon, tuna, whitefish there is amazingly fresh. The waitstaff can be a little rude at times but the ambiance is very calming. Be sure to make reservations for a Saturday night!", "author": "Elina A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-22", "description": "If you want tasty yet exquisite Japanese food for reasonable prices, this is the place to go. The staff were friendly and helpful, but food did take awhile since it was a full house with lines at the restaurant. My friend made a reservation, but we ended a little late and still got seated relatively quickly for a Friday night. The meal started off with the rock shrimp tempura (one of my favorites; loved the spicy dressing) and eggplant miso. We ended up getting a variety of rolls (Pikachu, Dragon, Seared Salmon, Foxy Lady, Fantastic and Ki) but the best one has to be the fantastic roll.", "author": "Anna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-15", "description": "Having lived in Japan, I'm very picky when it comes to Japanese food, especially sushi and sashimi. But I was curious after reading the reviews of Ki Sushi on Yelp and decided to dine here last week. \n\nWe ordered tamago (omelet) and inari (tofu skin) sushi, Spicy Girl roll (spicy salmon, tuna, something I can't remember but yummy, and tempura flakes), and eel+avocado sushi. Oh boy, everything was delicious! Some of the best I've ever tasted, divine! I didn't stop eating after the first bite that I forgot to take pictures of the food :p *more reasons to eat here again, no? \n\nKi Sushi has definitely become a favorite place to eat in Brooklyn. Our waitresses were very attentive. I can't wait to go there again and try other stuff from the menu. :)", "author": "Tia K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-16", "description": "I've just had lunch here for the third time in three days, and it is so delicious. The fish is fresh, the broiled cod is top notch, and I really enjoyed the salmon skin salad.  I can't wait to continue exploring their menu. Oh, and try the Fantastic Roll. It lives up to the name.", "author": "Kisha E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-01", "description": "I was here last night with a party of four. Well the hype is worth the price and a shlep to Ki Sushi. I've had the rock shrimp, the lobster roll and spicy seafood soup for appetizer. It was delicious, especially the lobster roll and the soup. After we've ordered random 6 rolls to try and it tasted so fresh that we were all amazed. I didn't like their Ki Roll and Peach Rolls as they were a little bland, but all the other rolls were amazing. Their rolls involve less rice and more fish, which is quite the opposite of most Sushi places you visit in NYC. I truly enjoyed the experience. Spoil yourself once in a while with a gem if a place such as Ki Sushi.", "author": "I I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-29", "description": "Ki makes some of the best rainbow rolls I've ever had. The avocado is perfectly ripe and creamy and contrasts with the finely julienned cucumber, the fresh fish, and the crunchy flying fish roe. Their plain tuna rolls are solid, as are their cucumber rolls. I'm usually a fan of salmon skin rolls but I avoid Ki's version because they're too greasy, the fish usually tastes off, and they have too much sweet sauce on them.  \n\nI get sushi delivered from Ki fairly regularly. The quality is usually top notch, but last night I was disappointed with my order because the tuna tasted excessively fishy and the rolls weren't very well assembled.", "author": "Lindsay B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-16", "description": "Probably one of my favorite sushi restaurants anywhere. Always great fish and service. Wira is my man! A great time everytime", "author": "Jared W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-13", "description": "I'm gonna go ahead and crown Ki the best sushi i've had in Brooklyn....thus far....\n\nTheir specialty Ki roll was AMAZING. And that volcano roll? Same deal. I'll be back, yes, I'll definitely be back.", "author": "Ana B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-04", "description": "Ordered takeout and was very disappointed. Sushi was expensive and the majority of it tasted fishy and gross. And dumplings were cold. Won't be ordering from here again.", "author": "Elena S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-29", "description": "My favorite sushi in all of NY!\n\nI will travel far and wide to go here. I don't live in Cobble Hill and make a point of taking time to get here often.\n\nI always sit at the sushi bar, the chefs are fantastic and the owner always remembers a familiar face. I love that; makes you feel right at home!\n\nWhat can I say...\nA) Nigori. It may be the white Zinfandel of sake, but I love it. Lots of it.\nB) The menu always has something fun and new. You must have an app. Really anything from the cold menu with do. Seriously, anything. Be adventurous, it's worth it.\nC) Down to business. All the rolls are fantastic, but my personal favorite is the Dynamite roll followed by the Spicy girl. And let's not forget about sashimi! Always super fresh and they have the best fatty tuna I've ever had. Consistently!\n\nAbove all, it's just fine quality sushi. And isn't that what we want?? It's a touch on the pricey side, but well worth it. After all, much like wine and, oh lasik, sushi is not something you want to skimp on!", "author": "Dayla P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-22", "description": "Ki on Smith is definitely worth a try.\n\nAfter reading the great reviews for the place, I booked a table for four on a weekday afternoon. I arrived first as the girl and her study buddy Andy were packing up their things somewhere on Court St. The host was really attentive and seated me right away. My party took a little longer than usual as Andy waited for his bf Evan to arrive from the city. The large room was filled with a few sets of ladies gossiping about the weekend's events. \n\nThe lion king roll and tofu appetizer are highly recommended, as is the signature Ki roll - tuna, salmon, yellowtail inside, topped with spicy crunch king crab, avocado, caviar, and gold leaf. I must say that I haven't had a bad dish that was topped off with gold leaf - makes sense though, why put gold on a shotty dish?\n\nGreat service, dim lighting, and a classy atmosphere makes this a great date place. Ki gets five stars for delivering on food and character.", "author": "Will C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-04", "description": "All I know is that everything we ordered either gave me a small \"i'll have what she's having\" foodgasm or was a definitive \"yep! this is fresh fish with rice.\"\n\nPricey, but I do think you get more than at other places, so I don't think it's necessary to order as many rolls. Plus a man with towels comes by and you get to feel like you're in first class for a hot second, though the uncomfortable wooden booth seating brings you back to earth.\n\nWinners of the evening: The seared tuna roll and the dragon roll. Always a winner is the salmon skin, and it's the cheapest thing on the menu.\n\nI didn't love the ambience. I prefer my sushi places small and homey over large and trendy. Maybe cuz they never refilled my water.\n\nnot sure this happens every night, but a (drunk?) woman in a mini dress did fall back out of her stool at the bar onto the floor and tried to play it off as that's how she always gets out of her chair.", "author": "Gabrielle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-23", "description": "Great atmosphere.  Perfect place to sit with a loved one and revel in the beauty of it all, especially your companion.  The sushi is pretty good, way above the quality of the cheap riddled sushi places seen almost on every block, with the same price point.\n\nI think I found my new regular sushi place....", "author": "Donald E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "Awesome place! Relaxing and clean. Friendly stuff except one new girl server( seem rude and unfriendly). Always fresh and alway busy.", "author": "Liubov D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-24", "description": "Mmmm, sushi.\n\nWe had the ki, foxy lady, yellowtail and philadelphia rolls, and all were wonderful. I LOVE that this restaurant serves anago, which is infinitely better than unagi. The only problem is that they are $5/piece for sashimi - that's a bit steep for me.\n\nWe sat at the sushi bar, but looking at the tables it didn't seem cramped and the music wasn't blaring so it was loud, but with conversation. Our server was attentive, but the hostess was pretty cold toward us.. whatevs.", "author": "Katty H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "Had dinner there the other night with my wife, daughter and her boyfriend. Sushi was fresh and delicious and every bit as good as what I'm used to in LA. Service and ambience were excellent. Best sushi I've had in NYC in years. Can't wait until my next trip to Brooklyn to visit my daughter as Ki Sushi will definitely be on my dining list.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-10", "description": "Best Sushi experience of my life.  I think I cried a little it was so good.  My colleague and I went with a chefs choice assortment of nigiri -  complete with Uni for dessert. I'll be back. Frequently.", "author": "Jeremy W."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}