{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-24", "description": "Japanese food is my favorite food.  I have traveled world wide including Japan and I make it a habit to eat in as many Japanese restaurants as I can, so I consider myself a bit of a connoisseur.\n\nI eat at Ki at least once a week and anyone who knows quality sushi  will agree that Ki is at the top of the list.\n\nThe ambience is lovely with fresh-cut flowers always enhancing the Japanese decor.\n\nThe food is served with artistic flair and the waitstaff is friendly and helpful.\n\nFor a special sushi experience, run don't walk to Ki.\nM.R.", "author": "Marcia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-23", "description": "Looking for an outstanding all around great SUSHI experience go to KI Sushi.  I love KI sushi.  I live in the San Diego area where I have  the opportunity to eat some of the country's best sushi.  KI sushi topped my list of best SUSHI.  They have sauces that I have never had before.  Their ability to make hamachi and tuna taste so incredible.  All their fish was so totally fresh!  Their rolls so creative and delicious.  Their willingness to alter rolls to suit allergies.  Their service was attentive and friendly.  Whenever I visit New York, I stop at KI's.  My New York family eats there once a week and has since they opened.  \n \nI can't help but respond to S.T. in his very MEAN, long and drawn out review about Ki sushi.  The review lists rolls that they ate and didn't enjoy with no mention of talking to management or to the server.  I wonder why one would continue ordering if they did not like the food.  A true FOODIE as he thinks he is would have talked to someone about their experience.   And as he said he knew when he walked in.... When one thinks something will be bad, he will create a bad time.  I don't believe a word I read.  Have CONFIDENCE in KI, you will be glad you did!. Can't wait to be in NY again\nme", "author": "t z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-12", "description": "This is one of the best sushi restaurants in the neighborhood.  It is reasonably priced, the service is good, and there is rarely a wait to get a table.  Generally a good dining experience.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-13", "description": "Moved to Brooklyn in January 2011 from CA and have been searching ever since for good sushi in NYC especially in Brooklyn.  This is the place!  I am so happy!   It has nice atmosphere with fresh and tasty sushi with reasonable prices.  It has basic, traditional sushi, and fancy unique selections.  It is best to make reservations.", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-17", "description": "BEST sushi rolls I've ever had.  I had the Ki roll \u0026 the Dynamite roll - the fish was incredibly fresh, it just melted in my mouth.  The spicy sauce on the Dynamite roll was flavorful without being overwhelming, like many spicy sauces often are.  If you like rolls that have more fish, the Ki roll is perfect.  It has salmon, tuna, and yellowfish, and it is topped with king crab.  It is a delicious combination, and this was probably the best sushi roll I've had in my life.\n\nI started with the mushroom soup, which was also excellent.  The broth had so much flavor, with just the right amount of salt.  There were tons of mushrooms in the soup too, definitely worth the $4 (especially because I've never had anything like it).\n\nThe decor is beautiful, although perhaps a bit too dark for my taste.  The service was great -- as soon as I entered the restaurant, I was happily greeted by the hostess as well as the sushi chefs.  My server was pleasant and attentive.\n\nI've been to a couple other Japanese places in the area over the past couple years, and this one definitely stood out!", "author": "Kim P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-18", "description": "I wanted to try this place because the reviews are mostly positive and it's in the 'hood where my girlfriend works. We were there a little early on a Friday evening, probably around 6.30p.\n\nIrritation number one: brainless club music playing, hardly the soundtrack to match the decor - a mellow, pretty room. Neither of us were starving so we opted for a bit of sake, a couple of appetizers, a bit of sushi. Prices were steeper than I expected for the neighborhood. We ordered the yellowtail tartare and age dashi tofu and some a la carte sushi. Having been to numerous upscale Japanese restos, I'm well aware of how much is charged for a precious little serving of tartare  ($29, last time I was at Nobu) but even at $12 it seemed steep, barely a tablespoon of it, and soaked in over-vinegared 'vinaigrette'. Twice as much hamachi sushi would have cost half as much. Verdict: Tartare: very disappointing. The age dashi tofu was nice but what really pissed me off was the server *literally* lifting the plate off the table while a piece remained. When she realized there was food on the plate, she pointed at the last piece as if maybe we didn't know it was there, and waited for one of us to pick it off. She *still* had her hand on the plate, one end lifted, while I was dunking that last piece of tofu in the dashi. We'd hardly been there fifteen minutes and the joint had at the time no more than eight customers (yes, I counted) while four servers leaned against the wall with nothing to do, and she was bringing only a small plate of place of sushi. Even if they were jam-packed and busy, inexcusable. The sushi was good but on the small side, hardly above average as I'd read in other reviews.\n\nThere are far too many other places to try, so I will not return nor would I recommend Ki Sushi.", "author": "S V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-05", "description": "I had a great experience here - service was good and the food was amazing. There was some confusion with my girlfriend's order and so the waiter gave us dessert free of charge - kept us happy.", "author": "Dom O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-14", "description": "The place is amazing! good indoor deco and excellent staff all the way from the door to the kitchen. The service let you know you are at home and the food is amazing, please don't hesitate to stop by.", "author": "Victor T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-19", "description": "Food is always top notch and the sushi always tastes as fresh as can be.  Everything is great, but I'm partial to the pikachu and seared salmon rolls.", "author": "Lou B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-30", "description": "They served me the most perfectly cooked piece of black cod ever. For this I will be forever grateful.", "author": "M O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-06", "description": "Excellent, fresh sushi, inventive rolls, but pricey", "author": "Alan Horatio A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-24", "description": "wow. nothing but good things to say about this place. The sushi was the best i've ever had (order the omakase) and the service was great and friendly.  The atmosphere is cozy, dim and welcoming, which i find hard to come by with japanese places.", "author": "amy w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-19", "description": "well, i finally got to dine in at ki and it was really and truly awesome. \ni instantly forgave them their delivery mishaps of the past. \nthe interior was dim and soothing, the service was snappy and excellent. \nand the food! \noh my. \nwe had gyoza that were absolutely the best of their kind i've ever had and the tuna with avocado appetizer, which was simple cubes of raw tuna with perfectly ripe avocado. perfect!\nwe split the ki sushi omakase for 2 and it was really incredible. beautifully presented, the fish was fresh, flavorful and velvety. there was only one item i did not like in the omakase and it was a strange fish (steelhead, or something like this) with a very fishy and unpleasant taste. no matter, a swig of green tea fixed that wagon. \ni had a really lovely malbec with dinner and for dessert the tempura green tea ice cream was fantastic and a righteous ending to a really great meal. \nfor how good this was, i would have expected their prices to be higher. \nonly bummer is that i don't think they are opened for lunch..at least not on mondays when i went back, itching for more. i'm a ki junkie, halp!", "author": "Amy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-03", "description": "This place has really fresh sushi and wonderful service! It is a bit pricier than some other sushi places in the area but it is definitely worth it!", "author": "Eva G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-21", "description": "I went  here on Saturday night for the 1st time and it will not be the last time I visit.  Upon entering you will notice a very modest decor that is perfect for the site.  The layout of the restaurant is fantastic and the tables are placed close to each other but not so close you feel cramped.  The staff was excellent and friendly and the service was very prompt.  The restaurant was busy and they did an amazing job of keeping the flow going.  The variety and creativity of the rolls was fantastic.  We tried a number of appetizers and sushi rolls and everything was great.  The fish is very fresh and the presentation is wonderful.  Definitely a keeper and I'm looking forward to my next visit.  Tremendous sushi.  I also noticed they had some non sushi items but we went right for the sushi.  Great location as well.  Smith Street is a nice place to stroll on a night out.", "author": "Chris L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-21", "description": "dear ki - please relocate to east williamsburg.  you are the best sushi i have had in ny.  thx.", "author": "Oliver C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-23", "description": "This place is amazing. It was probably the best sushi I've ever had. You can really tell the difference in terms of the quality of fish used at Ki Sushi compared to typical sushi joints. Not only that, but the prices are very reasonable. It isn't overpriced compared to Morimoto or Sushi Yasuda. I had the Ki Roll, which was delicious. I also tried some of my mother's Dynamite Roll, which was just as tasty. Even the salad and soup were great. I would definitely recommend the Ki Roll. The service was also very nice. Nice atmosphere as well. Will definitely be coming back often since I live right around the corner!", "author": "Jasmine W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-23", "description": "Of all the sushi places I've tried in Manhattan and Brooklyn, this is by far my favorite. Great food, nice setting. Overall good experience. $10 for 2 scallops was a little ridiculous but the rest of the meal made up for it. Tried the Ki roll, volcano roll, seared salmon roll, and California roll and all of them were delicious. Prices were decent and staff was friendly upon entry and exit.", "author": "Brandon B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-05", "description": "To me, it seems as Ki is a Manhattan sushi restaurant transplanted in Brooklyn...swank interior, full menu plus specials, hip Smith Street. I know some neighborhood places have this \"take out\" look and menu to it but not here. This would be the start or end to a cool evening.", "author": "Michael A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-25", "description": "Coming from San Francisco and having been in Brooklyn for almost 2 weeks now for work, my lunch options limited to soup and sandwich places, chain restaurants, hamburger and fries places around the Metrotech Center buildings. Figuring that there must be better places in Brooklyn, I used my lunch break to walk half a mile to Ki Sushi after a quick glance at its rating on my Yelp app. And I was disappointed. Located on Smith street and surrounded by plenty of other dining options, Ki Sushi is still a gem. When I go to a Japanese restaurant, I tend to pay attention to the little details from the quality of miso soup, the tofu and the wakame in the soup, to the rice and the soy sauce on the table. These details, while are often overlooked, help me detect if the place is cutting corner. No Japanese restaurant that can be good without ensuring the quality of the very ingredients that are the foundations of the cuisine itself. I gladly report that Ki Sushi passed my test. The miso was flavorful with lots of tiny silky tofu cubes. They use short grain Japanese rice which was cooked perfectly to give you the right level of stickiness. Since it was to-go lunch, I just ordered a salmon teriyaki lunch box that also came with salad, california roll and 2 pieces of gyoza. I was happy camper the second I opened the brown bag. My lunch box was perfectly packed with soup and salad on the side. They even gave you the little dish to mix soy sauce and wasabi. The portion was generous and delicious. $12 for a lunch box. It couldn't get any better at that price. Ki Sushi definitely made a great first impression with me. I'd love to go back, probably for dinner so I can try their sushi and other items on the menu. What a solid place!", "author": "Linh M."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}