{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-30", "description": "Ki Sushi is very quickly becoming a Friday Night ritual for me. After an hour of burning down the road at Brooklyn Bodyburn, we head down the road to Ki to sabotage all of our hard work.\n\nAny of their rolls or apps with truffle will make you weak in the knees (Side note: This is coming from someone who thinks truffle is overhyped and a buzzword for foodie amateurs). The Peach roll is fresh, clean and delicious- the mushroom soup is a perfect starter for a cold night.\n\nIf you find yourself wandering Smith St in Cobble Hill stop by for what I consider the best sushi NYC has to offer!", "author": "Meg H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "In a city filled with cheap 50% off sushi joints, Ki is my shining star. I have eaten here a billion times, and each time is better than the last. Good quality. Great atmosphere. Excellent staff.", "author": "Jackie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "Wow is the word. I love food and this place hit the spot can't discribe  how amazing this place is . You won't be disappointed", "author": "Elliot I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-26", "description": "Great ambiance and a much bigger space than I was anticipating based on the images on yelp.  \n\nMy favorite rolls here were the eel naruto rolls, the peach roll was interesting (my boyfriend loved it) and the dragon roll was exactly what I was expecting.  The sea bass was really great, but the miso broth and veggies that came with it were delicious.\n\nHope to come back again!", "author": "Rhonda W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-09", "description": "Can't believe I was at the same place as these other reviewers - overall was just ok - tuna w truffle was good - other that that sushi was fishy and not good at all - and pretty expensive - not at all impressed", "author": "Harry S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-06", "description": "Ki, you have been in BOERUM hill for quite a few years. While your food is not inspired it is consistent and well done. No complaints! Service is prompt and thoughtful. You are my go staple after a long day at the office. A Nets game, a six pack of Kirin or Sapporo, three Saki chasers and four Ki rolls. Thank you for being you and in da hood.", "author": "Gif A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-08", "description": "Wow, this place really surprised me. Came here with my friend from Oklahoma - he's landlocked so I decided to get him in touch with some Japanese food, specifically sushi here in NYC. \n\nWe went for the omakase - supposedly they air ship it from Tsukiji Market in Tokyo but then again I don't know how real that is, considering the price of the omakase but hey, I don't need to complain about 35 USD. \n\nThe omakase itself turned out to be really good - the tuna was really the star of the show - so much so that we decided to order four more pieces of tuna nigiri a la carte. It was super fresh - just melt in your mouth good.\n\nI will say though that this is not \"authentic Japanese sushi\" because they still give you a healthy heaping of wasabi and soy sauce which most authentic places would just place it in and on top of the sushi piece, respectively, but I'm just nitpicking now. Service was good, and I liked the ambiance. Overall I highly recommend and I will be back!", "author": "William W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-07", "description": "Hearing the Lobster Tuna Roll on Yelp made me go for it. $12 for three pieces seemed outrageous, but it is COMPLETELY worth it. I've never had such an amazing combination of fresh, melt-in-your-mouth tuna, and lobster together. The wasabi cream was absolutely amazing. It isn't spicy at all, despite what its name may suggest, but its flavor has the right amount of cream sweetness and a refreshing taste to it. It left me wanting more. \n\nI couldn't let it go. The workers would come by 3-4 times asking me if they could take the plate off the table (to make room), but I refused. I wanted to keep the sauce for my upcoming rolls. \n\nThe Lobster Tuna Roll also has some tobiko on it with gold flakes. So basically when the servers placed it on the table, I was already astonished with its beauty.\n\nAnyway, enough with the Lobster Tuna Roll. It got enough attention. I also ordered the Ki Roll, which contained Lobster, tuna and one more fish, which I forget. They have tobiko over it. It was great, but I might have been taken away by the Lobster Tuna Roll that the Ki Roll couldn't compare. Both contained fresh fish and had a perfect combination for its roll. I would LOVE to come back if I'm ever in NY again!", "author": "Henry T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-23", "description": "Freshest sushi in the neighborhood. They get some of their fish flown in from the Tsukiji market in Tokyo, and the Supreme Omakase is to die for. Super fresh, melt in your mouth, flavorful fish, alternating varieties. The regular Ki Omakase is amazing as well. Both leave you wanting more, so order appetizers or a roll or two to accompany. Somewhat high prices but it's worth it.\n\nEntrees are great as well, miso black cod is well seasoned and buttery. Delivery is fast, and they keep your info on record so you don't have to keep giving them your personal info every time you order.", "author": "Kailey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-25", "description": "Pretty amazing sushi. Based on one experience, Ki may quickly become my favorite sushi place in Brooklyn. The Spicy Girl roll (spicy salmon + spicy yellowtail \u0026 avocado) was absolutely amazing. It's not as cheap as other sushi places, but then again, consider the location. Get two rolls and a beer, and you're looking at a $40+ meal. But oh so worth it.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-10", "description": "Decent place for decent sushi. A bit overpriced for their product but whatever. The staff was very friendly though.", "author": "Alyxes N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-09", "description": "Not impressed\n\nWe got the omakase - which, for 35pp, is a pretty good deal. The fish wasn't bad at all. Good selection- scallop was nice and fresh. Seared fatty tuna was tasty as well. \n\nThe problem was the sushi rice. Not flavorful, dry and overcooked, fell apart and in chunks. The rolls here might be good but I wouldn't recommend the omakase.\n\nWe got our son the vegetable udon soup. Which turned out to be Chinese egg noodles. Why call it udon if you don't use udon noodles? My son is two so it's not a big deal, but really?", "author": "Allan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "This was our go-to place while living in Cobble Hill for sushi. We lived pretty close so we would pick up quite often too, which was quicker than getting it delivered. Always fresh and satisfying, it's the best sushi place in the area. The waiter who often waited on us was very friendly and treated us with extra care since we were regulars. \n\nThere are always kids in there too for early dinner. My 3 year old daughter always loved the edamame, miso soup with rice, teriyaki chicken, cod, and eventually she liked salmon rolls too (always ask for no wasabi on the inside). She always ate well so that we could get our sushi fix!", "author": "Christine K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-30", "description": "After the Yelp Event at Nu hotel, I hit this place for some solo din din.\n\nJust by the sheer amount of great tips, I froze for like 10mn and couldn't decide on what to get. Finally, I got the Dragonfly rolls. They came out banging.  Piece of art....delicious art. The blend of crispy shrimp and eel and caviar was just heaven.\n\nI even followed it up with the very simple avocado roll...and even that was like a little party in my mouth. There is something to be said about well made sushi..down to the rice.\n\nI also enjoyed the honey plum wine...felt like a was drinking a sweet bourbon. Ok, lol i might be exaggerating but it certainly gave it a new dimension.\n\nCan I just say that service was fantastic. My server and even the guys working at the bar were all friendly. Never pushy, explained items I didn't know  w/o judgment. \n\nVery satisfied..and super full. Like many have said, this beats Taro, or any place in Brooklyn.", "author": "Annie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-27", "description": "Found this place on yelp. Spent about 20minutes trying to find an online menu with prices, called the place and got a confused \"we dont update the internet\", finally found an online menu and called back to order. Not a smooth experience ordering over the phone and almost backed out to call somewhere else. \nThe food was delivered in 15 minutes! Amazing but skeptical...isnt that too fast we thought?\nKi Sushi roll..yum\ngarlic broccoli..yum\nmiso soup...yum\namerican roll...yum\nTotally worth the trouble in the end. The food is really good quality", "author": "JP V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-30", "description": "Sashimi is my all-time favorite and I'm pretty particular when it comes to the freshness as well as the quality of the fish. We checked out this place on a Friday night holiday weekend (Dec 23rd) and the raw ingredients was fresh. \n\nWe sat ourselves at the sushi bar but the sushi chef offered us with no appetizers. The 2 notable items were the uni and the blue fin toro and they were both $8 per (single) piece. The sea urchin was creamy and sweet with a hint of nutty taste to it, which was a taste of freshness. Sadly, the chef didn't know where they were from! I asked but no one knows! The toro was from a high-grade tuna because it was rich in flavor and melted in my mouth. Mm-mm, good!\n\nHowever, the service sucks. All I want to drink was to have some green tea but the waiter didn't even know what ocha was! Without consideration, I was told it was sold out because he assumed it was a type of sake! I had to explain to him that ocha is actually the Japanese green tea.\n\nWhen my friend suggested this place, I was not hesitated to try even though it's off our usual grid (we came from Queens) because they have over 200 reviews. Regardless, I will not return to this place to pay for city-priced food with such poor service, unless the prices are marked down. Does anyone agree with me?", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-28", "description": "Ki Sushi - I will start with the following disclaimer- I do not like Sushi! So why the hell are you going to a sushi place to dine you ask? I was dragged by gunpoint, and knew I could order something besides sushi. The strangest thing happened though... I tried the sushi and BAM! I was hooked! All these so called sushi restaurants I have visited in the past are doing it all wrong! This place serves the freshest, most sinfully delicious sushi!\n\nI was skeptical at first, so I only ordered the Yellowtail roll and Teriyaki Chicken dinner as back up. The Teriyaki Chicken was ok, pretty forgettable (as I find is the case in most Japanese restaurants). I wound up devouring my Yellowtail roll, then proceeded to attack my friend's Spicy Salmon roll and the Ki Roll. The Ki roll is a MUST! It is comprised of tuna, salmon, yellowtail, and topped with spicy crunch king crab, avocado, caviar \u0026 gold leaf. Not only is it absolutely delicious, it's a beautiful dish as well- very elegantly presented.\n\nThank you Ki Sushi, for showing me what truly delicious sushi really is about! I am a fan of Ki, and a fan of sushi now!", "author": "Veronica C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-05", "description": "This place is consistent! \n\nFood is good - eat in or take out, it travels well!\n\nService is good.\n\nBest Japanese in the area that we have been to - we haven't been to them all - once we found Ki we stuck with it.\n\nIf it's crowded, it's noisy - go early if you want a quiet dinner.", "author": "Lynn M G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-21", "description": "I used to really like Ki. In fact, it was my favourite sushi joint in the neighbourhood. The fish is always fresh, if not always well sliced. The saki selection is decent, and the appetisers are generally decent. \n\nSo why only 1 stars?\n\nSimple. The last time I was there, the waiter informed me the saki I had ordered was out, and suggested another. However, when the bill came, the bottle they did NOT have was listed...at almost twice the price of the one we were given\n\nWhen I pointed this out, I was told I had in fact drank the one I originally asked for, that they were not out of it. Since what I had asked for initially was unfiltered, and what they served was filtered, I could hardly be mistaken about what I drank. There was no opportunity to see the bottle, and no offer to change the bill, let alone an apology for the overcharge. \n\nSo, having been charged for a premium bottle and served a cheaper one, I will not ever return to Ki...ever. \n\nCaveat emptor!", "author": "Adam G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-28", "description": "I love this place because:\n1) The price is reasonable\n2) Fresh ingredients\n3) Nice zen decor and all dishes are well presented\n4) CLOSE TO MY APT\n5) Eggplant Miso is amazing!\n\nThe only thing I have to complain about is the service...the waiter/waitress came, did the robotic \"hi, can I get you something to drink\", \"is everything ok\", \" BAM, here is your check\" (I added the BAM)  I wish they upgrade the service (maybe telling people what is the special of the day?  What is the most popular item?  What is the hottest color of the season?) so I can tell people that this is THE place for sushi", "author": "Juan J."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}