{"aggregateRating": {"reviewCount": 672, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-16", "description": "I must say  I forgot about this place since they closed for renovations. I went back last night and i instantly remembered how great the food was. Fresh sushi, great waiters and host. Not sure what was renovated but the restaurant has a great vibe. Tip order the TNT cold appetizer. Amazing !", "author": "Ann C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-06", "description": "Terrible service. Great food. Service never bothers us, but we had to wait an hour after our reservation with zero apology or comp for our trouble, then barely paid attention to. Ki roll was awesome. Gamble at your own risk here.", "author": "Jesse L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-11", "description": "Great sushi spot.\nThe environment is awesome with beautiful plants and dim lighting and though it's usually pretty full, I've never needed to make a reservation.  The staff is sincere and efficient and the sushi is delicious!  I don't know that it's the best sushi I've ever had in the history of ever but it's pretty darn good.  I usually just get their sushi deluxe and it's very fresh and more than enough to fill you up...unless you're like a body builder or something.\nDefinitely check it out if you're in the area and looking for sushi!", "author": "Allana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Amazingly good quality for a descent price at lunch and dinner. Plus a little lovely ambiance.\n\nI've visited Ki before and I felt pleased when my basic rolls were good and my wasabi actually dissolved in my soy sauce. \n\nI went back yesterday for lunch on the weekend and found the quality has not changed. I enjoyed the sushi, rolls, soup, salad, green tea, and saki.", "author": "Urszula P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-15", "description": "Love the fact they fly the sushi in daily from Tokyo. Very good sushi! price right on par with every other local sushi place. Server was very sweet. Definitely recommend!", "author": "Matt M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-13", "description": "After swatching makeup at the nearby MAC store, it was nice to be given a warm wet cloth to wipe off my hands. This added to the experience along with attentive staff and beautiful decor.\n\nNow onto the food, I ordered a garden salad along with two rolls (salmon avocado and shrimp avocado). Everything tasted fresh so no complaints. I want to come back to try their specialty rolls that everyone seems to rave about.", "author": "Naomi T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "After exploring almost all my neighborhood's restaurants (Brooklyn Heights), and honestly if it wasn't for my boyfriend who walked out of a next door restaurant telling the waitress that he's just received an emergency call, just because he was craving Sushi!!! After trying Ki, I personally forgive him for this inappropriate behavior.\n\nI have experienced eating good Sushi before, but this place is a whole new level of delicious. This place is literally the Bomb! You sit down, you immediately get greeted with a warm towel for your hands. I asked for a second and was given a nice look lol, I don't blame the guy. \n\nI ordered the Seafood dynamite and was amazed of how good it tasted. They serve it in an actual seashell, and was too good to the point that my boyfriend actually licked the plate ( in this case the shell!). We also ordered the spicy tuna roll, passion roll, and salmon roll, all were amazing. We ended our dinner with the lime \u0026 ginger brûlée, and the green tea ice cream. The brûlée is super flavorful but the texture is a little too soft. The green tea ice cream not so much. I can't wait to go back and try everything on the menu.", "author": "Sophie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-10", "description": "The best sushi I've had in Brooklyn!! The wait was long on a Friday night even though we made a reservation for 8:30. We got seated about 20 mins later and the food took even longer to come but the waiter was sweet. He gave us edamame on the house for the long wait. Anyways the food was worth the wait!! We each got the omakase it's been 3 weeks and I'm still dreaming about the salmon. Yum!!!!", "author": "Lisa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Delicious food and great aesthetic!\n\nWhile waiting for our movie to start we got the urge for sushi. We had tried the spot across the street and weren't huge fans so we came to Kk Sushi this time. \n\nWe enjoyed our experience from start to finish. The staff was attentive and friendly and the Sushi was fresh and flavorful. \n\nWe'll definitely be returning to Ki Sushi.", "author": "Ashlee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "Stumbled upon this hidden gem in Brooklyn. \nWe were looking for good sushi and we found it here. From delicious miso soup to melt in your mouth yellowtail we had the best dinner. \nMy daughter had the duck soup and it was incredible. Great overall experience. We will be back!", "author": "Kevin J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Love the new renovation. Ki is one of the favorites in the neighborhood. The sushi chefs are amazing and always friendly. Staff is always wonderful. Not to mention the sushi is fresher than some high end omakase restaurants in Manhattan.", "author": "Tia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "Small and cozy seating. Professional chefs on display. Excellent sashimi omakase. Great choice for sushi in Boerum Hill.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-22", "description": "Was delightfully suprised how delicious the omakase sushi was. Especially for $40, hidden gem indeed.", "author": "Linda V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-08", "description": "Always great, fresh sushi. Excellent choices, nice execution. Fast, prompts service.", "author": "Héloïse M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "One of my favorite sushi experiences in NYC. So happy to have a quality spot in the neighborhood. While I solely order sashimi, it's always entertaining to sit at the sushi bar and watch rolls be made. Even without a reservation, we were accommodated without issue", "author": "Julia R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-10", "description": "Monday Night, July 9 - we arrived a bit late, please forgive us for intruding on your sanctuary. We've been here before several times and have been greeted by much better people than you. Is it too much to ask to be respectful or even kind? \n\nI mean, this is a Japanese restaurant, right? Certainly all the Japanese people working there know about respect?\n\nIf you take an order and put it in wrong out of any reason, lack of respect or otherwise; you should be a man and own up to your mistake; instead of manipulating the situation and angering the chefs to make them feel they've done something wrong. \n\nDon't try to be a fake man, and a fake leader making most of the service inferior; having your little intern of a mousy waitress come 10 seconds later to hover over for an order before the menus were barely placed. I think your strategy for impressing the opposite sex is very SHORT sighted.\n\nI still gave you a 20% tip even though you don't deserve any.\n\nKarma will come to you one day.", "author": "A R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "Went to Ki Sushi last night and I'm counting down the minutes until I eat there again! We ordered the sushi deluxe platter and the fish literally melted in my mouth. It was the best quality fish I've ever had. We ordered the Ki roll as well and it was one of the best special rolls I've ever had. On top of all of that, the service was great and the restaurant has a great ambiance for a date night.", "author": "Kelsey N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-04", "description": "Went here for a graduation lunch type date, and was impressed! A calm, clean sushi joint with lots of cooked rolls for those who don't enjoy raw fish. I looooved the ginger dressing that came with their house salad. I should add that the salad wasn't the usual iceberg-paper type lettuce you get at most sushi places, there was real lettuce on that plate. I want to say I ordered an American Dream roll, and a Dynamite roll. Both are from the special rolls section but they were bomb! Would come back if I'm in the area.", "author": "Sadia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-24", "description": "Thank god, ya'll are back. Ki Sushi is the bomb digs. Delicious and FRESSSH sushi.", "author": "Samantha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-25", "description": "I love the salmon lovers lunch special!  I could eat this everyday for the rest of my life and be happy! They also have a hamachi lovers lunch special. I wish I lived closer.", "author": "Trina T."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Ki Sushi", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "122 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/P-zxkpmAdBTJIYu7geAnuQ/ls.jpg", "@type": "Restaurant", "telephone": "+17189350575"}