{"aggregateRating": {"reviewCount": 23, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-09", "description": "Exactly what you would think of a Chinese restaurant serving tacos.  Come on now, you really werent expecting a 5 star experience here were you?  This place does exactly what you would think it does.  Serve blah food quickly.  Then again, what the hell was I doing getting tacos here??  Oh yea, it was 2pm and I had not eaten anything at all today.  Sometimes its worth the extra 5 minutes to find something worth eating...", "author": "Nathan L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-06", "description": "this place is really horrible. i ordered today and got a sesame chicken, shrimp roll and a lemonade and that chicken tasted disgusting. i would expect the meat to be  white but it was dark meat. the food was really dry. The shrimp roll only had one shrimp and im really dead serious on that. wtf am i going to do with ONE shrimp in a SHRIMP roll? and the lemonade was okay until i got to the bottom. the bottom of the cup didn't even look like it was sugar it was more of a paste. my whole order was just nasty. and the crazy part is i've ordered from this place and it was good until this time. Now this food got my stomach hurting and a headache. just never again", "author": "Wanda B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-26", "description": "almost 2 hours for delivery. I could be halfway to Chicago in the time it takes them to deliver food less than a mile.", "author": "Collin S."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Gourmet Garden 8", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "108 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/d1mvgqgWNhDouLKbfR6Vhg/ls.jpg", "@type": "Restaurant", "telephone": "+17182465533"}