{"aggregateRating": {"reviewCount": 23, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-30", "description": "I've ordered from this place a lot through Grubhub so I don't know how the customer service is through the phone. My orders usually came in around the estimated time which isn't a problem. The chicken combination plate is my favorite. It's filling but sometimes the beans spill everywhere during delivery. I gave 4 stars because over time I started getting less and less small containers of salsa. The steak quesadilla isn't bad but it's usually cold by the time I get it because the cheese cools down fast. The food is worth the price you pay. I recommend trying their ice tea too. The French fries aren't glamorous and sometimes they're soggy but they're better than most places I had fries from.", "author": "Vincent S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-09", "description": "This experience was unbelievably awful. I called in a delivery and the phone convo and customer service was just a disappointing and dull as the food.\n\nThe chicken tostada salad was dull, lackluster, and in  need of some kind of Mexican influence. The guacamole was watery and drab, I could have made it better my damn self with two avocadoes, garlic, and a hint of imagination....and the chips were painfully stale and they forgot to add my soda and actually asked if, \"they can bring it next time.\" \n\nNo, there will not be a next time. \n\nDon't do it.", "author": "Letty C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-31", "description": "If I could leave 0 starts I would. I can't even review the food, because I couldn't even complete my order. I called to make an order and the man that answered the phone was extremely rude. Had me on the phone while he was taking others orders and then finally started taking to me. Well actually more like yelling. Asked for my address, which I had to repeat four times and then he asked me if I was sure that was my address. Then as I try to say my order he is speaking over me yelling \"I don't understand you. What do you want to order buddy? Hurry up I don't understand you.\" He was just extremely rude and I decided I didn't want to give that place any business. I'm not sure how they are getting any business with that man they have answering the phones and speaking rudely to customers. \n\nThere are other great places to eat in the area that appreciate their customers. I would suggest going elsewhere.", "author": "Brittany S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-15", "description": "Customer service is so critical for small businesses to build loyalty and repeat sales.\n\nToday was the first and last time that I will order from this establishment. I placed an order through Grubhub and my food arrived a whole thirty minutes later than estimated. I could not even connect with anyone, because no one answered the listed number. Can you imagine being hungry, with no idea what happened to your food with nowhere to turn to for help? The chicken fajita ($2.25) was a joke, but at least the fried chicken wings and French fries ($5.75) weren't screwed up.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "Tbh i would give this place 4 stars but I saw a review of someone complaining that the employee would've give switch their drinks AFTER they received it. They're not entitled to replace a drink if it's correct and you shouldn't be mad about that. I have never been to their location but I order thought the seamless app. The food is good and cheap. The first time they gave me veggie dumpling because I didn't answer my phone when they called. From then on I always call after my order. I am Chinese but I don't speak the language fluently. I spoke in English and the lady didn't fully understand me at first and that's ok. She's not being rude she just wants to make sure that your order is correct. You shouldn't be mad at someone who can't speak English properly.", "author": "Sarah Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-05", "description": "This review is solely based on customer service.\n\nI called asking if they were delivering (night of snowstorm) and the man receiving the call just kept interrupting me and yelling. He asked me for my address and he kept interrupting and yelling for it while I was trying to say my address. Of course you won't hear what I'm saying if you keep yelling over me. When I finally got the whole address out to him, he instantly yelled, \"NO WE DON'T DELIVER THERE. TOO FAR.\" He hung up INSTANTLY. I was trying to tell him I was using an app to order through them so it wouldn't be through their people. The service left such a bad taste in my mouth.\n\nI proceeded to use the app to order delivery. I placed the order, and they called me to say they are not delivering. (This was my bad. The company I went through to order didn't actually have a different delivery service than the actual restaurant deliverers.) But rather than calling the company for me to cancel my order, they told me (yelling) that I need to call them myself and cancel the order. Meanwhile, another restaurant I tried ordering delivery from that day calmly and collectively told me what was up with my order and that they already cancelled the order through the company, and that I would be refunded.\n\nEven when the weather clears up, I do not see myself ordering from this place. For some reason Grubhub has good reviews of this place. Maybe the food is decent. I will never know.", "author": "S H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-25", "description": "The other reviews pretty much confirms what I will be attesting to. How this place is still in business is beyond me. Maybe because the food is dirt cheap.\n\nI got delivery with my coworkers from this place. I didn't pick up the order so can't tell you how the interaction with the delivery guy went. What I can tell you is that the order took over an hour to get here. What kept them from delivering the food was the rain...really?\n\nI got a lunch box that was steak and mexi chill, Barely any steak or chill, but loaded with beans and salad. Half of my meal consisted of rice. I didn't order rice, I ordered steak and mexi chili and they served it as it was just a side. Pitiful.\n\nOh, and the rice that was what I apparently paid for costed me $9.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-01", "description": "I order extra guacamole for my food! They charged extra money. And they didn't put it in my food!!! When I call them they expect me to go over there to pick it up again!!! The guy on the phone was rude!!!!!!! They need to hire someone who can speak English!!!", "author": "Michael N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "Where do I begin? How about i talk about my feelings like everyone else who reviewed this spot. I felt welcome and the guy who took my order was great. 5 Stars.\n\nOk, now to what really matters...the food.  It is exactly what you would expect from a Chinese/Mexican spot across the street from the Brooklyn Hospital trauma center. i ordered an enchilada and fried plantains. I was given an enchilada and fried plantains. They were tasty 5 stars. \n\nDespite the word Gourmet in the spots name, a gourmet chef did not make the food, a nice Asian man made it, so i was not at all surprised that it in fact tasted exactly like an enchalada and fried plantains should taste when purchased from a Chinese/Mexican spot across the street from the Brooklyn Hospital trauma center.\n\nStop reviewing your feelings you jerk heads.\nStay tuned to my next review of Sals hot dog cart on Ashland and Fulton.  Spoiler alert!!!!! The hot dog tastes like a guy named Sal made it in a cart on Ashland and Fulton.", "author": "Krzysztof B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-15", "description": "I really thought I wrote a review about how the Asian lady was arguing me down about the ingredients in chow mein being veggies and rice, not noodles. I really thought I wrote a review about how the delivery guy got mad because I gave him a 20% tip when he thought he was worth so much more.\n\nSo I ordered my food and had it delivered. Delivery was fast but the food is precooked so I'm not shocked. Chow Mein and a guac quesadilla is what I ordered. Should've known better since they sell both Mexican and Chinese food out of the same establishment but those are my two favorite cuisines and I was in the mood for both. Food came and I asked if I needed to sign anything and was told \"No, but my tip\". I told him his tip was included when I made my payment online and he tried to talk slick about the tip. First off I didn't have to give your ungrateful ass nothing. Second off you have the nerve to fix your lips to talk about a tip. Tips aren't mandatory especially not a 20% tip. Talking about I came all the way from Dekalb. Take it up with your boss! Where'd you get this sense of entitlement? Get a new job if your pay is crap. He really thought I was supposed to tip his ass half of my order foh before I have the cops escort you out.\n\nOpen the container and see veggies and a box of rice. I called in and this fool on the phone said \"everyone knows chow mein is vegetables\". Well you need to relay that to the other Chinese joints because I've never been served rice and veggies when I order chow mein. She proceeded to tell me to Google it, so I did. I read to her VERBATIM what the Wiki page said and she told me no that's incorrect. I said \"You just told me to Google it and I did. Now you're saying no??!\" Went on for forty seconds before I called her a bumbling idiot and hung up. I threw away the fake chow mein and just ate the mini quesadilla. I emailed GrubHub and they gave me a credit.\n\nFuck this dump truck.", "author": "Amira A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-28", "description": "This place was amazingly bad. The food was salty and dry, so was the service. They try to over charge us and we caught them in the act. I wish I could give them no stars. After the really awful meal we looked for their letter grade and it was at the bottom of the door in the corner... And the door was open. They are dishonest and the food is bad, you shouldn't wasted your money.", "author": "Corey W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-13", "description": "My friend likes Chinese....I love Mexican.... They deliver Mexican and Chinese.  Fight avoided!", "author": "Justin H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-26", "description": "I will not order from this place again. Worst General Tso chicken ever. I also ordered vegetable fried rice - worst ever. The chicken was gummy and looked like red food coloring was splashed all over. I forgot about the spring rolls I ordered. They were really thick and barely had any filling. I should have followed my mind and ordered from Yummy Yummy or Kum Kaw and walked out to get the food. I hope I don't get sick.", "author": "Mocha S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-04", "description": "This was the first time I had ordered Chinese food from here and when they delivered it to me, they forgot to put in the rice that came with my meal. Of course I did not notice until I came back up to my suite, so I called GrubHub about it thinking that they would just come back with the rice, but they told GrubHub that they were a 110% they put the rice in there. Basically calling me a liar about it. GrubHub believed me and were nice enough to give me a free meal. NEVER ordering from them again.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-26", "description": "My friend ordered Nachos from this place.  The most terrible Nachos I've ever had.  The cheese tasted spoilt and I ended up throwing it away.  The bean taco was better, but honestly, I can make better Mexican food at home.  Never again.", "author": "Divya S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-16", "description": "I have ordered delivery from this place twice now. The food came quickly, it was hot and fresh and the price is amazing. This place is clearly not the pinnacle of fine dining but it's great for what it is!", "author": "Bernardo C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-17", "description": "The folks here serve up reliably satisfying lo mien and hot \u0026 sour soup. They're polite, professional, and quick. Never had their Mexican.", "author": "Zachary G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-06", "description": "I vomited several hours after eating their food, luckily it was only a little because i only ate a few bites then saved it for later. \n\nThe chicken was rubbery and seemed more like pork, like the texture of uncooked bacon.\n\nThe rice was undercooked and the peas were still partially frozen.\n\nNEVER EVER AGAIN!", "author": "Nicole E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-08", "description": "I have ordered from this place before, and it's always been ok.  Today I ordered shrimp and broccoli and got halfway through it when I found a green worm in my food.  NEVER AGAIN!!!  \n\nAWFUL!!!  AVOID LIKE THE PLAGUE!!!", "author": "Meredith P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-02", "description": "The good first. This place delivered SUPER fast so I was inclined to give a good tip. However, once I started eating I wanted to call the guy and request my money back. I ordered chicken and broccoli with white rice. While the rice and broccoli were good, the chicken was rubbery. The chicken is what makes the meal so this really upset me. I doubt I'll order again as there are a plethora of other chinese takeouts in the area to choose from.", "author": "Marla B."}], "servesCuisine": "Chinese", "priceRange": "Under $10", "name": "Gourmet Garden 8", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "108 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/d1mvgqgWNhDouLKbfR6Vhg/ls.jpg", "@type": "Restaurant", "telephone": "+17182465533"}