{"aggregateRating": {"reviewCount": 66, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-17", "description": "Love this place, the food is always fresh. I love the ice tea. You should try it. The soup can be bland sometime but it works on a cold day like how it has been I New York City. The Crew is very cool. It is a good stop in.", "author": "BlueMarie E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-24", "description": "My husband and I were desperately seeking a place for lunch, and we decided on this place. The sandwich menu looked promising but after watching the sandwich maker put the sandwich together, I realized that this place was actually a couple step down from Subway. At least at Subway, I can add whatever plethora of toppings and sauces that's onsite to make the sandwich tasty.\n\nI actually ended up eating my hazelnut croissant and one bite of my sandwich. I may be back for the croissant but never again for a sandwich.", "author": "Cathy C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-25", "description": "Coffee and food is what you expect for abp, but this particular location has the worst layout ever. Be prepared for confusion and congestion. Cheap iced coffee is nice though.", "author": "Alexander D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-09", "description": "Look, I'm just sayin' everything else around Metrotech is totally disgusting, dirty, greasy, horrible-for-you-and-the-environment b.s. - I work nearby, so believe me, I know. \n\nAt ABP I can get a fresh (90% of the time) vegan salad of the make-it-yourself variety, and I can opt to get \"premium\" avocado on said salad for free, as I don't want any \"protein\" options (they don't have tofu for some reason). This a great choice for anyone who doesn't want Popeyes, greazy Chinese or Chinese- Mexican, or something equally gross... or for the vegans and vegetarians who, like me, forget their lunch at least once a week. \n\nI don't usually go to chain restaurants, but on the days that I forget my lunch and don't have time to walk to Fast and Fresh Deli (the nearby taqueria), I opt for the above mentioned salad at ABP. It's about 7 dollars, but that's because I don't want meat and cheese on it; I believe those things make it more expensive. \n\nI will say that staff is hit or miss. This one salad-making girl is NEVER nice to me and ALWAYS acts surprised and put-upon when I ask for avocado. \n\nOnce, one register lady asked me what kind of salad I had, and I said, \"it's just vegetables, make your own.\"\n\nShe said, \"are you sure there isn't chicken on it?\" \n\nI laughed and said, \"yes, I'm sure, chicken is not a vegetable.\" \n\nShe had to look and see for herself to be sure even after  I ensured her that my salad was vegetarian (even showed her the packet of vegan salad dressing I chose). \n\nShe then asked me if artichoke was meat... (really). \n\nYesterday, on my most recent visit, the sandwich order guy was hitting on me unabashedly to the point of making me really uncomfortable. I don't wanna hear about my dimples, or get looked up and down and up and down - I just want my salad, dammit. \n\nBut anyway, if you're in a pinch, ABP is vastly better quick food than anywhere else surrounding. Although sometime when I have time, I'd like to try that new French named place that just opened nearby. Which reminds me, as a Frenchie, the name Au Bon Pain, for a place like this, is really embarassing.", "author": "Elishevah G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-02", "description": "I've spent over $10 for a napa chicken with avocado wrap and a cinnamon roll. Both tasted good but i'll pass for a location with better pricing.", "author": "Xavier Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-18", "description": "I can never understand why they are so damn expensive. The pastries and the cookies always have flies in them, and the sandwich counter is always out of some ingredient. \nNever tried their coffee, not sure if i want to. But the mac and cheese is pretty ok. Other than that, why come here and spend almost 10 bucks, when there are so many other places to eat in the neighborhood? They don't even have a university discount. smh", "author": "Cherron B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-14", "description": "Coffee and soups are watered down. Cooks are lazy and have a attitude if you ask for them to prepare your bagels or make a sandwich. This place sucks the only reason I come back is the cinnamon rasin bagel.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "Love love love the soups and pastries. The only thing I didn't really like was their already packed breakfast sandwiches which were left on a warmer.", "author": "Bonnie T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-16", "description": "I used to come here almost everyday during the summer because I worked nearby. I only come here for the cheese danishes because the cheese danishes at Au Bon Pain are my absolute favorite. However, at this particular joint, their cheese danishes are almost never fresh. This place can get really busy during the breakfast and lunch hours, which means the lines  get REALLY long. The service is slow and it's just not worth the wait. I'd rather spend my money on fresh pastries that can be found in other Au Bon Pain locations, rather than this one.", "author": "Violetta L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "Great place for coffee and bakery items. They have 50% off on bakery items after 7 everyday. When in crunch of time, this is my goto spot to pick up breakfast or lunch quickly. Do sign up for their club membership to get special offers and free meal for your birthday", "author": "Pluto G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-29", "description": "good and cheap food. Tasty and fills your stomach.", "author": "Big B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-01", "description": "Disorganized, dirty and consistently screw up your order. Beware of soaking wet floors, large pieces of sharp metal jutting from the walls and (on one occasion), staff members spilling hot steamer tray water on a customer. My punishment for not making breakfast before I leave for work is having to endure this place just to get a bite or cup of coffee. My aggravation level is always through the roof whenever I stop in.", "author": "Julie N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-20", "description": "No hot water for tea? Really????? \n\nThe temperature outside was 20 degrees and the temperature inside was 15 degrees, and one wonders why there wasn't any hot water. =(\n\nStarbucks next store is more money, but at least they seem to be fully stocked up!", "author": "Bryce A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-25", "description": "Pastries are semi-fresh, and the coffee is just okay.  I don't crave or hate ABP, but it's a nice place to go to for breakfast when other options aren't available.\n\n***", "author": "Minh L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-30", "description": "I don't think this place is that bad. Their food is pretty yummy, but often times a little greasy. It's pretty overpriced for such ordinary food but you're paying for the convenience. I am often in the metrotech center for work so it really couldn't get more convenient. During lunch hour, they take a while making your sandwich and the line to order can get disorganized. Then you have to wait in another line for to pay. Nevertheless, I do like their self serve soup enough to be a repeat customer. This place is okay, not great, but gets the job done for a grab n go work lunch.\n\nOh, and FYI if you go here after 7pm, everything is half off.", "author": "Rebecca D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-26", "description": "This place used to be good.  It has been a long time since my last time.  Now it is mostly self-service.  It took forever to get a wrap and the preparer forgot to put the peanut sauce which made the wrap bland.  The cashiers are awkwardly located too.  The setup of the seating is awkward too.  Everything is all over the place.  On top of that, you get hit over the head with the prices.", "author": "Johnny D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-03", "description": "I've been going here for years and I will never go back after my last visit. I have given them the benefit of the doubt more times than I can count, but the last time I went really did me in. In general, I don't know what's going on with this place, but the staff they hire have horrible customer service skills. Not all of the staff do, some are fine, but some act as if you are doing them a disservice by showing up and wanting a sandwich. REALLY? You have a job because of paying customers like me. The lack of professionalism at this place is very noticeable and they also seem to have a high turnover rate. Again, I've been going here since 2008. \n\nI was told after I got a refill that refills were not free. The rude sandwich girl saw me and then signaled to the cashier to tell me once I was leaving the store that refills were not free, as if I was doing a crime or something. I felt like I was being targeted actually. For what? I have no idea as I have always been VERY FRIENDLY to everyone there. It was really embarrassing and quite frankly, it pissed me off. They know I'm a loyal customer - I would go here once or twice a week and I'VE ALWAYS GOTTEN FREE REFILLS. For years now. So I told her that and I also told her the fountain machine is out in the open and that if there are no refills allowed, they need to put up a sign, because if you go to Chipotle or any other chain and the fountain drinks are out in the open - guess what? That means FREE REFILLS. How was I supposed to know this if there's no sign and I see tons of people getting refills? Ridiculous! \n\nIt really was more than the refills thing that pushed me from never going back here. Over the years, I've always felt the staff here are immature and again act as if you are annoying them if you want a sandwich. They would much rather be talking on their iPhones. I mean, I get it, working in customer service and especially the food industry must suck (I worked in retail to pay for my college, so I know how it is), but it's YOUR JOB to treat everyone that comes into your business with respect and to make them feel like they are appreciated. Otherwise, you will lose good quality customers like myself.\n\nPoint blank, the last experience left such a bad taste in my mouth that you would have to pay me to go back to this place. Beyond over it. I just felt that the management or the higher ups deserved to hear the ugly truth as I know my experience is shared with many other customers. In short, you're turning off and losing customers at this location.", "author": "Addison J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-14", "description": "Had a cup of coffee from many places but the corn muffin was the best I ever had. The crew was very friendly .The place was busy but the line was moving. Nice", "author": "Omar W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-11", "description": "Excellent Salads! I wish they sold the apple cranberry blue cheese mini salad.", "author": "Kayisha T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-23", "description": "I work in the same building that this Au Bon Pain is housed, but I kick myself every time for giving in and going there just out of convenience. It's always such a bad experience. The place is always crowded around morning rush and lunchtime, but the seating, which takes up half the room, is practically empty. There's usually a spill of some sort on the floor, which is dangerous and the staff is slow to clean up. The breakfast sandwich bar is always chaotic. They're slow to make your order and usually while you're stuck waiting you'll overhear an angry customer complain about their order (or you're the angry customer). Having an expediter hasn't helped getting the orders out faster. Oh and when you ask for jelly on your bagel, they get it out of the packet! Paying is always a drag. They have 4 tills, but no person bagging your stuff while the cashier rings up your order, so the line backs up and fills the rest of the floor space in an already crowded restaurant. Save yourself the headache and go to Metro or Dunkin' or support one of the local Mom \u0026 Pop delis in the area.", "author": "Sandra B."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Au Bon Pain", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Metrotech Ctr", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LyBI79gl9QEM511YVc7ujw/ls.jpg", "@type": "Restaurant", "telephone": "+17186243833"}