{"aggregateRating": {"reviewCount": 66, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-08", "description": "Apart from the chocolate pastries and everything bagel I get every so often, everything I've tried has been pretty eh. Would much rather go to hale and hearty next door for a salad, ABP doesn't have the dressing I like and most of the time they don't have croutons.\n\nThey run out of pre made stuff pretty quickly so you'll have to order and wait during lunch time. Long lines for checkout as well.", "author": "Anvita S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-28", "description": "I work in the building so I come for my breakfast. Some of the workers are nice but my god, some of them have the nastiest, mist unprofessional attitudes ever. Makes you not want to shop here but...\n\nThey're also realllllllly slow at peak times.", "author": "Toccara H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-02", "description": "The sandwiches and soups are OK. But my real issue is with the layout of this place. Maybe it's just me but it feels like chaos every time I go in. I get that it's a busy location but even between rushes, there's just no order - just people mulling every which way. Plus, and I've done a personal study on this, there is not a single square foot you can stand in this location for longer than 15 seconds without being in someone's way. I come here because I have to, but this place is maddening and I dread every visit.", "author": "Reels B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-04", "description": "I usually end up here for coffee and sweet delights( on my cheat days).I dont really prefer chains like ABP for my coffee,(I prefer my coffee served with a smile from the local coffee cart ) but convenience wins me over at least a few times a month since this is really close to work.\n\nThe few times I have come here, the service was pathetic(except once) and the whole layout  lends to a very chaotic feel. There are days when the servers look super annoyed and you keep reminding yourself why you hate it here and swear never to come back.I do like the fact that we can get our own coffee and pastries but on busy days,that leads to even more confusion. If you are ordering lattes,it will serve you well to check to make sure you are getting what you ordered before leaving the place.Last time,I ordered a vanilla latte and the guy who made it forgot to put in the vanilla syrup!By the time I tasted it,I was safe and warm back in my cubicle and I convinced myself not to go back coz the vanilla syrup was just extra calories(but I would still like to get what I order)\n\nEverything is overpriced but it still manages to attract a large crowd thanks to its location.Inspite of that,they could clean up their act a bit.", "author": "Aparna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-16", "description": "Looking at past reviews it seems as if they have stepped up their sandwich game big time! With the kiosk you can customize our sandwich and not have to worry about dealing with the chefs. Souls, coffee, pastries and drinks are all self serve so you can take your time deciding what you want. \nI had the Chicken Avocado sandwich. The chicken was fresh and tender, avocado was creamy and the bacon was cooked perfect. I recommend this particular store as you really only have to make your coffee, grab your sandwich and go!", "author": "Johnny F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-10", "description": "Sometimes i hafto work around the area so this spot has become one of my to go places. I come here for their fresh made sandwiches, they have new sandwiches every now and then. My recent fave is the margarita chicken sandwich. Its nicely toasted w mozz and some basil pesto sauce with white meat chicken. I also like their soups, i always always use a small sauce cup to try the soup before actually gettin it. The soups vary from time to time so what u like today may not be there tmr. I've always been treated nicely by the staff so i do enjoy coming here. :) oh and their toffee cookie.. Is the best!!!! Best!", "author": "Linh L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-04", "description": "I purchased a new cold cup yesterday and as per the advertisement I had an iced coffee. \nAs per the advertisement on the cup - its states FREE REFILL ON US. I attempt to get a REFILL the next day and I am told the REFILL is the initial fill I received when I bought the cup. \n\nREFILL clearly means to fill again and yet the manager and all of the workers at 1 MetroTech, Brooklyn, NY 11201 - do not understand what that means. \n\nI am writing this because I frequent Au Bon Pain for years, it is my go to lunch place and has been throughout New York City at various locations and yet this location has a problem with every advertised saving coupon. I often go because of the incentive of the coupon but the aggravation behind the dealings with this location and manager are making my experience very unpleasant. Why send a customer coupons to only have them degraded when attempting to use them. \n\nThe amount of savings is not the issue at all here - It's the \"Customer Experience.\"\n\nAs for the food - I enjoy the sandwiches and Latte's. Everything is always fresh and I never have to wait long. I really wish this location can improve on their customer service and treat people fairly - the reason for providing coupons to patrons is to have them return and purchase more! and AGAIN - just like the meaning REFILL. AGAIN", "author": "Venus W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-11", "description": "This is one of those few places that I really enjoy visiting. It's got a little bit of everything for everyone. Coffee, Tea, Special drinks and cold drinks as well. Plenty of yummy bakery items and healthy low calorie options for those of us sticking to a healthy lifestyle.\n\nThey also offer an email based discount membership of sorts. They have good discount offers and specials. The coffee is tasty (specially the hazelnut coffee) and the food is delicious.", "author": "Kassie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "Use the kiosk to order and pay for your food while they make it. By the time you pay, your food will most likely be ready. They have a good selection of sandwiches, wraps and soups. The line moves really fast! \nMy only complaint is most of the soups were non-vegetarian (they were made with chicken broth).", "author": "Forida R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-13", "description": "This place is just aight. I think there might be better Au Bon Pain's to go to. The one in penn station when it first opened would fill penn station with the smell of baking bread in the morning. This place you just smell coffee and people. Yeah its very very busy and see's a lot of people. Its the closest place to my job to get coffee at the moment. Its always super busy inside. The coffee is pretty decent but no starbucks. The ladies who make the coffee are very nice. \n\nAs far as food stuff goes its been hit or miss. I ordered a breakfast sandwich from them one day and it was very disappointing. I got fooled by the picture. It was an egg white sandwich with a butter lemon sauce avocado tomato on whole wheat roll. I felt like I was getting a sandwich from Dunkin Donuts. The second item I got was a salad with chicken breast and avocado and a bunch of veggies. It was actually good except they forgot to put the avocado. I've gotten a few of the soups from here and they range from just ok to did they just pour campbells into a contain and microwave it? I'm going to give a regular sandwich a go and another salad but if neither of those are good I'm gonna have to chuck the deuces to this place. Its also way overpriced. All the baked goods are on average 3 dollars and up. Absolutely insane. \n\nJust to mention again it gets very packed in here and the setup doesn't help alleviate that all. Not the place you want to go if you short on time at lunch and need to get in and out quickly.", "author": "Eric R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-06", "description": "This is my go-to place for soup. The soup is out so you can scoop it up yourself. Prices are kinda expensive, but it's convenient.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-23", "description": "Coffee is decent but service is pretty horrible. I've never been frustrated so much by trying to pay for food. Pastries are average but they are usually out of stock of anything good.\n\nIn my mornings, I really just want to get some pre-made average, barely editable food but it's too much of a hassle to deal with the employees.", "author": "Geoffrey C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-29", "description": "Gets really busy, small selection of pastries but other varieties of sandwhich, hot drinks etc. The lines diminish quick as long as there's open cash registers to accommodate that they do well from time to time", "author": "Jofferson G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "I would like to update a previous review. Since I last wrote about this place, they have had a renovation. While it still is a little chaotic, the staff seems better prepared to handle the traffic. Ordering and waiting for a dish is no longer a terrible ordeal. During rushes like breakfast and lunch,  the place gets pretty packed, so expect to be on the line to pay for 5 -  10 minutes.", "author": "Michael R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-01", "description": "Sometimes the staff here is on point, other times they are the worst in the neighborhood. Nonetheless, you can rely on this location for having customers who know what they want (coffee and tea are self serve), getting it, and going...unlike the Starbucks up the block where it takes people 2 minutes to order a drink (1/2 that time they're just pronouncing the name of the hot beverage). If you're in a relative rush and need a coffee fix, come here.  And um, hopefully the coffee machine will still be full.", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-22", "description": "This place is a disaster. Is anyone in charge here?  Where do the lines start? Everybody seems to be walking around confused, no organization whatsoever. I've seen many people walking out frustrated. The staff is constantly arguing with each other. Coffee is good though", "author": "Zachary E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-07", "description": "I am inspired to write this review simply based on how disorganized the place is during the morning rush (the only time I've ever been there). I go here when I feel like having a breakfast sandwich that isn't the size of my head. Their breakfast sandwiches are pretty tasty and not too expensive, but if you can figure out the ordering process on your first visit, I'll be impressed.\n\nDo you walk up and tell the sandwich makers what you want? Do you fill out one of those paper ordering tickets? Do you tell a manager what you want and SHE fills out the order ticket? I've experienced all three ways of ordering, and there are no signs telling you which to do.\n\nThen, where do I wait? Is this group of people waiting to order? Or have they ordered and they're waiting for their food?\n\nThen, watch out, you're waiting in line to pay but you're simultaneously blocking people from getting their self-serve coffee.", "author": "Portia Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-27", "description": "Every time I come here, I try to give them the benefit of the doubt. But whenever I've tried to place a drink order, service is so bad. Th ey take the longest time to get your order I waited more than five minutes for someone to ask me.for my order as I'm the only one in line trying to order. The lady, who was in charge of the drinks, was trying to figure out how to fix a machine and completely ignored me. Didn't acknowledge my presence. Not even, \"please wait a min\".  I just left. They are not organized. The place seems kinda dirty and messy. shouldn't take long to ask for my order esp if I'm the only person waiting in line. At least acknowledge my presence.", "author": "Carmen Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-10", "description": "Like their soup selections. They are quick in completing orders and the prices are good for all the sweet pastries.", "author": "Pam K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-22", "description": "Staff needs a refresher on professionalism but luckily the food doesn't suffer as a result. \n\nTry the canberry, brie, turkey on multigrain bread.....uh-may-zing.", "author": "Quincy T."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Au Bon Pain", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Metrotech Ctr", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/LyBI79gl9QEM511YVc7ujw/ls.jpg", "@type": "Restaurant", "telephone": "+17186243833"}