{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-12", "description": "We were here on a Saturday night.  They were very busy with a large party which took up most of the dining room so we sat outside.  The outdoor seating had a pleasant ambiance and provided a respite from the very high noise level inside.  \n\nTo start, I ordered the RaRa salad, which was pretty good.  I'd probably opt for a different starter next time, as the beets were a little on the bitter side.\n\nBecause of the large party inside our main courses took a reeeaallly long time to come out.  As did the other patron's who were also dining outside.  However, our server was very friendly and offered us two drinks on the house because of our wait.  My partner and I both got the ginger mint sangria, which was wonderful, so it definitely made up for the long wait.\n\nI had the tilapia Fritaye platter and my partner had the broiled red snapper in creole sauce.  They were both excellent!  I would highly recommend the macaroni au gratin and the akras, as well. \n\nSo glad to have this place in our neighborhood, I'm sure we'll go back again.", "author": "Holly C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "So convenient! Quick dinner before a concert at Brooklyn Academy of Music.  Service was quick. Limited menu made choices of Haitian food easy. Lambi and black mushroom rice was spot on.", "author": "Thomas B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-22", "description": "I wish I could rate this place higher. Maybe if anything I'd ordered had been available, I could have tried it. \n\nWent for Sunday brunch around 2:30pm. Not too late for brunch, in my opinion. Or, I should say, not so late that a restaurant should be out of half the menu. \n\nI tried ordering one brunch item. (From a list of 7 options). Out.\n\nTried ordering a second item. Had it. But all three sides options? Out. Ordered it anyway. \n\nAlong with a soup. Waitress came back 10 minutes after I'd ordered. You guessed it. Out. \n\nI got so hungry waiting the 25 minutes for our order that I ordered the other soup instead. Came after my entree finally arrived. \n\nThe entree was dry and served with stale bread (remember, out of all side options). I NEVER send food back. But I had to. Not only was it dry, but it was LITERALLY 4 spoonfuls of shredded fish. Like for real, 1/4 cup, if that. And dry bread. \n\nSo I send it back and order an omelette. 5 minutes later, the waitress informs me they are out of eggs. \n\nEggs. \n\nAt BRUNCH. \n\nAt that time my replacement soup finally came. It was delicious. It also included 3 full crab claws. And no cracker. So yeah. They were pretty but I couldn't do a thing with them. \n\nEverything I tasted of my friends food was yummy. My soup was yummy. The place is cuteness. The service was friendly, if sloooowwwwwwwww. \n\nBut, like .... It's brunch. I'm gonna need you to not run out of eggs.", "author": "Joanna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-22", "description": "This place is wonderful. From the staff to the food to the atmosphere I was pleased.  This is my second time here, once for an event, the second was a date with my wife. My wife spoke about the food for the rest of the evening. This will be our spot to eat at when we go out!", "author": "Shane B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-05", "description": "I've dined here 3 times already. My last visit was mid-January 2013. Each time I dine here I have a different dish. The food tastes really good and is well seasoned but note that some may find the portions small. The Meal cost is much higher than your Standard Haitian take out food so don't be surprised when checking out the menu prices. You'll receive Attentive \u0026 Courteous Service. The ambience \u0026 decor are great! Be sure to try the Herring Shiktay and the Grilled Conch as appetizers.", "author": "Johanna A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "4 Stars!  I live in the Bronx and it's definitely worth the trip back into Brooklyn.  \n\nA girlfriend and I visited La Caye last Friday evening after work.   We were able to enjoy the last half an hour of happy hour, which ends at 7:30pm...  The champagne mixed sangria's were delicious.  Restaurant itself is small in size but comfortable, nice bar area!  \n\nFood: Lambi was nicely seasoned, sauce was spicy for those who like spice BUT the Lambi was overcooked, needed to be a little more soft and tender.  My friend she had the seafood combo which she enjoyed along with the Black rice.  I'm part Haitian SO I know about black rice \u0026 Lambi.  It was her first time having both, as well as ever having any Haitian food. It was a good experience for her she will be back...  \n\nOwner/Manager was super FRIENDLY and offered up a round of sangria due to the overcooked Lambi..  NOW that's what I call great customer service!   I'll be baaaaack....", "author": "Nadine W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-02", "description": "This place is a good example on how you can overcome your cultural limitations.\nGreat food.\nGreat ambiance.\nGreat service.", "author": "S A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-12", "description": "Stopped by before going to see a movie at the theater directly in front of it.This restaurant is AMAZING.Not only is everything on the menu reasonably priced (nothing exorbitant or over-priced here),the atmosphere is very....relaxed  and romantic.The waiters were very helpful and attentive (and served everyone at a lightning speed),also the food is beyond delicious.I'm not very familiar with Haitian cuisine,and was feeling particularly curious,now I'm a huge fan.\n\nI invited a friend one night and she thought that the dessert was phenomenal!She enjoyed the artwork on the walls,too.Overall this place is just rad,if you ever feel like trying something new and enjoy an intimate setting in your eating establishments,this is the place for you.", "author": "Jennifer E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-23", "description": "I took my partner to this restaurant for his birthday and was greeted by Cynthia once we were able to find a table. I must say her service was very warming and attentive. The fact that she is of Haitain descent and speak creole made the experience more homely. \nI wasn't keen on the fact that entrees included 1 side. For anyone who has experienced Haitain restaurants one thing for sure is that rice is an automatic inclusion of any entree and then you would add an additional side. The fact that I had to purchase an additional side seemed a bit much. Lambi was immaculate and well done, my favorite for sure. If we could have other Haitain inspired cocktails besides cremas that would be great. Mojito kind of took away from the homely experience. I suggest another cocktail with haitain rum base. Be creative but keep it home! \n\nVery intimate setting and great area.", "author": "Sandra B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "HANDS DOWN TNE BEST HAITIAN FOOD I HAVE EVER TASTED!!!!!! The rice????? Oh bondye!! EXCELLENT!! The atmosphere is great! The location is great and did I mention the rice??? It is very hard to find a great Haitian restaurant these days and I'm very happy I found this one. I can't wait to go back!", "author": "Jane D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "Excellent food loved everything, would for sure come back. It was my daughters bday and they gave her a free ice cream desert I would recommend this place to all my friends.", "author": "Cherine F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-23", "description": "I am elated that La Caye came to Fort Greene. A good Haitian restaurant was highly needed in this part of Brooklyn and NYC generally. People are continuously asking me, why is there no good Haitian restaurant in NY? Now there is. La Caye, as its name indicates, is where you can go for good home-style Haitian food. Its owners are down to earth, welcoming and eager to improve. \n\nHaving no close Haitian relatives living in NY anymore, sometimes I just go to La Caye for a Prestige, some Haitian flavor and the warm embrace of Ralph, Ronald or Spencer.\n\nMy favorite dish here is the Fritay because it reminds me the most of Haitian street food and because it is not so easy to make at home. I have also enjoyed the new Bouyon special which they had the genius to bring on as the winter got icy. What a life saver! All the Haitian classics (creole chicken, mac and cheese, whole red snapper)  are on the mark but honestly, because this is where I come to revive my Haitian pulse, I would love to see them expand on their regional specials such as tom-tom, lalo etc. I know they have experimented with these but I would like to see them develop this fully.\n\nPlease keep up the good work. With this location, the sky is the limit.", "author": "Myrtle S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-17", "description": "I wish there was an option for less than one star. I'll be honest and say that I haven't actually eaten at La Caye, but the customer service for event planning is a NO! \n\nI wanted to have an Engagement Party here, attempted to reach the manager, Ralph almost 100 times. (I wish I was lying). The receptionist always said he would call back and he never did. I won't comment on the service if you're just walking in, but trying to plan things with this place is terrible. \n\nI tried to support a black business but ehhh....", "author": "Van E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-07", "description": "Delicious AUTHENTIC Haitian cuisine! The Pork Chop is my favorite dish along with the Black Mushroom Rice. La Caye has a very cozy \u0026 intimate setting. On Thursdays there is a live band which adds the finishing touch to this Brooklyn gem.", "author": "Christina S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-16", "description": "The place looks great inside and our waitress was very nice.  I was soooo happy to hear Kompa playing in the background too!  \n\nNot that many choices for vegetarians, so I tried the Macaroni Au Gratin, and Fritay.  Small portions but the food was good. (the piklez wasn't that spicy though). For dessert I tried the pain patate, which was good too.  \n\nDate tip: Haitian Jazz on Thursday nights", "author": "Marjy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-28", "description": "We made it there for date night. We reserved a table shortly before we entered via Open Table, so reservations are pretty easy to make. \n\nThe atmosphere was cozy and I loved that. The presentation of the food was great. I just wished whoever cooked could have taken the salt down a notch. I know we West Indians richly season and marinate our meats, but the salt was too much. \n\nMy husband ordered the lambi/conch and the saltiness took away from what could have been a flavorful appetizer. Even my poached chicken was a little salty. \n\nI just took in a little more water and the conch dipping sauce which was sweet and peppery. Hopefully, this is a one time thing. I will give this place a second chance, because the hostess and wait staff were attentive and happy. I just hope next time, I won't be chugging down water throughout my meal.", "author": "Renata T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-30", "description": "Caye came through when my boyfriend and I were going to a movie screening at BAM across the street, and had 45 minutes to kill.  What better way to do that than to enjoy a quick drink?  \n\nWe found the place next door too crowded, so Caye was the winner.  Even though we were only ordering drinks, we were graciously given a table and treated well.  I had a glass of Malbec and the boyfriend got a Red Stripe, and it was a perfectly pleasant pre-show experience.  \n\nIt's not terribly expensive but it's hardly a dive bar, and I can see coming back to try some of the food that looked really great.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-21", "description": "I'm actually quite surprised that the reviews are so great for this restaurant, though I will give the benefit of doubt that maybe the Caribbean dinner offerings are delectable. Unfortunately, my experience was during Sunday brunch today, and my partner and I were thoroughly dissatisfied.\n\nWe decided to stop in prior to the Pina Bausch performance at BAM. Upon entry, the staff is very pleasant and full of smiles so that's why I give 1 star. The 2nd star is for the environment and ambiance which was warm and welcoming.\n\nThe food was a total misstep for us. To begin I ordered the steak and eggs medium-rare and the waitress initially advised that they only prepare steak well-done. Ummm really young lady, you only offer over-cooked meat which ruins texture and taste. I advised that she confirm and properly have my meat cooked 40%. Which she obliged. I also asked for Parmesan cheese on my eggs which I requested scrambled medium.\n\nUpon arrival, my eggs were over cooked well and dry, they were sponge like and apparently cooked in a pan that was too hot due to the brown tarnish. My steak that I requested medium-rare was well done and the Parmesan I requested on my eggs was melted on top of my steak with the mushrooms. Normally, I would send improperly cooked food back to the kitchen, but due to the start time of the performance I was unable to do so. This was the worst steak I've had in quite a long time; it was dry, stringy, and coarse all at once. I forget the name of cornmeal grits but they were bland. I added almost half the container of salt to make them edible but that still didn't make any better. In the end I ate my meal because I was famished, but my partner didn't fair so well.\n\nMy partner ordered the smoked salmon eggs, and they were even more disappointing for him. The eggs were once again over cooked to the point of dehydration. The smoked salmon was dry to the extent that the texture was compromised. He took 3 bites and finished his salad though leaving the rest of the eggs on the plate.\n\nNow, while the staff was extremely pleasant, they clearly aren't well trained in the manner of appeasing consumer interest. Our waitress never asked how our food was. Another waitress did but her response was remote and she clearly wasn't paying attention because my partner expressed the food was over cooked and dissatisfying but she replied, I'm glad you liked it! We were perplexed because she wasn't being facetious. I don't think she heard him and that was her auto-response. The hostess also asked us the same and when we advised the same, she replied \" oh you should have some fruit and smile\". The busboy asked the same and just had no idea how to respond.\n\nIn the end we were just ready to hit the pavement, because this was an experience we were eager to forget! Hopefully the Caribbean food is better, though we'll never know, because we will not be returning. Please BEWARE of the brunch for sure, thank you!", "author": "William T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-06", "description": "I think I am officially considered a regular at this place. I've had practically everything on the menu and really enjoyed them all. The boulet sliders are crunchy on the outside but the interior is soft. Also very well seasoned. The lambi (conch) in sauce is definitely my favorite. This is a tough dish to make but La Caye did a great job. \nAlso had the red velvet cake for dessert. It's not on the menu but the waiter offered when what I wanted wasn't available. I'm so glad that was the case. For those who have had and enjoy Haitian cake, this will be a treat. If you've never had Haitian cake,  I highly recommend it. It's like a mix between your traditional cake and corn bread.\nI always make sure to order coffee after my meal. So far, it's the best coffee I've ever tasted. It's smooth and strong without that weird bitter taste you get from other so called strong blend coffees.\nThis place has a great vibe, great food, and the servers and bartenders are attentive and friendly. \nI will end with just one bit of constructive criticism. Law Caye should work on being quicker. On a semi-busy night, they seem to falter and you can wait up to an hour for your food to come out. I would hate to go on a day when they are packed.", "author": "Sophie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-12", "description": "The meal was ok. I had Fritay which consisted of fried pork, plantain, pikliz (vinegar based cole slaw) and some fritters. The appetizer, however was OUTSTANDING. It was conch and ot was so flavorful and well cooked. Still thinking about it. I actually taste it even woth it long gone already lol. Anyhoo, in regards to the main course, the Fritay, after requesting some sauce (the Haitian in me), I found it weird that the waitress/hostess was surprised that I was asking for it (then again she may not be Haitian, but its a Haitian restaurant)). The restaurant is a lovely space and perhaps if we arrived a little later into the evening my friend and I would have gotten a bettter idea of the vibe and crowd that goes there. Im going to give this restaurant another chance and I absolutely want to support small, local, and Haitian businesses so next time ill take the leap and order the $29 conch dish along with their peach mint sangria.", "author": "Laur D."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}