{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-05", "description": "Happy to see this restaurant in Clinton Hill/Fort Greene area.  I'm Haitian American, so my Haitian brethren know that Haitian restaurant owners and operators have a reputation for being attitudinal.  The folks at La Caye are anything but.  So polite, welcoming, inviting.  Sold me a glass of cremas off the menu, and gave us a complimentary bread putting dessert.  Made small talk and conversation with us.  So nice, the food was great too.  I had the lambi and meatballs.  Both delicious!", "author": "Mimi V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-16", "description": "i went there with some friends  in  june i was suprise  with a new spot that just open up great  spot .  now i order the appetizers   akra, tassot, fried plantains  it was delicious .  since its a new place the entree menu was limited  however the server explain to us  they are working on the main dishes . i had legume with white rice it was ok  . i love the place and the drinks  i well come back hopefully i can ask for the main dish  try it .", "author": "Ludgi T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-12", "description": "Nice place overall.  Great ambience, nice and friendly staff (at least bartenders) and some good food (I've only tried the creole chicken and sliders).  The wine selection may not be the best but it's decent.  I go mostly for the ambience...it's pretty chill and folks are friendly.", "author": "Anchi S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-30", "description": "The secret here is probably to stick with the Caribbean food, since this is a Caribbean restaurant! We had the sliders - big mistake. But the service was so wonderful, and it's nice to have a spot like this across from BAM. Hope we have better luck with our ordering next time.", "author": "w b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-17", "description": "I reserved for a party of 4 on 2/14/15.  Website accepted my reservation but was not clear that dinner would only be Prix Fixe for Valentine's Day (no regular menu items available).  I came into Brooklyn from NJ and we killed time while waiting for our 3 PM reservations.  At 12:45 or so I received a call from the manager apologizing that the website had even accepted my reservation as that should not have happened since he was booked AND dinner did not start until 5 PM anyway.  He also explained that it was Prix Fixe for Valentine's.  I wasn't happy w/ the idea of spending $65 for each of the four people in my party but figured I would suck it up since we had come so far.  Alas, the manager further explained that he \"might\" be able to squeeze us in but that was not a guarantee.  Visions of standing around for hours with three hungry kids  was not appealing so I decided to bow out and we went to Kombit instead.  So props to the manager for calling me- it could have been worse had I actually arrived to learn all this.  Thumbs down as  he could have made sure we were accommodated.", "author": "Pickles P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "Walked in on a Monday night. Had a reservation but didn't need one as there was plenty of seating and we were seated right away. Place is very cute. We could see the outdoor patio from where we were seated, and thought that it would definitely be nice to go back when it's warmer and sit on the patio. Everyone was very friendly. I had the Poulet en sauce and my husband had the creole seafood plate. Both were very good. I had the mushroom rice as my side which was fine. Also ordered the sweet potato bread pudding for dessert which was not great. The service was really attentive at first, but definitely went downhill. Once our food arrived it took her a long time to come back to refill our water, a really long time to bring our check, check us out, etc. and the wait was only due to her talking to someone at the bar, not a busy restaurant. It wasn't a big deal as we were not in a rush, but something to note. Overall this was a good experience. Definitely a good option for Haitian food. I would go back and recommend it despite the small mishaps.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-12", "description": "Came here today especially for a Mother's Day brunch and was so disappointed! It took about 15 minutes to get glasses of water for the table of four. Then another half hour to get our orders, then about another 45-60 minutes for our food to arrive. One item was not brought to the table along with the rest of the food, so one person had to wait about 10 minutes before starting their meal. The Steak from the Petite Steak and Eggs was way overdone, the Cod from the Morrue Shiktay was way too salty. The jazz music that was from supposed to be from 1PM-3PM was from about 1PM until 2PM. All the employees seemed confused and overwhelmed and though our server, Cynthia, apologized profusely for all the delays, it still did not make the delays go away and the least that should have happened was that we should have been comped a dessert. My mother has been here twice for dinner and was excited to go here for her Mother's Day brunch. Too bad it all went completely wrong.", "author": "Jojo b."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}