{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-18", "description": "Delicious food. Cynthia did a great job serving us. So good, in fact, I would even suggest that she deserves a spa day. Vibes. Major key.", "author": "Ed P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-10", "description": "At the suggestion of a Haitian friend(I'm non Haitian, but married to one) I decided to check out La Caye, because when a \"native\" says the food is good, it probably is pretty good::)\n\nWell, my friend was right.  First, this restaurant is in a great location in downtown BK(right across from the Brooklyn Academy of Music).  Second, when you walk-in, it's a very contemporary spot, but it's still connected to Haitian culture.  Haitian artwork can be seen throughout the establishment on the walls, but it is not the same traditional artwork(which I do love).  Now let's get to the food....\n\nMy wife and I started with the sauteed cod fish.  Bangin, Slammin, and this app came out quickly.  I'm used to(I don' know why) waiting 30 min for appetizers and hours for my entree at most West-Indian(Haitian) restaurants. Not at La Caye.  Food comes out quickly.    I had the Red snapper with Jon Jon(black mushroom rice) and it was fantastic.  I asked my waitress(and everyone is beautiful) if there were a lot of bones and she said while there are bones, they can be pulled out easily, and she was right!  The Snapper sits in a beautiful Creole Sauce and it is extremely flavorful.\n\nLastly, after requesting to speak to the owner, my wife and I found ourselves talking to him for a good 30 min.  What owner gives you that time(and, maybe, of note to some I'm black and wife is Haitian, we're not white.  I'm just saying::).  His passion for his country's food, culture, and the restaurant industry was readily apparent.\n\nI would highly recommend this restaurant and I plan to have fundraisers there for a Haitian University, of which I am a board member.\n\nWay to go, La Caye!!!!", "author": "P B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-26", "description": "Do not come to this place. I came here tonight to celebrate a friends birthday and it was horrible. I don't know how the food tasted because we left before we got our orders....first of all our waiter was rude, hardly spoke English...ignored us...drinks were watered down....what else? Oh yea...the owner...the black man with the glasses was arrogant and rude. We brought out complaints to him about our aloof waiter and he basically didn't care. We left this crapfest and went to viejo yayo on fifth and dean. The customer service was excellent....attentive waiters...polite..friendly..made us laugh...made us feel right at home. Spend your money here instead. The food is delicious....you won't regret it.", "author": "Paule S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-06", "description": "really nice ambiance and great staff who was super accommodating to our large party.  solid food. flavorful, tasty and seemed  authentic ( but I wouldn't really know that ). everything I tried was on point and portions were very generous.", "author": "Nicole K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-13", "description": "So the location, venue, decor and live music (friday night) are all on point. The food is not exceptional... I have had way better food at local mom and pop type Haitian restaurants. I wish the food here made me happy. I would have become a regular.", "author": "Elle K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-31", "description": "The food was the really good,but the service was kind of suck. One bartender was making all the drinks without no help. If you know Friday nights are busiest night, they should have two bartenders work and to help out. My waiter didn't really care, she didn't checked if my tables were okay and if we need more water. Someone else was to doing her jobs. She looks didn't want to be there. Its seems like the day of the end, we going to her pay good gratuity. The music was okay but they kept playing the some Zouk music on repeat. This is Haitian restaurant they should play Kompa, and RaRa(voodou music) also. Everyone know about these music. The place was really nice and small.", "author": "Marilyn V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "Delicious food. Laid-back but tentative staff. Lovely and comfortable space.  Pumpkin soup and chiktay are excellent choices.\nLove! Mesi!", "author": "Anna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-17", "description": "We stopped in last night after a movie at BAM (it's right across the street) and had an excellent meal and a great time.  The place is newly opened so they are figuring out the organizational bits, mostly by trial and error.  Our appetizer took a while to arrive and so did our main course, but both were delicious and, most importantly, out waitress and the chefs (we were seated right next to the kitchen window, so we could see and hear them) had a great sense of humor and patience.  They weren't defensive at all when we asked them to check on the status of our food, and quickly brought it after we asked.  They offered to comp us the wine and desserts, which was totally unnecessary but a great gesture.\n\nIt's Haitian cuisine (probably fusion, and since I've never been to Haiti, I can't really speak with authority), with a fair amount of sea-food, and the restaurant was filled by 9 pm; at least 25% of the patrons were related to the owners, and some of them were teenagers helping to bus tables, which made the place seem much more friendly and relaxed (but not alienating to those of us not related).  \n\nThe decor is a little weird for Caribbean fare -- dark wood paneling that feels Alpine, but it somehow works.  And they have a wonderful outdoor space with a stockade fence blocking off what is probably not such a nice view immediately behind, but affords a skyline glimpse of Brooklyn Hospital, which is an impressive structure.\n\nWe ordered a fairly standard salad to start, and then my wife got the red snapper, which was the entire fish (minus head) in a delicious sauce (not heavy, but lots of flavor), accompanied by black mushroom rice, which was also fabulous.  I got the \"frittaye\", which was fried plantains (tostones, not maduros), some other deep-fried vegetable, and lightly sauteed fish (you can choose fish, beef, or vegetable).  Also fabulous.\n\nIf La Caye had been open for a year, it would get only four stars based on the organizational confusion; but I'm assuming they'll get that figured out, and it doesn't seem fair to hold them to that standard so early on.  They are trying to hard and so good natured about it.\n\nBy the way, they serve brunch and, given the outdoor space, it seems like a great place for that.  But we haven't tried that and so cannot comment.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-25", "description": "Came here twice once with my mom and another with my girlfriends. Can you tell I like it lol ! As a haitian american it is not often you find a haitian restaurant that is trendy and modern with a hint of culture. I enjoyed my meal very much. The portion sizes were just right for an ideal person. Drinks were on point, sak passe mojito was yum. Although they are great things about this restaurant there is some flaws. There is no greeter at the door! On a crowded night like friday, once you walk in, you are lost and must ask random people if they work there. not cool ! La caye means \"THE House\" so wouldn't you want to greet people at the door at your house?!  That was annoying.  Besides that, the owner and his  waitresses know their stuff and are very sweet and helpful. I definitely will be back with more friends", "author": "Fabine L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-30", "description": "Despite a huge hiccup in my confirmed reservation on their part, they've became very accomodating. My reservation was booked online, but accidently during a private event in which at first they made me feel as if I was the one who did wrong. This was very embarassing infront of my mother, who's birthday it was. The manager overheard what happened and came over to apologize  for the mishap and wished my mom a happy birthday. After a long wait, a table was prepared for us. The ambiance was soothing, romantic and amazing at this spot. The food was prepared beautifully and was FRESH to order. It became loud when the private party moved inside which brought our dinner to a halt. My only suggestion is to inform all employees with the correct info when it comes to personal reservations and private parties, and to offer bigger portions. They have a great mixed appetizer platter, we just wished there was more. The macaroni and cheese is to die for! My steak was cooked perfectly. My mom's fish tasted like they caught it this morning, and my sisters chicken was savory. Despite the miscommunication from the set reservation and a separate private event, they redeemed themselves with the ambiance, family style dining and demeanor, and GREAT FOOD. We will give them another chance, which we are sure it will be nothing less than PERFECT! BEST \u0026 MOST AUTHENTIC HAITIAN FOOD IN TOWN. Every gem deserves a second chance.", "author": "Christel J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-02", "description": "The more I come here, the more I love it. Everyone I bring here loves it as well. I am so glad to be able to update this review from 1 to 4 stars. What a difference a year makes! The food is good, not the best Haitian grub I've had but the portions are decent  and they've abandoned that crazy conch(Lanbi)/marmalade combo they were pushing. Now when you order the grilled conch it actually looks cooked and it is served pike and tasty. What really gives this restaurant an edge is its atmosphere though. They have great entertainment and a good vibe although the service was still a bit slow I';m very happy to see such an improvement and hope they'll keep getting better and better. I'm proud of this Haitian establishment and the live music on Thursdays makes it even better. Plus they serve food past 10pm. Bravo!", "author": "Sha M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-07", "description": "its nice in there and all but i gave this place 3 chances 3 strikes and you're out .the first time i went was for a party so i didn't experience the whole menu .the second time i went it was just ok .the third time same outcome.the black rice was ok a true Haitian can tell they just used the black maggi.i also tried the macaroni ,the chicken,pork fritaye,wings,fish everything was just ok nothing exceptionally good. if the food was worth the price i wouldn't mind but its not.they have a good location so that plays a part on all the hype this place gets. you can get more authentic Haitian food from little take out Haitian restaurants.", "author": "Eunice C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-31", "description": "My lovely lady and I went here twice last week, and were fell in love with this place.  First off, the visual presentation of the restaurant was both elegant and simple, with wood paneling, a beautiful bar and and very simple and open patio in the back.\n\nMy girlfriend, who is Haitian, loved the selection of food because it had both main staples and more rarer plates.  The first time we went there we had had the akra (a malanga dish) as an appetizer, poulet (chicken) with the djondjon rice (mushroom rice), as well as a tasting of the crab leg dish, which was all awesome.  It was not heavy at all, and was a great dinner.\n\nThat following Sunday, we returned for brunch, which goes from 10:00 to 3:30 pm, if I remember correctly.  They had complimentary free mimosas, a live jazz band, and a very sumptuous menu.  We ordered this time the alonase omelet, which we both loved.\n\nAlso, a side dish that was beautifully spicy was the pikliz (coleslaw) which added a rich flavor for the omelet.\n\nAs for the service, I cannot say how friendly and helpful everyone was.  Thank you Genesis, and Ralph and everyone else, this is a place that we will visit every time we come to Brooklyn.", "author": "Gene D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-12", "description": "Good spot for a drink before heading to BAM! Seats at the bar are always open. Food is good and inexpensive.", "author": "Steven M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-16", "description": "Great atmosphere, friendly service, really delicious food and drinks. The outdoor garden was really pleasant, and the music was great. We loved the red snapper, the black rice, and the sparkling sangria in particular, but everything was good. Service was SLOW - I wouldn't recommend coming here on a Saturday night if you're in a rush - but as long as you have time, totally worth the wait.", "author": "Beth K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-03", "description": "Go for the food, stay for the ambience.  I love Le Caye, the food is great (although not as good as my Haitian Mom's!) and the atmosphere is fun.  The wait staff is very attentive and professional, that's a big plus for me.  Some nights offer live music as well.  Finally a cozy, upscale (Kinda) Haitian restuarant in downtown Brooklyn!", "author": "Yolande B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-31", "description": "I recently went to La Caye for the first time earlier this week with a group of people. The ambiance is nice, which is plus. Let's get to the rest. By the way, my comments are reflective of my honest opinions and totally based on my personal experience from recently dining at La Caye.\n\nI am Haitian-American so my palate is trained towards deep flavors, namely Haitian flavors since birth practically. Yes, my mother put labouyi mayi in my bibon - makes the baby strong.\n\nBut I digress. \n\nThe food, while was nice in presentation, is not very good Haitian food in my honest opinion. Period. None of the food had flavoring the way good typical Haitian dishes have. It was truly a disappointment because when you know Haitian food, you know that each piece of food is spiced to the heavens with flavoring. Each food item itself tastes amazing. Haitians who have had our good food know exactly what i'm talking about.\n\nI ordered the fritaille griot and macaroni au gratin. Starting with the fritaille: the accra looked good on the plate. Accra is one of my favorite appetizer/sides. My mother makes it, I have had it from another Haitian restau in Queens and I LOVE the accra they serve in my favorite chain restau in Port-au-Prince. Love it so much. So, I know my accra! \n\nWhen I received my plate of fritaille, the accra looked good. When I bit into it, I was astonished to find that it was soft in the center!!! This was truly an abomination. i couldn't believe it. Needlessly to say, I started off disappointed with the accra. It's supposed to be flavorful and crunchy. Not flavorless and soft.\n\nGriot is Haiti's national dish. We eat it at parties, celebrations, or in my family, as a treat on saturday or sunday. I love love love griot. Each piece is heavily marinated and fried. It's so yummy. The griot they served to me at La Caye lacked any flavor.  Now I could tell that they cleaned the meat. Yes, this is a plus b/c most places that serve pork do not clean the meat and the taste is awful. I don't know how people do it. But here, I could tell the meat was cleaned. But as far as flavor, it was lacking and if anything, the seasoning of the meat was uneven. Out of the several pieces I received, there were two that were more flavorful than the rest. After that, I was just eating flavorless meat. Big disappointment.\n\nI received four thinly sliced and lukewarm fried plantains or banan pese as we call it. I was surprised that they were lukewarm as banan pese is best served and enjoyed freshly fried. Lukewarm is not freshly fried.\n\nThe pikliz .....was not pikliz. It was not pique or pimenté. It was just pickled cabbage...so there was just that vinegar taste. There was no heat in the pikliz. I cannot even describe great pikliz. You have to just know it and what they served wasn't it. \n\nUsually you are served with a serving of ti saus for those who don't really want to eat griot with pikliz. Or for those who want both. They don't do that here which is a very odd for a Haitian restaurant. When I asked for saus, the waitress gave me saus from chicken. That's not how it's traditionally done. Usually, you just make a saus from the griot marinade (or a generic saus) and have it available on the side for those who want it. Very odd that this was not available, even upon request.\n\nThe macaroni au gratin lacked flavor as well. The baked cheese on top was a nice touch but that was the most flavorful thing on the side dish. If I couldn't manage to eat the macaroni with the cheese, I was eating flavorless macaroni. Abomination.\n\nI really wanted to love the food here but I was just all around disappointed. The price was also steep for the serving size but I figure the location forces them to have such high prices. But come on. If you are will charge so much, at least make sure the food is on point! \n\nMaybe I came on a bad day. Who knows? All I know is is that I know my Haitian food and what is served here just doesn't cut it in my personal opinion. People who rave about the food just don't know Haitian cuisine in my opinion.\n\nThe customer service could have been better. I was with a group of people. They would come over and ask in English questions like if we needed anything or if everything was ok. I was with some Haitian nationals and so I had to translate. The waitresses might have known this bc my colleagues ordered their food in kreyol. Needless to say, they would ask their questions and after the other people answered in english, they would walk away. By the time I finished translating (1 sec practically)  and turned over to respond for my colleagues, they were no longer at the table. They'd be standing over by the bar. When it happened the first time, I thought it was a fluke. But it happened several times throughout the night with both waitresses. I don't know why they were rushing because all they would do is go stand over by the bar or stand by that door that led to the kitchen. It was a bit frustrating and turned me off big time.", "author": "Lindsey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-25", "description": "There's a very warm, nice, friendly vibe to the restaurant.  First time having Haitian food so I have no idea if the food was what it's supposed to be.  I ate it and was happy.  I do think it's authentic bc the cod fish smell hit you in the face whenever it's being prepared in the kitchen.", "author": "Andrew L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-06", "description": "Stopped through this past weekend and finally got a chance to eat. It was so good we ordered it twice (conch w/ black rice). OMG. Amazing! The food is for sure worth the trip to BK from the city.", "author": "Bre J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-02", "description": "This restaurant is very convenient for BAM, and honestly the food isn't bad.  However, the management is dishonest and uninterested in customer satisfaction. I had dinner at La Caye in May.  There was an error in the bill that I noticed after I'd paid with my debit card,  and I informed the waitress, who \"voided\" my bill and billed me again, correctly.  When I received my bank statement, thought, I noted that I had been billed twice for the meal, i.e, the first bill was never actually  voided.  I phoned the manager, who assured me he would take care of this matter.  But he never did.  I made at least 20 phone calls to him, leaving increasingly urgent messages for him to get back to me and resolve the problem, but he was unresponsive.  To this date, 2 months later, he has yet to refund the money from my voided bill.  I will not be eating here again, despite its convenient location.", "author": "susan m."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}