{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-21", "description": "I went with my father who was born and raised in Jeremie, Haiti. \nHe loved the food so much, it is \"authentic Haitian food\", according to him. I was also pleasantly surprised by the food, it was one of the best Haitian food I had in New York. (Even my American boyfriend loved the food!). \nWe went back the next day for my father to taste their special Easter menu and it was as delicious as the day prior - \"one of the best Haitian cuisine that he has ever tasted\". \nHats off to Larissa, the chef! I highly recommend this place and will come back for more!", "author": "Sandrine J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-27", "description": "La Caye was like a taste of home. The food was great, the ambiance is nice, and the prices are very reasonable.\n\n***please note Haitian/Caribbean restaurants take a WHILE to prepare your food. So if you don't think you can wait 20-30mins you should pass.***\n\nPersonally I would like to see more Haitian restaurants like this throughout NYC. It will definitely aid in breaking out Haitian cuisine to the mainstream.\n\n**Recommendations**\n\nPork - The Golden Ticket Fritay Platter\nChicken - Poul An Sòs/Poulet en Sauce\nFish - Poisson Rose\nRice - Djondjon Black Mushrom Rice\n\nIn regards to the fish I can't remember if it was with bone or a fillet. Either way these three dishes are both traditional and highly recommended by my friends and I.\n\nAnyway I hope this was helpful and opens you up to Haitian food.", "author": "Eddy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-20", "description": "We went here for dinner after viewing a few shorts at the BAM Rose Cinema across the street. As the evening continued, we watched the restaurant and bar fill up with patrons.\n\nWe dined on the grilled conch, the fritay platter, the black rice, and the arugula salad.  All were quite tasty. We even had the honor of being waited on by one of the owners, who was pleasant and accommodating.\n\nIf you want to support a Black-owned businedd serving authentic Haitian food in one of Brownstone Brooklyn's best neighborhoods, La Caye is a sure bet.", "author": "Crystal W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-30", "description": "They need more of a drink menu. They would not go out of their way to make a classic drink that was not offered on the menu. I'm Haitian but don't ask me what I ate because none of the dishes were typical. My mom and grandma cook way better ..", "author": "Pascale D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-12", "description": "This is a nice place with cool live music on Thursday nights. The service is quite slow, and the food wasn't very good, I ordered the fritay platter and in my opinion it was overcooked and too dry. The music and the atmosphere were nice, but I particularly wouldn't come back.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-06", "description": "I can't believe it took me so long to check out La Caye! I had dinner at Le Caye one Friday evening recently. \n\nBoth me and my friend ordered the fritay platter, hers with fish and mine with griyo, and an order of mac n cheese. Everything was absolutely amazing!!!! The platter included fried plantains, fried accra, and a serving of pikliz. The fish was amazing. The pork was extra tasty. It was my first time having fried accra, which was also amazing. Everything was fried perfectly-- crispy on the outside and just right on the outside-- and well seasoned.  We were also served gravy which was pretty tasteless to me but thankfully the platter didn't need much. \n\nMinus one star for the lack of spiciness of both the pikliz and the hot sauce. The pikliz was still super tasty and I asked for more of it to have as a mini salad (just how i role), but that hot sauce was kinda unacceptable for a Haitian restaurant. \n\nI will be back though, with a friend, a date or some eats at the bar.", "author": "Maria M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-15", "description": "I moved to NY in 2011 and been wanting to eat here almost that long. Finally, I made it. My girl and I met for dinner and overall it was a great experience. \n\nSo, the drunk that I wanted, wasn't available so I had a Bellini that left a lot to be desired. However, our meals were cook slapping worthy. She had the conch with plantains, I had the whole fish with black rice, and we shared a mac and cheese and the pineapple upside down cake. Everything was good, but, BUT that mac and cheese........OMG!!!!  It was so amazing that I totally forgot to take a picture!!!!", "author": "Jeanene B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-07", "description": "As a young Haitian American I really really wanted to support La Caye Restaurant. I went there with my husband after a show at BAM on a Friday night. We entered, looked around, and waited for someone greet us (shouldn't someone be at the door welcoming customers!?!) but no one came, instead we walked up to the bar where a young lady was serving drinks. \"Table for two?\" She asked. About 5 mins later we were seated but the area was TIGHT (whatever we will make it work). Moments later another lady comes and drops off two glasses of water at our table without saying anything \u0026 briskly attempts to walk away(umm... hello to you too?!?).  Before she quickly leaves we tell her that we are ready to order since we've been waiting a long time after being seated. After placing our orders the food took what felt like forever to arrive. Part of our order came then about 10-15mins later the rest came out not hot but cold. What's interesting is the restaurant wasn't even packed. \nOkay so we've already confirmed that customer service sucks ...now let's try the food. We ordered Creole chicken wings, black mushroom rice, macaroni au gratin, and kabrit la caye. It was all okayyyy nothing worth raving about. The drinks however were good, I can't remember the names but it was good. Overall, I don't think I'll be back there. As I mentioned earlier ... I really wanted to support my people but that night was a horrible experience.", "author": "Liz H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-07", "description": "This was my first time trying Haitian food, so it's hard to compare. The food was good, but the service could be better. The staff failed to check on us for large gaps of time. There weren't enough utensils to serve the food either. We ordered the red snapper, goat, conch, plantains, and black mushroom rice. The goat was definitely my favorite and I don't believe the food is normally spicy, so you have to get the pikliz (spicy condiment) to add in a kick of heat.", "author": "Christina T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "We came to La Caye after seeing the Adrienne Kennedy play \" He Brought Her Heart Back in A Box\" at The Theater For A New Audience. After seeing what I thought was a beautiful yet heart wrenching masterpiece, we were ready to eat some dinner! La Caye has been on my to-try list for some time and it is conveniently located about a 1.5 blocks away from the theater. In other words, it was meant to be-lol.\n\nBoy was it cold and we were so happy to get inside the restaurant! The hostess greeted us at the door. We viewed the menu before choosing to be seated in a warm section towards the back area. La Caye comfortably seats groups of people as there are dining table settings as well as bar stool seating. Tantalizing aromas lingered in the air as patrons were eating their meals. Our server welcomed us and we ordered. \n\nThe Peach Green Tea Sangria is an acquired tasting cocktail and I was told that the Wildberry Spritzer was refreshing. Entrees come with a side order so I had the Steak Paysanne which includes sauteed spinach. Such divine, juicy, flavorful Steak that I had the pleasure of eating with delicious Peppercorn sauce that is on the plate....just between you and me I went back to La Caye this week to have more steak!-lol. My side order was the Macroni Au Gratin aka Macaroni + Cheese. Some of the best Macaroni and Cheese I have ever eaten....Ever! My +1 enjoyed the Meatballs and Mushroom Black Rice.\n\nI give La Caye 4 out of 5 starts for 2 reasons. It took quite some time for us to receive our food and we wanted to try the Pineapple Upside Down Cake which was sold out! The server stated that she was unsure when there would be more of this popular dessert.  Hopefully, it will be there the next time I visit.\n\nAll in all, I will be back soon for a 3rd time because I need that Steak and Macaroni Au Gratin in my life!", "author": "Alexis M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-06", "description": "Really good food. Pretty decent price. The bar options were somewhat limited, but it gets the job done. I've been here a few times, and while the food has always been good, the law of diminishing returns has applied with each visit. \nThe service is very middle of the road. The servers are competent and execute the job description, but don't expect much conversation or exchanges of pleasantries. \nSometimes, the place can get really busy, so err on the side of caution and reserve a table just in case.", "author": "Jude A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "THE GOAT IS LIFE CHANGING. \n\ni've recently started appreciating the finer things in life like smoked beef and wagyu steaks. and among them all, the kabrit appetizer that i shared with my friend has risen to the top. \n\nthe goat meat was heaven in my mouth. so tender, so perfect, so savory. incroyable.\n\nthis place also strikes that perfect balance of not trying so hard at decor that it's relaxing and reminds me of europe or some other restaurant that seems to have a real love put into it. love this place and can't wait to come back. i've only been here once but it already evokes a little homey oasis.", "author": "Nancy H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-09", "description": "I am Haitian and this was just sad. I know what quality Haitian food is and this isn't it. The restaurant itself is nice and well lit for a romantic date but it wasn't a good representation of Haitian food. The black rice and chicken was 7/10 and the DRY griot with plantains was 5/10. It didn't even come with sauce. Worst of all was the service. My waitress had long braids and I forget her name. She was awful. She ignored us. I waved at her so many times to get her attention and she just turned around. I would have rated 3/5 stars but her service made me take a star off. Also, who runs out of piklis????? That appalled me lol", "author": "Neissah R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-13", "description": "I've been frequenting this place for years. The venue couldn't be in a better location, right accross the street from BAM. They've gone through many changes in the decor but it has remained cozy and intimate. Great art work currently hanging on the walls from a local artist. Lovely backyard for the summer, big enough to fit a large dining table. \n\nThe bar. Main reason I have been coming through lately. The vibes are great. I like that any given night, it can be filled with a young Haitian crowd. I've come to know the bartenders and they are mostly attentive (not as much on weekend nights). I usually go for their sangria, my favorite being the white peach sangria.\n\nThe food. Sadly, it's been touch and go. I've had nights with good meals and others were the food was oversalted or lacking spices. I've had luck with their black rice and seafood dishes. The fritay appetizer has been more consistent (I ask to take out the akra and keep it mostly plantains). As far as their entrées, nothing I've tasted has been 'Haitian' spicy. I'm hoping they are not watering down the food  just to please a certain crowd.\n\nOverall, this place continues to carry potential as one of the few successful Haitian restaurant running in Brooklyn. I'll keep frequenting and mostly going to their happy hour. \n\nAtmosphere 4 stars\nFood 3 stars\nService 3 stars", "author": "Annie T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-06", "description": "Came here for a birthday dinner with friends. Had a good time listening to live music (Thursday night).  The band played cover songs; a lot of Bob Marley. It wasn't too loud that you couldn't enjoy your meal. \n\nWould have enjoyed sitting outside but it was closed off. \n\nService was okay. Waited a bit to put our order in and get our waters refilled. \n\nOrdered the award winning Lanbi entree. It was a lot better than the grilled version! Small black rice accompanying it. \n\nPretty pricey Lanbi ($35)\n\nI didn't get to try the griot but my friends said it was good.", "author": "Jade B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-24", "description": "I've come to this place on two occasions. Last July 2017 and the experience was good and the food was bland. \n\nI came here again last night, 2/23/2018. My friend and I walked in and there wasn't anyone at the front. So we went to the further end of the bar to get service. We waited to get someone's attention. Finally, a hostess came to us and we asked to be seated for a party of 4 and a baby stroller. The place is small but there was an available able for 4 and other two person tables available as well. \n\nShe looked around and seemed confused and walked off. No notice or anything. Another hostess saw us still standing there and asked if we are waiting to be seated. My friend said we are looking to get seated for 4 and a baby. She looks at the available table and was about to seat us. The original hostess yells and says \"I said wait a minute. I'm the one helping you guys\" \n\nMy friend, myself and the other hostess had looks of embarrassment on our faces due to her behavior. We waited at the bar. \n\nFinally she comes back and asks if we have a reservation. We say no. And says it's busy and it's better if you want a reservation or the wait will be about 20 minutes. We say sure, we will just sit at the bar. It's now 7:40 (we walked in at 7:30). We make a reservation for 8pm and let her know. She says yeah but clearly there isn't anything available. Ma'am there are seats right here. But I digress. \n\nFinally we get seated. To make matters worse. It took over an hour to get our food. We watched a party of 4 that came after us get their food. A party of food get their food. We couldn't ask the same hostess because no one came to check on us. \n\nWe had to wave down the bartender who said 4 more minutes. 10 minutes later another waiter comes and apologizes and says the food is coming. \n\n\nFood comes. Luke warm and tasteless. We spoke to the manager and he just kept asking me who the waitress was that gave us problems. Sir, you know who you put to work here. Don't ask me that. I ain't no snitch lol. But he ended up compensating us for a meal. \n\nHonestly, this place overall lacks service, taste in food and is overpriced. Two visits are more than enough.", "author": "Jemima C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-30", "description": "I spent over three hundred dollars on this restaurant that is usually great. THE FOOD HAD NO SEASONING!!! THE CHICKEN HAD NO COLOR!!\nI have a house full of Haitian people that gave me the side eye!! Never again! Merde!!!", "author": "Steve S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "The setting is really nice, intimate and warm like Sunday dinner in a Haitian home. Food was delicious. Will definitely be going back. I'd recommend it to anyone whom haven't had Haitian cuisine and to those who wants to eat like they were lakay back home... 5 star for hitting the spot.", "author": "Jerry D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-07", "description": "Our server's attitude was very dry/borderline rude.  We ordered our drinks 3 times, with 2 people before they actually got to the table.  They were out of rosé so I ordered Prosecco instead and it was flat.  We ordered appetizers but the waitress didn't come back to take our orders until we asked.  The food took quite a bit of time to come out and our waitress didn't come to check on us during that time. We had our water refilled by someone and no updates on the food. We waved someone over to ask, and he checked for us.\n\nFood came out and wasn't as good as normal. My boyfriend's dish came out 5-7 min after the rest of ours arrived.  At the end, a young man came by to ask how everything was and we told him it was fine except that the food took a long time. He waved the complaint off and started telling us about a crab cake they have that we should try...after we had already eaten. \n\nAnyway, service and food quality seem to have gone down but maybe it was an off day.  I'll give it another try and hopefully they do better.", "author": "E. V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-21", "description": "Came here with my boyfriend, the food was delicious the service was a bit slow but totally worth it just don't seat in the front during winter.", "author": "Talisha S."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}