{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "A bit pricey for the food you get, but excellent service, ambiance, location, and cool diverse crowd makes up for it.\n\nIncluding tax and tip, an entree and and drink will be about $30-35 per person. Ordered poulet en sauce/creole chicken ($17) with plantains on the side. Also ordered a peach green tea sangria ($8) which was awesome - peach slices on the bottom - so good! I only drink every once in a while and reading the description alone sold me. Chicken was indeed fall off the bone as others have described and very flavorful. The red sauce adds flavor without being overhwhelming. It consists of a leg and thigh. Side dish came with about 5 or 6 fried plantains. Left feeling fairly full.\n\nService was great from waitstaff to assistive staff with refills, etc. Overall I'd say the food and prices are in par with places nearby, so I'll definitely recommend to others. I haven't had enough Haitian food to decide whether this counts as a real Haitian experience, but I look forward to finding out.", "author": "Cathy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "Overall , the food was great . We ordered the Chiktay as an appetizer and entrees were Lanbi with Macaroni Au Gratin and PorkChops with Djon Djon Rice . The Lanbi has a spicy kick to it which was great , Chiktay Arranso (Herring) was very flavorful . Our waitress Cynthia was very pleasant .\n\nImprovements needed in the following area : it seems like the long wait is a norm as a result of the small kitchen space (fact)and limited cooking staff ( I'm assuming ) ... With that said , some type of \"nibble\" food should be provided as guest wait for their food . Other than the long wait time , despite reservations we were happy with food and service provided . \n\nWe will definitely return but not on a completely empty stomach ... Lol", "author": "Jennifer P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-04", "description": "Not real Haitian food, it's very bland.  The portions of the seafood are really ridiculously uneven. My friend was given five normal sized crab legs \u0026 I was given skinny broken ones, it appeared to be just two. Nice environment though.", "author": "Chelsea M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-16", "description": "This place is nice, the food is decent but not the best Haitian food I've had. The macaroni gratin was delicious.", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-31", "description": "One of the nicest Haitian restaurants. Great atmosphere, excellent choice for dinner before a BAM performance. Food is good and the service attentive.", "author": "Yasmine A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-01", "description": "Sadly the only review I can write is a negative one. I came here with my MOH for brunch on 3/26/16. After circling for blocks in search of parking it was closed. She made a reservation on OpenTable and it was advertised on their website that they are open for Saturday brunch from 12-4pm. No signage was on the door indicating why they were not open. Would have loved to experience the food, maybe another time.", "author": "Shana J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "Nice place. Food selection isn't as expansive as Kombit but the taste makes up for the lack there of. Their accompanying bar next door Thirty Three Tapas Bar Lounge is a GREAT after spot esp on Thursdays. They have great wine, drinks \u0026 music. If you're into Reggae,Haitian, African current music DJHard Hittin Harry will have you feeling like its Saturday 2AM in you local fete.", "author": "B A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-18", "description": "Disclaimer: When you eat the cooking at home, you have the right to be a bit critical lol\n\nSo my experience here was real quick. I'll get right too it.  I came in and had a beer and fritay with a family member. Needless to say this fritay paled in comparison to my spot across town. Now don't get me wrong it was decent, but it did not taste like the authentic cooking I get at home. \n\nThe griot had too much fat for my liking and I found the taste of the akra was different than what my palate is accustom to (but hey everyone has their own interpretation ). The pikliz weren't spicy at all. I was told by my cuz that you have to ask for the batch with extra pima (spice). By then we had already finished. \n\nOther than that, it has a great ambiance and friendly staff. I would like to come back and give this place another try.  Next time I'll have an entree with their secret stash of spicy pikliz :-)", "author": "Jennie J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-10", "description": "this was my first time visiting this restaurant. The place is very small compared to the photos on their website so this place is only good if ur going with one other person or 2 because u will be clumped up on people because the table are so close to each other. So I order the the tilapia in sauce with black rice and conch with black rice and a whole fish with black rice. Everything is portion controlled As a Haitian myself I was surprised because other Haitian restaurants usually have bigger portions.. The rice wasn't cooked well a bit hard. Our waitress seemed like this was her first night on the job she could barely Remember 2 specials they were offering that night. It was an OK not impressed at all", "author": "Gabriella T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-17", "description": "Ok People - We have a new eclectic Haitian Spot in Forte Green besides Kombit................ The restaurant is about a week old and I had the pleasure to experience BRUNCH on Saturday with a live band playing the cool sounds of the Haitian culture........... Brunch was delicious! \n\nI invited some friends who were not of the Haitian culture and loved the food and the ambiance. My food was really good.......... we had the following:\n\n1. Cod Fish sliders......... delicious........ this dish is served with mixed greens\n2. Boulette sliders (Beef Meat Ball sliders)............. this was also good but a bit overcooked...... less done would have made it juicier....... the others ordered two servings of this dish................ actually we ordered 3 servings of the cod fish cakes and two servings of the beef sliders (Haitian Style)\n3. Herring Omelette with boiled green plantain (you could have this dish with boiled green plantain or avocado or french fries - My friend cleaned his plate.\n4. Smoked Salmon Omelette............ my friend cleaned her plate.............. LOL!\n5. I had the steak and eggs............ this dish was also good.......... delicious!\n\nSo my friends raved about the sangria......... the might have ordered three rounds each............. I did taste it and it was really good. I had settled for the Mimosa... Next time I will order the sangria.........\n\nThe place is really nice.......... there is also outdoor seating in the back yard - which is really cool........... I am just really happy that we have another place besides Kombit where people can enjoy Haitian cuisine............\n\nMy friends really enjoyed and was glad that they came out!\n\nI will be back to have dinner............. and will leave a review regarding dinner.....\n\nHappy Eating!", "author": "Nadia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-19", "description": "First timer to restaurant \u0026 Haitian cuisine Thurs. night-Made reservations and seated immediately:) Wonderful band playing and restaurant was busy. Our waitress was attentive and the food was delish! Yes some dishes are spicy but the waitress was upfront about the type of heat to expect. Shrimp n grits isn't the U.S. South version, but good. The pork chop (great!), goat (very filling \u0026 had leftovers) \u0026 I love the mushroom rice. Overall nice evening and well worth the train ride!", "author": "Dee E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-07", "description": "I went there on a Sunday and the food was delicious, staff is friendly and the ambience overall was nice for a Sunday", "author": "Aracely B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-02", "description": "The food her is absolutely delicious! It makes you feel like\nYou are \"la caye\" (at home) in Haiti! Come enjoy some authentic Haitian cuisine, piklis and some ginger mint sangria!", "author": "Kendrew H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-08", "description": "As a haitian american the food was impressive yet not exciting!  I came here one evening with my mother( 100% bougie Haitian). The decor is very nice upscale and modern. I did have a issue with the voodoo painting masquerading as haitian art! \nI had the Acra (Fritalle) appetizer and Legume with diri don djon(Black rice). My mom had the fish! \nThe food was good i was just expecting more from an establishment such as this. All in all. Very nice restaurant basically haitian food for those that have never been to nostrand ave or past barclays!", "author": "Randy M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-19", "description": "We got suckered in by the large crowd but experience was poor enough that we cant recommend eating there (or again).  The food took almost an hour to come out, it was overpriced for the size, quality, and preparation.   We ordered the pork chops (~$22), assuming it would be the typical large and high quality cut that restaurants usually serve for that price. Unfortunately the cut of meat more resembled a piece from the butcher that runs a dollar or two, it was overcooked, and lacked flavor.  After waiting all that time for the food, the pork chop felt like a cruel joke.   I would have given one star but the staff was nice.", "author": "C J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-03", "description": "The space is lovely. We were highly disappointed with the service and the food. \n\nThe service was terrible. The food had no flavor. I chose this place based off several recommendations. I should have done my own recon before bringing my date here!! Ugggh. The hostess was very nice. Our server was nice at first but she became condescending and rude. \n\nWe chose to sit out back to take advantage of the sunlight but it was a little cold. I asked if they were gong to turn on the heat lamps. It was a flat out, matter of fact no. Okay. The table was dirty with glass ring marks. I could feel the street soot on the table top. \n\nI am trying to enjoy my date. I am just making do. In my old former self I would have requested another table. I was trying not to make a big deal.  We already had a bottle of wine from the bar. We decided to try their Ginger Basil Sangria. The Basil looked like it had seen better days and the paltry amount of diced friut was unimpressive. We were still working on the wine bottle so we were not touching it until the meal portion.  Not dure why the brought it out. The table didn't have much space for anything.\n\nWe finally ordred:\n\nRara which I thought would be delicious, because how can you go wrong with potato salad with beets in it?! Well you can and it did. It was poorly presented it was a mound of potato salad in a sea of hard boiled eggs, carrots and scallions.  It was bland. It had no seasonings of any kind. Mayo, beets, potato.  No salt. No pepper.  Even after I doctored it with salt and pepper it still had no flavor. \n\nAfter 30 minutes of waiting we were told we're not getting any food for dinner.  After the initial shock and awe kind of wore off, I said come again? The kitchen had malfunction that caused a fire extinguisher to go off so she said that kitchen will not be serving any food. My date wanted to know about how long it would take them to clean up the kitchen and she didn't have an estimate and was not sure. I asked her if they were comping our bill for the inconvenience she scoffed kind of laughed and said no you might get 10% off your next visit. (Insert look of horror here).  \n\nAfter much soul-searching and debate we decided it was too late to go to another establishment because we're on a tight time schedule. We would still have to wait at another place so we decided to stay and finish our meal.  We asked if they had any appetizers we could consume while we waited and she ssid you can have another salad.  -_-  \n\nWe decided to move inside because it was so cold out on the back porch. After another 30 -45 minutes our food arrived. \n\nMy date ordered the Poisson Rouge or the red fish with black mushroom rice.  I ordered the Creole chicken with their version of mac n cheese. \n\nAt this point we are ready for the Ginger Basil sangria situation. It was watered down. #Fail\n\nOn a scale of 1 to 10, 1 being terrible 10 being all kinds of awesome.\n\nPresentation 1\nTime wait 1\nService 1\nTaste 1\nDecor 10\n\nBoth proteins were presented in a pool of red sauce.  The only thing palatable was the black mushroom rice.\nThe fish had scales. He looked sad. Poor red snapper had to give his life for such a poor send off. \n\nMy chicken tasted like they sprinkled a dash of Adobo on it. The mac n cheese tasted like it had seen better days. It was dry, but it almost had some potential. I didn't finish it so I will never know. FYI I don't tip on lack luster service and poor food but my date said we just won't come back. Just like that. \n\nThere was a lot of chaos in the kitchen. We heard a lot if yelling and screaming. Our waitress literally yelled back but why are you screaming at me? -_-\n\nI wanted dessert but I told him we should go elsewhere. \n\nThe waitresses were doing that waitress huddle, so getting our server was hard. Getting our check was even harder. And getting her to come back for the check...well we just left it on table.\n\nBased on this experience I don't recommend this place for eating.  Le sigh I had high hopes for this place. It's in Brooklyn, we are trying to support our local businesses.   We normally do Manhattan.   Shouts to the chic who couldn't be bothered to wash her hands or flush the toilet before me... -_-\n\nWe're done here! Sak pa se and alla dat.", "author": "veranda b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-03", "description": "La Caye is not a bad restaurant. I wouldn't say it is great but not bad. \n\nPro: The decor is absolutely gorgeous and the vibe is just right. \nCon: Price. Haitian food is quite simple and therefore should not be expensive. \n\nI am Haitian so I came with certain expectation. While I didn't like about La Caye is that the food is not authentic Haitian food. I would say it is Haitian inspired and changed for those who are not familiar with the cuisine. Do not get me wrong, the food was good but I did not get the home-style Haitian experience. In addition, the pricing was outrageous for what you get. The portions are not that big. In fact my friend and I ordered 2 appetizers and shared and honestly should have ordered a third because two was not enough. I would come back but only to introduce a non Haitian friend the cuisine of my country.", "author": "Gregory J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-25", "description": "Finally got the chance to go back. The acra and lambi/conch roll were good. Really love their black rice, it was very tasty - perfect combination of salt, a hint of spicy and goodness :)\nThe legume was a bit disappointing, i think they can make it better. But the griot was still good. Tender meat and very tasty. \nPlus: the seats by the bar have electrical outlets. How awesome is that!!", "author": "kem p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-15", "description": "Great Haitian food. I have tons of Haitian friends and this is the closest dining experience I've come to their cooking in NY. I started with the conch then griot both delicious. I also tried the codfish boulet it wasn't very appetizing. Additionally I had the macaroni and mushroom rice which were both great.  I recommend dining here. Great job to the owner and staff", "author": "Sele G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-09", "description": "My first time trying out Haitian food.  I wasn't sure what to expect, so we made a reservation for 7pm.  Upon showing up at 6:45 the waitress seated us promptly and showed us a menu and explained the specials to us.  \n\nI tried the Prestige beer (Haitian beer) which I thought was decent.   I then ordered the black rice, and the beef fritay.  I was amazed at how good the black rice was and the fritay was excellent.  I could hardly finish the plate and left feeling so stuffed that even now as I write this a couple hours later I'm still full.  \n\nI would really like to try more at this place and look forward to coming again.", "author": "Jeff G."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}