{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "We planned a party for 25 people on the Patio of La Caye last week-end ... Everything was perfect! Ralph was so helpful and accommodating to plan the details, the table was charming, the service impeccable and the food delicious. Our guests had an amazing time and the event was memorable. THANK YOU to everyone at La Caye from the Celestin family ... We will be back on our next trip to Brooklyn!!", "author": "Melanie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-20", "description": "Just walked out of this place furious and frustrated. Had a reservation for 5:45, because I have theater tickets with a 7:30 curtain. We ordered off the theater menu the minute our server asked us what we wanted, and waited for an hour without being served, as we watched others being served, even though they were seated after we were.  After waiting for an hour without food, and after being told it would be right out and watching others eat, we decided to leave. At this point, I would not enjoy the food anyway, if it ever did arrive. I was on time at 5:45 for a reason. I  wanted to have a good meal without being rushed. LeCaye ruined my evening and I will never come back.  This is the second time I have been on time and waited too long for food at this place, so I know now that the first time wasn't a mistake. AVOID THIS PLACE IF YOU ARE ON A SCHEDULE.  Feel free to go if you have 3 hours for dinner and are not due anywhere, because the food is actually pretty good. I would give the place no stars if I could.", "author": "Roland R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-18", "description": "Excellent service. Delicious food. Our waiter,Wendy,was exceptional. Have been here many times and always a hit!", "author": "Godsgem N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "Excellent food and great service. If you've never tried Haitian good there is no better place to start. We had a delicious red snapper with a flavorful tomato broth and also a vegetarian smokey eggplant dish that I could eat every day for a week. The staff couldn't be friendlier with speedy service to boot and it's right across the street from BAM.", "author": "V D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-11", "description": "Far from a hole in the wall; La Caye Restaurant located in the heart of Brooklyn is the epicenter of Haitian Cuisine. With it's elegant ambiance, softly played native Zouk Love music, and beautifully plated food; it's not only attracting Ft.Greene locals but people travel far to have a taste of La Caye. \nIt's never a boring night at La Caye. Entertainment is often a favored choice of this hot spot with Poetry nights, Exhibitions by popular Haitian Artists featured in the NY Times, and other participating current events. La Caye is perfect for first dates or continuous dates, celebrations, and other special events. It's romantic atmosphere will make you fall in love on your first visit.\nThe customer service is immediate and attentive. Though the food is not served in large portions it is hot and oh-so yummy! Do order traditional appetizers Akra or Fritay; it's fantastic. They even have a Legume to satisfy vegetarians leaving no excuses for anyone who's curious to taste quality Haitian food.\nIf you have a taste for wine, La Caye offers a variety of fine selections from dry, medium red to sweet white wine.\nI usually have dessert first in case I have to run I can say \"at least I had dessert\"; however in this case, I saved the best for last. Their sweet potatoe pudding is to die for. La Caye is quite the dare-devil serving this sweet delicatessen in a Creamas dressing with strawberries. Absolutely loved it!", "author": "Sandy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-27", "description": "I come to this restaurant for dinner and for after work drinks. They could use a more robust bar selection, but overall the food and service is always great. It's my Cheers and I enjoy bringing friends there or sitting at the bar and meeting new people. I hope it  stays in that location cause I love that it's across from BAM and new people are learning and experiencing Haitian cuisines.", "author": "Jodine D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-18", "description": "It was good, solid. Crowded cause it's small but like da name means, felt like ya coming home. Service was a bit slow in the beginning, but really sweet, apologetic waitress to make up for the delays. They were VERY busy on a Sun eve. Met da owner n he was a class act. He's been in restaurant biz over 24yrs. But La Caye for only 2yrs, not sure? He owns another restaurant in CT. He gave us complimentary cocktails after din, as well as the usual b'day cake/ice cream in celebration of wifey's b'day. There were 4 separate b'days in there all happening n everytime one got surprised with their cake/ice cream -- which btw was TOPS, the entire restaurant -- all parties, sang it out loud for everyone! I did say it felt like home...", "author": "Mister M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-31", "description": "Terrible service... Food was eh.. As a Haitian american .. I was highly disappointed.. Ordered drinks .. Came very late.. Waited for almost an 1 hour 40 minutes for food.. Waiter claimed it was a full house.. Maybe it was a bad night as far as staff but..the food was not worth the money..They had a live band as well... Which did not sound Haitian at all.. Sounded like some high school students learning to play world music. If you like Haitian cuisine do not come here.", "author": "Cass B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "Though the food took forever to be served, which was probably due to the size of our crowd, I was impressed. Since I moved from Miami, this is the first Haitian restaurant that's worth mentioning to my non Haitian friends. A modern environment, decent waiting people, cool owner, good music, and some damn good food. I will be in later on today for a part two of my confession and some Lambi Boukanen ak Sos!", "author": "Serda S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-26", "description": "Nice wait staff but slow kitchen. Food is uneven , good salads but peppery main courses. It is near BAM but leave two hours to eat if you do not want to worry", "author": "Sarene S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-26", "description": "Nice little atmosphere but food was disgusting. As a Haitian, I must say  I was embarrassed. I was with non - Haitian friends and I always brag how delicious Haitian food is. This place proved me wrong big time. This place gives Haitian food a bad name and not to mention the pricing and quantity was ridiculous.  Won't recommend.", "author": "Angee M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-25", "description": "We found this restaurant to be elegant and appealing. The ambiance was upscale with a nice bar scene, comfortable tables, and lovely Haitian art on display. Our waiter was gracious and attentive without being hovering. He made some menu and beverage suggestions when we asked, and his recommendations were excellent. Our entrees and appetizers were very satisfactory. They did not have my first choice entree, poisson, but the chicken poulet was well prepared and tasty. My partner had a great seafood stew. The owner spoke with us at length for a very pleasant conversation. I note, this was a weekday afternoon and the restaurant was not crowded. \n\nLa Caye earned a high rating from us--the food was very tasty and the portion sizes were great, the personnel were hospitable  and efficient, prices were reasonable, and the location is perfect for theater and arts patrons.", "author": "Janet D S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-17", "description": "This was my first time going to this spot. I had a blast! My mom and I went to see the live band. My friends were providing the live music. Which was very entertaining. The crowd was very friendly. The food was good, drinks were cool. It is a small space, but overall I had a good time, I would go again and recommend to more friends.", "author": "Cheree A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "The manager was soo nice and accommodating to my party size of 13. The food was great and so was the service.", "author": "Catherine D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-18", "description": "Great spot!  Visiting family for Easter and happened to stumble upon this gem.  I gad the herring chiktay as an appetizer, which was the best part of the evening.  Followed up with a wonderfully seasoned lambi accompanied by black mushroom rice.  The flavored made my taste buds explode.  Dessert was good, but slightly let down after the amazing fist two choices.\nCan't wait to go back!", "author": "John H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-16", "description": "They took 45 minutes to get our order and the plates aren't that complicated to justify it.", "author": "Lucy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-08", "description": "Gluten free friendly. Deep fried joy (and still gf). Variations from root vegetables stewed with magic sides of mushroom black rice, or meats and plantains and on and on ...so many interesting foods I wanted to try: succulent with healthy options too. Sangria happy hour. $5. Mmmhmm. Basil sangria. peach sangria. ginger mint sangria. Refreshing and not too  sweet. In love. Service was impeccable. Clearly the management is doing something very right. The wait staff all around was patient and warm (especially with my 'how is that fried again?')..we stayed there way past check time because our senses were high off the smells, environment, vibe, nourishing food and general sense of awe. check was pretty low too which makes it that much sweeter....I'm fully in love with this place and their crazy root potato frying yum with spicy slaw...", "author": "Sheila Joon O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-12", "description": "I really love it here. Only thing I don't like about the Fritay is that there is no goat or turkey option. The beef Fritay is very dry.", "author": "Nahika M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "Very good food. They were familiar with the \"concert rush\", as they had a special rush menu and knew to get us in and out super fast.", "author": "David L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-05", "description": "Came here the end of summer for my aunts birthday. I made reservations early to ensure our seats. The food was truely authentic and delicious but it took a loooong time to come granted there was 8 in our table. The place is beautiful with gorgeous art work on the wall. They had a band playing which was so nice. I had the frittaye it was good. The only thing is the manager I guess was being really attitudey when she had to give us another seat for my 4 year old cousin. Cmon I know its hassle but you shouldn't let customers detect your attitude. Overall Im all for a classy dressy haitian restaurant.  And we had the best waitress she's a pretty young lady with natural hair.", "author": "tia L."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}