{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-02", "description": "Food was surprisingly  good.    mac and cheese is not authentic  ,but it was satisfying.  The   ginger mint sangria  was good ,  mango juice was hot nectarine juice  nasty , grilled conch was more like pan seared  conch but delicious,  mango  peper sauce , was to  hot  so hot I was coughing with every bite . Red velvet   microwave mug cake was not  worth the price  .Over all the service  wasnt so great ,  and La caye is over priced.", "author": "Patricia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-25", "description": "Being an avid eater and a great fan of exceptional Haitian cuisine, I can def recommend the Fritay, Macaroni Au Gratin, rice and Akra. The sangria were okay, we def preferred the Sparkling Sangria over the Ginger/Mint that was heavy but not  as crisp. 5-7 Sangria are $5. Oh and do not forget the Pikliz to top your meal mmmm", "author": "Sasha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-16", "description": "I have been waiting to check this place out for years. Finally got a chance yesterday :) As a fellow Haitian, the food is the real deal. Well cooked, seasoned to perfection. You definitely have to check out the macaroni au gratin. (wish I could bring a pot home with me.)", "author": "Judy F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-07", "description": "This place used to be the go-to place for me \u0026 my friend every time we wanted some good Haitian food. I also took a couple of my Hispanic, Asian \u0026 Caucasian friends there too. Food was always god. I am not sure if they had a new chef recently but the food was not as good when I went back in January. I must say that quite a few times I've budded heads with the staff because the girls are always very rude. There was a time when I wanted to place a big order for a party I was hosting, I called \u0026 explained to the girl what I wanted, she wasted my time then said that I needed to place my order with the chef. I was put on hold for over 45 minutes then hung up. I called right back \u0026 was rudely told that the chef has other things to do \u0026 that I needed to wait. I will never go back there. It is very unfortunate because I love Haitian food \u0026 as a Haitian person I was more than happy to give them my business.", "author": "PM R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-28", "description": "This place receives the Haitian seal of approval!  My boyfriend and I took my Haitian parents here for dinner and it was a real treat.  The food, music, atmosphere and the Prestige really transported us straight back home - you could almost feel the ocean breeze, LOL.  \n\nAll of the food (except for the djon djon aka black rice...good, but not really Haitian djon djon) was super authentic and delicious.  If you're used to home Haitian cooking, you might want for a little more spice, but it's not lacking in traditional flavor at all.  Insider tip:  I was surprised to not see any sauce pois on the menu, but we asked for it and they definitely had some in the kitchen and it was GOOD.  \n\nWe had the fritay as an appetizer, poisson rouge and legume for entrees and pain patate for dessert - would definitely recommend them all.  The service was impeccable as well.  Will DEFINITELY be back here, and it will for sure be a Brooklyn stop when family's visiting from Haiti.  Loved it!!", "author": "Nathalie J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-20", "description": "I'm picking at my leftover Griyo as i write this (still so delicious!) mostly as a mental note for myself really. I came here to fulfill a craving i've been having for for Diri Djon Djon. I'd been here for drink/music and merriment before, the restaurant is warm and inviting and just a cool place (they have a backyard too!) but i'd never come for like \"dinner\" dinner. I knew i'd be in the neighborhood that night so i came hungry and with purpose.\n\nI also knew i should be a little worried when we got the white lady waitress at a haitian restaurant... but whatever.\n\nDjon Djon and fish was my intention but then i peeped the fritay on the menu and got swayed by the siren song of fried pork. Seemed a bit confusing that this item too would come with a side of rice like the menu says, so i asked the waitress about it since that would influence what dish i would get cus i came there for black rice specifically. But she said yes so i got the fritay instead of the fish. \nSurprise: she was wrong, it doesn't, it's an extra $6 for it. \nThankfully the owner was there, and boy is he a warm and charming fellow, straightened that out for us.\n\nBut did i tell you how good that griyo was though? GATDAMN!\n \nThe rice? it was just ok, not as good as my grandma's but you know how that is. \nDon't think i'll order it again cus it'll just make me sad. I came looking for a familiar taste of home and didn't really find it here. Also i dunno what ill the Akra did to deserve to be served so so SO very greasy! Why?! Too much batter, could've been anything in that fritter really :(\n\nI did get dessert when the waitress offered: That pineapple upside down cake was A++. Even my friend who's \"not much of fruit \u0026 cake person\" dug in, and i immediately wanted to rescind my invitation to share it and stuff the whole little cake in my face. \n\nDefinitely will not un-bookmark La Caye, it's a cool place and i want to support it, i'll just have to scale back my expectations of finding the flavors of the Kiskeya i remember here.", "author": "Mariel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-27", "description": "Yes, the hype around this restaurant is well-deserved. \n\nCame here for lunch (or perhaps it's more accurate to call it a really early dinner? Don't really think this place has a \"lunch\" menu, but I digress) a while back and was not the least bit disappointed. Wings were delicious, plantains were perfect, and the fritay was amaze.  As a fellow Haitian-American, I was pleasantly surprised at their ability to have authentic Haitian food that still appealed to a variety of palates. Well done, La Caye. \n\nI will surely be back.", "author": "Ana B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-20", "description": "I visited this restaurant with my coworker after passing it for years. We were seated in the backyard/patio area and it was really nice. Overall, the restaurant seemed to draw a nice crowd and had a nice feel. \n\nWe decided to share the steak in peppercorn sauce along with sides of green plantain, rice, and something else that I can't remember at the time. We both found the food to be flavorful and satisfying. \n\nI will definitely visit again to try their other menu items.", "author": "R C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-23", "description": "The food was very good for the most part. For the apps we had the Creole Wings which were delecious!! It came with a mango hot sauce .. loved it. . We also had the cod fish Chiktay which was just ok it was very greasy. . For dinner we had the Seafood Creole and the Poisson Rose (snapper ) both were very good.. however since the fish was \"big\" they charged extra!! (That was told prior to our order). I also had the black mushroom rice which I found a bit bland. The Pain Patate I also found delicious..  Also there is Only a wine and beer bar and they make mojitos NO REGULAR BAR. . The service I must say was outstanding I had a young lady (Tenisha I believe) that was amazing.. The place is really tight but the decor is nice. But beware there is only one bathroom. . All in all nice experience", "author": "Aysh B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "Great food and they didn't disappoint. A long ride from Riverdale was well worth it. We had the conch and akra for an appetizer. The red snapper and legim was filling and had great flavor. The black mushroom rice was awesome. The service was good, friendly staff. We will definitely return.", "author": "Selena R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "Went on a Tuesday at 7:30 pm, plenty of space. My friend, who is from Haiti, confirmed what my taste buds declared: the house goat dish is authentically amazingggggggggggg. He had the fries and sliders, fries were crispy and the sliders were pleasant.", "author": "Jamy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-07", "description": "This Haitian spot has amazing food and it's  in a great location. The spicy coleslaw was to die for and the black rice is delicious! I was seated as soon as I walked in and the service was great.", "author": "Chantal-Annik E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "This is the best restaurant I've been to in the area! I can't say enough good things about this restaurant. Relaxed, easy atmosphere. The staff is always welcoming and not too pushy!  the food is PHENOMENAL! Just the right amount of spice and kick. It's elevated Haitian cuisine that is really to die for! They have a stunning garden area and their bar has everything you could want. Music is great, and if you get to meet the owner you will understand why this place is so brilliant, he is such a wonderful man! If I could give this place 6 stars out of 5 I would.", "author": "Jillian G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-20", "description": "This was horrible. Not impressed at all. I'm only giving two stars because of the wine. Where should I start. I ordered the creole chicken with a side of macaroni and cheese. It did not fall off the bone instead it was very chewy and cold. I should've taken it back but I was starved when I walked in so decided to eat it. There was also a lack of seasoning. The Mac and cheese was alright but for the price I paid I received little to nothing on my plate. I don't know why but I then decided to order a dessert. I ordered the red velvet cake... It was gross and I could tell they put it in the microwave to warm it up. Please trust me on this one avoid this place. Not worth the penny.", "author": "Christina R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-05", "description": "I love this place and just can't get enough! The people that dine here , classy set of people, great staff, delicious Haitian cuisine happy loyal client!", "author": "Deborah F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "I went here yesterday with my family and I can say that I enjoyed the experience. The waiters, waitresses and host were welcoming and one waiter kept filling our water glasses. Between the three of us we shared: Legume, Rara Salad, Fritalle, Black rice, steak, Macaroni au gratin and fried plantains. The griot in the fritalle was well prepared and the pikliz were on point (except for the onions, but that's just me). The lights and the decoration of the restaurant gave an ambient vibe along with the Haitian music playing in the background. We are planning on going back there one day.", "author": "Anne B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-13", "description": "Our Haitian cab driver insisted that we treat ourselves to La Caye, and boy did they deliver!  Food was flavorful and excellent.  The server was very, very sweet to us and even comped us an appetizer for having gotten our order slightly wrong.  The goat dish was outstanding and the buttery fish was excellent.", "author": "Paddy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-07", "description": "Tried to get in here before but they did an impromptu closing by posting a piece of paper noting \"closed for a private party\". So first time there finally and I must ask \n\" what is all the rave about? \" The decor is mediocre and the ambiance was just not there. They did have musicians to entertain \u0026 they get 2 thumbs up! It was not overcrowded but they were doing good with the # of patrons. So the food was authentic Haitian food confirmed by my date. I will not recommend the sweet potato bread. It was solid like a dense cake. Our waitress was  a lil too occupied with chatting amongst herself \u0026 coworkers to give us any attention after the food was served. Not too friendly either. Guess the service is lax-ed since they first opened. You can't get comfortable and lax in the restaurant business. You win over some now and lose plenty later! Shouting for better customer service!", "author": "Dat S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "This was my first Haitian restaurant experience. The food was tasty and full of flavor. I ordered fish, mushroom and rice and fried plantains. I ate all my food. It was intimate with candle lighting, a bar with mixed drinks such as mojitos and sangrias. It was my last meal in Brooklyn and I was not disappointed.", "author": "Meme B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-17", "description": "A charming Haitian restaurant with a friendly, personable staff. The food was quite good: creole wings, conch fritters, tilapia and red snapper. The black mushroom rice was delicious.", "author": "Dan L."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}