{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-31", "description": "I love the atmosphere here, the cocktails were great. But the wait is a bit long and it seems that many of the dishes are spicy. To start, I am Haitian and have been eating Haitian food all my life so its hard to impress me...I loved the idea behind the dishes. The sliders, salad, and dessert, ect. But everything had a kick to it, except the dessert. There are parts of Haiti where spicy food is common but not everyone has the palate for it or the tolerance. I would have loved everything if it wasn't such a struggle just to get through my meal. But if you are a person, like my girlfriend who loves spicy food this was the perfect place to be.", "author": "Cathia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "Nice decor, polite service and excellent food translate into the right ambiance to break bread with friends. Authentic Haitian cuisine delivered with class. Most likely because we arrived late they were out of the kabrit. No big deal, there was plenty of delicious treats left on the menu. Everything ordered was good with the lambi boukannen and black rice worthy of special mention. \"Prestige\", the local beer in Haiti is available along with a limited selection of choice wines judging by the very pleasant bottle of French red proposed by the staff. Definitely worth a visit if you've never tried Haitian cuisine. If you did elsewhere, I recommend a comparison with Lacaye - you will not be disappointed. Bon appétit.", "author": "Ralph Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-24", "description": "I came here recently with a friend who convinced me to break away from our usual spot. And I'm glad I did. Through mouthfuls of Creole wings, black mushroom rice, and akra as well as a few more rounds of Sak pase mojitos than we should have had, we gossiped, laughed, and enjoyed our time at La Caye. \n\nThe wings are flavorful and pack the right amount of heat without overwhelming your taste buds (but my spice-o-meter is quite high just so you know *blushing*). I eat black mushroom rice often compliments of my mother and sister, so I worked through the akra, which is a seasoned and deep fried malanga--tasty. Jean, the co-owner made sure to stop by and say hello and chat with us and the other patrons. Our server was also amazing, and her attentiveness was balanced (we felt neither ignored nor rushed). \n\nWe also wrapped up the night with complimentary cocktails and an order of red velvet. The red velvet was moist, tender, and not overly sweet. While it doesn't come with icing, the warm cake is nicely contrasted with two scoops of ice cream--and that's all right with me. \n\nLa Caye is a nice addition to Fort Greene's culinary hub. I had a good time and will definitely be back.", "author": "J M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-14", "description": "4.5 stars..a trendy haitian sit-down restaurant in brooklyn? Didn't think it could exist in my lifetime. Came here on a Wednesday night from LI: cozy spot, very nice ambience, very warm \u0026 friendly, half full..you wouldn't think u were in a haitian cuisine--hey no offense I'm just saying.\n\nWaitstaff were very attentive, fun, and as soon as our waitress open her mouth with her \"creole\" we realized she wasn't haitian at all. Very impressed with her and the staff's efforts.\n\nApps: haitian wings--nothing haitian about them but they were amazing, akra (fried fish fitters--good \u0026 not as greasy as your haitian aunt's would be, and the codfish with french bread was out of this world.\n\nMain course: I got my fritaye--a mixture of griot--fried pork, fried plantain, and ordered Haiti's well-known black mushroom rice on this side. THE RICE WAS just as good as my mother's, tasted very good. Our table of 6 ordered different things. \n\nOverall excellent experience and service I will be back.. Recommendations:codfish, black mushroom rice, conch--lumbi, macaroni-au-graten, and seafood platter..avoid the steak--too salty. Drinks: The passion fruit mojito!", "author": "Nate S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-23", "description": "I came to this place for a drink last night before seeing a movie at BAM across the street. I'm black and try to make the effort to support black businesses. I won't be coming back to this place. The bartender was very rude. In the context of a restaurant or bar, if I as a customer walk in, say hello to you and you do not respond, that's unacceptable. No one greeted me or my friend when we walked in. The bar was empty except for 1 person at the end. The bartender did not respond to the greeting I directed to her. She heard me, saw me, ignored both of us, turned her back, and turned back around and made a face at me. She didn't ask what I wanted. She looked at me, bugged her eyes, and jutted her chin out like 'WHAT?'.\n\nI didn't leave a tip. My friend probably did. Rude service always sucks, but it's always particularly upsetting and disappointing for me when it comes from another black person. It doesn't cost anything to say hello.", "author": "Jasmin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-23", "description": "When I went to this restaurant, it had a wonderful ambience and great Haitian music. I expected the price to be lower than it was. It cost $100 for two people! The food lack some taste but the presentation was wonderful. Really busy as well, it took a long time before are appetizer was even completed. Idk if we would return but it was a nice experience.", "author": "Vanessa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "Soooooop THIS restaurant is IT! As a Haitian man who grew up eating nothing but Haitian food all my life this restaurant made me happy. The \"black rice\" as ppl like to call it was on point. They did not take anything off of it. Usually with Haitian restaurants, it's a hit or miss. They tend to sacrifice authenticity because they have to cater to the general public who's palettes aren't used to the spices of my home. Anyway, the rice was awesome. I had the diri djon djon (black rice) with fish and my friend who's also a Haitian woman had Fritay, which is a sampler of all sorts of fried foods. When our food came, we both tastes the rice first and as it hit our tongues we both KNEW we would be back to this restaurant in the near near future.  The food was A+!!!! \n\nThe decor of the restaurant was great. It's very intimate and would work awesomely for date nights for a couple. Their outdoor patio, which is where we sat, is very nice. It's also accommodating for large groups. I can't say enough about this restaurant. I will definitely be back there for another visit. This place gets ALL THE STARS!!! Our waitress was also amazing. She was very attentive and nice. She laughed at my jokes whenever she came to our table! S/o to her for being awesome!!", "author": "Hassan A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-04", "description": "AHMAHZING!!!!!\n\nI discovered this restaurant while staying with friends in Downtown BK last month. I had a hankering for lobster. I needed it in my life. I searched on Yelp and found this place and the Seafood Creole caught my eye.\n\nThe place was packed and the wait was going to be 20 mins but I knew it'd be longer, and I did not care. I wasn't going anywhere till I gots my lobstahhhh!\n\nMy friend and I waiting at the bar where we had a nice wine or 2. Yes, this place also has good wine. The owner was so sweet and noticed we had been waiting a while, prob around 30/40 mins and he proceeded to create another table and seat us. So nice!\n\nLong story short, the food was amazing!!! The mushroom rice was divine. The seafood creole was so out of this world I can't even begin to describe it. I almost cried.\n\nEat here, you won't be dissapointed, and if for some reason you are then you need to check yourself!!!", "author": "Emma L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "I went there for my mother's birthday which was in the same week of Superbowl.The food was so good here! As a Haitian I was so proud of the quality of the food. I had the lambi, black rice and banan.", "author": "Noushky F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-12", "description": "Went back for a 3rd time. And this time was in-between my awful VDay experience and my exceptional \"make-up\" dinner shortly after. I must conclude that this experience is the truest version of La Caye. \n\nI ordered the same thing as before, red snapper, salad, black rice and macaroni \u0026 cheese. Most of the food was luke warm, except the dessert, which was thoroughly burnt. \n\nI really wanted to love this place.", "author": "Elijah O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-13", "description": "My wife and I really loved this place. The food was delicious and our waitress Cynthia was amazing! The ambiance was also very cozy and welcoming. We will definitely be back!!", "author": "Jay F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-22", "description": "The food was pretty tasty. It was my first time eating lambi and I really enjoyed it. The black rice was awesome! The service was a bit slow for my liking. I wouldn't say terrible but not awesome. I'm not Haitian nor do I eat Haitian food often but I enjoyed the food a lot. I can't speak to the authenticity of the food but I would say try it and see what you think!", "author": "Amara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "Delicious Haitian food. I'm in love with the atmosphere and their brunch menu. I've only gone once for dinner and the food was overly salty but I'll definitely give it another shot. The drinks are amazing.", "author": "Valerie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-11", "description": "++\n- courteous service as soon as we walked in the door\n\n+\n- Mac n cheese\n- Fritay with tasso (should be in the ++ category, but I belive the plantain to tasso ratio was kind of low)\n\n- \n- Wasn't a big fan of akras. I'll admit, that just might be me. If I liked them overall, I think I'd enjoy them here", "author": "renje g."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-06", "description": "2.75 stars?\n\nThe restaurant has outdoor seating, which was a great way to experience the last gasp of summer before seeing a movie at BAM. A friend and I ordered different \"specialty\" sangrias. I recognize that describing them as \"weird\" isn't helpful, but I just don't know how else to say it. They weren't traditional sangrias, but they weren't distinct in any way. They were disappointing. We decided to switch it up and each ordered a glass of rose.  I asked the waitress if it was dry and she went on AT LENGTH about how incredibly dry the rose is. It was the sweetest glass of wine I had all summer.\n\nThe side of macaroni au gratin was everything I wanted and the staff (despite not knowing their wine selection) was friendly and accommodating. \n\n* 10% off everything all the time with a BAM membership.", "author": "Jenna C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-04", "description": "I didn't feel the food was authentic Haitian food. The flavor and spices left a lot to be desired. My friends all ordered the Seafood dish and the portion sizes were all different. They said the dish was under seasoned. Their black rice was flavorless and under cooked. I had the pork which was very tough and hard to cut through, but the sauce was delicious. As for the drinks,  the sangria was weak. The mojitos were good but too sweet for my palate. I give two stars for attentive service and the decor/ambiance.", "author": "Joanne A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-03", "description": "The food was good but not spectacular. Surprising the legume was the best thing I had. The reason I am giving 2 stars is because they have a little opening so you can see what is going on the the kitchen. While plating the food I noticed a female worker continuously use the back of her hand to wipe her nose while handling food: That is absolutely unacceptable and disgusting. This really needs to be taken care of because it is very unsanitary.", "author": "Kay L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-30", "description": "My second time coming and the food was such an improvement.  I had the Griot w/ rice and saucepoi.... It was so good. \n\nMy only disappointment is the chicken creole is actually chicken and not hen, otherwise I would have given them 5 stars.\n\nNow I know where to go when I want some Haitian food!!! This is a definite must.", "author": "Shea G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-30", "description": "La Caye is a Haitian restaurant located directly across the street from BAM. It's a cozy, welcoming place with a spacious back patio.  I've enjoyed the creole wings and all four of the unique sangria flavors ($5 each during happy hour!). \n\nThis would be a perfect place for a drink or bite pre or post BAM, especially in the nice weather when you can enjoy the back patio space! They offer at theatre dinner menu to cater to the pre BAM crowd. La Caye takes open table reservations if you're dining with a big group or planning to go on a weekend night!", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "La Caye is an unsung Fort Greene staple. The menu is in French but is reader-friendly with English captions underneath.\n\n I ordered the porkchop and lived for each bite. The marinade was simply blissful. The other two people in my party enjoyed their respective fish and chicken entrees. \n\nGet over to this spot and enjoy the warm hospitality and serenading smooth grooves playing in the background.", "author": "Trevor C."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}