{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-13", "description": "I went for Brunch here. It was pretty good. The ambiance was warm. Pretty small place though. Tried the Eggs with Salmon. It tasted well with lots of flavor. Enjoyed my experience.", "author": "Fabolous D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-14", "description": "We were attending BAM, had a little bit of time and were hoping to spend it in Berlyn, but it was full. That's how we wound up in La Caye.\n You can see a cramped kitchen full of people working hard. You want to route for them but the food and service makes it really hard.\n They had about seven red wines on the list of which they did not have three. There were some discrepancies between the descriptions on the list and the actual bottles, vintages, appellations, etc. The manager who heard us speak Russian (and obviously understood) came over to help. We did not really need it - but she was trying to helpful.\n The fries were pretty bad - it's really difficult to make such thickly cut pieces crispy. Maybe that's the style in Haiti - I would just make them thinner. The chicken wings were tough and dry. \nIf it were not for its location it would not be crowded. Overall, disappointing.", "author": "Igor K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-03", "description": "I've been here several times and overall I do enjoy the food. The drinks are pretty good as well My favorite being the peach green tea sangria. My last visit here this weekend left me feeling so so about the place. \n\nWhen we arrived we asked to be seated outside and after hearing there would be a wait we opted to stay inside. It was pretty warm outside and the air-conditioning wasn't turned off although the front door was propped open. After 3 drinks 3 it felt like an oven. \n\n  Anyway, the food is usually pretty good. I ordered the steak with the peppercorn cream sauce and my steak was cooked perfectly. The sauce however wasn't so appetizing. There must have been literally a of cup of sauce in the plate and and my poor steak drowned. I ended up replating in my appetizer saucer. I also had the Mac n cheese which is usually good but  was terrible. It so dry to the point where I turned the dish upside down and it stuck to the bowl. When I finally dug it out it tasted just as bad as it looked. \n\nOverall I've had good experiences here and will probably give it another shot. Every one is entitled to a bad night.", "author": "Felicia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-12", "description": "I went with a friend on a Sunday evening but we didn't have a reservation! The gentleman who greet us still accommodated us and we were seated in less than 5 mins. I had the red snapper in sauce with black rice and my friend had the creole seafood with Mac and cheese. Everything but the mac and cheese was delicious.  I will definitely be back to try the lambi...", "author": "Joanne P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-31", "description": "Food was good. I ordered the Fritay. It was freshly fried. I especially enjoyed the green plantains, which weren't overly fried or dry. \nThe service, on the other hand, was non-existent. The bartender, Steve, was so busy flirting, he couldn't bother to follow up on how my experience was. I should've offered him a napkin to wipe the drool from the side of his mouth. \nUnfortunately, Haitian food is not too common in New York, so this place does the job--but I'm not thrilled to come back. Guess I'll have to save my Haitian food craving for when I go to Miami.", "author": "Lily F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "This delightful little restaurant was a nearly perfect find on a wonderful Sunday afternoon.  Located across the street from the Brooklyn Academy of Music (more later on how much that area has grown up since I was last there), the simple decor and laid back manner of the staff was a treat.  They made us feel welcome from the moment we walked in the door.  As far as the food goes, this restaurant serves delicious Haitian cuisine, enough spice to have a kick to it but not enough to overpower the meal.  Their shrimp and grits made this transplant from Texas yearning for cooking back home.  We will definitely find our way to restaurant again.", "author": "Jack B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-18", "description": "I attended a friends birthday celebration. Too small to accommodate the party of 8. The table wasn't dressed. There were patrons behind us almost on top of the birthday guest. The food took too long. The guest had to ask for water refills and the mojitos were not the best. No bottomless Bellini's. The staff was friendly but. It wasn't worth the pp amount. My friend had her loved ones there to celebrate but I wouldn't recommend for parties.", "author": "pamela j."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-09", "description": "Guess they don't need my money. The customer service is horrible! When I ordered, they told me \"ready in half hour\", we drove there and was there in 30min but was met at the door and was practically scolded by the waitress/hostess,\" I told you half hour and that we would call you.  Granted She did say it wasn't crowded when we initially called but now it is. So understanding how there could be a delay we calmly left and wait in the car an additional 30 min. After the additional 30 min and no call we decided to call and she said without apology its not ready  another 30 minutes. We decided it wasn't worth the wait especially with the nonchalant attitude. So we thanked her and said we'd like to cancel the order. She said sure! And hung up! And just like that our $84 takeout order was dismissed without a care.  Well i'll gladly take my money elsewhere. \nIf you want great food, great customer service at a great price DONT GO HERE!", "author": "Running N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-25", "description": "The best spot for carribean/Haitian food. Great decor, great location right next to Atlantic terminal and the Barclay's. I like to go after a game and have the smoked herring. A must see if you are in the Bk area.", "author": "Julien V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-17", "description": "Ok so the ambiance was nice, service was very friendly.....now the food, the macaroni Au gratin was EXCELLENT, the creole wings we're bad, the seafood creole was another EXCELLENT DISH and the black rice, the fritaye definitely needs work maybe my palate is a bit used to the mom a pop around the way fritaye spot, but there's no comparison sorry....", "author": "Joan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "The taste of the food is exceptional. I think more Haitian restaurants should incorporate sweet plantains into their menu for those who prefer sweet instead of fried green plantains. I ordered the half chicken and it was very tasty. The wine and cocktails were just ok. If the sangrias and cocktails had more of an authentic and pleasurable taste, I would've ordered seconds. I ordered the pomegranate mojito, which was average. The setting is suitable for any occasion. The hours are great. Went on a Thursday and closing hour was around midnight. Parking can be difficult because of it's close proximity to the Barclays Center. It can be a little pricey but can't put a price on a good experience. If you're looking for good Haitian cuisine, I'll definitely recommend giving this restaurant a visit.", "author": "Richie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-22", "description": "Came here for a late Saturday night dinner after my friend's show in Brooklyn. Being that I'm Haitian, I'm usually skeptical to try Haitian restaurants since I'm used to the real thing at home, but this place wasn't bad at all!\n\nDecor was simple but clean and homey. The menu offerings were a good reflection of our cuisine, with innovative twists. I loved that we could sit at the bar and enjoy a Prestige as if I were home!\n\nPork chops were delectable - my boyfriend was craving them again the next day! Creole wings were decent, side of plantains were perfect and the Macaroni au Gratin was amazingggg - huge points for that.\n\nLooking forward to coming back - especially to try out their Lambi, my favorite. Glad we found this place!", "author": "Christelle R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-28", "description": "I feel the timeline alone will show why 2 stars is generous...\n\nEnter restaurant and seated by hostess/waitress. Receive menus. Oh wait, what's this? Upon opening menu the paper wasn't there so it was only half the menu (only the drink options were there).\n\nWave for waitress in vain and owner comes over and brings proper menu. Hmm...let's ask a question about this dish. New waitress comes over. Informs us that this menu is also wrong. It was missing like 2-3 dishes so I guess it was old version. We finally get the proper menus. \n\nMy friend who is Haitian orders fritaye only to be told by our first waitress that it is not sold until after 7pm. It is the only dish that included griot, a popular Haitian staple. So he just ordered some steak in a balsamic sauce with black mushroom rice. I order the broiled red snapper in creole sauce with mac n cheese. We split the creole wings and mango drinks.\n\nEating wings (average wings with some spiced sauce throw on, meh..). I overheard other nearby tables order fritaye. I ask a different waitress are they serving it now. She says no. I hear someone else order it...So I ask our own waitress \"You said they don't serve the fritaye until 7pm, correct?\" Yes, she confirms. It was 5:30pm.\n\nFood took a while but came out. Each plate was flooded with our respective yet watery sauces. My snapper was fine enough but no real seasoning or maybe all the watery sauce washed it off? My mac was really good but my friend's food was the worse. The meat was flavorless with or without all that water sauce and it was a poor cut of meat with lots of fat and gristle. \n\nMy friend just cannot suffer through the meal so asks can he change the meal. No concern shown by waitress of \"Oh no, what's wrong?\" just \"well you already started eating it soo...\" which we clearly understood we'd have to pay so the \"you have to pay either way\" attitude was not needed.\n\nFinally, still before 7pm the fritaye dish is served to my friend by the now rather cold shouldery  waitress. The other waitress (we have 2, remember?) comes and says she was not told that today it is served before 7pm. So her complete lack of attention or uninformed self wasted our money and time.\n\nThe fritaye could have perked things up but no. The griot was too greasy and I love grease. The akra was greasy. The banan was greasy. It was all greasy. \n\nAt the end of the meal we just paid what we owed and left. We will never be coming back here again and this is coming from someone who loves Haitian cuisine and really wanted to support this business.", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-15", "description": "Three visits to La Caye. Only tasted food once.\n\nFirst visit: Made reservations for a large group for brunch. When we arrived they were changing shifts. WHY would the restaurant confirm a reservation at a time they don't serve food. \n\nSecond visit: Fine service. Great food. \n\nThird Visit: A friend and I decided to introduce some people to Haitian cuisine. The HOSTESS, in addition to having a HORRIBLE ATTITUDE, she gave away our table. Still wanting to give La Caye a chance, we decided to wait on another table. What was to be a 15 minute wait turned out to be upwards of 40 minutes with no end in sight. Needless to say we left. Upon leaving, the representative quietly mentioned to hostess that she is the first point of contact for diners and greeting customers with a bit hospitality is good for the restaurant. Her response, \"being all happy and smiling is not my personality if they [the restaurant] don't like it can always fire me\". \n\nDuly noted ma'am. No need to return. \n\nAnd yes. In case you're wondering, she's still employed there.", "author": "Kim B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-21", "description": "Ok so I am of Haitian descent and wanted to treat my boyfriend to dinner. I decided we should go to La Caye in Brooklyn. When we arrived we stood at the door waiting for someone to greet us. We stood there longer than expected and this turned me off, but I kept my annoyed temperament to myself. A woman finally greeted us and she asked us if we wanted to sit inside or in the backyard; we decided backyard. The setting was nice. We waited a little while to be approached to place our order and waited about 45 mins for food to come out. We both got the creole chicken. He had that with diri jonjon n I had macaroni au gratin. The food was okkkkk. I've had way better at a local restaurant and family. Also the portion was so small. My boyfriend was still hungry. My advice is if you want to try Haitian food/ restaurant for the first time try La Caye. But if your a Haitian food pro don't bother. Unless u want an appetizer as your entree.", "author": "Jerissa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-04", "description": "Stopped by as we wanted good drinks and dessert, which is exactly what we got!\n\nThey have 4 sangrias and we tried 3 of them:\n\nGinger Mint - white wine, ginger, and mint\nSparking - rose wine, watermelon and lychee with proseco\nBasil - red wine and basil\n\nI think the ginger was my favorite but all were amazing. \n\nWe also ordered a pineapple upside down cake. It was delicious with just enough sweetness.  Everything was great although it took forever got get our dessert and drinks at times even though the restaurant wasn't that busy.", "author": "Jane R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "As a Haitian American I can honestly say that food is very good.  I had the fritaye (not sure of spelling) which included griot (fried pork), fried akra, fried plantains.  I also ordered the mac and cheese and it was sooo good. Their sangrias was good as well...The only downfall was that they ran out of the RaRa salad, which i wanted to try!\n\nWill I return? Most definitely!  My boo and I enjoyed our experience here very much! Hopefully next time they don't run out of the RaRa salad :o)", "author": "Wanda M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "Great food cozy atmosphere during summer and spring months sit in the outdoor space in the back. This was one of my first times at a Haitian restaurant and I have to admit the food was on point. I would definitely go back and great location.", "author": "Alice A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "Everything was so delicious. Perfect flavor. Everything hit the spot. Had the chicken wings to start. Then the vegetable entree and the strip steak. We shared all of it. Ambiance was great. Romantic and good energy. Good service.", "author": "Violet B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Fabulous restaurant! We last minute gathered a group of 23 people (mostly Haitians) and met for dinner. Not only did they accommodate us but the food was excellent, well seasoned and bountiful and the service was extraordinarily friendly. I highly recommend La Caye. We will definitely come back!!", "author": "Laurie W."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}