{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-12", "description": "Worst service of any place I've ever been to. Ordered sangria and dinner at the same time. The food came out on time and the waitress told us the drinks were coming. At the end of the meal, there still were no drinks. The waitress THEN came by and told us that one of our drinks was unavailable - after FORTY MINUTES. We asked for the check. That was the only thing that came quick. The check also came before our drinks. Drinks weren't worth it either.", "author": "Nilay S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-20", "description": "Well the food was pretty good but the portions were just plain tiny... I am a Yankee I know where to get lobster and they rarely live south of Virginia. Please don't tell me it's authentic Haitian, cause lobsters don't come within 800 miles of Haiti.", "author": "Alan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-22", "description": "we just came from eating some mac and cheese and chicken from La Caye (only $14) and chatted to Ralph the owner for ages. These are MAD COOL PEOPLE. So nice. Ralph is a sommelier and a soccer player to boot. (Former professional) He is so friendly as is THREE of the beautiful funny charismatic waitresses who came over to us. Honestly, Fort Greene is NOT known for customer service at all. It's one of the things I miss the least about living there but these people are warm, friendly, knowledgeable and the food was delicious. Great wine list. Great beer selection.Humble.Great interior. Wood and pebble. very warm, sophisticated and chill. I am definitely going back. Next time I'll try the garden. This place is a winner if they keep this up.", "author": "Chauncey Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-22", "description": "Amazing food, fantastic ambiance and decor, friendly staff and general good vibe! I am so elated to have a amazing Caribbean dine-in restaurant in Brooklyn.  This is something the Caribbean-American community was seriously missing, so thank you La Caye for assisting in filling that void. \n\nI am not Haitian but I am a huge a huge fan of Haitian cuisine. I fell in love during my college years at Brooklyn College way back when they use to have Model across the street from BC. After one meal there it quickly became one of my favorite spots to grab some great Haitian food............then La Caye came along and this is now my go to place to when I want to eat anything Haitian!\n\nI have eaten almost everything on the menu; that says a lot right.............My dinner favorite is the Poissen Rose -- Red Snapper in creole sauce with black mushroom rice, second in line is the Poulet en Sauce with Macaroni au Gratin, the Legume is pretty amazing too and I cannot leave out the Lambi because that has been a long  time favorite of mine and you will not be disappointed. Oh boy, I jumped straight to dinner and I bypassed all the wonderful little bites too.............Little bites that I absolutely love, the Akra and Shiktay...........Super! and don't forget to get the piklis if you like spicy; it adds a special touch to the experience.  Last but not least for those of you who want something light but very filling, try a bowl of the Crab Bouillon; one word \"fantastic\".  This is a really light and hearty soup. Hmmmmm is that an oxymoron? It just might be but, I cannot think of any other way to describe it. I am highlighting all my favorites but everything on the menu is worth trying at least once until you find your very own favorite(s) and don't forget to quench your thirst with  a Sakito Mojito; my fave and the Sangrias are very creative as well.............\n\nSo, if you didn't already know, La Caye also serves brunch and that is truly worthwhile culinary experience, to say the least...........My absolute FAVORITE and a winner for me is the Mai Moulin Arsansol -- creamy polenta with herring, bean sauce and avocado salad! OMG; this is so wonderful.  When I eat this meal, I savor every bite! My first time ever eating this dish was at La Caye and this quintessential Caribbean comfort food for me. Just writing this makes me wish it was Saturday morning because I would be heading over to La Caye right now. Seriously, I never joke about my stomach!  Also on the menu is a herring omelet and that is also a worthwhile experience if smoked herring is all new to you or if herring is not your thing.................they also serve awesome French Toast with seasonal fruit and for something more hearty you will also enjoy the Steak and Eggs.\n\nDining at La Caye will not leave you disappointed, brunch is fabulous, dinner is wonderful, great outdoor seating in the summer, they are in the heart of downtown, very nice vibe, welcoming staff and owners a stellar combo for a fantastic day/evening out!  Kudos to La Caye for raising the bar for dining out in the Caribbean community.", "author": "Kele W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-28", "description": "Coming from miami looking for a good restaurant to eat. I found a wonderful great enviroment that my man and I really enjoyed. we both highly recommend this restaurant.", "author": "Linda J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-28", "description": "Perfectly adequate cooking but a mediocre menu.", "author": "T. F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-21", "description": "Adding to the list of fine places to eat in Fort Greene and great choices for dining before or after a show at BAM or a game at the Barclay's Center,  La Caye features some delicious takes on French Creole cuisine.  Prices are fair, service is attentive and friendly.  Strongly recommend the lambi, the seafood creole and the poisson rose.  Lovely garden in back, when the weather is nice.  \n\nBecause everything is prepared fresh, if you have a 7:30 curtain at BAM (or a 7:00 tip-off at Barclay's), you're going to want to allow extra time or stick to an appetizer and drink at the bar.  That said, as our curtain time approached, the staff was nice enough to package up our unfinished meals and hold them for us to pick up after the show.  Tres agreable, mesi anpil.", "author": "Mark H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "Lovely! Very accommodating of my gluten allergy (celiac) and even made me something extra to make up for what I couldn't have. Prices were great, and food tasted fresh and filling.", "author": "Elye F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-19", "description": "I went here for the first time Saturday night with some girlfriends and loved everything about the place.  I especially love that they had what was on the menu and hadn't \"run out\" which can happen in Haitian restaurants.  The ambience was great, our waitress was friendly and so friendly as was the owner who greeted us at our table.  the food was pretty good but I rate the whole experience and I would recommend this place.  I will definitely go back.", "author": "Patty B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-20", "description": "The food at La Caye is good. I have been 2x and I will probably go there again. It is slightly overpriced. I really like the steak they serve though the tasty peppercorn sauce served with it is inexplicably thin/watery. La Caye has chosen its location well. Across from BAM, they get business that might otherwise stray  because of the very slow service. 2 of the servers and the hostess were pleasant and did their jobs well, but the barmaid looked so sad and was distracted.  Being in the service industry is not for everyone as it requires artificial cheer, promptness and attentiveness. The food I ordered took an exceedingly long time to arrive. The appetizer alone took 30 minutes and--unrelated to this delay-- the slaw accompaniment was so spicy that it interfered with the overpriced wine's flavor! In short, I like La Caye and will return because I am often at BAM, but they may need more people in the kitchen and should consider a price reduction of 15%.", "author": "coco l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-17", "description": "They have wonderful food. First time trying it and I will be a return customer....Called in to order so I could just hurry and pick it up. They are quick and polite to order from. When I got there my order was ready and I was welcomed with a smile.", "author": "Tiffanie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-07", "description": "It was OK.  Service was fine for us. Dishes were a little thin on accoutrements or quantity given the prices.  For example, no bread to sop up any juices. Too bad no full bar but the wine list was OK.  It's a pleasant place close to BAM and Theater for a New Audience and the Brooklyn cultural district.  I'd recommend giving it a try.", "author": "Michael F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-02", "description": "The food, service and atmosphere here are great.  Black rice + conch in creole sauce = fantastic. The drinks are also spot on.  we had to wait over half an hour for our reservation, which would be my only complaint.", "author": "Sabrina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-19", "description": "Went there for the 1st time yesterday with 5 other people. From the food to the service everything was amazing.  I enjoyed it very much...cant wait for when they add more food item to the menu. I'm getting ready to meet up with a friend there today:-)", "author": "C G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-09", "description": "Went for Valentine's Day...The food was cold, they tried to skip one of the courses, and I was sick for days.  This gets two instead of one only because, in theory, I really like the idea of a hole-in-the-wall creole joint.", "author": "Zac P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-21", "description": "Was in New York a week ago and needed a good restaurant before catching a show at BAM. Good reviews brought us here, and we were pretty pleased with the result. I wish we could have sampled the legume salad, but we'd arrived too early for that, by 5:45, when they were nearly out of chicken creole also, probably having served the last few at lunch and not having had enough prep time for dinner. I don't know how that can happen; shouldn't the kitchen staff have been at it a few hours before they opened? But I can recommend the chicken, and so can my thirteen-year-old, which is saying something. The pineapple upside-down cake was like a pound cake with a bit of pineapple in it, and too dry by half, so I'd avoid that. But I'd visit again on my next trip to New York.", "author": "Larry Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-14", "description": "The food is tasty although most native Haitians will agree the cooking style is not exactly authentic, it is more a fusion of Haitian cuisine and something else. Portion sizes are on the small size compared to other Haitian restaurants but it IS in Fort Green after all. The waiting time can be pretty long on busy nights. The wait staff is friendly. Lovely going there in the summer and getting to eat on the patio outside.", "author": "Miss I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-15", "description": "My boyfriend and I were so excited to try this place out but we were really disappointed :-( We were seated immediately but the server took 20 minutes to come over and introduce herself and take our drink orders. Once she did that we placed our orders for our drinks and she took another 20 minutes to come back and take our dinner order. Luckily we had a snack prior to coming here or else we would have been starving! Our food took about 15 minutes to come. Alas, we get to enjoy our meal. NOT!!! The server turns to my boyfriend and asks if he is haitian. He says yes and she tells him in Creole that she is sorry but she scraped the burnt rice up from the bottom of the pot and his black rice had the crunchy, burnt, bottom-of-the-pot rice grains mixed into his rice and she asked him would he like another black rice. He said yes and she took another 15 minutes to bring back fresh rice and it still wasn't good. It didn't taste like authentic black rice at all and he was finished with his meat by the time she came back with the rice. My food? Not good at all. The shrimp was sooooo overcooked it was rubbery and tough. Very hard to eat so I didn't eat it. I ate the crab legs which were stewed in a tasty sauce...nevertheless we left a 15% tip and got a snack when we left. What a waste of money and time :-/", "author": "RandBlues L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-18", "description": "To have a prime location across the street from BAM, know there is a festival going on, and be offering discounts is something this place SHOULDN'T be doing. And none of what I have to say deals with the discounting part except they wanted to haggle over that at the end of the night. \n\n My party of 5 sat at a table with no one taking an order nor saying hello for 15 min. No greeting, water, nothing! And the place was NOT FULL. I had to get up and speak to the owner/manager to get staff to even  talk to us.  We sat at 5:15 on a Sunday, that became 5:30p then 5:45p in which we just decided to only order appetizers, except for one of us ordering Red Snapper, as we had to make a 7p screening across the street at BAM. We ordered 1 salad, 3 soups and 1 Acra appetizer which should have all come at the same time in any normal restaurant. In the ADDITIONAL HOUR AND FIFTEEN MINUTES that we waited, the only thing that came to the table was the salad. No one ate because we had to get to our 7p screening. \n\nUnfortunately, Berlyn, next door closed at 10p otherwise I would have instructed all of my friends to go there.  Unfortunately we all went back plus, 20 people for drinks and food after. NOTE, I spoke to the *owner person the day before about a large group coming in after the screening to make sure they could accommodate as they were promoting themselves to the public during a film festival. I wanted to make sure they would be prepared.  When we went back, the restaurant actually had the NERVE and were proud of it, for HOLDING THE RED SNAPPER THEY COOKED 3.5 HOURS EARLIER for my friend that ordered it pre-screening! No offer to cook a fresh one, like any other restaurant in this world would have done.  I'm sorry, but that's the craziest thing I, and everyone that I had filled that restaurant with, had ever heard of. They proceeded to then screw up every order that was placed by my friends, actually pushing dishes on people because they prepared the wrong items and didn't want to correct their mistakes. \nOn top of horrible service adding 18% gratuity(This must be for them to cover themselves knowing they would probably get tipped NOTHING otherwise!) I will make sure menu pages, yelp, and any other place that I can blast about this place, will know about it. After having a packed screening and canceling my reservation at a place where, I'm almost positive they would have taken care of us.  I was pissed!  It was a horrible experience from beginning to end at LaCaye", "author": "Y. R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-30", "description": "Stopped by on a Monday with a Haitian friend of mine bc I know nada about Haitian food despite dating a few Haitian guys(shame on me). When we arrived it was early evening, pretty empty. Nice size and spacious. Like the view of the backyard even though it wasn't open for use. Waitress seemed annoy'd for whatever reason, but we didn't pay her to much attn. I ordered some fried beef which was blan/tasteless, mushroom/black rice which was ok but reminded me of rice a roni, and some spicy slaw which tasted really good with the black rice. My friend ordered the mac n cheez which was basic. They don't serve liquor here only beer and sangria, which doesn't work for me. A girl luvs her martini's, mixed drinks, and happy hour. So with that being said this isn't the place for me. It's decent and my friend said their menu is really limited so I guess it's worth a try if you're not spending your own $.", "author": "Precious P."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}