{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-08", "description": "Wonderful starters. Conch was amazing, and bread/potato pudding dessert. Main courses were fine but a bit bland.", "author": "Jeff B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-03", "description": "Interesting place for a haitian restaurant, food was okay but good space especially outdoors, if you have not tried Haitian food then this would be a good place to start.", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "My daughter took me here for Mother's Day brunch. She went there before for brunch and loved it. When we got there they had replaced the brunch menu with a Special menu for \"Mother's Day\". which was much pricer. Even though they had called the previous day to mention they would have a Mother's Day menu, they did not mention that was the only menu that would be available. The choices were less and pricier. Which I guess is the going thing on Mother's Day. Great food, great atmosphere, but don't be in a rush and don't be starving as they definitely take long. Our entree took over an hour to come out which is mind boggling as they had a limited menu. I would try them again, but not on special occasions.", "author": "Dionne G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-23", "description": "I went to Sunday brunch.  It was delicious.  The staff was professional.  The drinks were really good.", "author": "Marjie N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-12", "description": "Finally a Haitian restaurant that's worth taking your friends to.  The outdoor space is also nice.  Good mojitos.  Definitely worth a visit.", "author": "Jean B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-09", "description": "They raised their prices since I was last here but didn't upgrade quality or quantity. The empanadas were a bit dry and they skimped on the meat filling. Cute staff though", "author": "Sasha H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "Love, love, love this place! The food is phenomenal!I took my daughter here for her birthday and we couldn't stop raving about it. I had the smoked herring pate chodye to start and the legim berejenn for my entree and both dishes were to die for! My daughter had the steak paysanne and she said it was tender and flavorful. The drinks were delicious and strong-and the owner came over to personally greet us and chat with us for a bit. I can't say enough good things about this restaurant. I will definitely be back again and again!", "author": "Tracy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-23", "description": "I liked this place a lot. It had a great energy and there was definitely a disposition for  red velvet cake among the clientele! Food was decent.. thought it could have been better, but it didn't really matter. I liked the pulled herring appetizer -- conch was ok. I loved hearing the local accents in the place, it made me love it!", "author": "Adam G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "This place is great. The food is fantastic and the ambience is quaint and chill... good vibes all around. Our server was eloquent and careful which I appreciated after dealing with the MTA shuttle bus etc all day. Their black rice leaves a bit to be desired hence the 4 stars but the fish in sea salt sauce dish is phenomenal. Great place! check it out.", "author": "Mel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-16", "description": "I just want to say that this place speaks to every part of the Haitian American in me! First, it is located across the street from BAM in Fort Greene. Very accessible in a beautiful location. The ambiance is very trendy. There were different types of Haitian music playing from Zouk Kasav to Tabou Combo but low in the background. So my friends and I were still able to carry a conversation. Every now and then a song would come on and I would be able to reminisce! The atmosphere was pleasant and I felt like I could bring anyone here -- understanding the Haitian culture is not required to eat here. All you need is to love a place with a cool vibe and delicious food. \n\nSince there were four of us at the table, we ordered quite a variety of appetizers, entrees and sides. We started with sparkling wine with Shiktay and Akras under the starter menu. I chose cod fish in shiktay. Everything was just right and the portion was quite generous. We were happy to share and there was plenty for everyone. For entrees, we had Poisson Rose, Lambi La Caye, Seafood Creole and a Pork Chop dish that I can't remember the name of. We had the sides of macaroni and cheese and black mushroom rice, also known as Jon Jon. Every dish was flavorful. And again the portion was flavorful. For my true blue Haitian friends, the dishes resonated with them and brought back memories of their mothers' cooking. For me, I was happy to be able to taste delicious dishes that I never learned to make. I don't remember eating a lot of pork (except for grio) as a kid so the Pork Chop was especially a treat for me because the dish had a lemony sauce that I didn't recognize but immediately reminded me of the days that my mother used to drive the point home -- clean all your meats well with a lemon. Everyone enjoyed their food and brought home a dish in the end. For dessert, we had Pain Patate and the red velvet cake a la mode. Again, my Haitian friends reported that the Pain Patate was better than authentic. \n\nFinally, let's talk about service. Everyone who passed by asked us if we were enjoying our meal. Several people regularly checked in, cleared our plates and the waits for dishes was reasonable considering everything was made fresh. One can tell if their fish is old, especially lumbi- and all of the seafood was fresh and made on the spot. The owners/managers sat with us and talked for a minute and thanked us for coming to his establishment. I really felt like a VIP on a Saturday night. I am definitely coming back here and making this my spot.", "author": "FPGina M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-15", "description": "Been here once with group of 14 people on Saturday evening, reservation for dinner made well in advance. While we were seated promptly as most members were on time, the food took over an hour to arrive for some and one and half hour for the two who ordered the seafood creole. We noticed that patrons who came in later in 2's and 4's being served before us and the waitstaff explained they were short staffed and were trying to serve dinner to people at our table at the same time....therefore the delay. Figure that one for yourself. Ambience was good and food was good but a little sad that the kitchen could not manage orders efficiently. It was embarrassing to say the least. Better not to go with more than 4 people and those who have plenty of patience.", "author": "Naheed W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-04", "description": "Very crowded Sat night but were seated very close to original reservation time. Our waitress was very nice even though at times she was missing in action. \n\nWe ordered the red snapper and the king fish with mac \u0026 cheese and black mushroom rice as our sides. The mac \u0026 cheese was decent but the black rice tasted smoky/burned. The king fish was good but the sauce was super salty. The red snapper was good but...too many bones to navigate to make it enjoyable. \n\nAll in all a pretty good meal. I would probably just come here for drinks/appetizers in the future. And by drinks I mean wine.", "author": "Aija R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-09", "description": "La Caye is hit or miss. I went with four other friends, and the experience left a lot to be desired. The server tried to squeeze the five of us onto a standard four top, and we had to ask to push the two top over to make room for all of us (three men, two women) to sit comfortably. (\"Is there a sixth person coming?\" the waitress wondered before finally pushing the table over.) Then the seating arrangements were so close to the table behind us that I literally could not sit down until they moved the party at the other table. Not a huge deal, but in the grand scheme of things, it is something to note of the overall experience. While certain things were very tasty (ie the mac'n'cheese side, arugula salad and black rice), other entrees were less than tasty. One friend was less than satisfied with the Fritay he ordered, and another friend thought the Creole Wings were just \"okay\". One friend really enjoyed the Legim Berejenn. I shared the Seafood Creole with my bf, and thought it was pretty tasty given the lobster tail, two crabs legs and four shrimp in Creole sauce. Unfortunately, it didn't sit well with me hours later in the evening, and I wondered if it was because the richness of the sauce. While my group of friends decided to give this first visit to the restaurant a C+ (our server wasn't very attentive and the food took a significant amount of time to come out, especially considering we were only one of two parties at the restaurant), the overall rating went down when we realized the final bill included a mandatory gratuity of 18% (we didn't think it was 18% service we received), and the server refused to split the bill three ways for ease of paying. So, somewhere between a 2/2.5 when you get down to it. Overall, it was cool to check out a restaurant in the Ft. Greene neighborhood after an evening at BAM, but the consensus is that we will probably not be back.... unless it's to order the mac'n'cheese and arugula salad to go!", "author": "Mai P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-11", "description": "Very under impressed with the food....came here when we were starving ...expecting good authentic food....\nFood was however not tasty....was too oily and just not fresh....will not be coming  again....", "author": "Angelina A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-15", "description": "Was excited to check this place out but when we arrived the hostess did not take our names and said it would only be like 5 to 10 mins. The people who arrived right before us got a great table quickly. We tried to wait at the bar but could not get service. The bartender saw both myself and my boyfriend and said nothing. We waited for over 15 mins and decided to leave because when we re-approached the hostess she was still unhelpful. What a wonderful end to a really shitty Saturday.", "author": "Diamond S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "Poulet en sauce was very good plus the staff let me had a table for one even though they had a full house.", "author": "Christopher N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-19", "description": "Our holiday party was held at La Caye in Fort Greene Brooklyn. I never had Haitian food before so I was excited that La Caye was the chosen spot. First, the location is very convenient. Located right across from BAM, La Caye is accessible by several train lines. Okay, I know, you're not reading this review because you care about the location, but I thought I'd mention it because it's in a really cool area. The owner/chef (I believe his name is Ralph) was a sweetheart along with the bartender/waitress. He started us off with a squash soup that had just the right amount of veggies. The soup was not thick (which is usually how I like my soup but since it was a \"starter\" and had a lot of vegetables, it was perfect). In addition to soup, we were served (what I thought was rice) Shiktay. Oh my..this was absolutely delish! Cod fish mixed with onions, garlic, parsley \u0026 peppers. I had to stop myself for going back for thirds. The fish was not at all fishy tasting nor was it very salty. The combination of fish to veggies was just right. For the main course, I ordered the Talapia. The fish was cooked just right with this amazing sauce. (Unfortunately, I don't know what the sauce consisted of) My one co worker had the Poulet En Sauce, which was stewed chicken. The chicken was very tender and delicious, especially the sauce they cooked it with. Others (and probably what I will be ordering when I go back) had the Legume D'Aubergine. I sampled (as I did with the chicken) this dish and was in heaven. Even before trying the talapia, I knew I made the wrong decision. The Legume D'Aubergine was unbelievable. It's a vegetarian dish of eggplants, lima beans, spinach in a tomato sauce. It was so flavorful that I (once again) had to stop myself from taking a second \"tasting\" from my coworkers plate. All dishes were served with a generous side of black mushroom rice. The rice was amazing. If you like the taste of clove, you will love this. \n\nThe staff were super friendly and allowed us to sample the recommended Cabernet Sauvignon before committing to a glass (which we wound up ordering). The prices are reasonable considering their location. I am looking forward to going back there soon.", "author": "Holly M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-10", "description": "We went here on a Saturday evening. The food was pretty good. We had Seafood Creole, Lambi, Tilapia Gros Sel and Poisson Rose. The Seafood Creole was excellent--shrimp, lobster tail and snow crab legs in a rich red sauce. It was seasoned to perfection. The tilapia gros sel was moist tilapia in a broth. It was also delicious. The Lambi is conch in a deep reddish broth. It was ok, except that some of the conch pieces were tender and some were very chewy. The poisson rose is whole red snapper in a spicy red broth. It was also moist and flavorful, but if you're not used to whole fish and all the bones that come along with it, this is probably not the dish for you. Our sides were the du riz djon djon--black rice with green peas, and the fried green plantains. They were both very good. The rice was cooked well and perfectly seasoned and the plantains were hot, crispy, and delicious. The restaurant itself is a very pretty, intimate space on the inside with a cute, airy patio space in back for two very different types of experiences. There was a wait for the food and the waitresses apologized to each table for the wait. However, that was not a big concern for us because we were in good company and we the food was definitely hot and freshly prepared. Our main concern was the automatically added 18% tip. We typically expect the automatic addition of a tip for a large group, and with notice. However, none of us saw the tip addition listed anywhere and our group only consisted of four people. After we left we noted that the bill listed 5 guests instead of 4. Perhaps this is why we were automatically charged a tip, as restaurants that do this typically start this addition at 5-6 guests. At the end of the meal we were ready to go to our next stop so we didn't bother questioning the auto tip. The amount was just about what we would have tipped anyway. It just left a bad taste in our mouths especially since we knew nothing about it until we received the bill. 4.5 stars for the food and ambiance, 3.5 for the auto tip.", "author": "Eva C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-10", "description": "Great neighborhood spot and destination( if you are craving well done Haitian cuisine in a classy atmosphere)\n\nI'm  part Haitian and can make my own excellent grillot and Djon djon rice but sometimes a girl wants an excellent home cooked meal with  a nice drink that she didn't have to cook herself....all in a cute spot in the hip part of town..,snap...enter Le Caye....lets first say that as far as I can tell there are no classy Haitian restaurants in the city that can compete...decor typical Brooklyn wood steel cool...the spot is small..great location next to BAM....my only issue is they could decorate  with more Haitian flare...I mean Haiti is known for its amazing paintings and sculpture....lets represent that..especially since the owners and management seem to be Haitian...\nCurrently they have no liquor license so I had to satisfy myself with the sparse wine list....\nFood was tasty goodness..I had the whole snapper  with Djon Djon rice...fish was super fresh, perfectly seasoned..rice was a bit  spicy for djon( special mushroom rice from a mushroom only cultivated in Haiti) ...the only thing I didn't love was the Accra or yucca fritters....too dense for me...and I am used to having them with codfish or herring bits inside...my sister initially ordered the pork grillot but they had run out of it for the night so she had the beef tassot with plantains and accra or yucca fritters...again well seasoned tassot...roast beef chunks...portions were generous for the price...the snapper was twenty  and beef only 12.... Although its weird they don't serve the beef with rice...or have rice and beans as a rice to order....another very classic Haitian dish...\n\nservice was odd...when we first entered the restaurant was half empty and initially the waitress wants to place us at a table right next to the door..I politely ask for something more interior and she has to think about for awhile but then finally moves us...annoying...then I order the conch a few minutes after ordering my main meal and make sure to ask waitress if it will come out in time before the mains... she says no problem...of course the conch doesn't make it in time so I let her know no use giving me the conch...her and another waitress kinda made a big deal of it...like are you really sure you dont want it ...it's so good...you can have it wrapped up to go...sorry it's not  my fault you or your kitchen can't cook appetizers before main...despite the mildly annoying waitress staff the saving grace at La Caye was the owner/ manager...he came repeatedly with a lovely concerned smile to our table ..to apologize about the conch mixup...and that they ran out of pork grillot...and ended up giving us a free dessert on the house..we got the pain patate...which was unfortunately a bit dry....\nBut the few negatives I attribute to growing pains.....\n\nI am defiantly coming back to this place...it's a great Haitian restaurant with a cool vibe in the heart of Brooklyn...can't wait till they have a full liquor license and can make some delish drinks with  Rhum Barbancourt...\n\n\nNow if they can only open one in my hood in Queens, serve rice and beans and some Haitian pâté ......", "author": "anabela D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-24", "description": "I never had Haitian food before. The staff was very friendly and accommodating. A friend and I were going to NdGT's StarTalk! at BAM at 8pm. We got to the restaurant at 7pm, got seated at 7:10pm and got our food in 20 minutes and made it to the show on time. I ordered legume with the black rice, it was spot on! The vegetables were nicely cooked and the flavor was delicious, it tasted like there was some coconut milk and it definitely made me think of a tropical version. Very happy with my dish.", "author": "Joyce M."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}