{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-12", "description": "Best Haitian restaurant in BK. Love the atmosphere and the food . It's always a great time going there . Will definitely be back . \n\nLoved their boulette sliders . Their corn / grits with shrimp is to die for .  Even the plain white rice is delicious. \n\nNow ! If you can point me to an Haitian restaurant that has grilled lambi I'll pay you . This is the closet I feel you're going to get to the motherland.", "author": "Rae C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "My husband and I are in Brooklyn for the weekend..and as a surprise he made reservations for this quaint restaurant. \nThe food is delicious, drinks are strong and the service is spot on! \nThe reason why I gave it 4 star is the hostess was a bit rude to us. \nIf you want great Haitian food this is the place for it!", "author": "Alison M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-28", "description": "This is a very lovely place to eat. However, on a Saturday evening it might not be ideal the wait time for food is about 45-55mins. The food in my opinion is a bit pricey and they portions was small. I order a frittay platter it was very tasty. The presentation of the food was good. Over all it's a very good place introduce your palette to Haitian food. The flavoring was kept very simple and basic.( If you have been previously exposed to Haitian food you will notice the difference immediately it's usually more flavorful)\n\nConsidering the location and their target Audience it's a very nice place to eat and be introduced to the food. The staff was friendly. The ambience is nice.", "author": "Momo G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-22", "description": "This restaurant is conveniently across the street from the Brooklyn Academy of Music.  We dined here after watching a show.  We ordered the salade jardiniere, Fritay, and Lanbi Boukannen.  All were delicious!  The vegetables in the salad were perfectly fresh and crisp, the conch was smoky with an amazing texture and the Fritay contained an array of must-haves for sampling Haitian food.  Of course we had to add a side of black mushroom rice for the perfect spread.  The ambiance was warm and inviting and our server was friendly and helpful.  We learned at the end of the meal that she was the owner.  I cannot wait to visit New York again to try some of the other foods on the menu and to get a second sampling of the above!", "author": "Keyteshia G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-14", "description": "This place went down the hill since 2014. Food takes forever to get and is meh at best. The owner is a prick who needs anger management classes. No customer service whatsoever.", "author": "Sophie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-24", "description": "My favorite restaurant! Christina and Tricha are amazing!!! Best customer service ever! It's always wonderful when I go there.", "author": "Rodrigue P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-09", "description": "Small and intimate. Makes a great spot to eat with a friend. I wouldn't recommend it for a group simply because of the tight space. The food was OK. \n\nIn addition, the receptionist as well as the waiter were extremely rude upon our visit. The receptionist was not approachable and unwelcoming. \n\nOur waiter was very impatient and did not crack a smile throughout our visit.\n\nThis place has potential but the service of the employees really brings the place down. \n\n1 stars for the ambience of the place and 1 star extra for the food.", "author": "Dorene S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "The hospitality was amazing. I know some reviews say the service was bad/rude but I had the complete opposite experience! Came here for a friends birthday. Our server was so accommodating, and the manager gave us drinks and an two appetizers and a birthday dessert on the house! We came on Thursday, so the band was playing and gave it a nice vibe. The food, while it did take some time to come out, was flavorful and delicious. Taking one star off because it is somewhat pricey for what you get. I will definitely come back for drinks and apps on a Thursday!", "author": "Brieana C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-08", "description": "We get here around 6:30. We just wanted a drink as we had already had dinner and drinks at a different establishment. There was no space at the bar, so we sit at a table. A waitress brings us water and menus and leaves. We sit. And sit. And sit. And sit..... after about 20 minutes of no service, we see 2 seats at the bar so we relocate hoping for better service. No such luck. We had to flag the bartender down for everything. And every time she spoke to us, she wouldn't look AT us. She would continue doing whatever she was doing as if we were a bother.  Not very personable or friendly.\n\nWe ordered a Prosecco drink with leeches and strawberries. Delicious!  Turns out it was happy hour, so each drink was only $5!  We ordered another. \n\n2 stars because the place was quiet and intimate and I really liked my drink. But I put a lot of weight on service. Maybe on a different night, with different staff, I'd have a different experience.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-04", "description": "Stinky raw fish! Waitress hair all over the food. When you are serving with braids you need to tie your hair. Non- authentic Haitian food. This restaurant is not what it used to be. If you want to come and enjoy some music go right ahead. But the service is bad, poor customer service, waitress with attitude. If they continue like that they will lose a lot of customers", "author": "Markens N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-16", "description": "I was really excited to visit La Caye when I first heard about them a few years ago. I have been to New York so many times and I never had a chance to come by and check it out. I was skeptical to come here after reading the recent reviews about the subpar service but I decided to give them a try. The previous reviewers were not wrong. The restaurant needs to do better. Im not sure what management has in terms of proper training but they need to teach waitresses how to \"wait\". They literally took forever to take our order and then came back out to tell me that the meal I ordered was no longer available. It was crazy. They open until midnight but they ran out of red snapper at 8pm? I literally sat there all night sipping a mojito which was really good. My cousins are from the area and say they wont return either. Im always looking for Haitian food in nice settings and was excited when I got to the restaurant because of the great music they were playing. Too bad it took over an hour to get our food. I had young children in my dining party who actually began to fall asleep waiting for their dinner. We watched other tables get their food while we just sat filling our bodies with the water they brought over in a pitcher. Shame on you La Caye! I did not feel \"at home\" at all.", "author": "Juselle D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-03", "description": "Food was pretty good. Place is small but homey. My friends took me here for my birthday since I've been talking about it for a while. The only downside is they didnt have a vegan option for my friend at the time but she got a bunch of sides and enjoyed them.", "author": "Manny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-26", "description": "The food here is excellent! I'll start with that.  The Kabrit (goat) is tender and mouth-watering. Sitting lightly in a red creole sauce, it pairs perfectly with the black mushroom rice.  I also tried the Legumes. It was cooked a bit softer than what I have become accustomed to from other Haitian restaurants.  Nevertheless, the flavor was there and equally as tasty.  The portion sizes are pretty average here. You'll eat well but you won't feel stuffed when you're done.\n\nThe atmosphere and vibe of this restaurant is very chill.  The music is all Caribbean. Reggae and Soca vibes mainly.  They have a limited wine selection but the ones that are available are delicious.  The only drawback is that the pours are a less than generous. It seems like they're rationing it out to some extent (or maybe I'm just basic and used to free flowing Happy Hour house wines *shrugs*)\n\nThe prices coincide with the slightly upscale environment created with the interior design and clientele.  This place is definitely a good date night spot and nice neighborhood stop in if you're in the area.", "author": "Keilon L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Great Haitian food!! I so glad me and my daughter decided to pop in on a Sunday afternoon. Great ambiance: not too noisy, but you could still hear the \"kompas\" playing in the background. If you want something different, not many have tried Haitian food ( not all West Indian food is the same), you'll not be disappointed. Nice upscale Haitian fare , the place is cozy. I had the \"fritay\" platter with griot, accra, banane frit, side of macaroni au gratin. My daughter had the \"legume\" with black mushroom rice. Delicious. We left fuuull \"gwo vaunt\"  I will be letting all my friends know about this little gem.", "author": "Paula L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-02", "description": "My favorite Haitian Restaurant, love the fried okra, black mushroom rice is out if this world.", "author": "Capriqueen T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "Never disappoint. I love this place, I've been going there since they opened and I never had a bad experience. The Lambi, the kabrit, etc. mouthwatering. \nSimply the best spot in BK.", "author": "AZ F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-24", "description": "Located directly across from The Brooklyn Academy Of Music, this is a convenient spot to dine before a show.\n\nA cozy, long, dark narrow space with plenty of tables and a bar.\n\n$6 bottled beers and $6 glasses of merlot.\n\nStarted with the Creole wings. Six wings served with a sneaky, sweet to hot, guava and mango sauce ($10).\n\nI had the half chicken served in a tomato sauce with onions and peppers with black rice ($19) and my other half had the stewed goat in a flavored Haitian creole sauce with white rice ($30).\n\nBoth were tasty, but we both agreed the sauce seemed to be the same for both dishes, not real taste distinction was noted.\n\nTo end we had the pineapple upside down cake ala mode ($10). \n\nAll in all, a tasty meal.", "author": "Gregory C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-05", "description": "I have never had Haitian food before so if you are looking for authentic cuisine I am not the person to ask, but the food here is delicious! We shared the conch appetizer and the goat stew and loved them both. We had never had conch before and really liked it, seems kind of like octopus in taste/texture. The goat was also one of the best prepared I'd ever had. The location is great if you're looking for something near BAM and it wasn't too crowded. The only negative for me was that the portions felt small compared to the prices.", "author": "Gabriela R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-21", "description": "Came here for dinner a couple weeks ago. I was excited to eat Haitian food again after a recent trip where I volunteered in PAP for 8 days. I brought 2 friends, and we arrived around 9:30 pm for dinner.\n\nFirst, the food was great and everything I hoped for. We ordered the goat in creole sauce, the vegetarian legumes (spelled 'legimes' on the menu) and extra sides: fried plantains (prepared like tostones), sauteed spinach, and 2 orders of the black mushroom rice. Everything was fresh cooked, well seasoned and good portion sizes. \n\nIf you've never had Haitian food but want to try it, to my taste buds this was authentic and like home cooking. The goat was tender and the pieces of bone were clean cut and not splintery like you sometimes get with Indian food. The creole sauce the goat came in was delicious. The black rice was really tasty, not very mushroomy (if you are thinking of mushroom gravy or truffles that's not what this dish is) but still exactly like what I ate in Haiti. The legumes were awesome. Legumes are basically a stewed veggie dish made with eggplant, carrots, onions, beans and peppers. It is melt in your mouth good!\n\nAs for the service, it was mostly good; the waitress was friendly and competent, but also very busy; she forgot to bring our 2nd drink order and one of our sides, we had to ask for our drinks 3 times, and finally another server brought them and our side dish. We were enjoying savoring the food and each other's company and conversation so it was not a big deal, but that is the reason for only 4 stars.\n\nAmbiance was definitely buzzing, possibly because it was Saturday night. Almost every table inside and most tables outside were full. We really enjoyed it and my friends, who had never had Haitian food before and who live in Brooklyn, said they would definitely go back. I would too next time I'm in town!", "author": "Jen P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-20", "description": "We were a group of about 22 people for a wedding reception this Thursday.  The place was very clean, table well set but there was only one server for the entire table.  The young lady did her best to please everyone, tough she was obviously overwhelmed. It took very long to be served.  \nThe food was not tasty and cold; I have had better haitian food. The plates that they gave for the appetizers stayed on the table, dirty until the end.  I had chicken that was served in too much gravy and it was difficult to eat it with the mac n cheese which was good.  \nThe place was reserved well in advance so that they could hire another server for this amount of people, the food would come to the table at least lukewarm.  The black rice had no taste.  All in all, I will not return to this restaurant and of course, would not recommend it.", "author": "Bit E."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}