{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-19", "description": "Just ordered the snapper gros sel...it's awful. In fact most of it was thrown out (unfinished). Paid $30 bucks for an unseasoned, pungent piece of fish and plantains. I'll never step foot in that place again. Save yourselves and your money. I'm so disgusted.", "author": "Dorothy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "We came here with my husband for Valentines day, I check the restroom before i eat everywhere, it is very clean that means they are clean, i dont remember the name of the food I dont remember but very fresh and tender they make it with goat meat The best I ever eat so far ! Nice and polite servers by the way! 5 stars from me!", "author": "DA D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-21", "description": "Went the a while back  and the food was really good. The wait time can be long without reservation, my husband thought the food was a bit salty. I had the same foods I always get, but tasted a bit different. Not sure if they changed chefs. I'll try again and see if it was just a bad night", "author": "Jerdene A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-25", "description": "The food is good. However, I was dissatisfied by the few menu options (staple Haitian foods you'd think you'd find at a Haitian restaurant, they did not have) and how overpriced it all is. As a Haitian, I love to support Haitian businesses and have visited La Caye a few times now but I see that every time, my thoughts are the same which is quite unfortunate so it's likely I won't be going back. Too bad though.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-30", "description": "No. No and never again. I reserved this place for my sister's graduation on May 18th. The guy who helped me set it up through phone and email, pleasant. The actual experience, horrid. I had come here before with 3 friends and ordered fritaille and it had a different experience. This time, nope. May 18th is Haitian Flag Day so i expected a bigger than average crowd at a Haitian restaurant. They were understaffed. We got to the restaurant at 6:45 weren't seated until 7:20ish, which was alright since we were waiting for the rest of our large group. Our orders were taken a bit before 8. We waited 2h15m for our food. What's worst is we saw tables around us that were seated after us being fed. The entire group was upset but we made the best out of it because of the event. One plate of food even came out cold. By the time were eating not only were we not in the mood to eat because we had taken so long to get the food but also the food was not spectacular. It lacked the Island flavor we were all looking for. Never again. \n\nPros\nThe backyard is quaint and not noisy. The live music was nice.\n\nCons\nEverything else.", "author": "Tamira G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-13", "description": "So as a Haitian I can definitely say that this restaurant has really good Haitian food. I came here with my family  about two Saturdays ago for my baby cousin's baptism reception. The decor is very nice and elegant inside and comfortable. \nFor appetizers, we had the chicken wings, akra \u0026 meatball sliders. Everything was tasty but we wanted more lol. For our entrees, we had a choice of goat, fish and chicken with either diri djon djon (black rice) or macaroni. I ordered the fish with macaroni and let me tell you, that fish was delicious. It was seasoned very well and cooked amazingly. The macaroni and cheese was also great, it was crunchy on the top and cheesy on the inside, just yum! The chicken was pretty good as well. I had a chance to taste the rice (diri djon djon) and it was okay but I've had better. \nNow for the service, which wasn't horrible but I think the waitress was overwhelmed with the amount of people that was there. She kept forgetting our requests and orders and she required remainders through the event. Other than that everyone was really friendly.", "author": "Guitelle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-29", "description": "I was told about this restaurant that specializes in Haitian-American fishes and I would say that this place was good. Location is nice as it's right across the street from Brooklyn Academy of music. The food was good as I had half chicken with fried plantain \u0026 some rice. I ordered the appetizer combination and it was a lot of food and it was delicious. Great location, great food, also great service, I would definitely come back here again.", "author": "Jason R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-10", "description": "I was definitely looking forward to trying out this restaurant. love supporting my ppl! The restaurant is really cute n cozy, a very downtown bk vibe with kompa (Haitian music) playing. The outdoor seating area is really nice and spacious, well situated. There was no wait for a table, we went on a rainy Thursday night so that prob helped, the service was good. \n\nNow for the important part, the food! The food was good. We had the fritay with Tasso beef which was alright (I had amazing fritay b4) and beef boullete slider and fries which was on POINT! Sooooo goooddddd! I also had a Mojito which was not bad. \n\nParking around here is VERY hard to find, but the train station is close by. There is only one bathroom for men and women, that just doesn't make any sense to me! But I will definitely go back.", "author": "Danessa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "\"Ayiti! Ayiti! Ayiti!\" ---- such was my cheering for the love of Haiti, Haitian food at La Caye, and Haitian friends after several glasses of Malbec and a stomach full of black rice, fried plantains, and steamed fish. \n\nMan oh man. As anyone will tell you, it's so hard to find good Haitian food outside of being Haitian or being around Haitian friends whose Meres, Grand-Meres, and Ninnins will cook for you. But my involuntary hiatus was effectively ended once platters started coming to our rowdy table. \n\nI won't regale you with how fun the night at La Caye was - I'll simply note that the food is excellent, as is the service. Two ladies attended to our crew with patience, efficiency, humor, and genuine care. We were so thankful and happy with the great food, great service, and wine. The restaurant itself is quite unassuming from the outside, but once you step in, warmth, fragrant aromas, and a chill vibe all await. Definitely looking forward to ma prochaine visite.", "author": "Nelle C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-11", "description": "I was very excited to visit this restaurant I was visiting from Charlotte NC, and herd so much about this place. I was sorely disappointed with the entire experience, I'm from Haitian decent so I'm very familiar with the food and culture that's why I was so disappointed with the food and the service.", "author": "Phillip A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-30", "description": "The food is excellent. Say in the outdoor space which is a nice cutaway in a busy area that gives the aura of a private garden. The drinks were great and creative. They did not short you in the alcohol content. The menu leans heavily toward fish and seafood if you are not a fan of goat. I had a seafood special with lobster, clams, grilled calamari and scallops served with their Mac and cheese. It was delicious. My only complaint is the kitchen is incredibly slow. I would not be surprised if it's one chef making all the food. Took ~30mins to get our food. Overall a good experience, bring good company that will entertain you during the wait and you'll be rewarded with a tasty meal.", "author": "Dr D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-11", "description": "The food here was good and pretty well priced. The black rice and poule en sauce was really tasty. Food is spicy and I like that. \n\nSadly the service was week. My party ate outside and it seems like wait staff almost forgot about us. By far the worst part was the construction site behind the restaurant. As construction always does there was a mouse running across the backyard.", "author": "Charles K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "I can't not come here whenever I finish seeing a BAM show. The atmosphere is lovely, the food is gourmet style Haitian food reminiscent of my grandma's cooking, I can speak Creole with the sweet and attentive waiters, the drinks are delightful, and afterwards, you can take a nice stroll around the neighborhood.\n\nI also met Spike Lee in here one night, so... hey! :)", "author": "Cynthia F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-29", "description": "This is our first time at Le Caye, it was recommended by my aunt who had dined here on a prior occasion. \n Firstly , the restaurant has amazing ambiance. It deserves more stars for the ambiance alone unfortunately ambiance is only a portion of an experience. we were immediately greeted by the hostess was very warm and welcoming. However, once we had been seated everything went downhill.\n\n Alona, was our waitress and to say she was inattentive is an understatement. After we were seated, I went to the restroom and when I came back them to other members of our party were already complaining about her. I gotta taste of what they meant, when she actually stopped taking order and walked away to another table to answer the question. We then had to back and I had to come back I guess she has forgotten that she was working with us.\n\n   I ordered the fritaille (sp) an assortment of fried Haitian meats and a spicy pickled coleslaw called pickliz. It was okay, I have had better homemade Haitian food . The griot wasn't as tender and flavorful as what I'm accustomed too. \n       Another member of my party ordered the plantain with cod appetizer which was really good. \n   My cocktail was watered down, \u0026 I ordered a glass of red wine which I never received thanks to  Alona. She apparently didn't remember, but by that time I didn't care I was turned off from the restaurant and the entire experience. The chef in the kitchen while having an argument littered with profanity. There was a gentleman who came around trying to make everyone feel at ease, I do not remember his name he was nice but there is really a lot of things lacking.\n\n   Thank goodness for the other waiter the gentleman with the tattoos on his arms who picked up a lot of Alona's slack. He bussed our table, got us extra sauce etc. He was great  and deserves 5 stars all on his own. \n\n   The clincher came when the check came and we saw the added gratuity and saw that our  party of 3 had been rung up as a party of five. I'm usually a very outspoken person, but at this point we just wanted to get home and we paid the bill. I didn't feel like Alona deserved any type of tip I would have rather given it to the other waiter with the tattoos.\n  I did call the manager the next day and someone got back to me within 2 days and he acknowledged that he added gratuity was not only wrong but also illegal. However he did not offer to refund my money he just said I order last time I came in I can get a drink. That's not a good business practice, so if any of you go to look tired please be sure to check your bill and know that in New York State and automatic gratuity is the legal and it should be reported.", "author": "Cocoa L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-11", "description": "The menu prices listed on Yelp are wrong. I ordered dinner to pick up and discovered the Pork Fritay was not $15 but $22. When I showed the waitress the prices listed on Yelp she said the restaurant has nothing to do with the prices listed on Yelp and that they really have no control over what's listed on Yelp. (So I'm sure they won't be reading this review). Now, you would think that the there would be a compromise made by the restaurant regarding the price as it was Yelp who helped me to find info about their restaurant. Sadly that did not happen and that's unfortunate.  \n\nThe food was just OK. The fried pork lacked flavorful spices that would have transformed this dish into a true Haitian Dish (Btw, I am Haitian).  If you want authentic Haitian food, try most Haitian restaurants in the Church Ave/Nostrand Ave area. You'll get more for less.  \n\nIn short:  the food was meh, overpriced and they're terrible at customer loyalty.  This was my second time at the restaurant, both my dine-in and take out experience weren't so great and I will not return to this restaurant again.", "author": "E G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-02", "description": "The food was awesome, macaroni was a bit salty, but they were able to give me another side free of charge. My only issue is that it took waaaay too long to get the food. I would give it 4 stars if it wasn't for the long wait.", "author": "Marie G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-22", "description": "I was there on Friday after the Jimmy Kimmel show for a quick drink the bartender gave me my bill and when I gave her my credit card the bill was doubled and she swiped my card.. The manager/owner said he would. Correct the issue however he did not and upon looking at. My account I see that the money was withdrawn from the second bill. I have been here since it opened and the service and food have declined tremendously.", "author": "Mayra S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-24", "description": "Big fan of La Caye. They've been very accomodating to various gatherings I've had there over the years, and concurrently, their food and drinks do not disappoint. And with my Caribbean origins, I'm always elated to have a spot in Downtown Brooklyn to (still) attend amidst all the changes to the landscape. It's ideal for a quick drink or a long dinner, and the atmosphere is usually lively...especially on Thursday nights live performances. A lot of traffic flows through here, and the staff tends to be rather patient with the hubbub. I've had one or two issues here, but the good has outweighed the bad by far.", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-15", "description": "I love this place and I've only been here 2x. First and foremost, my parents are of Haitian descent and the fact that this restaurant translates to \"home\" in English is enough to cause me to be more inclined to love it! Still in all, I'm a firm believer in show \u0026 prove. \n\n  With that being said, La Caye definitely showed and proved! This review of for the last time j came here on a date and it was great! It was a Thursday night where they have live music weekly. A fun fact that was unbeknownst to me prior. The band completely killed it, led by a Haitian native singer and instrumentation that would give you auricle orgasms! Yeah, it was that good! \n\n  My Lady has never been out to a restaurant serving authentic Haitian cuisine and I'm happy this was the time. She absolutely loved it! We were beyond hungry and we completely devoured the chicken we ordered with two sides of black mushroom rice with the entree of Poulet La Caye to share. It was simply delicious! We also had a few glasses of cremasse each was also delicious and certainly did the trick. I loved the mint leaf in our glasses which was a nice touch to to the taste of the cremasse. \n\n  I'm reading some negative reviews about this place and I for one believes that you just can't please everyone. I mean seriously. What do you want? Then again I'm not one to knock anyone and their personal experience. I can't wait until Spring when the backyard is open! Hopefully it's open to the public and not reserved for reservations only. I for one can state that I've had a decent experience the 2x I've been here and I liked the food both visits as well. I will certainly be returning!", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "I ate dinner here  last night with my friend. I ordered the red snapper with white rice and black beans. The food was tasty and well-prepared. I enjoyed every single bite. \n\nI also ordered a sangria, the drink could have been better. It more sour than sweet. \n\nOverall, we had a great experience. The decor is simple, yet elegant. The location was great. I will definitely recommend this restaurant to my friends.", "author": "Lucie T."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}