{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-28", "description": "The ambiance was lovely, the cuisine-especially the fish and the goat was great.  But believe it or not the best was their macaroni and cheese  yes! At a Haitian restaurant!    the one downside was the long wait for service.  Other than that, I enjoyed myself thoroughly-oh and the picklies left a bit to be desired!", "author": "Rachel W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Service is horrible but it's the closest thing to authentic Haitian food.. Go for it!", "author": "Jessica F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-01", "description": "This restaurant caters to the theater crowd. BAM is across the street. Yet they had just one barkeep and one server working. Huge delays. Cancelled the food order and left after waiting an hour. Don't bother.", "author": "Robert M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-19", "description": "The place was lovely great location. The hostess at the the door was rude. Was on a personal phone call when I walked in. She just say \"yes\" and not welcome or good evening. I sat at the bar and she continued her conversation on the phone. The service was fast the bar tender was pleasant. The food was not so great. I order led akra and griot and had the ginger sangria. The ginger sangria was good. The griot was okay can't say it's great. The akra no good. One side had to much spice the other side was salty. It was not properly mixed. You could not taste the root vegetable which defeated eating it. It was not the best experience and probably will not return", "author": "Daphnée H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-23", "description": "Worst treatment I've ever received at a restaurant. I paid $150 dollars to be treated like an animal. The hostess and bartender are complete assholes, their faces looked as if someone killed their family member. It's a dark and depressing vibe. I should've walked out after waiting 60 minutes for my meal, a party of 4 came in 20 minutes after us and got their meals sooner....Really? My husband is Haitian and i wanted to surprise him, what a mistake. The fish was tasteless. The goat was salty. People go to restaurants to enjoy themselves and take a break from home cooking, not to be waiting for shitty food and taking attitude from stupid workers. The owner should fire everyone in there.", "author": "Kelly C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Serious hatien eats never hearx of the place was attending a show in Barclays center on had live music and all friendly staff had chips in a sweet sauce along side mushroom rice. Can't wait to take a girl perfect for a date night thanks guys.", "author": "Tony M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-15", "description": "Great food!! Seasoned to perfection and well marinated. We had their conch and the steak. The guava sauced wings were great too. Prepare to wait though. The serving time is lengthy, even for the appetizers. My only hang up is the drinks, bartender could improve on his cocktails.", "author": "Marsha M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-17", "description": "I came in on Father's day with a party of 7. We put in our orders at around 8:20PM, food did not come out until 9:47PM. This restaurant is understaffed, poor customer service and the food was just okay. There was only two waiters for the entire restaurant. They had to serve drinks, bust tables and run food. Around this time the restaurant was packed inside and outside.", "author": "Gaelle G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-18", "description": "The service is very slow it's like they know you came in but they walk around not paying attention. Someone actually walked passed me 9x until I said something and they say oh is someone helping you.. The food is good but the bad service sucks! This is like a place you'll come when mom hasn't cooked and your to lazy to whip up something to eat", "author": "Ashlee W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-19", "description": "Amazing Haitian food. My fiancé was in love and he's Haitian! I really loved the Mac and cheese. I loved the live music as well and the ambience. The waiter was very attentive and all the food was really good.", "author": "Fanta M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-10", "description": "I 100% regret coming here. I waited about 20 minutes for my food which I didn't mind too much. But These reviews are BS. The grio was so salty, my friend and I couldn't finish it because it was so nasty ... the macaroni au gratin tasted like regular American macaroni \u0026\u0026 the black rice tasted nothing like black rice ...  if you want real Haitian food go to Flatbush or Canarsie or something like that but this place was full of people that weren't even Haitian and didn't even know what they were talking about", "author": "Tee M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-22", "description": "The atmosphere here is quaint and intimate, perfect for date night. The restaurant is located directly across the street from BAM (Brooklyn Academy of Music). \n\nThe food is tasty but lacking the Haitian flavor I hoped for. I ordered grio which came with fried green plantains, fried yuca and pikliz. Grio (fried pork) is one of my favorite Haitian dishes. It was fried well, however it lacked the traditional Haitian spices. There were plain onions and peppers placed on it which are usually pickled with pepper...disappointing. The pikliz at the side were also lacking pepper and flavor. The fried yuca was a first for me, I have never eaten it with a Haitian meal. The fried plantains were perfection: fried, smashed and lightly salted. Honestly, I would have been happy having only the fried  plantain.\n\nThe mixed drink menu was small. I ordered a glass of Ginger Mint Sangria. It was very citrusy with a hint of ginger, a bit sour with a punch (strong). I would have enjoyed it more if there was a touch of sweetness added.\n\nOverall the food was good but lacked the Haitian flavor I was looking forward to. I would definitely return to enjoy the quaint atmosphere, have a few drinks and snack on some fried green plantains :-)", "author": "Kurleigh T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "Love this little Haitian gem in Fort Greene. Service can be slow at times but when the food does come out, it makes up for it completely. Everything is always good. Def a must try. Have some patience and you won't be disappointed regardless of what you order", "author": "Jay P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "Awesome Haitian Restaurant! My family and I had a great time. We enjoyed the Fritay Platter which offered so much variety. The Lambi as a snack was a special treat. I can't wait to go back again.", "author": "Val V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-09", "description": "Their service sucks. I came with my husband for dinner and we're waiting to be seated while the greeting girl was at the counter busy with her phone. When we finally got our seats and menus nobody was paying attention to us. No water, nothing. The girl was entertaining visitors at the bar counter. There was only one couple except us in the restaurant and people at the bar counter. So we left. We are not coming back.", "author": "Anna R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-15", "description": "Love the ambiance. The customer service was impeccable. No long wait and we arrive late for our reservation. The only thing I was dissatisfied with was the wait time for the food. It took FOREVER. \n\nYou must try the goat, probably the best meat on the menu, their macaroni and cheese was great and their lambi. I gave three stars because of the wait for food and because there's absolutely no hard liquor there. Otherwise, a wonderful experience.", "author": "Poshy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "Came here on Sunday and I must say this was the best Haitian food I've had in a long time.  I had the stew goat with black rice and it was simply delicious! The meat was so tender that it came right off the bone. I usually don't like spicy food but I had to tolerate it because it was just so damn good. The food took a while to come but it is definitely worth the wait. Our waitress and the bartender were very nice and attentive. The pomegranate margarita was strong and tasty, just the way I like it. The place is small so make sure you make reservations or you will definitely wait a while if it's busy. I definitely will be going back soon.", "author": "Ebony E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-06", "description": "Terrible service.  It took a 1/2 hour to get a glass of wine. First appetizer took another half hour.  Second appetizer came with the entree... fried chicken wings... tasteless.  Then finally after one and a half hour the steak in peppercorn sauce came and the sauce was cold!  We sent it back and it took another 15 to zap it, not plated, but literally thrown together and it was still cold.  So disappointed!!!", "author": "Carmen P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-31", "description": "The food is okay! It caters to a hipster crowd. The pikliz could be more spicy. If you are Haitian you may want to skip this one.", "author": "Rose-Camille F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-08", "description": "On a recent visit to New York, a dear friend of mine from college (Robert) met up with me, my daughter and sister.  Additionally, he asked a dear friend of his to meet us at La Caye restaurant.  (Originally, we supposed to do a \"serious\" food tour of NYC, but a change in plans postponed that activity to a later date.)  Robert is a serious foodie and I trust his palate.  Anything that Robert says is delicious, is delicious and when he recommended this Haitian restaurant, we had to go there.  We don't have Haitian restaurants in Pittsburgh, but we need to have one after sampling items from La Caye's menu.\n\nI just assumed that the menu items would be similar to other Caribbean fare... heavy on the jerk seasoning and plenty of rice.  Boy, was I surprised.  With Haitian food, you can really taste the French influence and the expert use of ingredients that are indigenous to Haiti.  Here's what we ordered:\n\nLanbi Lakay/ Lambi La Caye - Broiled Conch in authentic Haitian sauce.\nSalade Jardinière - Mixed greens, fresh sliced fruits (pear/apple), shaved carrots and baby tomatoes in a balsamic mango vinaigrette dressing. \nPoulet en Sauce - Creole Chicken. Served in a tomato sauce with onions and peppers\nPan Seared Pork Chop - Served with potato hash garnished in a pork au jus sauce\nPoisson Rose - Broiled red snapper in Creole sauce.\nTilapia Gwosèl/ Tilapia Gros Sel - Broiled in white wine, thyme, fresh lime, sea salt sauce.  \nSides - Macaroni au Gratin, Fried Plantains, Diri djon djon - Black Mushroom Rice, White Rice with bean sauce and Pikliz (Haitian spicy slaw) \n\nI have only had conch fried in a fritter or served raw in ceviche.  I have never had it sautéed in a sauce. (Conch is like calamari.  You have to know what you're doing with it or else it can turn into hard flavorless rubber.  Yech!)  La Caye's conch was like butter!  I wish that I had some now.  But the real revelation was that Black Mushroom Rice - Diri djon djon!  I couldn't leave the table without trying to find a recipe and the supplies to make it.  Lord have mercy upon my soul!  That rice would make you drop kick your mama to get to a bowl of it.  And I have to have the recipe for the Macaroni au Gratin (Haitian Macaroni and Cheese, y'all!) too. \nLike Robert said, his older brother spent most of his younger days running away from food like rice and beans and now he, like me, runs towards comfort food like this.  Everything was delicious! (Yes, I had food from everyone's plate)  Our table looked like it would feed 10 people, but there were only 5 of us and we left nary a bone!\n\nYou must go to La Caye immediately.  Robert knows his food and this place was a hit!", "author": "Rochelle H."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}