{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-14", "description": "I love Haitian food but the service here is the worst. I eat out alot. Just terrible. I got my sides like 40 mins before my steak. I ordered drinks which never came. Eleven people in the restaurant  . Yes that's right eleven people. We are a party of 8. Everyone had like 1 drink. That's the 1st for us we normally go in but the service is just bad. Smh u order and order still nothing smh.", "author": "Love 4 Food .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-11", "description": "Very good. Griot et banan peze very good and service welcoming. If only finding parking spot was as enjoyable. But will be back for more.", "author": "Gardy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-20", "description": "I am definitely coming back to La Caye. The poisson rouge was heavenly. I loved the black mushroom rice so much, i ordered another serving. The fried green plantains and pikliz ( haitian pickled cabbage) was worth the wait. I'm salivating while typing. Time for another round of La Caye!", "author": "Pout C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "I have been to this restaurant 2x .\nI have to say the service was amazing and the staff was very friendly.\nThe food is excellent. The first time I went was for a Bday brunch for one of my girlfriends and the food and service was amazing that I decided to go again on my own again. I look forward to sunday jazz brunch in the summer time.", "author": "Dee M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "Homemade good food! Delicious and simple! Can be a little spice! Try the red snapper and the amazing aubergine legumes!", "author": "Ronnie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "LOVE IT ...modern / fabulous / great food excellent service ....", "author": "Farah B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-28", "description": "This is the first Haitian restaurant I've ever tried and it was good.  The place is very cozy and warm and they have a good wine selection.  I only got to try a vegetarian fritters type starter dish and it was great.  The dish had just the right amount of intense spice that I love.  It get's busy right after events at the BAM so expect a wait.", "author": "Minto S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-06", "description": "Could be better. I came in here to have a late lunch while the place was fairly empty. \n\nTo start off, it took at least 10 minutes for anyone to even realize we were seated before they came over to us and offered water. It wasn't a big deal, except no one else was there, and they later forgot to bring out part of our food...\n\nI ordered the caye salad (goat cheese, beets, eggplant) with a side of the black mushroom rice and my hubby ordered the snapper with the Mac and cheese au gratin. \n\nIt all took a while to come out (again, empty restaurant), and it wasn't all that impressive. The salad, which I expected to be pretty good since it was labeled the signature salad, was really not great. It had two tiny goat cheese balls a couple slices of beets and two slices of eggplant on top of a bunch of indelible greens. The dressing was ok. The mushroom rice was delicious, it went well with the snapper's creole sauce. However, the Mac and cheese au gratin didn't come out until we were almost done with our food and I asked where it was. The waitress ran to the back and brought out a tiny ramekin of cold mac and cheese which was mediocre at best. \n\nThe decor is nice, I think there's a garden out back too, but this place definitely needs some improvement as far as staff and food. I believe they only opened 8 months ago, but with all the other solid options in the area, it may take quite a bit of convincing before I return.", "author": "Pooja J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-03", "description": "The dishes were mediocre. It's unfortunate because Haitian food wen done well is so good.  Nothing was bad, but nothing was inspiring either.", "author": "David M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-14", "description": "Saw this place while I was driving by the BAM. Seemed liked a good place to get Haitian food from. The atmosphere is nice, modern with an old school feel to it. The food and drinks were good for the most part. But the Kreyol wings appetizers were under cooked (still bloody) and the griot was way to spicy.", "author": "Ferry O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-03", "description": "I'm Haitian-American and let me say i'm vey disappointed in this place. I only came here because Kombit was closed and decided maybe it was a sign to try a different Haitian Restaurant. I will not be coming back here, though. Their ambiance is better than Kombit's, but it's much more cramped in La Caye unless you go outside. The food was mediocre, drink menu was limited, and this place is too expensive considering the quality of food. How can you be called La Caye and don't even serve Cola Lacaye as a beverage?! Smh. I had the Pork Fritaye, which was ok at the most. I've had better at home. Don't get the Creole Wings if you're a wings lover. It's basically fried chicken with some weird mango sauce on the side.", "author": "Shenel M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-16", "description": "It's really a 3 1/2.  Loved this cute little trendy Haitian restaurant!  I'm Haitian American and I get a real joy from seeing Haitian restaurant that are on the trendy side.  It was a bit small but the seating was design well so we didn't feel like we were on top of the other tables.  Loved loved LOVED the live jazz band that was playing...made me feel like I was on a real Caribbean island.  \n\nNow let's talk food:  \n\nGreat flavor...they stayed true to the Haitian culture with the menu items and seasonings.  The portions were extremely small...they should know better too lol.  Caribbeans love to eat and serving braised baby snapper as a full entre is not ok.  the fish was so small I ended up ordering a big mac after dinner.  UGH!  So disappointing...\n\nThe drinks were ok.  Wasn't too crazy about their sangria and I'm a sangria queen...all in all, I would go back but I would probably order more food for the table knowing how small the portions are.  \n\nOh...and there's only 1 bathroom for the entire restaurant...That being said, use the bathroom before you dine here.  Otherwise you'll be waiting in a long line to use their bathroom.\n\nA hit in my book...", "author": "Raquel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-10", "description": "Came here for a private party last night, so it wasn't a normal dining experience. They gave us a complimentary sangria (yumz) and did a couple of rounds of passed appetizers: haitian style meatballs (delicious), fried plaintains (best with their tasty, mellow picklese), and marinated cod on bread (as good as my mother-in-law's). \n\nAfter appetizers, we had a choice of salads (rara or house) and mains (red snapper or chicken, both in sauce and served with rice). The rara was light and cool- very refreshing on a humid summer evening, and the chicken was perfectly cooked (crisp skin and juicy meat) with a killer creole sauce. Had a taste of the snapper too and the meat on it was tender and very flavorful.\n\nAll in all, it was a great experience. The staff was super friendly and very accommodating for our gigantor party. Their back garden is beautiful, and, because it's next door to a small triangle park, the view will be mostly tree-filled in perpetuity. We were a smidge disappointed that there were no beans to be had (neither red bean sauce nor mixed rice\u0026beans), but mayhap that was because of the large party/set menu thing. Other than the beanlessness, the food was spot on.", "author": "Daniel D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-07", "description": "Never again. The food was flat out horrible. The soup joumou has no meat. When I asked why, they said its to accommodate the people in the neighborhood who don't eat meat. Mind you this is what makes soup joumou authentic..the meat. The soup had no flavors. But was told the Boullion has crabs in it. How about the people with shellfish allergies? I guess people with shellfish allergies don't matter. Lol.  Oh I forgot to mention they did not have boullion either.\n\n The steak and avocado was really steak and eggs with salad on the side and mashed up avocado and tomato with no salt, no pepper nothing. Basically incomplete guacamole. We spent 73 dollars and left hungry and disappointed.\n\nI expected more but got much worst than it could possibly be. I will not recommend this place to anyone looking for authentic Haitian food. This should be fusion food. If there was an option for No Stars I would give that. They don't deserve 1 star.\n\nTo that poor couple whom they forgot in the back and then told 1 hour later they could not serve, I'm so sorry.", "author": "Tam B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-10", "description": "I brought my cousins from Aruba here because they wanted to try an authentic Haitian restaurant. Now, mind you, I am not 100% Haitian, just Haitian by association (lol), but I do know and love my Haitian cuisine. I have to say, I was a bit disappointed. Although the food was good, it is just ridiculously overpriced for no reason. I definitely expected much more. The ambiance was so-so. I would have loved to hear more Haitian tunes playing to set the mood...I'm just saying. The service was also mediocre as our server never came to check on us after serving our meal. I would like to give La Caye another try but can get much better food at so many other restaurants in Brooklyn that won't hurt my pockets especially with a party of 2+.", "author": "Nicole J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-15", "description": "If I could give this place a zero I seriously would. I ordered a Fritaille platter which includes of tassot (fried goat meat) marinades, fried plantain, and acra to go. When I got home the food was tasteless, the marinades taste like wheat and water, the meat had no seasoning and did not taste like goat. The simplest thing to make is the fried plantain and that was tasteless as well. My parents are Haitians and so am I and the food that LaCaye serve is not true Haitian food. The food was downplayed and the restaurant deserve only 2 stars max. Food is crap, I seriously wasted $22.47 on a plate of food that went directly in the garbage.  Don't go there trust me on that one.", "author": "Essie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-23", "description": "We ordered the Poulet en Sauce (Creole Chicken) and chose black mushroom rice as the side.  My friend ordered the Pan Seared Pork Chop.  WOW!   My husband LOVED the pork, as well as the chicken (but by far the pork was his favorite).  I thought both were good, but I guess not really my favorites.  However, we will be back next time we're in Brooklyn for some more pork for my husband!   \n\nService is VERY good and the restaurant itself is lovely!", "author": "Sonya S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-05", "description": "Not bad. Nice athmosphere, Friendly and courteous services. Food ok. Prices decent.", "author": "Patrick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-20", "description": "This is fine dining, Haitian style. A taste sensation without peer in Fort Greene, the land of dining opportunity. In some shaman magical way, this restaurant has managed set itself distinctly apart from all the others in the area. It is not inexpensive but it is worth every dime. The decor is classy and lovely, the service is friendly and the food is consistently fresh, interesting, delicious and enough to satisfy. When it is cool, enjoy the beautiful garden. Also, everyone you encounter genuinely cares about whether you have a great dinner and a lovely time. This is very rare indeed. Eat here and feel like royalty. Related royalty! Or treasured guest, if you prefer. Every time. Thank you, Ralph G! You rock.", "author": "Leah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-09", "description": "Ive been here a couple of times in the past and decided to attend their live jazz show tonight. I am definitely glad I did, chef couldve done a better job but the music was at its best! Will be coming back!", "author": "Laura H."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}