{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-11", "description": "Made reservations for my mothers birthday and there was absolutely no food left. The waitress took forever to bring a menu and had no interest in serving us. She explained that there was a big party and no more food left, only chicken and fish. HORRIBLE EXPERIENCE.", "author": "Dwenne S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "We decided to dine hear to celebrate my husband. I chose the place due to my desire for good ethnic food (Haitian).  \n\nI called ahead to make reservations, however was told I could walk in on a Sunday evening without making prior reservations. \n\nUpon arrival, we walked in a were given the option to dine indoors or on an outdoor patio. \nWe sat down and ordered matching passion fruit mojitos. \n\nThe waiter was very inattentive. No water was brought to the table. \n\nWhen he finally got around to us despite an empty restaurant, he took our orders\n\nShe: a medley of rasa salad, akra and diri Dijon Dijon \nHim: medium well ny flank steak, potatoes as a side. \n\nFood was great. A bit overpriced. Service inattentive, unprofessional", "author": "Grenada R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "I LOVED BRUNCH! Can you tell how excited I am to write this review? I highly recommend the Chicken and Pen Patat Waffles (two golden fried chicken pieces on our very own Pen Patat waffles) for $18, which also comes with mimosa or bellini. My preference was the mimosa. The entire meal was so scrumptious, flavorful, and melts in your mouth.  DELICIOUS! Customer service was great. I love supporting this establishment and exploring the incredible meals of my culture. #TeamHaiti", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-26", "description": "I had dinner here with my girlfriends post ballet at BAM, and really enjoyed my experience here. The place was cozy, service was great and I loved everything I ate. We ordered one of the reasonably priced bottle of wine and started off with the chicken wings (super juicy) and conch which was delicious. I got the seafood creole with black mushroom rice and it was great! The lobster tail was huge, and the crab was meaty as well and the flavor was perfect. My friends ordered the snapper and that was delicious as well. I can't wait to come back.", "author": "Jo K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-01", "description": "I still really like this place. It's really cozy and just feels a bit more upscale and trendy than any other Haitian restaurants I know of. But after having the food a few times, I feel I can be a bit more critical. The mac \u0026 cheese is kind of flavorless and a bit too greasy. The rice is also a little bland. And worst of all, they never seem to have pain patat. I've been to La Caye a total of six times and only once were they not \"sold out\".\n\nI'll still come here, I'm just a lot less excited about it.", "author": "Jillian O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-18", "description": "I ate at La Caye last Friday night and we were quite disappointed. The food might have been hot and spicey but not flavorful. The black rice was unevenly cooked or maybe they gave me the bottom of the pot. The Lambi was good but the red snapper was totally bland. To top it off the service was poor and the waitress seemed overwhelmed. It's a shame that they give such small portions for the prices they charge, which is unlike the Haitian tradition. I won't be going back. \n\nI'll head over to Flatbush where they cater to real Haitian palettes.", "author": "Linda D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-16", "description": "Let me begin by saying that I am likely to give La Caye another try at another time. However, when I wait 30 minutes for grilled conch and they come out almost cold and tasting like chicken. That is a problem. I grew up eating fresh mango and guava straight from my grandmother's trees so please do not try to tell me that that mixture served with my conchs was mango/guava vinaigrette. The taste would just not go away. The salt fish was lacking flavor besides being salty. This was my first Haitian sit down restaurant and it was not good. \nI know there are those who say this restaurant is great and one day I would like to taste that greatness but on a Saturday evening, it was not. After the appetizers my husband and I could not bare to spend another dime here. \nHopefully, if I make it back a second time, it will be the gem all others speak of.", "author": "Madelene J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "This restaurant has been on my to go list for a while now. Having visited Haiti this year, I was in the mood to fin a pleasant sit in restaurant to have a date night with my beau. La Caye was perfect. The menu had just enough variety of starters and main dish, the drinks were on my point, the atmosphere outdoors was pleasant, and our waitress was immaculately amazing! Loved every aspect of my experience and happy I didn't deter because of the negativity on here. We will definitely be back!", "author": "Chanice N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-11", "description": "I'm definitely a fan of this place--and I am harsh when it comes to my Haitian food! (cuz I can be haha). But seriously, it always tastes like being out in a fancy restaurant back home. \n\nI think their wait staff isn't always equipped to handle a busy crowd, and the kitchen can be a  bit slow but that won't stop me from going back. Love it!", "author": "Garynn N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-09", "description": "Uhhh. First when I came in the host greeted me but took too long to seat me.  She wanted to greet the rest of the people after me before she sat me and my  homegirl down at a table.  Then we order fritaille which was horrible. The only thing that was good was the marinade. The tassot was hard and no taste , the gryo the same.  Plantains was ok but the picklies was also horrible. It was not spicy at all. We also had the mac and cheese au gratin. It was alright.  Their drinks is not appealing. The sangria wasnt all that.  I wont be back, and I'm haitain so i know whats good. They wont see me again.", "author": "Dorothy V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-06", "description": "Loved the food and the owner Ralph is quite engaging. The lanbi, and the sliders are my favorite. The food came in a reasonable amount of time. This is my favorite Haitian restaurant.", "author": "Lucie-Anne V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-28", "description": "My Friend and I dined at La Caye on a Thursday evening. We sat at the bar and opted for the shared pork dish. I loved everything! My Friend who was born and raised in Haiti thought the food was just OK. \n It was pretty late in the evening, which may have contributed to the Bartender's salty attitude. She was very kind to the regulars who walked in, so it wasn't a matter of a typical restaurant rough night. \n\nShe was very cold to my Friend and I. I felt like I was being served by a girl from High School who hated me for. She took a long while to refill our water -- we didn't even care to order dranksss from her. \n\nIt was an OK experience, but the search for good Haitian food AND good hospitality continues.", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "Really wonderful meal at La Caye after a show at BAM. It's pretty perfect for either before or after, as it's right across the street from the BAM Opera house, but was definitely jam packed before the show. The hostess will tell you \"there's no room!\" We went in right after at about 9:15 there weren't many people, but it did quickly fill up.\n\nWe opted for a meal of appetizers- the creole wings were fantastic. They're fairly dry, served with a savory dipping sauce that I'd easily eat alone on anything. The chicken empanadas were also pretty memorable and I'd happily have those again. The cod sliders were a bit underwhelming. And the macaroni gratin was delicious, ooey-gooey and super heavy. \n\nDrinks are beer, wine and wine cocktails. They have some fairy inventive sangrias, but they only had the rose and basil sangrias that night. I opted for basil (red wine muddled with basil and fruits).. wasn't my favorite but I'd give the other options a try another night.\n\nThe service was a tad slow- it took nearly an hour for our appetizers to come out. However, given the ambiance, quality of the food and location, I'll likely definitely go back and recommend it for anyone looking for a bit of something different while catching some culture at BAM.", "author": "Rajani M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "I will love to give 5 stars because when a friend and myself walked into the establishment, I was knocked out by a weird smell. The establishment smelled like a messy bathroom and it wasn't pleasant at all. Also, the chairs at the bar seemed to be very dated and noticed one chair broken.  But I still chose to stay and ordered the Creole Wings with French fries and a drink. Overall, the Creole wings were absolutely delicious and the French fries were very crispy and well seasoned the way I like my fries. I've also noticed there isn't a fully stocked bar and they are limited to any drinks. The service was pleasant, nice music, and great atmosphere minus the unpleasant smell. I will return for brunch ! Thank you for the hospitality", "author": "JJ M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-04", "description": "This is a great place.  We ordered the fired Griyo platter along with the macaroni au gratin, it was a good amount of food. Like they say on the menu, enough for 2 people. The food was on point, the bathroom is immaculate and the service is solid.\n\nI was a little dissapointed in the wine selection, however the service and the atomsphere makes up for it. \n\nMy only suggestion is to bring everyone's food out at the same time. No one likes to look at their food and wait why it gets cold.", "author": "Peter F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-24", "description": "ordered to go on a Monday night after class. Thought I'd try this place. Biggest mistake. Ordered the lambi appetizer since they were we'll  known. Also got the beet salad, red snapper and black rice and a side of macaroni. The portion size was a joke. Brooklyn is filled with authentic Haitian restaurants that give you a nice portion. This is not authentic Haitian. The food was ready within 5min which made me suspicious. Grilled lambi appetizer was hard, the portion size for the black rice was very small, the red snapper was okay compared to the rest of the meal, and the macaroni was not your typical Haitian macaroni which was a disappointment. Bill came out to almost $70. I can go to somewhere authentic and get a big portion plate for $12. Didn't fill me up and i didn't even taste the beet salad cause it was such a small portion and did not seem fresh.", "author": "Marly T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-30", "description": "I'm pretty comfortable with my two star rating, which is kind of shame. I wanted to like this place, maybe love it, I really did. We came with a reservation, which is key for a Saturday night, and were seated within a few minutes of our arrival. Right off the bat but depending where you sit, you feel like this place is trying to fit more people than there is space. Our table of four was sandwiched by a large party and against a wall. To get up, we had to coordinate with the other table's guests and vice versa.\n\nOur server was forgetful. I am certainly forgiving of a small thing here and there, especially when it's busy, but she forgot to put in our appetizer order (we realized when two tables seated and ordered after us got theirs) and our dessert order. The annoying part was when we asked another server on the status of our dessert, she told the kitchen to rush it (which was nice of her). But then our server came out with our items, went to the computer first to put in the order she forgot to previously ring up before delivering the already delayed desserts to us. I guess she didn't want to forget again, but it felt pretty ridiculous. Could you not drop it off then go back to the register? None of this would've been that big of a deal BUT the food wasn't that great either.\n\nThree of us ordered the Poulet en Sauce and one person the Seafood Creole. I just was not impressed with the chicken. It was not overly flavorful or anything special. I could've made a more delicious dish at home with my limited spice collection. The black mushroom rice was ok. The pickliz was really nothing to write home about. It should have way more kick and flavor to it. It added nothing to our meals. The Seafood Creole looked like a killer amount of quality food. I really think that might be the way to go--Snow Crab Legs, Lobster Tail and Tiger Shrimp--but I did not try it personally. Portions for the chicken were satisfactory, but the Akra appetizer not so much. I think overall value is decent. Last and definitely least, was the pineapple upside down cake. Besides the delay in delivery, the cake was dry and tasteless. Another disappointment.\n\nI may consider trying this place again, but with the myriad of other Haitian choices, I'm really not in a hurry to return.", "author": "Devashis R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-24", "description": "I love going to this place! It's about as close to the real Haitian food as it gets. The service is attentive and friendly! The food isn't a 10 (only because I think it could use more spice), but it's a solid 8 and it's a great introduction to Haitian cuisine. \n\nThe atmosphere is laidback and there's always some good Haitian music playing. Only thing is, right next door, they have a restaurant that plays very loud music so that can interfere with the conversation if you sit outside. Other than that, it's been my go to Haitian spot in Brooklyn.", "author": "Shelcy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-15", "description": "It has been a little while since I had some great Haitian food and 'mezanmi'! La Caye did not fail to deliver. I walked in to a dimly lit space that was super cozy. There was of course Konpa playing-- one of my favorites in fact. I was happy. To drink I had my standard Cranberry Club Soda and soon decided to bypass the appetizers and go straight for the entree. I had fritay, which consists of fried beef and goat (griyot) as well as plantains, and akkra-- all complimented with a healthy dose of pickleys(spiced cabbage). Me being the carb lover that I am also decided to order a side of du ris jonjon (black mushroom rice). I consider myself an honorary Haitian so to say that this meal lived up to my expectations is an understatement. Love, love loved it. And my waitress, Alona, was super attentive as well making the total experience absolutely worth it. As always-- Happy Eating. Marie-Madeleine.", "author": "Marie-Madeleine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "Food amazing and beautifully presented.\n\nThe service was on point - friendly, consistent and accommodating.\n\nI will be taking everyone I know here! \n\nBest dishes: Black rice, creole chicken, Fritay, the sliders.", "author": "Sabrielle L."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}