{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-24", "description": "Parking is horrible. The place is really nice and the food is ok. It took over 45 minutes for our food to come out but it was worth the wait.", "author": "Elizabeth H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-17", "description": "The worst meal I've had in NYC. \n\nI went here for Valentine's Day dinner, and it was a terrible experience from start to finish.  They offered a $65 per person 3 course prix fixe menu for Valentines Day. It seemed like a great idea, and a romantic place to spend the evening, but it turns out that the restaurant ownership saw the \"holiday\" as a great opportunity to rip off customers.\n\nEven though they charge more for each food item via the $65 prefix, they actually gave you less food.  For my main entree, I ordered the seafood Creole with the black mushroom rice. I've seen pictures of the dish on Yelp, and was really excited to try it for dinner. What I received was nothing like the pictures on Yelp or on their website. What I received was a few shriveled up pieces seafood that were overly mushy from sitting too long in whatever liquid they were prepared in. The rice was dry, crunchy, and flavorless, and  all of the food was very cold. My boyfriend ordered the steak with macaroni and cheese, and was also very disappointed with his meal. The steak was mostly fat and was very rubbery, and was also completely drenched in a bland peppercorn sauce. The macaroni and cheese was cold, dry and hard like it have been sitting all day. Entirely disappointing.\n\nWhen I complained to the waitress about the size of my entree, genuinely wondering if they had run out of seafood or something, she explained to me that the dish had been modified for their prefix menu. It did not make sense to me given that the entree itself on the regular menu is only $29, and yet with the $65 prefix menu  they cut the size of the dish in half without giving you anything else really to account for the extra $35.00 in price. Shady. Very shady.\n\nLastly, they were very shady with the bill. After dinner for two, with one glass of wine and one beer we received a bill for $183. We were very confused with such a high bill given that dinner that night was $65 per person. After they ran our card, we were given back receipts to sign but we're not given an itemized bill. After asking the waitress why the total was so high, she finally returned and gave us a receipt which showed that they included 18 percent gratuity. This was not reflected on the initial bill that we were given, nor was it reflected on the copies that we were asked to sign, and there was a space left for gratuity. There was no mention that gratuity had already been included. Veeeeeery  shady the way they tried to slide this past customers. I'm sure they got over on a lot of people that night. \n\nNearly $200 later, we left hungry, disappointed and literally feeling like we had been ripped off. I wanted to like this place so badly, I am an ardent supporter of black owned businesses, \u0026 I will never ever ever come here again, nor will I recommend this place to anyone. They may have made money for the night, but I'm sure they lost a lot of return customers that evening. Shame on you, La Caye.", "author": "Jazmine S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-25", "description": "I am split on La Caye. The restaurant is a small, intimate, and is a good date spot. \n\nthe bar is beer/wine. no hard alcohol (big minus). When they do offer specialty cocktails, avoid them. the cocktails are up-charged (big minus) and not mixed right...too sweet or too strong. the wine list is fairly good, and there are good choices on a per glass basis. the staff here is fairly knowledgeable on wines. \n\nhad the prix fixe here in February: squash soup was good. my partner in crime's salad was tasty. grilled conche and crab cakes were both good. the seafood creole was pretty thin in terms of portion size. the steak paysanne was very fatty. black mushroom rice was thumbs up. didn't have the mac n cheez (aka the macaroni au gratin) did look gloppy (from my looking at a neighbor's table). \n\npass on the red velvet cake (not moist or all that good). the pain patate was delish, though a bit filling for me. \n\nservice is friendly and knowledgeable. i do think there are misfires between the runners and waiters which results on slow service or difficulty in flagging them down. so entrees would come out without a sauce or side which happened to us. no biggie as the staff fixed it as soon as we could flag them down. taking one star off for this. \n\nother star is off because La Caye uses non-itemized bills when charging for prix fixe. i do believe this is on purpose because they are trying to hide an automatic 18% gratuity charge on the bill. the other problem i have with this type of behavior is that they give you the total with no itemization and then have a line open for gratuity, which means customers could double tip servers. \n\ni'd recommend La Caye for a casual dinner, but they need to go quite a bit further to turn a corner from an average restaurant to a very good one.", "author": "Ruwan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-26", "description": "Dare I use hip and Haitian in the same sentence... huh??? ...You can at La Caye. \n\nCute lil' spot across from BAM. The food is decent. This is no neighborhood spot, so you're not going to get enough to feed a horse... it's bougie/trendy Haitian (yes, it exists) aka... portions are small compared to what you're gonna get on the block. I've had griot, tassot, diri jon jon and all were solid. Yo, but the snapper may have been the best I've ever... it was seriously delicious. (although that was like a year and change ago... haven't had it since)\n\nThis is a cute little, intimate spot and I've always had great service here.\n\nAnyway, don't come with the expectations you have when you eat on the block or at grandma's... this is a completely different package... come here for what it is and you'll be happy.\n\nFYI... they only have a beer and wine license here.", "author": "Sockboy_philly .."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-21", "description": "I was looking forward to giving this restaurant atleast 4 stars but 2 will just do. The macaroni and cheese was just bland.The stew goat was well seasoned .we also had the sliders which was very greasy. So yeah I may give it another shot because people say they serve good food but as for now it's only getting 2 stars.", "author": "Le L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-26", "description": "I came in for brunch and not only was there a pending grade but it was closed. Hard to find parking. I am so disappointed especially since others gave it a OK review. Also on the website it states they serve brunch on the weekends from 12-3pm...... I guess they need to definitely update the site.", "author": "Cynthia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-08", "description": "I love this restaurant, the food us great and authentically haitian!", "author": "Imani F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-31", "description": "Boy, that was some fancy Haitian food. I guessed it fit the price as well. It also had a relaxed ambience to the place. And, some good oh oh music as well. LoL I can see how the wait can be irritating for other. But, if they want their food to be made fast. They could go to place like , McDonald's instead. They serve food fast there LoL", "author": "Millk T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-13", "description": "All in all, pretty good. I don't think I've ever had \"Haitian cuisine\" up until this point. Many of things on the menu I was unsure of. I found this place because it was across the street from the venue where I bought tickets for a concert. \n\nI ended up ordering the cod fish spread with French bread as an appetizer. I ordered the seafood creole as an entree. Both were pretty good. The only thing was the lobster was quite tuff in the seafood creole. As a side it came with a macaroni gratin..it was the bomb! The best part was there is seating outside and it was gorgeous out! The service that day was quite slow, but the servers are all very pleasant.", "author": "John D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-04", "description": "In short: A gem and happy to be here again...great food, ambiance, and service with a smile...makes for a good date...no matter your company lol!  (men good choice esp if dating a Haitian woman...sak pase!)", "author": "Jeralyn P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-22", "description": "First experience at a Haitan restaurant. Love the vibe of the place..came here with our Haitan friend and she ordered the Akra, black rice and pork. Sooo good!!!", "author": "Psalm D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-21", "description": "I have had one of the most fabulous experiences last night at La Caye. \" la Caye\" Haitian Creole word meaning \" home \" and that is exactly what it felt like. Very homey feel and welcoming staff. The live music was lush and rich with Rara-esque sounds and I got a chance to chat with the band. The vibe was so chill. I think I've spent so much time talking about the ambiance that I haven't even started on the food!\n\nSo, I ordered the macaroni au gratin, fritaille griot, and pain patate. Also, the PEACH SANGRIA! So rich in flavor and it was authentic Haitian food! If you're curious about Such cuisine, music, and art? This would be the place to start. It's legit! I repeat the food is amazing. Cannot wait to come back! I'm super impressed!", "author": "Ann B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-23", "description": "Great customer service for the most part. BUT I made a reservation and kind of had a table just put together for us. It was for four and they put the two tables in the front and people had to squeeze to get through, we were seated awkwardly facing the street..it wasn't too too bad it was just weird and right by the door. The hostess Darling was really great and helped us get situated. \n\nThe food--it was actually pretty good. We had to wait an HOUR and some change for it though. That was an annoying part of the experience. But it was great for the most part. I personally didn't like the legume too much but everyone else loved it. The akra, griot, taso were all good. \n\nOverall I'd go back and give it another try, with a smaller group. It was very busy so maybe that was part of the reason for the long wait.", "author": "Natalie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-08", "description": "Overall, dining at La Caye is always a fine experience. \n\nI've enjoyed my visits for dinner \u0026 brunch on several  occasions, including intimate \u0026 casual dinners, business meetings, as well as family birthday celebration dinner; La Caye is good for groups, especially with its outdoor seating area.  On one occasion with my Haitian mother, who generally doesn't eat other people's food, a finicky critique she appreciated the authenticity of ingredients in the more classic fishes, such as Poulet en Sauce \u0026  Poisson Rose (both must haves). \n\nFor brunch, the Mayi Moulen ak Arans is a must have, as its authentic like matanté makes it.\n\nThe location is great, service is timely, ambience is adaptable. One negative, La Caye doesn't have a liquor license or doesn't sell cocktails, though limited wines are available.", "author": "Gm E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-01", "description": "Bad customer service, waiter was inattentive and took a while to take our order. I'm Haitian and it's sad to say that every Haitian restaurant I go to it's the same terrible service. Come on, we gotta do better if we want our businesses to succeed. I left a 18% tip just as a courtesy but honestly that service deserved 0 dollars. Also the food is super expensive a appetizer and 2 meals for 70 bucks and the food wasn't that great. The inside of my chicken was pink and my friend ordered a medium well steak they gave him medium raw instead, h e was basically chewing on raw meat. The steak did not break at all it was practically inedible. Also, my \"ice cold\" was amazing for my friend but mine was basically tea cause it was so warm. Horrible experience for my friends birthday dinner. Lastly, the live music was so loud I couldn't even hear the waiter ask me questions while I was ordering, I practically had to scream. Next time I'll treat him to a way better restaurant!", "author": "Soraya G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-18", "description": "I love this place. Their food is really good! This is my 3rd time here ! So far my fav on the menu is the rara salad, black rice, fritay, and the mac \u0026 cheese!! I thought the lumbi was a little salty but yet again I'm not a big salt eater because I'm watching my blood pressure. Other wise everything here is great.", "author": "Ruthy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-17", "description": "Loved loved loved the food, decor, and ambiance. Got the tilapia, and it was spectacular. I've had homemade Haitian food before so this place does a really good job of trying to represent that. Drinks were also really good. Staff were friendly. Great place for a date. All-round, loved it.", "author": "Kovie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-21", "description": "Food is amazing although they didn't carry everything on menu expected on a slow Tuesday. Even service was superb.", "author": "Esther L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-06", "description": "Had a great meal at La Caye on Saturday before a show right across the street at BAM. I had the Kabrit La Caye, a wonderful stewed goat, with a terrific side of Macaroni au Gratin. My cousin had the Conch and enjoyed it immensely as well. Would definitely eat here again.", "author": "Hal S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-28", "description": "I pride myself in being a decent enough sibling, so when my brother showed up in town randomly with an offer of dinner, I was game and thought I totally deserved it. He then said we should meet at La Caye and quite honestly, I became a bit hesitant, but alas little brother came through. Unfortunately true to form, my brother was late. \n\nImmediately upon entering, a few men offered me a seat at the bar as they watched Haiti win in a soccer game (no idea if the final score reflected this). The bartender was friendly and also welcomed me immediately. Luckily my brother soon showed up. \n\nOnce seated, we struggled to select our meal, so we needed a bit of time. We finally ordered the chicken and fish options. \n\nSummary: the food was good, not great. The prices were decent- a bill of $143 for 3 people including a bottle of wine and 2 cocktails. The service was friendly, but sometimes felt rushed unnecessarily, since there were no people waiting for the tables. I'd probably go back- it's right across from BAM and not a bad restaurant.", "author": "Nyota W."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}