{"aggregateRating": {"reviewCount": 347, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "I have been coming here for years. I am Haitian and I love this place. The food is pretty good and authentic. I think the prices are over priced but I'm sure that's due to the location. My favorite is the Fritay platters. I usually get the fried pork with akra (seasoned grated root veggie called malanga that's deep fried), fried plantains with a side of pikliz. I've had the rice here and it tastes just like my mom makes it. I think the flavors here are consistent and authentic. I love this place for its Caribbean fare and good Haitian music playing at all times. It's a nice taste of Haiti right in the heart of fort Greene.", "author": "Djerica L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-23", "description": "First time I went with two friends one of whom recommended the spot. I must say I enjoyed everything. From the food to the ambience to the waitress. I want to come back so we can try the goat and sweet plantains which unfortunately they didn't have that day . But the macaroni and cheese was AMAZING so was the black rice and the griot (fried pork). I love Haitian food so much so I was happy with everything.  definitely recommend this spot.", "author": "Lelosa I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "This was my second time at this restaurant. And I have to say it was better than the first time. I had the steak with spinach and cream sauce with the black rice... the was the best meal I've had at a restaurant in months... So on a scale of 1-5 ... La carte gets", "author": "Keith T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-29", "description": "If you are a party of six or more expect service to be extremely slow and waiting for your order for over an hour. Maybe it has something to do with an automatic 20% gratuity that is tacked on despite you liking their service or not. The tilapia is very bland. Best thing on the menu is the macaroni au gratin.  The conch is undercooked and way too chewy. Overall no one should have to wait that long for their order especially if its a slow night. The establishment needs to work on making everyone feel like they are actually LA CAYE (at home). Won't ever be returning to this establishment or will ever recommend anyone to go there.", "author": "Pearly S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-09", "description": "I've frequented La Caye since the restaurant opened a few years ago. I am Haitian and support Haitian-owned establishments. The food here is sub par, but the ambiance is intimate and relaxing.\nLast night, my home girl and I decided to hit up the bar on a quiet night. We only wanted drinks as well had dinner elsewhere near by (hated that place). The restaurant was pretty empty with the exception of the bar. Patrons drinking wine, reading their books, chilling. Sat at a table, the waitress gave us water, menus, and quickly left without making eye contact or even welcoming us! \nWe moved to the bar once seats because available. Still, not acknowledgement from the staff. The bartender / waitress must be shy, but her nonverbal communication was rude! Maybe it wasn't her night.\nIn spite of the unfriendly service, our fruit sangrias were really good and half off! I enjoyed the Kompas music in the background and the intimacy this place offers. \nI will return for dinner / brunch soon as I have not actually dined here in about 2 years. I want to see if the food got any better.", "author": "Mitch. J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-13", "description": "The restaurant itself was quite nice and the service was absolutely on point. However, I thought it was a bit too pricey for what I got. I had ordered the legim berejenn, which was tasty, but I thought the portion was a bit small for a rather pricey entree. \n\nOther than the price point, the proximity to both the BAM Rose and BAM Harvey theatres does make this place a slightly more convenient location. During the week, they also have a happy hour deal, which offers some of their assorted sangrias at a discounted rate. I'd at least come back here just for that.", "author": "Cinthia K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-14", "description": "I usually dine in and out of this restaurant and the food is very delicious. But today I ordered about $80 worth of food and was highly disappointed. I ordered the griot Fritay along with other items. But let's talk about the Griot Fritay specifically On their website it says it feeds 2 people. When I got home and opened up the order there was literally 6 pieces of griot in there for $22. I honestly could go to a fritay place or another restaurant and get a mountain of griot for that same price. The amount of food I got for the amount of money I paid is sooo not worth it. I'm sorry La Caye I love your food but you have to do better with the food portions.", "author": "Gianne J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-10", "description": "I do love this restaurant and I visit there every time I'm back home in New York.  If you want good Haitian food, really there are TONS of options in NY.  La Caye is in a sea of good Caribbean food, but it is worth the trip.  Just don't order any of the Americanized dishes like those with french fries or something.", "author": "Regi P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "My only complaint is that they are a bit slow.If you're going to a show, my recommendation is that you come early and have a reservation.I went on a Saturday night and was going to BAM.We ordered two appetizers, fish cakes and conch.Both were good.The conch is something of a standout , it's not tough.I followed with a good roast chicken creole accompanied by root vegetables.Co diner had a root vegetable main course accompanied by black rice which worked better than you might expect.I had a few Prestige Beer's .Prestige is basically Heineken made in Haiti.No time for desert !The room is simple but nicely appointed and the service pleasant and accommodating.Prices are arguably a little high but it's New York.", "author": "John K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-06", "description": "Before relocating, I wanted to give this place a try since a friend recommended.  A few weeks ago my wife and I tried this place.  We weren't extremely hungry and just wanted a few things to munch on.  We other some greens, plantains and the mac and cheese.  We waited and waited and waited. A woman sat us and took our order than she disappeared behind the bar.  Only one guy is running around trying to serve all the guest.  After waiting over 30+ minutes for the food we finally got our greens and plantains...NO MAC AND CHEESE.  The same guy running around asked us if we also order the mac and cheese, we said yes...and after eating all our greens and plantains .... 20+ min later our mac and cheese made it to the window, i saw it sitting there and no one ever brought to use. At this time we were so annoyed and aggravated we asked for our check which they charged for the mac and cheese and we told the lady that we never got all of our food. She offered to wrap it up and put it in a to-go bag and still charge us....REALLY...we declined and paid our bill for what we consumed ONLY and left without tipping.  We will never return and never recommend.", "author": "Benjamin R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-06", "description": "New management!!! Food is terrible!!! I will never eat here again!! They shouldn't label this strictly Haitian food if it doesn't have Haitian taste!!!", "author": "Stephen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-25", "description": "Food was really good and the atmosphere was great. A real neighborhood feel. Service was pretty good though it was quite leisurely which was fine for us because we were busy talking and catching up but if you are in a hurry this might be a problem for you.", "author": "Luke J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "I loved everything. The black rice and macaroni was amazing !! The atmosphere was very chilled. I would recommend this place to anyone looking for great Haitian food", "author": "Malaika W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "The service, food, and atmosphere was very enjoyable. My date and I were running a little late, we had reservations and we received a courtesy call from the restaurant.The person was so pleasant and wanted us to know that parking was a bit difficult because of a nearby event. Upon our arrival we were seated immediately, our waitress was very friendly. We had the Sak Pase Passion mojito which was not too sweet or strong (it was just right!), the akra as appetizer (absolutely amazing), the butter pepper steak, chicken in creole sauce, macaroni au gratin, and plantains.  The cabbage that came with the akra and plantains was deliciously spicy, the sauces in our entrees were so flavorful. The macaroni was perfect. For dessert we had a Haitian pudding which was warm and light. Overall our food was very tasty, seasoned just right, the service was phenomenal, and the soft Kompa tunes in the background sealed the deal! What a great way to experience a taste of Haiti! I'd certainly recommend!", "author": "Y Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-23", "description": "I had my first Haitian food experience this last weekend with a few of my friends and it will not be my last Haitian food experience. Little backstory, I am a foodie extraordinaire, and I love experiencing different cuisines, music, and cultures. I always look forward to trying a new cuisine as it is the highest high for me and you only get to do it once! After that once, you never get that experience again.\n\n\nMy Haitian buddy poisoned my mind about Haitian food for years telling me how her dad made the most horrendous Maye Moulen in the universe! We would constantly discuss how.  Horrible the house smelled after she made it with fish on the weekends, Anyway, I was honestly not very excited, but willing to have Haitian food when she suggested it after hanging out at Coney Island that afternoon. \n\n\nWow, what an experience!  Nice decor, excellent visual presentation, and absolutely awesome food! Dinner at La Caye Haitian cuisine consisted of Boulette Codfish Sliders, Tilapia Gros Sel, Maye Moulen, Macaroni Au Gratin, Creole Wings, and Chiktay. The standouts were the Maye Moulen, Macaroni Au Gratin, Codfish Sliders, but everything was delicious. As I said earlier, the presentation of the food is excellent as well. It is nice to have the combination of presentation and quality.\n\n\nMy only issues and they are very minor issues by my own admission is that the food took a long time to come out, they forget an order of Mac and Cheese with no apology (three simple words, guys), and they were serving larger portions of tilapia, and instead of just doing it they were alerting patrons that the price was seven dollars more expensive which I thought was a little tacky to be honest. Otherwise, the food while a little on the pricey side is well worth the money in quality, taste, and presentation. I highly recommend this eating establishment and Haitian cuisine overall.", "author": "Ermelindo F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-08", "description": "The food was good but the goat in creole sauce had a little bit to much salt. I am use the drink prestige beer very cold but for some reason it wasn't as cold. This is the second time i went there and the beer was not cold enough", "author": "Johnny A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-23", "description": "A friend and I ate here after Dance Africa. You would think that since this event is annual for God knows how many years , that there would be ample staffing for the droves of people looking for a quick bite?? Nope. Though our waitresses were lovely , it took forever for our food to come and I must say it was quite mediocre. Not sure what happened ( I've eaten here at least four times before) maybe it was just a bad night or a new chef , but my friend and I had two different dishes and our food had the same bland sauce  . Needless to say my friend was unimpressed , I'm giving La Caye three stars off the strength of past experiences .", "author": "Selena J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-06", "description": "Had a solo dinner here on Thursday night. It was my first time at La Caye and I was anticipating an exciting experience after hearing so many good reviews.  As a Haitian American, who grew up eating Haitian food everyday, the food was just OK\n\nPROs\n- I was able to walk in with no waits.\n- The decorum is inviting, yet subtle.\n- The Sangria was delicious.\n- The pikliz (spicy pickled cabbage/carrots) is delicious and helped pop the flavors of the red snapper a bit. \n- The side of green plantains was fried perfectly, not too dry or oily. \n- The service was excellent.\n\nCONs\n-The black mushroom rice was a little bland and not as hearty as it typically can be. \n-The Red Snapper's sauce was also a bit bland considering it was garnished with peppers/onions.\n- Overall the food took a long time to be delivered. \n\nI'll quite possibly come here again to try their brunch and soups options.", "author": "Maureen S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-31", "description": "I've tried to give this place so many chances, but they haven't been able to redeem themselves. \n\nI went to La Caye with three other people this past Saturday. It was Dance Africa weekend at BAM, so I figured they must be super busy, but to our surprise it was not. We were promptly seated out back and we ordered right away. Well the fritay took over an hour, and for some reason our house salad took 90 minutes to come out. During the wait we weren't given water or silverware. Drinks also took a long time. They weren't even busy. The waiter seemed very defensive when we asked if our food would be ready anytime soon and then the cook, some white lady came out and pseudo-apologized saying the delay was due to their small kitchen. Again, I felt like she was upset with us for getting impatient. Our waiter was very rude and inattentive, like we were inconveniencing him. Staff are usually rude here, but this was the worst service ever. \n\nI've eaten here numerous times and every time I leave disappointed. I want to like this place so bad, but they make it so hard. The service has typically been rude. The wait for the food is exaggeratedly slow, which is an even bigger problem when you have a show to catch across the street. When they have live music (which in itself is great) in the front the place gets really crowded and uncomfortable. \n\nI'd be happy not visiting this place ever again. Quel dommage.", "author": "Stephanie F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-28", "description": "All of my friends have been telling me how great this restaurant is, so I had to come and check it out. \n\nThis past Sunday came here for dinner and it was not as expected at all. We waited forever to be serviced.  I went with a friend who has been here before and according to her the portions were way smaller than before. \n\nI ordered the creole wings for appetizer and it was really good. The issue came when my entree came out. I ordered the Legume Berigene ( forgive the spelling). accompanied with it was white rice. My rice was hard and not soft at all. \n\nI've gone to whole in a wall Haitian restaurants in both NY and NJ and the food was waaaay better than here, which is suppose to be an upscale Haitian restaurants.\n\nLong story short if you are used to eating good Haitian food this place is a major disappointment.", "author": "Natacha D."}], "servesCuisine": "Haitian", "priceRange": "$11-30", "name": "La Caye Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "35 Lafayette Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/XBPwQqe397ul9djNTzRkTg/ls.jpg", "@type": "Restaurant", "telephone": "+17188584160"}