{"aggregateRating": {"reviewCount": 8, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-30", "description": "I love the concept of dumboLUV!!  A true neighborhood gem -- a wine bar serves a farm to table dinner on Saturday nights only.  Seasonal ingredients are sourced on Friday and you can come in on Saturday, grab a bar table, and order of the seasonal menu.  The food is delicious, and it's such a fun, and sustainable!, way to spend an evening.\n\nPro-tip - the bar next door (68 Jay) have live music on Saturday nights, so head over there after you finish your food at drink at dumboLUV.", "author": "Lauren L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "It'd be difficult to guess that this tiny bar tucks away delightful culinary eats. Not only does the menu change every weekend, but the majority of the ingredients are seasonal and sourced at the local farmers market (forgive me, I forget which one at the moment). \n\nThe ambiance itself is sweet, transports you back some time with the brass finishings and the light scanzas, but it's all done in good taste. I especially enjoyed the vintage advertisements in the bathroom. The waitstaff were cool cucumbers, casual yet attentive enough. Since the menu only contains 5 tapas-portioned items, we ended up trying all of them.  \n\nEach dish was fresh, exciting and tasty. The butternut squash was naturally sweet and paired beautifully with its herb butter dressing. My partner enjoyed the broccoli rabe and sausage frittata, and I honestly loved them all. But of all the things that arrived at the table, the Poppyseed Cake stole the evening!! It was one of those cakes that made you sad there wasn't more. Seriously! It was a mini-rectangular loaf that came adorned with this amazing pineapple jelly. The dish made you surprisingly nostalgic for something you can't quite put your finger on. A perfect place for a unique, light dinner and then stroll out by Pebble Beach to admire the skyline across the way. \n\nWether you're dropping in for some liquid lubrication or are seeking something inspiring to pacific the palate, give 'em a try! \n\nPro tip: follow their Instagram for their weekly creations!", "author": "Kai Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-01", "description": "they don't care about their customers. I myself went to look for a waiter to ask for a menu. I did not wait for my order to be accepted. very unobtrusive service.", "author": "Eva P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "Amazing food- so far I've had their brownies, delicious rice paper salad wraps in homemade dressing, picnic chicken with potato salad, fresh strawberries with fresh cream, and more! \n\nThe creators were kind enough to take the time to educate me when I started asking a zillion questions. I learned a lot about where they find their local sources \u0026 how they choose their combinations for the day - really neat!! \n\nSeriously- can't beat the freshness. And the prices are  \n\nI ordered everything on the menu (I'm serious) and plan to every time.", "author": "Annalee H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "The food is SO good, and SO fresh! It feels like they made it just for you. Everyone who works there is really nice, personable, and chill. Would definitely recommend eating here!", "author": "Eliza S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Been here a few times on Saturdays, the pop-up chef Thom always has fresh local ingredients prepared into an assortment of surprising and fantastic plates. Tonight I had a mushroom tartine made with pear cider that I would have ordered thirds on if they hadn't run out. The bar is low key with a great wine selection and the bartender Bob is great. There's also good beer on draft, and the cocktail menu looks tasty and original though I haven't tried any.", "author": "Colin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-09", "description": "I love the idea of things being locally sourced, and recipes created based on what's in season.  Since the menu changes weekly, what you'll be getting will always be changing, but the quality, creativity, and deliciousness will always be there!  Smoked pork and lavender cake... I'm sold.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Rarely, do I ever write views but I felt it imperative to let the world know about this little gem. Legendary Chef Thomas Abbey manages to create a farmers market to table approach with his cuisine utilizing the wonderful dietary approach of localvorism in this establishment. The menu changes every week which makes every return trip equally as exciting as the last. A must try -- especially in these summer months.", "author": "Randy O."}], "servesCuisine": "American (New)", "priceRange": null, "name": "dumboLUV", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "54 Jay St\nOlympia Wine Bar", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/hHjc3vsbC8C6CMWhVzYcDw/ls.jpg", "@type": "Restaurant", "telephone": "+18044105393"}