{"aggregateRating": {"reviewCount": 46, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-22", "description": "Came for dinner the other night, service was fine, but the food was mediocre at best.\nHad the burger but quality is what you would get from any deli that serves food. Fries were not bad thou and the new decorated atmosphere is nice.", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-03", "description": "So happy Grand Canyon returned to Brooklyn Heights! The yummiest food. The friendliest staff. Awesome burgers and omletts. And now a focus also on Mexican food. \n\nSide note:\nLiterally the only thing I didn't love love love about the old Grand Canyon (R.I.P. 2015) was the small gross dirty bathroom. And now the new joint has a nice bathroom. Yay!", "author": "Jason O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "I've lived in Brooklyn my whole life, and a good 22 years of it were spent in Brooklyn Heights. I've eaten at every diner/eatery in the neighborhood but nothing compares to the amazing food at the new Grand Canyon Restaurant. The Mexican food section is a great addition as there aren't any real Mexican food joints nearby. It's authentic and the staff is super friendly. \n\nI ate twice there today. I had huevos rancheros with grilled chicken for breakfast. For lunch I had the chicken parm and my friend had the canyon burger. Everything was delicious. \n\n\nWishing them all the success. I will be back soon and with more of my friends.", "author": "Elaine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-25", "description": "This is my favorite place to eat some great food. The service is very fast and the food always hot and with a perfect taste, if i was you i would order homemade mexican food or some half pound hamburgers with fries, one of my favorite moments it was when i get my smoothie, OMG!!! you have to try it.", "author": "Ángel P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-06", "description": "Ordered the Cowboy burger with cheese. I was with a few other people eating in. Took a while for the food to come to us. When my burger came it was just a regular cheeseburger. I was expecting something more. So the cowboy burger is basically a regular burger (if you wanted cheese its cheeseburger) plus beans. Thats the difference. It was just ok but the beans were good. The other complaint was they kept playing that Titanic music over and over again since we got in... Celine Dion's My Heart Will Go On.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-28", "description": "Went to the original Grand Canyon Diner for years and was so bummed when they shuttered. Super happy to see that they've reopened next door to the old place. Nothing fancy, but the service is always friendly , and the new space is spacious and clean. I like their old school burger--reminds me of the hand patted burgers your mom used to make for you at home. As I said, been going there for YEARS, but, honestly, I've ONLY ever had their burger so I don't know about anything else on the menu. 4-stars for comfort food and because I really want to see this place stay open so please go check 'em out for me!", "author": "D W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-24", "description": "We live around the corner and decided to try this because of the good prior reviews. The staff was great. Very friendly and attentive. We ordered two egg dishes and french toast. If you want to be a breakfast spot, a few things need to work. Coffee was cold and undrinkable. The syrup came in small packages, with high fructose corn syrup the top ingredient. The eggs Mexicana included diced jalapenos, membranes and seeds included, like someone not a cook diced them. We really wanted to like this spot. Maybe they're working out some kinks still.", "author": "Anthony J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "So glad to have this terrific place in the neighborhood. The food is great -- love the Mexican options. And the place is beautiful. Good for a date night.", "author": "Elizabeth O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-07", "description": "Stopped by for breakfast and it was great.  My wife got steak and eggs and I got the huevos rancheros.  Hers was good and mine was outstanding.    Huge menu.     Service was perfect and friendly.   Will definitely be back.", "author": "Mark T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-26", "description": "I've only gotten delivery so far but the food is always really good! Looking forward to checking out the new space.", "author": "M C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-24", "description": "Great new restaurant, well it's not necessarily new, but has new management. It's owned by a gentleman who used to work at Clark's diner. Needless to say, he is a PRO. Good traditional diner food, try the western wrap or omelette. Paninis also top notch.", "author": "James J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-27", "description": "This is a great addition to the neighborhood.  I enjoy taking my son here- I order Mexican dishes and he orders pancakes:)  Note: there is a kids menu.  The food is great and the restaurant is so clean and pleasant.  Today I had huevos mexicanos, which was scrambled eggs with homemade green salsa with black beans and tortillas.  I added  fresh avocado.   I've also tried the tacos, which are fantastic.", "author": "Jeremy F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "Grand Canyon is back! With a Tex-Mex twist. Cesar (from Clark St Restaurant) is one of the owners. Had a great lunch salad here and earlier in the week and today delicious chilaquiles for brunch. The space is airy and relaxed, the waitstaff are great and the food is excellent. Welcome to this great addition to the neighborhood.", "author": "Emily D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "Just took a nice walk from Hampton to  Grand Canyon Restaurant. Well worth the trek. I was hungry for a Party Melt.\nI wasn't disappointed. PM was juicy.\nSteak fries were good. Wife ate a Super healthy burrito that made her happy. Friendly service.", "author": "T K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-11", "description": "Awesome food.  Cool vibes. Great service.  Nice people. Dank nachos. Yummy paninis. Delish water.   Onion rings.  Glorious meal.", "author": "Aaron G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "This place is SO GOOD! The food is spectacular- the tortilla soup is the best I've ever had, and the tacos are absolutely perfect, so authentic and delicious. The service is phenomenal. Huge congrats to the lovely owners and staff, this is the restaurant the neighborhood has been waiting for!", "author": "Colleen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "Stop here whenever in town. Good food, reasonable prices and fantastic staff. Great selection of Mexican but s big mix for all tastes.", "author": "William H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "My mom and I stumbled upon this place and I am so glad we did! Very clean and fast service. They have a little bit of everything which I love. I ordered the BBQ wings which had the best sauce I think I've ever tried. The staff is so unbelievably friendly and accommodating. Will for sure be back", "author": "Samantha S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "Had a great brunch here! The huge menu was great, kids got classic diner breakfast options, my husband and I tried the Mexican offerings. Everything was delicious and the service could NOT have been nicer! The owners came by many times to check on us. We cannot wait to come back for dinner next time!", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-15", "description": "We love Grand Canyon!!! Cesar - the new owner - is wonderful. The food is delicious. The service is excellent.", "author": "Elizabeth F."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Grand Canyon Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "143 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/KHfLDW3A-Wh20VIy65twVg/ls.jpg", "@type": "Restaurant", "telephone": "+13478896670"}