{"aggregateRating": {"reviewCount": 46, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-08", "description": "This restaurant is great and totally kid-friendly. They have both all the diner items and wonderful Mexican food (I had the best quesadilla ever there.) They make you feel welcome and wanting to come back again and again, which I have since it opened a few months ago. Service is excellent and they  check to see and ask if everything is to your satisfaction. I highly recommend this welcome, welcoming restaurant. Nice decor too and great for a party ((spacious, clean and tastefully decorated.)", "author": "Ellen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-13", "description": "I'm so happy for and proud of Cesar, former Clark's waiter and new owner of this wonderful addition to Montague St. The Mexican Corner section of the menu is delicious--the chilaquiles are incredibly tasty, as are the other Mexican influences breakfast sandwiches. Come for the friendly service and fantastic diner fare.", "author": "Emily G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "Have come several times to the new Grand Canyon and feel like I can give an honest review of the place. The Service has been attentive, on point, and the staff tries to make sure you get what you want. The food has been delicious and fairly priced for what you get. The variety, including the Mexican options (Mexican breakfast? Who doesn't like Chilequiles or Huevos Rancheros? Nobody that's who) is expansive. The place isn't earning any Michelin Stars, but it's earning the hearts and stomachs of Brooklyn Heights residents all over again. For great food that will leave you satisfied and saying to yourself that you'll be back again, come check out Grand Canyon.", "author": "Robert L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-25", "description": "Although the name may be familiar to Brooklyn Heights residents, it is definitely not the old hamburger joint. Instead be prepared to enjoy a truly authentic  delicious Mexican meal - all homemade on the premises. But that's not all; the 2 hardest working owners have spent years working in numerous coffee shops and diners. They've been very clever in designing a menu not only of Mexican food, the surprise is that they feature a full menu of all our favorite breakfast and brunch and lunch dishes. Every kind of egg, pancake,bacon,sausage etc. you can think of \nas well as a large selection of fresh smoothies and milkshakes are offered. There is also a kid's menu. \nAnd of course the 1/2 pound burgers that regular customers used to love are back along with salads, sandwiches and paninis. The service is great. I've had a very nice breakfast here and had a delicious dinner delivered (in 10 min.!)\nAll in all it seems like it may be a great neighborhood place.", "author": "Kathy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "Viva Grand Canyon! We're so excited to have this gem back in the neighborhood, and with new and improved management to boot. Friendly and clean, great menu with wide variety of items you don't see on the usual diner menus... the Mexican section is awesome, all homemade and delicious. I had the pozole soup and it's just like soup I had in Mexico. We also had a burger and fries which were perfect. We're coming back lots, I'm claiming my booth in the back! Congrats to these guys on reopening a Brooklyn heights classic.", "author": "Mosh E."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Grand Canyon Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "143 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/KHfLDW3A-Wh20VIy65twVg/ls.jpg", "@type": "Restaurant", "telephone": "+13478896670"}