{"aggregateRating": {"reviewCount": 46, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-08", "description": "I was so sad when Grand Canyon closed a little while back, it was such a great burger spot with an old charm to it. It reopened from what i hear by one of the staff members. Now totally resigned with a Mexican flair it didn't lose its charm or quality of their burgers. The menu is expanded as well from what it seems, but I can't be sure since burgers were always my go to there. \n\nThe staff is friendly and fast, and you don't have to wait forever to get your food which is great if you're there during the lunchtime rush.  But don't think that makes them skimp on your food because it does not. \n\nThere's a few burgers I have yet to try on their menu and am looking forward to going back. So happy they reopened.", "author": "Chre G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-14", "description": "Grand Canyon is a great neighborhood place.  I eat brunch here and my wife and I get breakfast delivered often.  The Huevos Rancheros is fantastic.  Also the Chilaquiles verdes with eggs is delicious.  \nOur favorite take out/delivery option is the Grand Canyon breakfast sandwich with advocado and chipotle mayo.  We put cheddar cheese on instead of American , a real winner!\nWhat makes this place really stand out is the friendly service and the welcoming owner Cesar, who genuinely cares about what he serves and how every customer that walks in the door is treated. That is special.", "author": "Douglas H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-26", "description": "I had been coming to Grand Canyon for years, but then it closed.  I was elated to see it reopen.\n\nThis is a great diner.  The staff is always friendly and they have a great menu; I think it has actually expanded since it reopened.\n\nI really enjoy the breakfast here.  This is my go-to spot whenever I find myself in downtown Brooklyn.", "author": "Ed W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-27", "description": "Recommended by one of my favorite servers - I ordered spaghetti n carbonara today with reservations,...\nOMG! The carbonara is surprisingly, absolutely delicious!!   A Must on your visit!!", "author": "VioletL P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-21", "description": "Besides coming here for breakfast, we also come for the fresh fruit smoothies.  The original spot was known for very good burgers but we have not tried the burgers yet.", "author": "Corey B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-28", "description": "I love a good diner and am so happy that Grand Canyon Restaurant reopened on Montague Street. Grand Canyon offers a nice casual atmosphere and an extensive menu where you will surely find something to satisfy your hunger.\n\nI ordered the steak tacos while my friends had the Hawaiian and Mexican burger. The tacos were very good and topped with a nice combo of cilantro, onions, and guacamole. I tried a bit of the Hawaiian burger and the meat was fresh and above average when comparing to most diners. \n\nThe atmosphere is quite nice inside, although the booths could use a little more leg room. Service was friendly but slow, it's the type of restaurant where you need to flag someone down every time you need something. \n\nOverall- solid diner and a much needed addition to Montague Street.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-16", "description": "Best Montague sandwich!  The breakfast menu has a lot of Mexican offerings but if you're a traditionalist, you can get pretty good bacon and eggs too. The servers are prompt, courteous and friendly.  What more can you ask for?!", "author": "Wailana W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "I've known the owner for over 22 years from Clark's diner in the hood.  He is the most warm and welcoming person and I would return to Clark's as a direct result his excellent service as a waiter.  Thrilled to see he has his own place with amazing Mexican food and an expanded diner menu.  The meal was divine and the service beyond perfect.  Can't wait to eat everything on this big and beautiful menu.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-23", "description": "This restaurant is so wonderful! We've made it one of our favorite go-tos! The food is great! Truly, anything we've ordered has been so delicious! The owners have an immaculate heart and you can feel it from the moment you walk in! I appreciate going in and feeling like one of the family! We'll be going back for years to come!!", "author": "Christina G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-15", "description": "My wife and I were tired and hungry after three hours at Social Security, so we stopped into Grand Canyon for lunch. We were immediately and enthusiastically greeted, seated and given menus. I went for a mushroom burger, cooked medium and onion rings, my wife had a salad and American Stuffed potato. My wife's salad was tiny, but very fresh. Her potato, despite the toppings was on the dry side and could have benefited from a little butter when they opened it. My burger was well-done instead of medium, but pleasantly juicy and flavorful and the onion rings were thick, crunchy and delicious. I have to remark that the place was very clean, and even the men's room sparkled, a definite plus. I think we'll make a return visit if we're in the area again.", "author": "Seth B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-22", "description": "Ordered corned beef hash and eggs with home fries and my friend ordered the two eggs special with hash browns. She mentioned that the hash browns weren't that great. My food was good, I ordered my hash extra crispy and it wasn't as crispy as I wanted but it was ok. Place is very nice and cozy and the host/owner was very pleasant and the staff was attentive. Highly recommend this spot!", "author": "Abegaile S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "Best Mexican food in Brooklyn and probably the whole city. Seriously, this unassuming diner is hiding the most authentic Pueblan cuisine you're gonna find without a plane ticket. The mole will make yours toes curl. Get the Al pastor and you'll see god. The chilaquiles? You've never had chilaquiles until you've had Grand Canyon chilaquiles. Don't get me wrong, everything on the menu is exceptional. But the Mexican dishes, they're so good you'll be speaking Spanish before you put your fork down. \n\nSo good to have you back, Grand Canyon.", "author": "charles p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-07", "description": "Been here twice with friends! A very cozy restaurant, the waiters are very attentive and the food is great! Will be coming back again.", "author": "Choco A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-22", "description": "Great service! The food wasn't as good as expected because of  the reviews, it was a little bit greasy.", "author": "Andrea A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-24", "description": "A friend and I had a truly delightful meal here:  good food, pleasant environment, friendly yet nonintrusive staff.  I highly recommend!!", "author": "Maryanne B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-13", "description": "Excellent breakfast and service in a really nice open air cafe setting in beautiful Brooklyn heights!", "author": "Jeff H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-26", "description": "Love the service, love the delicious food. I have a new favorite omelet now.. cheese, ham, jalepeño, avocado! The coffee is reasonable, the hashbrowns are a delight. So much food for a reasonable price! Thank you!", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-15", "description": "We've been here several times, and the food is always delicious and plentiful (the huevos rancheros and enchiladas are favorites, and now that Cody's is unfortunately closed, one of the few spots in the neighborhood where you can get potato skins) and the service always kind and helpful. It's very family friendly but still quiet and pleasant. Love this place.", "author": "Alexis F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-29", "description": "Was working on the area and came in for breakfast ... place was not busy but was warmly welcomed ... ordered a breakfast sandwich of eggs cheese and sausage ... the coffee was very good... the sandwich was great ... and the service was very attentive and friendly ....", "author": "Gary M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-08", "description": "Love this place! Food is very fresh, nice variety for breakfast lunch and dinner, and the service is extremely friendly and attentive. Families note: this is a very kid-friendly place. They have a well-priced kids menu (so they don't make you pay $12 for your kid to eat half a pancake) and are totally fine with what comes with a family (noise and mess). \n\nIt also has very nice decor and is clean. So glad this place opened!", "author": "Tbd R."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Grand Canyon Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "143 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/KHfLDW3A-Wh20VIy65twVg/ls.jpg", "@type": "Restaurant", "telephone": "+13478896670"}