{"aggregateRating": {"reviewCount": 145, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Stopped in for some sushi tacos, they were excellent! Perfect portion size for lunch, filled me up but I didn't need a nap afterwards. Service was prompt and friendly, I'll def have to come back and try their normal tacos sometime.", "author": "Charley W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-01", "description": "I've only ever ordered delivery from this place and will agree that it is pricier than your standard Mexican fare, but I feel it's pretty worth it if you're looking for quality food that tastes good, and not just whatever food that tastes good.  They have wonderful vegan and vegetarian options and tacos.  The vegan taco bowl is AWESOME, as is the guacamole.  The tacos are very small and they're $4 each which, I don't know, I thought was pricey given how small they are and how much is on them, especially for the vegetarian spicy cauliflower taco?!  The braised short rib is $7.  These tacos fit in the palm of your hand.  But aside from that, it's a very solid place and I like 'em.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-10", "description": "Two stars is probably generous. We came here since Gran Electrica was closed for a private event...not the best trade. They tried too hard to make this place instagrammable and fell short of everything else. Food is sadly less than mediocre- which can be hard to do in New York. Mexican corn was bland, all of the tacos were dry. Guacamole came in a very small portion for $8. The \"specialty cocktail\" was undrinkable and only tasted of tequila. Only saving grace of this place were the blue corn chips and The Impossible Taco which was the only thing I ate with flavor...I guess if you're vegan and really want food on top of a tortilla come here but everyone else, you're better off going to Chipotle. Even their margs are better there.", "author": "Megan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "If I could give a 6 or higher I would definitely give it to Taco Dumbo! Great service and scrumptious food, what else could you ask for in a casual eatery? I love the beach feel, it reminds me of my home state, California. I will definitely be back very soon! Very unexpected but definitely worth the try!", "author": "Brandon P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "This place is super trendy and I would easily give it five stars if it were a tad cheaper!! The interior was very beachy and hip. The workers were nice and offered great suggestions. I loved that they had vegetarian options and were completely dairy free. We got the cauliflower tacos, fish tacos, and a bowl and it was all delicious. A nice getaway from all the huge dining lines in the area.", "author": "Kara N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Love this place!!! If your in Dumbo, you need try their tacos!!! Must, must, eat!!! Thank you Taco Dumbo... delicious", "author": "Diana A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-29", "description": "There are times when you land in a spot totally unintentional with great results. That's what happened to me when I trusted Taco Dumbo. Son friendly you feel like family right away. The food was AMAZING! The design and music makes you think your at the beach. I will make this my spot to bring my out of town friends and family. Add to your bucket list", "author": "Jorge C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "Yummm!  Chill to-go or sit down environment, healthy fresh-squeezed juice in their delicious and well-made margaritas, and a menu filed with tasty options that will leave you feeling satisfied and healthy.  Can't go wrong with anything.  Their only flaw is they don't accept cash, so come prepared with plastic!", "author": "Zephy D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-08", "description": "Had lunch with a friend here. They were out of the vegan chorizo taco (which I desperately wanted to try), so we had the guac, juice, and a few tacos. The three star rating is for the fact that the tacos were fairly bland and rather expensive for what you got. The street corn, however, was yummy, and the service friendly - but I wouldn't come back just for that.", "author": "Jessica K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-27", "description": "I ordered a chicken taco and a little bowl of quinoa and black beans. \n\nEverything tasted good and the service was decent but the quinoa and beans were cold. Not just not hot, like properly cold. \n\nThe interior is Brooklyn \"hip\" and clean.", "author": "Gabriela B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "Good, healthy place. The taco salad bowl was really good and filling. It was a little spicy so heads up to those who can't handle spice. Tip- they don't accept cash for those who still carry around paper", "author": "Eldaline P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "I used Taco Dumbo to cater a client event and it was great. My clients loved the food and the customer service was excellent. They were not only responsive but proactively reach out both before and after. Before to  ensure I had everything I needed and to open a line of communication should I need anything else, and after to make sure I was satisfied. Food was fresh and everything went smooth. Definitely recommend.", "author": "Kristina T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-27", "description": "2 tacos. Guacamole. 27 bucks. Outrageous. Never coming back. Yelp is making me write more words. There really aren't any. I'm not Hemingway. This place is why Hillary lost.", "author": "Ryan K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-10", "description": "I live in the neighborhood and was thrilled to find out a new restaurant opened up in Dumbo - and even more thrilled it was a taco spot!  Browsing the Instagram, I convinced my partner to go to dinner there a few days after opening.  \n\nWe walked in, and realized we weren't going to be seated, but had to order at the counter.  Okay - not a problem.  Until we reached the menu, and saw the prices.  Seriously?  I order at a counter for these prices?  I said let's just try it out, get some tacos, try some sides, and of course, try out the fresh juice press margarita. We placed our order, paid way too much for it, and then were told our order would be called and we had to come up and get it after being prompted for a 15% 20% or 25% tip.  Of course I had already clicked 20% without realizing I would be my own waitstaff.\n\nFirst, our drinks were called.  My margarita tasted like feet.  I'm serious.  Feet.  Then, our food was called.  The portions are laughable, and the tacos we ordered lacked flavor.  The only redeeming quality I give the meal was the chicken skins topping that was on my guacamole ball.  Which, by the way, arrived with about 8 chips.  \n\nPaying close to $70 for two drinks, 4 tacos, and 8 chips with guac is unacceptable.  I wanted to LOVE this spot.  But alas, we will not be returning.", "author": "Emily H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "To be honest I have not tried the food but I've seen pictures and the menu and I know I will be coming here this summer. Especially after (reason for my review) having been permitted to use their bathroom. I had taken my 3yr old nephew to the Brooklyn Bridge. We were heading to the train station when he said he had to use the bathroom. The restaurant was getting ready to close, the stools were up and no customers where around. I went in and before I could finish my question the man there who I assume was the manager said yes, when I finished my sentence he said it was ok. Both him and the worker there were super friendly and kind, the worker even directed me to the F station. Based on this experience I can see it is a friendly-kid-place and that is big for me. Will be coming for some tacos and drinks.", "author": "Maria H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-04", "description": "Pretty cool place, really enjoyed the nori tacos I got. Can't speak for the rest of the menu but the tacos were great and very fresh.", "author": "Emmett F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "Great lunch.  I had the taco salad and my husband had the chicken and short rib tacos.  He loved the short rib tacos.", "author": "Lisa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "Amazing food! First time going and boy was I glad I found this gem! Chicken tacos were great, hefty size of chicken! Guacamole with chicken skin and corn was to die for! Definitely going back to try their margaritas!", "author": "Monsey T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-17", "description": "I got the grain bowl and at least half quinoa was burnt and the texture of chewing pebbles. Meat was good but I couldn't even finish because of how hard it was avoid the burn quinoa. And it's $12 which is already expensive.", "author": "Isabella S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-09", "description": "Small portions for nori tacos great portion sizes for bowls. Good flavoring , nice mix if spicy , sweet , sour. Drinks are overpriced. Super aesthetic , not many people know about this place , great for instagram pics.", "author": "Nuzhath N."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Taco Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "56 Prospect St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/fJAcxMsY1cQBXlSq7s5M1w/ls.jpg", "@type": "Restaurant", "telephone": "+13472020306"}