{"aggregateRating": {"reviewCount": 145, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-22", "description": "Love that this place opened up in DUMBO, we need more great lunch options. Super warm and bright inside, feels like a warm taco joint in cold, sterile DUMBO. Delicious, healthy options (taco bowl was great), and great vibe. Looking forward to coming back here!", "author": "Chau M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-29", "description": "This place is super cute and fun- think West Coast Sushi inspired tacos and delicious pressed juice margaritas.  Prices are a little high for a casual lunch spot, but in line with the grade/quality of sushi.  Loved the tuna nori tacos.  Guac is great- not a huge fan of the crispy chicken skins, but love adding pepitas and pomegranate seeds.  Love to come after work for a seat at the bar with a margarita!  Drinks are strong and tasty!", "author": "Jessica K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "This place was great! Found it by luck as we were trolling Dumbo Market. First time to this area. The food was great and the drinks were different but good. I got the taco salad with veggie chorizo and guacamole with a lime/orange margarita with housemade tajin seasoning on the rim.", "author": "M C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-13", "description": "Good food if your looking to get a \"snack\". Pricey for the portions, $31 for a nori, salmon tostadas, a water, and some coconut balls. We left hungry....like we had just eaten some good appetizers.\nWe did like the menu and may go back to try something different.", "author": "Travis S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-27", "description": "Super disappointed. This place was rated with four stars so I decided to try it, but honestly not sure why it got four stars. The tacos were mediocre- under-seasoned. The drinks were flavorless, really watered down and over priced. Definitely won't be coming back.", "author": "Hannah Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "I stumbled into this place while visiting some friends in the area and OH MY GAWD. The food is so fresh and flavorful and came out right away. We kept ordering more and more food because we could not get enough of the tamarind beef braised short rib taco and the spicy tuna nori taco. Each dish paired perfectly with the make your own margarita! Such an amazing idea and its so surprising this is the only place that does it. Definitely worth the trip to Brooklyn!!", "author": "Brooke V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-13", "description": "Good food and good service.  Sushi-grade fish is usually good but has been bad sometimes. The staff is nice but it's annoying that they constantly try to up-sell you on drinks or other things every time you order. It's great that the staff is really nice but it's definitely over the top sometimes.  Overall it's a great addition to the DUMBO area and I'd recommend it!", "author": "Bill R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "I really like taco Dumbo and am glad they opened in the neighborhood. It's quality food at an affordable price with a cool vibe. Not your typical Mexican fair, so if that's what you're looking for - this ain't it. But if healthy, delicious food at a good price whets your appetite, this is a great option.", "author": "Eric S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "Got the Taco Salad and it's the best salad ever. Cute restaurant, friendly staff and speedy service. Looking forward to trying more menu items.", "author": "Lauren P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "The tacos are just SO delicious! The interior has a great feel, lots of space. And I met the owner and he was really cool. It's a bit out of the way for me, and not in my general path, but if I'm in the area i'll definitely make a point to come back!", "author": "Benjamin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-01", "description": "The vegan chorizo taco salad was tasty AND filling! Great little spot and a welcome addition to the food choices around WeWork Dumbo!", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-13", "description": "This restaurant is mediocre at best. I was really pissed when I ordered two tacos and one side order of guacamole. What I got were two very small soggy tacos and a very small portion of guacamole and chips for 28 + dollars. Just ridiculous two small tacos and a side order of guacamole 28 plus dollars!!! And they weren't even that good none of it was! Small cup of orange juice who knows how much I paid for that. Awful I would never recommend it or go back to it.", "author": "Indigo L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-18", "description": "I was so excited to have a taco joint open near my office, but was disappointed. I got the taco salad with vegan chorizo. The vegan chorizo tasted like really stale bacon bits, and the rest of it was just a little bit of sour cream, bland salsa, and onions over a pile of raw kale. Not at all satisfying. They clearly put a lot more thought into the decor than the food.", "author": "Rosy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "I love the vibe here! I went last week with a few friends so we ordered a bunch of different things off the menu. The guacamole was one of the best I've had (sizable portion and perfectly seasoned) and you can choose different toppings (we got pepitas and crispy chicken skins). We also ordered the short rib taco (delish and high quality), the chicken tacos, and the tuna nori tacos (the order had three in it and I love the combo of the flavors in it). We didn't get a chance to try the bowls, but I definitely want to go back and try them. I also got a margarita that was so tasty. I really love that they have cold-pressed juices - I chose the organic tequila with the pineapple turmeric juice and cilantro salt rim. The decor was really cool too - very laid back, friendly staff, good music.", "author": "Sima J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-30", "description": "Great place.  Easily accessible from Brooklyn bridge.  Great chicken and cauliflower tacos.  Guacamole was so good we bought 2 rounds. Bar tender gave us a round on the house", "author": "Adrienne R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-24", "description": "I'd been meaning to try this place for some time, as I work in Dumbo and am always on the lookout for something beyond the typical limited lunch selections.  I went with the special of the day - tortilla soup.  I figured it's tough to mess this up... you know where this is going... they should have called it 'spiced watery sludge'.  Though that's not entirely accurate either, as 'sludge' suggests the existence of solids within a liquid base. Unfortunately, not the case - all that was suspended in this thin soup was two (2) tiny pieces of chicken and three (3) broken, soggy tortilla fragments.  Basically, a full cup of nuthin'.  Weak flavor too...  Ever so slightly better was the chicken taco.  Not the very worst I've had, but you can certainly find better.  I can't imagine what the $7 spare rib taco tastes like... Looking forward to the arrival of Dos Toros.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "I couldn't agree with Emily less. I think the prices are super reasonable and the quality is amazing. It is not a sit down restaurant- that's okay. The staff is extremely friendly and welcoming. There is ample seating. The margaritas are fresh and healthy with cold pressed juice. Just because they are not loaded with sugar does not make them bad. We had spicy salmon nori rolls- out of control amazing. Like 3 mini handrolls with brown rice. I love that I could get my tofu taco wrapped in jicama since I don't love corn. I wish they had shrimp or fish tacos. My husband loved his chicken taco. The guacamole was so tasty and you get two free interesting toppings. The corn chips are homemade. Basically you can fulfill Mexican and sushi cravings in the same place. Everything is health conscious - brown rice, quinoa, jicama wrapped taco option. So good. The food is light, healthy and so so tasty and prices are reasonable. They will do very well I hope!", "author": "Alexandra W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-19", "description": "I had the short rib taco and an orange/lime juice.  It was a single corn taco that was good.  Juice was ok.  But they only take credit/debit cards and the cashier turns the iPad towards you and your choices are NO TIP, 15% Tip, 20% Tip 25% Tip, and maybe some other higher choices.  Since I was two feet away from the cashier I wimped out and picked 15%.  Total for the order was $17.84.  I felt ripped off.  If forcing you to tip the cashier is going to be the trend, I'm not going to participate.", "author": "Jim W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Discovered this little gem on my recent stroll through Dumbo. Very fresh ingredients, you can watch the cooks prepare your food right in front of your eyes. Tacos and tostadas tasted delicious, they def added a new twist to those staples! Have to come back for the cocktails next time.", "author": "Stefan H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-27", "description": "Unfriendly, bad menu, to small to be warm in the winter. Confused as to why there is a bar but no bart next there? Maybe it's just a lunch spot? Really did not care for the menu either. Limited options. And not good for vegan/gluten free people.", "author": "Tara S."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Taco Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "56 Prospect St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/fJAcxMsY1cQBXlSq7s5M1w/ls.jpg", "@type": "Restaurant", "telephone": "+13472020306"}