{"aggregateRating": {"reviewCount": 145, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-23", "description": "What a cutie!! Firstly Taco Dumbo has awesome 5 dollar happy hour margarita. Ask the waitress what to get and they give you good tips. Points for the taco food bar, bathroom, outlets and comfy chairs. Oh and the music is groovy, \"throw in some bling.\" I was almost rocking it out like I was in Hawaii or really close \n\nI think you'll like it.", "author": "Alina W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-29", "description": "For starters, this place DOES NOT take cash, so make sure you have a card! The overall vibe of this place is super chic, hip and updated (even the bathroom)! So if you're anything like this generation, Taco Dumbo def offers a spot for the Instagram lovers, LOL. I just think that after you get over the great decor, the tacos and what's offered is just \"OKAY\". There was nothing that really wowed me - oh, expect the margarita which was GREAT! \n\nThe tacos were way too small and lacked a lot of flavors. I also didn't really enjoy the impossible taco meat nachos.", "author": "Amber B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-06", "description": "It didn't seem like my name was getting called anytime soon on the day I had jury duty, so I started looking up lunch spots nearby. That's when I found Taco Dumbo, which is a ten-minute walk away from the courthouse. \n\nTo be honest, I probably wouldn't have ordered from here if there wasn't $5 off deal via the Ritual app. The tacos are pretty pricey, starting at $5 each. I had the Spicy Tuna, the Rotisserie Chicken 'Tinga' taco, and the Vegan Chorizo taco. I liked the concept of the spicy tuna taco. It's like a sushi-ritto but in taco form with brown rice, so you have to eat it quick because the seaweed will get soggy really fast. I don't know how I felt about the fish. It had an odd color to it, but it tasted fine - I'm just not sure if it was actually tuna. The chicken was not bad. I ordered it on a lettuce jicama wrap, because I was trying to be *a bit* healthier, but they gave me a corn tortilla anyway. I'm kind of glad they did because I was still a little hungry after the three, tacos, so I would have been even hungrier if it was the lettuce wrap. The vegan chorizo was my favorite, which I was surprised at since I normally don't order vegan things. Maybe it was the lime crema that got me. \n\nLike I mentioned earlier, Taco Dumbo is expensive without the coupon. I'm also never in this area, so I don't see myself making a return trip.\n\nTip - I saw a sign for taco Tuesdays: $1 per taco from 5-7, but each person can only get 2 tacos.", "author": "Mel T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-02", "description": "There's NOTHING bad to say about this place. \n\nDECOR: 10/10 tropical, chic, and girly \n\nMUSIC/AMBIANCE: 10/10 loud but mellow and played good vibe music \n\nFOOD: 10/10 both vegan and non vegan options\n\nSERVICE: 10/10 ordering was easy, food came out quickly and the staff was very sweet! \n\nCLEANLINESS: 9/10 everything was served on compostable trays with bio-based utensils. The only reason it's not a perfect 10 is that most of the water cups were dirty.\n\nPRICE: a little pricey for tacos but I am not disappointed since the quality made up for it. All the products taste fresh and oh so delicious!", "author": "Chauntel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-24", "description": "Am I giving a 5 star rating to a trending Mexican fast food place? Yes I am.  That's the rating you get when the vegan Impossible Tacos and Vegan Chorizo Taco are just about dead solid perfect.  Paired with a delightful $5 Frozen Margarita Taco Dumbo really hit the spot on a sunny Sunday afternoon. Ausra helped us through the menu and ordering process, the service was great and the food came quick.  Turns out the spur of the moment quick bite to eat turned into a really fun meal for us.  I believe I'll have another.", "author": "Rob M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-23", "description": "We stopped in to pass time before a wedding reception and love this place!! The tacos were AMAZING and so fresh! The young lady working was super sweet and helpful. The margaritas were soooo good with the rose and hibiscus on the rims. The ambience is really nice too. Loved it!", "author": "Jasmine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-01", "description": "Vegan-inspired take on Mexican food and cold pressed juice alcoholic drinks! The weekday Happy Hour 5-7 has some great deals. It does tend to get crowded then, which adds a significant wait time. \n\nWe loved the blue corn chips and the fresh guacamole! The nachos were alright, but I didn't love the vegan cheese or meat that much. Texture was good but taste was not the best. \n\nThe margaritas are definitely where it's at. You can customize your choice of cold-pressed juice blends (pineapple, watermelon lime, strawberry apple) + hard alcohol (tequila, gin, mezcal, etc) + salt or sugar for the rim (my favorite was the rose sugar and hibiscus sugar)! \n\nThe only big down is that drinks took about 10-20 min to make during HH and one of my friends drinks took 45 min! However, it was during an extremely busy time, in the midst of HH.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-20", "description": "Nice place.  Looks like a pretty extensive bar with lots of margarita type options but see whiskey, brandy, vodka etc.  Decent beer selection.  Few NY brews that are above the expected Mexican beers.\n\nI had two tacos and guacamole.  I liked everything.  Tacos had good flavor.  I had \"The Impossible Taco\" which is plant based beef.  Tasted like real beef.  I'm a meat lover.  I would have this one again.  I also had beef short-rib taco which was also tasty.   Guac was fresh but didn't really stand out.  Had corn and fried chicken skins with guac. corn tasted fresh, next time I'll skip the skins.\n\nThey have a happy hour food and drink menu.  I'd like to go back to try the drinks and some of their other options.", "author": "Kyle D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-16", "description": "Wanted the impossible taco but they were out... but I think that's ok because I was able to try the vegan chorizo! It was super yummy with the hot sauce as suggested! Yum! It's a little pricey, $6 for one taco, no sides.... but overall great concept and flavor! Additionally I bought a \"Dirty Lemon\" drink (health drink) - got the Chromium one... and it was $10!! Lol that was pricey, but I'm not sure what they usually run, so maybe that's normal. Anyhow a solid 4 stars, I want to try more of the tacos, and the fresh pressed juice cocktails next time!", "author": "Tiffany V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-09", "description": "I REALLY liked this place! \nI went yesterday (Friday) at 5pm and stayed till closing. (9:30)\nIt wasn't packed, people came and went... \nMusic was great, the staff was GREAT! \nThey do have happy hour specials. \nThe food was on point. (Posted pics) \nI really wanna come back soon. \nEnjoy!!", "author": "L. V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "Great new spot in Dumbo!!! Rainlove and the crew are friendly and give awesome service!!!  Cinco De Mayo was the sweet spot.  But, Gimmeeeee Fish Tacos Please!!!", "author": "Lenny M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-09", "description": "My friend and I visited on a Saturday and the place wasn't overwhelmingly crowded which I appreciate. We ordered two rotisserie chicken \"tinga\" tacos, a nori spicy tuna taco, and chips \u0026 guac. The food was impeccable and I am claiming the rotisserie chicken taco as my new favorite! The patrons were very friendly and kept checking consistently to see if we need anything.\n\nThe decor is very nice and the color coordination was perfect. Will come back for sure!", "author": "Jannat S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-17", "description": "After a photographic trek across the Manhattan Bridge, a friend and I came here for lunch on this relatively quiet road. Their bathroom was out of order but their neighbor (a sandwich shop next door) let Taco Dumbo patrons use their facilities. \n\nReally nice, chill, beach vibe with good music (reggae)! Swing seat in the front, tropical colors but not overwhelming. \nOur server was very friendly and helpful!\n\nI got the:\n_ Raw Salmon Nori Taco Trio ($11)\n= Yum. Filling, and very nicely presented.\n\n_ Cold-pressed Juice ($7)\n= Refreshing! I got a mix of Pineapple/Turmeric and Apple/Ginger/Lemon/Cayenne.\n\nWould definitely return when in Dumbo!", "author": "Grace P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-30", "description": "Is this salmon cooked? Raw? Gross that I have to ask that question. Definitely not worth the $20 I spent for this and 1 deconstructed hand roll with sketchy salmon.", "author": "Julianne S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-07", "description": "I was planning to meet up with some friends in Brooklyn and we decided to grab lunch here first. When you enter, you notice there is a lot of open space and a large \"Vibe is Tribe\" neon sign. There's a bar straight ahead when you first enter and tons of seating.\n \nI ordered the Rice Bowl with sushi grade salmon while one of my friends ordered the Taco Salad with Pulled Rotisserie Chicken. My two other friends got their rotisserie chicken tinga, tamarind-braised beef short-rib, and impossible tacos. The cashier was actually kind enough to give my friend, who is a vegetarian, a free taco (their Vegan Chorizo) to try.\n \nOnce you order, you can choose a place to sit and they will call your name for you to pick up your order. We weren't there during the lunch rush, but I imagine this could get a little disorganized if the restaurant is loud or if someone isn't paying attention. There were also three pitchers of cucumber water and glasses that you were welcomed to take and drink out of.\n \nThe Rice Bowl reminded very much of a Poké Bowl that you might try at a sushi place. It was delicious and very filling as all the ingredients seemed to compliment and mix well with each other. The Taco Salad was also very good and healthy as well. While, I did not try any of the tacos my friends order, they both told me that they were delicious and filling.\n \nThis was place was great and the foods were nutritious, well-presented, and affordable to us. If I am ever in Brooklyn again, I would definitely consider coming back here.", "author": "Andrew H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-09", "description": "I went here around 12:15pm on a Wednesday and it wasn't crowded. The place is hipster. The staff are friendly. I ordered a soup and it took a lot longer than it should have (minus one star). When I opened it, it didnt look too appetizing but the taste was pretty good. There was a lot of chicken and avocado in it and a little spice, but I don't think its worth $8. I would go back to try the tacos.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-13", "description": "Definite hipster millennial type spot (in the heart of millennial town in DUMBO) But this spot was very good.  The ingredients were fresh and the flavors of what I ordered was very different between each dish.\n\nI had \nspicy tuna nori taco -- similar to a tuna roll\nrotisserie chicken tinga taco -- the pickled onions were amazing\nside of mexican street corn -- very sweet, but good\n\nA bit pricey...but a good lunch.", "author": "Stuart B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "My boy: Yo Q, you want Tacos bro?\nMe: Nah it's kinda late.\nMy Boy: So what man, it's tacos and .... Yo just check the menu, the food sound great.\nMe: **strokes beard and reads menu**\nMe: I'll be there in 20mins\n\nGot there and the place was so calm and welcoming.\nSwing, like chair (seating area) to my left, bar right in front of me, kitchen to the back, and a \"come on and enjoy\" smile from the beautiful bartender.\n\nGrabbed a seat and didn't bother looking at the menu again cuz I already knew what I wanted. The wild salmon taco meal with pineapple press juice was the wave... ask anybody! The food came out promptly and with a smile (did I mention I LOVE great service?). As I sat there and looked at my sushi style taco, I thought to myself \"are they gonna judge me if I roll it all into a ball and ..... bruh just eat it.\" So I did, and it was gooooooood. The seaweed held together better that expected and the salmon was flavorful and fresh. Apparently if you press pineapple just you create magic in a cup.... Next time I'll get a bigger cup lol.\nFor a moment I had to break my own \"don't eat and drink simultaneously rule\" but I couldn't help myself. You'd think one would overpower the other right? Wrong! The flavors remained and even complimented each other.\n\nI'm plan to try everything on this menu.\nMargaritas for brunch or HH? I'll decide or I'll do both :)", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "Just moved to Brooklyn from Austin (where delicious tacos can be found around every corner). With that said, I was extremely surprised to discover this tasty restaurant while walking around Dumbo. Had myself the beef short rib tacos on corn, with a $5 frozen margarita and a side of guacamole topped with pomegranate and corn....DELISH! The staff was super friendly too! The lady that took my order was friendly and conversational and the bartender gave me an extra margarita after his printer malfunctioned and my drink order was messed up. 10/10 will DEFINITELY be coming back!!", "author": "Jarrod S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-16", "description": "My first time to this location. \n\nIt is a pretty good size with a full bar. Just like the other location (Pennsy) - you order and then they call your name when ready. We ordered to dine in. \n\nThe amount of meat on each taco was definitely generous. I do think the flavor wasn't quite as good as I recalled from my last visit to Pennsy, but still a good meal. \n\nThe cauliflower, vegan chorizo and chicken tacos are $4 each. Beef is 6 or 8. \n\nIf you sit by the window, you can see the world trade center and Manhattan skyline, which is kind of cool.", "author": "Tracie L."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Taco Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "56 Prospect St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/fJAcxMsY1cQBXlSq7s5M1w/ls.jpg", "@type": "Restaurant", "telephone": "+13472020306"}