{"aggregateRating": {"reviewCount": 145, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-10", "description": "Last weekend a group of friends and I stopped in at Taco Dumbo for a bite to eat and some drinks before going out. A few people in our group were vegan so we chose Taco Dumbo because of their vegan friendly options. I ordered the taco salad but was unfortunately a little disappointed with the portions and the ingredients. I was expecting a generous helping in a taco shell bowl like most taco salads... Instead it comes in a regular bowl and the ingredients are not the usual ingredients for what I think of as a Taco Salad (see: kale). However, my vegan friends really loved their meals and their tacos looked awesome, so I will have to come back and try another item off their menu. I got a margarita and it was pretty yummy, not too bad. Ambience-wise it's a nice place and was comfortable for our group of 6. Like I said I am certainly going to give Taco Dumbo another try, but was not especially Wowed on my first visit.", "author": "Marcie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-04", "description": "Finally--a delicious, healthy, not overpriced place in Dumbo. Great atmosphere, delicious raw fish Japanese-inspired CA Mex food; best margaritas made with fresh-squeezed juice.", "author": "Lida Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-09", "description": "Been eating here a lot since it moved in to the neighborhood. The quality is great. I get the taco salad with vegan chorizo and sometimes the chicken. My husband loved the tacos, guacamole and corn. 4 stars because it's expensive.", "author": "Jamie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "great food, cool vibe for casual mex dining, and great service. everyone is really cool, nice, helpful! love going here.", "author": "Jackie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-18", "description": "This place is essentially a high end fast food place. Except they also do drinks. I was here during the day so I am reviewing it as a place to get some food.  I wouldn't go out of my way to come here but if you're in the area and hungry, it's a pretty good way to go. They are more expensive but also more high end than getting a cart gyro or a burger. Something to note is that I would describe their food as much more Asian than Latin American, maybe one could say it's a fusion of those two cuisines, but the flavor profile is closer to the former than the latter. So it ended up not being what I expected at all, which was fine for me, but I think if one was really set on having Latin American food, they would be disappointed. I had the rice bowl which comes with raw fish, vegetables, and brown rice. I am was totally full upon finishing it, which for $10 is pretty decent. The amount of fish was quite generous and I thought the plate had a good balance of grain, veggie, and fish. Oftentimes in such bowls, the amount of fish or meat is tiny, but this was not the case here. The veggies were also unexpectedly tasty, which is a rare compliment from me. Some of them were pickled. One complain was that the broccoli was supposed to be \"charred\" and wasn't.", "author": "Aliz C."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Taco Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "56 Prospect St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/fJAcxMsY1cQBXlSq7s5M1w/ls.jpg", "@type": "Restaurant", "telephone": "+13472020306"}