{"aggregateRating": {"reviewCount": 145, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-20", "description": "I relocated back home to New York from the Bay Area California right before thanksgiving 2016. All my time has been spent looking for work and getting better in touch with myself. \nMy wife and daughter came to visit until I can get them out here permanently so we did the tourist thing. It had been so long for me that I had forgotten how amazing New York really is. So we took a walk on the Brooklyn bridge did the usual pictures and decided we needed to grab a bite. So of course we hit up yelp and decided to hit up this taco place as a pretty hot new business. Our daughter who just turned one year old needed a diaper change so I headed for the head and asked my wife to order me a taco salad with chicken. \nI arrive at the table with our freshly changed angel and look at the taco salad and ask what the heck are those brown crispy things? She responded kale chips. Strike one, I despise kale. Strike two, its in a recyclable bowl. So every taco salad I've had has been in a deep fried flour tortilla. Ok I didn't realize this was more of a healthy taco joint. Had I known I would have skipped it, but that's just my personal preference. So I pick out all the kale chips and have them to the wife. Eat the salad which was very bland. In the end I was just as hungry as I was when I walked in. \nBut let me get to why I gave this 3 stars, cause for me it wasn't for the food. It was for the customer service given to us by Tristian. From the second we walked in he was friendly, pleasant and all smiles. Handed us menus as well. My wife asked if they had high chairs and they didn't. Low and behold as we started our meal here comes Tristian walking across the street with a high chair! He went across the street and asked if he could borrow one for our daughter. Ladies and gents, that to me is going above and beyond customer service. Thank you Tristan for making our visit feel special. We won't be back for the food but we will remember our visit positively thanks to you :)", "author": "Frank R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-25", "description": "Food was good and they have healthy options as well as traditional ones. Price is very reasonable.\n\nIt is hard to see they menu from the order line, it's on the other side of the restaurant, makes it a bit awkward to order unless you know the menu off by heart.\n\nIt's not too noisy, but is very crowded weekdays and weekends. Was hard to find a place to sit after ordering. If you are a larger group, one of you will have to hold a table while the rest order.", "author": "Anna H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-11", "description": "Tried the vegan chorizo taco bowl-- super filling and so good. I paid around $12 I believe. Prices are pretty expensive, but given the neighborhood I'm not very surprised. They have nori tacos(portions seemed small) and also regular chicken tacos as well that my co-worker got and said was pretty good.", "author": "Angela N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-08", "description": "Way overpriced for small portions and mediocre food. The staff recommended the salmon or tuna rice bowl, I ordered the salmon with guacamole, and a watermelon juice. This cost $20.\n\nWhen I received the salmon bowl, I was shocked by the size of it. The quality of the salmon was so so and badly cut in huge cubes. \n\nYou can literally go anywhere else in the city for a walk better poke bowl for half the price and twice the size. And with fish that is good quality. Not fresh-ish.", "author": "Kat K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "I'm in shock!\nI can't believe that this place is selling Happy Hour Casamigos margaritas for $7! Also tried the Ancho Americano Taco with the plant based beef which was amazing. Great vibes, friendly staff and a killer happy hour.", "author": "Ken W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "Tipped 20% to have to grab my own food and wait over 35 minutes for the drinks we had ordered. (Please note that it is not a cheap restaurant - one small taco goes for $7 and we spent over $100 on lunch here) after waiting 15 minutes, I asked the bartender, Brianna, if we picked our drinks up at the bar or the \"pickup\" station she loudly yelled \"you're gonna have to wait a minute\" over and over again as if I had offended her by questioning where my drink was. She then began cleaning up trays around the restaurant, and shortly after disappeared in the back room. Finally the man working the cash register made his way to the bar and made our tables' drinks because he could tell we were frustrated after already finishing our meals and not having drinks yet. I then overheard him say \"this is ridiculous, I'm not even a bartender\" hm. Had to return my drink because it tasted like a tequila water ($12 a drink?) and he defensively responded \"yeah the mix makes it taste like that\" - well why do you sell it then? Also, the side of guac we ordered for $8 was maybe 3 tablespoons with a whole ton of chips piled on top to disguise the lack of guacamole in the bowl. To finally top the cherry off, I asked for a frozen margarita when I saw the (non) bartender pour one for  a man before me and when I asked he rudely threw his hands up and screamed \"we don't have any!\" Hm. \n\nI am shocked by the lack of respect for this business' customers. I will not be returning and I truly hope management makes some changes.", "author": "Andrea R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-17", "description": "While searching yelp, Taco Dumbo caught my attention being that it was \"New and Hot\" and the pictures/reviews looked promising. Decor and vibe of the atmosphere was good but the food was not as expected and disappointing. We got 2 salmon bowls and 2 chickens tacos with a side of brown rice. Salmon Rice bowl comes with a side of dressing/sauce it was okay, they will charge $1 for extra sauce. My raw salmon was cold and tasted somewhat frozen. We did not enjoy our meal and will not be a returning customer.", "author": "S L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-03", "description": "Best tacos in Brooklyn\nAnd very healthy options \nTry the tacos in the lettuce wrap and the custom margaritas are amazing \nAlso did a catering order for my company and they did a bang up Job.", "author": "Jon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "Great food, great staff. Found this place just walking around Dumbo and loved it. Great margaritas too! Try the tuna tacos they are awesome.", "author": "Konstantin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "The most amazing tacos I've ever had- and they're completely vegan, too! Everything was perfectly flavored, melt-in-your-mouth, delicious, and plant-based. \n\nI had the cauliflower taco and \"impossible beef\" taco and absolutely loved them. I also an apple-ginger juice that was amazing.\n\nPrices are really reasonable for food- the most expensive things are the juices and mimosas. I'm so happy I found this place- I'll definitely be back.", "author": "A J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "Wow!!! Is all I can say. \n\nJust left and to be honest it's slightly embarrassing but we were actually just looking for a restroom from all the walking we did from our Brooklyn bridge adventure. So not trying to be inconsiderate to the establishment, we ordered something small. The chicken taco was $4. \n\nBeautiful gender neutral bathroom btw, and they brought the food right to us while we sat waiting at the bar. \n\nThe taco was packed for only $4!!! Pickled onions, braised chicken seasoned to perfection! And there wasn't much to it but it was sooo good. I almost didn't want it to be over! And we thought thank god it was the only place still open to use the restroom!! Dairy free, gluten free, organic .... what more could we ask for!?!?! Such a good find! \n\nLater someone introduced us to staying connected with Facebook, email, and IG. YES I HAVE them on all now. And you should MOST DEF check it out to!We will be back soon. It was such a chill relaxing location. And I was also informed that they are opening a location in midtown soon so keep you eyes peeled. This place is going to soar.  I guess you can calll me a taco connoisseur. I was just telling my boyfriend how much i miss my taco spot i use to go to in Florida (taco craft) and no other place can compare (I've really tried just about everywhere and so many places are \" just okay or good\" but this was great. I finally found a taco place that reminded me of back home and I can honestly say I've finally made ny my home now.", "author": "Steph S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-20", "description": "I really enjoyed my experience at Taco Dumbo. I ordered three tacos through Allset and they were all delicious! Loved the unique options like cauliflower and the ability to have the tacos on greens instead of tortillas. The service was great. Only gave it four stars because the tables were a little wobbly and it is on the pricey side.", "author": "Holly L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-28", "description": "Upon walking in There was a worker standing there but he didn't greet me coming in and sort of had a attitude (he was behind the bar).  My table still had bits of food on it - 1 star\n\nI had their Chicken Tacos with the corn tortillas. it was good and stuffed which i appreciated. Not much seasoning but it was still good. The place is cozy and pretty clean.I will go back and check them out again", "author": "Justina A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-17", "description": "The food is tasty, but it's so overpriced and tries so hard to be a hipster cool place that it's kind of cringy. It's a touristy area, so I guess it makes sense that they do that (plus, they're right next door to Etsy, so what do you expect), but I think there are better options available for lunch that don't come off as so pretentious and trying so hard.", "author": "Nicole O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "I really really really like this place! Came here after yoga and love all the healthy vegan options. I ordered the cauliflower tacos and they were so delicious- I couldn't believe it. Also ordered the guacamole with chicken skin and broccoli- also good.  \n\nMy favorite was that you could custom make your margarita and they has so many great options to do this.\n\nTo top it all off, it was super friendly service and a reasonable price. Definitely come back again as an after-yoga treat. Thumbs up.", "author": "Kimi I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-04", "description": "Taco Dumbo is not your traditional taqueria as they put a twist on the popular food and focus more on the light, fresh and healthy aspect of tacos and also offer salad/rice bowls. People love those fresh, non-GMO, gluten-free labels. Unfortunately, it comes with a price tag and a sacrifice in quantity.  \n\nI ordered the salmon Nori Tacos (which are essentially unwrapped handrolls sitting on taco holders) and they were solid and super light but also very small.  I also got the chicken \"tinga\" and the maple chipotle tofu tacos which were nothing amazing.  I know I can eat more than the average person, but when I can easily chow down 4 slices of Grimaldi's after a $20 meal, something ain't right.  Maybe the tacos being gluten free had something to do with it?\n\nDespite the small portions, and mediocre taste, the restaurant makes up for it with its aesthetically pleasing interior.  The restaurant has a California/west coast/beach theme with its warm and bright decor which makes it very inviting and is actually hella cool...bro.  Grade A dank bathroom. Also, keep in mind, it's not a sit-down restaurant. You just order at the counter and pick up your food when they call your name.  \n\nOne more IMPORTANT note. Not sure if this was only a temporary thing but they did NOT accept CASH which was quite odd.  I know many people use credit card now but where am I gonna spend my dollar bills now? This place has potential and has a great vibe but the food is average at best and the portions are small. Can we get some animal style tacos?", "author": "Wilson C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-24", "description": "Mistakenly came in and it was like trying to find Mexican food inside a West Elm store. Nice staff, generous with the arugula, but I am taco dumbo.", "author": "Jia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "Taco Dumbo is great! They play fun music and the restaurant is very modern. Three salmon tacos for $9 plus a great guac dip. Would definitely recommend if you're in DUMBO", "author": "Daniel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "This place is so true to it's name. A real Brooklyn (and to be more specific Dumbo) feel, which makes Mexican food hip. We're usually no the greatest admirers of Mexican food, but the modern twist added here takes it to a great place. Loved the chicken taco salad, the beef,and the cauliflower tacos. It's also a great place for a mixed crowd of carnivores + vegetarians.", "author": "A R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-16", "description": "Two words: overpriced and subpar. It's trying to mimic Pokeworks but failed. Nice decor but you come here to eat and the quality of food is pretty bad. I got the rice bowl and the fish was frozen. You can taste it was just thawed.\n\nAlso they give you very little sauce. I asked for extra sauce and they wanted to charge a $1. Complete rip off.", "author": "Na S."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Taco Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "56 Prospect St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/fJAcxMsY1cQBXlSq7s5M1w/ls.jpg", "@type": "Restaurant", "telephone": "+13472020306"}