{"aggregateRating": {"reviewCount": 145, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-13", "description": "Taco Dumbo is super hip, maybe to a fault. You can get things like nori tacos. And they have a juice bar. And the place is super clean with cool lighting fixtures, and a wooden surfboard-esque table in the middle.\n\nService took a little bit of time, between lots of people waiting for their lunch orders and some deliveries going out.\n\nI got the spicy tuna nori \"tacos\" (raw fish in seaweed). Sucks that you can't mix and match (I asked) because I wanted to try the salmon too. Oh well. The fish portions were good (enough for every bite), though it was a bit awkward trying to eat flaccid seaweed that doesn't exactly tear when you bite down. The chipotle mayo sauce was good though.\n\nI also got a $4 rotisserie chicken tinga taco, which I liked. Pretty standard. Will probably just do tacos or a bowl next time.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "I eat here about once a week because i work close by. But the proximity is not the main reason I'm a regular. \nIt's the only place in the neighborhood that I LOVE. I follow a keto diet so this is a bit of heaven for me. I usually order guacamole with chicken skins and pepitas, cauliflower tacos on lettuce, the Caesar salad (perfect, it even has nutritional yeast in it for my b vits!) . I can see it's not for everyone but for health-obsessed like me it's peeeerfect", "author": "Alina V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-30", "description": "When in doubt, order nori spicy tuna tacos and frozen margarita. The chips and guac with pomegranate and chicken skin is AMAZING! The interior design gives beachy vibe and the staffs are great. The food don't take that long to come out but the portion is tiny. I tried my friend's tacos and they are OK, don't set your expectation too high and you will enjoy the place more.", "author": "Sammy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "This place was so good and refreshing after a walk across the Brooklyn bridge. The waitress/cashier was very nice and made a fantastic recommendation. The frozen margarita and taco at happy hour was a nice deal. The decoration and music made for a great ambiance.", "author": "Tyler S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Waiters are really friendly. Nice songs (reggae music). Good food. The place is really nice and clean. Its a cool place to go with friends.", "author": "Cristine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-15", "description": "I came here for dinner on a Wednesday night since I was in the area.  The place was in an area of DUMBO I have never ventured to.  I looked on Yelp and found this place so I decided to check it out.  The place was pretty casual - you order at the cashier and then pick up from the counter when they call your name.  The atmosphere has a beach vibe with a communal table made out of a surfboard which was cute.  They actually have a lot of vegan and gluten free options for a taco place.  I ordered the spicy tuna nori taco and the rotisserie chicken tinga taco on a corn tortilla.  It was happy hour until 8pm so the Casamingos margaritas were half off.  You can pick your choice of liquor, cold pressed juice, and rim flavor.  I chose Casamingos blanco, watermelon/lime juice, and hibiscus rim.  The spicy tuna nori taco was quite small but there was a decent amount of tuna.  It was a bit difficult to eat since nori doesn't break apart that easily. The chicken taco had a good amount of chicken and the salsa verde went well with it.  The corn tortilla tasted a bit stale though.  The margarita was delicious and quite strong.  I've never had a pressed juice margarita - definitely makes it more refreshing.  I also like that you can customize a margarita with different juice flavors, rim flavors, and alcohol.  The food and drink were on the pricier side but it's a good deal if you come during happy hour.", "author": "Julie Ying X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-02", "description": "Friendly but slow service. Went for happy hour. Not that busy. 6 people at bar. Restaurant 2/3 full. Bartender was really slow.Silly system where you order from counter then go to bar and wait. And wait. 20 min for chips and salsa. 25 min for drinks. One was a pre-made frozen margarita. Delicious mini tacos came 5 min later. Apologetic food runner blamed it on lack of serving trays for mini tacos. Really? Too much plastic for salsas. We would have ordered more drinks but going back to counter and ordering and then waiting at bar for another 25 minutes seemed too much. We tipped at counter. Didn't tip bartender because we had no cash. Weird system. Cute place and cute crowd.", "author": "Bob M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-21", "description": "Been here after work and during the busy lunch hours of the weekday. It actually want busy during the weekday; oh wait, yes there was!  A cool taco spot in the middle of Dumbo full of language barrier folks hungry for good food, aka Tourist.  That's a joke for my New Yorkers! Lol, however, let's get back to the food and decor.  The decor is decorative in a way that alludes to downtown BK.  The food reminds me of a North American style of a taco compared to the traditional Mexican taco.  That doesn't take away from the taste value of the food.  I forgot which taco I had, but this place in which have tasty alcoholic and non-alcoholic drinks, also the taco of which I forgot I had was good.  I give this place 3 starts out of 5 because the crowd on a typical lunch and after work day is a tourist gem, but it gets 3 stars cuz I can get a drink on my lunch break (shhh, don't tell nobody) and I can get a taco and nice drink after work chatting it up with some of the buddies.", "author": "Stevie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "I freaking love this place. The food is delicious, fresh, healthy. If you haven't tried cauliflower tacos in your life yet DO IT. I'm not a vegetarian and I am here to tell you they are DELISH. The main reason why I love them though is because of the FRIENDLINESS and absolutely stellar customer service of the STAFF! Their shirts say \"Vibe = Tribe\" and this vibe/tribe is literally 75% of the reason why I go here. Kudos to the hiring manager/company - they're doing something right. Drinks are divine as well!", "author": "Liz W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "Awesome place- Tacos awesome- Miles went the extra mile to ensure an extraordinary  experience. Cocktails unique and amazing", "author": "Kathleen G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "Taco Dumbo\nNY BK Dumbo\n3pm Wednesday 24th May 2017\nFive Stars\n\n\nIt's Taco Time. This place is not cheap but it's quite reasonable. I ordered way too much food but I have not had a food belly in a while so whatever. I had a 2 Pacifico Beers, Three Tacos, a Quinoa Bowl, a chicken tortilla soup and Guacamole with crispy chicken skin and broccoli. \n\nIt's not really Mexican food but modern health food with a south of the border twist. They have sushi nori Tacos which I tried a bite and it was delicious. My tacos were big, juicy, and packed with flavors. The soup was rich and hearty but the tortilla chips inside were soggy. The bowl was too healthy for my tastes. \n\nThe star of the show was the Guacamole along with purple corn tortilla chips, you can dip a piece of chicken skin into some fatty avocado dip!!!\n\n\nDelicious!", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Damn this place is good! I just finished my first dish/rice bowl with tuna from there and couldn't wait to write a review. Really flavorful, loved the sauces each side was marinated in, super fresh! I don't even eat broccoli and I just had it for the first time Bc it looked so good. Def try this place!", "author": "SM V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Holy $\u0026@! !! This the best ever. Came here for the \" \"Impossible Taco\" and FTLOG now ya'll can go Vegan a little... we were served by Deshawn and Juan. They were super professional and friendly, as was the rest if the staff!! MUST TRY!", "author": "James O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "Loved the decor as soon as we walked in.  Has such a cool vibe about it. Took a minute to figure out what we wanted, loved all the options both for meat eaters and vegetarians. I loved the margarita options with the fresh juices, this is something that I have not seen before.  The only thing that I did not like was no waiter service. The only downside but that will not discourage me from coming back..", "author": "Olga K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-14", "description": "My boyfriends wanted to check this place out so we finally stopped by. \n\nInterior was super cute and hip, of course since it's in Dumbo. For a casual restaurant, it was decorated really well. There's a bar area, tables, high tables/chairs and an ordering area. They also bring you your food! That was a nice surprise. \n\nFood tasted like extremely healthy Mexican food. Definitely not your traditional type of tacos/bowls but I really enjoyed it. We ordered the nori salmon tacos ($9) which came with a serving of three, and is actually made using seaweed as the taco shell. A little difficult to eat, but still really good and healthier. We also ordered the braised short rib bowl ($12) which came with a lot of meat and was very filling. \n\nThe prices are fairly standard for this area but still kind of pricey overall. I personally loved this place because everything had a lot of flavor and tasted extremely healthy. Will be back for more!", "author": "Joanna T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-10", "description": "Do NOT order delivery from them. They regularly leave out the guacamole that you pay $2 for and always mess up when you do group orders, leaving out items and getting the meat wrong. So overpriced and overrated for the quality. Get it together!!", "author": "Sandra K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Anaya and the staff is incredible! My friend and I went to eat there for the first time yesterday afternoon and we couldn't believe how friendly and attending the staff was. The food and drinks were get as well! I love the lemon/cayenne margarita, it was delicious. We are really glad we tried this place out and will 100% go again.", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-11", "description": "The prices have gone up and I'm very upset about this. The quantity sizes have decreased. I'm over this place and Mulberry across is going to be a hit!", "author": "Namrata A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-29", "description": "Very good concept.. but the food and price don't hold up. The three times I bought lunch there, the fish was always stringy and chewy.  They claim to carry \"sushi grade\" fish, but I don't believe it. \n\nAlso, the place is \"cashless\", which sends a divisive message to some folks that \"your money is no good here\"... this is an unwelcoming message.", "author": "John C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-21", "description": "Two choices of fish tacos: spicy tuna or wild salmon. I'm not a fan of spicy tuna because I don't like mayo or very spicy foods, so I decided to go with the wild salmon -- and didn't read the description. \n\nMistake.  \n\nIt is salmon drenched with spicy mayo sauce. Then, why not call it spicy salmon?\n\nThe guac and chips were good.", "author": "Kat J."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Taco Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "56 Prospect St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/fJAcxMsY1cQBXlSq7s5M1w/ls.jpg", "@type": "Restaurant", "telephone": "+13472020306"}