{"aggregateRating": {"reviewCount": 145, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-03", "description": "The customer service is amazing! Their happy hour drinks are strong and tasty! If you love vegan food this is the place to go! Everything is vegan", "author": "Nick S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-21", "description": "While walking around DUMBO I worked up an appetite, so I start searching yelp for somewhere near by. This place seemed to have great reviews, and of course I can always eat some Tex mex, so we decided to give it a go. \nThe guy that was taking our order seemed so bothered that we were there and he had to lift a finger.\n I ordered the chicken tacos with a water and my husband had a beer with tacos as well. \nFood comes, looks pretty appetizing, so we start digging in. EW, my chicken still had FEATHERS ON IT. I am sorry but that is a no no no...I couldn't even eat my food, and felt sick after eating a few bites. \nIf you are in the area avoid this place, they clearly do not care for their customers or about the food the serve.", "author": "Kami Lynn W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-02", "description": "I went here last night with some friends for food and drinks. The food was pretty good and workers here are the sweetest people. A chick with dope braids and a guy with a nose ring helped me out. They were both super nice and accommodating.\n\nfood \n8/10\nservice 10/10", "author": "Brookie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-09", "description": "Me and a friend attended an event near and decided to stop for a drink before the event. We both had the frozen marguerita. It was heaven on a hot day! The restaurant is beautifully decorated but it was empty. The bartender/cashier was very sweet. The place looks impeccable. Hopefully we will return to try their food.", "author": "Michelle P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-27", "description": "SO many vegan options! A bit expensive but not as bad as some other places i've been to. Very loud music made it difficult to talk with my friends, but we had a great time, food came out very quickly, and it WAS INCREDIBLE. small portion sizes make so you can try a lot of things.", "author": "Tess M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-26", "description": "Alright. I got the rotisserie chicken and the chicken itself was very fresh. The salsas were not great because they didn't taste fresh or spicy. Unfortunate.", "author": "Meghan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Super cool place in Dumbo! If you're around this area don't miss it. \n\nMy favorites here are the guacamole with the spicy pepitas (pumpkin seeds) and the pomegranate seeds. \n\nAs my main dish I ordered the Nori tacos with spicy tuna. And they (3 per order) were mind/stomach blowing!! Delish! The ambiance is very cool, service was very fast and friendly! \n\nGood experience! I'll be back for the margaritas, cheers!!", "author": "Pierina Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-11", "description": "I order from here all the time because they deliver to my office and have vegan options. The food is good, tho pricey. I know vegan food tends to add up--I mean, I've been vegan for over 20 years and I can't tell you the amount I've paid just to not have black coffee--but $7 crabless tacos and $5 impossible crumble tacos is still a bit much... but the real gag is the guacamole. \nNever! Never, ever -ever! Never, ever, get the extra guacamole. Don't get me wrong, issa good guacamole, but it's an extra $2 for a salad-dressing amount! Like, half the amount that Chipotle gives you but for twice the price. \n\nFoods great, price is less than great; so, less than 5 stars.", "author": "Brad S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-20", "description": "I loved the vibe of the restaurant. It was clean, had some unique furniture like a floor couch and a surfboard table. Cool colors and wallpapering. Staff was very chill and real.\n\nThe food wasn't great. The sushi nori tacos were cute but the \"sushi grade\" fish was not fresh. I also tried the grain bowl. It was a very filling portion but even though I asked for extra sauce (whether they remembered to put it on or not), it was very dry. It definitely needed more sauce to bind it all together. The Mexican street corn ($5) and cold pressed juices ($7) are in tiny portions. I thought the Mexican corn would be like elote but it's actually grilled corn kernels mixed with very lightly with mayo and dusted with a yellow, smokey spice. I tried the apple/cayenne juice and it had a huge kick to it.\n\nThe joint can work on bettering the quality of their food and maybe add  more protein options.", "author": "Katherine C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-24", "description": "We came as a group of 10 for a quick bite and drinks. They were out of nearly half the menu items or crucial items for dishes, which made ordering complicated as their menu is short and not very all-encompassing. The bartender was extremely slow (making one drink at a time, and walking that drink to tables before making another) and unfriendly to boot. I went in wanting to love the place - it's cute and hip, and has plenty of vegetarian options for me, and is just casual enough...but overall it fell flat.", "author": "Bianca M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-20", "description": "Decor and service were good at this location. The guy taking our order was real chill and helped with all the questions we had about the food, seeing as how this was our first time here.\n\nWas looking forward to the Nori tacos and upon trying both the salmon and tuna, I'm a bit disappointed in how underwhelming they were. They were small and the seaweed made it difficult to eat because of it's unwillingness to be able to be chewed apart. The fish wasn't as fresh as I'd hoped it to be and whatever they mixed it with made it wayyy too spicy for my taste. My girlfriend's bowl was dry and barely had any sauce in it for additional flavoring to the already bland taste of the meat.", "author": "Bryant K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "The food was delicious but it was a little strange when we first arrived. There was one paper menu to look at, at the counter and we weren't really greeted. This establishment is also cashless - which wasn't a huge deal but was thrown off when the cashier mentioned it to me. \n\nAnyway, I ended up ordering the sweet corn tamale and was not disappointed! I think it's great for vegan options in the DUMBO area.", "author": "Taylor H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-02", "description": "really bland food and watered down drinks :C \n\ndid they even cook the rice all the way through?", "author": "Encore M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-08", "description": "I have been to this place quite a few times for lunch since I work in the area. The food is good but it is a bit expensive for what you get. The reason why I am giving it two stars is because of the amount of plastic they use to give you the tacos to go. I ordered four tacos and ended up with six plastic containers: three for the tacos and three for the sauces all of which you end up throwing away. I find it an irresponsible behavior in 2019 given all the trash and plastic problems we are dealing with.", "author": "Cosimo M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "Great flavors in all the food and drinks. Good tunes at the right volume. Awesome happy hour specials on both food and drink.", "author": "M D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-31", "description": "PRICEY for what you get. This place is only good for a small niche of people. VERY hipster, but we did try a few things.\nCauliflower taco, $4, tiny, very healthy, tasted OK.\nBraised Beef Grain Bowl, $13, pretty good.\nGuac with corn and chicken skin, $8, best thing on the table.\nBasically, unless you're on some type of diet, go somewhere else.", "author": "Crystal B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-18", "description": "Tacos weren't that great especially at the price point there asking for. \n\nService was nice but nothing above mediocre. The ambience is clean and modern but not original.", "author": "Andrew J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-13", "description": "Impossible taco is great and the staff are always extremely friendly. TIP FOR MANAGER-- Please fix the front door, it closes extremely slowly and it's 25° outside. Everyone put their coats on before they were finished eating.", "author": "Kim S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "They have a nice decor inside and also nice tacos so yeah I'm a fan lol\n\nInterior: Nice setting, has a very cool breezy environment. Staff was super friendly and nice.\n\nFood: Nori Tacos (3): I had the wild salmon. It was dope, so good and love the sauce they put on it. Its not the best tacos you got but from what I expected it be it was delicious. Price is high because of the area.\n\nOverall: Good spot to check out.", "author": "Andy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "Second time at Taco Dumbo so now I can give a thorough review. Frozen Margarita was excellent. Chicken tinga tacos are superb (highly recommend), so is the sushi taco. Also get the chips and guac with pomegranate and chicken skin. It's to die for. Christian is super awesome and friendly. The guy that was at the bar (don't recall his name, but he has a beard) was friendly and took care of me and my friend. Excellent food. Excellent service.", "author": "Stephanie J."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Taco Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "56 Prospect St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/fJAcxMsY1cQBXlSq7s5M1w/ls.jpg", "@type": "Restaurant", "telephone": "+13472020306"}