{"aggregateRating": {"reviewCount": 145, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-15", "description": "Taco Dumbo is delish! I live in Texas so I'm weary of eating tacos outside of the state. I tried the chicken tinga and they were good. The guacamole and tortilla chips are very authentic. I tried two different juices there and they were so refreshing. This is my second visit to the Dumbo area (last time was last year) and I made sure to make my way back to this place! Awesome ambience and friendly staff!", "author": "M B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-09", "description": "If you want a hearty and flavorful salad, go to Taco Dumbo. You'll feel healthy and full. The seating is limited, but most people take their food to go.", "author": "Laurisha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "Everything is fresh, delicious, colorful and creative. 5/5 would take a 45 min train for this again", "author": "Anna G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-22", "description": "Wow this place was asweome!\nThe boyfriend was a bit hesitant to try cuz he's vegetarian. But we glances at their menu and they had plants of vegan and vegetarian choices. \nI've actually been craving rice balls and this place randomly hit the spot. I had the nori spicy tuna (raw) taco. Omg. Idk why I didn't expect the tortilla part to not be a piece of seeweed but it was. Made it a bit messy so kinda wish they gave me extra napkins. But I'm also a notoriously messy eater.  either way that taco was AMAZING. The bf got a bowl and he complained it was a bit spicy but otherwise delicious. The vegan chorizo hit the spot for him too. \nWe also got drinks. We opted for the make your own margarita. So the guy serving obviously isn't a bartender but he was a good sport so we weren't put off at all. I made mine tequila blanco with strawberry apple juice and a hibiscus rim. And i swear I better have all my margaritas with a hibiscus rim cuz it it's delicious. And it went EXTREMELY well with the raw fish. Like I never understood food pairings until this place. \n\nOh a word about the tequila. So I've never heard of casamigos until they got sold off for that ridiculous sum of money. But this place seems to be really invested with (or by?) them cuz they had so many casamigos branded items and their colour scheme was actually the same shade of pretty teal. And I mean the colour is really nice so I ain't complaining and the tequila was good. \nOver all this place was great! Sucks they close a bit early but I guess they mostly rely on the tech community inhabiting the nearby buildings.", "author": "Crystal M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Who doesn't love vegan taco options and frozen margaritas?? This place is the perfect get-away reality with its tropical decor, amazingly kind staff, and good food and drinks to seal the deal. They have a big table right in front of the bar that accommodates groups of people, as well as more intimate one-on-one tables. Lunch or dinner this is the place to be!", "author": "Sunny M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-02", "description": "Taco Dumbo is a newer taco joint in DUMBO - good to sit down or take away. Its got a handful of booths, a long, communal table, a few seats at the window \u0026 then bar seating. Been there twice now - everything is super fresh and has lots of great flavor. One thing that seriously differentiates this place is their 'make your own margarita', wall. Pretty great idea! You choose your own tequila, next, your flavor, then, whatever it is you'd like on the rim. Everything's listed on a big board next to the bar. Might be a tad pricey for a great quality taco spot, but well worth it. \n\nPro tip: GET THE GUAC.", "author": "Tara C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-10", "description": "I like the ambiance of the restaurant good music and decor and the margaritas were tasty. I'm not vegan or close to it and didn't know that this place was when yelping spots near Brooklyn bridge. I tried the chicken tacos because there wasn't too many options for meat eaters and the tacos lacked flavor. Ordered an elote which I sent back once I found out it was served cold. I wouldn't return here.", "author": "Delightful D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "These tacos are legit. Ordered two chicken to go. The slaw was creamy and crunchy, salsa was unique, even the tortilla was special. If I had more time I would have stayed for a margarita. The menu looked out of this world. Only bummer was I paid for a side of guac and it never made it to my to-go bag which I discovered about half way back to CT:/", "author": "Kerry M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Absolutely delicious and for a great price! I ordered three wild salmon fish tacos for $9 and they were HEAVENLY! We also got some blue corn chips with super yummy guac.i also just really like the laid back atmosphere. Will definitely be back.", "author": "Mary H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "Solid food, a bit pricey. Ordered the grain bowl with a side of guac. For $2 side or guacamole, I'd say you can skip it based on the quantity (the guac itself is good, but it's no Chipotle-size serving). The grain bowl is tasty and also seems healthy, my only comment is that it says it comes with heirloom tomatoes, but I'm pretty sure they're just normal cherry tomatoes.", "author": "Andrea C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "Everything is like WOW! I love love love this place! We sampled all of the taco dishes including the fried chicken skin and chips with guacamole. The beef spare ribs and chicken tacos were off the charts!! Loved the sushi tacos too! Best of all, it is all organically fresh food with no dairy or hormones. Margaritas, Oh my! Nuff said. Run don't walk to this place.  Cheers!", "author": "Angelica B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "Where to even begin - these people saved us last week! Service + Food = Beyond incredible. \nWe needed a last minute large catering order, and not only did they make it on the spot for us, they were so patient and kind, even offering to have one of their guys help me walk it to our office. \n\nThe tacos were so delicious that our large event order was gone in 30 minutes, causing us to have to call again for a backup order. Reiterating just how amazing Taco Dumbo was all around. They were so kind and repeated the process for us again. \n\nEveryone raved about the tacos. Would recommend for catering ( be kind and make sure to not be like us \u0026 order ahead of time - see online for options ) But would also highly recommend if you need a Client Lunch in Dumbo or catchup meal with a friend. \n\nTaco Dumbo is our herooo!\nps - i bet those margaritas are A++", "author": "Nina F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-08", "description": "So we ordered for an office lunch and it was just horrible. The smell of the food was off putting.  Chicken taco had a bone in it... a bone ! It's not authentic Mexican more like California vegan/Mexican alternative.  Just not a place we would order from again.  On the bright side delivery was on point and everything was set up nicely just wish it tasted better", "author": "Stephenie O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "This is a really good spot for healthy affordable food in Dumbo. They have a great variety of vegan options which is a big plus for me at restaurants. The music and ambience feels like a surf shop in Hawaii, nice escape in Dumbo. Oh let's talk drinks.. they have cold press juices which you can have as is or you can build your own margarita. Taco Tuesday $6 margaritas and $4 beer and Happy hour from 5-8pm is a also a weekly thing.", "author": "Kristell C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "The worst customer service I have ever experienced. Waited 30 minutes for a margarita. Asked the waitress and received a RUDE response as if she (Brianna) was too busy. The restaurant had less than 10 people. I finished my meal and sat and waited another 10 minutes for the margarita. Not just terrible service but RUDE service. Not okay. I will not be returning. Also the margaritas are NOT good. Not worth $12, even if I did receive the drink in a decent amount of time.", "author": "Angela W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Great food, fresh concept. Would rather spend my money here than at chipotle, Panera or any other basic coffee/bagel/cafe.", "author": "John W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-01", "description": "I went here with my coworkers for lunch and got a salmon rice bowl, which was basically a Hawaiian poke bowl. I was pretty excited at first especially because there wasn't any sort of fish based bowl restaurants in Dumbo, but I was quickly disappointed. Upon looking at my bowl, I realized how chunky all the ingredients were. They called the fish sushi grade, but it was nothing of the sort. The salmon that I had a bitter aftertaste and had too much of a chewy texture. The broccoli was too salty, as well. I felt like my taste buds were on a roller coaster, but the bad kind and thus I wasn't too happy with my experience here. I was refraining from typing a review up, but some of my coworkers had mixed reviews too. Felt like the owners of the restaurant could put some more care and thought into preparing their food. :/", "author": "Sean C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-15", "description": "I got the chicken tacos and the chicken had no flavor. This place looked so nice and an alternative to other Mexican places for lunch. Will not return", "author": "Mitalee D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-30", "description": "The Tacos here are amazing! And everything is super fresh and heralthy.\nI came in the evening and they had $7 Margaritas that are made with cold pressed juices and Casamigos!!!!", "author": "Jamey A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "Stumbled upon this place after walking the Brooklyn Bridge and boy am I glad. \nSuper friendly staff and amazing food. I had the Taco Salad and it was mouth watering. Love the neighborhood. Wish we lived closer but driving from Miami to Dumbo would be a drive but worth it!\nSuper super yummy!", "author": "Raven G."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "Taco Dumbo", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "56 Prospect St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/fJAcxMsY1cQBXlSq7s5M1w/ls.jpg", "@type": "Restaurant", "telephone": "+13472020306"}