{"aggregateRating": {"reviewCount": 220, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "Friendly mom and pop shop with excellently prepared tasty food! And at reasonable prices!!What more do you want?", "author": "Bora Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-24", "description": "Best falafel around. So fresh and inexpensive. Pita bread holds up well. Highly recommend!!", "author": "Sheila F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-18", "description": "On my endless search to discover ALL the best Falafel and Shawarma in my area(Brooklyn Heights-Cobble Hill), I LOVE when I find another treasure among the gentrified labyrinth that is old Brooklyn. So I ordered a chicken shawarma for my first visit. $6 after tax. It was LOADED with spiced chicken and accompanied by fresh veggies and seasoned tomato mixture. Then I performed the ultimate(OK, its not THAT ultimate, its pretty basic) test of running home with my hot little pita. 10 min later, and about a mile and.........it has SURVIVED a turbulent run and the pita integrity with two sauces within the meat pocket. This is NO easy feat, and I commend the chefs and the pita quality for ensuring a safe and delish resolution. Also, the lady at the counter was super nice. Bonus.\n\nI will update my review once I've tried the falafel, but this wonderful lil chicky shawarma has tapped into my heart and soul. So happy to have found this spot.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-18", "description": "Great food and great service. I come here for dinner 3-4 times a week and always go for the grilled chicken plate wich is amazing.\nGood and healthy food , i even lost 7 pounds after i started coming here!", "author": "Sam V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-23", "description": "Stopped by at Heights Falafel when I was in Brooklyn. It was an excellent choice. \nYou just have to try the kafta... it is soo delicious!!!\nNice place, clean and friendly owners.\nHighly recommended!!!", "author": "Riza B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "I love this little hole in the wall. I've been coming here since I was in high school, and I'm always happy to stop by and bring a friend or two (really, it's quite small, I wouldn't bring more than three people with you at the most, if you plan to sit). The television's always on, but rarely in the times that I've stopped by has the volume been up too high, so conversation can flow freely and you can always refer to whatever seemingly out of place images and commercials pop up. \n\nThe guys behind the counter are funny and friendly, and I always feel welcome and seen, which I think is important for good customer service, especially in such a small shop. The food is good, the price is crazy affordable (especially in Brooklyn Heights!!!), and the portions are awesome! I really love this spot and hope it'll be a staple in this neighborhood for years to come.", "author": "Shazi L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "This place is so legit Yelp doesn't believe they can have this many good reviews and filters so many out.\n\nIt was super inexpensive and just absolutely amazing in serving size and flavor. My friend and I came in the morning and we got to watch the owner make our food. He's such a humble man and knows how to make amazing food as well", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "I have never written a Yelp review in my life but I love this place so much that it compelled me to break my Yelp silence. This place has amazing falafel at an amazing price (esp for Brooklyn Heights) AND the owner is so kind. The first time I came here he welcomed me to the neighborhood and I've been a regular ever since. Truly a gem in this city, go here if you find yourself in the area.", "author": "Emily K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Please understand: this is one of the greatest Middle Eastern spots you're going to find in America. I've just written a book about the region, after traveling from Syria to Iraq to Afghanistan to Yemen (not for the sake of falafel comparisons per se, although that was definitely a side perk) -- and I can tell you that this place has in its heart the very best parts of it all, in hospitality and in hot sauce, in adherence to classic recipes, and in their commitment to balancing flavors like Philippe Petit on a highwire.\n\nGet anything as a salad or as a sandwich: get eggplant or moussaka, kibbe or kufta. The harisa (hot sauce) is perfect.  The spinach pies are phenomenal when hot, and kind of amazing with the yogurt dip (like tzatziki) they also make (incredibly generous, affordable prices and super easy to take out).  The grape leaves are perfect. The eggplant is perfect.  The chefs (from Morocco and Syria) are unfathomably kind.\n\nYesterday I met the cook Samira, from Latakia in northern Syria, and she beams with the kind of smile that says: I have cooked all this for 75 years, and dammit I know what's good. \n\nI have waded through the \"Mexiki\" shawarma in Abu Dhabi and the dry ta'amiya in Egypt. I have been to Mamoun's in New York and Mamoun's in New Haven.  And I can tell you: Heights Falafel is a hidden gem.  And it's cheap. And I've never even had their baklava.", "author": "Adam V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-16", "description": "Food is OK and I would have given 3 stars but the guy at the counter made me never want to return to this place.\n\nPrice listed for sandwich $5.75, when my guy hands me my sandwich he says it is $6.25. I mention it says different right above my head and he says \"well you'll know next time\". Wow. There won't be a next time bud, you can keep your mediocre food and I'll go to the food cart that gives me more food for less money and more importantly a little respect. For $0.50 you could have been a tad nicer.", "author": "Mike L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "I came here looking for some cheap vegan grub. I was not disappointed! Falafel combo (with grape leaves, tabouli salad, and hummus) on a pita for $5+tax was awesome! Stuffed full of hot falafel, I'd say ask for tahini and hot sauce next time.", "author": "Christian W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-24", "description": "First things first the owners are so nice and funny! That's probably why the food is so good. My friends and I had the falafel plate, chicken shawarma plate, and babaghanouj on the side. Each of the plates had yellow rice, salad, and hummus. All of the flavors were so fresh and connected well together. It's also a lot of food for the price and make sure to ask for white sauce and hot sauce when you order. \n\nThe place itself is quite small which makes it feel cozy and combined with the old school caring service, it's as if having a home cooked meal.", "author": "Pallabi M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-28", "description": "The food is fresh and delicious, the owner is super nice and friendly, this is a must try place if you go to Brooklyn! It is small, but very welcoming, warm and personable, while in the big, crowded city of New York.", "author": "Ionut P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "Generous portions, friendly staff, super convenient and very tasty!", "author": "Mary L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "Great flavors in everything! I like the shwarma platter and the baklava is delicious!", "author": "Spencer T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-25", "description": "Very, very good falafel and shwarma and even better at this price. Each is about $5. The brightest spot is the \"white sauce\" which is extremely flavorful, unlike most white sauce you will find with street carts. The meat is also just salty enough to combine with the sauce.\n\nAmazing for what it is.", "author": "Timothy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Great authentic middle eastern food !\nGreat price for amount and quality .. i go whenever i am working in the neighborhood.", "author": "Felice D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "Kefta sandwich is great, but make sure to say yes when they ask if you want tahini (sesame dressing; otherwise can be a little dry). Owner explained he trims the fat from the lamb and makes sure to use very lean, fresh meat. It tastes true! I was not impressed with the shawarma, but I don't like the chopped meat style of shawarma that I have seen in a few places now. Hummus is good. My gf liked the falafel; I tried it but I'm not a falafel connoisseur so can't chime in. Items in the glass case look mouthwatering, but I usually end up going here because of a kefta craving. Make sure you eat in; sandwich will not travel. Perhaps the over rice version would travel better. Oh as for decor and service: the place is nothing special, tight (but comfortable) seating, no bathroom, but at least you know your money is going into the ingredients and not expensive decor. Food takes 5-7 minutes to cook, depending on what you are getting. Very reasonably priced.", "author": "Omar H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-05", "description": "This is my go-to lunch place (sometimes dinner place) in Brooklyn Heights.  So reasonably priced and everything is always delicious.  My favorite is their spinach pie.  Small, family owned...very friendly and highly recommended!", "author": "Irene L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-09", "description": "This place is really tasty and very affordable. Try the beef shawarma plate, and make sure you're hungry before you get it because it's really big!", "author": "Parker A."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Heights Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3Nb4x2k83_T4xVljsYp1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184880808"}