{"aggregateRating": {"reviewCount": 220, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-15", "description": "Wow wow wow!! First, I'm extremely picky with my Mediterranean food; Not only was the food amazing and fresh, the price is super reasonable and Jamal prides his service on \"people shouldn't have to pay a lot for good healthy food\" (direct quote) The service was excellent as well. Jamal (spelling?-the owner?) makes it a happy light hearted atmosphere. Locals will visit the restaurant and laugh and enjoy conversation with Jamal as he prepares meals. An excellent place, wish I could be eating it right now, but I live in Phoenix. :// Make a restaurant out here Jamal! I recommend the Chicken Shwarma plate! $8.50 and it fed both me and my wife (didn't get stuffed though, perfect amount)", "author": "David C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-11", "description": "These guys aren't my favorite in the city, but I work in the area and have wound up coming here to eat once or twice. The service has always been a bit gruff, but the food is actually pretty good.\n\nI always like to start with the bad news: The falafels aren't as hot and crispy as I'd like, and for a place named \"Heights Falafel\" that should be considered some sort of a crime, and really it's a shame. I wouldn't recommend the falafel.\n\nGrape leaves are OK, but not my favorite. \n\nThe Hot Sauce is kind of wanting for spice, but I feel like that's more the fault of the neighborhood than the shop itself. \n\nThe Schawarma, though - that is fantastic. The Chicken is my favorite, but if you're a beef kind of person, it's totally worth hopping in to grab one. \n\nand, let's not mince words here - THE WHITE SAUCE IS SOME OF THE BEST I'VE HAD IN THE CITY. Insert your own jokes about slathering everything in creamy white sauce if you'd like, but that's my opinion and I'm sticking to it.", "author": "Bryon B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-08", "description": "So many good options. Chicken shawarma, falafel, rice, moujadara, etc all good. Place is not fancy, regular take out kind of place with two tables.", "author": "lena p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-23", "description": "Hands down my favorite Falafel place in BK. The staff is very friendly ( I go there twice a week and they know me.) I always get the falafel sandwich. It's inexpensive, very filling, and actually tastes good. Their falafel plate is the same, so much food. \n \nThe pita they use is normal pita you would find at the grocery store, which isn't the best, but not by any means horrible.\n\nThe place is very tiny and when there are people in line and people eating in, it gets uncomfortable. I always have it to go.", "author": "Sam D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "Very satisfied with the food, flavor, price point and quantity. Will definitely come here again when in Brooklyn! Definitely agree with all the other positive yelp reviews of this place. They were on point!", "author": "Tina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-29", "description": "When I was an intern in Manhattan 3 years ago, this place and Fascati's were my go-to stops for a quick, cheap dinner. Now, the one thing is that you'll probably have to wait a little bit for your food here; it's not like the street meat places that will throw together everything on the spot and have it done. In a sense, this is good; at Heights Falafel, they always take a few minutes to slice the meat off and give it a good grill before putting it in the pita. Along with the regular vegetables, they are quite generous with the hummus as well, so you're getting a well-stuffed pita for under $5. I was always a fan of the chicken schwarma pita, but the beef iteration is also very delicious. Every ingredient is full of flavor (even the vegetables), so you have a truly delicious dish, all for less than $5...or at least it was 3 years ago.\n\nI'm sure there are better falafel/schwarma spots around, but I have a fond place in my heart for this small shop, and I've never had a disappointing meal from it either. If you're in the Brooklyn Heights neighborhood, it's almost always an easy stop to pick up some food. It takes 5 minutes at most if you don't have to wait, and slightly longer if you do, but you'll be happy knowing you'll be getting good bang for your buck.", "author": "Asuka N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-14", "description": "I probably wouldn't go out of my way to hit this place up but since it's less than a block away from where I'm living, I'll happily go when I find the falafel fairy calling my name. \n\nThe service was quick and friendly and the food was good to-go. Definitely not a place you probably want to sit down for hours at, but for a quick bite, it definitely suffices. Last night I was served what were definitely the biggest pieces of falafel I have ever ate and all at a good price. The hummus was tasty too and the the worker gave us three pieces of hot and soft pita to round out the meal. \n\nAll of the salads (especially the mousaka) looked delicious so I will definitely be going back soon. When we left the owner said \"See you tomorrow, same time\" and ya know, he might just be surprised when I do actually show up today!", "author": "Cassie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-20", "description": "Heights Falafel holds a special place in my heart, since it's my first favorite place since i've moved to new york. \n\nslight back story:\ndecided to check out the food situation for vegans in BK heights while i was house sitting, i went to the place next door, Siggy's Good Food. I left feeling slightly cheated and annoyed, and then upon my exit, noticed the hole-in-the-wall falafel place next door. i swore to return for the promise of a $3.25 falafel sammich! \nreturned later for some movie sneaky snacks, and was hooked. \n\nfalafel is crispy and light. so very yummy. \nthe guys behind the counter are friendly and quick. \nthe place is small, but it's clean, bright, and inviting. no pretension. \n\nmy reccomendation: order the falafel plate- 4 falafel, rice, fresh made tabouleh, lettuce and hommus for $6. heartily enjoy with a can o' soda and watch the local color come in for their falafel fix.", "author": "Kacy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-06", "description": "Just to be clear, this place gets 5 stars for its food. However, the restaurant itself is extremely small and it took us about 10mins to actually sit down. I ate the chicken shawarma plate and it was one of the best that I have ever eaten. One last thing, the restaurant is not at all expensive but, make sure you have lot's of cash because they do not accept credit card.", "author": "Chinmay D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "the best middle east food ever ,special the shwarama and hummas ! highly recommended!", "author": "Hamza G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-04", "description": "I recommend this place for a quick, inexpensive sandwich.\n\nThe shawarmas and falafel sandwiches are both tasty and good-sized.  \n\nStore is small without a lot of seating and kind of looks like a shit hole.\n\nThe guy who works there is friendly, especially so for NYC customer service.\n\nI would definitely go back (and have).", "author": "Chris H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-22", "description": "I recommend this place for a quick, easy meal that's tasty but not too filling and won't break the bank.\n\nThe shawarmas and falafel sandwiches are a treat. I like the generous portion of vegetables -- it's exactly the amount I would try to cram in there if it was a self-service bar, but without the hassle or guilt of doing it myself. I've never left hungry, but I've also never been uncomfortably stuffed.\n\nThe service I've gotten every time I've gone in there was fantastic. The guy who works the counter is really friendly. As far as New York City customer service goes, it's off the charts. He smiles, he is polite and cordial, he answers questions in a non-abusive way -- what a great guy! And it's not just me -- I see him give the same service to the people in front of me when there's a line (average about 1 person in line -- the line's never an issue). One time I went in there right before closing, when they'd already started putting things away, and they brought the stuff back out to make me a shawarma. A++ for service, in my book.\n\nThe general quality of the produce is high, but the prices are rock bottom considering that they have this store front on Henry street. I'm not quite sure how they make any money.", "author": "Robert M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-12", "description": "I ate the most filling, beautiful Falafel plate I've had in NYC at Heights Falafel.   Aside from gourmet sit-down restaurants, I've never seen falafel plates served on real ceramic plates, with real silverware, and for the price!! (6.50) You get several large falafel balls, rice, salad, hummus and pita.\n\nSince the falafel balls are large, be sure to ask for sauce.  They are more \"cakey\" than \"crispy\" in the middle, so need the support.   The hot sauce isn't crazy spicy, which I like, and the tahini adds a nice texture and flavor to complement the contents of the plate.\n\nHaven't tried the side dishes or lentil soup yet, but with these prices, and a super-friendly service staff, I'm sure to be back.", "author": "Patrick G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-27", "description": "There was a line of people, so I figured it must be a good place. It's pretty small which causes things to get a little cramped. The service was absolutely horrendous. I felt as if I was being completely ignored at one point and they couldn't handle the volume of people. It might have just been that particular day I was there, but I don't know for sure.\n\nFinally, I got my order of a falafel pita which came to $3.50. I planned on eating in the car because I'm classy like that and I was on my way to a meeting. I don't know if something happened to the falafel after walking from the restaurant to my car, but everything went downhill. The tomatoes must have been soaking in water because the pita bread was drenched and chewy (almost stale). The most important part of the sandwich, the falafel, was bland and flavorless. It tasted and smelled oily and has no crispiness. The Tahini sauce was too watery and left a bad taste in my mouth. The only positive notes are that they give you good portions... and I guess the shredded lettuce was acceptable?\n\nI would disagree with the statement, \"you get what you pay for\" because my all-time favorite falafel sandwich costs the same exact price and has never let me down during my multiple visits. They need to make sure they don't compromise the quality of their food just to accommodate the long lunch-hour lines.", "author": "Erica B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-25", "description": "Food is fine. And cheap. But the service sucks. You can easily wait 30 minutes for a to-go sandwich. And it is pretty much chaos, with people coming in later getting served faster. Don't bother during lunch hours", "author": "Sean B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-02", "description": "I work in DUMBO and it's tough to come by a fairly priced meal.  I get a chicken shwarma sandwich and a soda for 6 bucks and change.  2 sandwiches would be tough to finish.  Overall great place.", "author": "Gabriel F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-08", "description": "5 stars all the way. I get the falafel platter and I love everything about it. Definitely my favorite place to pick up dinner.", "author": "Marilyn W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-25", "description": "Every single time I'm in Brooklyn Heights, I make it a point to get a falafel sandwich from here.\n\nIts a small hole in the wall next to some fancy, schamancy organic food place but the food is to die.\n\nEverything is always so fresh and tasty. And cheap! I'll even get a little chicken from there to use for sandwiches the next day. \n\nDefinitely recommend this place if you are in the area.", "author": "Nadeen N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-10", "description": "Two years ago when I interned at the federal courthouse two blocks away, I would have given this place at least four stars.  At $3 for a falafel (50 cents to add hummus) it was the best deal around.  Well, it's still only $3.25 for a falafel, but I don't see myself seeking out this deal.  \n\nI came here once last winter when I lived in Brooklyn Heights. The quality of the falafel had gone down from what I had remembered, but it was still cheap and edible.  Craving falafel, I went today and ordered the falafel place (falafel, rice, salad, hummus).  It was cheap ($6) but pretty bad.  The falafel balls were dense and had and smelled (and tasted) oily.  Since they were on top of the rice, this caused the rice to take on this foul flavor.  The salad was decent, and the hummus, while edible, had the consistency of Sabra hummus (which I'm not a fan of--I prefer creamy over chunky).\n\nIf only a Maoz would open in Brooklyn Heights...", "author": "Gabrielle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-11", "description": "I was starving and I couldn't even finish the $9 chicken shwarma plate. It's so good and very relaxed.", "author": "Josh K."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Heights Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3Nb4x2k83_T4xVljsYp1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184880808"}