{"aggregateRating": {"reviewCount": 220, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-08", "description": "While tasty and flavorful, they have very limited seating relegating this place to a quick takeout spot for your Mediterranean eats... Yes, it's quite small.  The owners are great and take care of their customers. All in all, a great bargain for decent food. \n\nChicken shawarma plate was our calling and out came a piping hot plate of chicken, pita, salad, hummus no regrets. I had to share it but I'm fairly certain a hungry person can finish that out relatively fast. Quick, friendly services makes for a good lunch spot.  I don't recall getting the falafels here but I'm sure they're worth looking into.  Easily accessible and different rom the atypical chinese, italian, and fast food options in the area. Come to think of it, it may actually be the only middle eastern spot in BK Heights.", "author": "Ron L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "I just moved into the neighborhood a week ago and needed a quick bite so stopped in. The service is wonderful and the food speaks for itself. I've been back two more times this week. I have ordered something different each time and it just gets better and better. The food prep is made quick by lively conversations with the personable and outgoing staff", "author": "Sam C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "LOVE this spot! Been going here for years and it doesn't get any better! Best lunch spot in the area - best Falafel in the city(bold statement). I work in Dumbo now, but still make the trek for the Chicken Shwarma and spinach pies!", "author": "Sebastian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Best falafel ever!!!!!!!\nBig portions, freshly made falafel, super tasty babaganoush. The falafel balls are very crispy on the outside and soft inside, and lightly fried.\nAt lunch time there is a line outside!\nThe place is very small and the ambience is nothing special but their falafel worth to go!", "author": "Edvige C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-30", "description": "I thought this place would be better considering it has a 4 star average.  Definitely underwhelmed.  Been here twice, both times I got a falafel sandwhich it came with cold and soggy falafel.  The sandwhich was big, and it had good sauce flavor, but who wants a cold and soggy sandwhich?  Very disappointing.", "author": "Rakesh M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-02", "description": "Had a vegetarian plate today! \nWarm moujadara - grape leaves, tabouli, crunchy lettuce n tomatoes drizzled with tahini! Light n Delish!\nI was lucky to have missed the lunch crowd which often extends in a queue out the door!\nLol\n\nTook pics of the menu so You can order Delivery on an inclement day; and/or know what you want when you get to the counter!\n\nNote: After 4pm-ish a grumpy guy is often at the counter. \n1. He should Not deter you from this affordable, tasty food.\n2. He Does have issues making the right orders and is often argumentative; Check Order Before You Pay/Leave!", "author": "VioletL P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-16", "description": "Nice little Falafel and Shawarma for good value for money. We had a Falafel combo with Hummus, salad, grape leaves and 4 big Falafel and a chicken Shawarma. All together less than 20$. The chicken was a bit dry but the Falafel were pretty good. The guy behind the counter was friendly and welcoming. From our perspective a good place to get quick and good dinner for a reasonable price.", "author": "Anne W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "Extensive menu, fast service and top quality ingredients. The only downside is that it is a small space, not great for groups and a little dingey inside. Don't be put off though, the food is very fresh and flavoursome.", "author": "Aifric H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-21", "description": "The food is decent.  Fresh, affordable, and fairly quick.  \n\nThe reason this place gets dinged is that their service is terrible.   The guy who runs the business at night is a jerk: rude to regular customers, disparaging to female patrons, aggressively confrontational for no good reason.  Also, their delivery is spotty-- at times taking a few minutes and other times taking an hour.   At no time will you get exactly what you ordered.  \n\nThe customer service doesn't fare well during the day either.  The employees/owners hate their lives and are constantly fighting.  It makes for an awkward interaction at best.  \n\nI can understand if you're the only show in town; however, this neighborhood is saturated with excellent Middle Eastern food (i.e. Fatoosh and Tut Cafe) and customers can easily take their business elsewhere.  \n\nThis is a neighborhood joint that doesn't care much about their neighbors.", "author": "Hey A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "It's getting harder and harder to find a good meal at a fair price in this city. I appreciate this place :) This is my go-to lunch spot in this neighborhood! Great falafel.", "author": "Joel P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "Food: Great lentil soup at a great price of $3.25! \n\nService: Is Ok, a bit odd because everytime I go in I feel like I've just walking into the middle of some staff tension? The woman taking orders upfront is real cold and snippy to chef, but then she will attempt to put on a good face for the customers. I've been there 5 times in the last month and it happens every single time. It's so odd and kind of amusing.\n\nI'm guessing the social tension must be the extra spice that make their food extra tasty.", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-06", "description": "Very tasty food for a great price. One of my most reliable spots when I'm in BK heights. Staff is always very friendly.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "Excellent food, very fresh and well prepared, friendly attendants, and very clean place. I ordered beef swarma sandwich and it was delicious. I do recommend this place.", "author": "Debora R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "This place is fire. Super reasonable prices, flavorful and well-seasoned food, homemade desserts. $8.50 for a massive chicken shawarma plate with yellow rice, hummus, salad, and pita? What more could you ask for? A neighborhood staple.", "author": "Max S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "I really like this place. The food is tasty and cheap. Especially for the area. I recommend the chicken Schwarma. Its delicious. If you are not super hungry get the sandwich. However the plate is best. The falafel sandwich is also very good. Its really cheap and very tasty. Great quick and cheap lunch in the area.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "Super nice lamb sandwich they make here. Was in the downtown are for a bit two weeks ago with my moms and I got hungry. I didn't feel like having pizza or chinese so I decided to try some halal. I'm really glad I did cause the sandwich I got was a pretty decent size for $5.50. The meat was very flavorful and the white sauce was very fresh as well. I enjoyed it a lot. They also have baklava too but unfortunately since this place was cash only, I didn't have enough cash on me to purchase the baklava.. BUT I'm sure it's amazing.", "author": "Shannon Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "Wow. Not only was spinach pie innards superbly flavorful, with possibly a hint of lemon, but the dough encasing the filling was flavorful with a tender texture.\n\nThe felafel salad - 4 big felafel atop lettuce and an onion-y cucumber tomato salad, topped with tahini and hot sauce on demand.\n\nBaklava is laden with syrup.", "author": "Laura G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "This place is fantastic, the food is great (especially the hummus) and huge servings at such a reasonable price. The owner is also really nice and friendly towards people who are eating here.\nAlso pretty clean and nice ambience if you're looking to sit down for a quick bite.", "author": "Davis G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-22", "description": "Excellent, fresh food, tons of variety, amazing prices and very hospitable. Their falafel have a pesto like flavor that sets them apart from the rest.\n\nThe owners at Heights Falafel are incredibly friendly and fast working. I placed an order for 20 people that they had ready in less than an hour. \n\nDon't miss out on trying this great little gem in Brooklyn!", "author": "Dana T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-13", "description": "These are the best falafel in New York! Lovely service from Jamel, gave us free Baklava! Falafel are fresh and homemade! And great prices! Highly recommend!", "author": "Jess N."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Heights Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3Nb4x2k83_T4xVljsYp1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184880808"}