{"aggregateRating": {"reviewCount": 220, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-09", "description": "It's embarassing that somewhere so close to a gem like Sahadi's would serve one slide of stale-ass pita with their platters.  What a fail.  Also - what the hell am I supposed to do with the rest of this hummus.  I sure can't get it to my mouth with that shredded wilty lettuce you call a salad.\n\nYes, I agree - this place is cheap.  You know what else is cheap - street meat.  Go to the truck on Prince and Broadway, spend five bucks, and come away with 3 pounds of delicious shredded chicken over rice that doesn't taste like it's from a box.\n\nMaybe they just don't give a damn what they're delivering at 11pm.  I'll have to stop in to see if I'm being too harsh...", "author": "Danny O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "AMAZING!! the food is healthy, delicious, homemade, authentic, \u0026 cheap. can't beat it. especially in this neighborhood where anything decent is overpriced. a real gem.", "author": "James R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-13", "description": "I love this place! Hands down best falafel and shwarma I've ever had. I live in DC and can't eat falafel back home because the restaurants aren't on par with Heights Falafel. Every time I am in the city  I make it a point to swing by here and grab a meal. Go ahead, stop by. You won't regret it.", "author": "Meg F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-25", "description": "Good, cheap, and friendly.  Has a very homely, mom-and-pop type feel.  The owners are very friendly and welcoming.  \n\nI think the falafel sandwich and a Coke was $4.60.  There is no where to really sit... this is more of a on the go type of place.  \n\nThe food also tastes very fresh and crisp.  \n\nAll the below reviews are spot on.  I will definitely be returning, over and over.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-20", "description": "This place is really cheap. Their sandwiches are amazing. They are tasty and big. I also tried their falafel and it's flavorful. I would no have the platter, but a falafel sandwich next time. \n\nI probably won't have a full meal there, but certainly quick meals and plenty of take outs.", "author": "Marcos R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-28", "description": "I stumbled on this place while we were visiting the Brooklyn Bridge.  My wife went to Chinatown and I stayed in Brooklyn.  Grimaldi's was way too long to wait, so I walked around Brooklyn and found Heights Falafel.  Place was awesome, small family owned restaurant.  I had the falafel sandwich with a coke, then walked around Henry street.  This was a great local area with a lot of local businesses.  Just felt like a great place to live if I worked in NY.", "author": "Josh L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-21", "description": "As far as falafel joints are concerned, this place is not inspired like Oasis in Williamsburg. Heights falafel has a very plain menu. But that is fine. \n\nWhat my husband and I didn't like was that we were each over charged on separate occasions. There are many tourists roaming around Brooklyn Heights, overhead is probably expensive and street food in general doesn't bring in big bucks. So maybe supplementing income is neccessary?\n\nSorry, but I've got my own children to feed. I didn't choose to contribute to the Heights Falafel Fund and will not return and make more unintentional donations.", "author": "Mona L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-18", "description": "Had a super tasty \u0026 inexpensive meal here. The portions are generous and The falafel sandwich made me want to return.", "author": "K. C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "Happened by and stopped in for lunch.  Wow!! Wonderful falafel, shwarma, kibba, hummus, etc.  My family loved it.  The food is spiced differently because  the owner is Syrian/Lebanese.   The owner is super friendly and the prices are reasonable. Lots of locals stopped by, obviously having been here before.  Be aware that this is a small  place.  If I lived in Brooklyn and not CA, I would be eating here a lot.", "author": "Annbeth S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-24", "description": "had the falafel sandwich, which was excellent. also had the chicken plate, which was excellent. however the bread was just average, seems like something I could buy at the supermarket. but, I am willing to try this place once.", "author": "J P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-07", "description": "Heights Falafel is a lunch staple for me. Their prices can't be beaten and the food is delicious! Their schawarmas are always a good choice, the chicken more so than the beef. The beef can be dry but it depends on the day. And always get the sandwiches with hot sauce! But the best thing on their menu is the simple red lentil soup with a squeeze of lemon. Nothing beats this soup and I have tried to replicate it at home. For $2.75, you get a pint of this delightful heart warming soup. Their dolmas are great as well and so are the lady fingers. Ironically I haven't had their falafels yet. But I will highly recommend the Virgil's rootbeer with anything on their menu.", "author": "Janice P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-13", "description": "Had to add a review because I was looking for something moderately healthy tonight, didn't want to pay a fortune for Siggy's next door, and honestly there's not much in the area.  However, the Veggie Combo plate lets you choose 3 veggie sides (love their baba + grape leaves) and comes with salad + pita.  Mine left me with enough for lunch tomorrow too.", "author": "Hanna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-02", "description": "I've walked past this place dozens of times, and for some reason never stopped in. I vow to mend my ways, immediately. \n\nMy boyfriend and I got take out chicken shwarmas there last night.  We had just gone for a long, relaxing walk on the High Line and returned to his neighborhood in need of a quick food fix that wouldn't ruin our good-design-and-perfect-weather-induced buzz.  Foscati's was closed, so he suggested falafel.  I'm glad he did.  The chicken for our sandwiches was quickly grilled and chopped, and our soft pitas were filled to rim with meat, chunks of fresh tomatoes and onion and herbs, and sauce.  It was a full sandwich, but held togeher the whole time I was eating it (with gusto).  I usually find that pita sandwiches break down within the first few bites.  We had beers waiting in the fridge at home, so we didn't pick up drinks, but I noticed Jamaican ginger soda in the cooler along with a few other options.  Cool.\n\nThis is not exquisite food, but it is cheap and delicious, and served with a smile by friendly staff in a very clean and visible kitchen.  You can eat in, but there are so many great spots in the vicinity to take your lunch or dinner.", "author": "Romy V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-26", "description": "There is a strong possibilty that my review might go up to 5 stars in a few months, but since I just recently moved to Brooklyn Heights, I need to try more places in the area before making a final judgement.\n\nThe first impression was one of WOW delicious, fresh, homemade middle eastern food. You can also go in and buy things like hummus, grape leaves, babaganoush, tabouli etc separately for cheap. The man who runs this place is incredibly sweet and gregarious, and gave us a free apricot pudding (which was also delicious and unlike anything I had ever tasted).\n\nWhat I do know gets 5 stars just by itself is the Baklava. This delicious, sickeningly sweet honey dripping dessert is often just that, too sweet for me, no matter how good it tastes in the first bite. But Heights Falafel is not COMPLETELY drowned in the honey, so you get the taste of all the ingredients. It's soaked in honey on just the bottom and the rest is flaky, nutty, awesome goodness. . One of the best desserts I've had in a long time, no lie!\n\nThe mousaka is amazing, as are the falafel plates, which comes with 5 huge falafels, a pita, two sides like hummus and babaganoush, a small salad, and rice for about 6 dollars. And its SO good. \n\nI expect this to stay the best falafel place in Brooklyn Heights, and maybe top 10 in nyc.", "author": "Katie R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-05", "description": "Okay, I get it, I'm the outlier on this place.  Maybe it's because I just kept to the veggie options?  (But then again, when I asked for fattoush, which they have on the menu, the woman behind the counter pointed to something that was, by definition, NOT fattoush... so maybe the problem is, yes, Heights Falafel.)  I thought the falafel was off--with each bite I kept tasting some spice that was just not supposed to be there, and yogurt salad was just bland, bland, bland.\n\nIt is a cheap place to grab a bite, which I appreciate, but really, I *have* experienced better, and there's better falafel within a few blocks of this joint.", "author": "Brigid M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-29", "description": "Good and cheap.  THe falafel sandwich was very good, the falafel was moist and not dried out like a lot of cheap places.  The chicken shwarma sandwich was good, a slightly off shwarma spice mix, but it was good nonetheless.  The tabouleh was also good, very flavorful and not all parsley, it had a good amount of bulgher in it.  \n\nFor the price, can't beat it.  We took it over to Cadman and sat outside for lunch.  Will definitely be back.", "author": "Aaron S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-30", "description": "I have eaten many a Falafel and this place is very edible but not great. The pita and falafel is always ice cold by the time I get it to my apt which is only a three minute walk! Grape leaves are decent but skip the chicken dishes- very dry and flavorless. The staff is very nice and friendly though and the food is cheap!", "author": "J C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-11", "description": "falafel is perfectly spiced and fried, hummus, grape leaves, rice, are typical  $7 plate fed 3 people\n\nbeef schwarma was dry, but forgiven  $5\n\nvery reasonable prices", "author": "Jomei L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-15", "description": "I love this place. Great value...super friendly staff (the lady that works here is so nice) and yummy food.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-26", "description": "the best Falafel that I have ever tasted! the workers are the great, the food is awesome, the prices are cheap, definitely a place I like going to every week! :)", "author": "Shannon U."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Heights Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3Nb4x2k83_T4xVljsYp1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184880808"}