{"aggregateRating": {"reviewCount": 220, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "Great falafel and reasonably priced as well. Food was ready within a few minutes after ordering and we were kindly greeting by the cashier. I would give this one a must go!", "author": "Kash C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-27", "description": "My god - that was the most depressing babaganouj I've ever had. It was so bland it hurt. The only thing it has going for it was serving size and cheap price ($3.50). Beyond that forget it! You're better off buying from the grocery store.", "author": "Cat M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "This place is amazing, and so inexpensive!  Nice staff and a great \"mom and pop's\" feel to this place. It's one of my Brooklyn Heights regulars.", "author": "Whitney W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "Everything was AWESOME! !! Had this food delivered at a company lunch. The falafels,  salads and meats were all delicious!  I may need to go back to Brooklyn just to eat at this spot again.", "author": "Lanissa W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-29", "description": "Chicken falafel platter with a Pepsi for $10 and I am in Brooklyn Heights?! Yes, please! It's enough to share with two people. This was my second time coming here and I was very pleased. Not to mention it's in my neighborhood. I will definitely come here again!", "author": "Crystal A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-14", "description": "This place was a great find. Located next to Siggy's Good Food and Fascati, Heights Falafel seems like a random hole in the wall, but the food simply is not.\n\nHonestly speaking, the chicken portion of the chicken shawarma plate was perhaps the best chicken shawarma I have ever had. FIrst off, the plate costs 9.25 with tax - GET IT. It's is an enormous amount of food. These guys do not skimp on the chicken and I love how they cut it off and then grill it again to get even more flavor out of the meat. The salad is fresh and flavored and the hummus rich but still delicate in flavor. \n\nIt's not the fastest place, but they do a good job making their food taste good. The tahini sauce and the other sauces they have are great. My only qualm is the fact that they don't serve great pita. They just grill up some pre-made pita, but the rest of the food here makes up for that.", "author": "Dawei L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-14", "description": "Very good, tasty food and for the right price. The only downside is that they argue...a lot...behind the counter.", "author": "Alexis L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "Very reasonable prices and good portions. Recommend the beef shawarma and spinach pie!", "author": "Angela S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-15", "description": "The meat pies (with hints of onion) tasted even better with hot sauce added.  The chicken shawarma sandwich is my second choice.", "author": "Corey B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "this place is gods gift to earth. I work in Dumbo where there are extremely limited lunch selections and come here a few times a week. The owner and his wife are pretty efficient for how crazy it gets and the most you will wait is 8 -10 min and thats when the line goes back to the door (its a small place).\ni get the grilled chicken pita sandwich and the tahini sauce with the tomato salad a little bit of basmati rice. WOW for $6 - totally fills me up for a fabulous lunch.\ni totally recommend this place if you are from the area, around the area, or just visiting new york. its tough to find cheap halal that doesnt taste like food truck meat. its all fresh too. a lot of vegetarian options as well!", "author": "Allie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-27", "description": "Can't say enough about this gem. Best falafel I've had outside the Middle East. Tiny hole in the wall with great food, fast personalized service, and amazingly low prices. Everything we had was fresh and delicious. Prepared and with a smile.  You won't go wrong making the your go to falafel and other Middle East food stop.", "author": "Gideon A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-09", "description": "Fantastic meals here at a great price. I had the chicken shawarma and it was absolutely huge. Had both the red and white sauce on it. Chicken is spiced perfectly. Comes with a generous serving of hummus and pita bread. My girlfriend had the falafel sandwich for $3, also really big and tasty. The woman behind the counter was absolutely lovely too. Highly recommended.", "author": "Jules H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Food is fresh, tastes very good, and owners are very friendly. Have come here maybe only a couple of times and owners are always in good mood and are quick to serve customers- even when there is a line. Definitely one of the best places to stop in the area", "author": "Mariano G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-18", "description": "Their falafel is twice the size of Mamouns for the same price...also they don't skimp on sauces so it really has that kick to it. I'm a big guy and even I fill up on one of these. Never waited more than two minutes to get my food! Definitely a place falafel lovers should stop at!", "author": "Josh J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-15", "description": "Heights Falafel is one of my favorite restaurants. Everything on the menu is tasty and fresh, their chicken schwarma is very popular and rightfully so.  If you come at lunch, expect a line but it moves quite quick. \n\nWith the heat of the summer, their yogurt salad was refreshing and pairs really well with the mujaddara, hummus and grape leaves. \n\nOverall I greatly recommend Heights Falafel if your are in the area. You'll end up with a great meal from a wonderful family.", "author": "Benjamin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-03", "description": "When I was living in New York, this place was nearby. The quality was consistent and it was at an affordable rate. I ate there a bunch, if you are local then you already know. If you are visiting check this place out.", "author": "Frank D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-06", "description": "Great food - from the falafel to the chicken shwarma to the chicken over Israeli salad. The spinach pies are amazing. Cute little neighborhood place with a few seats for eating in but most business (that I've done at least) tends to be take out. 4 stars bc it is 50cents extra for humus on sandwiches and CASH ONLY!", "author": "Dara B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-23", "description": "Big plate of Falafel doused in tahini and hot sauce, rice, salad, nutty hummus and two thick pitas for $$$$$$$$$6.50!!!!!!!!!!!!!! you can keep your grimaldis and your shake shack walk a couple of blocks and get a falafel instead. This place is clean, cheap, delicious and their portions are  generous. Then take a walk over to Orange Street and check out some American History at Plymouth Church.", "author": "Alison P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-20", "description": "Food here is consistently fresh and tasty. It's obvious that food is prepared with care.  So far I have had the falafel and spinach pies.", "author": "Beth O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-17", "description": "The personal is rude and unplesant. Can't make order. Looks like they don't need a new customers.", "author": "Dennis S."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Heights Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3Nb4x2k83_T4xVljsYp1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184880808"}