{"aggregateRating": {"reviewCount": 220, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-26", "description": "This is my favorite restaurant in the area. Had their chicken shawarma sandwich which was unbelievably delicious! Their homemade lentil soup is also very fresh and low in sodium. A very healthy place with low prices!", "author": "Usman A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-23", "description": "Tastiest falafel we had in NYC! Huge portions and good price. I got the special falafel plate which came with hummus, baba ghanoush, tabouli and salad. All delicious. My boyfriend had the chicken shawarma plate and loved it too.\nLittle place but server was friendly and food was prompt! No problem getting a table.", "author": "Kelsey M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "WHOA! This little hallway of a restaurant knows how to fill a plate with delicious food. I ordered a falafel plate and it came with the moon and the stars! Okay, maybe just pita, hummus, tabbouleh, rice...honestly I lost track. Oh, but there were a couple included stuffed grape leaves and they were good! The falafel was crispy and freshly fried. I really loved everything on the plate. \n\nFriendly staff, clean place and we left more than full. Note: There is no customer bathroom from what I could tell, but there is a good amount of seating.", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-07", "description": "Ok, update, the falafel sandwich is v good. Try that instead of the chicken shawarma!", "author": "Megan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Heights Falafel could be the cheapest food in the gentrified area of northern Brooklyn. It's a big portion of food for the money. When your hipster friends are blowing their savings at the newest fusion place you can come here and eat until full. It's not even like it's in the ghetto. This is just a few blocks from the bridge, so not a bad way to go. \n\nI had the falafel combo. It comes with hummus, pita bread, and tabbouli. This was a filling meal, unlike whichever hipster restaurant gives you a paltry amount of food for astronomical prices, so good work by Yelp. It wasn't the crappy falafel that looks like burnt feces either. These were humongous. A thick creamy hummus was a good accompaniment. The tabbouli was good too, unlike some which have no flavor. All this was about $7, which sounds like it's not possible in Brooklyn. Oh but yes it was. Maybe the only bad thing is there's not too much room inside. Though I was the only customer so it wasn't a problem. \n\nIt has to be one of the most affordable independent restaurants in Brooklyn. It's a relief there's some with reasonable prices. The portions are big and won't empty a wallet.", "author": "Steve A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-02", "description": "So after watching a YouTube video by Mark Wien in my house which he has done a tour discovering Middle Eastern food and plus I'm in  New York and just wanted to find some good cultural food different beside my West Indian back ground. However, I ordered the Falafel plate, I had so much excitement to try the food and guess what it's AMAZING. So fresh, smells good, place is clean. Owner Jamiel \"sorry probably spelled the name wrong\" but he was also really nice he put a big smile on my face. His love and work he put in the food is great.", "author": "Erica A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "This is my favorite restaurant in bk heights, and one of my favorite falafel places of all time (girl knows her falafel). The portions are huge and the price is cheap, and everything is seriously wonderful -- falafel and babaganoush are my favorite. Yes, sometimes the line is very long and the the lack or space/ambiance doesn't make it a great place to sit. But with Brooklyn bridge park just a few blocks away, it's great to take your food and sit there. \nSince moving to the neighborhood 3 months ago, I go to heights falafel at least once a week. So great to have delicious, cheap, quick food right around the corner. I have brought 10+ friends there and have not disappointed anyone. Thank you Jamel!", "author": "Amelia H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-27", "description": "Green! If I ask you if your falafels are green inside...don't lie!! Green. It's a primary color. With the exception of 8% of the male population of the world...we all know this color. \nThe wait was super long for no reason. I stand by my previous falafel reviews; it doesn't take long to fry balls of mashed chickpeas. As I watched others get their food loaded with tahini sauce I asked twice if my take out had sauce. Yes he said but alas yet another lie. Thank goodness I asked for sauce on the side. He barely wanted to give me two tiny containers. A lady shouldn't have to beg for sauce. \nAlso I recommend adding onions as a topping. All great falafel places have onions. This place doesn't. \nAll in all yet another falafel failure. \nMamoun's and Taim still reign supreme.", "author": "Kateria N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-23", "description": "How are there so many 5-star reviews?!?  Have you all not had good falafel before?\n\nGoing to keep this one short.  Super small place (that's not a problem), nice and friendly staff.  Food=mediocre at best.  I've had much better falafel in many different places.  I was astonished at how this place was so highly rated.  \n\nIf you want falafel in Brooklyn, go to Oasis.  Maybe the other food here is better.  I would try it again if in the area, I just would avoid the falafel 100%.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-22", "description": "I threatened my friend that I would write Guy Fieri From DDD  about this place and she became really really mad. She said \"don't you dare it will ruin this place\". Falafel sandwich is off the chain. Meat pie is excellent.", "author": "Jack Straw S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-05", "description": "First time at Heights Falafel, and food tastes simply amazing. The chicken was tender, with a pinch of tahini, rice was super fragrant too. To add on,  the portions are huge FWIW. As I was alone on a sat morning, the owner and I started chatting and he was super nice and offered me a free drink even! ( I choose mineral water).", "author": "Dalaney H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-28", "description": "So delicious and really reasonably priced! One of my favorite spots in Brooklyn Heights (much better than others I've tried) to get a really tasty meal! I love the chicken shawarma plate with the tzatziki or the chicken shawarma wrap. My friends who I bring love the falafels but I'm allergic so I can't attest to them. For some reason the hot sauce is really good and not that hot and the tahini sauce adds a good flavor too. The owner, Jamel, is very friendly. It's a real neighborhood spot!", "author": "Meryl G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-27", "description": "Decent food but the lady (not sure if she is one of the owners) was really off-putting! Not sure if it was personal since I saw her be very friendly to others but I don't like the wench! Also, the pitas are ghetto and cheap. Falafel is pretty good but I still prefer mamouns. Sorry, I won't be back. Rather spend my $ in an establishment that has employees whom are friendly. Oh, and sorry I took too long eating w/the bottle of tahini because your cheap ass refused to give me a side of it in a small container.", "author": "Christine P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-08", "description": "Such amazing food! I moved here a month ago and have already been here four times. The customer service is above and beyond. The gentleman who owns this restaurant is such a nice guy and really makes your experience above and beyond. This is definitely the best Greek restaurant I've been to.", "author": "Abbey W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "The best falafel in bk heights!  Make that, the best in the world. Hands down. Owner is a really nice guy too. I study arabic and he's always giving me new vocab.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "I live right around the corner in the EHS dorm, so this place is super convenient for a lotta food at a low price. The owner is super sweet and always making small talk and giving me samples of everything. The portions are huge, it's pretty hard to finish everything in one go unless you're super hungry. Unfortunately I've had a lot of falafel/shawarma, so it wasn't the best I'd had because it didn't have too much flavor, even with the sauces on top. Be sure to bring cash, he appreciates it. Lots of cheap options and the hummus is REALLY good...probably the best plain hummus I've had.", "author": "Jessica Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "Heights Falafel is exactly what you want it to be. The food is fresh, tastey, and at incredibly good prices.\n\nCame in before closing and everything was still made fresh. I asked to add a bottle of water to my order, but my credit card had already gone through. I was out of cash but Jamel (the owner) said I could have it. Definitely made my evening, highly recommend.\n\nIt's the best generic falafel shop I've been to.", "author": "Weston E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-24", "description": "Absolutely adorable little shop that I really wanted to love. You get an enormous pita sandwich full of veggies and chicken shawarma for a small price of $6. But the chicken was dry and the veggies couldn't save it. Maybe I'll try the plate next time - but pretty disappointed. Maybe worth a stop if you're hungry and looking for a good deal, but don't expect juicy chicken schwarma.", "author": "Judy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-20", "description": "The guy is genius. The place is bomb.  Incredible food. Friendly and efficient.  I eat here at least once a week and keep going back for more.  Highly recommend the baba, lentil soup and spinach pie.", "author": "Ashley B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "I just made a Yelp account just to give Heights Falafel a review. I am 100% Syrian and a college student, always looking for a little taste of home. Heights Falafel has the best Middle Eastern food around at a ridiculously great price. The owner, Jamel, is also an absolute delight!!! I just grabbed a lentil soup, a rice pudding, and a water for just $7. I was freezing cold when I walked in, and Jamel gave me some fresh hot pitas to warm me up. You can't ask for better service!!\n\nThe food is absolutely incredible and you can tell they use real authentic Middle Eastern spices. The lentil soup tastes just like my moms, the falafel is dense and super flavorful, and the lamb is delicious. The hot sauce is also one of the best -- the food is a 10/10 always. Also extremely worth noting that their pitas are THE BEST that I've ever tasted (once again, I am Syrian, I have tasted a lot of pitas). It has a light sweetness that I've never tasted before. They also have a lot of Middle Eastern classics like moussaka, mujaddara, meat and spinach pies, eggplant salad, etc. You can't go wrong with anything on the menu.\n\nHeights Falafel is truly a gift to Brooklyn Heights. I'm super lucky to have it nearby. Give it a try and tell your friends!! Also, pay in cash - It is preferred and the prices are so reasonable that it's only right. If you find yourself in the area definitely try it, or just make the trip! :)", "author": "Olivia L."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Heights Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3Nb4x2k83_T4xVljsYp1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184880808"}