{"aggregateRating": {"reviewCount": 220, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "I've been a regular at HF for a couple years now, and I still enjoy the hole-in-the-wall bigly, however, I'm starting to notice they are putting way too much lettuce in their sandwiches - and less of the good stuff (hummus, falafel, the babaganoush). The pita bread's quality and temperature have also been hit-or-miss latetly. Nonetheless, you can't their prices...so I remain a fan. I'll just ask for no lettuce from now on! HAHAHA", "author": "Scott G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "A must try when in Brooklyn Heights. As usual I was touring all the boroughs for taking interviews. I happen to tumble upon this cozy place on a rainy day and was warmed up by a nice Turkish coffee and hospitality of the owner, Jamal. The veggie falafel sandwich was scrumptious and the falafels just melted in my mouth. I highly recommend everyone to checkout their menu and the cozy decor!!!!", "author": "Ankita N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-06", "description": "This is the best lunch place in the area. It's delicious and cheap. Get the special falafel. \n\nI introduced a co-worker of mine to this place and he goes there every single day.", "author": "Justin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "It may not look like much but this place is fantastic. The falafel in particular is great and tastes wonderful paired with their hummus. I would highly suggest trying the falafel plate or the chicken shawarma!", "author": "Sara S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "Went here for a quick dinner on a Wednesday. The place wasn't super busy so I was able to get my food pretty quickly. The chef was amusing and I liked his sense of humor.\n\nFood was pretty good. I had the chicken shwarma salad and it was very filling. The portions are huge and the price is very good. \n\nWould recommend this place for lunch/dinner/a quick bite.", "author": "Taraqul K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-15", "description": "Come here early for lunch... The line gets insane and there is limited seating. They seem to get through the crowd quickly, but u did feel special with my food and my table watching the masses suffer bwaahaha!!\n\nI got the chicken shawarma plate, which came with salad, hummus, rice and chicken. I got hot sauce and tahini on top when I was asked. I had food for two meals for 9 bucks. \n\nThe only thing I wish I asked for is that cucumber tzaziki sauce... I've always gotten it with platters before and it didn't come automatically. I'm not sure if they have it or not.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Best falafel I've ever had in my dang life. Super cheap, super delicious, super quick, excellent location. Chicken shawarma sandwich was really good too but the falafel sandwich is what will bring me back. Not a bad walk from dumbo or Brooklyn Bridge Park and it's convenient to the Promenade too, so that's all great for me. Thanks Jamal!", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-18", "description": "So I was in Brooklyn again and had to stop back in. I was their for lunch at 12 noon. The place had constant traffic and the line was usually 8 or more deep at all times. This time I got to talk with the owner ( Jamael ) for a few. He still had a awesome personality for being so freaking busy!! \nI had the falafel plate since I dont eat meat or chicken. ( All the other plates around me with chicken or beef looked awesome as well ) The falafel plate was excellent! Moist falafel balls on inside, just crisp enough outside. Spiced excellent...I could go on and on, just stop in..you wont be disappointed...I also got a falafel to go  ( tahini on the side, so it wouldnt get soggy ) I destroyex that in my car, 30 mins later...see pic.", "author": "Michael K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-16", "description": "We tried the falafel sandwich with hot sauce it was awesome. The salad was fresh and crunchy and the falafel was soft and warm.", "author": "Prasad C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-26", "description": "disgusting, disgusting \nplease do not go here. worst food i ever had. salads aren't fresh, chicken is super over-cooked, dry food.... terrible service. these people need gordon ramsay tbh", "author": "Nafisa C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-17", "description": "I am shocked at how many good reviews this place has and what a terrible experience I had. I went on Monday and maybe this place was just having an \"off night\" but nothing was good about this. I got half chicken half falafel over rice and while the falafel wasn't inedible it certainly wasn't anything to rave about from a place called \"Heights FALAFEL.\" The hummus also had kind of a sour taste and the white sauce was completely bland. It was a huge portion of food and pretty cheap but just not good! I also got two pieces of baklava and it was completely soaked in syrup, wet and gross. You have to have pretty low food expectations to give this more than 3 stars.", "author": "Emily A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Very light, good food and excellent service. They also give you good portions for the price which is already very affordable \n\nWill come back again", "author": "Justin-Carlo D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-22", "description": "My boyfriend found this little place in Brooklyn Heights on a whim because of its Yelp reviews. It's a solid neighborhood spot and we could tell that it had ties to the community and a few regulars, which was great to see. \n\nPrices are reasonable and food is good. This is the first time I've had stuffed grape leaves and actually enjoyed them. My boyfriend and I split the falafel combo plate and the chicken shawarma plate, but realistically one plate would have been enough food for the two of us. The chicken was a little dry, but the crispy falafel and the hummus with a kick made up for it. Overall, a solid neighborhood spot at a reasonable price. A great place if you're on your way to the Brooklyn Bridge Park.", "author": "Elizabeth F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-27", "description": "saw this place last week when we were exploring brooklyn, and after some free kayaking, we came over. \n\nfor a place i just saw in passing, it was a clean, healthy and delicious lunch.\n\nand most importantly cheap :) like a big ass falafel and coke for around 5 bucks. hella good. the ingredients were fresh, i love that it isnt overly fried. mildly spicy and quite fragrant.", "author": "Shibi M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-06", "description": "To quote History of the World Part II, Heights Falafel is nice ... not thrilling, but nice. \n\nFor those of you who don't get the nerdy Mel Brooks reference, Heights Falafel is a okay. Perhaps I've been spoiled by Halal Guys, but this tiny shop just didn't do it for me. The chicken shawarma plate wasn't bad but it wasn't that flavorful either. I barely tasted the white sauce on top (and the guy at the counter put a lot on).\n\nBut the meal was filling and cheap, especially for the neighborhood. And the guys there are very kind. So all that said, I know I'll be back.", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "Excellent, affordable, authentic and quick food with friendly staff. Tasty menu with all the classics and then some.", "author": "Ryan E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "Heights falafel serves the best falafel sandwich I have had in Brooklyn or Manhattan. All the ingredients are made fresh on site and can't be beat. Their staff and ownership are friendly. And for the price of $3.75, it cannot be beat!", "author": "Sandy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "Since moving to NY I have been going around and trying many different falafel carts and restaurants, this one is still by far my favorite one. It has consistently been delicious and never disappoints. \n\nI order the traditional falafel sandwich and add hummus. The chickpeas taste so fresh, light and has a light crisp on the outside to add a nice crunch. It is then topped with fresh lettuce, tomato and tahini sauce, don't forget the hot sauce because it adds another complexity and doesn't burn your palette like some do and is just right. Best of all, you can have a whole meal and be satisfied for $4. That just doesn't happen in NY.", "author": "Craig P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Visiting NY and got tired of eating overpriced mediocre food. Based upon reviews, this place seemed like a good bet. It definitely was. While highly casual in appearance, the food was awesome. We ordered the chicken shawarma, beef \u0026 lamb shawarma along with a side of babaganoush.  Meal was prepared fresh in front of us. For under $10 each and hella tasty, I couldn't have been more pleased.  No alcohol served (take to-go if indulging).", "author": "Scott M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "Really good falafel, and a really good price. 10 dollar minimum on card, so I recommend bringing cash.", "author": "Isabela F."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Heights Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3Nb4x2k83_T4xVljsYp1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184880808"}