{"aggregateRating": {"reviewCount": 220, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-10", "description": "The special falafel sandwich was perfect. You can taste Every ingredients freshness and quality in every bite. The sauces are super flavorful and packed a punched and added tremendous flavor to an already great sandwich. The pea soup was creamy and soothing. Very good!!", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-05", "description": "This is my absolute favorite falafel place! I work in DUMBO and I walk here at least once a week for a falafel combo sandwich, which costs less than $5 and is packed with delicious stuff. \n\nI've had most of the things on the menu and everything is always great! The portions are very generous, the chicken is always juicy and tender, the soup is VERY garlic-y, which is just awesome. They also have this yogurt, cucumber thing, which is just fantastic! \n\nConsidering how popular this place is, I think that everything is always fresh. Sometimes, the lines get crazy, so it's good to go early or late-ish. \n\nThe staff can be a hit or miss. The man can be a little crude... but there is that super nice lady, who knows my usual order and always chats me up and is just super homey and great! \n\nKeep in mind, there is a $10 minimum on credit cards!", "author": "Chris P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-12", "description": "Great food, very healthy, it will set you up for the day without you feeling stuffed. Definitely my go-to for lunch now as a poor student in NYC. Jamal is kind, avuncular, you will be taken care of.", "author": "Alistair S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-24", "description": "Cheap, huge portions, awesome service, and even better food. I come here at least 3 times a week for a salad, a wrap or a plate. Too good", "author": "Noah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "Love this place. Get the lentil soup, hummus and chicken shawarma sandwich. The plate portions are huge!", "author": "Jess W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-24", "description": "Good price, a lot of food, but it's just not flavorful. The hummus is plain and there's nothing to add to it. And the meat is bland. Very small selection of drinks. Also, we were there for an hour and no one ever cleaned the dirty tables. It was pretty dirty.", "author": "Robert K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-28", "description": "Good food, great service... and best of all, it's located around the block from our place in Brooklyn Heights... so I can walk there any time! Some of my favorite items include the Chicken Shawarma platter which includes grilled chicken, saffron rice, salad, and hummus. I've also had a couple of their sandwiches, which are served in pitas and chocked full of ingredients. I recommend the falafel sandwich and the grilled chicken. By the way, their hummus is first-rate, so be sure to pick some of that up, too. Another good side choice is their lentil soup--they give you alot, and it's cheap... you might have to spice it up a bit when you get home, but it's tasty! Note that I mostly have gotten take out from Heights Falafel, but they do have a few tables if you want to dine in.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-02", "description": "False imprisonment. \n\nThere were 8 other people in the small space, all eating or waiting for service. We got in line for some delicious falafel. The two employees walked past us without saying a word, left the restaurant, and LOCKED US IN from the outside. We didn't take notice of our captivity until we were left standing in line with no service for about 10 minutes.\n\nThere was no way to unlock the only accessible door from the inside. We ended up having to force open the sliding window-door and climb around the chairs and tables to escape. It took about 5 minutes thanks to the 4 different locks and odd design.\n\nImagine if there had been a fire and we all needed to quickly get out...\n\nAs we were breaking out of the joint, we were accosted by a patron who suggested that we would be charged for breaking the door. He suggested that we should go to the kitchen to ask someone to let us out. WHAT?!\n\nI still can't believe this actually happened. I dug your food, Heights Falafel, but something feels super shady about this episode. I'm not coming back, ever.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-23", "description": "I love this place.  I always stop in whenever I am in the neighborhood.  Chicken plate with a whole wheat pita + a lentil soup is a full days worth of food.  Enjoy!", "author": "Joe B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "Awesome falafel. Friend and I grabbed a falafel sandwich each and headed to Brooklyn Bridge Park to chow down during sunset. Huge sandwich, full of the right stuff, and only $3.50. If i lived in the area I'd stop cooking and would instead eat this falafel sandwich for dinner every night. \n\nThe service was a bit crazy, though, and some people that came in after us were allowed to give their order while we had been waiting. I wasn't in a rush, but the ordering system was pretty hectic.", "author": "Anya P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-08", "description": "I have never seen a business establishment be SO RUDE to their customers. It was unbelievable.\nI came here one day because I was in the neighborhood for work. The woman behind the counter looked like she was HATING being alive. She was short, rude, and not pleasant at all.\nShe was working with some man behind the counter as well. I noticed both of them be very short and rude to about 3-4 people before me. The customers waiting in line were all shocked. We kept looking at each other thinking, \"What the hell place is this?\" It was jaw-dropping.\nI was starving, so I was going to deal with it. But then, they helped an elderly lady. The woman was hard of hearing and was having trouble understanding the man. He raised his voice to her in such a disrespectful way, I couldn't believe it. He essentially yelled at her for not being able to hear him. Come on dude, clearly she can't hear very well.\nI was so appalled I turned around and walked out. Another customer came with me. We walked down the street for a moment, talking about the unbelievable rudeness of the people of this establishment.\nThey do not deserve anyone's business. Who yells at an old woman????", "author": "Joshua S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-25", "description": "Best Shish Kebob and falafel sandwiches in New York!  prices can't be beat and don't forget the homemade hummus, babaganoush and tabouli to take home.  It's as authentic as it gets!  You can have dinner for 5-7 dollars and be stuffed with healthy and delicious food made lovingly by the owners daily!  A true neighborhood institution for me!", "author": "Janet F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "The food here is great and the two guys behind the counter are very friendly. The food is all fresh and made to order. Word to the wise: it's cash only. My friend and I placed a semi large order and neither of us really carries cash, and we came up $2.00 short. The very nice owner told us it was no problem and we could pay him back next time. Friendliness goes a long way!", "author": "Chris W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "Went in expecting absolutely NOTHING. I went here with my cousin on the way back to Clark St. station from the Brooklyn Bridge park on May 17, 2013 after picking up our race bibs for the Brooklyn Half. We were just really hungry and we decided to walk into a random place and hope that it was good.\n\nWe ordered 2 shawarma plates: 1 chicken and 1 beef. It was my cousin's first time eating middle eastern food of any kind, and he loved it. I thought it was also the best I'd had. For the rest of his 3 week stay in New York City, he always kept referring back to the food at this place being his favorite of his ENTIRE TRIP. I wouldn't go as far to say it was THAT good, but I really enjoyed it nonetheless.", "author": "Alan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-13", "description": "I come here almost twice a week. The food is always made fresh and the ingredients are high quality. I'd recommend the chicken shawarma plate and the kibbee ball.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-02", "description": "Wonderful food I got the chicken shawarma platter it was very good and they give you so much of it can't complain. The gentleman behind the counter was so nice. I forgot to ask him for his name he asked me how it was and I told him amazing and he even gave me dessert for free baklava I think it's called it was so good too!!! Had a great time very happy overall.", "author": "Anthony E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-01", "description": "I go here too much. It's purely out of laziness because it's near my house. And because I'm a creature of habit I nearly always order the chicken shawarma sandwich and a cup of lentil soup. There's nothing bad about this place, nothing particularly standout, either. It's just a regular neighborhood joint that wouldn't really attract anyone on a foodie crawl through Brooklyn. I like it, though, because the employees are friendly, the lentil soup is pretty good and warming on a cold winter's day, and the chicken sandwich in a pita is filling.\n\nThere's seating inside, but if you're walking through the hood to see the architecture (which you should -- it's one of the prettiest parts of NYC), and it's a nice enough day or night, then you might as well get it to go and walk west until you hit the promenade, where there are ample benches and a killer view to take in.", "author": "Nathan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "I absolutely LOVE Heights Falafel!  The owner is very nice and I enjoy chatting with him if they aren't too busy.  Everything on the menu is good but my personal favorite is the falafel platter with a side order of grape leaves.  It comes with several pieces of freshly made falafel, hummus, rice and salad.  The rice is mild but nicely spiced.  They offer tahini and hot sauce as well if you like (I always get it).  It's a lot of food for a good price.", "author": "Jon M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-14", "description": "Solid Falafel sandwich, hot sauce could have some more heat, but overall very good. \nMeat Pie is good. Dipped in the not so hot sauce for bit more flavor. \nChicken Shawarma platter is large. Nice flavor not too spicy. \nGreek Salad is big, enough for two. \nLentil soup is good. \nDelivery is fast.\nService is friendly.", "author": "Ben P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-03", "description": "Was back in Bklyn today for a quick bite and Heights Falafel really hit the spot! Ever since I stumbled upon this place, I've always come back for more. I love their Falafel sandwiches, especially the \"Special Falafel\". (The baklava was pretty good too). \n\nThanks Heights Falafel, you made my day! :) Will definitely be back soon.", "author": "Candice F."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Heights Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3Nb4x2k83_T4xVljsYp1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184880808"}