{"aggregateRating": {"reviewCount": 220, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-27", "description": "Hits the spot! There isn't much cheap on-the-run food around these parts, and so when I'm exhausted after work I am always happy to stop in Heights Falafel on my way home from the subway.\n\nFirst time I came in, I was standing outside looking at their price sign out front and a nice gentleman said to me\n\"Young lady, go in -- is very good. Get the chicken shawarma.\" \n\nThank you, gentleman. I appreciate it. That sandwich rules and is so god damn cheap. Their baklava rocks also.", "author": "caitlin o."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-11", "description": "Yummy! It's the perfect place to stop in and get something to take with you down to Empire-Fulton Ferry park for a picnic, or a movie, or whatever happens to be going on. The falafel is nicely spiced and the bread is good. I haven't had anything else- except the baklava, which is just what you expect--sticky and messy and falls apart in your hands.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-22", "description": "Great lunch place. The sauce on the shawarmas is really good, as are the bakalava, and it's all pretty cheap.", "author": "Carlo C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-14", "description": "I'm a shawarma snob. The dudes here are affable, but this joint doesn't cut it.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-22", "description": "Not bad for a place that looks like a shit hole.  If you are lucky you will get one of the 10 seats, but if not, at least  you will have good food to go.", "author": "James A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-11", "description": "Went here cause I found myself in Brooklyn Heights at the Department of Education.  Although that was a wasted trip, coming here was not.  Was super-crowded when I showed up. Friendly staff who handled it quite nicely.  It was empty as I sat there eating, as most people get food to go. Paid $5 for a falafel and Snapple. Quite a good deal if you ask me. Would go back if in the neighborhood.", "author": "Scott L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-04", "description": "Excellent food, good prices, friendly staff, quick delivery times. An unheralded gem.", "author": "Ron M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-04", "description": "This is a great place for lunch or a quick meal. I've tried the falafel and grilled chicken sandwcihes, and both were made to order and excellent. Everything on the menu is very reasonably priced - $3 for a falafel sandwich, $4 for a meat sandwich, $2 for the spinach pie. The small seating area can get full at lunch time, but on nice days you can just take your food to go and eat in nearby Cadman Plaza park!", "author": "Clare B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-28", "description": "This is the best hole-in-the-wall eatery in Brooklyn Heights. The prices are pretty cheap compared to the other places along the stretch of Henry Street. The food selection is healthy and the portions are huge.                \n               \nI love the dill spiced fava bean salad! I'm also a fan of the shiraz salad composed of diced tomatoes, chopped cucumbers, onion, parsley, and plenty of dill...all suitable for a Mediterranean diet.          \n                 \nOn a hot summer day, I'll treat myself to the cucumber and yogurt soup with crushed mint leaves. In the winter, I'll order the spicy lentil soup with pita bread ($2.50) and 2 big falafel balls($1). Both are very filling and enough to be meals on their own.  \n                                           \nI discovered their soothing mint tea ($1) is the perfect remedy for a cold. Although they do not serve liquor here, you are more than welcome to bring your own.", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-05", "description": "Best lunch deal in the neighborhood.  Thumbs up on the kibbe, the lentil soup, and the meat pie.  They pack them in at lunch for good reason.  Great food, good prices.", "author": "Jack F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-17", "description": "I had a Falafel. It was good. It wasn't great. Maybe I'm just spoiled because I've had really great Falafel in NYC, but I wouldn't run over to eat here again. On the plus side, the price is right, the portions are gigantic, and the long line moves super quickly because the guy behind the counter can handle 5-6 customers at the same time (literally - I mean, it was a sight to see). The food itself was just OK. The Falafel fell apart way too easily (super thin pita?), so about two bites in I was using a fork. The Falafel balls were very dense and dry. The hummus had way too much Tahiti in it (runny and tangy). I ate half and threw the other half away, which I didn't feel bad about since it cost less than $5. I'd consider going back to dry the grape leaves, but I think I'll pass on the Falafel.", "author": "S H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-07", "description": "You get what you pay for. This place is cheap, and has decent falafel.  But the service couldn't be worse -- we have literally never gotten a correct delivery order.  I guess it's our fault for ordering again and expecting a different result, but how hard is it to get two sandwiches and a salad right?  So frustrating.", "author": "Meredith H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-07", "description": "This place is awesome. You can't go wrong with a beef schwarma platter for $8. Food is very good overall.  The owners are really good guys, they they will accommodate you if you want to swap sides.", "author": "Michael K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-14", "description": "solid food, cheap as hell.  have only ever had the chicken shwarma, but it is delicious.  the place seems like it's family run, and they have all the traditional middle-eastern salads and stuff in a display case at the front counter, along with the baklava.  it's kind of a mish-mash of middle eastern cuisine, but really, for $4, it's the cheapest non-pizza in the neighborhood, and it's great for the price.", "author": "Anna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-24", "description": "I heard about this place from a neighbor for years, but seldom in the heights - boy what a find! delicious falafel, hummous and taboule. My friend \u0026 I gorged ourselves but somehow couldnt refuse the yummy pastry - which was delish - flaky and light, not heavy and dense as middle eastern pastry can be.  Family run, friendly service.  Seemed busy at lunch time, but not much room to sit, so in good weather i'd probably take it to the promenade.  Will def. be back ...", "author": "South S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-09", "description": "Simply inedible falafel. Try almost any place in Manhattan and you'll never return to this terrible restaurant.", "author": "David C."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Heights Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3Nb4x2k83_T4xVljsYp1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184880808"}