{"aggregateRating": {"reviewCount": 220, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "There's a real dearth of solid and affordable lunch places in the area, but this place really delivers.  The chicken shawarma is awesome, and the hummus is great too. Also it's all made fresh.", "author": "Ryan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Awesome. Very good falafel platter. Everything is excellent. I would recommend coming here for quick and fast middle eastern cuisine.", "author": "Ana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "Great place. Love coming here when I'm in the area. It is so delicious and the prices are very good for A LOT of food. The owners are great and I look forward to catching up with them while waiting for them to make the order up fresh. HIGHLY RECOMMEND.", "author": "Sam O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-08", "description": "As I write this, I am enjoying, once again, the wonderful falafel sandwich from Heights Falafel\nI have had this sandwich many times over the last 9 months or so, and it never ever disappoints.\nIt is a near perfect combination of fresh ingredients, well-seasoned, tasty, and well-priced. I sit here savoring every bite because I know that, as much as I love the sandwich, I will not have one ever again. EVER. (If the rating was for the food alone, it would get a 4, but...)\n\nWhy will I not, you ask? Because my integrity and dignity trump my taste buds every time, and I am tired of being treated poorly by one particular person in this establishment. It happens time and again, and it is too consistent to be random or unintentional, despite my continuing to give this individual the benefit of the doubt. So I will vote with my feet, and take my hard-earned money somewhere else.\nEvery time that I enter this establishment, EVERY TIME,  I am given a skeptical, once over by this individual, and grudgingly, nearly wordlessly served, while others who enter are given conversation, pleasantry, and 'Thank You'. I am NEVER afforded this. At least by this individual. It is frustrating and disheartening. Today was the final straw, (and as a result, the final sandwich)\nI entered, and the individual was sitting at one of the tables, apparently on a break. I nodded, as always, and was greeted (as always) by a cold smile-less stare. I walked to the counter, and placed my order. \nApproximately 30 seconds later, two people entered, people of both different hue and ethnicity than I.\n(Please know that the mention of this detail is not to make a claim of any kind of bias per se, because I did see this individual exchange pleasantries with someone of my same ethnicity and hue once, right after being rude to me, so it could be just me that the individual has issue with. Then again, he did have on a suit, and I didn't. Ironically, it was someone who I knew and had not seen in about 30 years, so we had a quite nice reunion, as the individual looked on... ) \n\n The individual got up quickly, went behind the counter, donned gloves, and proceeded to take (with pleasantries) their order. It was embarrassing and purposely so.\nSo just as purposely, I write this post and vow to:\na) Never set foot in the place again and \nb) Let everyone that I know about the shoddy and disgusting treatment that I have continued to endure at the hands of this individual.\n\nSad but Not sorry.", "author": "CT J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "This is where I go to get the best falafel in Brooklyn Heights--crispy outside, moist with a hint of cinnamon inside. I get four balls on top of salad, two for me and two more for me!  The added bonus is the banter with the friendly staff. Dinner for under $10!", "author": "Kristen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "Oh my god!How did I not know about this place for so long?I feel like I had my head buried in a hole in the ground. This is hands down the best shawarma and falafel I have eaten in the city. All the Mamouns and Baba Ghanoushes of the world can't compare with this.\n\nThe first time we ordered in,I had a chicken shawarma sandwich and a meat pie.The shawarma was ginormous,filled with perfectly cooked pieces of chicken and tahini and hot sauce. My biggest gripe with other such places are how uncooked the meat tends to be at times but that is definitely not a concern here!\n\nThe meat pie was good , kinda like a roll filled with ground meat.The shawarma and falafel plates are huge,filled with hummus and salad and grapeleaves and all sorts of yumminess.For under $10, you can easily make two meals out of it. The super tasty falafels are massive and very filling.The kibbeh ball is another must-eat, perfect for a snack.\n\nThe seating space is nothing fancy,but is sufficient for a quick lunch and the extremely affordable pricing makes it worth the 15 min walk from office on days when we don't wanna wait around for delivery.Overall,an optimal lunch spot!", "author": "Aparna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-23", "description": "The food is amazing, my coworkers and I were well taken care of. Such a nice owner!!! If you value your taste buds you'll eat here", "author": "Caleb W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "Always come here with my friends and they began recognizing us. They always start a friendly conversation with us. The food here taste very homemade. The price here is very affordable considering the neighborhood. The service is quick and convenient.", "author": "Angela K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-24", "description": "Great place, awesome prices, and friendly. Told him about my allergies and assured me that I will be taken care of.", "author": "Sonash N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "Tried this place at the recommendation of a friend and it was amazing. Had the chicken shawarma sandwich for $5 only. They were very generous with the portion of meat. And the meat was perfectly cooked. The wait was very short, which was perfect for me since I had a short lunch break. \n\nEasily the cheapest and most satisfying lunch I've had in NY. Will recommend to all my friends if they ever pass by here.", "author": "Anna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-05", "description": "Great place run by very kind man who really takes pride in his food. The soup and chicken over salad are great, especially for price and given lack of affordable, semi healthy options around.", "author": "Evan F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-13", "description": "I just tried the falafel sandwich and I was not disappointed.  At only $3.50 it's a great bargain. They don't skimp on quantity and quality. Good flavor. \n\nI tried the chicken Shwarma a couple weeks ago and that was great too.  If you're close by, check this place out.", "author": "Nick T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-24", "description": "Bland, tasteless food lacking any love at all. What a shame. Our neighborhood really needs a good falafel spot, but this is not it. With any luck this tired old spot will disappear and make way for something better. Next time I'll go find the Taim truck or take the ferry up to Mogador in Williamsburg....no contest here.", "author": "Simon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Wow super delicious falafel. Words can't describe you have to try it yourself. Friendly staff as well Jamele is super chill. Rice pudding is Mmm too.", "author": "Doyun K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "Had the Shawarma plate and was really good. They serve each plate with a pita bread for you to make your own sandwich if you please. The tahini sauce was really good and the hot sauce wasn't that hot. Pretty good place.", "author": "Gonzalo B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-23", "description": "4.8 stars, one of the best in the city. Takes forever but amazing.\n\nShort review:\n\n++\nMujadarra is amazing (5)\nSize of the sandwiches\nInexpensive delicious mint tea (5)\n\n+\nPerson in front was really kind, I mean more than almost any other place\nDishes were massive\nKufta was very good (4.5)\nFalafel flavor (4.5)\n\n+=\nSpinach pie (4)\n\n=\nLentil soup (3.5)\nHummus on my plate (3)\nPrice is a bit high for my main dish\n\n=-\nBird's nest (kinda, more the portion size ironically, 2.5)\n\n-\nTakes forever to get the food\nVERY hot in there.\n\nLong review\n\nWas even better the 2nd time. Kufta place was very good. I rarely like Falafel and the other person's falafel was good. Sandwiches are probably the largest in the ctity. Their spinach pie was good and massive. Nice and a bit sour. Lentil soup was ok, but kinda Indian tasting which was interesting.\n\nVery good and inexpensive Mint Tea.\n\nBest dish by far was the Mujadarra. It was a mix of lentis, rice, and sauteed onions. Super large portion, just amazingly flavored and well recomended. Good to bring home as well.\n\nBird's nest wasn't sweet but I didn't mind as the rest of the food was not rich at all.\n\nGuy in front was very nice and we had a good conversation afterwards. Takes a long time to get the food but oh well. It was really worth it. Easy to get to through subway.", "author": "Glenn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "I came in to order and Gamel was such a charming person! The falafels are bigger and fresher than the ones you'll get from a stand. Come here instead! Great food and fantastic service!", "author": "Vivian N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "I'm into the chicken \u0026 falafel sandwich....maybe that's not normal, but I like it. Originally I was turned off because I'm afraid of pita pockets. Got over that here because the pita tasted fresh. Tasty sandwich at a great price.", "author": "Danny R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-07", "description": "This is my new favorite spot in Brooklyn! I stopped by for lentil soup and food to take home and I was blown away by the quality of food and kindness of owner+employee. Highly recommend", "author": "Emily P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-15", "description": "We ate off styrofoam, and the serving plates probably came from a Japanese restaurant. Dry, dead plants were perched high on shelves. Some of the prices on the menu board were rewritten in Sharpie. Which is to suggest that this is classic book-cover-judgement situations. I stopped in for a late lunch: lentil soup ($3), six grape leaves ($3), chicken shawarma sandwich ($5), all of which *could* have deliciously, easily, and quickly fed a family of three. Not three teenage boys, mind you, but a Spaniard, small Asian woman, and a child, for sure. As I left, I overheard another customer say, \"that was so delicious; thank you.\" Good, cheap, and fast. That's what sort of place this is.", "author": "SJ M."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Heights Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3Nb4x2k83_T4xVljsYp1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184880808"}