{"aggregateRating": {"reviewCount": 220, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-23", "description": "Came here on a Saturday. There was just one guy ahead of me, and I ordered a chicken shawarma. The guy behind the counter was super friendly and quick with preparing the food. I've had better shawarma, but it was cheap and hit the spot. Would definitely return!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-17", "description": "I LOVE this place. Get the chicken shawarma or falafel as a sandwich or platter: the price CANNOT be beat, the portions are super generous, and the tahini sauce is the best I've ever had. The guys who work here are hilarious--I have had many a deep, philosophical conversation with them while waiting for my food. I'm pretty sure this place is cash only, and I recommend getting it to go as there is limited seating inside.", "author": "Emily H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-10", "description": "I went there because I just moved to Brooklyn and had a hankering for falafel.   While waiting to place my order, a small flying insect landed on my lip. I looked past the disgustingness of the incident and decided to order anyway. I made sure before I placed my order to scan the room to see if there were any \"cash only\" signs. Small places like this, you never know. Spotted none, so I ordered my falafel platter. I was so excited when it was ready, grabbed for my card and low and behold, I'm told they don't accept cards. I was willing to go to an ATM to get cash but the two men behind the counter were so nasty about the whole thing like I was so dumb I should've known, I didn't bother. The place was dingy anyway, so I'm ok with the fact I'll never step foot in there again.", "author": "Shirleen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-21", "description": "Delicious, perfectly cooked falafel. Put that on a huge platter with equally delicious sides for CHEAP - you have a very happy me. They have great grape leaves. The tabbouli is fresh and yummy, as are all the other salads. The hummus and pita are simple and delicious. Can't say anything for the meat dishes but the veggie stuff is all superb!\n\nAlso, the dudes working here are very friendly.. and speak French, which is just a weird plus for me.", "author": "Jessica N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-31", "description": "Delicious falafels here, light, crispy \u0026 perfect served with all of my favorite sides.  The value is incredible, and all of the friends I have referred have all enjoyed everything on the menu.  There is always a line but it moves quickly.  Highly recommended.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-16", "description": "One of the best falafel places I've been to in NYC! Expect a bit of a wait and not the best environment...but a full 5 stars for the food!", "author": "Lisa O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-02", "description": "This place is positively habit-forming.  If I ever have to stop eating falafel due to some horrible accident, I think I will need a 12-step program to fully get over their soft, green falafel balls.\n\nOddly enough, my first experience with Heights Falafel wasn't that great, I think I had the flu that week or something.  But I've been ordering a falafel sandwich here about once every few weeks this summer, and they have been consistently fantastic.  The bright green falafel is perfectly crumbly and moist, not those hard hockey-pucks that the street carts subject you to.  The roof of my mouth is intact, and my belly is full.  I am a happy girl.", "author": "Carly D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "Both the chicken shawarma sandwich and plate are some of the tastiest I've had anywhere. The only reason I don't eat here a lot more is because in the wintertime spending one minute in the shop makes you smell deeply of seasoned chicken for many hours.", "author": "Prentiss M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-30", "description": "Nice falafel, grapeleaves, and egg plant salad.\n\nThe falafel sandwitch is overstuffed with a massive amount of salad etc, unless you ask otherwise..  I ordered a shawerma sandwitch and it camin with enough salad in it to fill a decent size plate.  Nice for those who like this kind of thing, but it is no longer a sandwitch. You have to sit down. With fork/knife to tackle it. It is mechanically impossible to handle like a sandwitch because of the sheer size and the fact that the pita is so brittle, it broke down to pieces and contents dripped and scattered..   So, order the usual if you will sit down, or else, ask for half the volume of everything in the sandwitch... For me, a normal iddle eastern shawarma is a third the size and can be hand held like a sandwitch", "author": "Mohamed S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-22", "description": "HORRIBLE DELIVERY\nThe food here is OK, but NEVER order delivery, not only did our food take an hour and a half to get to us (5 blocks away) but they only delivered half our order and charged us for the whole thing. \nAs soon as we realized we were missing half our food we called them and they said we were lying and refused to deliver the rest of our order. \nI have NEVER had this happen before at any establishment. \nThe food is not bad, but the treatment we got from them was unforgivable. I will never be eating there again.", "author": "Priscilla P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-02", "description": "Ok falafel sandwich, nothing crazy. Hot sauce was basically nonexistent and tahini was kinda watery. For $5 filled me up though. I'd come back to check out the pastries and spinach pies. Zero ambience too, basically just a takeout counter.", "author": "Bill B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-05", "description": "This is one of my go-to lunch spots in the area as I work across the park from here.  I rotate among the veggie platter and make-your-own-salad.  The hummus is solid and the baba ghanoush is really good.  It's usually my cheapest lunch at $8ish when I go for the platter.  I recently discovered the lentil soup, which is simply put, excellent.  I love to get that and supplement with some veggies from home.  Bread is not homemade, but that's okay.  The husband and wife who run this are amusing from time to time, but when he's having a bad day, you want to get in and out.  On good days, though, you might end up with a free grape leaf or honey cake!", "author": "Martha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-17", "description": "The portions here are generous and it isn't very expensive. The falafel is pretty intense but still good. The only real problem is the limited space you have to order and eat. There are usually about 5 or 6 people standing on top of each other trying to determine who has ordered and who is still waiting. For a little extra amusement, observe the strange sexual tension going on between the woman at the counter and the guy in the back. It can't be just me that notices it.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-01", "description": "Came here because we couldn't get a table for lunch at Siggy's. \n\nThe good: Tasty falafel at very reasonable prices. The salad packed into the sandwiches was very fresh and delicious. I'd go back just for the salad. Maybe with some shawarma meat on top.\n\nThe not so good: Owner(?) was a little cold...and didn't seem to like that I wanted to put a little extra tahini on my sandwich. Falafel was tasty but not any different from the greasy mushy version available at so many street carts. \n\nThe bad: Stomach ache within 20 minutes of eating. Things were not pretty a few hours later. Maybe it was the extra tahini?", "author": "Craving Cholent X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-31", "description": "I work in the area and the Special Falafel finds its way into my lunch rotation once a week.  Good hummus, good baba, good portion, and under $5.  The best part is it taste's the same every time I get it.  Do yourself a favor and incorporate this into your lunch options.", "author": "Derek S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-05", "description": "yay! falafel combo platter with tons of it. it was a great deal and super delicious!\nthe falafel flavor is pretty intense but the size of their servings are very generous and the staff are super friendly here.\nthe spinach pie is also really good and on the tangy (read: tart/sour) side\ni will definitely be back!", "author": "M L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-09", "description": "Ha Ha its true about the grumpy guy at the counter, but its a small place and can get hectic.   The lunch crew are much more chill  So ignore grumpy and go in any time of the day for the great food", "author": "Cynthia H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-11", "description": "I've lived in the neighborhood for almost 2 years now and visit Heights Falafel at least 2-3 times a month. Everything is very fresh and cooked to order. Their lentil soup is delicious but you have to get it early because when it's gone--it's gone! I think I've had the falafel and grilled chicken in every possible way - on a platter, in a sandwich - and they don't disappoint. My only complaint is that although they take credit card for some reason they never accept it after 9pm. It's weird. It doesn't stop me from going there though. Oh! Make sure to get a baklava for dessert - delicious!", "author": "Shannon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-26", "description": "I've only had the chicken shawarma so far but it was great, just under $10 and had big enough portions that I felt stuffed. I probably only waited a few minutes and didn't feel that it took long at all. It was probably the same amount of time waiting at a halal cart (but cleaner!). Besides that they seemed to have a decent selection of things that I look forward to trying. The seating area is tiny but I like to get takeout anyway.", "author": "Katie J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-20", "description": "eh... totally not what I expected. got the falafel sandwich. it tasted kind of strange, maybe it was burnt?? kind of bitter and the sauce was not very good. the whole sandwich just doesn't really go together. the vegetables didn't taste fresh.\nthe workers were just lying around on the bench in the store. it was kind of strange. maybe their break time? did I go at the wrong time?\nit was cheap, less than $4, but no thank you.", "author": "Ai L."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Heights Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "78 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3Nb4x2k83_T4xVljsYp1GQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184880808"}