{"aggregateRating": {"reviewCount": 91, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "This is my go-to spot for ramen -- love the Ibusuki bowl! Service is really quick and staff are friendly.", "author": "Aileen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Both food and service was really great.  I ordered one of their ramens and the broth was so good. Salty enought to give it flavor but not too salty where it makes you bloated.  We also ordered the takoyaki which was delicious, it had a light peanut sauce that paired well with the deep fried crispiness.  Place is small and only had one server but we were the only couple in the place, however we did go before the evening rush.  I would come back again to try out their rice dish.", "author": "Dora C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "This was our first time here and the food was decent. The restaurant is fairly new. I have high standards when it comes to Japanese food! We got gyoza for the appetizer and it was a bit cold. The ramen however was good. We got the Kagoshima and sakurajima. If you like spicy ramen I recommend the sakurajima. I love hot ramen so I requested them to make it extra hot and the temperature was perfect. The way they cooked the ramen was great.", "author": "Rina I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Ramen has great broth with deep flavors. Noodles have great chew to them. Absolutely delicious! Takoyaki here was great as well. Big pieces and delicious!", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-16", "description": "Tried their new menu today.  It was Delicious!  Great service and terrific ramen.  Definitely get the octopus balls.  I loved the balls.   Close to Alamo and lots of other spots.", "author": "Nick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-06", "description": "Flavorful broth.  Would have liked a bit more noodles to slurp up the rest of the soup!", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-16", "description": "Perfect place for a cold night!  I got the spicy miso veggie ramen which was still very flavorful and filling without meat. Next time I'll ask for extra spicy though, a little too mild for me.", "author": "Brittany P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "The lunch special here was great especially the eel donburi (all for $19)!!!  Highly recommend the eel and veggie spicy miso ramen", "author": "Afaf I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "This place is on the block with our hotel and I've wanted to try it since spotting it the other day. Finally made it for lunch with family.  It was terrific - we had ramens and rice bowls.  Everybody was absolutely satisfied with their delicious meals.  Very friendly and welcoming staff.  I'm hoping that I have time to go back on this trip!", "author": "Jim T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-29", "description": "We got here on Sunday at 2pm and business is closed with no sign. Called with no message. Disappointed", "author": "James W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-05", "description": "The ramen is average. \nNot really surprising. I think it is not comparable to other ramen.\nThe green tea is disappointing. I believe she made that using powder.", "author": "Kai L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-25", "description": "Pretty tasty ramen. I just wish that it's not that expensive. The rice dish is good too.", "author": "Mira C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-10", "description": "The soup base us not as heavy as most tonkutsu ramen, maybe because of where it origins. The flavour cannot stick on the noodles probably because of the lighter soup, but if you don't like heavy noodle soup you may like it. Like I said, it may be the style where it origins. The texture of bean sprouts in the noodle is really good, adding different layer of texture to the ramen. The half boiled eggs is just how it should be made, Jiro should have the credit here. I'm always wondering why so many ramen restaurants don't even care about the basic - the egg. Chashu is just OK, partly because it comes in cold. I got the spicy ramen while my wife got the normal one, the chili oil just doesn't add much to the ramen in terms of complexity of taste and smell, nor is it too spicy. I was a little bit disappointed and I didn't finish the soup (normally finishing the soup of a ramen should be a compliment)\nThe ramen is in general good. But compared to the other good ramen I had before, it just doesn't stand out.", "author": "Bin W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "decent noodles. gets a little bit boring mid wway thru. shud have gotten the spicy one. the gyu don was always decent. when i eat out, I like to eat food that I can't or dont want to cook. that said, I cud defs cook the gyu don just as or better. \n\nbut I give it 4 stars cuz it's Japanese run. it keeps the authenticity. \n\noverall pleasant.", "author": "Jun J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "Everything was delicious. I was surprised to find grilled ika and ika karaage. Great place to eat.", "author": "Cyril D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-23", "description": "I have to give it two stars for a couple of reasons:\n\n1. Compared to Chuko, the now-closed Ganso, and Kambi in Manhattan, they serve a miserly amount of pork. Seriously, it's like they cut one piece of bacon in half. \n2. Instead of Japanese greens, it's iceberg lettuce served as the veg. By the way, I paid extra, even though many places include it. \n\nRamen itself is ok--good chewy quality. \n\nFried octopus balls were decent. \n\nLastly, I found it fairly expensive.", "author": "Food Jerk X."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-12", "description": "Too expensive. The basic noodle is not worth the amount they charge. The soup is good. The base pork is not soft enough. Nice try, just not the amount you will pay. No bang for the buck.", "author": "Sam Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "Ramen bowl was amazing! I had Dumpling for the topping. Even though it sits in the soup, it's still crispy. One of my favorite ramen place now. It's a favor explosion.", "author": "Eva Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "I'm from out of town. Stopped by here because of a friend's recommendation. Glad I did! The veggie miso with wooden ear was amazing.", "author": "Jay S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-14", "description": "new favorite ramen spot in downtown bk! loved the takowasa appetizer - perfect wasabi flavor and fresh crunchy tako. my wife and i shared our ramen broths, both were delicious. fast and friendly. will be back again", "author": "Adam F."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Menya Jiro- Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "306 Gold St\nSte C2", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/2L4Kumk7bneHC3fiDiVaBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188550988"}