{"aggregateRating": {"reviewCount": 91, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-14", "description": "Edamame embedded Tofu nugget is quite unique. I ordered lunch set, price was reasonable.", "author": "A B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-26", "description": "Tried this place out a few weeks after they opened this location. \n\nBROTH: It was watery and bland with no depth of flavor. I hate to say this, but part of me believed that istant ramen flavor packs would have been better.\n\nTOPPINGS: Default toppings don't go well with the composition of the dishes: pretty much all scallions and beansprouts. Scallions and beansprouts have a strong flavor, and it drowns out the rest of the ingredients. They're also really cheap ingredients, and it annoys me that they add so much of it and skimp out on the rest. I really don't like having to pay extra for eggs in ramen, but my boyfriend did, and it was only half an egg. It was also overcooked.\n\nNOODLES: Both of our noodles were too doughy and soft. Possibly overcooked, but also might just have been the odd thickness of the noodles.\n\nSERVICE: Decent. Not much to say here--we were the only customers present, so our waiter was able to see when we needed more water, etc. \n\nOverall, I'm not impressed and will not be returning.", "author": "Kimberly C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-10", "description": "They now have beer/sake etc. Impeccable service continues. Still one of my favorite spots in the neighborhood. Friendly attentive staff, nice atmosphere and great ramen. Can't go wrong!", "author": "Katie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-11", "description": "This was one of the best ramen I've eaten. The pork bone broth with chicken was delicious as it wasn't too heavy as a regular tonkatsu broth. The service was excellent and the staff was very friendly and greeting. I will definitely miss this place when I head back to MA. As for pricing, its NY so its on the pricey side. But worth the money!", "author": "Samantha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-16", "description": "Stopped by Menya Jiro during lunch with coworkers and the experience was awesome ! Food came out fast and water was always filled. \n\n\nThe Ramen was AMAZING. I got the Ibusuki Ramen. Rich in flavor, noodles were soft, simply amazing. Definitely one of my top 3 Ramen spots and will become a regular lunch spot .", "author": "Jonathan P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-01", "description": "Soup: 2/5\nNoodles: 4/5\nNoodle density: 4/5\nCha-shu: 4/5\nToppings: 4/5\nTemperature:3/5\n\nOmg what is happening... I was so impressed their ramen in Fi-di location, but tasted like completely different soup... No koku (umami) at all and came with terrible temperature. So disappointed.", "author": "Sasori Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "The lunch set is pretty worth it if you're around during lunch time. It's one ramen with two additional toppings and a mini salad for $14! Totally worth it. The staff is very friendly and the restaurant is cozy. Will come back again.", "author": "Alice T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-23", "description": "Um what happened to my Japanese place downstairs? \n\nDowntown Brooklyn really doesn't need another overpriced ramen place. Within a 20 minute walk, you could grab a bowl of ramen that's overpriced and all taste kind of the same in this neighborhood so yeah this review is a little biased since I'm upset this replaced Jun Shokadu, which I liked. This place tastes alright, but was way overpriced for a tiny bowl of noodles. We paid $40+ for two bowl of noodles and we were still hungry. \n\nDon't give me that the broth takes 12 hours to make to justify the price. Which Asian noodle broth doesn't take 12 hours to make? Manhattan has way better reasonable alternatives for ramen although I wish this fad would die down.", "author": "Connie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-17", "description": "Really happy to find this ramen place (sort of) close to my apartment.  The pork/chicken broth combo was very flavorful and I enjoyed the spicier Sakurajima version (not as spicy as I would normally opt for, but still good).  The toppings are sparse - 2 pieces of pork belly and a handful of bean sprouts and green onions.  The one gripe I have is that It becomes an expensive bowl of ramen, once you add in the ajitama and menma for an extra fee- both items which would normally be a part of a standard bowl.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-14", "description": "This is a really cute little gem. I love a ramen spot with options. I had the spicy ramen and it was delicious. Also the apps are good. If you like spam they also have that for you!", "author": "Jess A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "When I moved from LA to Brooklyn, I was so sad to leave all my favorite ramen places behind. I was intrigued when Menya Jiro opened, and even more excited that the ramen was delicious. The spice level is spot on and the broth is well seasoned and flavorful. Happy happy belly... \n\nThe service is very fast and the servers were all very friendly and welcoming. Welcome to the neighborhood, we're very happy to have you here!", "author": "Kristen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-16", "description": "Great ramen spot! Probably one of the best ramen spot in Brooklyn. Ibutsuki ramen is my favorite. I come here 2-3 time a week. They also do delivery via uber eats. Fast service with great staffs! Highly recommend this spot if you love ramen.", "author": "Hao W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-10", "description": "Went in for dinner. It was around 80 something degree out, and there was little to no air conditioning. The whole time while eating, we were basically sweating and just want to get out as soon as possible for some air. \n\nNoodles were good about a 3.5 star. Not the best ramen I had before. \nCustomer service was decent. \nBroth: too salty\nPrice: a little too high since it was only 3 thin slices of porks and mostly all scallions and bean spourts. \nSpace was small, very hot, and the tables were somewhat sticky. \n\nOverall experiences 2 stars.", "author": "Mei G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "Cozy, welcoming spot for yummy ramen in downtown Brooklyn, a needed addition to the neighborhood. The combo of pork and chicken broth was well balanced and flavorful. The staff and owner are very friendly and attentive. Service is also prompt - perfect place to drop by for a quick weekday dinner with or without company.", "author": "Christine L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-14", "description": "The broth was off the hook. Noodles were cooked to perfection. My only complaint was not enough side choices", "author": "Guy J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "The ramen is terrific, even in warm weather (recommend getting the spicy broth and adding gyoza), but for those who prefer a bit of variety, they recently expanded the menu. Only tried the gyu-don so far - wonderfully sized portion, and very tasty. For me, Menya Jiro lands somewhere between a trendy Japanese gastropub and authentic, home-cooked comfort food. \n\nBest of all, the service! They have always made me feel welcome here (I'm usually eating on my own), and stop over to say hello / chat.  Zoe, the young lady who's moving onto her 3rd year here is THE BOMB! A+ and thanks or being sooo cool!", "author": "Michael T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-02", "description": "So good. Definitely my go to Brooklyn ramen spot. Close to home and easy to get to. I'll be back", "author": "Sean T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-20", "description": "It's a warm and cozy restaurant. The staff is friendly and nice. Ramen here is great.", "author": "Arashinder D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Fast and delicious! Broth is yummy! Service was quick as well. I ordered the Kagoshina and would definitely get again! Sunday afternoons are a perfect time to go with no wait and plenty of available seating.", "author": "M.D. H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-30", "description": "Every time I grab food with my best friend, we always go for ramen. This place happened to be in the area where we were running errands, so it was convenient and parking was not too bad to locate. When we walked inside, we were greeted and were seated at our table. My best friend and I got the same ramen, which was the spicy broth one. We're really all about the broths and this establishment exceeded our expectations. Not only was the broth AMAZING, but we also got an egg. Usually at most ramen places, they only give half an egg but this one gave the whole thing \n\n10/10 would go again", "author": "Nathena D."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Menya Jiro- Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "306 Gold St\nSte C2", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/2L4Kumk7bneHC3fiDiVaBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188550988"}