{"aggregateRating": {"reviewCount": 91, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "If you have tried Ramen in Japan you can tell menya jiro ramen is real Japanese Ramen. I don't know how many times I disappointed to the ramen in NY but after I met menya jiro at Ramen contest by APANFes I totally fell in love with their Ramen. I have never though I can try real Japanese Ramen with affordable price. \n\nAs I am big fun of garlic I always eat IBUSUKI and extra garlic ( which is free) second favorite is veggie miso ramen, it is vegetarian ramen but it has rich flavor of miso and soy milk. I would say it's guilty free ramen haha \n\nPlease give menya jiro try! It is really Japanese Ramen!", "author": "Mayumi T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-09", "description": "Always excited to try a new ramen joint in the area!\n\nWe went with a bowl of Sakurajima and Ibusuki and the Tako Karaage (octopus). Overall, everything was enjoyable. However, I have to agree with some reviewers that the broth is a little \"one-note\" or not far off from making your own ramen with a packet. \n\nThat being said, we enjoyed it as we enjoy all ramen. I'm not sure we will order from here much at the $15 price point. Perhaps for $10-12. \n\nI will say that the staff is super friendly (I picked up to go) and would encourage others to try Menya Jiro.", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-22", "description": "This is super.close to where I live and I decided to come and give the Ramen a go since the nearest other ramen place is a 10min walk away. \n\nI was seated right away on a Friday evening at 7pm. I was 1 person so I could easily slot in at the counter. They seem to have a roaring takeaway business as I saw them spend more time working on plastic bowls than ceramic!\n\nThe Ramen came - I ordered the spicy Miso ramen which is all the fashion nowadays. It was a solid 3.5/5. Its good but didn't blow me away. The spice was good - not too hot. There was a few too many bean sprouts for my liking. And weirdly they had not cut the egg on half - which made it hard to split and eat. \n\nSo overall I would put that at 3.25/5. I'll be back but more because of the proximity to home than the excellent quality.", "author": "Neelakantan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-03", "description": "Much has changed since opening to happily to the upside.   Service and food preparation was excellent!   Will be back for more", "author": "Jj L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-09", "description": "I had very high expectations coming in. The interior is very small and cute, love that for a ramen resturaunt. It also wasn't very busy, we sat very comfortably. \nwe ordered the Salad, $10, which I feel is very expensive because there was not enough ingredients. I would love it if there was some avocado. It was too plain. but i love the yuzu wasabi dressing, it was very appetizing. \nI got the Ramen with the black garlic oil. It wasnt very oily, and not salty at all. That is the good side. BUT, I feel there wasnt enough flavor. When i got to the bottom of the bowl, there was no more garlic flavor, and i only tasted the noodles. \n\nWhat disappointed me the most was the chashu. It was ALL fat. I felt cheated, so i asked for another piece of chashu because all i got was FAT. They did give me more chashu tho, thank you. \n\nThe chashu was very cold and no flavor. \n\nThis place has potential, please fix the chashu.", "author": "Rebecca Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "Delicious ramen - hot and cold! Everything was flavorful and had a great texture. The sashimi salmon they have is a little bland though... save your $4.", "author": "Sophie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "The prices are very high, but with the dearth of ramen places in this neighborhood, you sort of take what you can get, especially if it's tasty. \n\nThe tonkatsu broth here is very flavorful (a bit fatty for me but many people prefer this). I like the selection of toppings and the cashu isn't overly dry as I've found in so many American ramen spots. \n\nUnexpectedly the onigiri is absolutely delicious! The rice is cooked perfectly and the little fried octopus and kewpie mayo makes it on par with onigiri I've had in Japan. \n\nWhat I really love about this place is the consistency of delivery. Everything is packaged well and arrives on time or early. Please keep up the awesome delivery service, Menya Jiro!", "author": "Kathryn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "Our experience for lunch at Menya Jiro is unmatched in the ramen department!  \n\nMy co-workers and I quickly stopped in during our lunch break and were impressed with the speed of service.  Food came out fast, water was never empty, and had our bill with plenty of time to spare in our limited lunch break.  \n\nNow let's talk Ramen!  I had the Sakurajima (spicy pork).  This was clearly higher quality ramen.  Delicious broth, perfectly cooked noodles, and more than enough to be worth the price.  \n\nMenya Jiro has easily entered my top 3 favroite ramen places and we will undoubtedly be back.", "author": "Joe G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-03", "description": "Subpar Ramen at its best. I got the Sakurajima and found it too oily, and bland. It's not loaded with protein and toppings. When compared to other ramens, the value for money just wasn't there for me. I also tried the salmon salad and it was ok, the fish was still a little bit frozen. As far as service, that was a letdown especially when it wasn't busy at all. The servers could be more aware of the experience they provide or lack thereof. A standardize workflow could help them a lot. \n\nAll in all, I wouldn't order it again.", "author": "Keo S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "Been around for a while, didnt have a the chance to check this place out till today for lunch.\n\nVery happy with our decision to do so. Food was delicious, combo was a good deal and the servers were extremely attentive. I would definately say this is a pla e worth checking out in you're looking for a good spot for sitdown food \n\nDO - come here for the lunch special and tasty food\n\nDO NOT - Come with lsrge groups during lunch, it can get packed real fast.", "author": "Cristobal T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "Whoo! A Menya finally opened up near me! I'm from Northern NJ and my brother is a hardcore fan of the Menya located in that area. I moved away to college and never had the opportunity to eat there, UNTIL now!\n\nThough they are famous for their ramen, I opted for the grilled mackerel set and was not disappointed. Please note: Japanese restaurants that offer grilled fish/fish collar are OG places that know how to treat yo fish!\n\nThe mackerel was perfectly salty and delightfully juicy. The burdock root that it came with was stir-fried and just a little bit sweet, a great compliment to the salty fish. \n\nI also tasted a bit of my dining companion's ramen, which was very delicious and not too heavy. (Some ramen restaurants make their broth incredibly rich and hard to finish, but not in this case.)\n\nWe also shared a karage (fried chicken appetizer) that was really juicy and crispy. LOVE!", "author": "Christina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "I was very excited to check out this ramen restaurant that opened in the area. It used to be a Japanese restaurant that I liked. The lunch special is $14 and it includes a soup that you get two toppings on and a salad. The salad is tiny so it's definitely a side salad. The ramen is big and the broth is incredible! I've had plenty ramen and it was all the same to me... until I had this places broth. It's just so savory and rich- and most importantly it doesn't taste like I'm just eating salt. The ingredients in the ramen tastes fresh and I was overjoyed with my decision to eat here. I definitely will be patronizing them again in the future.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "I've gotten the Kagoshima and ibusuki ramen; both are extremely solid dishes. Ramen broth is light, well-balanced, and flavorful but remains enjoyable until the last sip. Noodles are consistently the perfect amount of chewy/firm. \n\nChashu don is flavorful and satisfying.\n\nService is welcoming and a pleasure to work with.", "author": "Rick R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Just had lunch there ... they were super fast the Ramen was hot, the noodles were cooked perfect and the pork belly was nice and tender... I had the spicy and the broth was really good ... they are cooking right there in front of you and are quick to make sure your enjoying your food!!! \n\nAlso the side of kimchi not pictured was also really yummy!!!", "author": "Victoria M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-10", "description": "Menya Jiro serves up traditional Kagoshima ramen in a cozy, but oddly located spot near Downtown Brooklyn. It's good quality ramen, but can easily run you over $20 per visit. They still don't have takeout menus or business cards, but the website is up to date. Service is good, accurate and helpful. \n\nI ordered a Kagoshima, Sakurajima, and Ibusuki ramens with extra kikurage and seaweed for takeout. My order was ready for pick up and fresh out of the kitchen. I was a but surprised that my food was $60 - each bowl had only two pieces of cha siew. The noodles are al dente and springy, the broth tasty and not overly salted. The vegetables are fresh and clean and not over cooked. \n\nThe dining room is virtually unchanged from the sushi restaurant that preceded it. It's not romantic, just functional and with just enough space to maneuver about. \n\nBeing that Ganso is closing, I will likely be here again, but given the price point, I'm not super excited about the new kid on the block.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "We go to this ramen spot for lunch and it's definitely been a hit.  My one complaint had been that the ramen was a bit expensive-- $17 for spicy vege miso ramen, but they started offering a lunch special where it's $14 for the ramen of your choice plus a side salad and two toppings, so I was able to get more food for less money.  Hooray!!  \nThe ramen itself is great and the vegetarian option comes with so many toppings! It has tofu nuggets, spinach, kale, tomatoes and corn and then I got kimchi and seaweed on top of that as part of the lunch special.  \nThis is a great lunch spot as the service is quick and we are able to get in and out in under an hour and the food is great.  We will definitely be going back!", "author": "Liz F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-12", "description": "We were very excited to try this place but unfortunately our group was denied service here because of my service dog. It's 2019 folks. If you have a service dog, this place is considered inaccessible.", "author": "Tee N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-21", "description": "The quality of the soft boiled egg alone is worth the 5 stars. Perfectly done with a true soft yolk.", "author": "Tsekub B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Really love the ramen here.\nI'm picky about food but their ramen was good!!!\nMocha ice cream was great too.", "author": "Kahlen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-14", "description": "I'm so glad this place opened by me.  You should try the karaage - it's legit!  Nicely crispy - not a thick batter like American fried chicken.  The spicy version has a curry like base to it - not Indian curry tho.  Just trust me - try it!  \n\nFor the vegetarians out there - rejoice!  They have veggie ramen and broth!  My friend always has the hardest time finding veggie options so I totally appreciate restaurants that have this as an option.\n\nI don't think they have their liquor license but I will still be coming back in the dead of winter to have a nice piping hot and comforting bowl of tasty ramen.", "author": "Catherine L."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Menya Jiro- Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "306 Gold St\nSte C2", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/2L4Kumk7bneHC3fiDiVaBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188550988"}