{"aggregateRating": {"reviewCount": 91, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-08", "description": "First time having this place and it was amazing!\nIt was like 66 degrees but I want ramen, I know y'all. Lol\n\nBUT, I wanted spicy so I got the Lunch A: SakuraJima with 2 toppings for the special. I got an egg and kimchi. The egg was soft boiled which I forgot meant it was still boiled just runny in the middle. Yummy still.\n\nI LOVED the packaging! The broth separate from the noodles and toppings. Everything was pretty cold once it got to me, but I had a microwave and it's broth so who's really complaining? \n\nAlso ordered a pork bun. YAALLLLL! So SOFT and the pork literally melted in my mouth. Didn't get to chew. Spicy mayo and cucumber was the perfect ratio and it was an amazing snack to munch on while slurping my ramen. \n\nDelivery man woke up the baby I was nannying for when I specifically asked not to buzz and to call, BUT, the food made up for that...a little. \n\n$30 lunch but I ate it ALL and enjoyed every second. \nI'll be back.", "author": "Mariah R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-15", "description": "Hmm I think the ramen here is good, but not that good in the way, you have to come here for ramen. And broth is a little, just a little bit greasy. \nTako wasa is a interesting dish, good to try out, and octopus is really chewy.\nAlso ordered age takoyaki, I would say average.\n\nOverall, if I am hungry and also close by, I will stop by this place.", "author": "Yuki W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-03", "description": "This is your average bowl of ramen. I stumbled upon this shack because I was around the area for business and the ratings got me interested, like all of us yelpers! \nThe place itself is relatively small, so expect it to get packed fast during lunch hours and even maybe dinner. The chef behind the kitchen is indeed Japanese and I noticed some of the staff also being Japanese. Is it important? Not really, but maybe to some ! I ordered the garlic ramen and it lived up to the description! Lots of bits of garlic and you'll get that slurping garlic after taste. \nI also got a small eel bowl. Skip it. Literally couple pieces of your regular sushi eel and some Japanese white rice. Straight up bowl of RICE! \n\n*dont forget to check in via yelp, to get free ice cream!*\n\nAfter my meal, I felt like the ramen just stuffed you but I wasn't satisfied. I would not trek it to come here but if you're in the area, give them a try. I would also like to see the noodles a bit more al dente but overall 3 stars!", "author": "Billy C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-12", "description": "Really disappointing ramen - recommend going out of your way to go to Danbo or even Kogane. The portions are SO small here for the price and the broth leaves a lot to be desired. I don't consider myself to have a huge appetite but I was honestly still hungry after eating here. This could be forgiven if the food were amazing but... there truly is not much to write about here.", "author": "Margaret Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-24", "description": "The ramen here is pretty good and they're open late. Service was also very friendly. \nI'll be back.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-11", "description": "We live in the area and this is decent ramen if you need something and don't want to travel too far. The ramen was good but it doesn't come with too many toppings/additions. This might be the style of the ramen served here (admittedly, I don't know that much about various ramen styles), but for the price ($15) it's quite expensive for what you get (eg. pork, scallion and bean sprouts only).\nThey were running a $1 beer with entree purchase for a while which was pretty cool.", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-21", "description": "Menya-Jiro is a small but super cute ramen spot by the Dekalb area. My friends and I came by on a snow day so it was not packed and all and there was no wait. Upon entering the restaurant, I saw the Yelp check-in promotion. My friends thought it only applies to the lunch special but I asked the waitress and she said ALL the people from your party needs to check in on yelp for everyone to get 20% off. Not a bad deal!\n\nMy friend and I both ordered the Kagoshima ($15.00). This is a pork and chicken mixed broth with sliced pork belly, scallions, bean sprouts, and fried onion. The texture of the ramen was super bouncy! The broth was light but flavorful. The star of this dish was definitely the pork belly; it literally melted in my mouth!\n\nWe also got an order of Japanese Fried Chicken ($7.00). It was pretty good and inexpensive... 5 pieces for $7.00 is a steal. \n\nI really liked the service here. Not once did the our waitress rushed us. I have to say though the wait for food was a bit long... or maybe I was just super hungry.\n\nI would definitely recommend this ramen spot if you're around the area!", "author": "Racheal D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-29", "description": "This spot used to used to a really good sushi spot, which happened to be my favorite sushi spot in Brooklyn and I was sad to see it go. I was hoping this ramen spot would live up to the standards as they take over.\n\nFirst thing I was looking for was the Tonkotsu Ramen and to my surprise they don't serve that. Already this menu is unique and not making the same ramen like all of the other ramen joints. I got the Kagoshima Ramen which is served with pork belly, scallions, bean sprouts, one egg sliced, corn in a mixed pork and chicken broth. There was a spicy option called the Sakurajima which is opted out of. Very filling and rich in flavor. I cleaned the entire bowl. I also got the Age Takoyaki, my go to appetizers when I'm in a ramen restaurant. I also highly recommend this.\n\nAlthough I dearly miss my sushi that is usually served here, this ramen chain is doing a decent job replacing it and feeding hungry humans. There's not many good ramen spots in this area so definitely a spot to try out.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-17", "description": "The mission: Get from Metrotech to Menya for lunch and back within 45 minutes.\n\nThe journey: Desolate walk across big road. Not much along Flatbush Ext.\n\nThe food: Lunch Set B was just OK. The soy wasabi(?) salad dressing was the best part of the meal. The salad was a small pinch of spring mix. The unagi don was a bit flabby and quite saucy. The smell of the Ibusuki ramen promised pork and garlic. The initial flavor was pork-y but didn't quite have the depth/roundness and was a bit salty. The noodles were good; a bit of chew and bite. If I go back, would skip the don and maybe add some additional toppings (bamboo and egg) to try to round it out. The flies buzzing around the place was a bit annoying.\n\nVerdict: Mission accomplished with 3 minutes to spare.", "author": "Kathy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-23", "description": "Menya Jiro has been on my list for a while and I was very pleased to finally cross it off my list. I came early Tuesday evening with a party of three so we pretty much had the whole place to ourselves. I ordered the Kagoshima, which is the most basic option. From there, the menu offers a spicy version (Sakurajima) or a more intense version flavored with fried garlic and soy sauce (Ibusuki). All orders come with sliced pork belly, scallions, and bean sprouts. \n\nThe broth at Menya is made with pork and chicken-- a combination that is both rich and sweet. As I also sampled the broth from a bowl of Sakurajima and Ibusuki, I concluded that the Kagoshima is superior (the other two were too salty for my preference). The noodles were bouncy, chewy, springy, and utterly delicious. I probably could have ordered kae dama if I had room left in my stomach-- that's how good the noodles were. \n\nThey are currently offering a Yelp check-in special of matcha ice cream, which tastes lovely and refreshing after a hot bowl of ramen.", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "I encourage anyone to try this ramen shop out. After slurping your way through countless bowls of ramen in the city, you'll be quick to differentiate the good versus the bad. \n\nMenya Jiro is not bad at all. Base of the broth is good. Content is good. Pork is thinly sliced, which is a satisfying change from the fatty chunky tasteless pieces you get in most places. \n\nThe spicy ramen was not spicy. The garlic soy version was indeed the best. \n\nCome for lunch and get the combo set of any don buri and salad. Your belly will be happy and satisfied.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "Decided to stop in and have ramen in 80 degree weather because I'm dead inside and desperately want to feel something again.\n\nToo much information? Okay, I guess I'll just talk about the food.\n\nIt's... fine.\n\nSkip the pork bun. It's just a crap ton of spicy mayonnaise with some pork thrown in. At $6 a piece too. Meh.\n\nThe ramen is good. All their broth bases are basically the same, with some add-ins like garlic or spicy. I went with the Ibusuki, which was with garlic and soy sauce. Came with some hefty portions of sliced pork belly and delicious fried garlic. The broth was good, but not great. A bit on the lighter side, which isn't always a bad thing. Loved the garlic. But the noodles actually stole the show for me. Medium thickness, springy, nice yellow color.\n\nThe space isn't huge, but isn't small either. There's bar seating, and a few tables by the window.\n\nService was great. 3.5 stars overall. I hope this place sticks around, so I'll round up to a 4.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Solid 5 star restaurant. The service is on point, chef's super friendly, and food is great. Ramen's as good as you'll get in Japan, broth's epic, appetizers hit the spot. I was surprised there was no line when we went for dinner.\n\nI'm not a huge ramen fan in general, but after constant nagging I decided to check out Menya. In short, I was dumb to not go earlier and I've added it to my neighborhood favorites. Skip the generally overpriced/mediocre Dekalb Market and go the extra 2 blocks to Menya. \n\nHot tip, they are generous on the green onion, which I love, but it can be too much for some people, just a heads up.", "author": "Howard C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-17", "description": "Mmmm...the Ramen Force is not with Menya-Jiro. i was longing for some really good seafood miso ramen, but unfortunately the only options were pork, another meat i can't recall, veggie, and spicy miso veggie. Because i LOVE miso and HEAT, i went with the spicy miso veggie as part of a lunch set.\n\nThe good:\n- The restaurant is cozy and clean.\n- Service is attentive and friendly.\n- Décor is nice.\n- The lunch set is a great value - you can get a heaping bowl of ramen, mini don buri (i opted for unagi over rice) and a side salad for $21. The salad featured a tasty sesame dressing, and i enjoyed my unagi.\n\nThe not so good:\n- My bowl of ramen didn't do it for me. The broth was nice and creamy, but the overall flavor was just off, and being a ramen fan, i was disappointed.\n- The AC was almost non-existent the day i went, and i FELT it after sitting for a while. The poor wait staff were wiping away sweat, so i really empathized with the chefs in the hot kitchen. No businesses should be operating without strong ACs in the summer in NYC. Period.\n\nOverall: i probably won't be back to Menya-Jiro. i can't abide mediocre ramen, even though the unagi was tasty.", "author": "Nelle C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-25", "description": "I came here for the weekend for dinner. Portions are very small and not worth the price. The food is okay and taste very standard. Restaurant is very clean and the decor is very simple. Service was attentive and restaurant is small but cozy.\n\nI had the unagi don- eel over rice for $16 and it came with miso soup and salad. The soup taste very clean. Salad was okay and the unagi tasted like the package ones from the supermarket but nonetheless it tasted good but not what I expected from Menya. After eating this I was still hungry. Portions are tiny.\n\nI also order the Kagoshima and the broth was not as flavorful as the Menya in FIDI. It cost about $15.and extra noodles is a must. The portions are extremely small even for Japanese standards. The broth does not even cover the bean sprouts or the green onions or the pork. The pork slices tasted okay but the texture is extremely rough.", "author": "Irene L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-06", "description": "Great service! Great food!\n\nI had the spicy ramen (Sakurajima), and my wife had the non-spicy version of the same.\n\nThe broth in hers was very flavorful, and mine had lots of spices mixed in. The noodles had a great texture, and the bean sprouts provided a crunch now and then. I add some wood ear mushrooms; they were cut thinly which I hadn't seen before. They did not stand up well to the spicy broth, however. The pork belly is sliced very thinly which both of us loved as you could incorporate it better than some of the massive pieces you sometimes get. Mine only had two small pieces (total of about one thick cut bacon strip to give you an idea).\n\nWe also shared the squid legs karaage. They were lightly breaded and deep fried. Bigger than what you would get from say an ordinary restaurant, so you got some actual squid taste vs. just some fried flavor and texture. It was served with some ponzu that kept it light.\n\nThis place started I Japan and did a pop-up at the Ramen Lab by Sun noodles, so I knew I had to at least check it out. While not the absolute best ramen I have ever had the pleasant service and atmosphere kicked it up to 5 stars for me. A solid choice in ramen if you live nearby.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-21", "description": "Pretty standard ramen joint. I enjoyed my Sakurajima but it was nothing special. Chasu was actually somewhat chilled, brother was flavorful and creamy but could have been hotter in temperature and spiciness. \n\nFried gyoza was pretty good as well, but again nothing special.", "author": "George T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "Welcome to the neighborhood, Menya Jiro! \n\nThis used to be Jun Shokudo, a Japanese eatery with no ramen but fresh fish and other Japanese foods such as yaki-udon and dons. They closed up shop and had a renovation (although the dining area looks exactly the same) and became Menya Jiro. I came here last night not expecting too much because their restaurants in Manhattan has mediocre to poor ratings on Yelp, but I was craving a hot bowl of ramen on a cold windy night.\n\nNow, it is a strictly ramen spot with appetizers and rice bowls. They serve up pork and chicken broth ramen, 2 vegetarian ramen with one being vegan. Both the Kagoshima ($15) and Ibusuki ($15) ramen has a rich, tasty broth. Unfortunately the egg add-on (2$) is quite disappointing. It is not a perfectly soft boiled egg and the cooked egg yolks mixed with the rich broth is not the best combination. Aside from that, the ramen is delicious. The age-gyoza from the appetizer section is very crispy and would be a great add-on into the ramen, which is something I will do next time I visit. The buta-kimchi don is average, lean pork and regular kim-chi. Weirdly there is no beverage menu, not even a mention of soft drinks or teas on their menu, and because of that I will also assume they do not have any alcoholic beverages yet. \n\nThe staff is friendly and attentive. The waitresses make the establishment feel very homey and comforting. Food does not take too long to come out and is hot. This is a new shop, so they still have to work out their kinks (they gave my bf with a menu that was missing a  page! and their menu is only 3 pages) Although I do think it is pricey, I am VERY glad that a good ramen spot has arrived in Downtown Brooklyn. For those who have read my other ramen spot reviews, I am a big fan of Zundo-ya (meh service amazing ramen) and I must say Menya-Jiro is almost up to par with them. I will definitely be returning!\n\nEdit: 4/19- They have a beverage menu! Sake, beer, and soft drinks!", "author": "Jodie Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Jiro Anma is one of America's greatest ramen chefs. He understands how to craft a bowl of stick to your ribs stock!\n\nHis broth is a combination of Chicken and Pork, giving you both that homestyle feel from your family and that rich tender Japanese Tonkotsu that the world has come to love. \n\nI think that the chashu pork Jiro-San makes is some of the best I've ever eaten. Equally parts fatty, generous, seasoned. I want to snack on it! And in fact I did.  The new menu has these awesomely delicious pork buns. I'm salivating at my memory of eating them.\n\nEach bite of noodle also has fresh bean sprouts which add a wonderful crunch. And you can add extra toppings to your ramen, I got the deep fried Gyoza which was also amazing crunchy. Its really refreshing to be able to have something to much on while you are slurping down your soup and noodles.\n\nThe new shop has a really jazzy yet peaceful ambiance. Filled with a mural of mountain like waves, hand painted along the wall.\n\nI've had the pleasure of being Jiro-San's first patron at two of his restaurants. The service is fast, pleasant, and delicious! This is why I'll forever be his cheerleader. I'm\nHappy that the Downtown Brooklyn area now has easy access to great ramen!", "author": "James D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-14", "description": "Great ramen near the hotel! \nGreat service, super friendly and quiet atmosphere. Two meals and a salad for $30! \nDrinks include sparkling water (Perrier) \n5% discount when paying with cash, and sometimes 20% with a review! \nBar and booth seating, kitchen visible and clean. Lots of delicious options and lunch specials.", "author": "Liz B."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Menya Jiro- Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "306 Gold St\nSte C2", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/2L4Kumk7bneHC3fiDiVaBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188550988"}