{"aggregateRating": {"reviewCount": 91, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "Hot and delicious Ramen! Not too much variety on the menu but the service was fast! Affordable but not the cheapest. Nice and clean dining room. Check it out if you're in the area.", "author": "Tiffany B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "Came here a few nights ago and was pleasantly surprised by the quality of the ramen!  We ordered the Sakurajima (spicy) and the Ibusuki (garlic tonkotsu). The broth were rich and had great umami quality.  The ramen was cooked just right. Cha-siu were perfectly cooked and extremely flavorful. I added bamboo shoots and egg - both well seasoned and flavorful.  \n\nGreat addition to the neighborhood and will be back!", "author": "Dorothy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-18", "description": "Ramen was solid. Hit the spot on a cold morning. Egg was a great add in, noodles were perfect, and the broth was super flavorful.", "author": "Trent S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-13", "description": "Great food  Good service.  Nice quiet place to eat near the manhattan bridge.   Not too far from local hotels", "author": "Dorothea P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-27", "description": "I went there when they first opened and had no expectation whatsoever because I have been to many ramen places that people raved about but at the end was disappointed. When the ramen came it looked just like any ramen but after my first bite I thought I was back in Tokyo at one of the local authentic ramen joint. It was absolutely delicious, and it didn't\ntake me long to finish my bowl of ramen. I forgot all about etiquette and was slurping the noodles and soup until there was not a drop left. I highly recommend this ramen joint.", "author": "Alan C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-05", "description": "I don't like ramens here. The soup is too oily and the egg and pork are too salty. All ramens I had in China are much  better.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "Great ramen and services. The pork belly is really delicious and noodles is tendered.", "author": "Kevin W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-29", "description": "Closed on a Sunday at 9pm, they should update the hours of service. People waste their time com big to eat your ramen...", "author": "Martin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-12", "description": "They have the best Ramen in the area! The miso broth is a great alternative for vegetarians and their lunch special is very reasonably priced!", "author": "Jess B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-18", "description": "The ramen is not delicious as expected and I think the lunch special is not worth for 15 bucks. In addition, the service is not that great. The young lady who served me was indifferent and rude. Did not see her smile at all. Kinda disappointed!", "author": "Joanne J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "We were looking for a good ramen place after a cold walk across Brooklyn bridge and we found it. The fried gyoza were amazing with the spicy sauce it came with and the spicy ramen was delicious! Highly recommend. Probably not the cheapest around but worth more than it cost !!", "author": "Stuart T."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Menya Jiro- Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "306 Gold St\nSte C2", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/2L4Kumk7bneHC3fiDiVaBQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188550988"}