{"aggregateRating": {"reviewCount": 255, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-27", "description": "If you're looking for a good cocktail in the area, keep searching. It had been a while since I couldn't finish a drink, but it happened with the pisco sour I ordered this afternoon. I love drinks with egg white typically, but this one was not shaken enough and smelled strongly of egg. I tried drinking it to be polite to the nice bartender but eventually decided to just abandon the drink and accept the $10 down the drain.", "author": "Meredith S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-16", "description": "I had a terrible experience here. \n\nThe food is fine; nothing amazing, but not terrible--although overpriced for what you get. I came for dinner, so can't speak to the brunch.\n\nThis negative review is inspired by the awful service. I came here with my mom, sister, and new boyfriend. We came in the middle of the week, so the restaurant was not particularly busy. The entire staff seemed annoyed that they had to deal with us at all. There are many examples, but they were visibly bored and rolled their eyes at all of our questions, took their sweet time preparing our meal, etc. We watched the bartender chat it up with a waitress after receiving our drink order for 5 minutes before bothering to get started on our drinks.\n\nFine, whatever; it's not like this is the only obnoxious restaurant in Brooklyn.\n\nOur bill comes, and the bill is something like $196.31 for four people. My mom graciously offers to pay for us all, and hands over the exact amount of the bill to the waiter in cash; which normally restaurants love!  She also leaves a cash tip (20%, even though the staff sucked) on the table. \n\nWe are wrapping up and getting ready to leave when the manager comes from behind the bar and loudly tells my mom that she is short 31 cents on the bill. We're all taken aback that this dude is making a scene over spare change, but then realize that the waiter actually just dropped the coins on the floor. We point out to the manager that his quarter, nickel, and penny are on the ground. He doesn't apologize for erroneously calling us out in front the entire restaurant, and goes back to smirking behind the bar.\n\nA minute later, he comes BACK and asks us if there were a problem with the service and wants to know why we didn't leave a tip, even though there is VISIBLY two twenties on the table and we're putting our coats on. My mom is now super embarrassed in front of room of strangers plus her daughter's new boyfriend. She hands this a**hole the tip and asks why he felt the need to approach her twice for two non-existent issues and embarrass her in front of her guests. The guy gives a half-hearted apology by snapping at us \"I made a mistake, OK!\", and we storm out. My mom was almost in tears and it ended our otherwise great day on a really bad note, and we were down $200. \n\nIn short, I hate this place, will never go back, and always talk loudly about how much it sucks when I walk by so the outdoor diners can hear me (which is often, because I live down the street).", "author": "Jessica R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-04", "description": "Somehow I lived in Carroll Gardens for two years and never went to this restaurant. It was only during a return trip to New York City that -- after learning Buttermilk Channel had a nearly two-hour wait -- I finally visited. Overall, I had a pleasant experience. \n\nIt was a Saturday night around 7:30 and my friend and I were immediately seated at a cozy table in the front room (there's more space in the back) with a friendly and perfectly attentive server. We started with drinks and appetizers. I ordered the Noble Experiment and the Asparagus \u0026 Baby Greens Salad; both were delicious. My friend had a draft beer and the Roasted Poblano \u0026 Sweet Corn Bisque; they reported both were good. \n\nFor our main course, I ordered the special Mahi Mahi, and my friend ordered the special Dorade. We each shared a bit of our meals and agreed both were very good.\n\nOur only disappointment was with dessert. The pie we ordered -- I believe it was blueberry and some other berry with fresh cream -- was somewhat bland. Still, their solid selection of digestifs more than made up for it!\n\nIf I was in the area, I'd definitely stop in here again.", "author": "Michael D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "Came for brunch on a beautiful Sunday afternoon around 3. Not too many people, but not empty by any means. Huevos Rancheros, side of 7-grain toast w/ fig jam, and an iced coffee. All were solid.", "author": "Shawn K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-01", "description": "Meh. So incredibly disappointing. \nFood - decent. Over priced. Burger = $16. Want cheese? Add $1.50. Want bacon? Add another $3. A $20 burger in Cobble Hill should be fantastic. It wasn't bad... But it wasn't $20. \nBeer menu - if you have good taste in beer, go elsewhere. The food claims to be better than average (based on price), but the they have a small beer menu with total crap on it. Blue Moon? Really? That's the best you can do? An average beer fan could upgrade your menu in two minutes. \nOther - With those prices, they only accept cash or AMEX.\n\nOverall, they think very highly of themselves... But under the covers, it's just an average over-priced neighborhood restaurant.", "author": "Shane B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-06", "description": "What a pity their food and service doesn't live up to the delightful first impression you get from the retro fittings.\n\nI went here for brunch on Sunday.  As a plus point, we went with a couple with a baby in a stroller and they put as at a lovely table, with room for the stroller.  \n\nThe Bloody Mary's were good - my \"All Beet Up\" was a bit robust for a brunch drink, in my opinion.  More like vodka martini with a sniff of beet juice.  \n\nI ordered the spinach and goats cheese omelette with a side of grits.  The omelette was pedestrian.  The homefries were a little different, with cooked with Moroccan type spices.  The grits were good - a more chewy texture than I'm used to, but I did keep going back for \"just another small spoonful\".\n\nThe service let them down - they got my order wrong and forgot my omelette and grits.  This would have been ok, but they didn't say anything, while my whole table sat around waiting, watching their food getting cold.  Finally called over the manager and she was quite dismissive.  She said yes, they made a mistake and they had a big party in the back, so the kitchen was very busy.\n\nI was inclined to retort \"not my problem\" - but I held myself back.  I think that I would have been more tolerant had they explained that at the outset.\n\nThey compounded matters by screwing up the order for 3 coffees and only bringing 2 (forgetting me again - they must have had it in for me at that stage).\n \nIn short - I wouldn't go out of my way to return - given all the other options in that neighbourhood.", "author": "Lisa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-24", "description": "I'm not really sure where you can get a better meal in the neighborhood--maybe because I'm usually sharing apps at the bar, chatting away, drinking delish cocktails and downing wine.   The atmosphere is super cute and chill; I love the warm, inviting bar and the tiled floor and the overall feel.  I've never had to sit in the back room (again, always at the bar).\n\nNope, it's not cheap.  I'm not really sure where to get a $12 meal in this neighborhood, other than the thai/chinese/oaxaca places.  Skip over to Strong Place and be blown away by the tinier portions.  \n\nThe menu is small, but everything I've had has been well-executed, exceptionally flavored and spot-on in terms of freshness and quality of ingredients.\n\nI'm a little fussbudget and think this places deserves higher points than it gets!!", "author": "Kelly T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-27", "description": "i really like Watty and Meg, I've been here a few times for dinner and have never left disappointed.  The service is always prompt and friendly. Each time I've gone, I've ordered something different off the menu, and each one was as delicious as the last.  They also have a pretty interesting cocktail menu.\n\nI was really confused when I saw they only had 3 stars.  Oh well, more for me.\n\nI've read much about their Monday night beer and burger special which i'm dying to try.", "author": "Erica T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-30", "description": "This place is ridiculously overpriced for food that's mediocre at best. We got the quinoa salad, mac n cheese, and burger. The quinoa salad is no salad at all. It was a little bit of quinoa, a dollop of guac, and a few greens - all separated on a plate. It felt like someone was trying way too hard to come up with something creative, failed miserably, yet still had the balls to charge $16 for it. The mac n cheese and the burger were fine, but for the price we paid for dinner and drinks, this was NOT worth it at all.\n\nAlso service was just not good. The server took our order and didn't write a single thing down. This caused him to come back to our table two or three times to ask us to repeat our order. \n\nWon't be coming back here unless it's a Monday and I'm desperate.", "author": "J C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-24", "description": "Our friends asked us to pick a place for dinner in the hood that would be baby friendly for a 6pm dinner. That was pretty easy. Every restaurant in the area is baby friendly  for a 6pm dinner on a weekend. I think some people just finish brunch at that time. Anyway, we chose Watty \u0026 Meg because it's one of the few places we haven't eaten at yet. \n\nIt was exactly what I expected. Good food, good service, small portions, high prices. Everyone but me got the burger which they all seemed to enjoy. I had the quinoa salad which is pretty difficult to mess up. Dinner was pleasant but I'm not in a huge hurry to return since there are so many similar restaurants in the area.\n\nFeel free to bring your kid here though. They'll provide you with a high chair and staff to distract the baby while you read the menu.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-28", "description": "average place with brutal prices.   nothing special beyond a comfortable room", "author": "Daniel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-25", "description": "Adorable place for brunch! \nStopped in around 1pm on a sunday to find it was kind of empty (WHY???). The decor is cozy and inviting. \nThe brunch menu offers up a little bit of everything to satisfy an array of cravings. My guest is pregnant and had a serious Jones for french toast. While they didnt have french toast, they did have a pumpkin bread and maple syrup kind of dish that satisfied her craving just fine.\nBut since I was dining with a pregnant lady, we ordered 3 entrees adn split them all. The pumpkin bread was delicious. Dense bread like texture with a dark, fluffy  pumpkiny taste full of spice! Loved it. But it was definitely a small portion to be considered a meal. We also shared the artichoke and goat cheese omlette. Fluffy eggs folded with soft artichokes and creamy goat cheese. The real winner here was the BLT. For fun, i added avocado to it. They are not stingy with the ingredients. Two slices of pizza bianca with thick smoky bacon, a smear of mayo, spring greens, tomato and  tons of ripe avocado. Oh yes, and the crispy show string fries it came with. \nThe prices are affordable. The food is great- i will definitely come back... word is there is a burger special? Oh my.", "author": "Monique R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "I've been coming here for years before I lived in Brooklyn and constantly recommend it! The staff is very warm, food and drinks are consistently delightful.", "author": "Carolyn Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "We sat outside and the atmosphere is really nice: quiet street with families walking by. The service was pleasant and the server was knowledgable of the wines and menu. Relaxing and warm environment. Food came out in good time and was good quality.", "author": "Conor H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "This is a brunch review.\n\nIt was serendipitous in all respects. The weather: a mild, cloudy, peaceful, and yes a slow afternoon for this nabe; the company: a long-time and very dear friend returning to NYC and her daughter who lives a block or two away. We were looking for a place to have a relaxed (no-rush), gossip-filled time and stumbled into the best place to get it. Laid back, grown-up (no loud music, no 20-30 year-olds screaming at the top of their lungs), cool woodsy interior, wide open doors, charming and pleasant wait-staff, a perfect setting for us.\n\nOur server complemented the afternoon very nicely with her easy relaxed demeanor. I got a lemonade, the others coffee and we took our sweet time ordering 'cause we were catching up on gossip after all. Our order: Quinoa, kale and avocado salad, huevos rancheros (veggie), eggs and curried shakshuka (yea! my first too), the spicy tuna tartare and an irresistible mac n cheese for all to share.\n\nI have read some of the reviews for this place and whenever I see complaints about slow service I feel like screaming out \"Get a life and enjoy it!\", or \"if you want fast food go to McDonalds\". Our service was hugely appropriate in every respect and the food, for which I am taking so long to come to, grabbed our attention right away. The gossip took a back-seat for a bit as I exclaimed my delight after a bite into my curried tomato thingy, the tomatoes were sweet and juicy, the stew mildly and surprisingly  spicy and the eggs, perfectly eggy - brilliant; we were soon tasting each other's plates; the salad had a crunchiness in the kale and the combo worked really well; the rancheros flavorful and the spicy tuna tartare had a decent enough kick to it; ah! the mac'n cheese, the mac'n cheese, man o man!! The americano I hesitantly asked for, 'cause I didn't want to ruin my brunch with a bitter dark roast, was also a perfect medium roast just the way I like it. Serendipitous indeed. Good job W \u0026 M.", "author": "Riz H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-03", "description": "We used to go here a lot when it opened years ago and have probably dined there about 20x and have always the food as well as the great local service. However we hadn't dined there for over 8 months as the service had gone downhill and am never in the mood for an expensive meal with subpar service.\n\nUnfortunately, I didn't remember that and went today to receive horrible service but also undercooked food. It took them 30 mins to bring drinks and only after I asked where the order was. And then food arrives after 45 mins which was as basic as Mac and cheese and a burger. Plus, the food was undercooked and horrible.\n\nI suppose the employees weren't surprised as they immediately said the drink and meal was on them. Which made me gather it happens often.\n\nNone of the older staff we remembered were there which makes me think this new management just doesn't get it. Oh well, at least the tourists to our neighborhood can eat there but us locals will stay away. Such a shame.", "author": "contempt n."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-15", "description": "Woeful. This is my 2nd time coming here. First time was a comedy of errors which I won't go in to. However, there were some things that were consistant. Bad service and the place smelled like bleach. YUCK!\nMy quinoa salad was a joke. Some poorly chopped bland kale, next to it a pile of quinoa that had just come out of the fridge and was gluey and next to that a pile of over ripe mashed avocado. All sprinkled with toasted almond flakes. When I told the waiter I couldn't eat it he replied with a very jolly \"OK\". This is all a great shame because it's a lovely room. You can't polish a turd.", "author": "PJ I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "I've eaten here a few times. This is the perfect brooklyn restaurant- cozy, local, outdoor seating, and dog friendly.\n\nThey have great options for vegetarians for brunch and dinner. There was a veggie burger or something I really liked there.\n\nGreat place to go if you going to Cobble Hill Cinemas for a movie as well.", "author": "Layne B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-17", "description": "When I used to live a block away I never visited this place, now am there like all the time. They make great drinks, the food is great and it's a family oriented place. I love the way they make their Shirley temples with black cherries", "author": "Vanasha D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-22", "description": "Kale salad and salmon hash were perfect to share for a brunch for 2.\nService was on point, tab was ok (cocktails raise the final amount quickly but food is priced correctly)\nDefinitely recommend for brunch!", "author": "Nicolas R."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Watty \u0026 Meg", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "248 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YT5DS-hBfBN8Y-pPNWHjWg/ls.jpg", "@type": "Restaurant", "telephone": "+17186430007"}