{"aggregateRating": {"reviewCount": 255, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-06", "description": "Great food / brunch pancakes are delightful. Sad to say that a neighbor hood restaurant like this would charge you 10 bucks per glass for mimosas at brunch !!!", "author": "Timilehin O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-14", "description": "Good clean food. Quality on the brunch menu was great, cocktails left a little more to be desired. Would come back.", "author": "Anthony D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-13", "description": "I've eaten brunch here on several occasions and once for cocktails but never dinner. I would probably come here more often but my boyfriend is vegetarian and they don't have too many options that he likes. \n\nThe service is consistent. I enjoy the cocktails. I'm always happy with my food but one thing in particular stands out - the crazy french toast dish! It's insanely over-the-top sweet and baked with various sugary goodnesses in a bowl. I can't say you'll like yourself more after you eat it but you'll enjoy it the whole time.", "author": "Emily D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-01", "description": "I have to revisit my 4 star review and change it to a 5 star. We came here on a busy Saturday night without a reservation. They seated us right away in the lovely back room. The vegetable Wellington was perfect with just enough fondue.  We also started our meal with a seasonal fava bean soup which was outstanding. My boyfriend was very pleased with his fish special.\n\nIt was our waiter's first night and he did a fantastic job, he was patient and helpful with wine suggestions despite not yet being completely familiar with their offerings.  \n\nLooking forward to stopping by again when I'm in the neighborhood for a movie at the wonderful Cobble Hill Cinemas.", "author": "Elizabeth T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-07", "description": "I have eaten here twice and love the place.  I tried to go there tonight, but my friends didn't want to venture out in the bad weather.\n\nI had the grass fed burger with avocado and bacon.  Amazing.  I don't think I could have enjoyed it more.  My girlfriend loved the hangar steak.\n\nService was impeccable both times.  I recall being especially impressed the first time I ate there.  Second time it was just very good.\n\nGreat atmosphere, decor, even the dress of the staff.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-13", "description": "Super bummed.......\nWent with my boyfriend for dinner before going to the movies across the street.  We'll I should say we tried to go....we were seated, and given menus.  About 15 minutes later we got water from I assume the bus boy.  He didn't say anything and went back to polishing his glasses.  We figured the waiter would be over soon, but the matre d' came by again to seat another table and didn't tell us anything.  Finally we had to leave after we noticed the table behind us who still didn't have their order taken, or a drink and had been there the entire time we had.  Had we stayed we would have missed our film which started an hour later.  Either they need more staff or someone needs to tell your customers what is going on.  \n\nWe walked by a week later and the place was packed, I sincerely wonder how they served that many people or maybe people just have no sense of judgement.  The space is very pretty, but the food was very highly priced with how poor the service was.", "author": "Natalie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-28", "description": "Not a huge menu, but nice balanced and very well curated. Huevos Rancheros delicious, as was special BLT.  Wild fish cake special excellent.  Even the bacon and the very fluffy scrambled eggs nicely prepared.", "author": "Joe N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-16", "description": "Stopped in here recently for a glass of wine and an appetizer. The bartender was super nice and recommended a great red. Tuna tartare was great - lots of flavor - but I would have liked a few more yuca chips to eat it on. In fact, I thought they had forgotten to bring the yuca chips until I realized that the 3 shoved into the top of the (delicious) heap of raw tuna were all I would be getting.\n\nCan't comment on most of the menu, but I'd definitely go back for more wine and snacks!", "author": "Shawn H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-11", "description": "I walked up to Watty \u0026 Meg for their Saturday Brunch.  I saw that the place was quite busy and was unsure if I'd have to wait for a table or not.  Upon talking to the host he asked me if I could sit at the bar, I really wanted a table near the patio because it was a marvelously sunny day.  I politely told the host that I would prefer a table for 1 and he politely obliged my request, even though the restaurant was fairly packed.  \nThe waitress was very nice, even though I could see she was working with many tables and little help from other wait staff.  I did wait longer than the general amount of time it should take to get water and coffee, but since it was a busy time of the day it obviously took a little longer.  The tables near the patio are wonderful, reading and people-watching was a nice way to spend time while I waited for my meal.\nI had ordered the hash with poached eggs and salmon.  After the waitress delivered my meal I was very pleased with it.  The salmon was good, poached eggs perfect, and the hash with brussels sprouts were delicious!  Overall, I was very pleased with my experience and would eat here again!  But I would only recommend their Brunch if people aren't in a hurry.  It's definitely a busy time for the restaurant and is best suited for people that just want to take it easy for an hour or two.", "author": "Kristina F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-30", "description": "Brooklyn fun. But summer hot. Too hot. Too hot to use complete sentences.\n\nRight before I died of exposure, we ducked into this place to hydrate. For me, this means wine. For my 7star companion, a club soda with lime. Why he's 7star, 'cos he's smart.\n\nThe wine was great . . . a nice South African dry white. Really tasty. Adorable, friendly, attentive bartender. The restaurant itself was chic and cute with lots of pretty people eating delicious looking food. A cute 5 year old befriended me, and flailed around in front of me while I was sitting at the bar. Always amusing.\n\nBathrooms: spotless. After our lunch at a different restaurant of delicious food with questionable cleanliness, this was welcome. Utterly spotless with chic, high-end soap on a shiny, clean sink. Ahhh, yes.\n\nIf I'd have been in Brooklyn longer, I'd have come back . . . this is my kind of place.", "author": "Erika G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-26", "description": "Tried this place for the first time last weekend. We sort of randomly found it, after looking for  place that did not have an hour wait.  (Which scared me, I won't lie. Why don't you have an hour wait? What's wrong with this place?--shortly after we came in, other folks piled in this place) Our server was great. She was very patient, described the specials in great detail.  The food was good. I appreciated the menu.  After 3 days of TG leftovers, I enjoyed the solid American Bistro fare.  My cocktail was good and what I really appreciated was that  our server steered me away from something she didn't think I'd like. Good looking out.  So for the people who got meh food and meh or bad service. I dunno what to tell you. It was  a decent evening out.  I left full and satisfied. I'd go back.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-26", "description": "My friend and I decided to try this place out for brunch.  It was a critic pick on nymag.com.  Overall, we enjoyed our meal and thought the atmosphere was welcoming and cozy.\n\nFor brunch we ordered the mushroom/cheese omelette and the heuvos rancheros.  Both meals tasted great, seasoned well and presentation was nice. Our mouths were watering wanting to order the pumpkin bread, but knew it was too much food for just 2 gals.  Definitely want to try it next time.  Also really liked the extensive and creative cocktail menu.\n\nGreat place to do before/after as it's a nano second from cobble hill cinema.", "author": "Cara E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-17", "description": "The main courses are mostly pretty good, but everything comes with fries or a wilted lettuce salad that looks like it's been sitting in the fridge for a day too long. It would be great if they decided to switch it up a bit with basically anything other than the ol' fries or poopy salad. \n\nAppetizers: The beet salad is always delicious, as is their super fresh Gazpacho. \n\nBurgers are good. The Lobster/Corn/Crayfish fritter is the size of a baby fist, so unless you're not very hungry or planning on ordering two $16 plates for just yourself, don't bother. \n\nThe fish is always good, and so is the Korean BBQ brisket. If only they would include a side better suited for that dish than that goddamned bane of my existence lettuce, it would be an amazing plate. \n\nThey make an amazing pickle martini that will make you want to drown yourself in a tub of pickle juice. Pickle my life, please.\n\nEveryone who eats at this place is relatively normal, so it isn't the best for eavesdropping on other people's ridiculous conversations. I was once seated beside a husband, wife, and her parents. She was incredibly mean to her husband during the entire meal and her parent's sort of turned the other cheek in unsurprised embarrassment. It was awesome.\n\nFood: 6/10\nService: 10/10\nDrinks: 10/10\nEavesdropping: 3/10", "author": "Drew C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "My friend and I had a great experience having dinner here.  We both had delicious burgers and we loved the calamari appetizer.  My friend had a glass of wine, and I had an outstanding Negroni.  Recommend!", "author": "K D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-14", "description": "Sorry to say it -- the service has continually gone downhill here. The one time I came with my folks, the food and wine were really yum! The space has a low-key and lovely café vibe. But the hostess was rude to us and didn't seem to have her act together. After 10 minutes of waiting, staring at empty tables, we finally asked if we could sit at the bar to finally have a meal. My most recent experience wasn't any better -- came in and was seated on a Sunday afternoon when the place was half-empty...to then sit there for 15 minutes without having anyone wait on me. Finally got up and left. If you're willing to overlook the spaced-out staff to pay a little more than necessary for gastropub fare, maybe?...otherwise, there are better choices in the area, especially in the Smith Street/Court Street circle.", "author": "Jenna A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-25", "description": "KILL ME WITH KALE\n\nMy GF and I started coming to W\u0026M when it first opened and we were impressed. Really great, comfortable corner space and good food. The original owner was present and truly interested in customer feedback at the beginning. As he seemed less and less present (change in ownership? we never found out) the food started to take a dive and we walked away. That was over two years ago.\n\nWith out of town guests in Brooklyn this weekend, we decided to give W\u0026M another chance.\n\nWell, it seems that ol' Brussels sprouts has finally fallen from popularity as the ubiquitous \"veggie of the moment.\" Thank god.  And if you didn't get the memo, the much touted and so-called \"superfood\" kale has taken over the top spot. And that was never more obvious than with the chef at Watty \u0026 Meg, who put it in nearly everything, to the ruination of our meal.\n\nThe appetizer of kale and quinoa salad with avocado sounded good. Though the menu failed to tell me that it was a de-constructed salad, as it arrived at my table with each ingredient in a neat and separate pile on a rectangular plate. The fresh, raw kale was cut relatively small and lemoned and salted appropriately. Nice. The quinoa in the middle was a sad hockey puck form still with the chill of the refrigerator on it as well as small underripe slices of mango (apparently they don't know how to pick fruit at the market) with no flavor to help the bland disk before me. Fail. The avocado was neither sliced nor cruda  as I would have preferred, but just a tablespoon sized dollop of avocado pudding with no personality that left me wondering about its inclusion in the dish. What was this to accompany, the quinoa or the kale? No sure it would have paired with or helped either. My partner had the tuna tartare, which was spicy and fresh with lively peppers and/or tomatoes in the bottom of the formed disk it was presented in. Nice.\n\nThen it all went to hell. I was sharing an entree of haddock and crabmeat with my GF. It presented well, centered in a large plate with a deep impression, fish nicely broiled and the crabmeat packed on top of this. But to the side was another dollop of avocado (?) and it was completely, heavy-handedly covered with confetti ribbons of flash fried KALE. Which, because of the way it was prepared added nothing to the dish, in fact destroyed the dish because you could not effectively remove it. It was, in size, color, texture and in-edibility, the equivalent of fake grass in an Easter basket.\n\nTo top it off, my GF, in an effort to avoid the plastic kale strips, took a low approach with her fork to go directly to the haddock, and seconds later was choking on a mouthful of bones. When finally flagged down, the waitress seemed blasé. \"Oh, sorry, I'll bring you some water.\" And later a free scoop of ice cream. Whoo hoo!\n\nOne of our guests had a pasta dish that also contained kale, though thankfully cooked.\n\nOut of fear and the desire for another beer, I skipped desert. Though the rest of the table each imbibed. Though it is worth noting that the berry schnitzel, which was really a cobbler, contained quinoa.\n\nThis idea of cross-migrating ingredients across your entire menu is a lazy and mostly unsuccessful concept. And our experience is a perfect example of why.", "author": "Noisy V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-18", "description": "I should preface this by saying that the food here is great and the aesthetics are delightful. \n\nI have been to Watty \u0026 Meg on several occasions. When they first opened, the food, service, and ambiance were fantastic. However, it seems like with each subsequent visit, the service gets weaker and weaker. \n\nDuring our most recent brunch, the service was laughably bad. I felt like I was in some sort of Brooklyn spoof comedy. Our waitress arrived at our table and stood there for and awkward ten seconds looking bored for before asking if we wanted anything to drink. It was really difficult to get coffee and milk refills. All requests were met with unenthusiastic responses, despite the fact that the place was nearly empty and there were plenty of servers and a bartender. I get it- it's Sunday brunch and we're all tired and hungover, but we can do better. \n\nOne of the specials was a heirloom roasted tomato omelette and it presented as an unroasted, plain grape tomato omelette. A dish ordered without potatoes was served with potatoes. Neither of these things ruined the day, but with the overall unpleasant vibe of the place proved irritating. \n\nI really want to like this place, as it's in our neighborhood and has nice food, but I'd rather avoid feeling condescended to by servers in the future. \n\nI'd love to see improved effort in the service, as it would really make this place a go-to in Cobble Hill.", "author": "Meghan G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-16", "description": "First off, I've been a loyal customer since they first opened and always had a good experience.  What happened?  My experience on Sunday...not good.\n\nI was alone so I sat at the bar.  Just wanted a quick something yummy and be on my way.  Sat for almost 10 straight minutes staring at the bartender who busied himself at the other end of the bar and never glanced at me.  Didn't want to shout to get his attention.  Looked to catch the eye of a server walking by but couldn't.  \n\nFinally the bartender got near enough that I could say \"can I get a menu please!\" loudly and he did look kind of startled, I think because I sat in a seat someone had vacated he assumed I was still that person (their stuff was still there, hadn't been cleared.  Yuck.)\n\nHe brought the menu and cleaned up.  A nice little salad caught my eye - yellow watermelon, arugula, shaved red onlon, Marcona almonds, dijon vinaigrette.  Done.\n\nProblem 1 - watermelon was pink, not yellow.  So much for exotic ingredients, I was looking forward to yellow watermelon.  Problem 2 - shaved onion? (I think that's what it said) - this was an entire onion sliced and about equal in quantity to the arugula.  I don't want to eat an onion salad!  I tried to pick it out because mouthfuls of onion is really gross - this isn't a vegetable people!  It's a cheap trick.  That left very little \"salad\".  Problem 3 - there were 3 almonds, and they weren't Marcona almonds, they were just regular ones.  So much for a more unique and delightful add in - I ordered the salad just because of my love of Marcona almonds, I thought it was a nice touch.  Too bad they don't actually use them.\n\nI know this is picky but really....what a STUPID salad.  I told the bartender as it made me pretty cranky and he offered to comp me a glass of wine.  I said no but thanks.  The bill comes and it's $17.  Haha!  For this stupid salad and a glass of club soda.  I had to laugh - I told him - why not comp the club soda??  You offered to comp wine!  (Hell, he should've comped the salad).  And he took it off the bill, but I don't think I should have had to point it out.\n\nYou know, it's the little things in life.  Or it's say what the thing is, put down the creative writing - yellow watermelon, Marcona almonds - to sell something and then give the customer something different and mundane.  Not nice.", "author": "K R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-19", "description": "Adorable restaurant with great food. Our waiter, while helpful, didn't smile. So that was weird. But the food made up for it. We had the calamari and Mac \u0026 cheese to start and both were delish. Other highlights at our table include spicy tuna tartare, roasted chicken, and steak. My cousin had the pappardelle and he was the only one semi disappointed. Just not thrilling I guess- I didn't try it.\nI will say that the entrees are on the smaller side. Also the mustard greens were not good, so get the broccoli rabe. Overall a cozy and yummy place and I would go back!", "author": "Samantha F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-13", "description": "I dont even know where to begin! Thursday was an ordinary date night thinking of a billion places to go to. Driving around looking for parking we stumbled across this little cute city like restaurant with outdoor/indoor sitting, I fell in love. I knew we'd have an excellent meal here. Their cocktails, as well as wine are delightful. we ordered the skirt steak, and the southern short rib, the waitress was amazing very attentive. Dessert was great. We had a wonderful quiet date night! couldn't as for more; Great drinks, food and dessert we were so full went to sleep as soon as we got home.", "author": "Keren S."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Watty \u0026 Meg", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "248 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YT5DS-hBfBN8Y-pPNWHjWg/ls.jpg", "@type": "Restaurant", "telephone": "+17186430007"}