{"aggregateRating": {"reviewCount": 255, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "This is a good go-to spot. Their brunch is a little boring for my taste, but I can be kind of a brat about wanting super over the top french toast and pancake options. \n\nI much prefer coming here for dinner. They have great people watching if you can snag a spot outside on the court street sidewalk. \n\nTheir Mac N' Cheese is some of the best I've had. Super thick, decadent and cheesy but not too oily or greasy which is always tough to accomplish. It has a great flavor, always a worthy splurge. \n\nTheir veggie burger is also one of my top 3 in all the city. It can get a little expensive when you start adding all the necessary toppings (gruyere, grilled onions \u0026 avocado are all a must). But the combination is so good, and you can tell they make them in house with lots of hearty grains, beans and veggies. \n\nTheir cauliflower puree is one of my favorite things. I would probably live off creamy mashed potatoes if I could, but that isn't really great for maintaining a girlish figure. This puree is the answer. It's probably loaded with cream, but knowing it's veggie vs. potato based gives me way less guilt. This stuff is seriously one of the best things ever. It's creamy and full of delicious flavor. It even comes with roasted garlic cloves on top, my breath is probably a dream afterwards but who cares. it's that good.", "author": "Angelique L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-12", "description": "Went to this establishment when plans faltered and we were in the area. Had minimal expectations coming into this visit, haven't heard of this place prior. It was a fairly late visit and the place closed at 11. I can't say this is a negative, but it closes at 11 on a Saturday- take it as you will. \nThe ambiance is cool, laid back and some decent enough background music- wasn't too loud. The waiter was... special. \nThe food was grand. Got the steak frites and was glad with the selection. It was a little on the skimpy side, but ample fries. My bro got the burger and it looked like a healthy portion of food. The drinks were cool, the Irish coffee was OK- I've had better. \nAll in all, I enjoyed the visit, I can say I will return. \n3 Stars", "author": "Dakai P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-27", "description": "Cute decor/location but that's about all this place has going for it. Overpriced and mediocre food. We were disappointed.", "author": "Scott P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-31", "description": "I'm a particularly particular person when it comes to brunch. As I sometimes moonlight (daylight?) as a brunch waitress, I have come to bemoan brunch culture in NYC. Greedy-bloody-mary-feinding-heathens, the lot of ya!\n\nAnyway, I found myself with a Sunday off \u0026 a chance to have the tables turned (quite literally), so I met up with a couple of friends at Watty \u0026 Meg. The decor of the place is simple but classic - dark wood everywhere and bookshelves behind the bar. Reaaal respectable-like.\n\nThe menu definitely makes it tough to choose just one thing. I could kick myself for not trying the Crab Omelet special, but I went with the Wild Goat Cheese \u0026 Mushroom Omelet and liked it all the same. My friends were fans of the Veggie Huevos, and I was stealing fork bites of the French Toast from across the table. Mmmmm blackberrys. Damned delicious.  Our food came ridiculously fast which made the experience all the more enjoyable ( ...for everyone sitting near me, that is. Nobody likes a hungry Ashley).", "author": "Ashley F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-09", "description": "Definition of 3 stars: slow service and food 15% overpriced compared to other options in the area. \n\nOur server was apologetic from the start--about the wait for our coffees. I see trouble ahead.\n\nCappuccinos took 15 minutes, food took another 45, meanwhile the place was half-full...on a Saturday brunch hour.\n\nI ordered a burger with fries (better than average and cooked to order), my brother had an avocado omelette and unimpressive Mac and cheese, and his friend had the BLT. Food was well-executed but took way too long. Overall, the menu is pretty run-of-the-mill so I'd opt for somewhere else with better service.", "author": "Kate T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "Amazing food and super delicious desserts!!! We had Bronzino BLT on toasted ciabatta with spicy buffalo sauce(yuuummmm!!!), steak and frites and trout with grits. For dessert we shared a white chocolate bread pudding. Our server was very knowledgeable and polite.\nMy friends and I are in love with this place now! Can't wait to try their brunch!", "author": "Monica C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-23", "description": "I knew I was in gentrified Brooklyn when I looked at the menu and saw Brussels sprouts okonomiyaki. \n\nMy skin started tingling immediately. I knew this feeling from Williamsburg - it was the Holy Hipster Spirit descending upon me. My jeans started getting skinnier. If I could grow a moustache (which I can't, because I'm Asian), it would start to curl into ironic directions. I started hearing ukulele music wafting through the air, a satirical ballad about endangered Panda bears. I wanted to quit my job to start a food truck. I wanted to wash down my sustainably-grown coffee with PBR. If I took a dump at this restaurant, I would've been reading Proust on its porcelain throne. \n\nBut this review isn't about feeling the Spirit. It's about the food. I ordered that Brussels sprouts okonomiyaki like the good hipster I am and you know what? Shit was good.", "author": "Josh C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "They've updated their Monday night Burger Special, y'all. As a responsible Yelper, Ifelt obligated to update my review to note this fact.\n\nThe burger is still delish, the portion of fries is still great, but now it's $12 and instead of a High Life, it's a Lionshead Pils. Still a good deal, just not *as good*.", "author": "Cynthia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-31", "description": "As hipster as it gets! Came here for Sunday Brunch, I'd definitely recommend the mac \u0026 cheese, it was phenom. However, I wish they had more brunch options!", "author": "Hina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-21", "description": "Brandon the bar tender was attentive and knowledgeable. The tina tartare delicious! Great location fro a drink pre-school meeting or post subway ride!", "author": "A S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-13", "description": "Liked the atmosphere at lunch time.  Mac and cheese good but not the best I have had.  The BLT was tasty and the fries were just right.", "author": "Michele W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-15", "description": "Went here with friends for Valentine's Day dinner. The place was packed but nice and warm on a very cold evening. Love the ambiance and decor...old world pub like. We had appetizers, main course, dessert and beer and wine. The waitstaff is amazing and very on top of things. \n\nThe appetizers that we ordered were on the large size. Totally sharable. I wish I could say the same for the entrees. I'm not a slow eater but when I looked up my friends were already done with their entree, as was my boyfriend! lol I will admit that the special lobster with risotto could have had more lobster in it for a price of $31. The lobster was a bit tough. I've definitely had better steamed lobster dishes.\n\nOverall, I found Watty \u0026 Meg's food to be flavorful with a good presentation, desserts were good, wine was good even though they do not have pinot grigio (who doesn't have pinot grigio?) BUT they are pricey. Four people at a cost well over $350...not so good.", "author": "Tori W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-27", "description": "Back in the day (10+ years ago?), when Court Street was a very blue-collar, thoroughfare lined with mom and pop shops, the W + M space used to house a worn in, but very good Italian place. God, I loved that place.  I was hoping that the old magic would grace W+M, but sadly, that isn't the case.  Not to say that it doesn't occasionally hit all the right notes.\n\nThe decor is the same generic Americana at the turn of the century look that's become de rigeur in the nabe. Dinner was decent when I went a year ago - a coriander seed crusted duck was pretty tasty, as I recall.  A recent brunch was standard to good -  the Ricotta Pancake with the blueberry lemon compound butter was particularly good, even though the serving size ( as presented in a 6\" skillet) was meant for a waif.  The duck confit with sweet potato hash and eggs was soggy and just ok. \n\nIn short, It's basically everything that the new BoCoCa stands for: aspirational, a bit rustic, a bit precious, and pricey.  It's just missing something that makes  me want to go back a third time.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-01", "description": "It was a hot, hot, hot NYC day but with its open and inviting set-up http://www.yelp.com/biz_photos/n0CFf_QvtK50ZW5g5w0teQ?select=-dWHFxOY0wOOElDuGc9kvw, Watty and Meg looked like the perfect place to escape the sun and grab something nice for lunch. \n\nI had the fish sandwich of the day which was a pan seared hake http://www.yelp.com/biz_photos/n0CFf_QvtK50ZW5g5w0teQ?select=eCAyy0XqQJ5ZBbH50zjDpQ which I enjoyed thoroughly. The fish was nice and flaky and went well with the tartar sauce. The side salad looked a little sad but it was a crazy hot day so it's totally understandable.  \n\nMy friend has the pulled pork sandwich http://www.yelp.com/biz_photos/n0CFf_QvtK50ZW5g5w0teQ?select=_ZUNo3uoXU0LoosOhqEP_w and it was delicious too. The sauce had a nice kick and since it was served on the side, you can get all the flavor without being overly sloppy. The fries that came with it were absolutely delish and threatened to steal the show from the pork. \n\nWhile we had beers with out food, it would have been nice to have been offered water too since it was almost a hundred degrees out. You shouldn't have to ask for water. One other thing to note is that they only accept cash or Amex cards. \n\nAll in all, Watty and Meg is a fairly chill restaurant - perfect for a lazy afternoon. Service was prompt and friendly but diners didn't seem to be in a rush and neither were we.", "author": "Jon L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-24", "description": "Overpriced and bland. My girlfriend and I went for brunch and had a BLT + Burger. With 2 cocktails, the bill came to over $80 w/ tip. The food was supremely mediocre. The service was fine and the restaurant looked cute. Seems like a good place if you have children or a large party, but otherwise stay away.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-11", "description": "This is the best place to go for cold food, rude service, and staff who don't listen to customers.\n\nMy boyfriend and I walked in for brunch this morning. Out of the 3 people who interacted with us in the first 5 minutes, 1 of them was polite. The host and his stupid hat rudely told us that there was no room, they were fully booked, and that we had to sit at the bar. Did I mention we were surrounded by empty tables?\n\nWe decided to sit at the bar alongside 4 other customers. It took the bartender 10 minutes to acknowledge our presence. Finally, we ordered food, one coffee, and water. Did we receive the water? No. Did we receive cold food? Yes. I asked for hot sauce from the food runner, who acknowledged my request with a \"yeah,\" and then, 10 minutes later, I asked the bartender who gave me the same response.\n\nI'm still waiting for that hot sauce.\n\nWe finally received two glasses of water after sitting for 30 minutes and suffering through a horrible joke about them running out of water.\n\nI ordered the brussels sprouts, salmon, and poached eggs. My eggs were not poached. They were more along the lines of almost being hard boiled. I am by no means a cook, but I can poach an egg. I don't get paid to poach eggs, but somehow these \"cooks\" do? My boyfriend's BLT was sloppily put together on the plate. The best thing about his dish were the fries.\n\nOverall, bad food, worst service, but the interior was cute and the best thing about my meal was the coffee.", "author": "Elena H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-26", "description": "On a scale of not amazing to not terrible.  It's somewhere in between.\n\nService here has been pretty awful, though. I have to comment on that. Nobody who has waited on us, provided any real reason to leave much of a tip.\n\nFood was pretty good, portion sizes are fair, and the quality seems to be standard for the price range. \n\nCan't complain about anything eaten, but based on service, crowd and past experiences... really don't want to dine here often.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-22", "description": "Have been here several times, thinking it's a solid neighborhood place. Was treated so badly by the manager at a recent meal that we will never go back. There are plenty of other places around with equally good food--and where a burger doesn't come with a side of humiliation.", "author": "Julie E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-17", "description": "We want to keep loving watty and meg, really we do. My wife and I had our rehearsal dinner here a year ago, and it was excellent. The food, service, and atmosphere were all top notch. We've continued to come here occasionally since we live a block away. And while the atmosphere is still great, both the food and the service have gone way downhill. \n\nFor example, on one recent occasion my wife had to return her steak three times because it kept coming out cold. Their sandwiches are on pizza bianco (a thin, flatbread). We've had both a turkey sandwich and a fish sandwich and both times, the bread completely fell apart in our hands. At lunch today, our waitress kept forgetting things that we asked for, like the salt that my wife ended up getting herself. \n\nOverall, it's a nice place to go. We would just love it if they could get the service together, and get the food back to the level it once was.", "author": "Dave H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-12", "description": "I have loved their burgers and also mac and cheese. Meat they use in burgers taste so real, so juicy.  Beer selection menu is wide, you may try different Brooklyn ales. Atmosphere  is mystic and quite calming. Creme brulee had a crispy top coat just like I like to have so  would definitely go there again when I am around.", "author": "Ceren A."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Watty \u0026 Meg", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "248 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YT5DS-hBfBN8Y-pPNWHjWg/ls.jpg", "@type": "Restaurant", "telephone": "+17186430007"}