{"aggregateRating": {"reviewCount": 255, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-23", "description": "Although you don't necessarily have to make a reservation, I appreciate that this is one of the relatively few restaurants that *does* allow you to make a brunch reservation. I came here with three friends a few weeks ago on a Sunday. Our reservation was for 12pm. I was the first to arrive (a few minutes early) and the host had our table all ready and allowed me to sit down before the rest of my party arrived.\n\nBrunch was great. I had the mushroom and goat cheese omelet with a side order of nine-grain toast and jam, and coffee. Can't remember what my companions ordered, but we all enjoyed our food. Our server was very helpful and charming. I remember too that one of my friends was curious about a particular soup on the menu, and our server said he would be glad to bring her a sample to taste. When the sample arrived, it was quite a generous portion---my friend was quite impressed by that! (And she liked the soup)\n\nThis was my second time at Watty + Meg's for brunch and I'd definitely come again. I haven't yet had dinner there, but would be glad to try it sometime.", "author": "Elle G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-04", "description": "Watty \u0026 Meg is a comfy neighborhood spot, serving comfy food in Cobble Hill.  I went there for a weekday lunch and was pleasantly surprised to see that it was busy.  The crowd was a mix of people from single 30-somethings to young families - lots of baby strollers.   \n\nI sat at the bar and ordered a cocktail and a cheeseburger.  The burger was good, but was overcooked.  The cheddar saved the day as it was really good cheddar and melted perfectly.  The fries were fine.  The servers were friendly, but they were a bit disorganized as there was no dedicated bartender/server.  When I sat down at the bar and ordered a drink, the server who took my order left the bar area, ran some food, cleared a table, then came back and made my drink.  I ended up being waited on by 3 people.  Not a huge deal, but it is kind of annoying.  Having been a server myself, I get that they probably do not need to have a bartender on at lunch, but it is a bit discomforting to not know who to ask for refills, who will be getting your food out of the kitchen window, etc.\n\nOverall, decent food in a relaxing spot, with friendly, if somewhat erratic service.", "author": "Dan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "I was pleasantly surprised at how great everything here tasted! I had a water-crest salad and a maple burger, both were incredibly tasty! The mood is relaxed, nice classy but intimate decor, medium-dim light. Great staff too (friendly and knowledgeable). I would definitely bring a date or parents to this kind of place.\n\nMonday is burger night -- $10 for a burger and miller (extra for toppings)\nWed is live bluegrass", "author": "Nick B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-18", "description": "The service was great, the menu had unique choices and be food was delicious.  I would definitely recommend this if you are looking for a casual but romantic place to eat or if you are just looking to have a drink.  The menu has inspirations from a variety of cuisines.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-12", "description": "My boyfriend and I were walking around our neighborhood looking for a place to eat and came across Watty \u0026 Meg. The menu looked really good and not too pricy. Places like this are a dime a dozen in this area though. I ordered the salmon and brussel sprout hash - beware this is LOX, not SALMON. Good dish, but I thought it would be made from a salmon fillet, so I was a little disappointed. The dish was good, but I did need to add a little salt and pepper, as it was a little bland.\n\nMy drink was the best part, a mixed drink with Rose and St. Germain, light and crisp, and the right amount of sweet! The strawberry lemonade drink lacked flavor, I recommend trying something else.\n\nIn terms of seating....I know they take reservations, but there was no wait when I was there around 3pm on Sunday afternoon. We asked to sit by the front, since the walls were opened up. I was told there was a reservation for that table, but we were there for an hour and still nobody sat at that table! So, not sure what the host was doing, but we could have been seated at that table.\n\nI would only go back to try dinner or sit at the bar, as the drink menu looks great.", "author": "Sara W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-30", "description": "I came here for brunch this weekend to enjoy the nice weather and an outdoor table. This place has its charm, and though the service wasn't that great, I really enjoyed the food and the casual atmosphere. While we were seated immediately, no one came by to even take our drink orders for a good 10 minutes. After we finally got the orders in, we waited another 15 minutes or so just for the drinks. Luckily the food came not long after, so we were only slightly irritated but not fuming. I ordered the wild mushroom and goat cheese omelet and my boyfriend ordered the BLT. I don't normally order omelettes but I'm digging the one they serve here. The BLT was good too, on a very thin almost cracker-like bread but it worked. Good spot for a casual brunch!", "author": "Tiffany F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-29", "description": "My boyfriend and I came in here on a whim. The menu was small but seemed appetizing so we decided to make our way in. Our waitress was friendly and put up with my boyfriends ridiculous jokes ( I give her credit). \nHe ordered a burger with every topping you could imagine and it looked amazing. The french fries were awesome! I love thin crispy fries. \nI ordered the vegetable Wellington, which to my surprise I also loved! The fondue with it was delicious and it was just the right amount of food. Even my burger loving man enjoyed the small bite I allowed him to have! \nWe also order the mango blueberry crumble and it was delicious. I loved the dollop of cream on top.\nOver all we had a great experience, the food was yummy, the service was fun and knowledgeable, and the atmosphere was pleasant. \nMy only complaint was that the prices were just a tadddddd expensive. But oh well it's worth it.", "author": "Anya B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-10", "description": "I am a fan of Watty and Meg. I wasn't a believer at first; thought they looked sort of pretentious but they are actually super nice and everything I have tried there has been very good, albeit the pricey prices.\n\nI went on a sunny weekday for lunch and got to sit outside, and it was perfection. Then, all of a sudden, the bees appeared. Apparently they have some neighbors who have hives up on their roof so the bees like to come down to visit once the food arrives. That was probably the only annoying thing I can say about them. I had an omelet with mushrooms and goat cheese-yum. Their side salad was perfect too. My friend and I each got a glass of wine as well. \n\nCame back recently for brunch and got something interesting- it was smoked salmon hash with brussel sprouts and poached eggs with a cheese sauce. It was awesome!! Kinda out of the box and totally tasty. Also a big portion- I was stuffed! \n\nI will say they are also very accommodating to the stroller and baby sect, a big plus for us these days. Want to come on Monday when they have their burger night special next- burger and a beer for $10!", "author": "Sara K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-18", "description": "I tried out Watty and Meg for lunch with my boyfriend after walking by it repeatedly and checking out the menu, always deciding to try it out \"next time.\" We stopped by around 1 O'clock. There were a few tables full, but I would not at all say it was busy, however there was only one server working and one bus/water boy who appeared to be responsible for filling water, clearing tables, and running food. The menu had a lot of items I would love to try. My boyfriend and I decided to share the crab cake and the veggie burger, but decided to ask the size of the crab cake before ordering to ensure it was enough to share. For 16 dollars, the waiter said the cake was the size of the top of our (thin) water glasses. For the price and most importantly our appetites, we decided to take another minute to decide what to order. \n\nAfter we had decided to order the pulled pork sandwich with their fresh cut fries and the veggie burger with a side salad, but BEFORE the waiter came by to take our order, the bus boy took our menus to give to someone else, which we found a bit weird considering how empty the restaurant was. We waited about 40 minutes for our food, during which time a party of 5 that ordered after us was served, and two parties of two that were seated 10-15 minutes after us were given their food. At this time, we were both annoyed and starving. The waiter brought me a refill of lemonade without asking and did not charge for the refill, though I don't know if that is typical or if it was a apologetic gesture for the wait time. \n\nFinally, 10 minutes after the waiter came by to say it would be \"right out\" after we had already been waiting 25 minutes for our food, it came out- piece meal! My boyfriends pulled pork came out about 3-5 minutes before my veggie burger! The veggie burger was homemade and had a very earthy flavor, which was fine, though it could have used some cheese or some kind of sauce to add extra flavor. The pulled pork was excellent but could have used a little more coleslaw on top, and the fries were wonderful. The side salad was just lettuce with no extras, but the italian dressing that came on it was good and light. Sadly, the prices were not worth the portion sizes, and the service was horrible. We never received an apology for our wait time. \n\nI don't think we'll be going back- Carroll Gardens/ Cobble Hill has too many excellent restaurants to settle for mediocre service.", "author": "Kelsey H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-29", "description": "Have been here twice - once for brunch and once for Monday night HH with $10 burger. Both experiences were just A-OK.\n\nBrunch menu isn't anything special. Burger for $10 on Monday night excludes any additions (cheese is even extra) but includes a can of Miller High Life. Staff wasn't too friendly on Monday night (likely because we were only there for the burger). Waitress even took away my friend's side of fries which were only half-way eaten without even asking (likely trying to get us out of there).\n\nWould probably not come again.", "author": "Siv L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-28", "description": "Was trying to figure out where to go for Brunch-for-one on a Saturday morning (read: \"early afternoon\") and decided to give Watty and Meg a try.\n\nGot there about 1:30, sat at the bar.  There were only a few tables available (it's not a terribly large spot to begin with) and I didn't want to waste a two-top on just me.  The bartender was a lovely woman from Western Canada, didn't catch her name.  She made me a very adequate Bloody Mary (new Brunch rule: if the cocktail isn't on the menu, it's probably not worth ordering) and, later on, a drink of her own devising, which was delicious and refreshing.  Each drink cost at least $10, I think one of them was $12, which seemed pricey for brunch drinks.\n\nFor food, I ordered the brussel sprouts and smoked salmon hash, with poached eggs and some sliced up fingerling potatoes.  The eggs, salmon, and potatoes were a classic combo - really delicious - but I wasn't COMPLETELY convinced about how the brussel sprouts fit in.  They seemed a little at odds with the rest of the ingredients and slightly over-powering in taste.  On their own, they were well prepared, fresh, and tasty...but in the context of the rest of the dish...perhaps not completely successful.  The other issue I experienced was that my lovely deep-pink smoked salmon slowly turned pale pink as the heat from the rest of the dish cooked it, changing the flavour as I ate.\n\nThere are some other interesting looking dishes on the menu (both in terms of descriptions on the menu and the plates I saw coming out of the kitchen) so I'll definitely be heading back, but over all, it won't be my go-to brunch spot.", "author": "Alex H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-20", "description": "My parents liked the lunch we had here, but I was underwhelmed.  A pity because I'd had a pretty wonderful dinner here a couple times. The lunch service was inattentive and the menu was pretty lame. \nAs for dinner, I loved how the bar tender took special pride in an unusual whiskey he had and made a nice big deal about serving it to me -- he made both the the drink and the evening feel special. \nSo...would be a four star, but for lunch, which was just ok.", "author": "Ethan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-06", "description": "Their food is standard American fare that tastes good enough. I've been here at night where the service was good, but I'm currently sitting here with a party of 14 and the service feels a bit off.\n\nThey're overly anxious to take orders, even though we are very obviously in the middle of a discussion. The manager literally walked in, interrupted our discussion,  and said, \"If any of you people are interested in ordering anything, feel free to jump up and down or wave your arms around.\"\n\nThe waitress took orders with a very annoyed composition. The fact that we were treated as a nuisance as opposed to a large party there to eat food and have a business discussion was very off putting.", "author": "Zane B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-17", "description": "Came here for the Monday night burger special - $10 for a burger, fries and can of Miller High Life. Burger wasn't bad. The pickles were nice. I really liked the fries. We all pretty much had the same and no complaints. I'd like to try brunch here or something else.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "Had delicious lunch today, the first time I've eaten here in the daytime. Servers were super sweet and really unhurried. Perfect for a holiday lunch!", "author": "Joseph O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-11", "description": "I'm sticking with 3 stars. My bank is right next door. One day this summer I was waiting for something to get finished at the bank, and I sat down outside for a salad and a cup of coffee. $25 later I was still hungry. \n\nI am *so* not miserly. I'll spend money, and I don't feel bad about doing it, if the experience pays off. But kind of it doesn't at Watty \u0026 Meg for me. \n\nI had a salad that was like... 1/4 cup of guacamole, 1/4 of kale, and 1/4c of quinoa, as I recall. All spread out in 3 little piles on a long plate. And nothing was especially delicious or gourmet or complicated in the preparation or presentation. Nothing to warrant the price tag, is what I'm getting at. //shrug// They seem to be full of patrons, lots of the time, so I guess other people have a different experience. But this is mine.", "author": "Lauren L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-01", "description": "This review is for brunch. Definitely appreciated being able to book open table reservations for 6 and be close to the UA Court Street movie theatre. The service here was forgetful and somewhat ditzy getting our order wrong - but they were friendly at least and were apologetic. My Quinoa, Kale and Avocado salad was fresh and filling and the free range grilled chicken I ordered with it was flavorful. My wife didn't live here fish sandwich but I didn't think it was too bad. The coffee was solid as well. I also tasted our friends food which was a great crab and salmon omelette and the fantastic croissant French toast! The decor is cute and it wasn't overly crowded. I would go again.", "author": "Bjorn P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-10", "description": "Was here Friday evening with a friend who's a regular and sat at the bar. The bartender placed down 1 menu. A couple of minutes later, he asked my friend what she wanted to drink. He smiled at her, made a recommendation then walked away. Wait! Not a word to me, didn't look my way, didn't ask me what I wanted to drink!! I felt quite unwelcome! \n\nBecause of past negative experiences with service and inconsistent food. (Once, I sat in the back on the long wooden benches in a party of 6. It took over an hour to get our entrees. Sitting on those benches, squeezed together, for over an hour waiting for food is not a dining experience I'll ever enjoy.) I've decided to stay away. Perhaps now, I'll continue to do so.", "author": "Gee B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-28", "description": "Beer list sucks. All too bitter or hoppie. Burger was very good. No complaints. Server was not on his game. Did not ask if we wanted to start off with a drink. Brough out the wrong beer and messed up the bill. Place was almost empty at 7:30 on a Saturday night. Hmmm.", "author": "Tom F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-24", "description": "You would think that Watty and Meg had been in the neighborhood forever! We had a fantastic meal here and were so delighted to find innovative and imaginative fresh food mixed with some bistro favorites. My boyfriend had the lamb special that was quite delicious. Wild fish is always a plus, so their fish specials never fail to disappoint. Presentation was pretty too! They also offer a really lovely selection of creative cocktails. Even though the service was a bit casual, the staff was welcoming and knowledgeable. We are thinking about moving to the neighborhood and Watty and Meg made us feel like we were at home...", "author": "Alaia K."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Watty \u0026 Meg", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "248 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YT5DS-hBfBN8Y-pPNWHjWg/ls.jpg", "@type": "Restaurant", "telephone": "+17186430007"}