{"aggregateRating": {"reviewCount": 255, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-28", "description": "The Monday night burger deal is insane. For $10 you get a high quality, grass fed burger with crispy fries and a delicious beer. Worth the trip to Brooklyn. Definitely would go back to try other specials! Also we had a group of 14 and they were very nice about it.", "author": "lysa p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "Watty and Meg has quickly become one of my favorite local spots since moving to the neighborhood. The menu is minimal but everything is so f@#!ing good! Even better are the daily specials - including the $10 burger and beer on Mondays!!", "author": "Dennis M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-12", "description": "went there last year to see Medeski playing an intimate set. the food was great. haven't been back since I've turned into a vegan but i'm happy to see a couple of vegan choices in their menu, and that means I'll be probably back!", "author": "Mary N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-28", "description": "Came  here for Brunch and due to bad weather, the place was practically empty.  Service was top notch.  They gave us biscuits with a sweet butter, which was very tasty.  My husband ordered the burger, which was very good but each topping is an extra $1 so by the time you got a loaded burger ,you're paying $16 bucks - a bit on the high end.  I had the French toast, which was also very tasty.  The food is very solid and I would definitely come back here for brunch or dinner.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-28", "description": "Really nice renovation of the space - and kudos for them they kept the tile floor and pressed tin ceilings.  BUT, the food was bland, overpriced and not cooked to order.  I'll give them another try, but, there are so many other great options, it's hard to find the time to go back.", "author": "Eat It B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-27", "description": "I had dinner at this new restaurant and I found it to be outstanding. Casual elegance with no pretension! I had the fennel salad and my date had the scallops, and both were perfect. Light, tasty and beautiful. I had the Halibut special that was great. It was poached in carrot and coconut juice, served on a bed of wilted spinach and it could not have been more delightful. The service was perfectly attentive, and pleasant. Nothing over done with regard to trying too hard. It is a great space with great food. Nothing haughty about it, but it has all the components of a first class establishment. You can tell the food is absolutely fresh.\nI'll be back..alot!", "author": "Sofia G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-28", "description": "Very mediocre food. Decent to good drinks. Super cute place.  All in all a nice neighborhood spot if not for the price.", "author": "Jason S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-16", "description": "Very so-so and way over-priced.  $18 for a mediocre veggie burger with avocado!   I am more than willing to pay these kinds of prices if the food is delicious, but Watty and Meg's food is not delicious.  I will not be going back here.", "author": "Anna B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-13", "description": "We live in the neighborhood and have been to Watty and Meg a number of times. The decor is very nice, the food is OK but certainly not a standout compared to much more inventive restaurants on Smith Street and Court Street . \n\nThe service was adequate when they started out but has steadily deteriorated. We were there for dinner two weeks ago and it turned into a disaster-- slow serving times, entrees served to two of the party but not the third and a stifling temperature in the back room (it was a hot night, but the AC was completely overwhelmed and it was clear a number of customers could not wait to get the check and just leave). Since we also were ready to pass out, we asked for the check and asked that the desert cheese sampler which was part of the prix fixe be wrapped. After waiting again for an inordinate period of time, they finally brought the check but forgot to wrap the dessert. \n\nOn the way out the owner apologized profusely, pleaded for our email and promised to contact us. Needless to say, we haven't heard from her. \n\nFinal impression of Watty and Meg after a year? An ordinary restaurant that is overpriced, run amateurishly and on a downhill trend, especially compared to all the other great restaurants in the neighborhood. Smith Street never would have earned its culinary reputation if Watty and Meg was the standard.", "author": "herb w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-12", "description": "Bummed to see the semi-dismal reviews of Watty \u0026 Meg - truly bummed.\n\nPart of me doesn't mind because that means the place won't soon become impossible to visit, but the other part knows they deserve better than the halfhearted praise seen here.  Have they refined their offerings since first opening?  Yes.  Are their prices more aligned with the offerings than they used to be?  Yes.  Can a delicious meal be had at W\u0026M?  Hell yes.\n\nFirst visited the restaurant only recently because we were put off by the Yelp reviews and were pleasantly surprised to find two exceptional meals just around the corner from our apt.  To clarify, this was our first date night after having our first baby and didn't want to venture too far as the grandparents babysat.  We wanted a great place in the neighborhood, but after having lived there for 5 years we wanted to venture out beyond our comfort zone (Robin des Bois, Faan, Saul, Grocery, Po, JakeWalk, etc.).  Time to try Watty \u0026 Meg, then.\n\nThe place is gorgeous - really a beautiful space with exposed brick, tin ceilings, great layout of tables and booths, with nothing crammed in.  We'd walked by dozens of times and admired it from the outside, still put off by the early reviews, but loved the space and the ambiance as soon as we sat down.\n\nI went off the regular menu and ordered the daily additions: tuna tartare in sesame oil and roast duck with candied kumquats.  They were both exceptional, particularly so with the beer pairings (Sixpoint Righteous Rye and Schneider Wiesen Edel Weiss), and reasonably priced, though the server strangely misquoted the price of each by $2.  Service was otherwise on point.\n\nI'm a duck guy - whenever it's on the menu, it's mine.  This duck was perfectly cooked and seasoned, with a well-proportioned ribbon of fat along the back, slightly sweet, clove-y reduction, and scattered remnants of confit in the braised bed of cabbage underneath.  I've never been a big fan of cabbage in any form, but the duck and the reduction transformed it completely.  I seriously hope they add this dish to the regular menu.\n\nThe wife had a market green salad and lobster ravioli and raved about both - and girl knows her lobster (she's from Maine).  The small twists on the salad (separated brussels sprout leaves, sunchoke chips) were scrumptious.  By this point, we were both fans of the place, wholly surprised by the experience.\n\nFor dessert, the cappuccino panna cotta with whipped white chocolate mousse.  Wife hates panna cotta, but this bowled her over.  Seriously good, and just slightly inventive enough to remember every spoonful a week later.  Hope this stays on the menu for a long time to come.\n\nSooooooo, not sure why the negative reviews, but the place has found their rhythm.  If you haven't been, go.  If you have, go back.", "author": "Mike E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-03", "description": "The food was awful. \n It was served cold or a combo of cold and warm. This was explained to us by the waiter as this part is cold, this part hot. This made no sense as an explanation nor was it helping the taste and presentation of the food.\n I got an appetizer that had crawfish in it and it tasted as if the crawfish weren't completely defrosted or if they were they were dried out and hard. It was just bad and weird.\n Nothing else was much better. I would've been upset if it was reasonably priced but for $100 for me, my mom and daughter, with no drinks, it was so blatantly over-priced for the awful quality I was so incensed I am writing this review, which I've never done.\n I never said anything the the cloying ,annoying, and frankly, bad waiter, who constantly was asking how everything was. I didn't blurt,\"It sucks\" as I gave them the benefit of the doubt thinking it was an off day. I mentioned I went there to friends who immediately knew where I had been when I said I took my mom to this awful restaurant on Court St. they had a different but equally abysmal meal there.\n I believe it is named after dogs. Are they cooking?", "author": "Sandye R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-06", "description": "Hmm, don't really get it.  \n\nThe name and the decor suggest a sort of English countryside (gastro)pub, while other flourishes imply something a little more organic-y and Californian, and it sort of managed to be neither.  The principal problem may simply be the menu, which is limited and not terribly ambitious or inspiring, but also pretty far removed from the direction of \"comfort food\".  And to make matters worse, they were out of my first *two* choices as well as several of the specials that had been advertised on the chalkboard.  I settled, virtually out of necessity, on a chicken dish, which was competently prepared but .... just ... meh.  Our server, meanwhile, was somewhere between inexperienced and indifferent.  I'll give it props for not succumbing to the temptation of being gimmicky, and had the sense that they were having something of an off-night, but all the same, left feeling pretty indifferent about whether it would be worth it to give the place another try.", "author": "Nate S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-31", "description": "I would recommend this place for many reasons. It's location makes for excellent people watching and just taking in the best that cobble hill has to offer. They even have great outdoor seating.\n\nLove the food! My favorite things on the menu are their burger and their brioche french toast with caramelized bananas and candied pecans.\n\nThe staff is friendly and food is great. If there is a few minutes wait for a table - it's truly worth it.", "author": "Cami W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-06", "description": "Disaster- the owner/pseudo chef asked us to leave our table after a $300+ dinner to move to the bar so she could seat another party- this is after the waitress forgot to add our bottles of wine to our receipt, which we reminded her of so we could pay properly. whatever- rude and we will never go back. The food was not that good were we could overlook such rudeness.", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-14", "description": "good food, quinoa salad is the best and the fries but the service is not that great", "author": "Jessica R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "we were here lunch time on a weekend, and had our meals in one of the tables placed almost like 1/3 portion of the sidewalk but with an awning (what people normally call \"outdoor seating\") from the wall. i actually sat on a chair directly under the blazing sun and my companions were asking if it was a good idea to be doing so. i said yes, bravely lol....i was enjoying the whole scene of people walking by. i had the ham \u0026 grits in their brunch menu, which turned out to be excellent tasting. i also tasted what my companion had, which was duck \u0026 sweet potato---it also tasted great. and i noticed their rather neat, polished but well studied way of presenting their food with all the items in each plate properly placed---not really pretentious, not even expensive looking---i guess they have their order of placing each item depending on the order. i think their prices are reasonable. i have to add, service was excellent. i'll definitely recommend this place to others who like having updated versions of regular american foodfare.", "author": "Jerome Espinosa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-24", "description": "This was the first time I had dinner outside the house with my significant other, and by pure chance we ended up at Watty and Meg's for an early Thursday dinner. We had the trout and the risotto, respectively, and we were most pleased with the food: the risotto was creamy, yet firm, and plentiful, while the trout with serrano ham was a wonderful combination. Service was friendly and accomodating, and I am looking forward to our next dinner date at this place!", "author": "frederick f."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-21", "description": "Very meh experience at this new place, which we were very hopeful about.  The vibe is nice and the outside seating is a plus for an area with surprisingly few outside-seating places, but I agree with other reviewers that the menu hypes up the food to be something it just isn't.  \n\nWe never got bread, while others around us did.  The appetizers were decent - pretty basic butternut squash soup and seared scallops with about a dozen different ingredients to go with it.  (Kind of the menu theme.)  I made a mistake going with the garlic shrimp, which was just three honking shrimp over a heavy boatload of succotash and collard greens that I could barely wade through.  My date got the chicken breast with -- ready? -- mint pesto, pumpkin seeds, butternut squash puree, and black bean and corn salsa.  The chicken was just okay - no pumpkin seeds to be found, though, and why is the black bean and corn salsa in that mix?  The whole thing was so over-engineered and had no real taste payoff.  For the price of this food, you want a little bit of the wow factor, but there's none here.\n\nIf you do go, definitely get a bottle of wine for two -- WAY worth it compared to the miniscule (and pricey) glasses they pour.  The people next to us ended up needing three glasses each and were lamenting the waste of money.\n\nOverall, the vibe was that this place just won't last long.", "author": "lucy l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "I'll admit that when this place first opened, I was underwhelmed.  The food was mediocre and the prices were high.  I went back recently as some neighborhood friends that I respect told me that it had gotten better and they were right, at least for what I ate.  The prices remain high but the food quality was much better as was the service.  I had their burger which was basic but done well.  I asked for it Medium Rare which at most places means it's coming back medium but this one was actually done to the rare side.  The bun was tasty as were the fries.  I washed it down with a Six Point Righteous Rye (extra points for local beer on tap) and our waitress was really pleasant.  So I've probably gone from a two star to a 4 star on this one.  The food still wasn't blow me away good but it has gotten much closer to justifying the prices.  The ambiance is very nice here too and I really wanted to like this place when it opened.  Now I actually can.", "author": "David N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-03", "description": "I live right around the corner, and I'd been looking forward to trying this place. They are still working out some kinks, but I'd go back tomorrow (in fact I think I might). \n\nThe place itself is lovely--low lighting, wood bar, brick....plus lots of outdoor tables as well.\n\nThe food was really, really tasty-- fresh, well-seasoned, comforting but not at all gloppy. The salad trio (kale, quinoa, avocado) was so perfectly dressed it was the kind of salad that makes you consider going vegan (though it might just be veg). I loved my shrimp \u0026 havarti grits (the collards balance it out perfectly), the burger was kick-ass (very well-cooked) but I agree with another reviewer that the hangar steak was...meh (as one of the pricier entrees, it really shouldn't be!).\n\nThe wine list, SO happily, is nice and not too pricey at all! Plenty of options in the $30 range.\n\nThe service still needs some work. There didn't seem to be enough wait staff (though there were loads of busboys--too many lingering around). I saw another table get their apps before their wine (ick!). But our waitress, when she was there, was adorable and informative.\n\nOverall, a great value for such a lovely space and food. I'm thrilled it's here.", "author": "Annie H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Watty \u0026 Meg", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "248 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YT5DS-hBfBN8Y-pPNWHjWg/ls.jpg", "@type": "Restaurant", "telephone": "+17186430007"}