{"aggregateRating": {"reviewCount": 255, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-13", "description": "Went here over the weekend for brunch with a group of friends.  The restaurant is very charming and comfortable inside.  We got a corner booth in the back that was nice and private.  Everyone at the table ordered breakfast dishes that all looked really tasty but I opted for the roasted veggie sandwich.  I can only speak to my food which was delicious.  Eggplant, zuchini and peppers were all roasted perfectly and the pesto and goat cheese made it refreshing but not heavy.  The bread was fantastic - crusty and didn't get soggy with everything on it.\nThe brunch drinks were a little pricey... My screwdriver was $9.  Service was nice enough and they kept my coffee full.\nMy boyfriend and I always walk by at night and everyone's plates look so good, so we will most likely be back again for dinner.\nOne issue - WHY ONLY CASH AND AMEX?  I don't understand why so many restaurants in the neighborhood do that? ANNOYING", "author": "Raquel L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-21", "description": "Amazing venue, super attentive staff and great food. We went for a 3 course dinner and I was impressed with each and every dish. A French twist on the food but nothing too heavy. Def check it out!", "author": "Natalie T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-26", "description": "Rude service at takeout. Food was just OK - way expensive for what it was.", "author": "Jake C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-05", "description": "First experience with sparkling Riesling. Perfect for a warm Brooklyn late afternoon.", "author": "Lee H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-27", "description": "After eating here and reading some of the other reviews, I think it is important to remember that running a restaurant is hard. Profit margins are slim. Customer service doesn't come naturally to everyone. Customers themselves can be difficult and demanding. For instance, when I came here for dinner on a Sunday night, the fryer was broken. I was offered a range of options instead of fries (salad, kale, etc.). I said I wanted the mac and cheese (not one of the options). This sent the entire restaurant into a tizzy. The waiter was flustered (and then told me my desire to talk to the manager was \"inappropriate\"), the chef got annoyed, the manager said no because the mac and cheese is $5 more expensive than fries. But in the end, when I said I would write a nasty review on Yelp, they came through. They took care of us. The manager gave us the mac and cheese, the waiter got nicer again, and I felt bad for having essentially engaged in blackmail. It all worked out. We had a nice dinner. Our burgers were good, and the mac and cheese, as always, was excellent. Now, if they would only stop serving soda in bottles and give free refills.....", "author": "David A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-15", "description": "Downgrading a little bit because the quality of their Monday night ten buck burger and beer special has really gone down since they started this.  It used to be a pint of draft brew, then a half pint, then it went to canned beer (I think it was schlitz or schaefer or another olde timey brand) but then they \"upgraded\" to Miller High Life (still in a can though).  I like change but I don't see how those were for the better (for anyone by the restaurant) Anyway I don't go for the beer, I go for the food!  However after my visit last Monday, I have to say I am disappointed.  The burger is definitely much smaller than it was before, I mean it's not like i weigh them or anything but I've eaten at least 5 burgers here over the past few months and last Monday's was definitely smaller than in the past. But my biggest complaint is that the bun is no longer that great bakery hard bun that soaks up the juices and doesn't fall apart.  It was like a soft supermarket bun, like an Arnold brand bun.  I hope this was a one time thing, they ran out of buns or the bakery burned down baking buns, or something, because that is REALLY disappointing.  I know it's 10 bucks for a burger and a beer, but what made this special so SPECIAL was the quality that went in to it and if they are going to downgrade to this degree (or even lower) what is to stop me from going to Five Guys down the block or Moo Burger (whenever that place opens?) for my burger fix??\n\nAnd then moving on to other things, I felt that the menu items in general either got more expensive or you got smaller portions.  I'm all about paying for quality but at the same time paying $7 for a small plate of just mixed greens seemed a little high.  And with entrees $20 and up, they should be enough to fill me up, I mean I'm not Paul Bunyan or anything but a meal should be a meal!  \n\nAs much as I like this place and want to see it succeed, it's not going to count on having my continued business if they keep downgrading the quality and upgrading the costs.", "author": "sasha y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-13", "description": "Amazing burger wonton apps. \nWorld class frites. I wanna get back there for.brunch.", "author": "fred c."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-03", "description": "The free range organic chicken was absolutely delicious, but the service was so terrible that it ruined the entire experience.  I have NEVER left no tip for a waiter, having waited tables myself and knowing that the wages are meager, but I couldn't see how leaving even a small tip was justifiable.\n\nWe arrived and two women with a lively sense of fun greeted us - good sign.  We then waited more than 20 minutes to even warrant a glance from one of the five servers who passed by.  Twenty minutes to get a glass of wine?  I was incensed, but my husband wanted to give them a chance.  Finally a silly waiter with an idiotic accent came by and happy talked as though we were getting on a carnival ride.  No apology, nothing.  Thankfully, the owner, one of the lively women, brought the drinks - first the beer, then 5 more minutes until the wine was delivered, and said it would be comped.  The next round we ordered included a beer that had not been chilled, with no explanation, and a glass of wine with half the amount of wine as the first glass.  Dinner was fine, and while I suppose that should warrant more than two stars, I consider dinner at 9:30 to be an evening out - with dinner as the main event.\n\nWhen the check arrived, the waiter made a point to tell us that the first round of drinks had been comped, so the bill was actually $20 higher.  WTF?!  He didn't bring the drinks, he crapped out on us for the entire evening, and he wants to make sure we tip on the full amount?  If there had been the slightest improvement in service, of course we would have.  \n\nGo here to get fed before your evening out, but DO NOT go here expecting a lovely evening.  \n\nWatty \u0026 Meg - get your act together!  There are over a hundred restaurants in a half mile radius from you; why would anyone come back to be treated this way?", "author": "L R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-09", "description": "So we've been wanting to try this place since moving into the neighborhood 3months ago... Well we tried it for brunch, but was quite disappointed. \n\nFood is OK, a bit overpriced. Unfortunately the service was mediocre... Waitress did not introduce herself, did not check in with us at all, and our drinks came after our meal arrived (after we asked about them).. \n\nThere are better places in the neighborhood for the price, and definitely better service.", "author": "Azi N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-29", "description": "The food is fine, but it has gone downhill. This restaurant is cash or Amex only, an annoying policy no matter what, but especially when you charge prices that are at the high end for the nabe. Tonight was our last night as customers. You can hit Strong Place or Karloff, pay any way you like, and have equally good food and drink. The owners should have realized that people would bail because of this.", "author": "Victoria C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-26", "description": "I want to desperately say it's really good, but it's not. \n\nThey're trying to do everything right,  nice decor - nice corner location, nice food but that's it, just \"nice\" not great. Gotta commend the host, he's great, really nice fellow. The waitstaff is ok - friendly enough but no pizazz. \n\nI had scallops appetizer. Scallop was cooked perfectly, the other entree was a calamari salad. This was pretty good - hard to get crispy calamari and have it stay crisp even on a bed of salad. The cold gazpacho soup, good. The side of collard greens too salty. Ordered a bottle of wine - saw a few couples who had a glass of wine and it was a good pour (we have to remember a PROPER pour of wine is not to the brim) if that's what you want order a bottle. That said, Watty and Meg have their pour down correctly. \n\nIf you have a baby it's really, really kid friendly, the night I went no less than four strollers on the sidewalk outside..could be the place to go for parents needing a night out.... (all very well behaved young (non-crying) babies I might add) \n\nAgain.. good not great. Is it worth trying out, yes.. they have average prices, decent food, decent service. But I can't figure out what they're trying to be. It seems to have an identity crisis. \n\nWould I go back? Sure, but not until I've tried a few other restaurants in the hood..", "author": "Angela G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-09", "description": "Came in for brunch on a Saturday. Got the duck hash (like corn beef hash, but made of duck). Was not as good as I expected, but still pretty good. There was a big duck egg, sunny side up (tasted more like chicken egg than I expected) and little strips of cured duck (maybe somewhere between bacon and proscuitto). But, I'm not usually a brunch guy (I like to make my own breakfast/lunch on the weekends), so I don't have a great basis for comparison. \n\nThe place presents itself as a classy joint. There were a lot of folks with babies in there, but they weren't intrusive because they were stashed (with their parents) in a back room.", "author": "Jason G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-10", "description": "I thought the food here was great, but most of it should have been priced about $3-4 lower. There were plenty of vegetarian options. I got the Bibb salad with feta, red onions, and almonds, which was excellent but not worth $11. The vegetable wellington was very creative and tasty, but again I don't think it should have been $18. My Manhattan was well made, but I'd skip the desserts--no one at the table was a fan of the espresso panna cotta and the mango pie we ordered. Overall, worth a splurge but the prices would prevent me from becoming a regular.", "author": "Jean C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-02", "description": "I'm not sure how Watty \u0026 Meg got mixed reviews on NY Mag and TimeOut--my friend and I had a really great, enjoyable dinner there last Wednesday night.  They accepted a last minute reservation, and the hostess was cute and witty on the phone.\n\nWe started the meal with a cheap Argentine cabernet--one of the best reds I've had in a while.  I ordered an heirloom tomato salad with cubed goat cheese, balsamic reduction, and savory.  It was good--I'll admit, the weather hasn't been great to tomatoes.  My friend ordered scallops with macadamia nuts and peas as her app, and it was delicious.  For an entree, I chose the mint pesto and pumpkin seed-stuffed chicken breast with succotash and pureed butternut squash.  It was also pretty delicious--interesting flavor combination and well-prepared.  We also ordered the serrano ham-wrapped pork loin, which was also nicely executed.  The bread pudding, topped with a light caramel sauce and bananas was a staid but enjoyable finish to the meal.\n\nThe decor, one of many throwbacks to simpler times and prohibition-era style, made dining in dim light a warm, enjoyable experience.  Seltzer bottles and spirits are framed in rich wood cabinets and molding.  Old school jazz meandered between contemporary trip hop and alternative--this place fits in the neighborhood.\n\nIt's a solid 7 out of 10 (I gave it 4 stars instead of 3 because we really had a great time there).  While we avoided what was poorly reviewed, this place is a decent, moderately-priced experience that people should experience at least once.", "author": "Matthew A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-27", "description": "Sidewalk cafe is nice, but overpriced for the quality of food and service.  Had a $16 fish tacos brunch.  Tacos were tiny, greasy, and lukewarm.  Should've gone somewhere else.", "author": "Olaf K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-26", "description": "A little slice of Manhattan polish in an otherwise down-home neighborhood--Watty and Meg stands out with it's sleek take on a Modern Parisian bistro with al fresca dining on a cozy corner of Court street. The decor is romantic and charming.\n\nDinner for two started off with a nice bottle of Gavi and two glasses that smelled like wet dog, which is not the best medium for enjoying wine, so they were quickly replaced by the waittress.\n\nAll-in-all the service was fine. Nothing to rave or complain about.  Casually attentive.\n\nThe food is where I knock off two stars.  I ordered the salmon tartare, a dish that can really shine, but unfortunately had little flavor and was undersalted.  I forget what my date ordered (because of aforementioned wine) but I can say that we both commented on how the appetizers were bland and underwhelming.\n\nWe shared a hangar steak for our entree, which was tasty and cooked to the correct temperature.  But come on.  If you can't make a steak then you should work in a diner. (fightin' words!) So they're not winning back any stars for the steak.\n\nI've worked in many restaurants in my day, so I'm not the most forgiving yelper.  If I'm going to a bonafide sit-down, cloth napkin restaurant, then I'm expecting the food to either be inventive and unique, or to just hit the spot, filling the least common denominator of being delicious and satisfying.\n\nWatty and Meg's food did neither.  Womp womp...\n\nNext.", "author": "Matt D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-09", "description": "Atmosphere in here is great and the burgers are not so bad if you don't mind paying a lot for it.  They only accept american express so if you don't have one be prepared to bring enough cash.  The burgers were the cheapest meal at 16 dollars.  I personally won't be going back because I can't afford it.", "author": "Natasha W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-07", "description": "2.5 Stars. Had a Pickled Martini that was amazing. Atmosphere is great. Servers great. Unfortunately, the food needs to be flawless at these prices. But the bun for the veggie burger was way too small and soft so everything just spilled out.  Was tasty but not as good as Houston's. The fries were good, but again, at these prices you better be doing some things with fries i've only dreamed about. If the prices came down 35 percent across the board, i'd leave happy, and tell others to go back. Surely you'd make the money back that way?", "author": "Sir M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-19", "description": "This is a phenomenal restaurant. I've had dinner here a few times.\nLocal and often organic produce (which are really important qualities for me in terms of what I eat). Seasonal dishes are all great, you HAVE to try the calamari, it's crazy.\n\nGreat service and atmosphere - beautiful interior that has been selected from recycled materials. Nice bar and restaurant set-up.", "author": "Chloe K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-12", "description": "Food was decent but service was horrible. Most items on menu were over $20 but the waiter (young guy) treated us as if we were at McDonalds. Walked up to table and said \"what do you want to order?\". Not even a hello or could I get you something to drink or let me tell you about specials. After we ordered we didn't see him again until time for check.  First and last time for us.", "author": "Kay L."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Watty \u0026 Meg", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "248 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YT5DS-hBfBN8Y-pPNWHjWg/ls.jpg", "@type": "Restaurant", "telephone": "+17186430007"}