{"aggregateRating": {"reviewCount": 255, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-26", "description": "Some things to note: AMEX or cash only.  No reservations for parties of 2.  Somewhat cramped quarters, and at times you may be rubbing elbows and other body parts with wiggly children.\n\nNow for the better news -- the food at W\u0026M is pretty darn good.  Depending on what you order, you can have an excellent meal.  The monkfish underwhelmed me one time, but the time after that, the hanger steak made up for it big time.  Nice wait staff, and the vibe is casual but clean and vaguely chic.\n\nFor the summer it's nice because you can sit outside or by the open front windows. \n\nI like Watty \u0026 Meg although the food is not consistently excellent; some things are much better than others.  My guess is that the trick is to try different things and figure out what they do well, and then order those things.  I do miss Carciofo's, which lived in that space for a long time, and was more homey, comfortable and gastronomically superior.  But, it's possible that Watty \u0026 Meg will grow and improve over time.  The locals seem to like the spot; I don't think they're going away any time soon.", "author": "Milod J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-21", "description": "Was I at a different restaurant?  We stopped in on a snowy night and ate at  the bar. I had the steak frites and a glass of Cabernet. Bartender was friendly, efficient and my meal came out quick and it was very good. Steak cooked to my specification, fresh greens, and the fries were not soggy at all. I enjoyed it. Maybe we hit it on a good night, but I will definitely be back next time we go to the movies across the street.", "author": "Meowella S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-08", "description": "Have eaten here twice now and both times the food was excellent. Very fresh tasting. The burger is easily one of the best in the neighborhood. My only complaint (albeit minor) would be the decor of the back room. Looks like it was a cheaply done add on and does not match the rest of the place.", "author": "Bkduc D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-17", "description": "I've only been here three times, but each time it was really consistent in terms of atmosphere, service, and food.  Never had to wait more than a few minutes for a table (that applied to both brunch and dinner).  The staff is friendly and prompt.  \n\nI was happy with the food I ordered each time, but nothing blew me away.  The pulled pork sandwich and fries are good, though the pork is on the bland side and could use a little help with the sauce.  I took my mom here and she absolutely loved the scallops.  My husband said the burger was a little dry and he wouldn't order it again (he's a huge burger fan).\n\nIt's a good place to take Mom and Dad when they're in town, and has an upscale homey vibe (similar to Buttermilk Channel but more tables and not as a loud).  A decent place, but nothing stand-out.  That being said, I live two blocks away and will be going back.", "author": "M M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-16", "description": "The Monday night special is slipping.  The waiter was extremely disappointed to hear we were ordering burgers.  He did not introduce himself.  He did not check on our table.  He did not ask about the food.  He did not say \"thank you.\" \n\nOur burgers came out before the beer...It only takes 5 minutes to serve a \"grass-fed\" burger... really?  What happened to the brioche buns?  I can make a burger with a Wonder bread bun at home.  \n\nMiller High Life...really?  It's not cute when you try to be trendy and look really cheap instead.  \n\nNo credit cards...really?  Cut out this pretentious practice.\n\nWorst dining experience in my neighborhood...hands down.", "author": "S H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-28", "description": "Perfect neighborhood place for a tasty meal in a comfortable \u0026 pleasant environment.  We ordered two sandwiches and both were great (grilled vegetable \u0026 skate wing).  Staff was also good \u0026 accommodating.  We'll be back!", "author": "Mark K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-12", "description": "Love it!!! I think this place may well be my new favorite neighborhood haunt. We went for brunch and I love how they bring complimentary biscuits with maple whipped butter. YUM! I ordered the pulled pork sandwich with fries which was delicious. My only point was that I'm not a fan of the brioche rolls with my pulled pork, as much prefer a good ol' kaiser but failing that, I can't grumble as the pork and sauce were both amazing. The staff were so attentive and sweet. I love this place. Yay, we have a WINNER!!!!!", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-13", "description": "Happened across Watty and Meg yesterday during walk around the neighborhood and could not have been more pleased! We ordered the perogies, the roasted chicken, and the duo of pork, and each one was as delicious as the next.  One thing I was truly impressed by, was that I found the sides (quinoa with the chicken) were every bit as good as the main dish.\n\nA few proverbial grains of salt: the tables are small and a bit crowded, which makes for a bit of bumping around with waiters, other patrons, etc. Also the cash-and-Amex-only policy is a bit of a drag--prices aren't low enough to assume that guests can pay with cash, and I don't have an Amex.\n\nAll in all, it was delicious and a very pleasant experience. Highly recommended, but be sure to have cash on hand!", "author": "Jenny H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-23", "description": "Honestly? Minus a star because they don't take freaking credit cards besides American Express. I'm fine with delis and bodegas not accepting  cards because they don't want to pay the fee since I can usually scrape together enough money to pay for my beer or my sandwich or whatever. But when a place charges between eighteen and twenty-four dollars for an entree obviously they can afford to pay the stupid credit card fee (and not make diners pay a fee for getting money out of an ATM from a bank they don't belong to). Not thrilled that my entree wound up being twenty bucks because I had to run to the bank next door to get cash. My meal (the vegetable Wellington) was delicious, though, and my companions enjoyed their meals as well, but I thought the food was a tad overpriced, especially considering I got dinged for not having cash on me.", "author": "Katie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-08", "description": "Very good food. Fun ambiance--classy without feeling too stuffy. Our waitress wasn't that friendly, but I'll overlook it since I was there catching up with an old friend. We sat there for 3 hours and I actually liked that she didn't keep popping over.\n\nI had the kale salad, which wasn't exactly what I was expecting. It had kale, quinoa and avocado, but it came in the bowl in 3 separate piles. It was good though. Then I had one of the specials, the lobster stuffed soft shell crab. Also quite good.\n\nFor dessert I had the espresso panna cotta, which was very rich and delicious. The whipped cream on top was amazing.\n\nThis place is a great neighborhood cafe, and perfect for a nice dinner without feeling like you have to get all dressed up.", "author": "T W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-07", "description": "This is a wonderful newer restaurant in the cobble hill area.  Truly a talented team in the kitchen. I highly recommend the Trout over brussels. The vegetable wellington and the Duo of beef. and three are cooked perfectly. The wait staff is hight knowledgeable of both the food and the wine menus. The apps are not my fav. part of these restaurant but the mains are spectacular. To close the meal they have a wonderful selection of dark beers and a full desert menu that is a real treat. \nI highly recommend this place.", "author": "noah m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-11", "description": "Big fans. We go here about once a week for dinner, and although it's a bit on the pricey side (once we've had two glasses of wine) we're never disappointed. The atmosphere is great and the food is usually quite good. Plus, we've never really had to wait, which is a plus.", "author": "James T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-20", "description": "The $10 Burger and a beer special on Monday is where it's at.  With that being said there are better places for burgers  (cough cough, Angus burger at Bonnie's Grill) and beer in the area for sure.  But when there is a two hour wait at Frankie's there was only a ten minute wait here...  A safe alternative when you're not feeling adventurous.", "author": "Evelyn I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-15", "description": "Excellent and understated.  I've eaten here five times and never had a bad dish.  Quiet and friendly, too.", "author": "Frank S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-31", "description": "Sorry...it would have been nice to have a good restaurant in this space (a couple of blocks from my house actually) but this isn't it.  The decor is cute (but not really all that cute---it looks like a slightly upscale beer bar) and the service was adequate but the food was not good at all, and expensive to boot.  Stay away especially from the hangar steak ($24) which was tough and bland and served with what appeared to be instant mashed potatoes and steamed broccoli hijacked from a school cafeteria somewhere nearby.   Sorry, but there are tons of great restaurants in the area so there's no good reason to go here.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-13", "description": "Went there for dinner last night and the food was very good.  Ate at the bar, lovely bottle of vino and while the service was a little awkward, new bartender first day - all in all was great experience and will return.", "author": "Laurie W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-23", "description": "Went there with friends last night. To start with the menu isn't great. This isn't American food .Why they call it American I have no idea . I wanted a salad . They were strange. So just got a burger . I asked for med / well . Well it was still mooing when I bit into it.The waitress was brain dead \u0026 unattentive. Best thing about the bad burger was they didn't charge me. I ate the mushy , overly salted fries.On the check it said kitchen error. If you want a great burger save money and go to Ulimate burger.Wish they had a 1/2 star. 1 star is way to generous .", "author": "Rob H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-16", "description": "I almost don't want to leave such a good review for this place because it is already becoming more and more crowded each week.  I only go on Monday nights for the incredible $10 burger and a beer special - which is great.  I don't even really like hamburgers, but I love, love the burgers at Watty and Meg.", "author": "Sharon R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "Food: solid/consistent\n\nAmbience: comfortable\n\nService: professional", "author": "X X."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-18", "description": "Pretentious, mediocre food and overpriced. Went on a Monday night for the $10 burger and beer. The burger tasted rubbery and not like a freshly broiled one. It came out in less than 10 minutes, which tells me that it must've been pre-cooked. The beer was flat.", "author": "Harry s."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Watty \u0026 Meg", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "248 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YT5DS-hBfBN8Y-pPNWHjWg/ls.jpg", "@type": "Restaurant", "telephone": "+17186430007"}