{"aggregateRating": {"reviewCount": 255, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-02", "description": "I come here for the $10 burger beer special on Monday nite. I sit at the bar with no fuss. It's a great burger with good fries and a can of high life. Happy for me.", "author": "Jeff D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-04", "description": "Had the chicken paillard salad.  The chicken was not freshly cooked and was so small I couldn't believe they charged $16 for it.  Coincidentally, I had the same dish at the Rockefeller skating rink restaurant yesterday and it was fantastic:  fresh, flavorful, and so generously portioned that I had to share it with my nephew.", "author": "Mary H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-20", "description": "While from the outside Watty \u0026 Meg seems to have the perfect ambiance, don't let the looks deceive.  The food which was once (think 3 years ago) actually top rate has fallen steeply and is unfortunately no longer worthy of distinction nor its prices.  While service is generally OK, its the lack of good food which garners its score.   As a long-time neighborhood resident, I walk at least weakly, but tend to continue along in search of places that delivery quality food at similar if not more compelling prices.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-08", "description": "I really, really, really wanted to love this place.  It's gorgeous yet inviting, it's open kind of late...and it's the closest restaurant to my apartment!  I wanted to like it so much that I went at least 5 times before resigning to the fact that I simply don't.\n\nEverything is just okay, except the cocktails which are really not good, and the Burger and a Beer special which is awesome and delicious.", "author": "Eve R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "What a great, cozy spot to have dinner (or lunch or brunch). The owner is so friendly, and we were waited on by multiple people and didn't want for anything. The food was delicious! Their menu caters to all sorts. My husband and I had the veggie burger, which was perfect and came with a large side of yummy fries. \n\nI honestly have no idea why this place only has three stars. We sat in the front of the restaurant, but they also have a huge room in the back where I'd love to have my birthday next year!\n\nKeep up the good work, Watty \u0026 Meg. We'll be back.", "author": "Lara G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-18", "description": "Perhaps we (my bf and I) were just unfortunate and had a bad experience last Saturday night, as judging by the other reviews, it WM seems to be a reasonably well liked spot. \n\nHowever, we wont be giving it another shot esp after our experience. Starting with the waitress, who as nice as she was, forgot to tell us of the specials. Fifteen minutes after ordering our entrees, we hear her rattling off some delicious sounding specials to the table beside us. She quickly rectified this by cancelling my order and replacing it with the fish special (which I really enjoyed). Then there was the calamari appetizer. Way wayy to salty. She took it back and replaced it 10 minutes later with a less (but still too much for us) salty dish. We decided let that one go. Then my BF's mushroom papardelle came, smelling delectable - until he tasted it. The mushrooms had not been cleaned well and twice, he got sand in his bite. Not fun. The dessert (espresso panna cotta) I really liked, not too sweet at all. They were very nice, apologizing and comping the pasta dish and a dessert which we shared....sadly, this was not enough for us to give it a second shot.", "author": "A M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-15", "description": "Food was meh, my girlfriend had the ribs which were ok but not even close to worth the money. Friend had the chicken which was really bland and overpriced. The burger was good but nothing jaw dropping. Basically overpriced, nice ambience and a surly waiter is how I remember the experience.", "author": "Mateo E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-22", "description": "Watty and Meg? More like Watty and REGZ. Their portion size relative to the price is laughable. The skirt steak, although delicious, looked like it was the other half of a \"shared\" plate when it arrived. Waitress - explain to me again why I can't substitute my French fries for the finger ling potatoes on the menu tonight? Oh, right you couldn't. Every restaurant in America allows you to substitute one potato side with another option, get with the program.\n\nMy $12 bourbon cocktail tasted like the bartender mixed his first cocktail ever. The proportions of ingredients were completely off.\n\nThey have vegetarian options which is nice to offer. But must every veggie option be smothered in cheese or butter with no other way to have it? \n\nOverall, food is good. But this place needs to make bigger portions, be more flexible with their customer's requests (in a day in age when people are more conscious/finicky about what they eat) and learn how to make better cocktails.\n\nI wanted to like this place and I think they could easily turn it around. Great atmosphere and good menu. But when you leave an expensive dinner STARVING it's not going to leave a positive impression and generate a return customer.", "author": "Jillian B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-06", "description": "I love this place--i've been here so many times and I can't believe i've yet to write a review.  I live in the neighborhood and as I said, I'm a repeat customer.  The atmosphere is charming, rustic and large--plenty of space in the front and the back.  Of course, that atmosphere is typical in BoCoCa, but hey, I like it.  Another reviewer mentioned the old Italian joint that was once here, and yeah, I remember that place. The nabe's changed for sure, but we could do a lot worse than W\u0026M.\n\nWhat I like most is that ts one of the few places in the 'hood that takes reservations on Opentable! I've always reserved, and even showed up late a few times and the hostesses \u0026 servers were always incredibly gracious (we're talkin 30 minutes late with a party of 5--most places would laugh us away).  There's a good mix of brunchy \u0026 lunchy foods, and plenty of vegetarian options as well.  It's a standard new-american brunch menu so don't expect anything exceedingly creative, but it is tasty and you'll always get a seat :)", "author": "Spike G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-11", "description": "I avoided Watty and Meg mostly because I found their name irksome, but I'm glad I got over that bizarre attitude because I've been twice now and the food has been great.  I particularly enjoyed the tuna tartare dish my wife had and she got their Mac and cheese which was good as well.  They also made a decent Irish coffee on request.  They have some nice sidewalk seating when the weather is nice, good place to sit and people watch on Court St. Recommended.", "author": "Lucas C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-29", "description": "I really hate to spread the word of one of NYC's most best deals but I will anyway because given the overpriced food of Watty and Meg (that no one seems to be impressed with) if people don't start flocking here for something I wouldn't be surprised if they eventually closed down. The deal: On Monday you get a burger, fries, and pint of beer (of which they only have two options) for $10. Yes a place that usually charges around $26 or so for their entrees will give you a beer (normally $5) and a burger and fries for $10! True if you want cheese, sauteed onions, bacon, or avocado they'll still charge you $1 per item but the deal is still too good to complain about. The burger was fresh and cooked correctly and the fries were also decent. Neither blew me away but for essentially $5 for a fresh burger and fries it was amazing. I probably wouldn't come here otherwise but for their Monday deal, sign me up!\n\nBy the way this place is gorgeous, the service was good, and they have plenty of room. During warm weather they also open up the restaurant and it feels like the whole place is outside. Unfortunately the only card they take is American Express so otherwise you'll have to bring cash (or use the ATM at the bank next door).\n\nUPDATE: Last time I came here for the deal mentioned above they changed the two pint options of beer to a single choice, a can of Miller High Life. They also changed cheese to $1.50 (higher for bacon). The shoestring fries were on point but my burger was very much overcooked. My \"medium\" burger was brown all the way through. Not that I would have sent it back but the server never checked in on me while I was eating. I take back my statement that this is one of NYC's \"best\" deals but it still is a very good deal.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-18", "description": "Had been there before and it was nice.  We went for brunch today and it was as if taking our order was the biggest bother in the world.  No smiles, no pleasant service, it was as if we were a bother.  Order not completely correct.   Food good, however the omelet special noted roasted heirloom tomatoes and it was grape tomatoes just heated with the omelet!  Good, but not what I ordered.  Was sadly disappointed.", "author": "J G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-12", "description": "I'm writing this in hopes that the owners of Watty \u0026 Meg will read it and make some changes, because I'd hate to see this place close. \n\nThis is a place we want to love because it has that inviting neo-Prohibition style interior and much of the menu is, in today's parlance \"locally sourced\" etc but...\n\nthe food is bland. And expensive!\n\nThe staff is good, with the exception of one robotic waitress we had on one occasion.\n\nPlease, please Watty\u0026Meg, give your menu an overhaul. We don't want to see you go!", "author": "inga m."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-07", "description": "We arrived at 5:00p on a Saturday and the front of the restaurant was dead. There was one two top seated and six employees working. We walked in and asked if they had a full bar (my husband felt like a martini) and the hostess said, \"but of course!\" and sat us. \n\nThen we waited. And waited. And waited. As two busboys, a hostess, a bartender, what I can only imagine is a sous chef and another random employee stood three feet from us at the bar, chattering away with each other. There was only one waiter and he was super busy with the other table. Rather than having some decent customer service skills, the hostess avoided eye contact even though she knew we wanted cocktails. After more than ten minutes, we agreed that we would get up in two minutes if no one came over. Finally the waiter did, but only offered us drinks. \n\nI won't even get into the fact that they have a \"full bar\" but nothing of normal interest. You'd like a gin martini? We don't have Bombay. Or Hendrick's. Only Brooklyn Gin (which is so floral, it's disgusting). Maker's Mark Manhattan? No, we don't carry Maker's. Sauvignon Blanc? How about sauv gris? COME ON. Random bar offerings that make zero sense and even though it was clear my husband didn't like the martini or the subsequent (tiny) Manhattan, they couldn't be bothered to comp his $8 (!) draft beer?\n\nThis two hour meal was terrible. One bus boy kept our water filled and looked very uncomfortable by the fact it was clear we weren't getting good service. I'm guessing his hands were tied and he couldn't offer to help.\n\nNo salt and pepper on the table or offered.\n\nMy crab cake starter was cold when it arrived. It had a nice sear but had clearly been sitting out for a while. $16 for a cold appetizer.\n\nMy husband's burger was tolerable. But for $20.50 (yes, you read that correctly), it should have been out of this world. He ordered it medium at the waiter's suggestion after telling him he liked his burgers pretty pink and it came out medium well. The fries were good though.\n\nMy mac and cheese ($9) was good but so hot I couldn't eat it for ten minutes. While I love the idea of the hot ramekin, in the end it made it more difficult to eat. \n\nWe didn't even both with dessert (+ of course I had to flag down our waiter to get the check).\n\nAmEx and cash only.\n\nI have no idea what the owners are thinking...an inflated staff that doesn't chip in, overpriced food and the strange menu and bar selections make me think they're trying a little too hard to pull one over on Cobble Hill. Lame.", "author": "Erin D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-11", "description": "Meh, meh and meh. Snooty place with a super obnoxiously long wait for coffees and a $14 omellete that looked like it came from Dukin' Donuts. Actually Dunkin' Donuts would have been better. Quicker and about $4 with less attitude. Fail.", "author": "Hank M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-17", "description": "Monday night's $10 burger and beer special cannot be beat. This place has great ambiance, friendly if occasionally slow service and attentive management. My boyfriend and I come here regularly for dinner and for weekend brunch, and we always like our food and have a good time. \n\nOn weekends, the specials seem to sell out immediately, so go early if you want to have fish or steak. And let's be real. You want to have fish or steak. I rarely go out to dinner for chicken, no matter how creatively cooked or garnished. \n\nFor brunch, I recommend the crabcake sandwich. It makes a regular appearance on the specials menu. \n\nBe warned, Watty and Meg take only cash or American Express, so preparation is required if you are like me and don't have an Amex and rarely have enough cash on your person to cover an entire meal with drinks.", "author": "Julia B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-06", "description": "Was really looking forward to this place, but it's just not that good.  Food is inconsistent, bland and overpriced.  It's definitely a nice looking place, and the great corner location lends itself to become a neighborhood fixture, but after a few tries it always seems off.  One time service was super slow, another time the hostess was quite rude, etc.\n\nI hope they can work out the kinks, because the area can really use the kind of neighborhood gastropub that this place seems to want to be.", "author": "derek v."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-26", "description": "Really? \n\nMy boyf and I have been meaning to go here for a while I I have to say I was pretty disapointed. I had the burger and he had the salmon. \n\nFor the burger all the extras were $2 so say if you wanted avocado, cheese and bacon (even though I dont eat bacon) your $12 burger would be a $18 burger.\n\nWhen I got my plate (with avocado) the food was luke warm and the fries were mushy.\n\nThe boyfs salmon was garnished with pumpkin seeds? I thought that was a weird pairing... But the quality of the salmon was good.\n\nThere were certinly a lot of people in the resturant, most sitting at the bar so maybe they were just drinking and didnt know how sub par the food is?\n\nAll in all I would say pass. There are so many other places in this hood that are so much better.", "author": "Risa G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-06", "description": "Pretty bad:\n\n1.  Overpriced-- 28 dollars for a chewy NY Strip Steak with mashed potatoes and onion rings.17 dollars for a plain hamburger.\n\n2. Small menu-- 2 poultry dishes, 3 beef, 3 fish, 3 vegetable.\n\n3. Boring, flavorless, and surprisingly cold food.\n\n4. They only accept American Express. \n\nI would give it two or even three stars if it was cheaper but the prices of the food are insane for the quality. The waiters dress and act like typical pretentious Brooklynite waiters, which would be perfectly fine if they worked nearby at Brucie's or Quercy. But instead, they serve the type of food you would find at an Applebee's. \n\nI'm not very picky and usually wowed by most decent restaurants I go to, but this place was terrible. Avoid at all costs.", "author": "Jackson U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-03", "description": "Went for lunch.  Gave this place 1 star because it looks nice, appears to be clean and what we ate tasted fine ... HOWEVER ... they served nearly nothing ... for a huge price tag ... We spent $35 including tax and tip ... we DID NOT DRINK ... and walked out HUNGRY.  We will not return.", "author": "Lynn M G."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Watty \u0026 Meg", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "248 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YT5DS-hBfBN8Y-pPNWHjWg/ls.jpg", "@type": "Restaurant", "telephone": "+17186430007"}