{"aggregateRating": {"reviewCount": 255, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-26", "description": "The little complimentary biscuits with maple butter and a bottle of Red Wagon IPA is enough for a five star in my opinion. But the fact that the waitress ignored my request for one more complimentary biscuit twice instead of just telling me she couldn't or they were out, or whatever costs them a star.", "author": "jay k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-19", "description": "a friend turned me on to this place recently. we ate there, and i had the pulled pork sandwich. t'was delicious! also got an ample amount of fries, cole slaw and pickles with it...all for 9 bucks! they omelettes are fluffy and yummy, too. friendly waiter, and cute place. will be back!", "author": "Ness C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-20", "description": "Glad to see that our experience will be consistent with others.  My fiancee and I go over there periodically  to Dharma so we were excited to check out the new place.  As there are so many places to check out, they in the end are evaluated on \"will we go back or not?\"  This one was unfortunatly the later.  In summary:\n     Decor - beautiful\n     Host - very nice \u0026 accomodating\n     Menu - sounded promising\n     Food - egh.  in this day when a restaurant is trying to attract customers with streched pocketbooks, W\u0026M has failed to meet the mark.  Portions were smaller than they need to be - put an extra slice of steak or two on the plate and perhaps customers wld be more satisfied.  The hanger steak was ok - nothing special\n     Wine List - very nice\n     Wine Pour - big glasses - pour looks small \u0026 we thought that they were; again an extra swig or two would sign better value\n     Staff - too many and anxious.  I loved the one waiter who was checking the table eating a big wad of something.  I thought he was chewing gum but when the chewing stopped realized it was actually food. Have to say that I was quite surprised.  dinner served with no replacement silver - had to ask.  and in the end, clearing the plates before we were thru.\n     $100 was too much $ to throw away for 2", "author": "Pamela K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-10", "description": "Cash or American Express ONLY???? No thanks.  I've had brunch here once and the food was fine, but definitely NOT worth walking to an ATM and paying a fee to take cash out.  I had forgotten about the cash/amex only thing and walked in with three friends the other night.  We had already started to pick out cocktails and food when we saw the sign and walked out on principle.  I live in this neighborhood and don't mind the cash only coffee and sandwich shops or even Lobo or Joya being cash only.  But a place like Watty and Meg?  Get real and accept credit cards.", "author": "R S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-15", "description": "If there were half stars, I'd give them 2.5 stars. Watty and Meg is the kind of place where it seems like they're very well intentioned, but things end up being boring. We went to brunch there a few months ago and my heuvos ranchero were mediocre, the black beans tasted like they were straight from a can. I also asked for no sour cream, but it was on my plate anyways. The orange juice, which was good, was $5 for a glass... wish I had known that before ordering it! There are nice about dining outside with your dog.", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-07", "description": "The food was fine.  The restaurant is beautiful.  However, the staff and attitude is baffling.   I wandered in after an afternoon with friends in the neighborhood - at 7 pm on a Saturday by myself (when the restaurant was empty) -  and the staff was strangely dismissive, snobby and confused.    I never did see the full dinner menu (as I learned later), and I needed to ask the bartenders, and waiters, and the other staff, for more water and a second glass of wine.  I was asked to move halfway through the appetizer, which would have never happened if I had not been alone.  I have never written a review of a restaurant online, but I do not need snotty behavior from a restaurant in Brooklyn.  I will never go back.  And I would not recommend it to my friends in the neighborhood.", "author": "Rebecca B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-05", "description": "the food and service at this reataurant were both above average.   had i based entirely on yelp reviews i would not have gone her, so, one time where i'm glad that i didn't rely upon yelp. we had a lovely dinner.  the trout with brussel sprouts was delicious.  the salad was not ab have been a little overpriced, but, not more than any other restaurant.  salads always strike me as overpriced considering they are primarily lettuce!", "author": "sarah b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-08", "description": "I have been planning to try it but was surprised at one of the staff cutting ahead of line at a local butcher shop.  Perhaps she was in a rush to meet customers' orders but a little courtesy to the people in line would have been nice.  I hope this is not indicative of the rest of the staff.", "author": "k s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-01", "description": "excellent food and PERFECTLY prepared, but the prices make me feel like Watty (or Meg) is trying to dig out of credit card debt. or signed a subprime mortgage.", "author": "Philip W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-09", "description": "I expected to like it more.... It's a lovely space and the staff was truly great, unfortunately the food is just so-so, nothing offensive, but still so-so. I think the main problem here is that the chef is afraid of flavors. Everything we tasted was a tad bland. The roast chicken looked delectable, but it desperately needed salt and pepper. The shrimp and grits came with a baby-food-like tomato sauce, which was improved by a splash of Tobasco. Even my dirty martini came to the table so \"clean\", I had to ask for more olive juice. \"Perhaps our taste buds are fried tonight\" - I thought, but then I heard the table next to us complaining about the lack of flavor in their lamb shanks and I knew I was not wrong. I think Watty \u0026 Meg could become something special, but only if the kitchen would open up to using more flavor, more spice, even more salt....", "author": "Taksa M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-19", "description": "came here for valentine's day.  the food was really good.  i don't know of any place in the neighborhood like it - maybe the grocery of saul on smith - but w\u0026m is in the same class in terms of quality and prices.  i give them three stars because the servers kept opening the door next to the bar in the back dining room, which made it incredibly drafty for diners.  i understand they're moving around and thus overheated. but i was freezing.  also i felt like a loser for asking them to shut the door...instead i put on my coat in a passive aggressive fashion and hoped they'd notice but they didn't.  wish they would just think of the diners before doing something dumbass like leaving the door open for hours on a winter night.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-04", "description": "Took some friends here for brunch last week. This was our first time at Watty \u0026 Meg. The food was very good indeed, and my rating might have been even higher if not for an unfortunate incident. About halfway through the meal the floor became covered with water. (The likely source may have been the radiator, but if the staff ever figured out what was causing it we weren't told.) The staff were very apologetic and tried to contain the mess by mopping (to little avail), but my friend's long skirt and backpack got very wet. When the check came, I had hoped that perhaps we (or my friend, at least) would be comped for our drinks, or given some other tangible form of compensation, but we weren't. I realize that accidents happen; sometimes these things are unavoidable and you just have to deal. But it would have been a gesture of good faith had we been compensated somewhat for the mess and the inconvenience that marred an otherwise good meal.", "author": "Miss M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-17", "description": "my husband and i just returned from our first visit here, for brunch. the menu itself was nothing remarkable- the standard brunch fare- eggs benedict \u0026 florentine, steak \u0026 eggs, smoked salmon sandwich, burger. etc. \nmy husband ordered the \"eggs benny\" and i the caesar salad, and cokes for both of us.\nthe friendly waitress brought us our two very flat cokes. i thought about mentioning the lack of fizz, but figured since they're so new, i'd be more generous.\nthe food came quickly, but we were really underwhelmed. the food was sub-standard for this neighborhood. both dishes were served VERY traditionally, with nothing new, interesting or impressive about the recipes or presentation.\nthe caesar was an exact replica of any of it's kind. the romaine was perfectly fresh, the (way too generous amount of) dressing seems like it came from a bottle of newman's own. same with the croutons. i thought maybe the grated parmesan would be the saving grace of the salad, but it didn't seem particularly fresh. other than being absolutely drowned in dressing, there was nothing wrong with the salad, but also nothing particularly right.\nmy husband reported that while the ham in the eggs benedict was quite nice, the eggs themselves were stone cold, and the english muffins were very stale. the new potatoes were fine, nothing interesting.\nin this stretch of carroll gardens/ cobble hill there are about 5-7 other places where you could have these same dishes, done much more inventively. if watty \u0026 meg want to compete in the neighborhood, they'll need to come up with a better menu and/ or serve it with some kind of pizazz.\nwhat they won't need to change are the quite pretty dining room, and friendly service.\nhopefully all of the problems above are being worked out, but i'm not sure i'll go back to find out.......", "author": "jessica l."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-18", "description": "An unfortunate letdown after months of hopeful waiting.  At first I thought the prices seemed very reasonable, only to discover that tiny portion size is how they keep the costs low.   My main dish really should have been described as a 'small plate'.  My garlic shrimp dinner entree was just 3 very small shrimp! (And without a hint of garlic flavor I might add.) Although they tried to offset this obvious gyp with a pound of grits.  I must admit the collards were very respectable though.  Our server was very sweet but completely clueless and overwhelmed.  The bread was underwhelming. I do hope they plan to do better in the near future, we could really use a decent new restaurant in the area.", "author": "j m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-18", "description": "It was a sultry night, and a friend and I were faminshed for food after seeing Julie Julia across the street at the Cobble Hill Theatre. All those cooked chickens, boeuf bourguignon, duck en croûte, and the heirloom tomato bruschetta made us think of one thing after exiting the theatre...MORE FOOD. We headed straight to our favorite French place, Quercy, but alas, like all French, they don't work so much in August and it was closed. Serendipity controlled though as we walked down the street and saw a happy group of eaters at Watty and Meg's at the corner of Court and Kane. We were seated outside at a small secluded table and I had a glass of Spanish sparkling wine with a delicious bowl of chilled carrot soup, perfect for this sultry night. My friend had scallops which tasted  fresh and sweet in a delicate sauce. For the main course my companion had trout stuffed with shrimp and chorizo which danced with flavors and was accompanied by spinach and chickpeas. The combination of chorizo and shrimp never fails to highlight a fish in my opinion. That trout might have been a small fish in a big pond when he was alive, but he was the main attraction at our table. My entre was roasted chicken, and how could I resist after seeing Julia cooking chickens for two hours, and this chicken breast had a slight smoky essence and was served with a polenta cake and succotash. All of that was enhanced with a  glass of sauvignon blanc. Oh, how could we stop now, we each had an espresso afterwards and called out to our lovely and informative waitress, Lexi, with a request to hear about the desserts. We decided on a berry cobbler and a key lime tart which was the end of a fantastic summer evening of loving food and life on the big screen, and at a little new place on a corner in Carroll Gardens Brooklyn.", "author": "Fred H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Watty \u0026 Meg", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "248 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YT5DS-hBfBN8Y-pPNWHjWg/ls.jpg", "@type": "Restaurant", "telephone": "+17186430007"}