{"aggregateRating": {"reviewCount": 255, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-09", "description": "I wanted to like the place because the decor is adorbale and they have Pimm's cup on the menu!!  I got the daily special of lobster and mushroom soup, it was basically cream of mushroom with a couple of ounces of lobster meat, good, but the description made it sound like something else.  Ordered a side of mashed potatoes since I felt like I had to order something else, I'm not food expert, but they looked and tasted exactly like instant mashed potatoes you get out of a paper packet.  The waitress was friendly and attentive, however the woman looked and acted like she was severely sleep-deprived-kinda kills the vibe!  I ordered the mint lemonade (cost me $6) and it was filled to the brim with ice, kind of a rip off!!  I dont think I would go back or recommend this place to anyone!! Way overpriced!", "author": "Olivia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-19", "description": "File under: A for Effort, but.\n\nI was actually pretty excited to try this place- it's very charming, with Paris-style outside seating and a warm, pleasant vibe inside.  The owner (I think) was hosting and seemed friendly and excited, and our waitress was equally sweet.  Sadly, while she was sweet, supremely competent couldn't be a description one would apply.  My girlfriend ordered a glass of wine, and she came out with the bottle and two glasses.  No big deal, but she was more or less equally confused the entire night.  Still, I'll take sweet and a bit out of it over the opposite. \n\nThe disappointment came with the food.  I ordered the Grilled Trout, which came out way dry.  Way dry.  Looked nice, but I most definitely grill trout better at my house, which is not a good sign.  We thought, oh well, her burger will surely make up for it.  It is after all named after the place.  How deeply sad we were when it turned out the burger itself was in 'meh' territory- not awful, but definitely nothing worth ordering again.  THe kicker was the fries- cardboard.  Beyond not great, approaching not even good.  Fries!  C'mon guys!  \n\nWe were actually really sad about the experience.  We want to love the place, and we'll give them one more chance in a month or two after they've hopefully improved, but as of now it's in the skip-it territory, and that's a shame.", "author": "B P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-03", "description": "Great atmosphere, bad food \n \nHanger steak was charred, chewy, and tasteless \nChicken was dry with a overly salty sauce on it\ncalamari with wasabi flavor..,I'm conflicted with this one..,\n\nOverpriced for what I got, would not go back for dinner", "author": "Amy N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-09", "description": "Just opened 5/8/09.  \nGreat waiter service/ staff. \nIntimate spot with the lighting, but still lots of customers in shirts and shorts, so it's not a stuffy crowd. Has outdoor seating up front. \nDoes not accept credit cards (at least for the first month--annoyed that no one mentioned it until we were paying our bill of +$100). \n\nThe menu sounds more adventurous but the food is in fact very traditional. \n\nStarted off with an appetizer of mussels-- good bunch, only 1 unopened. Lightly spiced with curry which was a nice touch-- but the bread (which is the best part to soak the sauce in) was hard as rock. \n\nI had the hanger steak with steamed broccoli and shrimp mashed potatoes. The shrimp mashed potatoes was what made me order the dish-- but it really just tasted like...mashed potatoes. Good one-- but not as fun as what I imagined. Hanger steak was cooked well with fried onion topping. \n\nEating date had the chicken-- with like pumpkin seed and pesto, and squash. White meat never tasted juicier-- but still, the menu outsold what came out. Very good chicken, but with all the fancy ingredients (forgot the list), it just tasted very okay. \n\nWatty and Meg is a simple traditional all-American restaurant. Food is good.  But the food wasnt anything spectacular to make me want to go back--like Buttermilk Channel or Char4. The elements that were supposed to make the dishes stand out...didnt.", "author": "Yvonne H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-18", "description": "I went last night and had a VERY enjoyable experience. The creator/owner/founder/manager (Socy I think her name is) is super sweet, as was the bartender that served us, LR. \n\nI just went for some vino pre-Lucali, but there are a bunch of reasons I will go back:\n\n1. Food:  Looked absolutely delicious. I was drooling and it took me a lot not to order. \n2. Vibe:  Real chill \n3. Menu:  Read it. The selections sound absolutely delicious. \n4. Wine List:  Minimal, but fucking good. And they use the larger wine glasses, which is the way to my damn heart. \n5. Staff:  Friendly, knowledgeable, and clearly spending time doing what they love.\n\nRe:  the drawbacks mentioned above, those are critiques that are common to almost any spot in Carroll Gardens. No bank machines within 10 feet? Actually there's a Chase a half-block away. And also, really? I don't think the proximity of bank machines is really useful criterion in evaluating a restaurant.\n\nI live in LES and would take the train/cab back to Watty and Meg.", "author": "seth h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-07", "description": "Maybe it was because we were celebrating but I thought our dinner here was spot on.  We split the olive oil salmon and the stuffed peppers with tamales and it was hard to decide which dish was better.  The fall flavors in the salmon (which normally isn't my favorite dish) were warming and the pepper dish was so scrumptious we practically licked the plate.  I've been dreaming of tamales since.\n\nAlso, the gogi tea was a good treat.", "author": "Becca F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-04", "description": "I went there on a Saturday night a couple weeks ago and the bartender was so rude. The drinks were weak and definitely not worth the price or bad attitude. There are so many better places in this neighborhood.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-21", "description": "I live in the neighborhood and eagerly watched the renovation of the restaurant taking shape- I really liked the way they were approaching the decor.  My boyfriend and I were anxious to give the place a try- but we saved our anniversary dinner for our first trip there, as we had seen the menu and knew the place was pricey.\n\nI agree with other reviewers above- I really don't get it.  We thought the menu was too limited.  There was some misstep or particular choice of sides that made virtually every entree not quite right.  We both settled on the steak frites because it was the only thing that really appealed to us.  The steak was really under seasoned and really tough.  The fries were passable but nothing special.  The waitress seemed stymied when I asked for salt and pepper, and eventually delivered a bowl of salt from the kitchen! \n\nThe decor does look good, but once we were inside- we felt cramped and right on top of the table next to us- and had a hard time having dinner conversation.  The service was weird- we had a waitress and a guy who was training, so he was shadowing her.  They both hovered constantly and stared at us- but when we actually needed something (like water refills) they had to be asked and took forever to deliver.\n\nWe considered having dessert, but absolutely nothing on the dessert menu was appetizing or interesting or original- and after the meal, we feared for what would arrive from the kitchen.  So, we skipped dessert and went to Sweet Melissa's down the street.\n\nIt seems insane to go to this place and pay over $20 per entree for substandard American bistro food when there are so many amazing restaurants in this neighborhood where you can get a delicious meal for $12.", "author": "David B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-27", "description": "We were looking forward to dining, but the maitre'd who said his name was Eric snapped at the woman who seated us and then made us move to another table. No apologies, no excuse me, just brusque and rude. We left without spending a dime...thank goodness!", "author": "Stan W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-15", "description": "Friendly and great food. Excellent choice after a movie.", "author": "Karen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-25", "description": "a little late with this, but Valentine's Day at W\u0026M was just terrific. They didn't overbook, the service was friendly but professional, the food was hallucinogenic. had not  been before but  will certainly be back.", "author": "John A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-18", "description": "Very classy renovation.   My beet salad rocked, the food was reasonably priced, entrees were tasty and the servers were nice.  Very relaxed spot.  And, the bar is long in case you want to meet a friend for a drink there.\n\nOnly knock is that my server was a bit of a space cadet so we had to flag her a few times  -- but i wasn't in a rush so not a big deal.", "author": "Jason H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-13", "description": "There's probably no place in the neighborhood where the divide between price and quality is so great. I've been there a few times over the years and never been impressed in any sense. Had a terribly bland meal last night. The burger, which was once decent, was totally overcooked, dry and grainy.  The chicken was bland all the way through, although the stuffing it came with was good.\n\nThe service is hands-off, which I don't mind.", "author": "Justin D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-21", "description": "Been a regular for a while now and the food is great, no question.  Downside is staff becoming more and more irritating.  Staff need to get over themselves though, don't come to hear how awesome you are.", "author": "Tracy R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-15", "description": "Was expecting better food and it didn't live up. They do have a beer and burger special for $10 dollars on Mondays, but everything is extra to put on the burger.", "author": "Mark G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-01", "description": "You know, I had a really good meal here. The service was very good, the wine was good, and the food was good too. It did royally piss off my mother-in-law when she attempted to pay with a visa and the waiter curtly said \"american express only\". WTF? Seriously, that policy needs to change because I really like the ambiance of this place and it's a good size, considering a lot of the restaurants are dirty little shoe boxes. Anyways, it was a bit overpriced, but it was perfect for dinner with the in-laws.", "author": "Teresa F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-14", "description": "The food was good. We had the asparagus, gazpacho, burger, and ravioli. The gazpacho was questionable given their \"locavore\" position and the time of year, but it was tasty. The burger was cooked medium rare as ordered. The trout ravioli with beet puree was unusual and worked well. The asparagus was a bit odd in that it was served topped with a duck egg, but the dish was cold - it caused the egg to taste congealed. Overall the food was good; prices were a little high but not out of line for the area.\n\nThe service was poor, very inconsistent throughout the meal, giving the distinct impression of a lack of training. We ordered bottled water as soon as we sat down; our tap water glasses were taken away, then nothing. We finally had to flag down a server after 10 minutes and ask after the water. The server then returned twice in 5 minutes while we were still discussing what to order; it felt distinctly as if we were being rushed. I managed to order one glass of wine, but when the glass was empty, it sat on the table through two more courses without the server asking if I'd like another. The server also hasn't learned a very basic rule - you don't clear plates while one person at the table is still eating. Maybe they don't have enough plates. Lastly, we ordered dessert and coffee. The dessert arrived fairly quickly. We could see our prepared coffees sitting on the bar waiting to be served, but they sat there throughout dessert until they were finally brought over, cold, once the dessert plate had been cleared. We then had to flag down another server to get sugar, as ours had disappeared. The most amusing part for me was when we were finally brought the sugar service - for two people, there were two sugar packets. We just laughed at that point.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-24", "description": "This joint is wildly overrated. Nothing was amiss, but nothing justified the visit or the price, either. Call it Cobble Hill complacent: a series of dishes--and even the hot chocolate--don't merit more than passing notice. Still, the menu holds appeal and maybe we'll have the courage and cash to toss out on the vague hope there's more here on a return visit.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-07", "description": "This place looks great, both inside and out.  Great ambiance inside, and a cute corner sidewalk bar.  But looks can be deceiving.  High-priced mediocre food with shoddy service.  Stay away.", "author": "Renée J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-16", "description": "we went out of our way to come back and were extremely disappointed. Got the rib eye steak ($32) and it was thin and full of gristle. After we told our waiter we expected the manager to come over to talk to us but didn't. They never made any accommodations to us. Don/t think we will coming back again.", "author": "Basil K."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Watty \u0026 Meg", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "248 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YT5DS-hBfBN8Y-pPNWHjWg/ls.jpg", "@type": "Restaurant", "telephone": "+17186430007"}