{"aggregateRating": {"reviewCount": 255, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-16", "description": "I've been instinctively avoiding Watty \u0026 Meg ever since we moved to Brooklyn Heights.  Yes, the outdoor seating was attractive.  But it seemed obvious to me that the food would be mediocre - it looked like the kind of place people go to because it's well located and can feed even the pickiest members of your party without too much hassle. \n\nBut the weather was too nice to say no to a sidewalk table this weekend, and we were too hungry to go elsewhere, so we succumbed.  Alas, my sense of the food was right.  The menu offered up a strange mash-up of international favorites (pirogi and tuna tartare: why not?), none of it especially well executed.  The wine list is shallow and expensive.  Fries were little sticks of oil.\n\nHaving said all of that, if what you want is a very nice place to sit on Court Street with friendly service and a decent enough cocktail list (and a place that isn't as loud as Clover Club, which is a real cocktail bar), Watty \u0026 Meg might be the answer.   It's fine.", "author": "Raffi M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-21", "description": "This place gets 3 stars because, although the food is 4-star worthy, the service is actually that bad!!! We had 2 different waitresses take our orders, the entrees came out while we were still eating appetizers, and we had to ask more than once for things like napkins and \"what's in the gazpacho, we like it.\"\n\nThe duck hash was pretty good, but was a little sweet, which I found odd. I wanted to add some hot sauce, but I didn't feel like dealing with the waitress. Huevos Rancheros were pretty solid, and the gazpacho with crab meat was great. Also loved the biscuits that they bring you.\n\nAlso on special - a drink called the Farmer 75, made with organic gin. Excellent. Now if only they would re-train their staff...", "author": "Heather M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-20", "description": "My fiancé and I had been to Watty and Meg a couple of times and really liked the meals, service and ambiance.  After looking at a couple of other places (we considered Grocery, which would have also been awesome but would have been too small for our party), we held our wedding reception in the back room and we had an awesome time.  We planned about 23 people, ended up with about 27 which worked out fine.  W\u0026M were completely flexible.  We worked with the manager to choose the menu, pick some wines and figure out seating.  The entire experience was perfect; my mom, who is totally unbiased about these things, said it was the best wedding celebration she's attended.\n\nDownsides: none. We've been there many times since, and although the chef has changed, the quality of the meals, service and wine are just as good.  Although it's on the higher-end side of my favorite local places, it remains very comfortable and is always a good time.  5 stars!", "author": "Timothy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-14", "description": "Burger and beer on a Monday night is unbeatable \n\nSome apps are good others are just avg such as the caesar salad\n\nHad the salmon last time in and it was very good special. \n\nWait staff Is uber friendly.  Wine list is mucho solid \n\nJust try it for brunch or Monday night and you will not be disappointed", "author": "Linda C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-17", "description": "I was honestly  very disappointed with this place.  The food is nowhere near the quality it should be for the prices they charge and comparing it to all the other spots in the neighborhood this one is the worst.  The alcoholic drinks are top dollar and not made well.  Save your money for pretty much any other spot on court street or smith street.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-08", "description": "As my time in the neighborhood is coming to a close, I was excited to FINALLY get a chance to eat here.  Comfortable, relaxing decor. Thoughtful drink list.  Food sounded awesome.  This really looked like a place that, if I had more time in the 'hood, I'd be showing up regularly for dinner and a drink. \n\nMy run-down: \n\nFood/Drinks - \nOmlette of the day -- wild mushrooms and feta, with a salad on the side. Everything was fresh, flavorful and delicious. Perfect amount of food.  \n\nHad a virgin bloody -- and I love a good bloody, virgin or alcoholic. This was a GOOD bloody. Again -- fresh, with a great kick of spice. \n\nPrices - \nI get we're in a pricey neighborhood, but 10-plus (I really hope I am just imagining those prices, and the sign really said 7 bucks or something) dollars for Lobster Bisque or a Gazspacho? And they're only appetizer portions, according to the bartender? I'll pass. I get what they're going for and I love it, but you need to follow through with something truly outrageous to charge prices like that in a little cozy neighborhood place.  I think the prices are just a tad past the tipping point of being too high.\n\nService:\nIt was good. Not great, not outstanding, just good. It was a slow lunch, and the staff was for the most part very attentive and accomodating. \n\n\nThe drawback -- and to me, its kind of a big one, if only for the inconvenience factor: \n\nUpon finishing my lunch, credit card ready to be swiped, I was told that they either took AMEX or Cash-Only.  What?! The reason I carry my little Chase Visa Debit/Credit Card with me is that so I can have a nice relaxing lunch and leave at the end without issue. It's 2011, no one carries around wads of cash a la world before the debit/credit card.  \nThis is actually the 3rd time I've encountered this in the neighborhood, so I should have been prepared, but I was giving them the benefit of the doubt that they'd be cool enough to not be all into the cash only b.s. that I've found at a few other places.  \n\nSo I had to get up, hit the ATM next door (hooray! it's not a Chase ATM! $2 withdrawal fee!), come back and pay my tab. Which wouldn't be a big thing, but today, I realized that this whole cash only or AMEX only thing is completely obnoxious.  I was happy, relaxed and ready to get on with my day and then you tell me I can swipe my plastic ONLY if its AMEX? \n\nI get that its a small business, credit cards are ridiculously expensive and all of that but... something is totally lost when you're ready to relax, not think about what you're spending for the moment while you enjoy a great meal, and then have to either hit up the ATM before or after your food. \n\nSO anyway, Watty and Meg -- I wanted to love you because I thought you would be everything I love in a restaurant -- warm, cozy and inviting with a thoughtful menu and delicious food -- but between the ATM thing and the slightly higher than get-what-you-pay-for prices, I can find somewhere else to eat, drink, and swipe my credit card stress-free.", "author": "Sara G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-01", "description": "Meh.\n\nNice atmosphere, polite Maître d', friendly service etc., but small portions, and we left hungry.\n\nCash and AmEx is always annoying.  You've raised your prices enough to cover the 3% - Note, not including fries with the $16 burger; A 6-8oz Skirt Steak for $21?\n\nI'm glad you're busy, but I recommend taking a walk down to Henry Street,  to Bocca Lupo, where the food is superior, they keep prices at $17 for the most expensive dishes, and have cute girls to boot!\n\nI miss the cute Harvard bound DJ!", "author": "Kimi R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-24", "description": "Brunch in Brooklyn at Watty and Meg.  First off, this spot is a class act.  Real adult service here with a mature hostess and spot on attention.  Sitting outside is always a plus in alfresco weather.  \n\nI ordered the huevos rancheros for $13 bangers which were cooked as ordered(eggs well) and everything on the plate tasted very fresh.  Chipotle sauce was brought over as requested. \n\nThe interior of this place is beautifully and tastfully renovated with lots of wood and tin ceilings. Other dishes spied looked luscious.", "author": "Franny A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-10", "description": "I'm not usually a complainer...but there were a couple of things I found to be ridiculous. 1st issue:  there was no draft beer available.  Apparently their CO2 feed was broken or something.  It's Saturday night in Brooklyn.  Fix it. \n\n2nd issue:  my friend doesn't like mustard greens.  They're bitter, and she's not a fan.  They come with the roast chicken, and are also on the menu as a side for $6.  Also listed as a side for $6 is the cauliflower puree.  Why, then, was she not allowed to substitute the puree for the mustard greens?  The world may never know.  Maybe it didn't flow with the chef's vision for the dish...  Overall, I just wasn't that impressed for the price we paid.", "author": "E H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-13", "description": "Went for brunch, and food deserves 4-5 stars. Huevos Rancheros was huge and delicious, and tuna burger special was good too. Cute space, that's larger then it appears. Service was incredibly slow, hence the 3 stars. Took 15 min to flag down waitress to get a refill on coffee (we should even have to ask!) and another 15 to get check.", "author": "Maura T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-14", "description": "Been here for brunch and dinner. I enjoyed both meals. Had the Charcuterie, cheese plate, the bib salad, halibut special and french fries. Enjoyed everything! \nthe server was confused about how we wanted the food brought out, but it was OK. \nThe only thing that was alil cheesy was when we asked for more bread to finish our cheese and meats they only brought us 5 small pieces?? Really do u have to be so cheap. \nAnd only cash or AMEX.", "author": "Olena P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-26", "description": "Too bad - looks cute but waiter was rude. Not my style! I prefer friendly people and more inventive food.", "author": "Carlin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-02", "description": "This has gotten really expensive for what it is.  It used to be a great neighborhood place, but now it's so expensive, that it's not a great place to just pop in on a weeknight.  Their beer and burger special is great.  They've always been nice to the kids.  They love their fries and mac and cheese.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-18", "description": "I liked our brunch food a lot, but I want to eat it somewhere else next time, and pay less for it.\n\nWe shared the quinoa/guacamole/kale salad as a table starter, and I'm glad we did because it was delicious but SMALL, especially for $14. If I'd ordered that as my main course, I'd have been very sad. And hungry.\n\nMy entree was the smoked salmon/brussels sprout hash, which was DELIGHTFUL. My fiancee had the BLT which was also quite tasty. Other dishes were pretty meh, but not bad. \n\nSo why only 2 stars? Well, you'd have thought the staff was paying US, given their attitude. No one cared that we needed menus, or to take our order promptly, or to refill our coffee (even when requested) or refill our creamer (even when requested). Water refills were easy to come by - I guess the busboy is the only one who got any training here.\n\nIn retrospect, I guess we should have known better since at noon on a Sunday there were more empty tables than full ones. I understand why now.", "author": "Roger G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-21", "description": "Excellent omelette and fries are perfect. Service is super slow though.... somewhat frustrating", "author": "Kelly F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-03", "description": "Below average service and food for the high prices and deceptively inviting atmosphere. This restaurant could be so much better if it seemed like anyone was making an effort there. The bartender wasn't sure what the two beers were on tap and rather than find out she just got cagey and tried bluffying. The hostess seemed like she was fifteen years old and plucked from a suburban Steak and Ale.", "author": "Myrna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-22", "description": "This restaurant lives up to the hype.\nI live in the neighborhood and somehow had put off trying this place out for the last two years. I finally walked over for lunch one day during the beautiful weather this week. Sat outside, had a glass of cava, and a lobster roll that rivals any I've had in Manhattan at Ditch Plains, City Lobster, or Oceana. Great service, generous servings. Maybe it's just a lunch thing, but my lunch including glass of booze did not seem overpriced at all.", "author": "Alexandra F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-15", "description": "Over priced nice place in the neighborhood.\n\nMy husband and I went and ordered one appetizer, 2 main courses and finished off with desert for around $120 (including 3 glasses of wine).\n\nWe have not been back because honestly there is nothing that sucks you back. There are cheaper and better options in the Cobble Hill area.", "author": "Sera A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-26", "description": "I've only been here for burger night, which is Monday. You get a burger, beer and fries for $10. They accept cash and AMEX only, but the burger is delicious.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-04", "description": "Great spot.  We went there Saturday night for dinner  for probably the fifth time.  The first time I was not sure about it but the food was great and the ambiance is excellent.  They have a nice bar (somewhat small however) with a good drink selection.  My wife started with the quinoa kale and avocado salad which she loved.  Was tempted to go into the kitchen and find out the ingredients for the dressing,  I had the cheeseburger wontons....awesome.  Very simple but so good. She had a nightly special which was solid and I had the chicken, which was simple but very tasty, not dry, with great flavor. \n\nAll in all Watty \u0026 Meg is a great spot for dinner.  Good music, very friendly service, and  a wide selection of foods to choose from.  I recommend a reservation.", "author": "MC M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Watty \u0026 Meg", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "248 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YT5DS-hBfBN8Y-pPNWHjWg/ls.jpg", "@type": "Restaurant", "telephone": "+17186430007"}