{"aggregateRating": {"reviewCount": 255, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-08", "description": "You know how you always pass a spot and say I gotta try that place soon. Well after passing this spot possible a little over 100 times I finally decided to try it. \n\nI went with a friend and we decided to share an app and dinner. We were trying to be good mainly because  of the things we wanted were probably the not the best.....but they were sooooo good. We got the cheeseburger wontons w/ truffle ketchup... that was definitely yummy. A cheeseburger is probably one of the best meals ever (when done right) but then you wonton it up...genius! It made us feel like we being smart about portion control... trust me, sometimes a white lie to self is needed. Lol. \n\nFor the entree we shared the deep fried short ribs and garden  greens. So a salad is a salad... green and healthy. Good. However, short ribs...and fried short ribs at that is all a mess. A yummy good mess! I love a good piece of beef, but then you fry it and have this white bbq sauce that's different but still good. We were definitely happy campers. \n\nI'll be back again... to share that same meal...or brunch!", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-23", "description": "How such place can survive at one of the best locations in Brooklyn. What you see on their website is not at all what you get. We ordered home made pasta with mushrooms, and got ravioli, and waiter told us it is pasta:) \n Tuna tartar was dry and tasteless, stake was also total disappointment. \nIt was our second but last run to this place.", "author": "Angela L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-25", "description": "All deconstructed salad lovers, come hither. Brunching at this place was a great experience. The ambiance was nice for a brunch vibe, and the service was good, too. Now for this salad. I got the kale, quinoa and avocado salad expecting it to be all mixed together. Instead, it came deconstructed, which was cool as I enjoy eating foods where I can craft the perfect bite each time. The toast and jam was also VERY good. It was multi-grain, hearty, and tasty. I enjoyed this place and will be back!", "author": "Nicole C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-18", "description": "I'm trying to be vegan and was drawn here by the Kale and Quinoa salad for brunch. It did not disappoint. The guacamole and mango were a perfect flavor addition to the salad and the presentation was pretty. Service was attentive and ambiance was pretty (I loved the wooden shelves behind the bar). There is a back room with extra seating.", "author": "Aly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-20", "description": "Cute decor, nice ambiance, beautiful building. Food was very good not great. Waiter not great. He seemed over it and it was not busy for 7pm on a Saturday so unsure of issue. Dark black hair little pudgy. Could have been little more enthusiastic. Fries were excellent, so was salmon. Enjoyed the bread pudding.", "author": "Sonja S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-19", "description": "Meh, I popped in here out of curiosity since the outdoor seating looks so inviting. It was a super letdown. I think I ordered their version of the BLT + fries? that came out to a total of $18-20 w tax and tip. I can't even remember if I ordered fries! That's how unmemorable that meal was. Glad I tried it though. My curiosity will never have to wonder now, haha", "author": "Bonnie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-07", "description": "Came here for brunch on a Sunday Pretty cool looking place, The service was pretty normal and prompt. I started off with a cocktail I was recommended The Brooklyn Revival which was alright we then proceeded to place our order, We ordered the Smoked salmon Special, The Pineland Farms Organic Grass Fed Burger, and the Mac \u0026 Cheese. The presentation of the food was nicely put together and food tasted pretty good overall everything was a bit pricey considering the food was mediocre.", "author": "Vanessa O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-27", "description": "Overpriced, with food that is good but not great. Not worth it with all the other food options in the hood.  Too bad because they have nice cafe seating when it's warm out.", "author": "Eric O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "Holy crap this was one of the best meals of my life. \n\nMy friend and I split short ribs, kale and quinoa salad \u0026 truffle French fries. Holy moly the whole thing was amazing. Ribs were extremely tender \u0026 so tasty with the chipotle sauce. The salad was unexpectedly delicious with the light vinaigrette dressing \u0026 the French fries were incredible as expected. \n\nCan't wait to come back and try more things!", "author": "Naomi Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-04", "description": "First time here and was impressed with the food! I had the fish special and it was really flavorful and delicious. My friends sweet potato soup also had a ton of flavor. I do wish they had a few more menu items but Also gives them the chance to give each dish more attention with a smaller menu. Very cozy atmosphere..and our waiter was attentive although kept getting a vibe that he didn't really want to be there, but alas I still enjoyed myself!", "author": "Amanda G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-26", "description": "I'm so sad about my latest experiences with Watty \u0026 Meg.  They have some really delicious dishes but they are so inconsistent.  If it's a slow night they are really nice and accommodating but other nights the people who were so nice are suddenly aloof and act like they are afraid to be friendly or helpful.  Your favorite dish might suddenly be struck from the menu (including the drink that you thought was so delicious) they will accept your order but deliver something that only slightly resembles your order.  It is like they are constantly under new management (they aren't) Who is the nut-job that runs the place????", "author": "Don S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-22", "description": "Horrible service!\nWe came with a 1 month old baby.  The hostess seemed annoyed when we wanted to keep stroller next to our outdoor table, so we waited for a different table with more room    After sitting, it seemed like she purposely ignored us.  We were not given menus or water, yet another party that arrived 15 minutes later was immediately given menus, water, and order was taken.   We had to ask twice for menus and water.  We also had to ask to order.  \nFood was fine, but we will never return due to the terrible service.", "author": "Ann B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Great restaurant in Cobble Hill with delicious options for meat-lovers and vegetarians.\nThe Mac and Cheese, Wontons and Veggie Burger are the best.\n\nThe ambiance and staff are awesome!", "author": "Julio C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-03", "description": "Got food poisoning from the quinoa. Absolutely unacceptable. \n\nDefinitely don't waste your time or money.", "author": "Molly H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "Visited there Saturday night. Very nice ambiance. I ordered the burger wonton for the starter, very nice! My entree was the chicken with pancake also amazing. The service is great. They gave just right amount of attention.", "author": "Marina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-27", "description": "I've been coming here for about two or three years now, I think. It's a nice little spot with great servers and good food. They don't always make my drinks right but it's ok cause I like the staff, atmosphere, and food so I can overlook the drinks (that's not to say their drinks aren't good though). They've always seemed more than happy to accommodate if you're not happy with the drink.", "author": "Soomé U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-21", "description": "The space here is warm and inviting, but the food is just ok - except for the watercress-apple salad which was amazing.  Ordered the short ribs, calamari and cheeseburger wontons. Probably better with dipping sauce though the wontons were offered with truffle oil ketchup which was tasty.  The veggie burger was ok, topped it with avocado and gruyere cheese.", "author": "Gloria G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Had an amazing afternoon brunch date with my girlfriend, my mom and her full grown German Shepard. We were very well accommodated and seated outside as there was enough room for all of us and our dog was always offered water! All of the food was spectacular. We had salmon toast and the tuna tartare as our appetizers which were amazingly seasoned and presented. For entrees we had the avocado omelette (classic), huevos rancheros (balanced and well proportioned) and their grass-fed burger with bleu cheese, bacon and truffle fries! The burger was the star! Fresh toasted  bun, thick perfectly cooked patty and honestly some of the best truffle fries I've ever had. Also the servers were cool and attentive. Perfect little gem for a calm afternoon meal.", "author": "Lawrence S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-06", "description": "We live nearby and used to come to Watty and Megs most Mondays for the burger night. Sometimes we'd eat in, sometimes we'd take out. Over time, we've invited lots of friends in too and that was our go-to spot. We were disappointed to find out one day that they had discontinued the Burger Night offer on take-out burgers. As a family with young children, sometimes there is no way that we can eat out so take-away becomes a necessity. To do so at Watty and Megs, we would have to pay double the price to get a take-out burger and beer ($28 or so) than it would cost to eat in ($14 with the offer). A very bad decision by the management to discontinue this offer for take0out food. As a result, they have lost us as patrons and the dozens of friends we have brought there over the year.", "author": "David C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "So we were actually headed to another spot when my boyfriend said let's give this place a try. \nWe usually don't go to places with less than 4 stars but I'm happy we did.\n\nWe walked in and was greeted and immediately seated. \nThe menu size was good not too much and not too little.\n \nWe ordered the Pancakes , Avocado Omelette  and Extra side of bacon and Truffle fries.\n\nThey offered Brunch cocktails...  I had the Rum drink... something with the word \"Storm\" in the name.  I wasn't impressed but didn't send it back. And  to my surprise our waitress brought me another drink that delicious and sweet on the house. \nMy boyfriend had the Whiskey Spiked Apple Cider and said it wasn't anything to write home about.\n\nThe food arrived and it was pretty much average... the star of brunch  was the Bacon and Pancakes.. which was yummy.\n\nBut the REASON FOR THIS OVERALL GOOD RATING was because of the  stelar service from our waitress Rashida. She was attentive , friendly and nice. Good service can make So-so food and drinks go down smoothly. \n\nI may not rant and rave over the cuisine but I would come back if I were in the area again.", "author": "H B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Watty \u0026 Meg", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "248 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YT5DS-hBfBN8Y-pPNWHjWg/ls.jpg", "@type": "Restaurant", "telephone": "+17186430007"}