{"aggregateRating": {"reviewCount": 255, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "Great spot for a weekend brunch. Super friendly staff and the mimosas were amazing. It's hard to find a brunch place where you don't feel like they're rushing you from your table but Watty \u0026 Meg were great - we were able to really relax and enjoy our brunch. Great space for big groups in the back and there's also outside seating if you're in a smaller group and want some sunshine. Try the Brussels sprout Okonomiyaki- it's delicious", "author": "Veronica N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-28", "description": "The place is amazing! It's so cozy and cute! Food was so delicious and service is outstanding. Also, their prices are very reasonable. I would definitely be back!", "author": "Yulia O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-06", "description": "Asked for a med-rare burger but got a well done burger. Food looked nice but tasted just okay. Decor and atmosphere is good.", "author": "Malinda L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-16", "description": "I liked the concept, but it was all a little bland really. None of the food that the table ordered  really wowed anyone, and there was not a lot of flavour coming out of the any of the dishes. As a group of four we covered most of the menu, and it was only really the desserts that got a positive response - though even then these were more on the sweet side than we would have liked. \n\nThe drink menu made up some of the ground, some very unique and interesting cocktail choices (the 24 Karat is a good example!) that were well mixed and tasted great, though were expensive for what they were. \n\nThe service was also a little mixed. We had several different servers taking orders and bringing items; this isn't an approach that I take issue with, though it wasn't well coordinated - there were times when we were interrupted several times with the same question and others where we struggled to attract attention to order more.\n\nIn general the experience didn't provide much value.", "author": "Gavin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Been going here for a few years - its old reliable. Great comfort food on a chilly night!", "author": "B K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-16", "description": "Just had the halibut special. Out of the world. Great neighborhood restaurant in Brooklyn", "author": "Daniel R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-05", "description": "We had two lovely meals here on a recent visit to Brooklyn. The service is warm and friendly and I loved the ambiance. The food isn't spectacular and it's pricey but overall - we enjoyed our experience both times. The fries are very tasty and the veggie burger is pretty solid too.", "author": "Katie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-29", "description": "I really liked our waiter - friendly, funny, accommodating. And the burger was solid. And they subbed out fries for salad.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "Had my bridal shower here and the staff and management were beyond accommodating and sweet! Perfect place to hold 30 people! The whole time we wanted for nothing! They were constantly replacing drinks and refilling water not to mention a killer brunch menu! Definitely recommend the huevos, mac n cheese, and avocado omelet! I've also been there for dinner and their burger is one of my favorite in the neighborhood!", "author": "Margot S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-13", "description": "This place is a pretty good bet for a weeknight. Pretty good chance you'll easily be seated/food quality ratio. A neighborhood staple because what they do they do well.", "author": "Peter W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-29", "description": "We go here regularly after the movies for their burgers which I think are one of the best. Pricey but worth it.  As for the desserts we were VERY disappointed, they just hired a new pastry chef and the stone fruit tart looked like someone dropped it and the ice cream was melted so the presentation was poor and it was a VERY small portion for the price. We also had a chocolate espresso mousse in a glass which was okay but again small portion for the price.", "author": "Lori K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-04", "description": "This place was a disappointment.  It took very long to get our food, almost a half hour and the place was empty at 3pm.  When it finally came out, it was so salty, we couldn't really eat it.  My fish tacos were literally still swimming in water, possibly because the slaw was spewing liquid from the salt.  The service was horrendous, maybe the reason for the slowness.  Our server only came to us 2 times, to take our order and to give us the check.  She was MIA most of the time.  Since we waited so long and needed to leave, we didn't have the time or opportunity to register a complaint but left virtually all the food on the plates.  That should be a hint to the kitchen.  Our server never came back to check on us to see if everything was okay (as most servers typically do) so we never had a chance to say something. TIPs in my book are \"To Insure Promptness\" and our server certainly didn't earn hers.  There were enough service people around including a hostess idling in front holding a bunch of menus who also was not paying attention to the dynamics of our table and could have maybe signaled our server to bring more water or at least check on the food.  There were ample people in the FOH with time on their hands as far as we can see but none noticing our dismay.  We actually had to ask for our check from the bartender who was cleaning the table next to ours to get the check because our server was no where to be found. I live in the area and had high hopes for this place but of the 3 times I've been, something was always off.  This time, the service and salt takes it permanently off our list to frequent.", "author": "Wailana W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Had the Spicy Tuna and Yuca chips. It was delicious. The waitress kept my water glass full.", "author": "Kristi N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-13", "description": "Asked for my brunch huevos rancheros to be as spicy as possible: waitress was friendly but casual, agreed to forward my request to the kitchen but either didn't do so or the kitchen could not comply. The huevos arrived atop black beans with no spice and mild guacamole: a perfectly fine dish if that is your taste, but its not mine. I reminded her in a friendly way that I had wanted the dish spicy (or I would have ordered something else)...she alerted someone else, perhaps the manager, who said he would go get some jalapenos from the kitchen. He also failed to follow through! When I next spotted him, he was delivering drinks to another table. \n\nI left the dish mostly uneaten, and that too failed to generate any response. I have just returned from a trip South where service is impeccable everywhere you go: this NY attitude of  disregard for the customer should not be tolerated, but it is...needless to say, will not be returning! Although I have to say the staff is perfectly friendly...", "author": "Virginia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "I had their lobster risotto which was their special that day. It was very good, and there was a good portion of lobster meat. I also had their trout. I found that to be a little bit on the salty side. Their fries are also very good. Their ginger drink was also nice. Overall, service was good.", "author": "Alex D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-22", "description": "Go for the Monday night burger deal-very good deal.  12$ for beer burger and fries- Other then that, was mediocre.  Table sticky and dirty- miserable unhappy staff.", "author": "Susan T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-30", "description": "Had the organic grass fed burger, which tasted really good. Other than that, service was very slow. We had to wait forever for our food or even a glass of water. The place wasn't full but I still didn't understand why it took so long.", "author": "Suzy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-29", "description": "Watty \u0026 Meg has one of those menus. You know what I mean. One of those menus off of which, based on the descriptions, you could order anything and be happy.* Perhaps even everything.\n\nUnfortunately, budget constraints forced to narrow down our choices a bit, so our small party decided to split a couple appetizers to start. I was leaning lobster bisque, but soup is awkward to share, and pierogies are not. These little fried bits of potato, cheddar, caramelized onion goodness, along with the corn and crawfish fritter special, were a delightful start to an excellent meal.\n\nEntree-wise, I decided I was in a red meat mood. Apparently they serve a burger and beer special on Mondays that I'll return for toot-sweet, which left me torn between the steaks. (This is what the kids call first world problems.) And really, I was torn between butters. The steak frites are served with a bleu-cheese/green peppercorn butter, and the strip has a burnt tomato/bourbon butter. Don't they sound delicious? Butter is ALREADY delicious, and they've just infused awesome other flavors in there. A terribly hard decision, and our vegetarian waitress was of no use. \n\nAfter annoying everyone at the table, I decided since I was drinking beer (a lovely Greenport porter), I needed some bourbon in my life, so I went with the strip that turned out to be a tender and tasty medium rare, as requested. The aforementioned butter wasn't quite as flavorful as I had imagined, but I definitely licked that plate clean so I can't complain. The accompanying onion rings were awesome as well, and I finished the creamy mashed potatoes against my better judgment. Her Vegetable Wellington (with taleggio fondue!) was well executed, but not quite as tasty as the menu made it seem.\n\nBy the time we ate all that we were too stuffed for dessert, but they brought out some spanikopita for no apparent reason! Thanks Watty. Fuck you Meg. \n\nJust kidding. I'll see you both again soon. \n___________\n\n*Except the veggie burger. I mean, I like veggie burgers, and I will eat yours if you are kind enough to offer, but I'll never order one when there are regular meat burgers to be had. Especially not if they are $15. How can a veggie burger be $15? C'mon Meg.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-27", "description": "Visited Watty and Meg for Thanksgiving dinner and everything was extremelywell done!  We were a group of 4, promptly seated and the free-range turkey was made perfectly, sides and service were great (only wish the plates were a bit more plentiful, but that's ok)... Now I'm looking forward to visiting again to sample the regular menu.", "author": "amira b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "Great little space. Wonderful atmosphere. \nNot too noisy for a conversation. Friendly staff and really good and interesting menu choices. I would definitely come again.", "author": "Martha L."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "Watty \u0026 Meg", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "248 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/YT5DS-hBfBN8Y-pPNWHjWg/ls.jpg", "@type": "Restaurant", "telephone": "+17186430007"}