{"aggregateRating": {"reviewCount": 31, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-16", "description": "One of my favorite entrees is the Persian dish, \"Fesenjan.\"  This restaurant has it, and several other traditional Persian entrees.  It was great!  This sweet/savory stew is perfect for fall/winter. I highly recommend their homemade baklava.  I hope this restaurant finds a lot of success! \"Baleh!\"", "author": "Allen D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-12", "description": "Welcome to the neighborhood!  We enjoyed dining here. The Koobideh was excellent and the appetizers were delicious. Great ambiance and friendly staff. Looking forward to going back and trying other dishes.", "author": "S Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-24", "description": "I went to this place after being rudely treated by the owner of sofreh. They really made it up to me by their amazing hospitality and kindness. Not just that the food quality was amazing. Their kashke bademjoon was ONE of a kind. \n\nI had extra khoresht left which I asked them to pack, when I got home I was surprised to find they had added a big portion of rice to my food again for me to be able to enjoy my stew. \nLovely people, lovely food, lovely restaurant. \ncant wait to go back!", "author": "Pooneh F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-29", "description": "We found this quaint space nestled in the  middle of Montague and felt like we hit the lottery. The food was delicious from beginning to end. There's ample space for lounging on sofas while tables accommodating parties from small to large surround the side. The music sounds more from Spain than the Middle East, but very pleasant. The flavors are just enough to satisfy your palate. The service was pleasant and cheerful. Definitely will recommend and make a return trip. Perfect for meeting a large group of friends or an intimate dinner with your significant other.", "author": "Alexis J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-22", "description": "We were there yesterday to celebrate my birthday with friends and family. We ordered Gorme Sabzi (spinach lamb stew ) chicken and beef kabobs and fesenjon (walnut and pomegranate chicken stew )they were all good!! Nima and chef stopped by our table to make sure everything is good! Great and friendly service . Lots of room to sit around and socialize ! Very nice cozy place ! Great for group parties ---highly recommended ! It is about time to have Persian cuisine in Brooklyn ! Way to go guys and thank you again for great service and delicious food!!\nKamron", "author": "Kamron K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-02", "description": "This place is situated in a convenient nook near multiple trains in the middle of Brooklyn heights. Full bar, hookah, ALOT of sofas to lounge, a whole bunch of TVs and attentive service. Much like other reviews here I am Persian and can vouch for the food quality, yogurt sauce on point, Iranian tea is a must and the dishes were succulent. I had the chicken kabob and the fesenjan (stewed chicken with pomegranate). Please support this place because it's DA BOMB, don't play yourself.", "author": "Mohammad A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-08", "description": "One of the best iranian food I ever had in nyc. I highly recommend the Ghormeh Sabzi and Kebab Kobideh. The service and the vibe was very good too. They also have Kaleh Pache that I want to try it next next time.", "author": "Nasim L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-10", "description": "Food is wonderful and they treated us so well! Came for lunch on a week day, the gentleman really took care of us like we were visiting relatives. We ordered hummus and dolmeh (stuffed grape leaves) for appetizers, ground beef kebab with dill and fava bean rice, pomegranate walnut chicken stew with roasted potato for main courses. The hummus has a more substantial texture and it tastes great, I am also happy to find the grape leaves were served warm. The ground beef kebab was full of flavor and the chicken stew tastes great with that bright sweet and sour note with nutty walnut undertone. Half way through the lunch, another waiter approached our table brining a small dish of saffron rice. He explained that although we ordered the dill and fava bean rice, traditionally the chicken stew goes with saffron rice and he wanted us to try the flavor as it was intended. How nice was that! The baklava dessert we had at the end was also served warm with a bit of pistachio cream on top. This place is hookah bar in the evening which can be fun, but the food itself is definitely worth returning for.", "author": "X N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "Ordered delivery - Food was excellent and arrived quickly and very well presented. Eggplant dip, Hummus and Yogurt Dip were phenomenal and served with an abundant portion of delicious bread. Salmon Kabob with Dill and Fava rice was also delicious. Will definitely be back to try the rest of the menu - overall great food and a great addition to the neighborhood!", "author": "Mia F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-20", "description": "I stopped by with my friend the other night for a drink. I've been here in the past but it looked really different inside and found out there was different management as well as a different menu. There was a bunch of super comfy couches to relax and chat and the ambience/decor was much nicer than I remembered. Food was surprisingly delicious. My friend ordered a meat kebab and was amazed by it and I had a falafel/ hummus dish which was very good, we shared an eggplant dip appetizer. Staff was very attentive and friendly, will definitely be checking it out again!", "author": "Laura K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-21", "description": "My boyfriend (who is Persian) and I decided to check this place out tonight since it is so close to NYU. It totally exceeded our expectations - charmingly intimate setting with staff who were super friendly, welcoming, and more than happy to answer questions about the menu, which was simple but inventive. We ordered eggplant dip and salad shirazi as appetizers, and they came quickly and were authentic and delicious. As entrees we ordered koobideh and lamb shank, both of which were amazing! The lamb was perfectly cooked and fell right off the bone, and the seasoned rice was just as good and easily could've been a dish on its own. The koobideh was also incredible. We will definitely be back and will recommend this place to all our friends!", "author": "Molly L."}], "servesCuisine": "Mediterranean", "priceRange": null, "name": "Dariush Persian Cuisine", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "132 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/zTUqAmanR3bsS3156ySoqg/ls.jpg", "@type": "Restaurant", "telephone": "+17185961800"}