{"aggregateRating": {"reviewCount": 322, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-23", "description": "Shocked at the ratings. This place needs new management. I had the worst experience here eating an average burger and fries while a little kid played with the ketchup and mustard bottles while putting it in his mouth. His mom was watching this by the way. I had to ask an employee to bring me an extra ketchup bottle. Anyway once I received the ketchup bottles, I guess his mom was a current/former employee because each employee kept coming over to talk like it was a reunion. Uugghhhh I couldn't even enjoy my average tasting burger and fries with such a crowd around. I swallowed my burger as fast as I could and left. WHERE WAS THE MANAGER?!?? Who knows maybe the mother of that child was was the manager.", "author": "Christina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "There are plenty of burger joints in the city.  Smashburger puts out a decent burger in a fast food setting. It doesn't have the hype like Shake Shack but nevertheless I enjoy the burgers here. There is a good selection for everyone and the fries are pretty good also. Can't really go wrong.", "author": "David N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-17", "description": "Great location and excellent service! I just had lunch here and was highly impressed. It was VERY packed and I anticipated a long wait, however was surprised of the fast turn around. I ordered the classic smashburger with regular fries. It was amazinnn! Juicy patty on a pillow soft bun. The fries were well seasoned and crispy. Staff members were polite and cleaned as they went on. Very attentive to our needs. I certianly would revisit", "author": "Andrew P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-06", "description": "The staff was great. The manager was very attentive and was constantly checking in on our experience. As for the food it was good. The burger was flavorful. I am partial to a juice think burger but I get the concept of smashing it to seal in the flavor. It was flavorful. The fries were very oily and a little too soft. But tasted good. All in all a good place to grab a quick burger", "author": "Joe H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-11", "description": "On my last trip to NYC I stayed in Brooklyn in a college dorm that happened to be only 10 minutes away from a Smashburger. One evening I was starving, but I did not feel particularly comfortable in the area. This is unusual for me since I visit NYC often, and I have never felt this way before. After reviewing my options on Yelp (get the app!), it showed me that only a block away there was a burger place with decent reviews. So I grabbed my bag and headed over. \n\nFrom the outside it did look like a chain. And well, it is. I always become apprehensive about burger chains. The only burger chain that I love is Shake Shack. But I did not really have that many options, so I went in and reviewed their menu. When you enter you will find instructions on how to make your order. I always seem to dance to the beat of my own drum, so I missed the instructions alltogether. Basically what the instructions say is to grab menu, figure out what you want, order, take a number, and leave menu with cashier. I know, the whole process is mind-boggling. Yet, somehow I managed to order. Though this was my process:\n\n1. Walked to the cash and was asked to grab a menu located near entrance\n\n2. Grabbed menu. Confused by the options so walked to cashier again\n\n3. Asked cashier questions and stepped aside to think\n\n4. Got back in line and ordered. I chose to \"make my own burger\" which was not as simple as it looked. Why? Because the bun options you get do not include the pretzel bun. I WANTED THE PRETZEL BUN! I stressed for nothing. I got my pretzel bun without a fight.\n\n5. Took menu back to my seat. Yes, the instructions said to leave menu with cashier. See! I told you that I can't follow instructions!\n\nFood:\n\nI ordered a bacon cheeseburger with fresh slices of avocado, and an egg. I also got a side of sweet potato fries. The fresh slices of avocado is what rounded up the burger and took it from good to memorable. \n\nVerdict:\n\nThe Good: The patty was juicy, the bacon crispy, the pretzel bun was soft, with a hint of salt. Perfect!  \n\nThe Not So Good: The egg was not runny, and the sweet potato fries were good, but not great. Both were overcooked. \n\n**Note: The prices online are wrong. Add a $1 to almost everything on their online menu.", "author": "Itanni B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-05", "description": "I don't give reviews on chain restaurants since they usually already have an established name for themselves, but I go to multiple smash burgers all the time. This was my first time at the Dekalb location \u0026 I was really impressed with the service. They kept the place clean, checked on our table a few times to see if everything was good. The outstanding service was very notable. So I had to give a review. I made note of a few of the ladies I made encounters with. Their names were Franny, Shanice \u0026 Shaunice and their professionalism should be recognized!! Though everyone on staff seemed nice. I will be back soon!!", "author": "Estela S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-13", "description": "I went to SmashBurger on Friday to get a create your own big burger. I ordered it with cheese and they charged me 70cents. I asked about it and everyone that works there told me \"that's how it always is.\" The menu clearly states that it is only 70cents if you get a smash chicken AND I have been to SmashBurger at this location and another location many times (another location more recently) and have never had to pay for cheese on the Smashburger. I tried to explain this to them and they repeatedly told me that I was wrong. What happened to the customer is always right? Very unhappy.", "author": "Jasmine E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-30", "description": "I ordered the chicken sandwich and it was not bad. I  wanted water but they had non however I was offered a cup to get some free fountain water. If you're into fast food/ burger joints I guess this is the place to go, idk (I don't get burgers).Also it seemed like a lot of high schoolers stop by after school..which I assume is great for the business.", "author": "Emily S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-07", "description": "This is a review for a specific experience that I would like to bring to the attention of whoever manages this place. Regina was totally nasty. She totally ignored me when I came in (the only non-employee in the restaurant) and proceeded to make me stand and wait while she handled two online orders with no explaination. When I asked if she was going to take my order she was indignant and said the online orders came first. When I responded saying that she had a live customer in front of her she responded with \"Really, where?\" and glared at me. If I hadn't walked a few blocks in subzero weather I would have walked out. She looked as if she was going to go in the kitchen and spit in my food. Also she was scratching at her head and coughing lightly. I didn't even want to hand her my credit card to pay. Used to come to this location a lot but will be hard pressed to come back.", "author": "Alexandra S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "I had such a nice visit here with my friend! It was our first time at smash burger and they made us feel welcomed and made us feel like home. The employees were so nice and sweet.\n\nMy friend ordered grilled chicken club and I ordered the burger avocado thing (I forgot the name). Mmm it was so good! Craving for more right now. \n\nSadly I can't come that often because of how far I live ): \n\nThey provide a lot of seatings for groups or just 2 people. The interior design is nice and the place is well cleaned. The waitress constantly come by and ask if you need anything else or any assistance. The manager was pretty nice too. He seems very passionate about his business and treats all customers very nicely and welcoming. \n\nI recommend this place! You should definitely stop by here if you're around the block!", "author": "Shirley S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-05", "description": "My daughter and I went to Smashburger and she ordered a chicken sandwich.And it took proximity 23 minutes for the food to arrive.I asked the employees what was taking so long and they gave me an attitude.They were so rude it's pathetic.Finally when the food arrived we tried it and it was just plain disgusting.To start off the fries were stale,the chicken was dried up,and it wasn't juicy at all like Shack Shacks burgers.It looked like they just smashed it together.And to make things worse the people who came after us got their orders BEFORE us.My daughter was very upset and I wanted my money back.It was a waste of time and money.I would not recommend this place to anyone.If you want REAL burgers go to Shake Shack.", "author": "Donna G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "In terms of fast food burgers available in NYC, Smashburger takes the cake. The burgers are so tasty and juicy. It actually tastes like I'm eating real beef. \n\nThis location has super friendly employees that are on top of their game. They are quick to clear your trash for you and the bathroom is actually very clean. The food comes out pretty quickly. \n\nI noticed that if you order take out, the wait for your food is longer than if you dined in. Not sure why that is.", "author": "Maggie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-15", "description": "Honored to be able to write Review #100 for this place!\n\nThe spicy baja burger is probably one of the top 5 burgers I've ever had. Better than Shake Shack. Better than Five Guys. Haven't made it out to the West Coast, so that's where my comparisons will end :(\n\nIt's a little out of the way (tucked next to LIU), but I think that's how the burgers are so affordable. They don't skimp on the patty either! The meat-to-price ratio simply cannot be beat.\n\nAnd the burger itself was delicious. When they say spicy, they don't mean a small tingly spicy. It's actually spicy (not unberably so, though). And with the melted pepper jack and guacamole, the Spicy Baja is a winner. So many flavors in every bite. I had the Smash size and it was pretty substantial. Not even sure I could handle the Big Smash!\n\nQuick service, nice decor, and great prices. Wish they'd redesign that logo though!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-27", "description": "Had a quick lunch meeting here and was pleasantly surprised by the great customer service we experienced. The food is your burger and fries kinda spot that serves up beers to kick in lunch-time drinking. While I didn't indulge, the staff was so on point, cheerful and on \"happy juice\". \nIf you're working in Downtown Brooklyn, check them out for your burger cravings! \nNote: they serve chicken, turkey and veggie options!", "author": "Candice R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "Smashburger is pretty awesome. They have a limited amount of pre-set burger combinations, but you can always make your own. You're allowed to get any of the pre-set combinations on its own, on a burger, or on chicken (grilled or fried). Additional toppings (guacamole, bacon, etc) cost a $1 extra, while additional sauces are free.\n\nI got the Brooklyn Big Burger (grilled pastrami, Swiss cheese, pickles, onions, and mustard on a pretzel bun) and a salted caramel milkshake. The burger was quite good. First time I ate something where strands of cheese would follow after biting into it. It was quite flavorful as was the salted caramel milkshake. They use Haagen-Daz ice-cream in their shakes, which, of course, makes it that much better. I also like the fact that they give you the rest of the milkshake in the shaker cup if there's no more room in the glass. \n\nAll in all, this was a pretty good experience. The cashier was very attentive and very efficient. I would love to come back and try a new burger or chicken sandwich.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-22", "description": "I seem to have missed something here.  I was overall unimpressed with my experience.  I had the BBQ Bacon Cheddar burger with sweet potato fries.  The burger patty was dry and kinda thin.  The BBQ sauce was too sweet and the bun seemed way too thick for the amount of burger and toppings.\n\nThe fries were really good though.  I guess I was expecting to be blown away by the burgers and they were laughably pedestrian.  Guess I can safely say I will be avoiding them in the future.", "author": "Drex H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-22", "description": "I enjoyed the selection of burgers and the quality of service. This was my first time at Smash Burger. I loved the fact they had sweet potato friends and the option to add egg atop of my burger. I was dying of starvation so I ordered the bigger portion. To my surprise, it was a lot of food. I felt like a stuffed pig afterward but it was definitely well worth the money.", "author": "Be C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-05", "description": "My first time here. I had the Classic Smash with SmashFries. It wasn't the best burger i ever had, but it was close enough. I wasn't sure if I wanted to make my own burger or pick one that was already set for you. I personally like to make my own most of the time, but since it was my first time here I just wanted to get a classic one before I mix and match what i really want. As for the fries, I like my fries to be flavored and crispy and that's what I got. You can't go wrong with fries, but if you did then you must be doing something wrong. \n\nI would come back again, but next time ill be making my own burgers.\n\nAs for the service, It was pretty good. I got the food within 5mins. You would have to pay at the counter and they give you a number on a stand and you take your sit. When the food is ready they will bring it to you by finding you by the number they gave you.", "author": "Helen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-01", "description": "As a vegetarian, it's nice going to a burger place and seeing an original veggie burger on the menu. The Spicy Veggie Black Bean burger ($6.99) is a sort of puréed black beans with a nice spicy kick. It comes on a spicy chipotle bun adding to the kick, with pepper jack cheese, as well as guacamole and chipotle aioli sauce. A refreshing change, from your typical frozen veggie burger. \n\nThe Smashfries ($2.29) are delicious, and loved the added spices that differed them from regular French fries. The Sweet Potato fries ($2.49) are also good and crispy, the only downside of them, is the serving size is fairly small, compared to the large serving of Smashfries you get. \n\nThe service is friendly and quick, and they have a decent amount of seating available. Id definitely return.", "author": "Kayla G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-09", "description": "Smash or Pass, Smash or Pass, yes I would most definitely smash this place. The burgers were quite good. \n\nCause I smashed them!\n\nWell ordered the Mushroom Burger which was alright, nothing fancy just some shrooms and cheese.\n\nNow my next burger was the All American, this is not for the faint hearted. American cheese with red onions, pickles, ketchup and mustard. A lot of mustard, this sounds strange but actually works. (see pic)\n\nDon't try this at home should be the warning on this burger cause the mustard was center stage. Quite delicious and different. I was skeptical at first but that burger took only 4 bites, yummy.\n\nWell had the sweet potato fries and Haagen Daz chocolate milk shake, dam must be like a million calories here. Aaaahhh go ahead clog my arteries you only live once and it might as well be at Smash Burger.", "author": "Martin W."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Smashburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "74 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JPa99LWTdgmCDcySlOcqnQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182221101"}