{"aggregateRating": {"reviewCount": 322, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-20", "description": "Holy moly this was a good burger. Hot and juicy, satisfying size, just the way I like it. I got the mushroom and Swiss cheese burger, with the sweet potato Smashfries. Those things were AMAZING. Crispy and well seasoned, they were the perfect pairing for my burger. For about $12, this was a satisfying meal, and I hope to see more Smashburger locations around NYC.", "author": "Sanskar W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-18", "description": "Sounds like a great burger. Too bad the delivery guy couldn't find my apartment. Called DoorDash who outsources their delivery infrastructure, was told I'd get a call back. After 15 minutes, no return call. Called back and got my refund.", "author": "Jasper R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-16", "description": "A wonderful surprise in Brooklyn!  A franchise dishing out great burgers and fries at a great price.\n\nSmashburger is conveniently located on Dekalb Ave, with the restaurant steps away from Junior's, Fort Greene Park (to walk it off), and Brooklyn Hospital (if you don't walk it off).  The place is across the street from LIU's Health Sciences Building, so I always see stressed out PT Students chowing down for the 30 minutes they sacrificed from intense studying (remember this all too well).  I have already gone 3 times and will continue to return for those Smashfries!  Perfectly covered in olive oil, rosemary, and sea salt, Smashfries are perfection (although the fries from Smashburger on Route 17 in Paramus are bland in comparison).  I usually make my own burger with grilled onions and chipotle sauce or BBQ sauce on a whole wheat bun and I am never disappointed.  Would like to see more locations throughout 5 Boros!", "author": "Annie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-22", "description": "Smashburger makes a decent burger and fries, but with five guys around the corner i don't see a reason to eat at this location.  the fries here are nothing special, which is the main reason i like five guys better, and the fried pickles were pretty bad compared to others i've had in the city.  i did a build your own burger with american cheese, ketchup, spicy mayo, lettuce, grilled onions, and tomato.  i really liked the spicy mayo and the lettuce and tomato were very fresh, but the burger meat itselt was kinda bland and wasn't that juicy.  If i was near a different location and five guys wasn't around the corner i'd give it another shot.", "author": "John P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-04", "description": "On Friday we stopped at Smash Burger in Forte Greene. It was a SMASH! Unbeknownst to me, it was their anniversary...and I learned that Mayor Bloomberg was the first NYC resident to eat a burger there. \n\nI decided to try the SMASH Fries...they were absolutely delicious. Not your average fries. They were\ntossed with rosemary, olive oil and garlic. To top it off, they serve white wine...and I ordered a glass with my fries.\n\nWhile I was there, I also had a chance to chat with the staff. I had the pleasure of meeting Rose, a current LIU student studying English and chemistry. \"I absolutely love the atmosphere here, says Rose. I will miss it when I graduate this year.\"\n\nSo if you are in Forte Green, Downtown Brooklyn, Clinton Hill area, please stop over and visit SMASH Burger.  \n\n Don't forget to say hello to the proud owner: Mr. Jim Denburg.\n\nLet them know that you heard from Apples \u0026 Oranges Public Relations.", "author": "Apples Oranges P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-14", "description": "I want to make love to their burgers. \n\nHere's why: A juicy burger with guacamole, cheese, seasoned mayo, onions and tomato on a delicious bun with bits of goodness baked in. The sweet potato fries, which I usually don't like, were to die for. I ordered them with garlic and rosemary. OMG.\n\nPeople, I am so serious. This is the best burger I have had in a really long time. They have other burger options, too. They aren't too expensive and the staff is friendly.", "author": "Zenovia E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-24", "description": "The New York burger with bacon is amazing.  Add a Dr.Pepper and smash fries and you have the best happy meal ever.  Maybe switch it up with a vanilla shake occasionally.  You order at the counter and then they bring the food to your table.  The servers are very nice and considerate.  The attention to detail makes them memorable.", "author": "Agapito G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-06", "description": "We came here during the summer with a buy one get one free coupon in hand. #score! We ordered 2 classic burgers and smashfries to share. The burger was pretty good, nice and juicy and all the flavors melded nicely together. I'm getting hungry as I type about it.  The fries were shoestrings and the idea of the rosemary, olive oil and garlic was good, but they weren't tossed consistently so some fries didn't have the flavor. Overall I thought it was good and I would definitely go back and try what else they have on the menu.", "author": "Suriyati B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-19", "description": "Best burger joint I've been to! \n\nI've had a little bit of everything here: chicken sandwich, burger, salad, fries. All were spot on. My one complaint is that the jalapenos on the spicy baja sandwich are raw (I like mine pickled). \n\nThe manager is literally one of the nicest guys in downtown Brooklyn. Staff is friendly too. They bring out your food and even bring you a glass of water if you're super lucky. They have tables and chairs outside so I imagine it's a nice option to eat under the sun.\n\nAlso, it's super convenient to get to. Dekalb Station is down the street.", "author": "Tim O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-13", "description": "Delicious Burgers and great service, need I say more?\n\nThe milkshakes here are great and that egg bun makes life just a little better every time I have it.\n\nThe garlic fries are good too but I rather the plain fries.\n\nThe caesar salad here is also very good, lots of chicken and flavor. It's also a huge salad which is appreciated!", "author": "Casandra R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "Love that you can create your own meal. Fried  pickles are way too salty for my tastebuds though.", "author": "Ronsheeka H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-12", "description": "Excellent.  Consistently great service.  \n\nThe burgers themselves are the best in Fort Greene.  Better than 67, 5 Guys, or Mullanes.  Really.  Good bun, meat is high quality, and a good variety of different burgers.  \n\nThe salads are also very enjoyable.  Big portions and fresh and creative ingredients. \n\nOnly downside is the location.  Wish it were on a more accessible and friendly street.", "author": "N F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-18", "description": "Smashburger is amazing. Loved how many choices I had, burger was cooked exactly as I had ordered it.\n\nService is friendly and fast. Prices are not outrageous. Solid choice for a burger place if your in the vicinity. If you sign up ahead of time to be on their email blasts, you will get coupons making your visit even more pleasurable!", "author": "JENNIFER T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-08", "description": "Friend and I came here after the Tour de Brooklyn ravaging hungry. The main reason we chose this place was because of their outdoor seating.  \n\nI ordered the Spicy Baja burger which was fucking amazing. It's so amazing that I used a curse word in my reviews which I never do. Just writing this review makes me drool over the thought of it. The sweet potato fries were sinfully delicious. I could literally eat a whole bucket of them.\n\nThe service was great too! Super friendly and attentive. I would definitely come back here! Arggghh I crave. They need to open a location in the city so I can get my fix!!", "author": "Lily M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-15", "description": "I'm a fan!!! Excellent customer service for a 'burger joint'. We ordered to go and as we waited the cashier brought over our shakes and a sample of the infamous fried pickles for us to try. I can't vouch for the burgers( non red meat eater) but the Grilled Buffalo Chicken sandwich was amazingly good. The vanilla Haagen daz shake also super yummy\n\nAgain probably not the healthiest meal, but every once in awhile I don't see any harm :)", "author": "Quinny R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-02", "description": "Came here with my family for lunch on a weekend trip to see my sister at LIU.\nI was feeling a little gross after the plane ride, so I opted for their chicken sandwich as opposed to their infamous burgers.\nIt was topped with avocado, and bacon- 2 of my favorite things in the world.\nIt's almost like they said \"hey... we are going to have this sandwich on the menu because Kristin likes these things.\"\nIt was fresh, flavorful, juicy and just what I needed after an exhausting early 4am flight time from Detroit.\nMy sister and I split a side of fried pickles.\nI'm a bit of a fried pickle snob.\nIt must be a flour based batter- none of this cornmeal bullsh*t and it must not be doughy- light, salty, crispy, and flavorful\nSmashburger's fried pickles hit all of these points! So good!\nThe service was very friendly, and attentive.\n\nI would definitely return if I lived closer.\nTouche Smashburger, touche indeed.", "author": "Kristin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-01", "description": "In the days of fast food frozen patties, Smash makes some of the best burgers I've ever ingested. With a wide variety in their menu and the \"ultimate build your own burger\", I don't see how you couldn't love it here. \n\nTheir milkshakes will bring all the boys to the yard because it is made with real Häagen-Daz  ice cream. It's not so thick that'd you bust a blood vessel in your neck trying to pull it through a straw but thick enough to fill you up and make you love the world. \n\nThey also have vegetarian options, so it's fun for all walks of dietary life.", "author": "Mandy P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-08", "description": "I'm not  here to judge, I'm here to give advice.\nGuys, there is 67 burger on Lafayette and Fulton just a few blocks away!!", "author": "Michael W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-01", "description": "Food is sometimes inconsistent; For smash fries, sometimes there's plenty of olive oil\u0026Rosemary flavor, and sometimes, they're just bland...\n\nI got a Baja Burger and I loved how it tasted. It has a chipotle bun, lettuce, tomato, onions, jalapeños, pepper jack cheese, guacamole, and chipotle mayo.\n\nThe Chipotle bun was something I've never had before, and went well with everything else. But I got fed up' with the fact that the entire burger fell apart. \n\nThe lettuce was way too big for the burger, and the mayo was between the bun and lettuce, so the ENTIRE THING just kept sliding and falling apart with every bite. I think i would've given it 4 stars if I was in a better mood, and if the burger would just take a bite.\n\nGreat service though.", "author": "Angel H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-08", "description": "While my co-workers loved this place, it doesn't live up to the hype.  It's a bland burger. I ordered the Avocado Club burger, and while it had all the bells and whistles it wasn't tasty.  I had better burgers at Shake Shack, Five Guys, Island Burger and even freakin Wendys! Only plus was the bread.", "author": "Ashley B."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Smashburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "74 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JPa99LWTdgmCDcySlOcqnQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182221101"}