{"aggregateRating": {"reviewCount": 322, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-18", "description": "I've tried most of the burgers, my favorite being the Brooklyn smash. All of them are great and worth trying, though, I promise. Spectacular service a plus =)", "author": "Alice Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-17", "description": "I've fallen in love with the crispy chicken baja sandwich each bite is a treat\nto your taste buds. Most burger places treat their chicken sandwiches as after thoughts not here try it you'll like it very very much.", "author": "EARLDINE J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-03", "description": "fast food with gourmet finish...from the decor, to the employees, and the food  everything is done with utmost determination for a customer's satisfaction. just went in there to try it...and now they got me here less than a week later to dine in again. and i don't really do repeats so close in between. \n\nBeing a newbie, the employees were awfully excited to explain to me the options they had based on what i was looking for so that was plus. i also thought it was pretty cool that you get served your order when dine in, i almost forgot it was a burger joint. maybe i had low expectations?\n \nthe Angus burger options are far different from what i know which really had me interested, not only that i was introduced to having ketchup AND mustard on my burger. who knew it would taste that good? and you can't just settle for regular fries when you get there - go for the smash fries! they're made with  rosemary olive and garlic, definitely worth the upgrade. \n\nI'm also one of those meat eaters that LOVES veggie burgers so i had to try that too. Pretty good, but not what I'm used to...the patty is only black bean, i prefer more of mixture of veggies - the beans kinda leaves a starchy texture and taste but i still really liked the burger overall. i can't wait to try  the chicken...", "author": "Vanessa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-10", "description": "Went here yesterday for a work lunch and will not only be recommending it to people, but will be frequenting this spot for my next burger fix!  Really tasty and manageable to eat (not too big I can hardly bite) burgers with a variety of combinations.  I had the New York w/caramelized onions and aioli.  I had to give the 5th star as they also make one of my favorite items - fried pickles.  And they were delish.  Great pricing, fast service, and very friendly, on top of it staff.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-03", "description": "The grilled chicken burger done Santa Fe style has surprisingly flavorful chicken and is good enough to make you forget that you're not eating the beef burger that you really wanted to order.  Bravo.  The sides may not be worth ordering - flash fried veggies are a soggy greasy mess though the fries are pretty decent if you looking for an accompaniment to your meal.  \n\nIt's so funny that this location is about a block away from my favorite burger chain in the world, Five Guys, and I still choose to come here sometimes - not bad!", "author": "Christina Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "The most consistent, efficient, pleasant, clean, courteous, fast and wallet friendly fast-good-food burger spot in town.", "author": "D R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "A real real good burger, delicious fries, fast to-go service but upgraded enough so you don't feel like you just brought home McDs even though you are toting a greasy paper sack. .", "author": "Elizabeth B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-15", "description": "The Burgers are fantastic, I highly recommend the grilled avocado chicken club. The staff is pretty nice and congenial,", "author": "William C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-12", "description": "Best burger in Brooklyn. I know a good burger when I'm chomping on one and trust me: Smashburger blows everything else out of the water. Juicy, flavorful, a hint of pink in the middle, beautifully spiced -- this is to regular fast food as Radiohead is to Air Supply. The fries are serviceable, the shakes are premium, every surface in the place is clean enough to eat off of, the staff are enthusiastic and friendly. Go. Eat. There. Now. You will love it.", "author": "Marven K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-31", "description": "Just ate the burger for lunch, beef was way too salty!  Maybe it was the smash sauce?  Though the crispy chicken sandwich is awesome, creamy buttery avocado and bacon really taste great together!", "author": "Pamela Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-22", "description": "Kinda like every other burger place nowadays. It was a good burger, greasy fries, interesting fried pickles. They serve beer, and shakes. But, everything was sooooo super salty, I definitely needed to drink a gallon of water and take a few diuretics when I left. Weird location on Dekalb Ave., not sure why they chose that spot?", "author": "Brooklyn U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-16", "description": "The burger and fries were very good, but for whatever reason I was feeling like crap afterward. I think the food was dirty or something bc I was throwing up all night.", "author": "Bob Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-17", "description": "The times that I came to Smash Burger, I had the classic and the spicy baja. Both were good but I prefer the spicy baja. Sweet potato fries complimented the meal quite nicely and they had free refills. A little pricey to eat there for students, I never went there when I attended Tech but gave it a try when I went to visit. I heard good things about the shakes so I'll probably come back and try it sometime.", "author": "Andy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-15", "description": "I wanted to love this place, I really did. We went on a Saturday night and it was empty.  Whilst studying the menu, an employee came over to offer help which was nice.   We split a big smash spicy Baja Burger and sweet potato fries.   The Burger wasn't as big as expected and could easily be eaten by one person.   I was disappointed because the patty was so small and despite all the ingredients was a little bland.  :(  the sweet potato fries were very good but ithink the seasonings would taste better on regular fries.  Free refills on soda! I begrudgingly have to say Five Guys is better but my boyfriend disagrees. Its worth trying for yourself.", "author": "Kristin G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-20", "description": "Pretty good burger, tasty but VERY salty French fried onions, excellent service.  I recommend eating while it's fresh; as neither the burger nor the haystack onions improved as they cooled", "author": "Ash M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-30", "description": "Smashburger is dignified take out.  Order your burger (beef or chicken), pay and then sit down with a soda and relax.  Our smiling \"runner\" brought out our meals and made sure we had everything we needed. Refills of self-service soft drinks are unlimited.  The burgers are delicious; a cross between Shake Shack and Pete's Burgers in Astoria.  The regular burger is sure to please most people but you can order a larger burger (and even extra meat) if you like.  The spicy baja burger was really good and the fresh jalapeno gave it an unexpected crunch.  The sides are just \"okay\" and not very big.  I thought the onion rings were salty, but really didn't mind.  I was impressed by the genuine eagerness to please exhibited by all the employees as well as the cleanliness of the restaurant.  The staff is still learning, but they are so sincere their \"misses\" were easily forgiven.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-22", "description": "A greasy version of Wendys. Burger was greasy and fries tasteless. Good Service.", "author": "Mark L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "Great burgers and a nice place, a notch or two up from Five Guys.  Would definitely recommend.  Its super clean and the staff are definitely working hard to make this place shine.  They even have the best possible root beer float with stewart's root beer and häagen-dazs vanilla.", "author": "D. G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-08", "description": "Yelp! ughh..start getting fractional stars because smashburger strongly deserves a 3.5! I used to be a student in the area and of course, they would wait until i graduate to open this =/. I'm a burger fanatic so I was chomping at the bit to try this place out. I should mention that I intentionally came here later in the evening because there are a few businesses as well as a college and high school nearby, so I'm sure this place can get PACKED during lunchtime and around the time school gets out! \nThe customer service is great...the people are friendly, super helpful, and when dining in, the manager even walks around to inquire about how things are going. They give you a table marker when you decide to dine so you can sit down and they'll bring your food right to your table. There are also containers of ketchup and mustard at each table so you don't have to walk around to \"borrow\" some haha. An employee comes around when you're done and throws away your container...always a welcome nicety, \n\nAs far as the food goes, I had the smashburger which is a 1/3 pound. the big smash is 1/2 pound FYI. In my opinion, on a day when you're hungry, the smash size is perfect! Anyway as per policy, their burgers are cooked medium, so if you want a more well done burger, I suppose you can ask them to do so.  \n\n I must say, though, that this was the greasiest burger I've had in a while, which was kinda unexpected for a place such as this...I'd expect greasy burgers from some mom and pop store, not a specialty burger place like this. It wasn't so greasy that I would vow never to come back, but things can get a bit messy, so smashburger knew what they were doing when they included a stack of napkins at each table...you'll definitely need them! I've actually found that sometimes I prefer to carry out only because the traveling time allows all the ingredients to mesh together and the wrapper to soak up the excess oil, so by the time I get home, its neatly packed burger perfection! I loved that they had many options as to sides, sauces, toppings and cheeses. and OH, they have soda floats! They also offer an assortment of bread! the showstopper here (and also my newest obsession) is their CHIPOTLE BREAD! yup thats right... spicy bread! *drool* I seriously considered bumping this review up to  4 stars just because of the awesomeness of this bread! \n\nSmashburger has a special place in my heart because they have chipotle mayo, which is my weakness ;). One of my favorite burger places is 5 guys and while they make a terrific burger and obsessively good fries, I always lamented about their lack of customization options and sides..this is where smashburger has them beat. \n\nWhile, they do have regular fries but they also offer their signature,  'smashfries'. Smashfries are either regular fries or sweet potato fries that are dusted with garlic and rosemary. I opted for the sweet potato smashfries and although,  they were tasty and i do eat them on occassion, I still prefer prefer traditional sweet potato fries more (which to my knowledge, Smashburger doesn't offer). The sweetness of the sweet potato contrasted my the salty/tangy flavor of the garlic and rosemary had my mouth confused!. Who knows...maybe I can try to tell them to somehow omit the seasoning...\nI'm also used to a chunkier sweet potato fry but the shoestring style served at smashburger will do. \n\nThe price, in my opinion is reasonable and typical of a burger restaurant, if not cheaper..I had a burger, sides, and a drink and it was $12 even and it was money well spent. I shall return if i'm in the area.", "author": "Cassandra B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-29", "description": "When I first came to this restaurant, I was definetly impressed! The service was great and respectful, the food was great especially the chili fries............pure heaven and fulfilling!!!!!!! Nice place and very friendly!!!!!!!!!!", "author": "Michelle E."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Smashburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "74 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JPa99LWTdgmCDcySlOcqnQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182221101"}