{"aggregateRating": {"reviewCount": 322, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-26", "description": "The employees are always courteous, helpful and pleasant. The food is delicious, the wait-time is reasonable and I enjoy the environment when I dine in. The Buffalo Chicken Sandwich is my favorite, but their salads are amazing and extremely filling.", "author": "Vanessa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-14", "description": "I was here on the 2nd day it was opened, and I have to admit the service was great!:) Everyone was really helpful. I had the avocado club \u0026 loved it (since i'm a huge avocado/guacamole fan). The fries were a bit oily. I like the casual atmosphere.\n\nI came back today for lunch \u0026 had the spicy baja. My friend had the avocado club \u0026 absolutely loved it, too! haha--the waiter accidentally dropped the food on me. hahaha..but he was nice enough to offer me free food (on him) so that was nice. Waiters tend to drop food on me so it's all good. advice: no more smiling for me :P", "author": "Khaly V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-02", "description": "Yummy! Got the bacon cheeseburger and sweet potato fries. The egg roll was perfection with the burger. I'll def be back.", "author": "Mrs. Heidi R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "The burgers at this Smashburger are top-notch. I got the spicy Jalapeno burger and it didn't make me feel like a complete piece of shit at the end, like McDonalds! I also got the sweet potato fries which were pretty solid, but you can get better at other places. That's just me being a bit critical, would definitely go to this place again!", "author": "Devin B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-20", "description": "I am sucker for a good burger saw when I saw a Smashburger was coming to my hood had to to give this place a try.\n\nGotta give this place credit you get a lot of options here, more than most places. I had the spicy baja burger which was good. The best part is the spicy chipotle sauce. The burger was a little dry for my taste but good none the less. The best thing though were the smash fries!! There tossed in rosemary, olive oil and garlic and were amazin!!\n\nI will definitely come back here for the variety of options here the fires but my go to spot for a good burger is still Five Guys.", "author": "Greg A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-03", "description": "Excellent burgers. Excellent customer service.\nThe burgers are a million times better than Shake Shack and 5 Guys.", "author": "roni D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-10", "description": "Good burgers, smash burger fries with rosemary \u0026 garlic , \u0026 the chocolate milkshake was heavenly.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-10", "description": "greatest! burger! spot! ever!\n\n\nlet me just give you an example why:\ncheeseburger w/:\n-bacon\n-egg\n-swiss cheese\n-mushrooms\n-avocado\n-fried pickles\n-and sweet potato fries\n\ndid i mention that those were just my burger toppings !?\noh... annnnnnd i washed it down with a brooklyn brewery lager - [beats coke or sprite, anyday!]\n\n\n-holy %#$@ , amazing!", "author": "Jon P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-25", "description": "Nice alternative to the Shake Shack burgers on Fulton...  I like the choice of add-ons to the burgers here.  The fries are a little underwhelming, but not expensive.   The employees are nice, but the owner is a bit of a nudge.", "author": "Joey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-21", "description": "This place is freakin awesome, they always ask how things were, accomodating when the order has been messed up, and they're good with lil freedbies like appetizers etc if you're nice. Great burgers, and wonderful customization possibilities!!", "author": "Vito P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-11", "description": "Ate here on the run at Newark Airport. The burgers were amazing! Wow. Better than Tasty Burger (local Boston chain). Wish I could have savored it more. Had the fries too. Yum!! There are none in New England though. Boo hoo!!!\n\nPlease open one here!", "author": "Heather S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-04", "description": "Ok, I'm all Natalie Imbruglia torn about this place. The mushroom/swiss with bacon on brioche rocked my world. The beer was great, offered with a frosty glass. Having to walk up after my meal to remind them that I'm still waiting on my malt...not so much. Ok, so ten mins later she approaches saying she made it \"with my heart\" almost gained another star. However, it should have been free. I wanted it with my burger and I now have an icy treat that I don't want. Sigh...I'll likely give it another try, but burger 67 and five guys aren't far, so if you want to ditch your skis (they are Denver based) and pick up a racket and play ball, you need to get your game up to not only new york, but Brooklyn speed!", "author": "Mimi D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-08", "description": "I'm in love with this place. My friends and i o here at least once a week. Juicy thick burgers. The smash fries are delicious and the perfect addition to the big smash make your own. Salads are huge. The place is a must if you're in the area. Expect a wait and a crowd this place is a favorite and during the school year bths kids swarm", "author": "Kenny B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-02", "description": "Smashurger is located right across the street from my university so I would sometimes go there for lunch with my friends. The burgers are delicious and the vegetables are relatively fresh.  The  smashfries and sweet potato fries are pretty tasty as well. The staff is very nice and service is very quick. Would go again if I'm in a mood for a burger.", "author": "Aaron V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-14", "description": "the burgers are really great, and its a good location with outdoor seating. It's brand new and very clean. They messed up my order but gave my a coupon for next time ;)\n\nOverall, I was very satisfied.", "author": "Mark S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-04", "description": "The burger: I opted for the BBQ/bacon/cheddar, and am glad I did. The bacon was prepared just right with a hint of a smoky flavor. The burger was med-med/rare and exactly how you want a burger. The egg bun was a nice unique touch.", "author": "Nicholas A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-29", "description": "Straight up goodness! Unbelievably fast service! Its fast food without the taste and all the flavor!", "author": "Vincent A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-20", "description": "I come here every once in a while and love especially their rosemary sweet potato fries but their customer service was amazing today! I ordered and found out that I left my wallet home. They let us enjoy our lunch and let me come pay later today. Thank you, Nick and Anna!!", "author": "Tiina V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-15", "description": "Good burgers, the all American was just right but the Chili cheese fries were even better. Not too many places to park, but a good burger joint if your in the neighborhood.", "author": "Lily W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-08", "description": "Love Smashburger! The meat is cooked really well. Tons of toppings and great pretzel rolls for the burgers. Best thing besides the burgers are the prices. This place blows away Five Guys!", "author": "Mark G."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Smashburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "74 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JPa99LWTdgmCDcySlOcqnQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182221101"}