{"aggregateRating": {"reviewCount": 322, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-20", "description": "Their food is good.  \n\nUnfortunately their delivery service - to one block away is lacking. \n\nThey charge for items, do not deliver, and when called, they apologize and promise to send someone with the missing items right away but don't. \n\nWhen one calls 30 minutes later, they respond, saying \"he is on the way\".  \n\nWhen I call another 45 minutes later, annoyed, and ask to speak with the manager, I'm informed, \"she's in the bathroom and cannot speak\".  \n\nWhen I say I am going to complain online and to their corporate office, I am asked to \"not do that!\", then the truth comes out.  Annoying!  It projects the company's image poorly.\n\na) The person who took the food delivery order also charged the credit card for 3 small milks (for kids) but was unaware that they do not deliver beverages.  \nb) The person who answered the phone saying someone  was bringing it right away - made it up.  \nc) The second person who answered saying 'he was on his way' also turned out to be lying.\n\nSB better refund what they charged but did not deliver.  For the aggravation caused to my guests and their children (not to mention my embarrassment), I will not risk patronizing Smashburger again.\n\nSuggestions to improve SB customer service: \nTrain SB employees to be honest and focused on customers.  \nPick up the phone, call and inform them instead of misleading them and keeping them waiting and waiting on a promise that they have no intention of keeping.", "author": "Bryan F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-06", "description": "My daughter had to eat, my mom had to too and I was more than a little peckish. We were here so we stopped by. to check the menu. Happy that it was cheaper than a Park Slope burger joint, I decided to stop in. I had to run after and try to entertain my tornado while my mom ordered 2 classic burgers sans tomatoes and a chicken tender kids meal. When the food came, DD ate her fries while mom and I struggled to finish our burgers.\n\nUltimately, This place trumps a certain overpriced burger joint that just opened earlier this year. Though greasy, the burgers tasted great other wise and I rather enjoyed some of my daughter's fries. I'll definitely come again if I'm down here again and need a cheap bite to eat.", "author": "Mara G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "It has improved! Thank you!\n\nBig fan of the crispy chicken sandwich and cheeseburger (I do build your own for both)...and sweet potato fries w/rosemary and olive oil.  \n\nFriend ordered a salad, which was massive.  Lettuce and tomato were on the pale side...they were fresh, just very pale (I know it's winter but...). \n\nAs for which is better, the Smash(burger) or the Shake(Shack)..they are different.  Both are good in their individual ways.", "author": "Y B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-17", "description": "I work at the hospital so this place is a very convenient place to grab a bite.  I've ordered the smash burger, chicken burger, and salad here on different occasions, of course.  I wasn't very impressed with the burgers here - nothing special about them.  The patties were very flat and \"smashed,\" literally.  But, the salad was deee-licious and pretty big!  I forgot the name of it (I believe there's only two choices anyways), but it had mixed greens, dried cranberries, raisins, pumpkin seeds, bleu cheese, and choice of dressing.  I also munched on my friend's fries - smash fries (?) - which were tossed with rosemary - they were really good.\n\nOverall, wasn't really impressed with their burgers.  They were just \"meh.\"  I'll def come back here for their salads and because they're located at such a convenient location.", "author": "Tadashi O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-13", "description": "Tasty burger. Full of fat and salt but it is really good.", "author": "Big B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-29", "description": "This is a great place! \nI ordered a burger with grilled onion and blue cheese. I love that we can create our own burger. \nWe did not wait too long event if we were six. There are some outdoor seatings. \nThe burger was very good, AND the fries were amazing (both sweet potatoes or regular fries).", "author": "suzanne T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-10", "description": "Oh helllll noooo!!!!! I preferred the one in Nashville. Being a chain you'd think it'll alllllll taste the same .....", "author": "Sara S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-17", "description": "I've been coming to SmashBurger Dekalb since it opened in my neighborhood. I've seen it go from one of  the best places to take your family and friends to not wanting to go there at all . Don't get me wrong the food is good(sometimes)but, the experience and service is no were near what it use to be . I keep trying to give this place a chance because of my friends and family but it's not worth it . I've had countless unprofessional , cold food, wrong orders, or its to late for a delivery experince to even want to spend my hard earn money there. The summer months there's no cooling air at this location so, it forces my family and I to travel to the city to eat at another location when there is one right across the street from where we live. How about  when you call for a delivery at 9,9:30 and they're not taking anymore deliveries. So you have to leave your apartment to go across the street to deal with cashiers who breathes smell like alcohol and out of order restrooms so you can't even use the correct gender assigned one. From business owner to business owner if you want your business to be successful you must have good services, atmosphere and employees. Not a bunch of kids who don't know what they are doing and isn't out embarrassing your brand inside and out.", "author": "Veronica W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-28", "description": "the smash fries were delicious. I had the baja burger which was also really good. The food comes fast and the cashier \u0026 waiters/waitresses are polite. Only reason I give it three stars is because it's a regular burger joint, nothing much that wows me. I would come back here again, but not like as a main choice for eating.", "author": "Shenel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-29", "description": "Anything and everything you order from this place will be delicious and you will get it very fast. They have their system down packed. The prices are good too compared to other trendy burger joints. I would suggest to eat in.", "author": "Santiago R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-03", "description": "They are a hot mess. I placed 2 orders for burgers, fries and a drink. They only served one burger I'm still waiting for the 2 burger and fries. Please don't waste your time.", "author": "Chaka R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-22", "description": "Very delicious food if you're feelin trashy, but don't expect them to consistently deliver.  Rarely will they send someone to deliver the food.  I wonder if the manager has any idea that my phone calls are repeatedly received as \"sorry... pick-up orders only.\"  I wish I could actually eat this food more, but they clearly can't afford a $10/hour delivery guy.", "author": "Cramedog J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-31", "description": "Although this place is a bit pricey, the burgers here are delicious. Remember to try spicy Baja! They also have really nice smoothies and delicious fries.", "author": "Jenny W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-06", "description": "Heard a lot about Smashburger and I never had the chance to try it when I was in high school. I finally seized the opportunity a few weeks ago since a friend had a coupon for a buy one get one free. I ordered the Classic Smash with  a side of sweet potato fries. I was highly disappointed. The burger was way too oily and it fell apart before I even got to finish half of it.  The fries were just decent and nothing special in my opinion. I wouldn't come here again. Go to the bodega down the block instead.", "author": "Lianne W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-25", "description": "How pathetic is it that I live very close to this joint and every take out order I've had (total of 4) has not been done RIGHT at all! Once I told them, I don't want anymore free side items...I JUST WANT MY ORDER TO BE CORRECT!!! Then this past week was the last straw...I ordered a regular burger with the following items: THE BURGER, AMERICAN CHEESE, BACON, THE REGULAR BUN. Got my order, went home only to find NO CHEESE but instead I did get the following: THE BURGER, NO AMERICAN CHEESE, BACON, OLD LOOKING FRIED ONIONS---WTF?, THE REGULAR BUN. Really? Seriously? I go back and I tell the manager that his kitchen is full of pranksters. He apologies and promises to oversee the remake of the burger. I get another burger and look at it with him...everything looks legit. WELL...GUESS WHAT...THE PRANKSTER IN THE KITCHEN PUT BBQ SAUCE UNDER THE CHEESE. I go back and demand that he FIRE whoever thinks it is funny to play with folks orders. Especially since the reason why I'm so specific with the food order to begin with is my son has food allergies. They are so lucky BBQ isn't on his list of foods that he cannot have otherwise I WOULD OWN SMASHBURGERS AFTER I SUED THEIR ASSES!!!\n\nI am thoroughly disgusted with this establishment and now would rather walk a few more blocks to go to SHAKE SHACK. It is not rocket science to work at a fast food joint so I don't get it. If you order in, your order comes correct. What they fail to realize is that you get more money with take out orders than folks that eat in. Before they came to the neighborhood, the pizza joint did great burgers...I'm going back to them.\n\nIt take A LOT for me to write a negative review but SMASHBURGER...YOU'VE EARNED IT! Maybe...just maybe this review will make you rid your kitchen of pranksters before they go too far and you get a lawsuit in lieu of a bad review.", "author": "Debbie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-13", "description": "This is a great burger joint. They have so many options, you can order something right off the menu or create your own by choosing a bun, size of burger, cheese, toppings, sauce etc. There are a lot of options for sides too. In addition to burgers, they have chicken (grilled or fried), black bean burgers, hot dogs and salads. \n\nI love that they serve beer \u0026 wine, distinguishes them from Five Guys and other burger joints and also makes it a great low-key date spot.\n\nThe only reason I did not give Smashburger 5 stars is that I agree with the other reviewers, they could really benefit from laying off the oil a little.", "author": "Brianna C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-24", "description": "I love burgers.  A lot.  I order a 1/2 pound All American, since I'm a patriot.  I do not need a lot options. The burger itself was over salted and cooked well past my requested medium. The bun and condiments were all fresh. I think I remember the fries being very good and crisp. \n\nOn my next visit, I will try their shakes, maybe they can get another star out of me.", "author": "Ovieh M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-03", "description": "Hello Brooklyn!!!! I'm from Brooklyn but i think that smashburger signature  New jersey burger is the best : Bacon , blue cheese , grilled onion , haystack onion , lettuce , tomato, mayo , pretzel or multigrain bun ( Brooklyn doesn't have onion bun :(  )", "author": "Rob S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "great service!! i want to thank shanise for always providing great customer service. as well, as the rest of the staff.", "author": "Debra V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-29", "description": "Something about their burgers man. They are just so damn good! Definately order the Big Smash.", "author": "Glo M."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Smashburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "74 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JPa99LWTdgmCDcySlOcqnQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182221101"}