{"aggregateRating": {"reviewCount": 322, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "While the burgers may be small, it is quite amazing to take a bite into their burgers. It is quality over quantity, and I am happy they focus on how good the burgers are rather than the size of them. They are quite the smashing fast food restaurant :)", "author": "Junior S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-16", "description": "The food looks so much better than it tastes. It's like a hot guy w/ no soul. You try it once and then it's not so hot looking anymore. There were some good things about Soulless Burger though:\n1. Convenient location\n2. Though it's counter service, they give you a big number to put on your table and bring you your order when it's ready \n3. Fried pickles arrived hot and with a tasty ranch like sauce\n\n-It's a bit pricy for an upgraded McDonalds.\n-Nothing, except the pickles were hot. My son said he'd gone before and loved his milkshakeI, but this is a kid who thought Tasti D-Lite was the best frozen yogurt. Yeah.", "author": "Felicia S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-29", "description": "This place had really gross tasting meat. \nMy daughter and I came here to have a burger and we both took one bite and both noticed the meat\ntasted like cow manure. I nicely asked for a refund and the manager told me their meat is better than popular fast food chains and wouldn't give me a refund and laughed at us as we left. \nSo beware, don't go here if you want a good burger. And I normally wouldn't write a bad review but they wouldn't refund me.", "author": "Sav B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-01", "description": "Yo what an interesting chain restaurant. On my most recent visit. I ordered my food and verbally said my order twice. They gave me my shake a good 10 minutes before i get my food. Hmmm why would you do that. When i finally got my food and was leaving my shake melting. So im hungry. I didn't have time for tge shenanigans. Get back to the office both burger orders wrong. I look at my burger its not juicy but it costs about 8.69... hmmm right. \n\nI go back very nice employee assists me. Im appreciative. I wont be coming back though. It don't feel right with me to pay like 8 bucks for a burger that looks like it wasn't even meat but fillers. I deleted the app and unsubscribed from them. You will never get these dollars again.", "author": "Asiah C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-28", "description": "Absolutely worst customer service I've ever received. I placed an online order for pick up, when arriving to the store I was greeted terribly, my food wasn't ready on time and to top it off I requested an extra side of sauce on my online order and basically had to fight with the cashier to get it once it wasn't in the bag. Also the manger there is a nightmare. No respect for paying customers, awful attitude and refused to let me have a cup for water. She demanded I paid for a cup. It was outrageous, this was my first and last time to ever come to smash burger. And honestly the bbq bacon burger I got tasted like trash, should've went to McDonald's!", "author": "jade g."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-10", "description": "The customer service and organization  for this place has significantly diminished over the years. I came in last night around 6PM, and it seemed to be pretty crowded. I get to the register to place my order and the young lady says that she's not taking any orders for the next 7 minutes because the kitchen is backed up on orders. This is just unacceptable. The kitchen staff should be fully staffed and prepared for the after work crowd. The fact that no orders were being taken completely turns other customers off. If it wasn't for the the heavy rain, I would have went somewhere else. Not to mention, the general manager who kept screaming at the kitchen staff for all the customers to hear. Totally unprofessional. \n\n Once I finally placed my order, I had to wait another 20 minutes to finally get my food. The saving grace was that my food was fresh and tasty! Management needs to do a better job at training their staff!", "author": "Xenia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "Always packed no matter what time of day you get here . \n\nHowever food is delish, it keeps me coming back for more everytime until I remember how slow the service is. \n\nTook 20mins today to get my grilled chicken burger and thats considered fast. - Blah that's like half my lunch break.  =[ \n\nThey now accept online orders for pick up via seamless and smashburger.com -  I'll def have to try that next time I'm craving for a juicy \u0026 tender grilled  chicken. \n\nSmash fries are a MUST. \n\nAnd also oreo shake w no whip cream. \n\nYUM!", "author": "Katrina C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-07", "description": "As of May 1st they changed the menu, they no longer sell turkey burgers and they have a limited selection of chicken burgers. Since I don't eat beef, the turkey burgers and buffalo chicken sandwich was my go to. After this recent visit I settled with a spicy Baja with guac laced with chicken and it didn't flow right and the quality of chicken didn't taste right so I won't be returning even tho I live near by", "author": "Mike L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-06", "description": "Yes!!! I came here for the fried pickles and I do not regret it! I downloaded the app which gave me a free entree with purchase of a side and a drink. \n\nI DO NOT REGRET ANYTHING! The burger I customized was delicious and the fried pickles were so good for only ~$3! Also definitely try their smash fries, I could not stop eating them!\n\nThe staff was also very friendly!", "author": "Ferline F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-06", "description": "I'm not even sure what's going on over here. Maybe it was an off day? People have those. But man, this place has a complete ice cold evening, I'm talking Starks in the NBA finals Game 7 cold (sorry knicks fans for bringing that nightmare up again).\n\nThe funny thing is, I came here with a friend of mine and talked to him about how I was here when they opened: \"oh its sooo good! their burgers are really delicious! etc etc\" I was saying on our way over there. We get there and end up attempting to order chicken sandwiches. Easier said than done I guess...\n\nMy boy ordered his first, this is important because I got mine before he did. In hindsight I should have taken a photo of our respective sandwiches. my sandwich was the most sad looking sandwich in the history of fast food. The soda machine didn't work. That is, we couldn't even get water from the machine. They barely had condiments. And to top it off, when my friend's sandwich came out, his was no less than 3x the size of mine. A huge piece of chicken cooked to perfection, not the 3 day old thing they found out back and decided to give me. What's worse is this place isn't exactly cheap. How much was may sandwich? Probably $7 or $8. Two bites later, I finish this thing, and I'm of course still hungry. I'm never going back to this place. I was so so disappointed.", "author": "Clint H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-07", "description": "Worse place now. I've always come here on a daily! They started charging for modifications. They kid didn't tell me anything about up-charges to take off sauce... so i wanted a simple refund for the difference and the black manager. Rude with me didn't even defuse the issue. She made it worse. She refused to take my order, walked away from me. We started to have a yelling Match. I'm just trying to order my food. I'm still spending my money here just fix your mistake. At the end of the day my food was wrong like if they spit in it. That jayqon kid needs to be fired and the manager ASAP!", "author": "Joshua M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "Menu is great and cheap. Staff is kind of rude at times. This particular location during school hours is really busy, but on the weekends is very quiet. So, you can go in and out and get whatever you are craving. \n\nI particularly love the strawberry shake and the burgers I always design them myself. They are flavorful and yummy. \n\nI would definitely come back. Sometimes I feel they are better than Shake Shack, for some reason. Just a thought.", "author": "Wendrich J. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-09", "description": "I've never heard about Smashburger until a couple of years ago.  I was visiting my aunt in Minneapolis​ and I went there for lunch. \n\nWhen you place your order with the cashier, she gives you a pager.  It vibrates when your order is ready.  \n\nWhen I found out there was one here in Brooklyn, I made it a point to go there.  The location is small in relation to the one in Minneapolis.  \n\nIf you want a juicy and tasty burger, I recommend Smashburger.  I also recommend their fries.", "author": "Ling C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-11", "description": "I've been coming to Smash Burgers for so many years and the food is amazing okay but, good food without excellent customer services is not pleasant all the time. \n\nYou guys need to focus on solidifying your clientele service ASAP at this location! There's always room for growth, and constructive criticism! \n\n\nThank\nYou", "author": "Miguel R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-20", "description": "Usually I'm a smash burger fan, but this review is for this location only.  The food is good, but the service is terrible.  A Friday at lunchtime is not the ideal time to be short staffed or have non working registers, and I'll mention it was $3 entree day so the line was out the door. \nI can't give a better review for having to wait more than 30 minutes for my take out. Maybe it was an off day for them, but a big chain like this shouldn't have had the delay they did at a peak hour.", "author": "Chre G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-09", "description": "11 check-ins and reviewing it now? \n\nFirst Smashburger in the city. Started not so great but quickly became my go to burger and lunch spot. Good spot across the university, hospital and   BK Tech. Expect a lot of people coming in and out. Line moves fairly quickly but always order ahead or know what you want before you get there. Limited seating. Order the fries.", "author": "Juan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-05", "description": "- 0.5  food quality\n- 0.5  portion size\n+ 0.5  clean new interior\n+ 3.5  baseline\n---------------\n= 3.0  total\n\nGoing there made me think \"everything is smaller in New York\", to paraphrase a popular adage. Burgers were smaller than in the picture and 50% smaller than in Smashburger in Texas for the same price, which is pretty sneaky (while, say, In-N-Out or McDonald's have consistent pricing across the states). The Smash Fries were oily, which again I didn't see in other states. They used \"plastic\" cheese from poaches, and not the freshly cut from blocks. Used cheaper white onions and not better red ones (another New York cost-cutting \"specialty\").\n\nThe interior is well kept. Decent selection of iced tea as an alternative to commonplace sugary fizzy drinks.\n\nIf they wouldn't run price promotion they'd quickly fizzle out.", "author": "Peter H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-20", "description": "The experience I had here was underwhelming. I wanted to try Smash Burger because I had heard it was really good. Honestly I think it was just okay and average. Because of this, I think it was overpriced. I ordered the spicy baja burger and the smash fries. After you order the food is brought to your table by a staff member. I had begun eating the fries that were brought to us when an employee came and informed us that she had accidentally brought us regular fries. She took them away and returned with smash fries but honestly they looked and tasted exactly the same. The regular size smash fries are smaller than a medium serving of fries at McDonalds but almost $5. They are pretty regular except for a BIT of seasoning. The burger was very small for the price as well (I ordered a single). For $4 you can add a drink and plain fries to your burger to make it a meal and this does not include smash fries (which aren't even worth it). I didn't like the iced tea and ended up getting a soda. Overall it was just okay but not worth the price. Would probably go to Shake Shack instead.", "author": "Jane J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-06", "description": "I enjoyed a yummy burger here, it was delicious but I like the fact that I can have a beer in a cooled glass even better. They don't do that anywhere else.", "author": "Martha L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Yes! Amazing burger place in walking distance with veg options, we've reached a new level of happiness.\n\nJavon was being your above stellar customer service person and then the place got busy and he didn't even break a sweat because a helping hand came quick and with a smile, David. \n\nI can't say enough positive things, but hey why not try?....patient, happy, kind, funny, and just an overall joy. Not something you expect when grabbing a bite from your local spot. Thanks to the both of them for making our first experience a great experience.", "author": "Mekela M."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Smashburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "74 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JPa99LWTdgmCDcySlOcqnQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182221101"}