{"aggregateRating": {"reviewCount": 322, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "3.5 stars. My first time having Smashburger and I wasn't disappointed. Made some last minute plans with a friend because I was craving a burger, decided to go here instead of Shake Shack. The set up kinda reminds me of an upgraded Five Guys and the presentation of burgers reminds me of Red Robin? Anyway, good amount of seating and good service all around. It makes sense to have them bring the food to you instead of having everyone standing around waiting for it. \n\nMy friend ordered the truffle mushroom Swiss with a side of smash sweet potato fries and I ordered the New Yorker with a side of fried pickles. We shared our burgers and sides, yum! Everything was flavored just right and I was pretty happy with the fried pickles! I would've ordered a shake since I heard so many good things about it, but it was too much after the amount of food and sugar I had for the day... Smashburger is a good option to satisfy a burger craving and I will have to go back for a shake!", "author": "Geekar L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "Why don't I go to Smashburger more often?  It's so good!  Every single time I go I end up having a stellar meal.\n\nPopped in just last week for a bite while running errands.  While I planned to come earlier I didn't arrive until 1pm and the line was already 8 or 10 people deep (probably thanks to the college across the street?)  It moved quickly thought and the gal at the cash register was super sweet.  She was quick to remind me the difference between the regular (5oz) and the big burger (7oz) and even applied a $2 off coupon when I mentioned an email I had gotten recently.*\n\nFor less than $10 (including coupon) I had a 'Create Your Own' Burger - 7oz + Pretzel Bun + BBQ + Lettuce + Pickles + Goat Cheese + Bacon AND a regular order of the smash fries.\n\nThe burger itself was fantastic.  Smashed to perfection with a super soft bun.  I LOVE that I can totally customize my burger and all of the good ingredients aren't an upcharge.  Most places would charge extra for that pretzel bun!  They could have spared a little bit more cheese on my burger (I did order a 'big' after all...) but that's really the only negative I've got towards that burger.\n\nThe smash fries are a must order as far as I'm concerned- thin cut fried tossed in olive oil, rosemary and garlic.  Oh my deliciousness!  The regular size is a nice big portion and they are not polite when it comes to that garlic rosemary combo.  So so good!\n\nFor lunch I asked for a water cup but I've had their milkshakes before - and if you're wondering if you should order one - you should!  They're spectacular.  **\n\nFood came out quickly and piping hot.  And the staff wandered around often to clear baskets and ask if anyone needed anything.  \n\nThey really know what they're doing over there at Smashburger!  Gosh, I really need to eat there more often... \n\n\n*Sign up for their email club - they send out coupons for discounts and free sides.\n** Must also point out that the drink machine at SB has Vitamin Water XXX.  As someone who doesn't love soda... this is a nice surprise!  Why don't more fastfood/semifastfood places offer Vitamin Water via the soda fountain!?", "author": "Alyssa R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-27", "description": "I was craving for a chicken sandwich so I decided to stop by Smashburger to get their Avocado Grilled Chicken with sweet potato fries. The line went pretty quickly and I waited maybe 5 minutes for my meal, which explains why my food looked the way it did. \n\nMy chicken sandwich was all over the place with sauce dripping everywhere making the bun soggy and impossible not to get it all over your face. Plus my avocado was cut into pieces and also soggy along with the tomatoes. Overall, the sandwich was sloppy as if they literally SMASHED the ingredients together. \n\nI'll more likely order again, but on a day that I know the cooks aren't so busy so that my next burger or sandwich look like the picture on the menu.", "author": "Tanya A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-22", "description": "So I went yesterday once again, the service was no different then my last experience. As a matter of fact the food took so long for me to get. And those onion stacks that I ordered were soooo horrible and mushy instead of crispy .... Fries were cold. But my food took so long? I just couldn't understand \n\nThe service just isn't great to me at all, I won't be a returning customer at all. I'd rather go to another burger joint.", "author": "Samantha B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-04", "description": "Greeting - friendly\nVibe- after school madhouse\nBR- Fail\nService- good\nParking- paid lot or meters \nPrice- $9 burgers $3 fries\nFood\nBrooklyn burger was dry as a bone. Needed a bottle of ketchup to get it down. Topped with pastrami pickles onions and yellow mustard. I hate yellow mustard! Golden mustard only! Especially in Brooklyn. WTF!? Good pretzel bun. \nSkinny fries are very tasty\nShakes- good HD ice cream\nWIGB? No", "author": "Hungry K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-11", "description": "Oh my goodness, I can hardly believe that I'm giving a hamburger chain a four star rating but I am! Today, I ventures out to try a new burger spot and so I passed in my usual 67-69 burger, whatever you call it. Lol - I crack myself up!! \n\nWell, anyway, I did what I normally do and I YELP it and came across Smash Burger. YELP never fails. I'll just add that I'm not a big beef eater. In fact, I turned this experience into my once a year (intentional beef eating experience) beef day. Long story made shot, I love my Blue Cheese crumb Buffalo Hot Sauce Burger. My date had the Jalapeno burger. At some point between sipping down our delicious milkshakes and chomping down on our burgers, we bothered smiled and gave each other a high five which translates into my 4 STARS!!", "author": "Percy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "Yesterday, I went here on a date (which was an epic fail, but that's not the fault of this restaurant). This is a hybrid fast food restaurant and sit-down restaurant. You pay at the counter, they give you a number, and then you sit down. When your meal is ready, they'll bring it to your table.  \n\nThey essentially serve a variety of burgers and chicken sandwiches, as well as desserts. They also sell booze. The food took about 5 minutes to arrive. I had the crispy chicken sandwich and it hit the spot. It was much better than that sorry excuse of a restaurant known as KFC.\n\nThis restaurant is quite possibly the cleanest restaurant that I've ever been to. Furthermore, all of the staff members were polite. I also enjoyed the music that they played in the background. The only caveats are that it's borderline expensive (the chicken sandwich cost $7) and that this is a relatively small restaurant. And oddly enough, this restaurant is 3 blocks away from the high school that I attended (those 4 years weren't exactly pleasant).", "author": "L. William W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "Soooooo good. Add a fried egg and bacon !\nI think it's the best fast food in Brooklyn.", "author": "Wade V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-14", "description": "Our tour bus dropped us off right outside Smashburger and we were lucky to eat here. The food was awesome! It definitely rivaled some of our West Coast favorites, like In n Out. Yes, it was pricey for burgers, the bathroom line was long and slow, but the food was delicious and there was plenty of seating, indoors and outside. I would definitely recommend it!  The pros outweighed the cons...a lot. And, if you order a shake flavor and regret it, they'll make you something else at no charge.", "author": "Kristie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-26", "description": "Lots of incompetency going on behind the register. Especially on 7/26 around 3pm. Slowwwwwwwww", "author": "Brandon M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-14", "description": "Friendly staffers, great fries, and solid shakes.", "author": "George C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-28", "description": "I had a really bad experience in there today and probably wont ever come back again ...I've been going to smashburger since it opened and never had a problem.\n\nin fact the staff has always been extremely courteous to me. Until today,when i walked in and had to use the restroom real fast before i sat down... So i walked toward the bathroom and this over aggressive belligerent employee basically blocked my path and said you have to purchase something 1st.\n\n I told him im a regular and i never had this problem before. Maybe i should of told him im a diabetic. But i didn't think it was any of his business.So after he explained that he has had a rash of undesirables coming in and using the restroom and not purchasing anything. I felt exactly like one of those people he mentioned instead of a loyal customer.Then he finally said go ahead use the bathroom. By that time i was already insulted and said thats ok and just left !!!!  \n\nThe same guy did something similar in the summertime. which i wont get into. Iam a local and rather goto McDonald around the corner. where they all know me and dont ever  discriminate against anyone needing to use the bathroom.", "author": "Billy G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-02", "description": "All of the staff members look between the ages 21-24, it's one thing to look young but they act young also. Rude, inconsiderate with taking orders, and they all move so slow. I was under the impression that the supervisor may not have been in but still for my first time here, I wish I had went to Shake Shack instead.", "author": "April S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "Mmmmmmmmm!!!\nAmazing food, perfect service and happy people.\nMust stop here, I'm addicted to the burger ( add jalapeño )", "author": "Shay D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-20", "description": "I entered Smashburger a little bit after nine. There was only two people in front of me but for some reason the service was very slow. It was finally my turn to order. I was looking forward to a Smashburger shake but the gentleman told me that there's no more shakes at this time and I was confused because I just saw the young lady make two shakes for her friends and she had this big ass ugly smile on her face when he told me that there was no shakes at this time. I looked at the time and it wasn't even 9:30 and the restaurant closes at 10 and there's no sign saying no shakes after a certain time, she just didn't want to do it. I didn't want to cause a scene over a shake so I just ordered a fountain drink and I made my order to stay. I was looking for a table to eat at and all of the tables were filthy I had to wipe a table down myself. So to sum it all up,the service was slow, the girl didn't want to make my shake and the place was dirty. I will not return to this location. Gateway is wayyy better.", "author": "Tekeyah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "It was my first time and it was soooooooo good you def have a new customer . The milk shake was on point like amazingly amazing , and the Staff at the Dekalb site was really cool and officially on point .", "author": "Bruce S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-25", "description": "This used to my go to spot! I was guaranteed a great meal and service. \n\nNOT ANYMORE...\nThe service was slow and inept.\nI ordered a chicken sandwich, w/ cheese and other items. When they delivered my meal it had one lifeless piece of lettuce, CHUNKS of jalapeños, no cheese and a sorry sliver of chicken. \n\nI went up to bring this to their attention and the counter person was like okay we will bring it to you? Uhhhh the  cheese is suppose to be melted on my sandwich. So she eventually took my plate to fix it, all while my fries laid on the counter getting cold.... \n\nAND there was only one customer in the place besides me.... Why did you mess up my order? Why was evening so slow and inattentive? \n\nUggggg so disappointed ......", "author": "Shea G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-02", "description": "IM TOO HUNGRY, DISAPPOINTED  \u0026 ANGRY TO WRITE A LONG REVIEW. See pics. Suppose to be a chicken sandwich, but tastes like overcooked dog food. Hardly any meat. $11 of trash.", "author": "Aisha D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "I eat at this location very often. Great staff. Great food. And great atmosphere. The staff really goes out of their way to assist and make sure that the customer is satisfied. If you stop by, try the BBQ Bacon Cheddar burger... It's to die for. Also, place is always clean and neat.", "author": "Jatnna T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-24", "description": "We were in the area on Saturday afternoon.\nThis area had changed since I went to LIU.\nThis place is on the corner across from LIU.\nVery clean interior and has a comfy feel.\n\nWe had a BOGO.\nI got the new Yorker Crispy Chicken and he got the bbq, bacon cheddar grilled chicken with smash fries.\n$10.10.\n\nThe smashfries are very very salty and thin. But I do like that they use olive oil and rosemary.\n\nThe chicken is very thin for a \"smash\" burger. I think the term speaks for itself.\nBut I do like the spinach, lettuce and tomato in my New Yorker bun.\nBut the top of the bun was a bit buttery and greasy.\nThe place has a restaurant-feel with the manager going around asking how's the food.", "author": "Ilene E."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Smashburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "74 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JPa99LWTdgmCDcySlOcqnQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182221101"}