{"aggregateRating": {"reviewCount": 322, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "As a frequent guest, Smashburger never disappoints. From the service to the food to the cleanliness of the store, it's always great. I normally get grilled chicken sandwich Cyo with sweet fries or veggie Frits. Always AMAZING!!!!!! It's always fresh. Franny Cecilia and shanika are my favorite employees. I will always return.", "author": "DeAndrea J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-14", "description": "I tried smash burger to go and it was good. The meat was fresh and not to tough. I tried a French fry and it had sriracha flavoring. I liked my lunch and would come back again. Unfortunately they don't have bottled water.", "author": "Richard B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-22", "description": "Was a customer for over 3 years and now I am throwing away your menu. Tried to call and place an order (you know, on the phone; the way people have done it for decades) and was told I had to order online with some Door Dash  b.s.. not a problem but they want to tack on a $4.99 fee on top of the order and then have the audacity to ask for gratuity. Nope. Thank you internet! Way to ruin something else I used to enjoy!", "author": "D E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-02", "description": "Aside from the terrible service with Door dash I must complain about an item on their menu.\n\nSo I wanted to add french fries to my order...I'm a big buffalo flavor lover so when I saw buffalo fries at a $0.30 difference I said hey WHY NOT?!\n\nDON'T! IT WAS A COMPLETE JOKE...And a terrible ploy into getting someone to pay additional $$$ for a bottle of hot buffalo sauce to be sprinkled sparingly over my fries, something I could've easily done by requesting hot sauce on the side. I was highly disappointed, I tried to enjoy the black bean buffalo burger with blue cheese, but the sodium count was so high i felt like I was about to pass out! Get it together SMASH BURGER!!!", "author": "Cheryl-Ann C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-17", "description": "I've eaten at various Smash Burger restaurants many times. This one delivers, which is awesome. Ran into an issue a couple times when ordering in, but they were quickly resolved. Yesterday, I popped in and ordered the classic smash and an oreo shake. DELICIOUS!\n\n I don't get to eat like this often, so it was a real treat.  Especially,  since I had just left another establishment that failed my need for a burger \"fix.\"", "author": "Naktastic B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-29", "description": "I am a burger afficionado. The burgers here are just OK. I expected a lot more given the price but was a little disappointed. It was just a regular burger. It wasn't super juicy. It wasn't anything special. \n\nI found the limitations in ordering a bit upsetting as well. There are all of these choices in burger, but I'd definitely prefer to chose my own toppings and not have pre-selected ingredients be mandated.  \n\nI don't think I need to return and that makes me sad. I would go back to Roy Rogers. Five Guys can be revisited. Shake Shack can have my continued business.  Not this joint with their regular burgers.", "author": "Tulani V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-03", "description": "I'd like to make it very clear that the burgers here are comparable or even better than Shake Shack. The meat is well seasoned and they use fresh ingredients. The truffle fries are to die for!", "author": "Arielle D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-20", "description": "The food and service here is amazing! Hard to believe it's fast food! It tastes so fresh!", "author": "Melanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-21", "description": "I'm not usually that impressed with burgers from chains, but the Swiss mushroom burger here is great! The bun is a notch above other places, but the combination of ingredients is just harmonious. Avoid this place like the plague on Fridays lunch time, the line is just annoyingly long.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-29", "description": "Classic Big Smash with Haystack Onions:\nBurger - Nice size, juicy, somewhat bland. Bun was tasty, fresh.\nOnions rings - tasty\nAbove average chain burger 3.5 - 4", "author": "Al M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-30", "description": "Since starting a new job and at a new office this past summer, I've been trying to find new places to venture out in and try. I've been repeatedly hearing \"Smashburger\" at work that I decided to give it a shot.\n\nThe service wasn't too bad and I was much excited to try it when I got back to work. I wasn't too happy with the presentation of the burger and how sloppy it was. I ordered a mushroom swiss burger which wasn't too appealing and it's definitely not the best mushroom burger I've had. The fries I ordered were the smashfries that were mixed with rosemary, olive oil, and garlic. The fries weren't too great either.\n\nI don't think I will be returning to Smashburger too often. I have co-workers that are in love with this place or think its amazing, but I beg to differ.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-16", "description": "It's a burger with onions and bacon. I wasn't impressed with the piece in general, is basically a five guys except they only give you a tiny order of fries. Asked for medium rare and didn't get it. At those prices I write expect better", "author": "Michael L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-23", "description": "They smash meatballs into burgers! Must try the smashfries...fries with rosemary, garlic and olive oil...DELISH!!\n\nOkay so I went to a Yelp event and wrote a review about the food already, so this is going to be more about service and price.\n\nService:  Thursday night, 6ish. Long line, phone wont stop ringing, delivery boys are super busy. Kind of a long wait to place your order. I get the avocado chicken club, my honey gets the classic chicken. My doggie baby got an order of chicken tenders from the kids menu. They have outside seating which is fabulous for us and our morky Gia. After waiting to place our order and then waiting for our food, I open my chicken sandwich and there's no avocado. I go to the counter and the register girl tells me \"Oh well we don't have any avocado\", I'm like well i wish someone would of told me that when placing my order, she says \"I can give you guacamole?\" I agreed, just thought this all should of been discussed when I was placing my order. \n\nPrice: They do NOT do combos here, everything is separate. Burgers and chicken are 5-7 bucks, sides are 2-4 bucks, and fountain drinks are 2 bucks. This def adds up, so its not so cheap ALTHO this is not your average fast food and they have lots of selections even \"create your own sandwich\" but anyhow, I'm just reporting the price, you be your own judge....lol\n\nFood: food is fresh and tasty. lots of selections...burgers, chicken, hot dogs, veggie burgers, salads and shakes\n\nstreet parking only. they deliver.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-22", "description": "Perhaps I should have take a Picture of my DELICIOUS burger, but I was too busy eating it.  The spot is very nice. All it needs is a tv ad fill bar and it would be a major hang out spot. \n\nI got a bacon cheese burger that's hand made (they say that on the flyer) but you can tell by how the patty looks and the  texture that is was hand made and patted together. \n\nMore then the food and milk shake being good the people working there were soooo nice. Tai the manager, Carrie and Nicky the people taking the orders were extremely courteous and just nice.  Like IDk the service was just great really and truly", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-04", "description": "It takes something special for me to write a truly bad review. My first few experiences here were great but my most recent has me no longer ever going there although I work right by it. Ordered a chicken sandwich and was given a receipt with a check in if you don't have your food by xxx xxx time. The time was 45 minutes off which seems like a long time to wait for a sandwich but okay. I sat there the full 45 minutes and showed my receipt as everyone around me seemed to get food decently fast. They checked and said oh, we didn't start that yet. We will now. \n10 minutes later I got my sandwich so it took about an hour total for a chicken sandwich.  I'm not a person that wants free food ever but a \"I'm sorry\" or pretty much anything acknowledging a screwup beyond oh, we didn't out that in yet would have been appreciated. \n\nI haven't been back which is unfortunate because I think their food is good but multiple employees had contact with me during this interaction including a manager and no one even acknowledged the inconvenience.", "author": "Tommy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-28", "description": "This place mannnnnn.\n\nThese burgers mannnnnn.\n\nThe sweet potato fries with rosemary mannnnnn.\n\nOkay, okay I'm settled. \nThere seems to always be a crowd and it's a damn good reason for it. The burgers here are well prepared, the fries are mouth watering, and the service is prompt...except for this one girl (smh).\n\nWas introduced to this place by Cassie V. and I have yet to be disappointed. \nThe simple things matter to me when it comes to service, but when it comes to food...you gotta come correct, and they sure do.\n\nFood: 5/5\nService: 3/5 (yup that one girl with the attitude)\nLocation: 4/5\nPrice: 4/5\nAmbiance: 3/5\n\nCash and Credit all the way.", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-17", "description": "It snowed 2 inches and is all slush but none of the employees showed up to open. Ticked off to come on my lunch break with a broken foot in the cold to get some lunch and they are not open cause they have lazy employees. I hope they fire everyone of them. This is New York, this is not a snow day, schools open, trains running. Boo to all the employees at smash burger who don't know what work ethic is.", "author": "Joshua R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-16", "description": "My go-to burger joint around downtown Brooklyn!\n\nI always get the mushroom swiss burger. It's just so tasty, amazing, and filled with delicious sauteed mushrooms. I've gotten other burgers here as well, but this is my favorite, hands down. I've tried their regular fries, but wasn't very impressed. Maybe next time I'll try their smash fries. \n\nAlso they have an online order option. Definitely going to try that when I'm in a rush.", "author": "Vittoria L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-18", "description": "For the price and quality of the burger, I think you get a great deal. The thin fries are freshly cooked. Although as a first timer and reading the menu, I chose the New Yorker which was very good. It came with cheddar, garlic grilled onions, spinach, tomatoes and the peppercorn garlic aioli which does a great job complimenting the burger and giving it a juicer taste. Definitely coming back. Good customer service which is a huge plus and a finally a clean bathroom.. Lol", "author": "Kenny V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-06", "description": "My burger was delicious but I don't like being treated like a child. I went here for lunch with the bf on a nice weekday afternoon. We decided to sit outside and we received our food a short time later. The waitress forgot to bring my sweet potato fries so I asked her if she could and when she brought them over she said it wasn't on the slip so maybe the cashier didn't hear me, yet on my receipt there it was written clearly. I don't know why she decided to add her unnecessary comment with fires in hand like she was doing me a favor but I let it go and hope next time the wait staff is better behaved.", "author": "Frankie M."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Smashburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "74 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JPa99LWTdgmCDcySlOcqnQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182221101"}