{"aggregateRating": {"reviewCount": 322, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-25", "description": "I am pleased that this location has opened in my neighborhood.\n\nWe had a very positive experience at SmashBurger on the opening day and it seemed that everything was running very smoothly. There was a line around 130pm that moved quickly and the food was in front of us within 10 minutes tops.\n\nI had a classic burger that was a yummy, greasy burger with no frills or whistles.\n\nMy partner had the \"Brooklyn\" burger that he enjoyed. This local burger was served on a pretzel bun with swiss and pastrami on top. He said he wouldn't order it again for sake of a heart attack, but enjoyed it and finished every bite.\n\n1 star off because I didn't enjoy the sweet potato fries. I am a purest and feel that sweet potato fries should only have salt on them. The addition of the herbs ruined them for me. \n\nCute place and kind staff make this a welcome addition to a food challenged park of the area.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-06", "description": "It's hard not to get fat, walking by this place every day.  I mean, seriously, how do they manage to make the entire block smell like rosemary, bacony, cheeseburgery deliciousness?  \n\nThe burgers are, yeah, incredible.  The smash fries, to die for.  And their Cobb salad, one of the best around.  K, so I just ordered lunch from here again.  \n\n*PS - the staff members here are cool.", "author": "Holly C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "The food was pretty good. The staff acted like they were happy to see you. I appreciate your business there. If your close by and want a burger that this the place to visit. They are very reasonably priced and worth going too.", "author": "Alex S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-04", "description": "Nothing special here.  Standard burger and fries at inflated prices with the additional bonus of rude and slow service.", "author": "Stuart B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "chicken fingers \u0026 fries are really good much more natural than other fast food restaurants and cute seating outside and indoors", "author": "Eleni R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-27", "description": "When I first discovered that Smashburger was a thing I realized what a nice sweet spot it hits as far as burger niches go. The burgers are similar in flavor/consistency to Shake Shack at a fraction of the cost. There is much more variety on the menu compared to Shake Shack, and one of the burgers resembles the truffle burger at Umami Burger, also at a fraction of the cost. Lastly, there are Smashburger locations throughout the United States, such that even if I weren't in New York, I could still get it in Texas, California, or Florida if I were to move there. And Florida, for example, is somewhere that has neither Shake Shack, In-n-Out, or Umami Burger. So yeah, falling in love with this place will likely prevent the possibility of a \"long-distance relationship\" that i am currently suffering with In-n-Out as a native Californian who lives in New York.", "author": "Alan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-17", "description": "Came here yesterday after visiting the department of Health.\nThe staff were all so sweet, they are so warm and welcoming. They knew it was my first time so they told me where the menu were (@ the door) for future reference. I got the Spicy Baja, and my boyfriend got the Bacon cheddar, smash fries and an oreo milkshake (as per most suggested on yelp) they notice we didn't get anything to drink, so the nice cashier offered to give us a water cup.\n\nThe smash fries was delish! it's rosemary, olive oil and garlic . So flavorful, and the fries are extra thin which is new to me (think they're called shoestring fries). The burgers were all well cooked, and the perfect size. You really don't need the big size IMO. Oreo milk shake is what it sounds like. Which of course tasted amazing. Highly recommend getting smash fries and the milk shake when you're here!", "author": "Amey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-29", "description": "Love, the truffle mushroom swiss burger. Cant get enough, sweet potato fries are the only ones for me here, the smash fries too greasy and regular fries just too bleh. Great oversized shakes too.", "author": "A M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "I went to Smashburger on Friday the 18th and it was a great experience.  I walked in saw a line got discouraged but that changed immediately.  This lady is new her name is Lori she was very pleasant and to the business my hour lunch was not rushed like it usually is when i come here.  Thank you Smash for the changes it was needed!!  My food was brought to the table and was very good", "author": "Sandra J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-11", "description": "So every now and then I take a seminar for my profession at the Brooklyn Hospital.  Lunch time is generally every one for themselves.  I've eaten here a couple of times and the place is pretty much great for my lunch needs.  The sandwich menu is short enough not to be daunting to get through but with enough options that I can get any hamburger or chicken sandwich that I desire.\n\nMy go to is their grilled chicken sandwich.  It's served on a multigrain roll with romaine, tomatoes, red onions and pickles.  I generally tandem this with their sweet potato fries.  The food is very tasty but the chicken is usually dripping with juice and oil from cooking, even when I ask for it dry... It still comes out like it took a bath prior to being served.", "author": "Jared K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "I love Smashburger because they have awesome burgers and milkshakes. \n\nGet a burger (bbq or new yorker is good)\nGet a milkshake (My favorite is oreo)\nDon't forget the sweet potato fries.\nAnd you're all set.\nThey come to you so just sit back and relax.\nYou're welcome guys!", "author": "Joanne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-17", "description": "Smashburger has solid burgers and very attentive service.\n\nIt's not a sit-down place; you either order to go, or order at the counter and then they bring you your food. But we were greeted energetically by several servers when we came in, not in an obnoxious \"HELLO AND WELCOME TO RED LOBSTER!\"* fashion, but quite politely. \n\nThe menu was impressive - a dozen or more burgers and chicken sandwiches, and of course the lists of toppings you can add to any patty to create your own delicious burger. I had just planned on getting a normal burger, but when the woman working the register asked if I'd like an extras, like, say - onion straws, or a fried egg, I went for the fried egg. She also offered to put fried pickles on the burger, but we had already decided to get an entire side order of pickles, because, well, why the hell not.  My boyfriend got the Brooklyn, which came with pastrami on it. I especially liked their choices of buns - brioche, pretzel, wheat, none. The brioche bun was delicious.\n\nThough I was swayed by the cashier to get that fried egg, I couldn't really taste it on the burger, and my boyfriend said the same about his pastrami. All the same, good burgers.\n--\n*I haven't actually been to Red Lobster. Ever. I've just seen the commercials.", "author": "Claire M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-26", "description": "I came here because of the $5 promotion they were offering on their website, too bad they did not honor it. \n\nHowever I ordered a burger nevertheless, and to my surprise it was a good burger.  I order the avocado burger and I was surprised by this burger because they \"smash\" it.  To my knowledge, you shouldn't smash meat to much because it destroys the fibers and make it rough. it was juicy and tender.  It was way better than I expected because I did not hear much about this place.  This place has an diner feel as well as a burger joint feel to it.  The cooks place the food on a stand to be brought to you by the staff, yet the red and white tiled walls shine.\n\nIt is definitely a better value than a shake shack burger because of the sheer size of the larger burger.", "author": "Thomas F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-02", "description": "YUM YUM YUM. \nSpicy Baja. :) \nLove this place. Was pleasantly surprised that they served the burgers to us at our table! Hahahaha", "author": "Lily N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-13", "description": "Came in here to catch a late night bite. The food was good but one of the associates has a nasty attitude. Shows all over her face which just ruined the experience.", "author": "Kenny R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-05", "description": "I don't eat meat, yet I love this place. Why? \n\nOne simple reason....BLACK BEAN BURGER. Do you hear me, vegetarians? This is one of the best veggie burgers around. It's flavorful, big and seriously delicious. You can have it dressed up or down, with avocado, cheese, fancy sauces, different kinds of buns. And served with fries or fried pickles (umm, YUM). Terrific. \n\nIn the sea of Brooklyn burger places, this one stands out...Mmmm, black bean burger.", "author": "Shira R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-27", "description": "I ordered from a food delivery site and everything, and I mean EVERYTHING, from my order was completely f*cked up! The burgers were not prepared properly, they looked like they had been haphazardly thrown together by someone in the middle of a skydiving jump. They didn't accommodate my special requests and also gave me a regular fry instead of a large. Half the order was missing completely - it's like they didn't even read the order!", "author": "Kathryn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-22", "description": "Smashburger was a college favorite of mine. The bacon BBQ cheddar with Smashfries was my absolute favorite. The milkshakes ares delicious also!", "author": "Melanie T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-19", "description": "In my continual effort to transcend the NY infatuation with Shake Shack, I ventured to Smashburger over in Ft. Greene. Definitely nothing special, I could have hit up the 67 Burger closer to my apartment and been just as, if not more satisfied. \n\nI had the Chedder Bacon BBQ Burger which aside from the sauce, tasted like just about any burger...made worse by the \"haystack onions\" or what not, which were cold ie. almost inedible for whatever reason.The Rosemary Fries were of the thin cut variety and nothing to write home about. Glad I tried this place to cross it off my list, but not running back anytime soon...or ever.\n\nTakeaway: Walk a little further, go to 67 Burger.", "author": "Sonika H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-06", "description": "I don't get all the hype about smash burgers but I'm not a burger enthusiast. Been here a few times before I've had burgers ( pissed off about lack of turkey burger options ) I've had chicken sandwiches but I have recently cut back on eating meat so today I ordered the black bean burger. Wasn't sure what I would be getting when I ordered but was pleasantly surprised. It was a tad salty but overall good. I went for the create your own option with cheddar, red onions, lettuce and tomato. My kids had Smash kids meals they enjoyed it. I'm not a fan of the fries. The super skinny shoestring fries...not a fan! I can do without their food. I'm good", "author": "Cieanne E."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Smashburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "74 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JPa99LWTdgmCDcySlOcqnQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182221101"}