{"aggregateRating": {"reviewCount": 322, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-14", "description": "Slow phase worker , bad customer service and 25mins wait for a burger to go . \n\nNever again", "author": "Peter S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-30", "description": "Location listed as closing at 10pm... I got there at 9:32 and the doors were locked. To add to this mess the manager or someone who appeared in charge simply gave me the hand across neck symbol to tell me they're closed. Real professional. Not being open when you're saying you're open is a shame and a more than valid reason to no longer frequent a chain like this. Sad to see them failing in this area as their food isn't too bad.", "author": "Noah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-29", "description": "Hands down, while Shake Shack is my favorite burger joint Smashburger is an exceptional gem and I'm so happy it's in my neighborhood. (There's only two locations in NY - both in Brooklyn!) \n\nI am going to be honest - I am not the biggest fan of the burger here. However, the amazing thing about this place is that the burgers they serve can also be made into a salad - same ingredients, add some fried chicken and BAM you've got a plate of (somewhat) healthy, delicious goodness. Also - the portions are big. \n\nThe fried chicken they serve are cutlet style with the perfect texture chicken that are juicy and tender. I just ordered a salad today for lunch.\n\nSo, food is bomb and so is service. I remember one time I ordered two orders with a BOGO coupon, and made the mistake of requesting eat in knowing one item was going to be for to go. The girls quickly accommodate my request to wrap it up, with no questions asked. They also have mistaken my order, and gave me a chicken burger instead of a beef burger. They apologize, and offered to replaced my order. TBH, I didn't even realize there were a mixed up since I solemnly ordered their burgers, but the fact that they realized and own up to it and act upon it really made my day. That was definitely a first for me in a fast food join. Go Smash! \nPRO TIP: If you sign up for their newsletter, Smash will email you coupons for BOGO, and often times $5 off your order of $12.", "author": "Jenny L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-01", "description": "So this is my first time eating here at 4:30 since I work close by and I make my own burger and get fries and ask if tehy sell water. They give me a empty cup great. I press the water tab under the lemon juice and liquid comes out and I tasted it and it had some lemony after taste. So I sit down and my food comes. The dark skin girl comes up to me and says \"is that water, its not water its lemon juice. You have to pay for it\" i told her there was a lemon after taste and shes telling me its not water, like there was a huge difference in how lemon water and water looks. (The cup was clear red) so now I got up spilled the \"lemon\" juice and got water again... honestly never coming back here again.  Fries were soggy and burgee was subpar.", "author": "Weiwen L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-30", "description": "Saw the triple double burger on tv so i decided \nTo give it a try.. It was small as hell and meat was dry and hard. I will never eat one agian. But the grill chicken and bean burger is good.", "author": "David S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-20", "description": "Favorite place ever. I even asked for a gift card from my sister for Christmas hahah. I go here every day, same order every day. Jalepeno Baja crispy chicken, fries and chocolate Oreo shake. Amazing! The staff is also really great. They're really kind. I go to school across the street so it's also convenient  but found myself craving smashburger when I'm home on the weekends so much that I ended up making the New Hyde park location my go to on the weekends when I'm away from the Dekalb location. Bomb.", "author": "Diana G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-05", "description": "I paid $1.50 extra for one slice of avocado. Workers are not friendly. Service is slow and understaffed. Ordered large burger and when i got it the portion was small and cold", "author": "Jonathan A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-02", "description": "Horrible. I've never seen a fast food restaurant run so terribly. This is downtown Brooklyn for Pete's sake! People expect their orders to be precise and fast! The slowest fast food ever. I'd be curious to know what kind of training the employees underwent because the employees did not work as a team. If management doesn't get this place in order they won't be around much longer.", "author": "Ujamma D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "Best Blackbean Burger Ever!!!!! I really loved this burger and I go back every time I can. Thier shakes are amazing too- I tried the chocolate Oreo one and it was awesome! Do recommend against Shake Shack and Bareburger.", "author": "Sana H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-08", "description": "3 Stars for food\n4 Stars for service\n\nSo this burger is ok - was good. The place was fine. I think perhaps this burger was over hyped to me so it didn't really live up to that..\n\nGot the classic because I figured that should be the first sample and it was fine - the egg bun is nice and the honey mustard was different, but I wasn't scarfing the burger down like it was the best I've ever had. The husband got a chicken burger which he said was good, but he wouldn't go out of his way to get it. With that said, if he was near one, he said he would get one. The smash fries were very greasy and shoestring like - which are not my favorite, but were good.\n\nThe location seems nice and the staff was extremely nice. The husband was sitting here eating while I was getting my hair done and when he was done, he was just watching some videos on his phone and one of the staff came by and helped clean his area. He said he was really nice.\n\nI would give it another try with another flavor combo just to see :)", "author": "Melissa N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-31", "description": "Two and a half stars for a burger with a soggy bun and what was probably the most apathetic staff I've encountered in a while. \n\nI stopped by here to pick up a quick dinner in the evening, and while I understand emotional labor and I don't expect to be greeted with a smile and a hop, the cashier/person taking my order was on her phone for a good two minutes while I just waited there awkwardly. She then proceeded to ask me for my order in a tone that suggested utter displeasure.  I ordered the grilled chicken New Yorker burger (tomatoes, spinach, garlic aioli) and swapped out the mayo for the smash sauce. \n\nMy burger took about ten minutes to be prepared and I was given no instructions as to where I should pick it up from. I spotted a counter where they appeared to be placing the to go orders, and so I stood there until I was rudely informed that I'm allowed to stand there. Why not just put a sign there to that effect?!\n\nThe burger itself was utterly mediocre, and only a slight improvement over the McDonald's artisanal grilled chicken burger. I definitely could not taste the aioli or even the sauce. On the plus side, the chicken was juicy and grilled well. \n\nThe next time I want a calorie overload, I'll take my business to shake shack. Save the attitude, Smash burger; your food really doesn't justify it.", "author": "Shivani P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-07", "description": "Every time I order delivery from here I have an issue. Pickles and onions in containers that are half full. Wrong type of fries. Everything is cold. Their service has definitely decreased as they gained popularity.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-27", "description": "First time I tried this I went there with my ex at this exact location and the experience was amazing. We never been there so the cashier gave us the menu and told us take our time to pick what we wanted plus she even recommended a few things to us. After we ordered the cashier gave us free cups for drinks. The food didn't take long plus it was well done and delicious. I would definitely come back again!", "author": "Mara F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-28", "description": "I came here yesterday at around lunch time and was pleasantly surprised there was no line. This foreshadowed the entire restaurant and I came to know why. The staff was rude, especially the manager in red. After handing the cashier the money she miscalculated how much I gave her and just dropped everything in the box. When I told her about the wrong change she seemed nonchalant and didn't care or bother to fix it. Fine, it was only a few quarters so I let it go. \n\nI ordered the classic burger which was hella Small. I have small hands and the burger was even smaller than it! The taste was meh, really flavorless. Then came down to the smash fries which the manager pissed me off for. She came out with my wrong fries, and when I let her know, all she said was \"okay\" and didn't bother to fix it. Didn't let the kitchen know to start a new order, nothing at all. What a pathetic worker that shouldn't be manager if she can't even notify the staff and fix her error. \n\nThe only thing saving this place was the fact that the smash fries was okay. \n\nThe McDonald a few blocks up was even better than this place. Definitely don't recommend.\n\nIn short:\n- Rude and uncaring staff (especially manager)\n- Long wait\n- Small burger for the price \n- Small trash cans\n- Staff can't count money\n- Okay fries", "author": "Xin Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "My second review and it still hasn't changed. They deserve every star because there food is good and the service is good as well. Everything on the menu here is so bomb including the milkshakes. I just hate how they're so many calories though because I can't get it as often as I'd like to. Anyways, there burgers are good and you can even create your own burger which is what I like to do because theres just so many options that I just prefer picking out what I want in it. My go to are there salads because they're sooo good and healthy and it doesn't make you feel like you're eating a salad. Just don't overdo the dressing because those are loaded with calories. What made my visit most memorable was a worker named Nikki. She's so nice and understanding of your every request. I wish all fast food workers are like Nikki because there are some rude workers out there. I come here about twice a week and I'll definitely be coming more often!", "author": "Ada C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-11", "description": "I popped by here for a quick dinner on a Friday night while visiting my friend in New York. He lives in the building next door so it was perfect.\n\nThe cashier was very friendly and helpful. I decided to order the truffle mushroom Swiss burger with a side of sweet potato fries. It was around $10 which I think is a really good deal for NYC.\n\nThe burger tasted fresh and the fries were awesome. I had heard mixed reviews about Smashburger but personally I wasn't disappointed. I would go back again for sure!", "author": "Gwen B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-01", "description": "Basically lived off of smashburger last year as a 3rd yr medical student. It was cheap with the coupons and fast. Came here bc I had a coupkn emailed to me. Sign up for the smashclub to get exclusive updates, coupons, and free milkshake on your bday!\n\nORDER\n- Baja cobb salad: I didn't get any meat bc I wasn't really that hungry. The jalepenos aren't that spicy bc most of the seeds were gone. Whoo!!\n- Classic burger + smashfries: Bf ordered this and it was way too greasy. We know how smashburger is, and this isn't normal at all. Even the smashfries container was greasy. What's going on in the kitchen?\n\nOverall, location is great bc it's right next to the hospital where I'm working. It gets pretty busy here with all the high schoolers and LIU students. Register lady was pleasant when taking down our order. Timing to get food was reasonable on a weekday around 4pm. Just too many oblivious students loitering around and taking up space when they aren't ordering anything. Kind of disappointed with the delivery of the burger and fries, but hopefully it will only happen once. What sucks is that the reciepts here don't have survey coupons to save $$ for future visits. Ughh!! I guess when I run out of old coupons to use, I'll be frequenting here less often.", "author": "Nicole T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "This is one of the better smashburgers I've been to. They get a little sloppy sometimes with the ordering procedure/lines but for the most part it's fine. I think the burgers here are very good but they don't quite get to the great level for me.  Fries and salads are decent. Have never tried their milkshakes but will try one on a summer day.  However, the food here is definitely better than Mcd's or BK so if you don't mind waiting a few more minutes I would recommend this over those places. If you are in a bit of a time crunch you can always order ahead of time online.", "author": "Ladislao B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-01", "description": "I tried smash burger for the first time today and it's was okay , not the greatness . I don't see the big hype about this place. Milkshake was watered down. I'm not gonna write names but that's boy seem like he didn't cared about my milkshake. Burger didn't come , how I had asked for but overall ehhh it's okay \nIt's fine but I just know I'll never go back .", "author": "Janelle W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-25", "description": "Grab myself some burgers here before going to deliver a package to a friend of mine. As usual, the service speed was normal. Not fast and not slow. The burgers I had here were good. I ordered two by the way. The fries that go with it, I brought it along for the ride.", "author": "Ray B."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Smashburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "74 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JPa99LWTdgmCDcySlOcqnQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182221101"}