{"aggregateRating": {"reviewCount": 322, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-27", "description": "Absolutely love Smashburger!!! The best thing to happen to Brooklyn!!! Shake Shake doesn't even come close!", "author": "A D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-25", "description": "It was okay. I was not too keen on my burger's taste. Also I felt a bit unwell after eating there.", "author": "J P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-19", "description": "Folks, your budget friendly burger joint has arrived!!! \n\nThe burgers here are awesome!  You can make your own burger with any number of cheeses, add-ons, buns, and meat.  The beef is really fresh and delicious.  And the choices for sides are AWESOME: FRIED PICKLES WITH RANCH!!!  So delicious and not dripping in grease!!!  They also have side salads and sweet potato fries for those of us watching calories.\n\nFamily friendly, all ages fun.  The place is clean, including the bathroom.  The employees are friendly and so gracious.  Love it!!!", "author": "Dee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "Here for the first time. They made an extra Oreo milkshake and gave it to us. Yessssssss", "author": "Ceanne W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-08", "description": "Just okay and handily bested by five guys and shake shack. The shoestring fries were overcooked and the serving size skimpy. The burger was outrageously over seasoned (Baja burger, I believe). The service was also just ok, I showed up well before closing yet had a team of people cleaning everything around me making me feel rushed to leave.\n(Post meal review, dined there 7/6/2013)", "author": "Mike G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "What a pleasant refuge from the cold Smashburger turned out to be.  It's a great \"fast foodish\" type restaurant where their variety and quality of food is just terrific.  Being that it was 20 something degrees outside, I unhesitatingly went straight for the Baja burger.  This thing was packed with fresh (not pickled) jalepenos that set my mouth on fire pretty well which is exactly what I needed in such chilly despair.  The guacamole in the burger somewhat tempers that spice and adds a much needed avocado flavor.  \n\nThe burger itself is very juicy and cooked perfectly.  The burgers come in 3 different sizes and I opted for the regular one which I still believe is the best option.  If you're hungry for a big one, you might as well get 2 different regular ones to try the different varieties.  The Smashfries are good but I honestly thought the regular fries looked like they would be even better.  They also have sweet potato fries and cheese/chili fries.  Variety, variety, variety.   Chocolate shakes looked incredible and they give you those metal container refill cups which is something you won't find in Manhattan.  You also will get free refills on sodas here if you can believe it.", "author": "Dan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-01", "description": "I loved it here. The food came quick to our table and it was delicious. Their burger meat taste very fresh and their fries are also good.", "author": "Gissel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "This place is awesome. Burgers are great and there SMASH fires a one-of-a-kind! Check this place out for sure!", "author": "Angel M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-11", "description": "The food wasn't that great to me. My burger was to salty for my taste. The sweet potato fries was good. I also tried the fried pickle which was also to salty for my taste.", "author": "Clarice R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-20", "description": "Friendly service, high quality burgers and fries, clean and safe environment. Come here instead of Five Guys if you have a burger craving.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-08", "description": "Yuuuuum!  I'm so happy Smashburger opened right near one of my jobs.  Stopped in today with a friend after hearing rave reviews from co-workers.  I was so overly excited (and starving) I basically stuffed myself silly.  Heres the better than 5 Guys, Shake Shack, Good Burger\n\nI ordered the Spicy Baja burger - pepperjack, guacamole, chipotle mayo, jalapenos.. It was really good, and spicy which I loved.  Burger was cooked how I like it, a little more on the medium well side.  Totally fresh ingredients, was ready in about 7 minutes.  The smashburger fries were good, rosemary and olive oil, although I was surprised they were skinny, like McDonalds fries.  I imagined a signature fry would have some bulk to it with all that flavoring, but they were still good.  Finally, I overdid it with the beef chili - I love chili and I had to try it.  It came covered in shredded cheddar and jalapenos - yum!  Nothing to knock me off my feet, but on a cold rainy day its the perfect side dish.  Not big enough for a meal.  All of that and a drink for $14.  \n\nSince they just opened the place is looking marvelously clean, with lots of indoor and umbrella-clad outdoor seating.  Service was great - everyone is still trying to get in the swing of things - but we didn't have any issues.  Is it better than Shake Shack, 5 Guys, Goodburger, Lucky Burger?  I think its a big contender, see for yourself.  You can easily get out of there with a great burger, fries, and drink for under $10 - awesome.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-12", "description": "Good, but doesn't hold a candle to shake shack :(", "author": "Jaime G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-20", "description": "Their burgers are very greasy, but not as greasy as 5 guys or shake shack. \n\nTheir chicken sandwiches are good.\n\nHowever, they get an extra star for being such pleasant employees.", "author": "Yippy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-02", "description": "I am not a burger and fries person. However, every time I pass by Smash Burger, the smell in the air is so good that I can hardly control my feet. The classic smash is juicy. Nonetheless, my favorite is the smash fries, greasy but tasty!", "author": "A G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-04", "description": "I've been here several times. I've had burgers, grilled chicken sandwiches, fries, fried pickles, and the iceberg lettuce salad.\n\nI would give this place a higher rating except for the fact that everything i have is drenched in oil. their burgers and even the grilled chicken is dripping in grease. not only is it disgusting, but it is totally unhealthy. \n\nI heard their shakes are pretty good. but it's pretty easy to make a good shake, especially if you're using Haagen daaz ice cream, or any ice cream for that matter.", "author": "Emmanuel I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-09", "description": "I've had the Chicken BLT, New Yorker, Smash fries and Veggie fries. All were delicious although the veggies fries could have come in a bigger portion. I can't wait to try the black bean burger next time.\n\nAlthough I am a big Shake Shack fan, I think the ingredients and flavors are fresher at Smashburger. 5 stars!", "author": "Tiffany T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-05", "description": "4 words: Five guys is better.\n\nThe burger was bland and overcooked. My egg bun was nicely toasted and the toppings were fresh but surprisingly tasteless. Everything needed salt. I appreciated the variety of bun, topping, and sauce options, but nothing tasted amazing. The cheese on my boyfriend's burger was not melted which sucks.\n\nThe \"smashburger fries\" were disappointing and tasted like a handful of dried rosemary was tossed on some mcdonald's fries.\n\nOverall it's a fast food burger one step above McDonalds. This place is totally over hyped. It's not terrible but definitely not worth a trip out of your way.", "author": "Lila C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-30", "description": "Personally, I don't know what all the rave is about this place. My co-workers were constantly breaking their diets to splurge on smashburger but I think there are much better options for breaking diets.\n\nI've tried a burger and a chicken sandwich. Both times I found it to be soggy and kinda gross. \n\nI have no reason to ever return.", "author": "Arielle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-10", "description": "Downtown Brooklyn is going through what many have called a burger boom.  In a matter of months, the Five Guys opened in MetroTech, the Jake's Wayback on Livingston, the forthcoming Shake Shack on the Fulton Mall and the Colorado-favorite: SmashBurger.\n\nB. and I went to Smashburger on opening day to check it out.  All in all, I'm a fan. The burger was good.  The rosemary garlic fries were great.  Additional pluses were that they offer beer and wine, make a damn good milk shake, and offer a bunch of side options: fried vegetables, sweet potato fries, fried onions, among others.  There are chicken options in addition to the burgers, too -- and, I think, salads.\n\nWhile B. and I debated over which burger was better (he felt Five Guys' burger alone was better), we both agreed that this is our preferred place on account of the other things you want with a burger: fries, drinks, etc, being LEAGUES better than five guys.\n\nNow, when Shake Shack is open for business, I might sing another song... but knowing that there's a place down the road where I can get a good burger and a shake and not have to wait on line for a year is a very good thing, indeed.", "author": "Katie Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-11", "description": "It's perfect if you want a delicious fairly priced burger and milkshake. The staff was very polite and the service was impressively quick.", "author": "Christyn T."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Smashburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "74 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JPa99LWTdgmCDcySlOcqnQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182221101"}