{"aggregateRating": {"reviewCount": 322, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-30", "description": "Friendly service, but ultimately the gimmick of the smash didn't make it a better burger.  I tried the Brooklyn style with pastrami, swiss, pickles, and onions on a pretzel roll.  I thought they would be big flavors, but they fell a little flat.  There are many other burger chains, and I'd rather try others than come back here.", "author": "Danielle F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-21", "description": "I love smash burger! Ordered online for pickup at this location. Upon entry you are greeted by the biggest flies.  first time at this location (note to self: never order online unless you know the condition of the Resturant) flies do not belong in restaurants period.", "author": "KT T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-13", "description": "The burgers here are slightly above average.  However the price is really high.  I am not the type to spend a lot for a meal when I can avoid it.\n\nI can see the hype for this place.  They have some creative and delicious sounding combinations that seem to evaluate the food.  The food is also well presented.\n\nThe employees were nice.  One of them remember me after one visit.", "author": "Charlie Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "Really excellent service! Everyone is so sweet- the servers check in and make sure everything is okay- which is amazing considering how busy they are. A wonderful blend of both efficiency and courteousness. I hardly had to wait for my food and it was delivered with a smile. I only wish there was a better way to leave tips for the staff- I didn't see that option on the receipt. A tip jar would be great! Will come back for sure-- good food + service.", "author": "Marie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "The staff is very quick friendly and knowledgeable here. Very clean. Food is always correct and delicious", "author": "Kevin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-23", "description": "My co-worker recommended this place to me, so I came here during my lunch break. This is definitely one of the better burger places I've been too. The smash fries were amazing. I couldn't stop eating them. The shakes were perfect. The perfect combination of creamy yet thick. I had the New Yorker which was pretty good. The onions kind of over powered everything else but it was still a good burger. I'm definitely coming back here to try all their other burgers.", "author": "Temp W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-03", "description": "This is my first time here and I must say I am pleasantly surprised. I ordered the Avocado Chicken Club. This sandwich came on a wheat roll with your choice of grilled or crispy chicken (I got grilled) green lettuce, tomato, mayo, Applewood bacon and avocado. \n  The chicken was tender and seasoned just right. The roll was soft and delicious. I would definitely come here again. I also indulged in vanilla milkshake which was far and away better than Shake Shack or Five Guys. \n  Highly recommend Smashburger! Next time I'll actually try the burger and fries.", "author": "Jason C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-14", "description": "Fast service. Girl who waited on us was VERY friendly. Food was delicious.", "author": "Brooklyn R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "The service was pretty average, but when I came here for the first time today, the burger and fries were absolutely amazing. I didn't think that it would be anything special, but this might be my favorite burger place.", "author": "Jonathan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-27", "description": "If I were able to give no stars, I would. Went in today after speaking with the manager about a wrong order, after vowing never too return to the place..... Now I know I will NEVER return... The manger Hector had the most lack of customer service I've ever experienced probably in my lifetime so far. He actually stood in the middle of the restaurant and refused to replace fries that the restaurant sent to my home cold and inedible. Really??!?!?you are berating me for four dollar fries? No worries.... My hard earned money will be spent elsewhere", "author": "evangeline j."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "I'm addicted to their Bacon Avocado Club Burger and sweet potato fries. My daughter loves The BBQ Bacon Cheddar Burger. The staff has always been friendly and the wait for my orders has been reasonable.", "author": "Kimberly J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "I had the classic smash burger with a side of sweet potatoe fries.  Lets start with the burger. It was cooked perfectly. It was so juicey,  and tasty. They put just the right amount of ketchup and mustard. It wasn't greasy at all. The sweet potatoe fries were sweet and delicious. I would only recommend to get here early. This place is a mad house during lunch time.", "author": "Joseph M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-21", "description": "This is probably the best burger joint in NYC!! The staff is super friendly and the general manager always keeps his store super clean. I don't know about others smash burgers but this one has good quality food and the atmosphere is so chill. This is a great place for burger lovers.", "author": "Raheem E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-04", "description": "I had a horrible experience at Smash Burger, the manager Hector is rude, he don't know how to speak to people, I will never spend anymore money at smash burger", "author": "Tiffany J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-12", "description": "First time at a smash burger ever! I ordered the truffle mushroom burger and it was absolutely amazing! Hector was welcoming and attentive and I appreciated the service and meal! Cant wait to be back!", "author": "Jacklyn D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-15", "description": "I went here a few months ago, and it was pretty good for he price. Compared to shake shack, it was a little more expensive, but the meal was much more satisfying. I liked the atmosphere of the place and it looked really nice.", "author": "Shahreear N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-09", "description": "All the varieties of fries are really good and the milkshakes will truly bring all the boys to the yard. :)", "author": "Brandon Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-16", "description": "Was well worth the trek to have some amazing burgers and some great shakes!  Thanks to Yelp and Smashburger, I got to indulge on all the burgers on the menu! Because of this, I've gone into the state of a food coma and may pass out at any time while writing this review.  \n\nAll I gotta say is the Brooklyn burger was the best!", "author": "JT T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-26", "description": "Even though this is a chain burger restaurant, they still are able to highlight what a burger should be about, the patty itself.  The meat is well seasoned and stands well on its own.  The burger does NOT need any special toppings or secret sauces to make it taste good.\n\nThat is about all that is good about smashburger.  Their sweet potato fries were very plan and unmemorable.  The smash fries were very aromatic but tastes like your average basket of fries.\n\nIt is a tad pricier than your average burger joint, but they usually have specials if you sign up for their mailing list", "author": "Francis C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-17", "description": "Ate here twice...satisfied every time.\nBurgers are yummy!!!\nShakes are good too.    :)\nThe customer service gets a: Thumbs Up!", "author": "Lee Lee A."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Smashburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "74 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JPa99LWTdgmCDcySlOcqnQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182221101"}