{"aggregateRating": {"reviewCount": 322, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "Smash is fantastic and a smashing addition to the neighborhood! With freshly made burgers a huge and healthy variety in burgers, hot dogs and salads you can get what you want for a great price and feel full. \nI first tired smash burger at jFk airport in the international terminal and totally loves it.\n\nGet the Smashfries they are so amazing and thin and the rosemary garlic oil makes it perfection.\n\nOh yah and they deliver! You can always call ahead to pick up and enjoy at Fort Greene park or sit on the sidewalk patio with your dog! Thank you smashburger to raising the bar and keeping the costs affordable!\n\nI get the kids burger or the Brooklyn burger.\n\nHaven't tried the shakes yet but heard they are out of this world.", "author": "Yvonne K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-10", "description": "Fries had potential but they were cold. Avocado looked brown and days old and was displayed proudly on my open Avocado Club Burger... why? Bacon in sandwich was rubbery and not good at all. Credit card machine broke while I was paying so I was not able to get a receipt, although this isn't the place's fault they did not handle it in a professional manner in the least bit.", "author": "Natalie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-21", "description": "Yes, it's a pretty large chain... but the food is actually pretty good and this location is very well-run and extremely clean.\n\nThe vegetarian burger is black bean based and laced with Mexican spices.  Delicious.  The only downside is that the specificity of the patty flavors makes it not too flexible topping-wise.\n\nOne thing of note about this particular location is the service.  Everyone we interacted with was extremely friendly and service-oriented (which I find to be an absolute rarity in Brooklyn).  You can tell that the staff must have supportive management and that they're having some fun.\n\nSmash it up!", "author": "Kevin F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-21", "description": "I love the idea of the establishment and the interesting menu. \n\nWith my first time walking in, the manager greeted us and explained the entire menu and process of how things worked. He was really a people person. \n\nFor my very first order there, I got the small custom smash burger with the sweet potato fries. I don't think this place understands what small means. It was an adequate sized burger. I was very happy about that. The fries were made with rosemary, olive oil and garlic. A few bites were great. After a while, my stomach wasn't agreeing with me. I will still get the fries, but I just have to suffer afterwords, because they are pretty good. \n\nMy second visit, I ordered the small wedge salad with a side of fried pickles. The salad was great for its price, but if they can use less red onions it would be perfect. The pickles, on the other hand, were salty, soggy and just wrong. I gave those away to coworkers. \n\nOverall, I will come back, so I can try the rest of the menu.", "author": "Anikha R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-21", "description": "Last night after work we stopped in at Smashburger 15 minutes before closing for a quick dinner and I must say I was pleasantly surprised.  Smashburger is clean, the service is quick and friendly and the food is A-OK.  We ate outside which was a definite plus except for the noise which we assume was from construction above and not Smashburger's fault and the fact that burgers and fries are not the best thing to eat 1/2 hour before you go to sleep!\n\nI actually would like to give Smashburger 3.5 stars.  We thought our hamburgers were good though it would have been nice if they had asked us how we wanted them cooked.  We were not a fan of the rosemary fries (personal taste of course) and I recommend you start with the regular fries on your first visit and then expand to their specialty items.  That said, the fries themselves while not anything special, are well made.\n\nI thought the bill was a little bit high but I guess that is the story almost everywhere these days.  So in short...a step up from fast food and a definite thumbs up for a quick meal!\n\nUPDATE: I have been back a few more times and their burgers were better than ever and the staff was even more friendly and accommodating. I have been converted - 4 stars!", "author": "Neil B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-13", "description": "Great food \u0026 a friendly staff.  Gets packed at lunchtime and is a little smaller than the location in Long Island but they do pretty well for themselves here.  I saw a great vibe among the employees; you can tell they are treated right \u0026 enjoy their jobs.  We liked seeing that since good treatment seems to be in short supply in the service industry, especially at restaurants.  The air conditioning isn't booming here but they do have it so that's a good thing.", "author": "Monica T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-17", "description": "I dont do fast food. \nBut after an intense sampling of this place I decided to come back and bring my family. We spent the earlier part of the morning building up an appetite in the hot sun. Wanting some place cool, with food for affordable prices, I suggested Smashburger. \nI have always been loved but this suggestion might have bumped me up in the \"favorite child\" category. There is something for everyone here. \nOrdering is quick and easy. You can customize a burger or order one of smashburgers suggested combos. The hardest decision will be ordering a regular burger or the bigger one. I chose the regular size burger with the Classic Smash which is a hat tip to the Big Mac. It was cooked perfectly with a delicious caramelization on the patty that you cant get at any other fast food joint atop a texture-tastic bun. We split fries that were hot and crisp. \nTheir milk shakes are sinful if you can tolerate dairy. \nFor a fast food joint, this place is the shit.", "author": "Monique R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-24", "description": "Sadly this place was just awful!! Burgers  and 2 sides of fries  just over 60$ and everything was just so cold:/ there was literally 1 crummy goat cheese crumble on my burger with a cd disc like price of meat... I'll be sticking to shake shack for a quick bite", "author": "Brooklynite L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-02", "description": "After seeing reviews for this place as very positive I decided to give it a try for lunch today. I am a big fan of 67 Burger and was hoping for something similar....not the case.\n\nWhile the person who was helping me (Ebony I believe) was incredibly warm, helpful and friendly (service would have been a five). The food leaves something to be desired...a lot to be desired actually. I was super excited about the fries which were actually cold and greasy - i ate one as soon as I walked out with my to-go bag. I should have brought them back but I was in a rush. The veggie burger is also cold, and the order was incorrect.\n\nNeedless to say, I'm sticking to 67 Burger.", "author": "Olivia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-06", "description": "It was pretty good the burger, I got a avocado burger and it was pretty juicy but the burger was kinda messy without the wrapper thing to hold it in place so the avocado was slipping out everywhere and made a mess. Also the fries was pretty thin that's why shakeshack is better. The fries are thicker and the burgers are more neat and stays in place when eating.", "author": "Calvin F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "I went back today for another chicken sandwich and to try a strawberry shake. \n\nThe sandwich was as perfect as the other day and the shake was...well...comparing a Haagen Daz shake like you get here with the ice milk, air and chemical abominations you get at other fast food places is like comparing Sonja Henie to Tonya Harding. You really need to compare them to shakes you would get at a quality ice cream store, and they compare very favorably. They are the perfect ratio of ice cream to milk and thoroughly refreshing and tasty.\n\nThe only problem I have with Smashburger is that there is no way I could have a sandwich, shake and fries all in one meal and still be able to waddle back home, so I have to pick two-out-of-three.\n\nI love my Smashburger!", "author": "David M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "These burgers are sooo good! I had a beef burger boyfriend had chicken. I wish this chain was in more places throughout nyc! It's a fast food joint but the burgers taste like better quality than that. Would Def reccommend.", "author": "Jacqueline G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-12", "description": "The service \u0026 food is fantastic. The Vanilla Milkshake is off the hook! Buffalo crispy chicken sandwich was great too!", "author": "MAD B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-28", "description": "A pretty good burger place across the street from the hell hole that is LIU. Smashburger has solid burgers and tasty fries. \n\nIf you are poor like me and like to eat out, you can get a decent meal here at an OK price and have the experience of dining in a restaurant without the mandatory tipping. The interior is clean, neat, simple, with a touch here and there of modern flair.\nWHAT TO DO:\nYou place your order at the counter, get a number, place the number on the table of your choice and wait for your food to come to you.\n\nYou can create your own burger or choose among 7 specialty burgers designed specifically to seduce your taste buds into submission. I find it cheaper to create your own burger, which isn't necessarily a downgrade from the specialty burgers considering the unlimited possibilities of meaty creations that can be conceived. \n\nCREATE YOUR OWN BURGER:\nIn creating a burger you have a choice between 5 different buns which includes: Classic Egg, Multigrain, Spicy Chipotle, Pretzel, Brioche and None (if you are completely lame). There are a great variety of free sauces, the more interesting sauces are Frank's Red Hot Buffalo Sauce, Spicy Chipotle Mayo, and the Smash Sauce, and the boring sauces includes ketchup (stop being lame). Free toppings includes grilled onions, Kosher pickles, jalapenos, and sweet relish. For $0.75 \nyou can choose from a variety of cheeses to add to your creation.\n\nSmash is $4.29 and a Big Smash is $5.29. Stop being fat, a Smash is a satisfying portion. \n\nFOOD:\nI decided to create my own burger and for $4.29 I had a regular sized Smash burger on multigrain bread that came with lettuce, 1 tomato, 1 slice red onion, 3 pickles, and 3 jalapeno with the buffalo sauce and spicy chipotle mayo. They were very skimpy with the toppings but the burger was pretty good. Not amazing but i was satisfied.\n\nSmash Fries $2.29\nTossed with rosemary, olive oil and garlic.\nThe fries are incredibly delicious and mildly addicting. It was crispy despite being showered in smooth olive oil. The rosemary and garlic SMASHes your mouth with sun rays and awesomeness. Yay! Flavor!\n\nfountain drink $1.99\nfree refills \n\nOVERALL\nTotal was $9.33. Not bad for what you get but it is a little pricey. Its a nice casual place to hang out and from my experience the staff doesn't bother you if you sit for long periods of time talking to friends. \n\nSo fellow students, take a breather from the bat-shit craziness of school and treat yourself with a burger and smash fries!", "author": "Joan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "Hello\n\nI loved the Burger there. Fresh and tasty. The French fries were great too. And friendly staff/personal", "author": "Anne Kathrin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-09", "description": "I had my first visit to a Smashburger today at its new Brooklyn location. \nThe service was great, if not a little overenthusiastic, but being their opening day that is to be expected. \nWhat knocks this down a few stars are the prices and the grease. \n\nBoth the burger and the fries were too greasy, and for downtown Brooklyn cheaper burgers that greasy can be found elsewhere. \n\nHowever, they have sweet potato fries as an option which can be hard to find, along with many different buns to choose from. Also, beer and wine are options and the free milkshake samples were delicious. Plus - they don't skimp on the meat!", "author": "Noah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-26", "description": "It's been about one year since my first review of smashburger. After going here a couple more times, I really dig this place!! Forget the part where I said five guys was better. Smashburger has definitely improved the quality of food that they put out. The most recent times I've been here, they loss the excess grease and oil in their burgers and sides.\n\nMy new favorite burger to get is the BBQ bacon cheddar burger. The bacon is thick and crunchy. The haystack onions add a nice flavor. The meat is cooked to perfection. The cheddar cheese is nicely melted. Great burger!\n\nI recently had their crispy classic chicken sandwich while using their buy one get one free chicken sandwich coupon. I basically paid $6 and some change for 2. And no, it wasn't all for myself. The crispy chicken was definitely crispy. I thought they would give me a thin piece of chicken breast like the other places that sell crispy chicken sandwiches, but I found it to be a very generous piece. It was bigger than the egg bun it was served on. And it sure was a thick piece of chicken breast. It was a bit on the dry side, but it was still edible and enjoyable. My only complaint is that it was too salty. I was close to finishing a bottle of water after eating this. \nI would have given this place 4 stars, but the service you get from this place is stellar!! +1 for that. I was waiting quite a long time for my sandwiches with a friend of mine. About 15 minutes passed and I still did not get my order. Somehow my order disappeared and I had to wait all over again. The manager came and apologized and gave great customer service. He made sure that my order would be done asap. And before I left, he gave me a bunch of coupons. For those who know me, coupons and I go very well together. I will definitely be going back for free sides with the purchase of an entree. I have yet to try their famous shakes with haagen dazs ice cream. I'm still waiting to get a coupon for that. \n\nFYI: you will get a good filling meal that is worth what you paid for- with or without coupon.", "author": "Jenny B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-07", "description": "I ordered the bacon cheeseburger and smash fries. The burger was okay but I love love love the fries!!!!", "author": "Georgette G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-07", "description": "Smashburger is the best Burger Joint on the Planet!!!.. I eat here almost all the time and they have the best burgers I have ever tasted. My favorite burger is BBQ Bacon and Cheddar and the Spicy Baja, all the topping are always fresh and just so tasty.\n\nIf your visiting Brooklyn or from the borough you should stop by to Smash Burger not only are the burgers good, but they also have a wonderful Staff!!! I will definitely  tell my friends and family about this place It's a SMASH!!!!", "author": "Ayisha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-25", "description": "Amazing Quality Burger, by far the best customer service in fast food... with a clean and robustly pleasent restaurant. The Quality milkshakes are 2nd to noe...AND on top of all that they deliver.. yes Deliver.... cant best best that..", "author": "Lorenzo J."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Smashburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "74 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JPa99LWTdgmCDcySlOcqnQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182221101"}