{"aggregateRating": {"reviewCount": 322, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-15", "description": "Went here Monday afternoon around 5.  It was fairly empty but started to pick up for dinner as I neared the end of my meal.  The menu is larger and more enticing than basically every other similar restaurant in NYC.  I had the Classic Big Smash and the regular fries.  The fries were pretty average, but I thought the burger was very good.  Better than Five Guys, but not as good as Shake Shack.  It was definitely greasy, but in a good way...the way a griddled burger is supposed to be.  If you're going to come on here and complain about grease, you should probably just go pick up some 93/7 ground beef and bust out your George Foreman instead.", "author": "Matt M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-23", "description": "I love Smashburgers. I really hope you open a place in Queens near Long Island City.", "author": "Patricia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-12", "description": "caught smashburger on their 3rd day opening and the place was crammed with employees! managers were skimming the floor asking every guest how their meal was, very engaged. \nwe had the Classic and the All-American and they were really good burgers. we had the regular size (they offer a larger one) and they were huge! good and soft egg buns that melted into the cheese that melted into the griddle-prepared patty...sooo good.\npricing is unbelievable at $4.99 for these massive burgers!\nordered the rosemary garlic french fries...not bad though a little overpowering. but a large portion. could split between 2 people for lunch. also ordered the haystack onions (thin, seasoned fried onion rings). thought these were a little greasy and heavy.\noh, and they serve beer and wine! restrooms big and clean. keep it up, smashburger and welcome to the neighborhood.", "author": "JoJo D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-14", "description": "Went to Smashburger today cause I had a hankering for a cheeseburger. The place is clean. I like that. You order and it's not a long wait for your food. I like that. What I didn't like as much was my burger. I had the Brooklyn Burger (hamburger with pastrami, swiss cheese, red onions, pickles, mustard, on a pretzel style bun). Sounds good right? Well, the bottom of the bun was SOAKED with oil. I mean soaked where I used a napkin to absorb the oil off the burger. \n\nNow the burger was a little thin, hence the term smashburger and it had a crunch from the onions, but no real flavor to say I'll come back.\n\nThe sweet potato smashfries were good.\n\nIf I had to choose between Five Guys (not to far on Fulton St) and Smashburger, I'm going to Five Guys.", "author": "thomas m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-30", "description": "Awesome burger chain. Can't go wrong with the Spicy Baja burger. Super friendly staff, and there's Dr. Pepper at the fountain. Sweet potato fries make the best side.", "author": "Blake T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-10", "description": "juiciest and messiest burgers i've had in a while and their fries are solid. i really want to try their fried pickles!!!", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-21", "description": "Definitely a fan of Smashburger.  I admire the classic \u0026 somewhat old school vibe of this burger joint.  Reminds me of Happy Days in a way.  \n\nI also like how the staff brings your food order directly over to your table so that you don't have to walk though the restaurant with a tray of food...minimizes accidents.  \n\nI usually get a well done smash burger on a chipotle bun with pepperjack cheese, sauteed onions, bbq sauce \u0026 smash sauce.  Absolutely LOVE IT! Their burgers are made with 100% beef and practically melts in your mouth.  I also like that its just the right amount of meat.  Everything in the burger compliments each other.\n\nThe sweet potato fries and their smash fries are good too.  Five Guys and Shack Shack has nothing on Smashburger. Even the Smashburger shakes are great and I like that they use real haagen-dazs ice cream to make their milkshakes.  I was a bit disappointed to learn that the banana milkshakes are only seasonal.  The cinnamon shake that I ended up getting was okay (though I would've much more preferred banana).  I hear that their malted shake tastes great so I'll try that on my next trip \u0026 will let you know just how good it is.\n\nHighly recommended if your in the mood for a great burger and/or a good milkshake.  Definitely worth the travel to Brooklyn.", "author": "Sunshine D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "The food was so good we ate there 2 nights in a row. Saturday after the hip hop festival and again Sunday. The food is excellent. They have a few kinks to work out like find the right table to # but that''s not a big deal. My husband got a nutterbutter shake for dessert and they gave him the metal mixing cup with it- he got to fill his glass 3 times!!!  The young folks that work there are also really sweet and helpful. A young girl with a purple streak in her hair helped us both nights and was fab. We will defi be going back soon", "author": "Lexie R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-11", "description": "Reason you should read this review? I'm an American and have eaten about 1 billion burgers in my day. Anyways the burger here is without a doubt on the fast food side of things. So if your looking for that gourmet experience this is not for you.  Not greasy ala 5 guys I thought the classic American was really delicious. The bun and fries were both very much on point. Shoe string style fries with rosemary and olive oil is tasty as hell.  The staff buses the tables which is a nice touch and they were all very friendly and on point. They have beer here or milkshakes. I opted for beer and that looks to have been a mistake. Go out and get some beef brains!", "author": "Zach K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-15", "description": "I go to Brooklyn Tech and this place is a couple blocks away. I got tired of the occasional pizza and Mcdonalds so I was happy when Hot Chix and Smashburger opened up! Hot Chix has better prices but the vibe surrounding Smashburger is way better! The food is good, so I'll be a regular customer.", "author": "Cici C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-09", "description": "First day open and so far so good.  Got the Classic SmashBurger \u0026 Sweet Potato fries.  Service isn't bad and I expect it to improve with time.  The burger isn't over done and maybe the fries could be a tad more crisp.  I'd go again.", "author": "alysia w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-24", "description": "Not for nothing, but this is one of my favorite burger spots in Brooklyn!!! This place is really awesome. I have been going here since it opened two years ago and it's a real treat every time. A couple of weeks ago after I went to a dance party at Fort Greene Park, I ran down to beat the crowd. Unfortunately, I don't think many people know about this place, oh well too bad for them. I ordered a customized burger on a pretzel roll. I wanted grilled onions, cucumbers, lettuce, tomatoes, and their secret smash sauce. I coupled that with an order of fries and a soft drink. I usually order the shake because Haagen Dazs is my favorite ice cream. I took my number and patiently waited for my juicy burger. I devoured the whole entire platter!  The pretzel bun was tasty and soft and complimented the juicy burger. I make no apologies as I gobbled every morsel and I am so glad that I added the cucumbers on there! I love the fact that they let you refill your cup with soft drinks, no questions asked. I did refill it with a coke at least two times and once on the way out the door. The customer service is great also as they greeted me before I even reached the cash register. This place is highly recommended on my list of burger places. In NYC burger spots are saturated all over. Trust me, you will not be dissapointed.", "author": "Kaia Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-02", "description": "Wow, their burgers are amazing. I had the BBQ Bacon Cheddar with smash fries, sooo good. The egg bun compliments the burger. Ill definitely be returning soon!", "author": "M Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-19", "description": "Smashburger on Dekalb blows away the competition!!! It literally does if you notice that Five Guys on Flatbush is now closed... This is an amazing place with great staff!!! The food is always great, and everyone is so friendly!!! Its so clean, and you always feel at home. You must try this burger place!!!  The BBQ Bacon Burger will leave you craving another one ASAP!!! The manager is always there checking things out, you'll never have a bad experience here!!!", "author": "Peter J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-14", "description": "Best Burger joint every!!!!! Peter is the manager and he is amazing.  Rudy is the night time manager and she oozes passion about what she does and her job. She even remember regular guest orders!!! Great customer service and staff remember you every time you come in. Great food as well.", "author": "Sunshine D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-03", "description": "Totally love this place. I've been here 3 times. I'd come more often but I'm coming in from Manhattan. #1 the burgers are always incredibly delicious. I love the classic burger with the smash sauce. The veggies on it are fresh, the patty is moist. I love the bread. The rosemary fries are delicious. The bathroom is clean the 2 out of 3 times I've been there. The staff is INCREDIBLE. They are all nice. They all talk to you. They ask you how the food is. They ask you if you need anything. They say thank you and appreciate when you let them know that bathroom is out of toilet paper. They are nice (oh I mentioned that already - but it's worth mentioning again) and fun and I wish they would open up in Manhattan already!  Smashburger is better than Shake Shake, 5 Brothers, Jackson Hole. Heck I think it's the best burger I've ever had. Personally, I would just stick with the classic burger and rosemary fries. I got the caramel shake which is seasonal. Of course it's ridiculously insanely delicious but it's so rich and I felt kinda stuff the rest of the day on 1/2 of it. I didn't like the fried vegetables. Please open up in Manhattan!!!!! OH and I forgot to mention - you can even sit here! And they bring the food to you too!!! And they have napkins for people like me who need it!", "author": "Missy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-04", "description": "I think this is actually the best cheeseburger I've ever had in the entire world - and I'm from California, the land of In-N-Out. The egg buns are fresh and spongey, the pickles crispy, the cheese yummy, and the sides - fried pickles and haystack onions are a must, to dip into the accompanying dips and to stuff into your already full cheeseburger for some extra decadent bites. This place is quality, efficient, and well-run - can't say enough good things!", "author": "Viola F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-05", "description": "First heard about Smashburger on the Food Network and it definitely intrigued me. Love it, the burgers never disappoint me.", "author": "Addie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-30", "description": "Meh.  Not bad, but not great.  I suggest the classic.  We also sampled the baja and there was just too much goin on.  The smashburger fries had good flavor (enjoyed the rosemary), but they were way too greasy (drenched in oil).  We'll still be going to Five Guys when the burger crave hits.", "author": "Brenna G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-11", "description": "the service is awesome... the manager peter and the staff are very attentive..i love this place", "author": "Michaella W."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Smashburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "74 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JPa99LWTdgmCDcySlOcqnQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182221101"}