{"aggregateRating": {"reviewCount": 322, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-28", "description": "2.5 Stars\n\nSmashburger is no Five Guys, but a few unique qualities make it okay.   I'm obsessed with burgers, especially when they're, you know... expensive.  So I was very excited to know that there was a new burger place opening within walking distance from my apartment.  \n\nI'm also one of those super anal people only eat my burger plain and I obsess about my meat-to-cheese-to-bread ratio.  So Smashburger is kind of cool because of their a la carte options.  You can pick the bread, cheese, toppings, etc.  I love anything spicy and gravitated towards to Spicy Chipotle Bread.  I'm very glad I did, because it was extraordinary... it was like a spicy bread.  Amazing.  Notwithstanding the amazing bread, umm... they put ketchup on my burger.  Awful.  I was so distressed and too far from the restaurant once I discovered it to raise a stink about it.  Trust me, I was VERY clear when ordering that I wanted a plain burger with only cheese.  The actual burger was dry and overcooked.  Maybe they slathered all the ketchup on it to hide this fact.  Either way... I wasn't feeling it.\n\nThe best part was definitely the Sweet Potato Parmesan Fries.  Like I would go back for this alone.  The perfect balance of sweet and spicy. \n\nOverall, a resounding \"meh.\"  Go for the fries and skip the burger.", "author": "Tanisha C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-31", "description": "I have eaten here numerous times, the food and the service were always impeccable. One night I stopped by late at closing time and picked up a smash burger with over medium egg and chilli cheese fries.The blending of the burger and egg was such a delightful taste. After eating the chilli cheese fires, I was ill for 3 days.  \nRecommend eating there before closing.", "author": "Hypha O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-06", "description": "1.) I ain't waiti'N on no fkn Shit err Shake shit err Shake line with all thise hub bubs that first \u0026 foremost!\n2.) I also am not dealing with that 67 burger dump in the middle of what people would have you believe is the fort Greene high society plaza\n3.) I find five guys to be a loser hangout of students \u0026 stray nit wits within a very bland \u0026 uninspiring warehouse styled eatery not to much better than your local other fast dump stylings\n4.) for the same price you'd pay at all these places AND especially the worst of (Mcdoanlds/BurgerKing) you can get here!\n5.) AND what you DO GET here is ten times better, even if there's an off day just try it again, either way if your are one the moron lemming ghetto fucktards that has the fat ass nerve to be so stupid to use the same money to feed the profited of that disgusting disgrace of a place called Burger King and or it's affiliate other counterpart shitholes (Wendy's is a grey area, the best if the worst) then you should be strung up by a tree branch and pelted with stale burger buns till squirrels come along and peck the crumbs from your eyes, cause you sir are what's wrong with society as a whole, you fat fuck!\n\nThis place gets my vote for a quick bite any day of the week!\n.....FOR THE PRICE, lets make THAT point clear, only! I'd always opt for a burger at a restaurant over anything almost always cause I am THAT asshole!", "author": "Joe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-14", "description": "Great burgers, go with the classic for starters. The smash fries with rosemary is pretty good too. However, their milkshakes are out of this world! My favorite hands down is their oreo milkshake, its worth every penny. The food is a little oily but you should go here at least once to try it. Don't come here during rush hour, it gets a bit hectic and you will end up waiting longer for your food.", "author": "Christina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-04", "description": "YAAAAAS THAT AVOCADOOOOOO BLACKBEAN BURGER (I AM A VEGETARIAN).  I do have a tip for the smash fries. @ times they are swimming in that FAT and I can't eat them :(  The folks frying the fries need to be taught a thing or two about a HEART ATTACK.  \n\nOTHERWISE, brava. you guys make my tummy happy.", "author": "Little M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-26", "description": "Wow, I really love the burgers here. I wouldn't have found out about this place if my sister didn't go to school around here and introduced me to it. The burgers are hearty and heavy, just how burgers are supposed to be! The selection is really fresh - the burgers here aren't just hamburgers or cheeseburgers, but they have flair like the spicy baja smash which is my favorite. When we went, which was in the last two weeks, they were promoting a new chai latte milkshake which I lovedddd because chai lattes are my favorite! They must be doing SOMETHING right.\n\nOne thing though, the waitress kept asking us if we ordered anything else when all we had was just a shake. I guess it's reasonable that people come here and ONLY order milkshakes, but it was kind of tedious having to explain our order a couple more times. They should update their system or something so their wait staff knows who ordered what.", "author": "Laura Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-17", "description": "Been here several times. Expert service, friendly. Menus  at the front once you enter. Good burgers favorite is truffle mushroom swiss. The others are also good. Shakes are the same like everywhere else except the selections.", "author": "Jofferson G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-05", "description": "A friend offered to take me to lunch recently and I was happy we were near Smashburger.\nI do not know why it took me so long to get in here, but it was worth the wait.\nJuicy Smashburgers with the delicious Smashburger sauce, crispy onions and a wonderful Oreo milshake sent me into a semi food coma.\nI definitely should have not eaten thee before attending one of the longest, most boring classes in history as I was nodding off about 10 minutes in.\nGreat service too!.The employees were very attentive and the place was very clean. \nI will definitely be back!!!!!", "author": "Quana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-26", "description": "A friend of mine tried to use the coupon today, but apparently they don't accept it anymore.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-07", "description": "A few stars for the location, cleanliness, and good customer service I received.  With that said, my burger was just OK.  I got the large spicy baja burger and it was $7 and some change.  My burger came out in about 5 minutes and the first thing I noticed was that there was literally a tablespoon of guacamole on it.  Little stingy there I think.  Secondly, the jalapeños and onions were kinda limp.  The patty itself was really good but super greasy.  I wasn't feeling the egg bun either.  I can't really articulate why right now but I did inhale the burger since I was starving post bootcamp.  So my verdict is the burger could've really used some quality condiments and a different bun and maybe my rating would rise to a 4 or 4.5.  I'm sure I will be back to this place the next time I'm on campus and craving some beef.", "author": "Nisa N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-18", "description": "I'm not a huge fan of burger places where you can't specify how you want it cooked so I didn't have high hopes for Smashburger.  \n\nIt was so good!  Just color me all sorts of Wrong.\n\nMy friend and I stopped by after a workout at the gym (I know, fat Americans....moving on) to try out the new spot since he had seen so many people there the day before.  I ordered the BBQ Bacon Cheeseburger and Sweet Potato Fries.  Maybe the \"oily\" comments got back to the owners because my fries were easily some of the best sweet potato fries I've ever had.  Just crispy enough, not oily, and the rosemary seasoning was a nice touch.  \n\nThe burger was cooked perfectly and the meat itself was seasoned, which is always a plus.  My friend ordered the chicken version of my sandwich and wasn't too thrilled with it--he said it was messy and the chicken wasn't that great--but his opinion matters Zero because it's not his review.  My burger was fantastic, a $10 burger at a $6 price.\n\nThe only drawback is a little confusion over service.  We had a girl refill our drinks and ask if we needed anything, yet the place gives an air of \"self-service\" so we bussed our own table.  i would've felt rude leaving it, especially since we'd already tipped the counter people, not knowing there would be others milling about.\n\nAlso: If you bus your own table and you ordered fries, that little container is metal.  I learned the hard way when I dumped the whole tray into the garbage and heard \"CLANG CLANG CLANG\" from my Fries Container.  \n\nOops.", "author": "Rafi D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "I love me some Smashburger.  This location is great, and has a very happy staff.  I recommend it.", "author": "Tom T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-04", "description": "The BBQ bacon and cheese grilled chicken sandwich I ordered tasted fantastic. The bread was buttered and toasted and the toppings were flavorful, but did not overpower the chicken. However, the sides - smash fries, sweet potato fries, and haystack onions - were another story. The fries tasted less like potatoes and more like the grease they were cooked in. The haystack onions were way over-salted. The portions of all three were surprisingly small. \n\nConcerns were also raised from the friends I was dining with about their burgers being way too greasy. I didn't try their burgers, but from the look of their soggy buns, their comments seemed justified. \n\nThe staff was a bit rough around the edges when it came to placing the order, but I can't fault them too much since the restaurant opened so recently. They were very friendly and courteous otherwise. \n\nSmashburger has both indoor seating and outdoor seating (sidewalk tables). After ordering at the front counter, your food is brought to your table by a server. \n\nOverall, I enjoyed my chicken sandwich, but I was really expecting more bang for my buck. A sandwich, side, and soda will run you $12 ($7+$3+$2), which is pretty steep for fast-food. The portions were also small, which didn't help. I wouldn't recommend this place to a friend, but if they insisted on trying it after deflecting my Five Guys counter-suggestion, I would acquiesce.", "author": "BT F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-28", "description": "This really a 3 1/2 star place considering its surroundings and other options of restaurants.  I actually got pretty excited when I saw this restaurnt because I go to Brooklyn hospital often for work and there really isn't much to eat in the area except a slice of pizza or the grilled chicken.  \nThis is a very clean place and has outdoor seating.  I only got the smashburger since im trying to avoid french fries and extra callories.  Well, not really but it sounded like a good idea at the time.  The burger was delicious and it was bigger than the average burger that I have been eating at other burger joints.  There was very fresh ingredients, lettuce, tomatos.\nSure, there are better burgers out there but Ill be back as this just took a front spot for the brooklyn hospital frequenters.", "author": "Nathan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-10", "description": "This is a solid burger spot with multiple options of toppings and has shakes and salads.  The burger isn't anything to race about but the shakes and smash fries are awesome.  I had the bacon cheeseburger with smash fires and salty caramel milkshake.  The burger was tasty but not outstanding the smash fries are made with olive oil and rosemary which give them a great flavor.  The hand spun milkshake was excellent and they let you have the overage that doesn't fit in the cup I will definitely comeback to this spot for a higher than fast food quality burger.", "author": "Fishgrease J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-18", "description": "My coworkers and I ordered burgers here for lunch at work.  I ordered the Classic Smash along with the smash fries.  I haven't quite eaten a burger at any restaurants for a long time until that day.  The burger was cooked so well and it was not dry at all.  The fries were really awesome too!", "author": "Eva M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-12", "description": "Worst customer service ever. Rushing to bag my food. Forgetting all of order. Smiling me out of there. First time.  Last time. They need to smash this place.", "author": "Newkema H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-28", "description": "Food is better when you dine in. The delivery is the worst I've experienced with any restaurant! . Always messing up our orders at work. Food is cold when it finally gets to us. So fed up I will not order from them anymore.  I will go there and get food on the rare occasion I'm in that area", "author": "Paul L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-25", "description": "Great burgers.  Root beer floats!  Outdoor Seating.  Reasonable pricing.  Rosemary fries yum! Cool staff.  I am pleased!", "author": "Kai-Michelle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-25", "description": "A little back story....., was in the area on Dekalb Avenue and before my trip home over the Manhattan Bridge I decided to stop into Smashburger and so happy that I did.  I got the New Yorker which is a burger with onions, cheese cheddar I think, spinach, tomato and garlic aioli and the bun was killer!!!! I added an avocado because avocado on burgers and BLT's are great.  The workers were very nice and not overwhelming.  I waited no longer than 10-15 minutes and I was outta there with my burger, smasfries and soda.  The burger was still warm when I got home and I devoured it.  The burger was perfectly cooked and it had the perfect bun to patty ratio.  Success, I nibbled on the fries in the drive home so they were almost done by the time I got home.  Those fries were very very good and definitely worth a trip for those fries alone.  Basically I would suggest a stop in if in the area and you will be satisfied!\n(No parking in area, so try to park on Ashland Place and walk in.)", "author": "Amy W."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Smashburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "74 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JPa99LWTdgmCDcySlOcqnQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182221101"}