{"aggregateRating": {"reviewCount": 322, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-16", "description": "The burgers that I have ordered here have not been that great. They aren't very thick or juicy or flavorful, and.. yea. \n\nThe staff are super friendly though!", "author": "Adam G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-02", "description": "Here-is a must dine at  place when your near Fort Greene, in a hurry, or in for a casual lunch or so. The foods are in reasonable price. I use to come here more often a year or so ago when I was still in High School, but I returned today. This place does never stops to impress. It is a boutique place on the side of the street, but don't let it mess with your mind- the burgers are fresh and juicy. \n\nI went today with my boyfriend and ordered a big smash classic burger, smash fries and drinks. The food is gorgeous as always, but what amazed me the most is the hospitality the company really offers. The workers are friendly. They suggested order types for people in front of me. When I ordered, they asked if I wanted the burger to be cut in half since I was ordering only the Big Smash burger to share with my boyfriend. The workers brought the order to my table when it was ready and told us to enjoy our meal with a friendly smile. What else can we ask for for such a simple place with no tips mandated. But of course leave something at the front of the desk as you wish.\n\nIt is the littlest thing that make the company unique and keeps bringing me back. Beside the quality of the food they definitely have the quality of service.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-21", "description": "7/10 stars \n\nQuality of the food: 8/10 The burgers are very filling and delicious however very greasy. The smash fries are good as well but also very oily. The regular fries arent worth it you might as well get smash fries. However, the appetizers or little bites are not that great compared to the burgers. \n\nOptions: 9/10 There are a great amount of options for your burger. My personal favorite is the mushroom swiss burger. There is even a special veggie burger. \n\nPrices: 6/10 Its one of the more expensive burger chains. \n\nAmbiance: 7/10 The overrall ambiance is nice but it is always crowded and hard to find seats. Its very casual and they play pop songs on the radio usually. The staff are nice and the food arrives quickly.", "author": "Alexis B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-09", "description": "My uncle who's been living in NY for a long time now recently said this was his favorite burger in NYC, more than five guys or shake shack. Other than the really great attitude of the people working there, this place is just not that good. I wanted to love it, but the burger just tasted so bland...fresh, but bland. I had the classic which has their special sauce on it but seriously was tasteless.\n\nDidn't help there was a noisy giant machine resembling a dinosaur next to us with a man on top doing repairs on the ceiling. The machine kept beeping really loud like the sound those machines make when they are backing up...super annoying, why don't they do this when the store is closed?\n\nUnfortunately won't be back.", "author": "Jade D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-19", "description": "So this place is as if you don't want to go to McDonalds, but you don't want to go to Shake Shack -- this place lays right in the middle.  Which in that case, go to Wendys. I ordered a strawberry shake - which was abominable.  They do use hagendaaz VANILLA ice cream, and they pour the flavor of your choice; in this case vanilla with strawberry syrup instead of actual strawberry ice cream.  \n\nI didn't see people using gloves and I saw several other DOH violations.  Oh and not to mention the 20 minutes I waited for a shake -- there was only one other person in front of me.  I do have to say the girls in the front are nice - the poor quality is not their fault. \n\nSomeone get rid of this place!", "author": "Erica M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "Perfect burger in taste and appearance. Love the sweet potato fries. Great service -they continually checked to see if we were good.  A little pricey though.", "author": "Tash P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-30", "description": "The burgers here are great... The employees at the front counter... Different story.  They flat out sit there and ignore the line of people waiting to order! Just chatting with each other like they would at home.  Never again will we step foot in this location unless they hire competent employees...", "author": "Piotre W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-10", "description": "Good burger joint. Great service. You can not go wrong. Good selection.", "author": "Carl L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-25", "description": "This place is a hot, hot mess. I honestly can't comprehend the rating it has or the positive reviews. My husband and I went here for the first and last time today and had the most miserable dining experience. I wish we had gotten happy meals at McDonald's instead. I ordered the chicken club sandwich and he got a customizable burger. The ordering process seemed smooth and there were only a couple of people seated in the dining area, so we figured we would get our food pretty quickly. Nope.\n\nI'm not sure what went wrong, but my half of the order was entered as a delivery order, so it sat in a bag for a while before eventually making its way to our table. I would have been okay with that if my husband's order was anywhere on the horizon, but 20 minutes later, it was still MIA. By then the place had filled up and EVERYONE who came in after us had been served. Finally one of the workers stopped by our table and informed us that my husband's order would be up soon. It finally arrived and was charred beyond recognition. The meat was black and the consistency of beef jerky. It literally crumbled when he took a bite and parts of the patty were so thin that there were holes. The egg that he had added was also way overcooked. He said it was the saddest burger he had ever seen or tasted. But by then we were so hungry and had already been there for almost an hour, so he choked it down and we left. \n\nI would give this place zero stars if that was an option.", "author": "Jane L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-16", "description": "My brother and my nephew highly recommended this place (BTW I need to call them) and I decided to visit. It was one train stop from my job, so it was not too far. I was looking forward to having a burger with a gluten free bun since Bareburger fell off. \nBoy was I disappointed! It was bad. The staff was nice which is was I gave 2 stars but there was no gluten free buns. Strike one. They said they would so a lettuce wrap but bought my burger out on a bed of spinach, strike two. Then, the burger \"the New Yorker\" was sooooo salty! I never had a salty burger patty before! It was AWFUL. I was starving so I ate it, as it was raining cats and dogs outside, and I needed to get back to work. However it was bad. The Sweet potato fries were the only good thing and they were a little cool for my taste. Overall, I definitely had better. I told the staff that the food was bad and to tell the manager, however he did not come out. I am never going back. For the price, Ill just go to five guys. Its better.", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-11", "description": "I used to be such a fan of this location.  Seems since it's beginnings,  its attention to detail has really wavered.  They get deliveries wrong almost all the time. I have to always ask for my cup for the fountain.  The smash fries are no longer drizzled with olive oil but rather drenched and they often taste stale.  I received the smallest and over fried chicken tenders today for my son's meal. The staff is nice though they're often not as accommodating as they used to be when they made mistakes.  If I didn't live in the building next door I would have stopped going a while ago. I also hate that they have a service to do their delivery now which has deterred me from ordering many nights when I'm not feeling well and order instead from somewhere where I don't have to pay an extra $4.99 fee.  I miss the Smashburger on dekalb that first opened.  I definitely visit a lot less (almost once a week at first to now maybe once a month or every other month) and sometimes only for an oreo milkshake which hasn't failed me yet as long as they listen and dont put whipped cream as you ask.", "author": "Leticia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-12", "description": "Addictive rosemary fries and a well dressed hot dog make this girl very happy.\n\nWhere have you been all my life Smash Burger?? Promise to never ever ever ever leave me!!!  Thank you for attracting hunky firemen.\n\nDear POTUS, you need to kick this economy into high gear. Momma needs a better paying job so she can afford to eat here more often.\n\nThat is all.", "author": "Sabrina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "The burgers aren't quite the level of 5 guys but its a lot more than just burgers. They also have great salads, very good chicken sandwiches \u0026 amazing milkshakes!!!  While 5 guys does not. Overall their wide variety keeps them in the running!  I love the fact that you can substitute your French fries with a wedge salad which is obviously the healthier option! \n\nThen there's that NutterButter milkshake! WOW!  I'm so craving that right now \u0026 it's 8:15 am... I've eaten here numerous times \u0026 would recommend it!  Although I will admit 5 Guys is my first option unless I'm feeling like a burger \u0026 a milkshake. Then Smashburger it is!  See you soon!", "author": "Jesus M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-28", "description": "Let me preface this review by saying that I had been itching to try Smashburger since before it even opened in June. I finally got around to stopping in on Tuesday with a coworker - although we had fairly low expectations going in. \n\nThe place was packed, but the line to order was fast moving. They had menus up all over the place and a ton of different preset burger/chicken options as well as the ability to create and customize your own burger right down to the size of the burger itself (small smash/smash/big smash). My co-worker went with a BBQ, Bacon \u0026 Cheddar Big Smash and a side of fries. I decided to create my own burger - Smash + Grilled onions + Smash sauce. (Yes, no cheese. I'm a plain Jane.) Also, I ordered a side of the fried pickles which I was delighted to see on the menu. \n\nMy total bill with the burger, pickles, and a refillable coke was just about $9.50. Not bad, but not great - the refillable drink was a nice touch.\n\nThe girl who took my order was extremely friendly and repeated my order back to me (which I like, because it's always disappointing when orders get screwed up because of a miscommunication). \n\nWe managed to grab one of the only open tables and patiently waited for our orders to arrive. If you ever have been to a Whataburger (overrated *shuts eyes tight and braces for a punch in the face by a Texan*) - they have the same marker with a number system so that way your food can be brought to your table while you wait.\n\nOur order arrived less than 10 minutes later. My first thoughts were, \"Wow his burger is huge!\" Then I realized the portions in general were pretty huge. Everything from the pickles, to the fries, to both our burgers. I'll start with the pickles... lightly battered pickle chips, well seasoned (perhaps a little too much on the salty side) accompanied by a side of buttermilk ranch dressing to dip 'em in. Very good. His fries... crispy, thin, delicious. My burger ... decent portion of meat, the bun was huge (egg bun, very fresh), plenty of grilled onions. LOVED the smash sauce (very similar to McDonald's Big Mac sauce). His burger was enormous. Packed with bacon and onion straws. The toppings were crispy - nothing was soggy. \n\nOverall I really truly enjoyed my experience at Smashburger. I will certainly be back on a weekly basis. I'm already looking forward to a burger and a shake after hard night out. My health may suffer from it, but my stomach will at least be satisfied!", "author": "Heather S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-04", "description": "I went here yesterday and I ordered the classic Smashburger and smash fries. Both were very delicious and the burger was very juicy and flavorful. I will definitely visit this establishment again.", "author": "Sherry S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-07", "description": "Great burgers!  'nuff said.\n\nUnfortunately, they suck at delivery orders (from personal and friend's experience)  They delivered it in a timely fashion but they screwed up my order.  When I called to correct them, they sent me a free one to replace it but they screwed that one up too.\n\nOther than that, great burger joint!", "author": "Bill S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-22", "description": "My first time experiencing this place and I had to come back the following day. I didn't even want to change anything about my order since the first time was great. \nFor starters, it's Great customer service especially when I said it was my first time dining here although I live in the neighborhood. The cashier was great with recommendations. I ordered a CYO smash burger, olive fries and Oreo milkshake!! As simple as my order was, it was GREAT with the signature smash sauce on the side. Everything was yummy! I look forward to returning when I'm no longer on my diet. Lol. I hope this review is helpful, ENJOY!!", "author": "A K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-21", "description": "This is one of the few decent spots in Brooklyn to get a decent burger. Their bean burger is really good and the French fries are amazing. Along with the milkshakes too!", "author": "Aneeta C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-08", "description": "Should be called greasyburger.\nGreasy burger. Greasy sides.\nI ordered the veggie fries thinking (by the description) they'd be a lighter alternative to fries. I got parcooked veggies dripping in oil. I mean *dripping* in oil. (Oil too cold?)\nNot about to eat that much pure oil, I brought them back up and asked to do a salad instead (and offered to pay any difference).\nI was asked what dressing I wanted, etc.\nAaaand another greasy order of veggie sticks shows up.\nThird try, I get a side salad... wilted leaves... a few brown ones for good measure... maybe the source of the brown liquid on the salad, since the dressing was on the side? Hoping I don't regret the couple pieces of lettuce I did eat.\nYikes. \n\nTo their credit, the employees were very pleasent. \n(They were also nice when a guy ordered a black bean burger and was surprised he didn't get meat. That happens a lot, it seems. And when a little kid dropped an entire cup of milk on the floor.)", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "So pretty much anytime I'm in BK visiting my friends, I HAVE to have a Spicy Baja Veggie Burger. OMG, they are so good. I'm not even a vegetarian, but I really like the way Smashburger does theirs. If I have anyone in tow, we share the truffle oil fries that are so good. A couple times the fries have been cold, but they are usually pretty quick to give you another order. \n\nJoin their Smashclub and you'll get awesome coupons! I kind of want a veggie burger right now! I wish they had one closer to Hoboken.", "author": "Jenna A."}], "servesCuisine": "Burgers", "priceRange": "$11-30", "name": "Smashburger", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "74 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/JPa99LWTdgmCDcySlOcqnQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182221101"}