{"aggregateRating": {"reviewCount": 214, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-13", "description": "Growing up hearing my mom and uncle talk this place it was a landmark like pizza began and ended here. It was their pizzeria growing up, well for my uncle it was and my dad. For mom Sam's was strictly the ambiance, she was not a big pizza Italian food type of person. Thankfully though I take after dad, I live for pizza and spent a lot of my childhood wanting to try this landmark.  Finally, now as I am a little older and was here in Downtown Brooklyn as my Nanny always called it. I got a date to agree to Sam's after a date night.\nFirst thing I realized is because it is so old school and rustic, it is like I am back in the day with my mom and dad and their courting dating days.  The pizza it was just tremendous everything that my family told me about since I was a kid and more.  You felt like being there you are in old time back in the day our parent's era Brooklyn, and honest you realize it was a pretty kicking cool place to be.\nYes, the service is slower than probably some other places like I said I was on a date so I enjoyed some extra talking time. They prepare everything to perfection I imagine doing old school takes a little bit longer, but trust me when I tell you it is worth every moment of waiting the moment you sink your teeth into one of their slices or my date had veal parmesan they are just treasures of the food palette.  They are something everyone should experience if they want to have an old feel Brooklyn experience.\nThe prices are not over the top high, but it is cash only for us here in the credit age always something to keep in mind. Next time you decide you want to go have a piece of what Brooklyn was probably like for our parents growing up, make a trip to Sam's, you may not have been even a twinkle in your parents eye back then, but you will feel like you are walking down memory lane.  I for one always hope there will be a Sam's in Brooklyn for us to go back to and relive Brooklyn Golden Age.", "author": "Ashley Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "Let me start with the main points of my review. Firstly, Sam's pizza is the best in Brooklyn. I truly believe that. Secondly, the other dishes are quite good and beat out La Villa and other similar Italian restaurants. And third, Sam's is not for everyone. \n\nLouie is a particular personality. He's straight forward, humorous, and hardworking. Understandably, not everyone is looking for that when dining. Some might deem him abrupt, but he really is a very nice person. He's great with kids! If you're willing, you'll not only have the chance to have a fantastic meal but engage with a waiter that entertains and speaks with you as if you're an old friend. If you're looking to have an uninterrupted meal, this isn't the right place. Louie will speak with you, tell jokes, and catch you up on the neighbourhood.\n\nThe decor hasn't changed in decades, so you will absolutely be transported back in time. It's a nice place to go to escape.", "author": "Anthony T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "The real deal! Best italian food in Brooklyn by far. Hands down\n Don't mess with Sam, just eat his food! We will be back.", "author": "Dan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Walk through the door of Sam's and you go back in time to Brooklyn the way it was decades ago.  The decor takes you back, the high quality, authentic, delicious pizza and Italian dishes take you back, and best of all Louie (the owner, chef, waiter,-what ever needs to be done guy) takes you back with his friendly, straight forward Brooklyn style.  We went recently to celebrate a birthday and you sit down and it's the ambiance of Saturday Night Fever, Grease, Bronx Tale.  The Pizza is one of the very best I've had anywhere, high quality sauce and mozzarella, no additives, baked in an old oven that you cannot find today. The Chicken Parmigiana was also Excellent.  Everything that was ordered by our party was authentic and delicious, and is made fresh, so you will have to wait, but it's worth it.  I give it five stars because of the food, and because there is no place quite like it that I have found.  It is unique trip back to a simpler time, a Brooklyn where everyone and everything was 'straight up' and not a watered down drink.", "author": "Charles D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "There's a Yelp review that says \"the waitress was confrontational,\" and I think that statement would actually apply at Sam's Restaurant, albeit for the owner/host/also our waiter (?). My family and I stopped in for a big holiday lunch and were summarily harangued by the owner in a not-unexpected style. I think it's part of the schtick here and it can be quite charming if you're up for a little old school Brooklyn hospitality. \n\nSam's has been around for a long time and it looks that way, but it's a nice step back in time to when there were a lot more places in Brooklyn like this. It's definitely an old school place with a vintage vibe. We ordered their terrific baked clams to start as well as a pizza which was excellent. I had fettucine Bolognese as my main which was great too - A comforting, red sauce Italian choice and the egg pasta was delicious! The portions here are huge and the prices are relatively low, so it's a great choice for big groups or families. \n\nAs for the owner, he's a piece of work, but hard working as well as entertaining. I can see why it's a standby for so many and a great choice for a traditional Italian-American (Brooklyn-style) meal in the area!", "author": "Justin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "This place is 4-stars if you go in with the right attitude. \n\nMy family has been coming to this restaurant for decades. The energy at Sam's has suffered ever since the current owner took over from his parents, but the pizza and veal Parmesan (2 best items on the menu) are still delicious. If you're not down for the musky, old-school, Brooklyn pizzeria ambiance, order a pie to go.", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-15", "description": "Once I was successful in eating at this place.  The food was good.  I say \"successful\" because this place is ALWAYS closed.  Bitter cold today, bitter.  Went out of my way to have lunch here and the boys didn't show up for work.  This has happened before and I'm done.  \n\nBeyond the irresponsibility, they are one of those cash-only, open only 5 days/week, closed-for-a-month in summer kind of places.  If the idea is to behave like a poor man's RAOs, you better damn well have the quality to back it up.  They do not.", "author": "C R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-17", "description": "Order :\n\n1 Mood stabilizer / Anti depressant for the waiter\n1 Side Mouthwash for the obnoxious sounding owner\n1 Cooking Workshop on how to keep your kitchen clean and get an A with the DOS\n\nI am more confident ordering cart food at 3AM in the LES than going there.\nPlenty of amazing restaurants around Sam's.", "author": "Blind T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-11", "description": "Let's begin with the decor, dark, dreary and plastic dusty flowers that look like a prop from a horror movie.  A statue of a \"naked goddess \" sits proudly exposing its penis for all patrons and children to enjoy. The best thing about dinner was the toasted bread brought to the table from a hidden kitchen in the rear of the restarting . The food as a whole was disgusting served with 4 oz. sized drinks at $2.75 a pop! They served seafood that was old with a pungent taste as soon as it hit your mouth. Unacceptable and definitely a safety issue. The owner was abrasive and had no sense of boundaries! With so many fine Italian food eateries in the area, why choose one that is neanderthal at best! Save your money and don't take a chance on getting sick. This place sucks full circle!", "author": "Yolanda R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-09", "description": "I went there the other night and it was disappointing.  The owner was waiting and busing tables and he was totally flat-out.  He is quite the character, very old-school Brooklyn, and chatting with him was the high point of the experience at Sam's.  He knew a lot of the patrons and there was a lot of good-natured ball-busting going on.\n\nUnfortunately... the decor.  Very shabby like a run-down VFW and the lighting was horrible.  It's obvious they're very neighborhood-oriented and old-school, with an American flag and WTC/9-11 photos, and something could be done with it.  And there was a bit of an off-putting smell.\n\nWe decided to stick it out on the hope that perhaps, despite the decor, the food would redeem the place.  Sadly, not so much.  Both of our dishes were pretty flavorless.  The sauce was bland.  No taste of garlic or basil to be found.  Not even salt.  The meat was the same.  Completely bland.  There was maybe one piece of sausage in my lasagne, which was almost totally lacking in ricotta.  \n\nI feel bad writing this review.  The owner is obviously a nice guy beneath his gruff exterior and Sam's has been around forever.  But they really need some shaking up and a decor overhaul and if ever there's a candidate for one of those restaurant rescue shows, this place is a prime candidate.  It can be a whole lot more than it is.", "author": "Steve Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-08", "description": "Most of the reviews for Sam's are on their Pizza, and it sure looks good, and I need to make a point of going their and eating the pizza, but fact of the matter is I've never had the pizza at Sam's. However, I have had their pasta dishes on multiple occasions, and they are oh so yummy - delizioso!\n\nSam's might not be trendy looking, and the menu might not be, the cliental isn't really either, plus the plating might leave a lot to be desired, but none of that matters.  Truly!\n\nIf you want simple, fresh italian food this is your place. I have dreams about their meatballs, and I have nightmares that they have never touched my lips. Quality ingredients make up these simple pasta dishes filled to the brim with flavor, and dare I say made with what what my taste buds can only describe as LOVE.\n\nThe service is warm and friendly in this charming space and will have you wanting to come back time and time again.", "author": "Kate P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-15", "description": "Sam's is an island of Southern Italian American culture and cuisine. The pizza is delicious, the owner is a stitch and the decor makes you feel right at home. Sure you can find similar old school establishments in Dyker Heights, Bensonhurst, Gravesend and even Bay Ridge- but for those of us who have left these old Italian American enclaves of Southern Brooklyn, it is refreshing and pleasant to know that Cobble Hill has retained some of its character with restaurants like this 1930s gem. \n\nLouie fills the wine glass to the brim, drink it in and try the shrimp oreganata.\n\nN.B.: the service is quite slow; this is a casual dining experience and not fast food.", "author": "Alexandra G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-19", "description": "Family business that's been there for years. If you want really good food, get the Veal Parmigiana.\n\nThe owner who runs it is really sweet. For those of you who have lived in BK for 20+ years, you know what old school Brooklyn tastes like.", "author": "Blaize B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-16", "description": "5 stars, although I imagine that ownership couldn't care what anyone says on the internet. They likely have no respect for this method of semi-anonymous criticism.\n\nReading several of the other reviews provides an interesting social commentary on the dramatic shift of the neighborhood formerly known as South Brooklyn.\n\nThis place provides a rare looking glass into what this area resembled decades ago, and should be respected as such. \n\nSam's is not a recreation, or a theme. It is authentic.\n\nIf the staff acts cranky, it is to be expected. If you had the same job every day for 50 years, I would imagine that you would become a crank, as well. That is unlikely to happen in today's fickle business climate, as longevity is under-appreciated in our society. Perhaps you should file the staff's gruff demeanor into the Performance Art category, in order to properly enjoy the show.\n\nThank you, Sam's, for keeping it real. Old-school baked clams, pizza, \u0026 eggplant parmigiana are timeless.", "author": "Vic C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "Pizza was really good and we've had Lucali and some of the other neighborhood favorites before. The place reminds me of my grandma's basement, but not in a bad way. The service is super slow but the guy has a lot of character. Come for the pizza when you have time but don't come and expect a quick meal.", "author": "Meghan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "Great coal fired pizza like none other.  Went on a Brooklyn pizza tour here and this was by far our favorite.  Just get a plain pie and you'll be set.", "author": "John D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-09", "description": "We had a great experience at Sam's!\n\nFirst, walking in reminds me of a Scorsese film. The decor may be old fashioned, but it adds to the charm. The wait staff is very friendly and personable, ask for Alex-he was excellent. He recommended the mussels in white sauce which was delicious. My wife had the pasta bolognese, which she loved, and my daughter had the chicken cutlets.\n\nThe price is very reasonable and I would definitely recommend this place to all my friends. I can't wait to go back and try the pizza!!\n\nGood job guys!! Don't change a thing!", "author": "David A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-05", "description": "Walk down into Sam's and step back in time.\n\nThe wood paneling...fluorescent lighting...the many locals stopping in to pick up a pie to take home...it's all like 1967.\n\nThe service is friendly and not annoyingly overly-attentive. The bread that comes to the table is warm, sliced and outstanding.\n\nThe prices are pretty reasonable, but don't expect Olive Garden-like portions for the pasta. \n\nThe pasta fagioli soup was really good and perfect for using some of that great bread to sop up the leavins' with. The minestrone needed a little more salt but it had all the good you'd expect from a proper minestrone soup.\n\nSpaghetti with clams in the white sauce was heavy on the garlic and kind of oily, but it sure did taste good. Again- the bread comes in handy once you finish your pasta.\n\nThe real surprise here was the steak! A nice 14 ounce ribeye, cooked to perfection and really flavorful. This was better than most steaks I've paid twice as much for.\n\nI noticed the sign on the door: \"no slices\", so next time I visit I will bring enough appetite for a whole pie. I've heard good things about the brick-oven pizza but have yet to try it.\n\nNot the greatest decor here but good comfort food Italian in a friendly atmosphere with reasonably priced wines by the bottle.", "author": "Jason V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-17", "description": "\"The old world\" decor is not charming. It's dingy and depressing. The staff are not \"interesting characters.\" They are rude and obnoxious to everyone except the regulars. The food is good, no doubt, but why give your business to people who are not welcoming to everyone?", "author": "Keith K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-10", "description": "Didn't quite know what to expect having read the reviews but this really was superb tasting pizza. We went for 5pm dinner with 5 kids and two couples. Kids devoured pizza and spaghetti. Huge portions. \nThe waiter/owner? was really good with the kids and as a non native I loved his authentic New Yorker Italian charm. Would def revisit.", "author": "Cat J."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Sam’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "238 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/hz4zqtC67Bi3F6PChXOQHA/ls.jpg", "@type": "Restaurant", "telephone": "+17185963458"}