{"aggregateRating": {"reviewCount": 214, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-05", "description": "Editing this as of 7/2016. Has gone down in quality a little bit, and the pizza is bland, topping are skimped to save money.  BUT the Italian cheesecake is amazing. That gets a star on its own it's that good.", "author": "J D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-12", "description": "Had lunch here yesterday --- food and service was great. Owner was a super nice guy. And the decor inside is untouched by time. If you want an authentic South Brooklyn experience, GO HERE!", "author": "T B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-18", "description": "I won't comment on the pizza, as I haven't had it and in this city, those are fighting words. I came for soup and left happy. \n\nThis place is definitely old school. There's *no* glitz here, but there are tons of family photos around the bar. One waiter and less than a handful of cooks run the place; definitely a personal experience. He's a bit slow, but that's fine, if not a bit relieving. \n\nI usually order the pasta fagioli when I come here, and it's been good both times I've passed by. It wasn't consistent, however; the soup tasted less saucy the second time around, but the pasta itself tasted great both times. Apparently it's home-made on some days,  which must be a treat.\n\nIt's nothing special, and it's certainly no Grimaldi's or Patsy's. However, it's a solid dinner experience in the Gardens that I highly recommend.", "author": "Carlos N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-07", "description": "If you are in a hurry or have a bad attitude, Sam's is not  the restaurant for you.\n\nBut if you want to have a laugh with Joe, joke around with Lou, eat some delicious pizza and pasta and enjoy a real Brooklyn establishment you should come in.\n\nThis is a wonderful restaurant to eat a big meal at affordable prices and enjoy each other's company without feeling rushed.", "author": "Lily B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-29", "description": "It's time for this dump to finally hang it up and make way for a real restaurant.\nThe following is based on my personal experience at Sam's restaurant and reflects my opinion.\nAte at Sam's a number of years ago.  The food was mediocre, but the problem was the owner/waiter.  Sense is that he is unbalanced - worse than the soup Nazi on Seinfeld episode.  Overbearing in a bad way; opinionated about things that are of no concern to him and outside of the normal ordering discourse.  He makes up his own ad hoc restrictions on what you can order.  Like wearing a straight-jacket. This is in addition to the verbiage on the top of the menu that reads something like: absolutely no substitutions or variances, else will be charged at full price (paraphrasing).  Anyway, my wife and I walked in tonight about a half hour before closing.  I tried to order a chicken Parmesan hero.  His response was that he doesn't [want to] do sandwiches in the evening - that I would have to order the full plate at nearly twice the price and I didn't want pasta.  Absolutely nothing on the menu restricts sandwiches to the time of day.  I said I'm out of here. As in the past, he was totally unapologetic - just issues orders to customers.  I've had enough of this lunatic.  If you think this review is an outlier, please take a few moments to read the other one star reviews.  Old, dingy and rudeness does not, in this case, equal quaint or charming.", "author": "Roger G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-11", "description": "we were a bit hesitant coming because last few times passing by you can tell that the place was dead when everyone else on the block was packed.  walking in, the first thoughts were \"someone needs to call robert irvine or gordon ramsay\" because this place looks like a candidate for a kitchen nightmares.  on the inside, the place looks like a vfw or a store that you would go to buy trophies for your son's baseball team. \n\nwe sat down and could see one guy working the tables.  no busboy, no hostess,  just the 1 guy.  didn't see any evidence of anyone else working there the whole time.  we aren't sticklers for bad service but it took the guy 15 mins to come over to us and 20 minutes to bring us drinks.  the waiter did find plenty of time in between to talk for 15 minutes with one of the other tables.  ordered the hot antipasto and a pizza.  the antipasto came and tasted like complete mush.  rubbery cheese, tomato sauce like ketchup, poorly breaded shrimp.  this was either made and frozen 3 weeks ago or store bought 1 week ago and microwaved.  i had thoughts of clicking my heels 3 times and being teleported to an olive garden in times square because that would be such an improvement.  the waiter also makes comments to tables as if his politics are that women should be barefoot and pregnant in a kitchen somewhere. if the good was good i would be more than fine with his antics but i would rather be home eating hot pockets.  finally the pizza comes and the sauce tastes and looks like ketchup/paste.  i've had dollar pizza in manhattan that makes this pizza look like roberta's.  finally, we finish and the waiter gives us a bag with our left over pizza.  didn't want to offend so we actually walked out with and just threw it out a block away.  \n\nseems like they gave up a long time ago.  i don't understand how there are some good reviews.  ellios pizza and lean cuisines would be much better.", "author": "Mimi S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-10", "description": "We were a party of 5, including 2 young children. I asked the owner /waiter to please cut the kid's slices into smaller pieces. He said I should do that myself and gave me a knife. (I've been to many pizza places and in 30 years, no one has ever refused to cut a slice for kids to eat) At the end of the meal I asked for the check and waited 15 minutes. When I asked again, he said \"I heard you the first time \", them made us wait another few minutes. The place wasn't even busy. I would never go back and here's why - the place isn't good  enough to have to deal with nasty, bad service.  I'm all about the food- if Roberta's, Lucali, Pauli Gs had nasty service, I'd still go there. (And they actually have good service) But this pizza is nothing special at all. Even if the service had been good, I probably wouldn't have returned. In a town with so many great pizza place, there's no reason to go here.", "author": "Wendy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-10", "description": "Althogh the food here is good,I really don't get the masochistic tendency apparently displayed on this board regarding rudeness and poor service. It's not a cool \"Brooklyn\" thing to insult your customers and act disparagingly towards them. As a native Brooklynite, and an Italian one at that, I take offense at remarks that glorify the ignorant stereotypes of my culture and reward businesses such as this for capitalizing on them.\nBrooklyn Italians are gracious, hospitable, warm hearted, and CLEAN! Don't reward this...or any other establishment...for making it appear otherwise.", "author": "Jo M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-18", "description": "A complete throwback Italian red-sauce joint from the 50's.  The decor remains unchanged.    \n\nPizza, baked clams, veal parmigiana, steak a pizziaola, zuppe di pesce, etc.  All very solid.\n\nDon't expect to find osso bucco, risotto with truffles or a 1997 borolo at this place (and that's not a bad thing).\n\nFirst time there, I ordered a pie with sausage.  The first bite brought me back to Little Italy in the Bronx 25-30 years ago, when a big treat was taking us kids out for pizza at Ann \u0026 Tony's on Arthur Avenue.  Pure heaven!!\n\n(For you youngsters out there, New York back then was just like the DeNiro movie \"A Bronx Tale\".)  \n\nHungry and want something straight forward and delicious at a reasonable price?  This is an excellent choice.    \n\nPerfect for families (bring grandma and the kids!) or groups of 20-somethings who want a solid foundation in the belly before a night of heavy drinking.", "author": "O U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-03", "description": "This is the type of place you see someone in the mob movies get whacked in.  Friendly banter, slow but pleasant service, and straight-up Brooklyn style Italian food.\n\nI'm giving this 4-stars and did not even try the pizza!  Had the Spag + meatballs, which were nice.  The meatballs were a bit dry, but tasty nonetheless.  The girlfriend had the fettuccine bolognese, which was considerably better.  Everyone's pizza looked delicious, so I will need to go back for sure.\n\nThey are slow on the service, so this might annoy some people.  A sign inside reads \"Today's meal, two choices: 1) Take it 2) Leave it\".  I found this very fitting and didn't see anyone who opted for option 2.", "author": "Neil T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-25", "description": "Went in for an early Saturday night dinner (6ish).\nThe exterior looks like a set from a Scosese classic and once you step inside you feel like an extra in the film. I love the two built in phone booths. I thought Jimmy Olson was going to rush in and phone a scoop into the Chief.\nOrdered a Tanqueray \u0026 tonic and they are very stingy with the tonic! (they put a lemon in the G\u0026T - I'm accustomed to limes- but I was concerned that I might perturb our waiter if I requested a change and let it go)\nThe waiter, pleasant and whose wit was as dry as the gin, looked a bit like Vito Spatafore's older brother (for you Soprano fans). He did reprimand us for not eating the marinated mushrooms in the salad. We did precisely what he told us to do and tried the mushrooms (his demeanor left us little choice) - Unbelievably good! They marinate the mushrooms themselves!\nWe had the pepperoni  pizza. I've been eating pizza for over 50 years, this was probably one of the best I've had. The crust, not real thin and certainly not thick was crisp and delicious. You could have had the crust alone, with perhaps a little oil and Parmesan and been quite happy. But it was the sauce that was exceptional! Sweet yet , spiced just so. The cheese was excellent and nothing overpowered anything else.\nWe also had the baked ziti. I was told it was excellent if not quite hot. \nSam's, while surrounded by some trendy looking establishments, warrant's your attention.", "author": "Les S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "I like sams for pizza. Had take out the other night and the pizza had good thin crust, enough cheese and good sauce. Brooklyn classic.", "author": "Jeff D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-10", "description": "Apparently if you order the pizza by phone you can't eat it in the restaurant!  Unbelieveable!  We ordered our pizza by phone because we had guests in town and realized the restaurant could have quite a wait (not because it is packed but because it's not run efficiently, nor is it adequately staffed).  When we arrived Sam told us that we had to take our pizza to go and order another pizza to stay because he doesn't do phone orders for sit down customers.  \"You can't outsmart me.\"  \n\nWe decided to leave because he was being rude and I told him he could have been a little more flexible in his policy.  He told me that being flexible is not the Brooklyn way.  He also called me a \"piece of garbage\" in front of all the other customer.  He yelled us out the door and told a homeless guy outside the door that he was going to shoot him.  \n\nIf you don't want drama at dinnertime, avoid this place.  Nonetheless, the pizza is very good.", "author": "Laurian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-29", "description": "This is some real deal, old school Brooklyn right here.  The decor with its checkered table clothes, ancient looking bar and fake flowers looks like it hasn't changed since 1950.  It's family run and these guys have been running the place forever (I think it opened in the 30s, and this one family has been running it since the 50s).\n\nThe pizza is outstanding, legit, excellent pizza.  The crust, the sauce, the cheese... bellisimo.  This is worthy to be in the ranks of the best Brooklyn pizza joints.\n\nThe kitchen closes around 10, I think --  even on Fridays, so get there early.", "author": "Katie Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-10", "description": "This pizza was very bad. My boyfriend and I got a pie to go (half plain, half sausage) and took a bite of the plain slice on the way home. It was so bad, we instantly decided it could not be our dinner. We gave 1 slice to the homeless woman we passed on the way home (I am not sure of her thoughts on the pizza, but imagine they were neutral at best) and the rest of the pie we left sitting on a trash can (hoping that other needy people would find it). \n\nAll of the ingredients were inferior, even to the average NY slice. Really, like inferior to Sbarro's. I am not trying to be a hater; I really mean this. Save your money. This pizza tastes badly.\n\nTo give this review some context, we love Keste, Artichoke, and Lombardi's (have not been to Grimaldi's that many times, but it's quite good too). And as for your averages slice, Joe's at W 4th is good.\n\nI am sure all the good things about service, etc. at this place is true, but the pizza is rotten.", "author": "Audrey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "SOoooo old school. Best pizza in NY? it's good. I'll say that. I prefer it to 9 out of 10 pizzas in the state. The difference here is the crust. Delicious crust. Same luscious smoky sweet as Di Fara's. \n\nSooo old school. I wouldn't count on freshness being a part of their integrity, but I trust whatever is comes canned to taste good. The place reminds me of the Fratelli Brother's restaurant in Goonies. I was going to go to the back to pee but then I think I heard echos of Sloth and so I held it. I think it's just the old wood and dusty lights, but the place seems cavernous. I can just imagine their storage chest and freezer now... \n\nPizza prices are elusive. We were charged 20 for the pie and 5 for a sausage add-on. Next time I would like to choose anchovies or escargot as the topping. Have you ever noticed that on TV they always order anchovies??? but in real life NO ONE orders anchovies? They should. Anchovies are great. They are mainly just salty bits. Once you get past the fact that they are a fish, they are awesome. Try putting salt on your pizza - that's usually pretty good. Now try anchovies. try it. try it. \n\nYou might be disgusted because the old waiter hasn't been bothered with hygiene since the 70's. Instead of inquiring about that, I asked him, \"What makes the pizza so good?\" \n\"Well, we'eve been making pizza since 1959.\"\nAnd they've been open since 1930. What were they doing in the interim? Making the sign I guess, because it's hard to notice that they are a pizzeria and not a steakhouse from the Steak Chops signage. That's what dismayed my friends from coming in before. Now it's Sloth.", "author": "Jeff O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-21", "description": "This is the best pizza in Brooklyn. Ok, so I haven't been to Di Fara. Sue me. And on that note, why does the Yelp population put that place over? This is thin crust Brooklyn pizza we are talking about. Once it's perfected, there is no reason to shop around. And Sam's pie is simply perfection.\n\nIf you've ever visited this place on a weekday night, there is a very good chance Louie has served you (or harassed you a bit). The man may be a bit much at times, but it's clear he has a tremendous amount of pride about his establishment . And that simply cannot be criticized.  As told by Louie, Sam's has been in his family for over 75 years. He was actually raised in the apartment above the restaurant and  has worked there basically ever since. Chat him up when you visit. He has a million stories about the real Carroll Gardens.\n\nBut onto the food. I'm going to say this once, bless Louie's little heart, but the non-pizza entrees are below average. Don't even try the pasta. It's bland and unnecessarily filling. The Sam's salad is a passable antipasta and includes provolone, salami and roasted pepper on a bed of iceburg. Order one for a table of 4 (even if Louie tells you to order 2). After all, you have to save room for the pie.\n\nAnd onto the pie. As noted, the restaurant has been around for over 75 years, and if you subscribe to the idea that an old pizza oven cooks better pizza, they don't come much older. I typically will order one large veg/cheese and one large pepperoni, which feeds 4 just fine. Ok, it's a shit ton of pizza and you won't want to stop. So be prepared to be stuffed. \n\nThe pie is always the perfect temp (molten and liquidy for the first 5 minutes, so be patient; steaming and gooey soon after and ready to serve). The sauce is magic. Just the right tomato, sweetness and spice combination. And the cheese is top-grade. Nice fatty mozzarella. The meat is also top-grade and presumably procured from one of the local butchers (will have to ask Louie next time).\n\nSam's is cash only, so come prepared. And price wise, it's not terribly cheap ($17 bucks for a large pie), but time is money and who doesn't want a Lombardi's or Grimaldi's caliber pie without the annoying wait?", "author": "emcee b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-28", "description": "Still Old Schoolin' it in Brooklyn. How can you not love a place where the menu is half food/ half cocktails, the decor hasn't changed in 60 years, and the waiters ain't got no time for your bs? Great, great neighborhood place. Sam's Restaurant is all class. \n\nP.S. Love their pizza.", "author": "Michele W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-13", "description": "Sam's is the perfect place if you want to time-travel back to 1976: Travis Bickle's New York City.  Checked table clothes, families ordering bowls of pasta in the corner, cash-only, slow, but teasing and friendly service.  \n\nThe pizza is phenomenal.  Get a Peroni eat the whole pie.  Seriously, the waiter will judge you if you don't.  \n\nI  @#*\u0026^%*\u0026^  LOVE THIS PLACE.", "author": "Erica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-18", "description": "\"If you're wife can't cook, don't divorce her!  Come to Sam's instead!\" \n\nYou gotta love Sam's.  Yes, Lucali might be a bit better, pizza-wise, and sure Louie can be cranky, and no, the rest of the food isn't very good...but if you love slipping into a red horseshoe banquette, sipping a straight rye, digging into a perfectly tasty sausage-and-pepper pie and feeling like you're in 1958 (although the family's had it since the 30s), look no further.  Further bonus: with the possible exception of Stroller Happy Hour, you can ALWAYS get a table - or a booth, for that matter!", "author": "Sadie S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Sam’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "238 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/hz4zqtC67Bi3F6PChXOQHA/ls.jpg", "@type": "Restaurant", "telephone": "+17185963458"}