{"aggregateRating": {"reviewCount": 214, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-26", "description": "This is one of my favorite places in Brooklyn, and it's not because the owner calls me beautiful even when I'm in a Yankee's cap and my fat pants (although that helps).  It is just truly old school red and white check table cloth authentic.  All the guys that work there are over 55, the cash register in the back is made of wood, and last but not least, their meatball parmesean sub is something I fantasize about an abnormal amount....but oh man, once you have one you'll know what I'm tawkin' about.  It's big enough for 2 meals but you just can't stop it's so good.  Absolutely perfect, I would not change one thing about this sandwich.  I wouldn't even change the fact that they don't deliver since it would deny me my catwalk entrance and the accolades of the adorable staff.  A true Brooklyn experience in a 'hood quickly being absorbed by American Apparels, and trendy bars.", "author": "Katie Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-31", "description": "Best Pizza EVER!  Sam's has been around since 1952 and that's definitely part of the charm!  Yes some people might be put off by the old style decor, but that's not what this place is about!  It's about the pizza!  You cannot go wrong (or the calzone for that matter).  And in response to a previous review, there is a sign that specifically states \"No tank tops\" so if you chose to ignore the sign, that's fine, but don't even bother going in because Louie does not make exceptions to the rules.", "author": "Alexis M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-06-22", "description": "I hate to do it, but i can't just avoid reviewing this place because my opinion differs with everyone else. I hope I don't get flack for this because I don't enter a place wanting to hate it.\n\nWith that said, it's not that I hated Sam's... In fact, I loved it. I was a little taken aback by the divey look, it's not by any means quaint, but it has an \"old school\" look that you warm up to. Again, I was pretty surprised by the waiter/owner/son-of-the-guy-making-the-pizza's... he was a throwback, as well. You could see the wife beater underneath the white short sleeved collared shirt which was opened at the top so chest hair poked out. The first words he said to us were, \"It's an hour and a half wait for pizza.\" Oh, okay... it didn't really look like there were that many people there, but I guess they had a lot of delivery orders and just one man making the pizzas. We decided to stay and just order something else (we were hungry and planning on catching a movie). \n\nMy boyfriend ordered calamari, I ordered gnocchi. He loved his calamari, thankfully, because I didn't. Dry and not chewy, but it tasted to me like if thick rubber bands could be easily chewed and then there was this burst of fishiness right before I swallowed that nearly made me gag. My gnocchi was terrible. It's pretty much my favorite food, so I've sampled it in many different establishments and it's never been quite so bad... I was really hungry and it was one of those things where I just kept eating it to see if I could pinpoint why it tasted so bad. I think it was the gnocchi itself, the sauce seemed okay. I left more than 3/4 of my food and the hairy chested waiter (Louie) came over and said, \"I'm wrapping that up for you to go, right?\" I couldn't refuse, but I dumped it a couple blocks away. Don't worry, it won't go to waste, Kristine... a lot of people root through the garbage at night in the area. \n\nAnyways, I obviously have nothing to say about the pizza... I'm sure it's great, but I would never go back. I wouldn't even wait for an hour and a half for difara's and that place is an institution (when it's not shut down for food violations). The service was slow... I love family run places, but they either need to recruit more family members to work or HIRE some people... Also, Louie was a cool dude and all, but he's loud and hearing a guy loudly complain to various people definitely didn't enhance my dining experience.", "author": "Haley C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-19", "description": "Sam's came highly recommended by a very wise friend who grew up in the neighborhood. For a while, I couldn't get anyone to go with me because one friend in particular had \"never heard of it\" and another wasn't sure about pizza at a place that boasts their \"steak and chops\" ... so I made new friends. That was a good call, because this place is great. Authentic--or so I'd imagine, not being a 68 year old Italian-American with an ounce of authenticity myself. We had a couple of drinks (not much to speak of, but strong), an antipasti platter (replete with sardines!), and a cheese and mushroom pizza. The sauce was great, the crust was delectable, and it was cooked perfectly. The much-maligned service was just fine: not kiss-ass, not cozy, not cute. Just ... you know, decent. He got our food to us, as we ordered it, in a suitable amount of time. I highly recommend.", "author": "Kate M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-24", "description": "totally hit the \"i need a homecooked meal\" spot.\nbaked ziti alla siciliana lasted dinner and lunch the next day - delicious eggplant, perfectly burnt cheese... \n\noh! i almost forgot - the bread before the meal was fresh out of the oven, soft and crusty.  SO good.\n\nthe service was pretty terrible, but the waiter (probably owner) was charismatic enough that you temporarily forget that you've been sitting there without a drink for the past hour or so.\n\nthere were more pictures of the world trade center than there were items on the menu.  that was the one thing that kind of took me off guard.\n\nalso - the only place i've ever been to that serves 20 oz bottles of soda.\nwell played, sam's.  well played indeed.", "author": "Danny O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-12", "description": "This is truly the pizzeria that time forgot. I'll seriously be devastated if they close down and some bland wine bar or boring bistro opens in its place. This is the best pizza I've ever had in NY, and yes, I've been to Lombardi's and Grimaldi's. I've tried the meatballs and eggplant parm, and they were just short of crappy, but the pizza is a marvel. Louie, who runs the place, is a total trip.", "author": "tamar a."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-18", "description": "I walked into Sam's as a boy, and came out a full fledged man.  The Manhattans the tough waiter served me put enough hair on my chest that whenever I go out drinking now I seem to be only getting hit on by werewolves.  I'm a big fan of old school haunts in an area - and this place reigns to be exactly that.  Much like most of the other reviewers on here, I have to say you wait a while for your pizza but when it does come it's some of the best I've had.  I think it might have something to do with the fact that they are still using the same brick oven pizza they originally opened up with in the 1930's.", "author": "Eric S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-07", "description": "You cannot really beat the vibe at Sams. \n\nI can't even imagine how many dudes might have had their kneecaps broken in the back room over the years. The pizza is awesome (usually), the service is cranky (in an endearing way) and  the only place I've been to that rivals it is Totonno's (the Coney Island location). \n\nIt's much, much more than a meal, if you want a pizza with some real character - this is your place.\n\nLast time I went, the old man was the only one there. He took our order, bitched about being the only one there working, made our pizza and then proceeded to fall asleep at a table across the room. Amazing.\n\nLet the tourists have Grimaldi's, Lombardi's and all the others... Sam's is as legit as they come.", "author": "clements w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-14", "description": "The pizza is really good....but we are scared to go off the safe path of salad and pizza.  \n\nThe menu is enormous and the place is never really full...so how often can the food be turned over/fresh?\n\nAt any rate, the pizza is really good.  Been about 8-10 times now and it's never been anything less then delicious.\n\nThe decor and wait staff (Louie) are one of a kind.  The place looks like a rec room with wood paneling on the walls and tables with plastic and red \u0026 white checked table cloths.  Lighting is not forgiving.\n\nLouie is one of a kind.  His family has owned Sam's since opening and he run's Sam's the way he wants.  When he tells you to sit at a specific table...don't ask to move or sit somewhere else.\n\nBe warned that the wine is poured with a heavy hand.", "author": "Kevin P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-22", "description": "I hate to knock a neighborhood institution, but my BF \u0026 I went here last night \u0026 both of us experienced very unpleasant, um, gastrointestinal issues. We shared a pizza without meat, which tasted fine, but then both spent far more time in the bathroom for the rest of the night than is acceptable. We suspect poor hygiene to be the culprit: both waiters were busing/ wiping down tables \u0026 then definitely not washing their hands before delivering food to tables, writing down orders, making drinks, \u0026 carrying drinks to tables by holding the glasses from the INSIDE! You know, when someone buses a bunch of glasses by grabbing three glasses in each hand by their fingertips? Yeah, that's how drinks were coming from the bar. Aside from the apparent mild-ish food poisoning, the pizza was fine at best, \u0026 certainly not worth the price. The borderline-negligent service was the least of our problems. And others find the interior charming \u0026 \"grandpa's basement\"-like, but the charm was lost on me. It felt like a community center. And let's not forget, it made us sick!", "author": "Katie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-10", "description": "The 'old man' has been hand-making the pies here for decades.  I've never had better pizza.  Ingredients are amazing.  \n\nFull pies only no slices, but its cool-- I could eat a whole one myself.\n\nAs other reviews have noted, the guys here are characters.  Sit down, eat in, and enjoy the amazing pizza.", "author": "Doug M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-31", "description": "The pizza is great.  I have not eaten anything else.  However, I think that if you intend to have a lovely out-of-home dining experience, it's not going to happen here.  Apparently parents have no idea how to appropriately deal with their screaming children in this place.. they just let them scream.  And unfortunately, the waiter, seems to further engage their behavior (sticking out his tongue at them, etc.).  Regardless of when you give Lou your order, twenty minutes can pass (because he is too busy with joking with the locals and making faces at little kids) to walk back to the kitchen and drop off your order.  Let's not pretend that we are on the Sopranos here.. put the stupid order in, then make all the faces and chat you want with your people.  Again, the pizza is DELICIOUS, but its annoying having to wait for Lou to come to your table, only when he feels like it.\n\nI will never EVER bring anyone I actually care about to this place, because the service is JUST THAT BAD.", "author": "Shelby S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-05", "description": "Let me start this review by saying that Louis is hilarious!  He is the first to greet you when you walk in and, boy, does he have personality =)  I love this guy!  I come here often with my family because they have the best \"old school\" brick oven pizza around.  Their pastas are good, too.  But I really do go there for the pizza.  Mangia! Mangia!", "author": "Mimi R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-05", "description": "I honestly don't get the hype.  The sauce was kind of sweet and the cheese was lumped on unevenly and the crust was way too chewy.  Maybe we went on a bad day?  I'll definitely give Sam's another chance because I really want to like it, but wow.  What a disappointment.", "author": "Abigail S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-24", "description": "My favorite pizza in NY.  One of the few coal oven pizzarias in New York.  It is run by Sam's son and grandson.  I would skip the pasta and just order the pizza.  The crust is terrific.  Patsy Grimaldi's,  Totonno's and Lombardi's get a lot more press, but I think Sam's is just as good.  \n\nAlso note that the space is like a step back to the 30s.  Can't beat it.", "author": "Uncle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-15", "description": "I've been here a few times - it's definitely a weird place, but the pizza is great and it's definitely an experience.  Our waiter was friendly and jokey last time I was in with a few friends.  The decor is great - decades old, and like you've stepped back in time.  So much fun.  Great classic cocktails too!", "author": "Eat It B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-12", "description": "So you're in Brooklyn looking for a great thin base, freshly cooked, tasty topping pizza made with all the love you expect from a good pizzeria?...\n\nNo. Nup. Please don't. Not even for your dogs.", "author": "Dimplomaticvoice M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-07", "description": "Can't stop thinking about Lou \u0026 is exactly-filled-to-the-brim wine pouring skillz.  What a lovely neighborhood place.  Can you experience nostalgia for something you've never even experienced?  Like I wish I had grown up on the corner \u0026 been eating at Sam's my entire life.", "author": "Talia R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-04-16", "description": "I have seen this storefront of Sam's for close to 30+ years now.  Today was the first time I went in for lunch.  While the decor and the waiter are both pleasant the food has a lot to be desired.  Maybe I went on a off day.  A very off day.  I ordered a bowl of minestrone, a plate of cheese ravioli with meatballs and a diet pepsi.  It cost me $24.25 sans tip.  For about six fitty I could have bought large cans of Chef Boyardee, Progresso and a bottle of Diet Pspsi and had a much better meal.", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-23", "description": "went here on saturday night and finally had the absolute best pizza ever made...the way god intended it to be!  it only took me 30 years to find it...but i'm glad i did!  Of course I've had lombardi's and grimaldi's and other spots that are lesser known and have had what i thought to be great pizza's and they were...but sam's is truly the best...at least according to my taste buds...\nthe atmosphere is a throwback and the service was great.  they make you laugh and feel right at home...you just need a little patience if anything...\nin fact...it was so good on saturday and i read all the other reviews here so i decided to go back on sunday to see if i was just lucky the first time...wrong!  we ordered the same pizza and it was just as good if not better (at least aesthetically) \nI'm def going back and inviting my pops and mom and the rest of the family to experience pizza heaven!\noh and we also tried the ravioli and it was very tasty and so we're not afraid to order the other dishes on the menu besides the pizza...but when we go there I don't see how we'll not order the pizza!\nFANTASTIC!!!", "author": "Henry J."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Sam’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "238 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/hz4zqtC67Bi3F6PChXOQHA/ls.jpg", "@type": "Restaurant", "telephone": "+17185963458"}