{"aggregateRating": {"reviewCount": 214, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "I love Sam's its in my old neighborhood where i grew up and i used to always pass by and say next time . finally me and my brother came in and from what we heard there  known for there pizza . i kid you not the decor looks like belongs in a mob movie with checkered table cloths and plastic covered booths old not in use phonebooth but its pretty cool that they kept the old decor ,The food is amazing we had pizza with ricotta cheese lots of Italian sausage,meatballs and lots of pepperoni. This pizza is SO good that  they don't sell slices you have to buy a pie but trust me it s worth it .  its SO funny that i always come to Sam's and always get pizza  but let me tell you everything on the menu is great .i haven't been disappointed yet .The owner is a real cool guy and boy is he really funny but he is a sweet heart. The only bad thing is its cash only but after such a amazing food who cares lol . the baked clams look awesome and i hear tasted great by my hubby  and since i don't eat baked clams I'm taking his word on it . I loved the fact that its a father son Restaurant it give it that family vibe as you enter the Restaurant .", "author": "Patricia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-09", "description": "I have eaten here twice and find this to be a classic, italian-owned, red and white checked table cloth neighborhood spot.  The server is awesome, super friendly and makes any wait you have worth it.  The pizza is very good, right up there with Grimaldi's and Lombardi's.  The other food is okay, passable, not amazing, through I did enjoy the baked ziti.\n\nI do not recommend this spot for a date (boy was that a mistake!) but if you are with family or friends and want a casual dinner or awesome pizza, you cannot go wrong.", "author": "Adam N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-09", "description": "A lot of these other (good) reviews hit the nail on the head. Old School Italian. In the decor and the food. Have I maybe had better dishes? Sure, but my Chicken Parm was still pretty good. The pizza, though, was terrific. It's harder and harder to find a good slice where I live in Manhattan - seems like I need to make my way here to get one. Nice to see places like this still hang on with all the b.s. that goes on in Brooklyn these days. So, we had a party of 10 or 12. No problem other than that we were told it would be a little tight because Louie(?) had a party of 25 supposedly coming in later. But then at some point they must have cancelled and right away we were given more space and told to spread out if we wanted. Louie (I assume it was Louie - who made a \"Are you Sam\"...\"No, I'm the son of Sam\" joke) was right on with service. I can see where maybe if you piss him off you're screwed, but he obviously liked us and treated us well. A little bit of humor, some good stories and very willing to joke around with you. Maybe if this wasn't the case I'd rate it less, but at the same time, being surly sometimes myself, I can appreciate someone who's willing to tell an annoying customer to go eat at Olive Garden and then kick them out. Welcome to how Brooklyn was and should be.", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-04", "description": "This, my friends, is the pizza for which I moved to New York, let alone Brooklyn. I will never order anything else on these premises. Superb in its simplicity! Deal direct with Sam.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-06", "description": "I went to Sam's back in February and I really enjoyed it! So, I decided to take my fiance with me before a movie one night and it didn't go so well. We waited for 30 minutes in our booth without being helped. I was so sad because I really did enjoy it the first time... Maybe they have downsized their staff?", "author": "Rachel V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-27", "description": "Update: I just ate Sam's again last night and just went on a Di Fara's/Totanno's taste bender a few days before. Sam's is awesome. Di Fara's technically still has the most nuanced taste but it is an ultra-thin, sloppy, and probably too greasy of a slice. And waiting 20 minutes for two slices on a weekday afternoon is a bit retarded. Totanno's is solid but nothing worth a special trip. The crust is a little too chewy. Sam's basically, hits the middle of both pies. It's got that great blackened crust with a nice crunch on the bottom and a sloppy top. You can eat the slice without most of it ending on the plate and don't need to use 4 napkins to wipe off the grease. Again, I was not into any other entrees I had here but the pizza is magnificent. 5 stars for pizza. And Grimaldi's over-popularity will having me waiting outside Lucali any day. I think his pies are just as good without the wait (if you're timing is good).\n\nI'm just going to be upfront and say that the pizza is the only thing worth getting here. We ordered the pie with several other entrees and they were all not very delicious. But somehow the pie comes out amazing. It's almost baffling. The place is old school and a little like eating in my Catholic middle schools cafeteria (which was actually closed the entire time) if this gives you any idea of the vibe here. The aforementioned Louie  busts your chops like any self-respecting neighborhood guy would. The four stars are just for pizza. And you still need to check out Di Fara's.", "author": "carl g."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-23", "description": "Maybe we should have ordered pizza.  We popped in for lunch one afternoon because Sam's always looked like an old-school, hole in the wall that just oozed authenticity.  However, the waiter was not friendly (and actually smelled sweaty), the table-cloth was sticky, and the food was niether good nor cheap.  The entire time we were there we felt  unwelcome and as a result talked quitely.  Never would even think about going back.  I'm giving it 2 stars just for surviving for so long.", "author": "Allison S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-01", "description": "ah Sam's.  The food is amazing, and watch out for the garlic bread, its the real deal.  I haven't ordered anything that I haven't enjoyed.  Sam's has been on Court St  staple and thank goodness for that.", "author": "Dynomite h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-26", "description": "We went based on the excellent Yelp reviews and were not disappointed. Properly authentic old-school decor and characterful, attentive staff were not let down by fantastic pizza and a really not bad glass of house red. We have been twice in the last two weeks and will probably be back soon!!!! We love Sam's!!", "author": "Clare P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-08", "description": "Oh how I miss Sam's!  I moved out of Brooklyn 5 years ago and still dream of this place.  I lived in close proximity to Sam's during the 5 years I was there and just adored Sam's pizza and the surly love that I got from Mario and Louie.  The pizza is fantastic!  Perfectly spiced sauce, delicious cheese, thin but chewy crust.  I fell in love with it at first visit/bite.  Those that critique the service truly don't understand Brooklyn.  I am so glad that places like this remains!", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-07", "description": "Get pizza and eat it in the restaurant - mushroom and garlic, if you want my advice.  It is really good in-house, but for whatever reason (thin crust, i don't know...) it doesn't travel well, even a couple of blocks.", "author": "patrick d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-09", "description": "If you like authentic new york pizza along with authentic new york people, this is the place to go!  The guys running this place are hilarious!   I love these guys, ya' know what I mean?!  When my best friend came to the city for his first New York \"experience\", his only request was to eat at a real new york city pizza joint, and I took him here.  He had such a great time and couldn't stop talking about it.  We still (3 weeks later) are getting mileage out of some of things these guys were saying. The food is great and so is the experience.  Go!", "author": "M H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-16", "description": "I love Sam's, the pizza is great!  Like others have said when it comes to Louie, just go with the flow.  He is a great guy and will bust your chops, but in a nice friendly way.  The pizza is the way to go but they make a great chicken parm as well.", "author": "Mike R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-25", "description": "I absolutely love this place. As much as I love the new restaurants in the area, there is something fun about going back to basics. Great old neighborhood Italian food and waiters with character!", "author": "Gabby K."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Sam’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "238 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/hz4zqtC67Bi3F6PChXOQHA/ls.jpg", "@type": "Restaurant", "telephone": "+17185963458"}