{"aggregateRating": {"reviewCount": 214, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-13", "description": "Friendliest people. Old school. Like stepping back in time. It would have been great until Mr. Roach tried to sit next to us in the booth. That was enough for us. Won't phase many as roaches are a part of NYC living but I have my limits.", "author": "Eli R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-26", "description": "I recently had an awful experience at Sam's. I'd been here before and everything was fine: average to just above average pizza but a pretty charming old spot.  This time I went in with two friends and the waiter told us to sit wherever, but then basically refused to serve us.  We weren't in a rush so didn't think much of it at first, but as he would serve the tables surrounding us, yet refuse to even look at us, we felt like it was clearly intentional.  After about twenty minutes we asked if we could order, and he said he was just totally slammed and he'd get to us as soon as possible.  There were only about five other tables, and he was refilling people's water, clearing tables of people who had left, etc., and wouldn't even take our drink order.  After waiting for just over a half an hour we left.  He didn't even acknowledge us as we walked passed him.  I have no idea what happened but will never go back.", "author": "Fred M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-09", "description": "Went there tonight after a 20 year hiatus. Food was very good, just not as good as I remembered it. That could be because the owners father wasn't in the kitchen on this particular evening. I would definitely go back if in the area \u0026 I could find a parking spot.The veal was fork tender fabulous, \u0026 a very generous portion. I used to be a regular there when I worked in the area , \u0026 did try to go back over the years, I just couldn't get a parking spot. The pizza looked as good as I remembered it. The drinks are reasonably priced\u0026 generous. Don't order the escarole, it was terrible. Service was great \u0026 friendly. Eating there tonight, I realized how much I missed the place.Bring cash,no credit cards.", "author": "Joseph H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "Great pasta wit a soft sauce. The bread was nice and crusty. The proportion of the spaghetti was also good for dinner. One downside, the meatbalss were kind of tasteless.", "author": "Jelmer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-17", "description": "This place is soooooo awesome. My family has been going since before I was born and the entire time I've been going it has been consistently great. Louie and his family run a fantastic place.\n\nIncredible manicotti, escarole, french fries, pizza, ravioli, everything.  I highly recommend Sam's if you're looking for a traditional Italian restaurant with character. \n\nEnjoy!", "author": "Cato G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-01", "description": "Classic, old school pizza.\nI've eaten here a lot and have yet to try the rest of their offerings, but the pizza is very good and the scene is old school. Naturally, they also do take-out which somehow I always forget about - but that is handy as well.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-09", "description": "Overrated and overpriced.\nThe older vibe and the booths are classic and great. I had a party there and was banged out. Basically had pizza and baked clams and it would have been cheaper for me to have steak dinners for each person. The real cherry on the cake was when I brought my own cake and the guy, who I knew all of my life I might add, charged me $35 to cut the cake!!\nDo yourself a favor and walk a few blocks to Lucali and have real pizza. It will be worth the wait.", "author": "John D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-23", "description": "Best pizza in the nabe, and you can usually find me here on Friday nights!!!  It's always perfection.  I have had to wait about 20 minutes, but never any longer then that.  \n\nThe atmosphere sucks, the place is completely outdated, the servers look like they've been working there for years (i mean many, many years), but I don't even care!  The pizza is that un-freaking-believable.  Meatballs are good too.  Also, where else can you get a $5 Ketel martini and a cure for your head cold???!?!!!  I'm not kidding you, one time my boyfriend had severe head cold slash congestion and the waiter described, in detail, how to cure it the \"old fashioned way.\"  A washcloth was involved.  It was amazing.\n\nThis place rules.\n\nTip:  cash only!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-18", "description": "Mmmm delicious delicious pizza. \n\nThis place is perfect if you're looking for authentic delicious old school pizza in Brooklyn and don't want to wait on a line for hours and hours. Instead, you get to wait for hours and hours at your table, haha just kidding, kinda. Doesn't matter, you come to Sam's for the experience as much as the awesome pizza. \n\nThe place is run by a father and son team and looks like it hasn't changed in about 4 decades. Lou (the son) is a chatty fella and likes to make jokes. So laugh politely and don't even think about asking what's taking so long with the food. It'll be worth the wait once you bite into that slightly burnt crust. \n\nOh and come prepared, it's cash only.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-17", "description": "You will probably never find any place in brooklyn like sams. Since its been there for over 80 years nothing has changed. When we go there we have only gotten pizza and salad. The salad is nice and cold when it comes out with very fresh ingredients like the salami and prosciutto. The pizza is delicious. It it like a brick oven pizza with a thicker crust. Louie the server and owner is friendly and enjoys what he does. Just be aware that he is closed on Tuesdays!!!! I will DEFINATLY be back!!!", "author": "Angela R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "Another quality Yelp-find.  Excellent  pizza in a very classic, no-nonsense, unpretentious, local establishment (\"a real Brooklyn dive,\" my friend said). The restaurant was served by the middle-aged owner, who colors his service with an acerbic sarcasm that some may find off-putting.  If you're looking for a nice time and fantastic pizza, ready to trade barbs with Louie and company, this place is it.  If you're a vacuous yuppy, a weak-bellied, anti-American tourist, or a dour, humorless, sanctimonious crank, you'd best go elsewhere.  \n\nAs for the pizza . . . . we ordered a large pie with half ricotta and eggplant and half meatball and mushroom.  The sauce, cheese, crust--everything was perfect.  Supple, thin, flavorful crust.  Crispy at the bottoms and edges, soft in the middle laden with toppings.  Very highly recommended.", "author": "Daniel J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-21", "description": "Stumbled into Sam's after getting \"misplaced\" in Brooklyn. At first things appeared sketchy, but we soon appreciated the food and the atmosphere. Established in 1930, the dining room has the character and charm of classic Italian family cuisine. Pepperoni and garlic pizza was absolutely delicious! Now I can say that I have eaten authentic New York pizza from Brooklyn, NY!! On top of a mouth watering experience, Lou was able to provide us with directions back into Manhattan.", "author": "Megan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-16", "description": "I enjoy this place for what it is - old school Brooklyn. The owner is very friendly while at the same time a little gruff. The food is simple but delicious. The ambiance is nice. Thank god this place is stil hanging in there.", "author": "Margarita S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-24", "description": "Solid 4.5 stars for take out pizza. Wow, can't believe it has taken me 10 years of living in Carroll Gardens to get a pizza from here. Truly phenomenal authentic old school pie. Completely different from the \"boutique\" pizza shops that seem to be opening on every corner with artisanal cheeses made in your vinyl record playing neighbors vintage LV steamer trunk...this is a real traditional hand crafted pie.  The staff is incredibly friendly and you can't help but be charmed by the old school vibe of this place.  Finally, with most places charging north of $30 for a pie out sausage and onion pie was ginormous and only $23.50. Of course Grimaldi's still wins out with the best value charging only $18 (recently up from years at $17) for an exceptional large pepperoni pie, but this is an equally exceptional pie, but just a very different pie that is not about splotches of mozzarella but rather classic shredded cheese with layers of toppings. Picture I am attaching doesn't do it justice, but this is a huge and dense pie and perfectly cooked with no burned portions. Will definitely be back to eat there.", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-18", "description": "My friend loves this place and convinced me to give it a try. I wasn't impressed. The lasagna was mediocre. Maybe I'll get my friend to come back with me so I can see what it is he likes so much.\n\nThe service was actually really great, though. So that's a bonus. I didn't realize it was cash only, and the waiter had no problem with me running down the street to get some cash.", "author": "Cade R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-21", "description": "THE best pizza I've had, ever. I came to Sam's in October 2013 a couple of hours after flying in from Toronto, as per the recommendation of my friend who lives not too far from the restaurant. I ordered a plain cheese pizza, and I practically inhaled the entire thing in one gulp. The sauce was simple, and perfect, just the way I like it (I'm not one for pizza sauces that are loaded with herbs and spices). So sad it's nowhere close to Toronto, but now I have a reason to visit Brooklyn more often!", "author": "Sophia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "I walked out of Community Bookstore and headed down Court St. There was a nice step down restaurant called Sam's. The sign said they have been in business for 80 years. My father and I decided to step inside. This was one of the best food decisions that I have made in years. I enjoyed walking around Brooklyn and checking out different places this weekend. It was not the New York that I experienced as a child. Sam's was a blast from the past. The waiter was a classic NYC Italian ball breaker. He reminded me of my grandfather. He was very boisterous and vocal at first with a heart of gold. Last of a dying breed. Did not see any emasculated eunuchs in Sam's. I was scrambling to escape them all day in Williamsburg and this was a welcome retreat. The pizza was outstanding. Unfortunately the sauce was not heavily spiced with oregano or basil. I prefer the sauce at Umberto's of New Hyde Park. The dining experience was supreme and one of my favorite in New York.", "author": "P W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-29", "description": "I had the most interesting lunch here. Yes, our server was abrasive at first, but he warmed up immensely over time. If you can roll with his verbal punches, you'll be rewarded with some amazing food (the best thin-crust cheese pizza and red clam-sauce pasta I've ever had) and some good laughs. I'd probably grab takeout from Sam's next time though; the weekend we went, there was only one person doing everything at the front of the house so the food took a while to get to the table.", "author": "Wendy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-07", "description": "Just have to update to tell Louie to keep doing what he is doing....how about serving manhattan specials ?\n\nThis is the old south Brooklyn folks, not the uber liberal roof top kale garden, gluten free, organic one now.", "author": "bill l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-23", "description": "We eat in Sam's at least once a month...if you don't want to be rushed and actually want to sit and enjoy your meal with your companions, this is the place to go.  They cook your order when you order it, not pre-made.  That means you sometimes wait 20 minutes, but who cares?  The food is fabulous.  Where else can you buy a bottle of wine for $20 or less?  Or get a great mixed drink for under $10?\n\n I would like to comment on Matt C.  First, the place is not homeophobic. We eat here with our gay friends frequently.   Maybe if you were sure how many people were showing up, it would have been easier for you.  With the limited seating, and that they only use the front of the restaurant, the tables are reserved for larger groups, you didn't tell them how many people were coming.  Aside from that, what kind of moron orders food and walks out without paying?  I was in there the night you and your friends did that.  I witnessed everything.  So before bashing, stop playing the gay discrimination card and realize the way you acted was wrong, and it wasn't because you were gay.", "author": "Christine S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Sam’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "238 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/hz4zqtC67Bi3F6PChXOQHA/ls.jpg", "@type": "Restaurant", "telephone": "+17185963458"}