{"aggregateRating": {"reviewCount": 214, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-14", "description": "The pizza and the atmosphere here are fabulous. The baked clams and fried calimari were okay. \nLouie told me last night that he'd been cooking pizza for 59 years there. He made us three pies and then said he was going to bed. \nThe waiter (who's his son) was a great time too, humoring our party of 11 until about 11:30pm on a Sunday.", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-06", "description": "Conventional city wisdom says that Grimaldi's is New York's best pizza joint and a worthy reward after a trip across the Brooklyn Bridge. I've never been, so without any real research to back this claim up, I'd say Sam's Restaurant deserves that distinction. It is by far the best pizza that I've had in New York, and I feel like I've had some pretty good pizza.\n\nThe place is a throwback to what appears to be old Brooklyn and what I'm guessing to be original fixtures and waitstaff. No aspiring models and actors doubling as waiters/bartenders here. And no pizza by the slice or patio dining. The restaurant front dons a sign that reads \"No slices sold here\". And our 50 year old plus waiter gave us a lengthy narrative about why having outdoor seating is too pricey and hence a stupid concept.\n\nThe ricotta pizza was amazing as was the margherita pizza. Crunchy thin crust providing the perfect backdrop for pizza sauce, ample cheese and fresh toppings. By the time I left the restaurant, I had to loosen my belt and I hurt. But it was worth it.", "author": "betsy l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-01", "description": "So, I'm in Brooklyn, and it's spring, and there's nothing like spring in Brooklyn.  Nonnas  on the front stoops of old Brownstones talking about the old country while their grandsons play stick ball in the streets.\nGranpès playing dominoes on mango crates in front of bodegas\nwhile reliving their youth in Haiti through their stories. Black and African men selling books and obscure technical magazines on Bedford Avenue. \n\nSo any way, I'm in Brooklyn, and it's spring and I want a real Italian meal. I'm not talking Americana spaghetti, I'm talking \"macaroni and gravy\" with clams and garlic, cold Finocchiona, Salsiccia, and, Polenta with rabbit and sausage.  But Brooklyn is getting swanky these days ( think Wicker Park, but with real class and true artists), so I'm not sure where to go any more. \n\nThen I see a small but solid man ( built like a fire plug) wearing a beige  spring trench, step out of a bodega while simultaneously reading the pony section in back of the New York Post.  Classic Brooklyn I'm thinking,  and if any one knows real Italian and where it can be had,  it's this paisan.  \n\nSo I walk over,- his face still buried in the ponies, and say \"Excuse me Sir.\"  He turns to face me. And I realize that I'm talking to none other than Robert  DeNiro, one of my favorite actors.  He looks annoyed. I can see it in his eyes. Yet another fan about to request yet another autograph.  But being a good sport and thankful for his success and wealth, his annoyed frown changed into a big fake grin as he waited for the \"aren't  you Robert DeNiro? And I loved you in blah blah blah movie, and finally can I have your autograph?\".  But I'm no \"Midwest  tourist\" and even though I'm not from New York,  New York like New Orleans runs in my soul.  So instead  I say, \" Sir, can you recommend  a good Italian restaurant?\" He looks at me in disbelief wondering could it possibly be I don't know who he is?  \n\nRobert DeNiro says \"excuse me?\" And I look at him as if I'm slightly annoyed that he won't answer my question. \"I'm looking for a good Italian restaurant within walking distance from here, can you help me out?\", I say slowly.  He looks around as if  wondering if some famous actor, perhaps Denzel Washington or Idris Elba is hiding around the corner, playing a joke on him. I mean he is Robert DeNiro and clearly I'm not some Midwest bumpkin so I must know who he is. Robert DeNiro gives that sly smile that's made him famous and says, as if  we were on  a movie set, \"You mean, Yoouu, want meeee to tell yoouu where a good, Italian, restaurant is?\n\nAnd I say, \"pal, I don't mean to disturb you, I'm just looking for a good Italian restaurant in Brooklyn, But it's clear you can't help me so have a nice day\" and  slowly turn away.  But not before he says \"wait a minute of course I know of a good Italian restaurant as a matter of fact I know the best Italian restaurant in New York, and it's called Sam's here's what you gotta do if you wanna get there.\" He puts his arm around my shoulder and says go two blocks, take a left, not a right, you gotta go left ,walk one block, keep strait to the next block and right in the middle of the block, will be an Italian flag. When you see that Italian Flag,  turn left down, go down the stairs. It's called Sam's.\"\n\nI'm thinking a restaurant in the basement? So I say,  \"In the basement? Are you sure it's any good?\" Robert DeNiro said, \"Kid what do they call you?\" I say \"Eric because it's my name.\" Robert DeNiro  smiles and says \"Eric, you asked me because I'm Italian right?\" I smile. DeNiro then says \"I give you my word and extends his hand for me to shake. I shake his hand and walk off, but not before he calls out \"hey\". I turn around. Robert DeNiro says \"Sam's don't open for another half hour, so you gotta  bang on the door hard. Sam don't hear so well these days.  And make sure to tell him Robbie sent you and that you're a friend of mine\" I say thank you Robbie an I loved you in Cape Fear and repeat his line of a murderous mad man \"Just two lawyers working it out!\"  Robert DeNiro laughs and says \"I do it for fans like you Eric, who appreciate a good home cooked Italian meal.\" I say \"Thanks Robbie, you take care now.\"  \"Be good Eric\" he says as I continue on.   \n\nSo I walk to Sam's. I go down stairs rap on the door and after several minutes a grouchy old man opens the door and says gruffly  \"can't you see the sign!\" I open at noon! I've been opening at noon for the past thirty five years!\"  I say I'm sorry, but Robbie sent me and said it would be OK.\".  \"Oh, that dead beat? I oughtta charge you double and a fee for every time he's kept me up past my bed time! Talking, talking talking, like he don't got no home to go to!  I know I don't look it, but I'm not a young man any more\" \n\nI say, I'm sorry, I can come back.  Sam says, \"What, I open the door for you and now you gonna insult me to my face?\" No sir I say and step in, back into yesteryear. I will never forget that Polenta with rabbit and sausage!", "author": "Eric H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-22", "description": "SHOCKING HOMOPHOBIA in this so called \"gem,\" \"amazing,\" and \"old time\" restaurant.\nI will not go into the horrendous details of our experience in this dump of a restaurant. I will just tell you this. They clearly do not want gays in their establishment. We were a bunch of 8 guys and they refused to put two tables together the seat us, although it would have been easy to do so. So we sat in two separate booths. I can't speak to the service because there was none. After taking our pizza and drink order, we literally sat and waited for at least a glass of water for almost thirty minutes! It never came. Nothing came. The two miserable men who work there were more than happy to service other tables while we were blatantly and purposely ignored. Feeling so unwanted and, frankly, hated, we got up and left. Our alleged waiter came out and yelled at us that he \"put in the pizza order\" to which I replied \"you totally ignored us.\" He then shot back with something you cannot put in a yelp review. I urge everyone who reads this to tell a friend, tell a neighbor, tell as many people as you can, that in the greatest city in the world and in our beloved Brooklyn... hatred, racism and ant-gay businesses still exist and will only cease to do so when we stop going. Please don't go here.", "author": "Matt C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-05", "description": "Sorry but good food should go hand and hand with good service. As we walked in we could see no one around for help with seating. We waited patiently until way back in the distance the host motioned to my girlfriend to sit by pointing at a table. What happened to hosting or perhaps this is the new form of it... maybe we should resort to grunting next. The place smelled like old man and the waiter served drinks by grabbing them around the rim with his dirty hands .... fail.", "author": "Herm E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-12", "description": "I've been meaning to try this place forever.  I walk down Court Street all the time and yet I've never quite made it here.  As the others have said...this place is legitimate old-school -- check out the drinks on the menu too.  Definitely not too many places like this around in the area.  The father and son team at this establishment are very chatty and have some great stories.  The pictures on the wall come from where the father is from -- Isola di Ponza...now I want to go there.  But yeah, had a pretty cool convo with both the father and son.  They lamented at the changing landscape on Court Street...but that they don't venture too far.  Why do you have to?  When you have Caputo's, Staubitz, D'Amico's for all your baking, meat, and coffee needs?!?\n\nService is a bit on the slower side, but not a big deal.  I wasn't in a hurry and well, the place does have some ambience.  We got a pie...half pepperoni and mushroom.  And let me tell you.  The crust on this pizza was some of the best I've ever had.  No joke.  The pizza doesnt look like anything special...honestly.  It doesnt look like DiFara or Lucali or Keste or Grimaldi's, but it sure tasted good.  Lots of delicious saucy parts too!  Overall, this is a very solid pie...one of the best ones I've had lately.  It's a bit pricey though.  I think our pizza ended up costing about $25 or so.  That's about 6 or 7 bucks more than Grimaldi's.  But whatever!  The ambience and...well the pizza were good so yeah.  I don't think I'd come here for dinner, but lunch yeah.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-06", "description": "You can't stay in business for 60 years without changing anything unless you are very, very good at what you do.  Sam's is no exception.  Clearly this place has been around since the dawn of time, and for good reason.  \n\nOddly enough, though it's called a pizzeria and that's what it seems to be most famous for, pizza's hardly mentioned on the menu.  Toppings are listed in small type near the bottom of the page, but you have to ask about sizes and prices.  Make no mistake, though, they aren't hiding it from you out of shame. This pizza is basically the platonic ideal of pizza.  Some other pizzerias do one thing extremely well and others only competently.  Sam's is an expert on every aspect of the pizza process, from the perfectly charred and crispy crust to the smooth sauce to the ideal cheese-to-topping ratio.   \n\nFor a quick and no-fuss pre-movie dinner on a Saturday night, we couldn't have asked for better.  We were in and out in about 30 minutes, and our waiter, while a little old-school Brooklyn brusque, served us flawlessly and was even a little bit jokey and chatty as if we'd been coming here forever (which we hadn't, but certainly will be going forward).", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-27", "description": "Gorgeous pizza. No friils on decor, menu, or attitude? Sure. But come on... We ordered celery and olives. What did we get?  Celery and olives.  \nWe ordered lettuce salad with tomato.  What did we get?  Lettuce and tomato.  \nWe ordered pizza with anchovies. What did we get? Much love.", "author": "Thomas H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-13", "description": "I've never had anything other than the pizza with green olives. We only show up when we're very hungry, and leave when we're firmly at the line between \"satisfied fullness\" and \"deeply uncomfortable.\"\n\nI really should try something else one of these days, but...nah.", "author": "D. H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-07", "description": "The pizza here is really good -- just old style Brooklyn.  People are right that the decor is from a time warp, but it's kind of cool that it is different from all of the brick and tin ceiling places that dominate the neighborhood now.  Other than the pizza, I can't say I'm a fan of the rest of the menu (I haven't tried it much because I always get pizza), but the pizza and time warp decor are alone worth the four stars", "author": "Nikolai S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-23", "description": "I've been curious about Sam's, which proudly proclaims the availability of steak and chops in its window lettering, for about a year now. And last night, despite some stories about ill-mannered service, I ventured down the steps and inside for dinner.\n\nSam's is a slice of old Brooklyn. As far as I know, Cobble Hill used to be predominately Italian, and this red-and-white table cloth eatery is a perfect example of that kind of feel. The payphone booths are out of service, and the women's bathroom is upstairs.\n\nHaving seen the waiter/manager interact with patrons at another table -- older locals, all -- I knew what to expect. If you're not in the mood to have your leg pulled -- or if you're a restaurant goer with attitude -- this isn't the place for you. You've got to go with the waiter's flow.\n\nI went for the basics: spaghetti and meatballs and a root beer. The root beer was Mug and came in a plastic bottle -- slightly disappointing -- but the spaghetti was better than expected why? Instead of coming with a bunch of small meatballs, it came with two huge meatballs, like tennis balls. The spaghetti was wonderful.\n\nAfter my meal, I decided I needed an espresso. They don't put a lot of care into their espresso, but I was still glad I got it. When I was done, I had to walk back to the second dining room -- near the kitchen window, where you should go to order takeout -- to interrupt the waiter, who was eating his own dinner. \"Imagine. An hour and a half trying to eat my ma's dinner!\" he said.\n\nI paid and left him to eat dinner himself. Sam's is that kind of place.", "author": "Heath R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-29", "description": "pizza amazing. but get it for take-out. i am all for old and charming, but the inside needs some of the love the food gets.", "author": "V F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-17", "description": "Yeah, it's got a great \"old school\" feel, the portions are hefty and the servers are some good guys but the fact that I had to kill TWO cockroaches during our dinner is more then enough to make me never want to go back again.  The bad body odor of our server was also a major turn-off to our dining experience.\n\nNothing more needs to be said.", "author": "Matthew T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-15", "description": "Sam's is in a league all by itself.\n\nI visit to eat in the restaurant once per year and order takeout 3-4 times.  The food is okay, pizza is good, but the experience is superb.  The places is totally old school and you can just imagine the neighborhood mafioso lounging around at this joint 40 years ago.  You realize upon entering that not much has changed about he restaurant's appearance since.  \n\nSome of the neighborhood's newest west village types might not appreciate the uniqueness of Sam's and I've heard complaints about cleanliness, but honestly, that's the last thing that should be on your mind when visiting Sam's.", "author": "Josh G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-07", "description": "3.5 stars...\n\nSam's is a historic Pizzeria (and Italian restaurant) that's been a staple in Brooklyn since 1930. Seeing how the first pizzeria in America was in 1905, that's a huge deal. Honestly though, I'm not a big fan, the food is ok but the prices don't make coming/ordering here worth it. The pizza is alright but nothing spectacular and definitely not worth the $20 or so they're charging for a large cheese pizza. I'm not sure why they're charging tourist prices in a non tourist area of Brooklyn. Don't get me wrong the pizza is fantastic compared to just about anything outside of NYC but there's many better places to have a pizza in Brooklyn. The service was a true Italian Brooklynite dressed like it's his day off joking around and giving you a light hearted hard time (something you'll either really like or really dislike). The tables are all covered in a plastic picnic table styled table cloths and old dusty fake flowers and if you order a soda he'll fetch you a bottled soda and a glass to fill yourself. The place is a tad tacky and the food is just too mediocre to pay top dollar for.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-16", "description": "The most delicious pizza I've ever eaten!  Louie is a total character.  Absolutely worth a trip to check out this 81 year old establishment.", "author": "Pepper P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-26", "description": "Pros:   \nAbsolutely fantastic pizza.  Really.\nOld school decor, complete with red checkered table clothes\nA dearth of pretension and hype\n\nCons:\nNo delivery.\nThe price.  At around $24 for a pie, you get what you pay for, but sadly, I can't afford to make Sam's a routine.  Pizza prices aren't listed on the menu.\n\nPro or con:\nThe service.  A little slow, but it's a neighborhood joint where the servers will chat with you if you're polite.\n\nBottom line: if I ever have out-of-town guests that wants to try some authentic Brooklyn pizza (and pay), I'm definitely taking them here.", "author": "J B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-16", "description": "Mostly written to negate a friend's negative review below, I'd like to offer up 5 stars to Sam's - one of the best pizzas in Brooklyn, and a fun place for a glimpse of  Brooklyn before people like us moved into the 'hood. \n\nYes, Louie's a dick - but that's his \"charm.\"   Spend some time there, he'll get to know you - and the next thing you know you're the VIP table that gets preferential treatment.  \n\nWhile I feel that it's worth the effort, you may disagree.  Thankfully they have a takeout window in the back.  Like Arecibo, it's always ready in 5-10min, and you can avoid the nonsense up front.  Turn your oven up to 450 before leaving, drop your pie in when you get home for a few min to crisp up, and it's as good as new.  \n\nOh, and avoid anything besides pizza.", "author": "EJ C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-24", "description": "A good place to get a good, real pie. \nOther then that I don't know much about their entrees.", "author": "Matt M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "Order a pie with mounds of ricotta and roasted garlic.  It's too die for.  One of the best pies in the city.", "author": "Jason C."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Sam’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "238 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/hz4zqtC67Bi3F6PChXOQHA/ls.jpg", "@type": "Restaurant", "telephone": "+17185963458"}