{"aggregateRating": {"reviewCount": 214, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-11", "description": "Both a 5+ start and 0 star place. To have a 5 star experience you need to go in with the right mindset.   This is an old neighborhood place that oozes old school Carroll Gardems/Cobble Hill charm in an old grumpy Italian kind of way.   Go in relaxed, get some old style red sauce food and a giant Jack and Coke and you'll love Sam's. Go in expecting some kind of new Brooklyn experience and you'll hate it and whine about how mean they were and how mediocre the food was. \n\nIn any event, go for the pizza because it really is great Brooklyn style pizza.", "author": "Peter F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "Sam's is a great, traditional, and totally authentic Brooklyn pizzeria. The pies are out of this world! Just come here and share a pie with your family!", "author": "Ann-Agnes O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-22", "description": "Great old school Brooklyn pizzeria. The pie is top notch. Perfectly crisp crust, great sauce. The baked clams are off the charts. You will dip your bread in the clam juices until it is all gone. Trust me. I emphasize \"old school\". The beauty of this place is it hasn't changed in years. Same food, same decor, owned by the same family. If you haven't been here, you gotta check it out. Chat up the owner Louie. He is great.", "author": "Brian F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-13", "description": "This place is a living dinosaur, and I mean that in the best possible way.  It reminds me a bit of my grandma's house.  Plastic covering on the checkered  tables, long and dark, with a father and son duo at the helm--some would call this kitche, but this place wasn't created in a board room.  This is the way its been since 1930.  The father was sitting in the front window until we ordered our pizza, after which he went back to make it.  The son is friendly and kind of a dick, but so am I; if you can't take a joke, don't come here.  This isn't fucking Manhattan.  This Brooklyn.\n\nI got a pizza with eggplant, as I needed something more substantial than just bread with sauce and cheese.  Believe me, there was a full order of eggplant parm on top of this pie.  The cheese was aged mozzarella and was also applied heavily, but it was very fresh (no oil).  The tomato sauce was heavily applied as well, and it was good but not great.  The end crust was one of the best I've had.  No bullshit.  Smoky and flavorful,crisp but soft--its just too bad you had all these toppings weighing it down.  The pie had good flavor but the balance was way off.  Even so I enjoyed this pizza and this place immensely. \n\nI'd like to order a pie light with the toppings next time I come, which might or might not happen.  I'd really like to do that and also get them to use some fresh mozzarella, which probably ain't gonna happen.  But if they did, this place would easily be in the \"best in city\" conversation.   Instead it's just in the \"best in Brooklyn\" conversation, and one of the most unique places in the city seeing how rare this old school atmosphere is now-a-days.  Them changing anything about this place would be a paradox of sorts.  Like I said before.  This is Brooklyn.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "Been coming here since birth. Great pizza,great stuffed peppers. Old school as it gets. Cash only. Be patient.talk to louie. Have fun.", "author": "Anthony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Sam's is honestly incredible. The ambience is such a warm reminiscence I love dining in. Louie holds down the fort, giving great table service with a solid side of charm. Most dishes are just decent, so that's why I think on average this place has a low rating. But trust me, the pie is AMAZING. Do yourself a favor and visit for not just a meal, but a wonderful experience. Or, shoot, order a pie to go and keep this place hummin.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-23", "description": "Listen up hipsters if you want locally sourced cheese \u0026 olive oil for your bread or wasabi encrusted pizza no need to come here! now with that said Sam's possibly has the best pizza I have ever eaten. I  first ate at Sam's about 10 years ago I am a native Brooklynite and have eaten Pizza all over the borough. The food at Sam's is standard red sauce I have heard the steak is good I have not tried it. but the atmosphere is a real throwback I love it. Some of the reviews say it's old and crusty YES it is and love it for all that it is. I hope they are around forever... Really try the pizza...\n\nCiao-", "author": "Paul C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-30", "description": "Man. This place is a mess. The pizza is \"good\". It's solid. But everything else is cold and bland. OH and nothing goes better with pizza than hearing an old Italian guy yell and complain about how much he hates working at the restaurant that he owns... That you're eating at.\n\nPro: The crust is good, the pepperoni is from Staubitz Market, so it's dope (supposedly all the meat is from there, so order a meaty one). Cheese is great too.\n\nCons: Too much sauce, mushrooms are from a can. Everything else.\n\nIf you have to come here: get a pepperoni pie, save yourself from waiting 2 hours in the \"authentic\" surroundings, and get it to-go.\n\nNext time I come back I'm going to not go, I'm going to go a block down the street in either direction and get a pizza that's just as good for less money and less time.", "author": "Abbas D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-11", "description": "I was brought to Sam's by Scott with Scott's Pizza Tours. I am from Dallas Texas. \n\nThis was our 4th stop on the tour, and only one in Brooklyn. The place was old, dimly lit, and had a bit of a smell to it... but in a good way. Yeah, this was the real deal. \n\nThe owners were both there, and made us feel like family. The pizza was amazing, and had the most cheese on it of any we tasted that day. Nice CHAR on the bottom of the bread. \n\nThe best part of the experience was talking with the owner, who explained how banks try to buy his business every week because of the valuable real estate it sits upon. This is a man who takes pride in what he does. \n\nGreat times there, and would tell anyone local or visiting to stop in and have a pie.", "author": "Jared G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-09", "description": "Loved my pizza! Went here just before closing and had a pizza. Had to get a whole (large) pie as they don't sell slices. They also don't take plastic - bring cash. Fun smart-alec server/owner, super old-school and charming. And full bar as a bonus. Come walk back in time and have an amazing pizza too.", "author": "A. C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-02", "description": "My grandmother would've loved this place. Nearly all of the furniture in this restaurant is covered in plastic, and the staff on occasion will lock the door behind you as you go or enter ... sometimes even in the middle of the day. This is old fashioned Italian eatin' and service at its best.\n\nThe restaurant itself is big - great for groups. It resembles an old hall (think Knights of Columbus-style), and is located right down off of the sidewalk. All of which only add to the rough charm of this place.\n\nThe old-timey waiters will tell you flat out that you've ordered too much food and that \"someone like you won't be able to finish a whole pizza,\" or \"of course I recommend it, whaddayou think?\" They can be a bit harsh, but luckily, I'm into that sorta thing.\n\nOh, the food itself?  Made with saucy love. They also offer a wide variety of fresh toppings. Mangia!", "author": "Brian M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-27", "description": "Hands down my favorite New York pizza. \n\nDon't come if you're a snob. Come if you want the best f***ing crust in the entire world. And for the love of god don't order pineapple.", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-01", "description": "This place makes one of the best Pies anywhere.  I usually order the pie with Anchovies. you must Order the baked clams they are  absolutely outstanding. Haven't had alot of other Items on the menu but based on the few items I have had , I am sure they are coniderably above par.\n\n Be prepared to deal with the maniacal proprieters son who now runs the place. His quirky slightly rude behavior will either instantly annoy you or amuse you depends on your tolerance for such things at that moment. The Food is worth the annoyance though.", "author": "Travis B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-02", "description": "Just had my best girlfriends 30th bday here. We loved our tattooed waiter Stephen who took care of us like a sweet angel all night. The pizza was effortlessly amazing. The atmosphere is casual and comforting. Will be back for years to come", "author": "Sam R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-24", "description": "In short: dumpy place, offputting servers, and mediocre, overpriced food.  We were refused a booth and given a table instead because \"I need it for all the other people coming in,\" the waiter claimed.  What an odd thing to tell people, since no one else came in during our entire meal, and it wasn't even crowded to start with.  So who were these magical non-people he was saving booths for?\n\nThe service was awful.  We were largely ignored, and whenever the waiter did come over, he was hostile and spit would fly when he talked.  Onto our food.  It was disgusting.\n\nThe food itself is not worth any amount of money really, but Sam's has the gall to charge far more than they should.  The red sauce is watery, the eggplant parm was weak, and their chicken dishes were flavorless.  They aren't doing much of anything right.  They might think this is how Italian food is made, but I grew up in an Italian household and can tell you: it's not.\n\nPlus if you think you're getting away from babies by avoiding the hotspot restaurants, you're not -- Sam's seems to be a haven for people with loud kids, and these ones are even more awful than hipster spawn.  Bring earplugs.", "author": "Matthew C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-01", "description": "Louie was a charming character who made everyone feel like family he'd known forever. He feeds off of the energy of the group, \"sizing\" up his audience a little bit \u0026 you can tell he cares about making the customers have an experience with their meal! The food was decent, my coworkers enjoyed theirs and from everything I've read we should have tried the pizza. I would definitely go back again!", "author": "Kim J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-12", "description": "Could be the best pizza in nyc.  Waiter's a ball-buster if you act like a moron.  Don't.  The interior is reminiscent of the Fratelli's restaurant from Goonies, which only adds to the charm.", "author": "Bryan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-08", "description": "First downside: Interior of restaurant is in poor quality, looks grimy and old. For some reason they pride themselves on this? The establishment did not appear to have any type of dress code, nor from the looks of the exterior and interior would I have expected there to be a dress code.\n\nSecond Downside: Grade B inspection from city ... eeeek u could just see all the grime when you walked in!\n\nThird Downside: As an out of towner looking for good Italian food I was surprised when entering this establishment to find only 2 patrons being served and about 25 empty seats. It is July and the heat is on so I wore a respectable tank top, shorts and shoes. Apparently because I wore a tank top the owner (who was the definition of a rude ass Guido) refused us service and told us to leave just as we asked him for a table!! I was shocked to say the least because right in front of us was a girl that had a tank top on.  Wtf!! \n\nI believe the owner is racist and does not like gay people, therefore it was not because I had a tank top on but because he was flat out a HATER.  I highly recommend everyone BOYCOTTING this establishment.\n\nGood news we found a much better place right down the street! Go to Layla Jones they have great customer service, better prices, a great outdoor patio and the food is incredible!", "author": "Jason T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Simply said,Fantastic!!! The best Pizza. A family owned and operated restaurant for the last 80 years. A true Brooklyn landmark filled with great history. A must try!!!!!\nPatty \nFlorida", "author": "Teresa R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-04", "description": "HORRENDOUS!  Giving this dive establishment one star is too generous!  For starters, the food was offensive - I wanted the eggplant parmigiana hero, but according to the waiter they \"had no bread,\" and I thus had to get the more expensive full eggplant parmigiana dish (which by the way did NOT come with pasta or anything, so not really sure why it was more expensive...).  The eggplant itself tasted old and like it had been warmed up from frozen - by far the worst eggplant I have EVER had anywhere.  \n\nBesides that, however, the biggest problem was the service!  The restaurant was incredibly warm to the point that I was sweating, and my aunt politely asked about possibly turning on a fan or air conditioner.  The waiter then broke into a rant about who we thought we were to ask such a question and claimed that the temperature was \"below 70\" in there (which was certainly not the case!).  The next problem occurred when the waiter brought the food over - he apparently thought it would be funny or something to say that my eggplant was a chicken dish, and when I calmly stated that I didn't order chicken, he basically called me an idiot for not being able to \"tell the difference between chicken and eggplant\" even though the whole plate was covered with cheese anyway and seeing what the protein was would have been impossible!  Finally, the plates the food came in were WAY too small, and the waiter came over to yell at my aunt for getting pasta on the table even though it had been served in a minuscule bowl and was inevitably spilling over the sides.  \n\nIn sum, avoid at all costs!  It is time for this dump to pack it in - it is outrageous that they charge money for the low-quality food they put out there and have the audacity to treat paying customers the way they do.  As a last note - exceptionally weird/bad bathrooms to boot.", "author": "Olive V."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Sam’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "238 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/hz4zqtC67Bi3F6PChXOQHA/ls.jpg", "@type": "Restaurant", "telephone": "+17185963458"}