{"aggregateRating": {"reviewCount": 214, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-21", "description": "Sams is authentic. When you feel like escaping the pretentious storefronts that line Court St; Sams is the place to go. My wife goes crazy for the Lobster Spagetti and the pizza is the best in the neighborhood.", "author": "Christopher S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-02", "description": "Say whatever you want about Sam's and the cheesey decor.  This place will always be a family favorite!  \n\nI am born and raised Brooklyn, with Italian in my blood.  The food here is authentic and delicious.  Our typical menu choices include a garlic pizza pie to start and mussels posillipo.  We dunk the pizza crust into the posillipo sauce.  My Mom always has the veal cutlet parmigiano and an amaretto sour (she says Louie makes the best amaretto sour ever!)\n\nAnyone who says anything bad about this pizza, simply doesn't know good pizza!", "author": "Ali G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-21", "description": "Sam's is so up-and-down.  When I first started going there 10 years ago, I found the pizza generally really good and the service a little surly.  But I kept going back, and the service got friendlier, though I made the mistake of trying a non-pizza-dish that was terrible.  But my recent experiences have changed my opinion back to surly, as a large party of mine waited at a table for 30 minutes to order for no reason - the place wasn't packed at all - and as time passed, our interaction with the waiter was unpleasant.  There have been similar times where there are plenty of open tables in the front room and not a lot of customers yet we seem to disappear on the radar.\n\nI haven't totally written it off - the pizza is still really good, the environment is classic, and it's not terribly expensive, but Mama Maria's is down the street and much more tempting and inviting.", "author": "Timothy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-08", "description": "I am a fan of Sam's and have been a customer for most of my life and this is about as Brooklyn as it gets.   Every New Yorker has their favorite pizza and this is mine.  The pizza is good old fashioned  Brooklyn Pizza, not yuppie pizza.  Louie, the head waiter and son of the owner is as Brooklyn  as his dad Mario, who runs the kitchen is Italian.\n\n-- 11/28/2008 -- I love reading the other reviews of Sam's .  If you don't understand Sam's you don't understand Brooklyn.  Accept it for what it is don't try to make it into Pizza Town of Ohio.", "author": "jim r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-24", "description": "It is what it is... the father son duo that run this place are TRUE characters, real originals, and the pizza is fucking balls out delicious. plus go in and order a straight whiskey. you'll get a highball glass of jack for 6 bucks filled to the brim with NO ICE at all. so awesome.\n\nare they rude? sure. guess what? they own the restaurant and don't give a shit what you think. this is place if fucking real. you want friendliness, call the dominos on smith. seriously. those dudes are really friendly, I'm about to give them four stars as well.\n\nyou want the best pizza (in my opinion) in bklyn in a true blue, time warp of a setting? this is the place.", "author": "Scott P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-10", "description": "i just moved to the 'hood, and am ISO really great pizza without the trek \u0026 crowds at Grimaldi's-\ni got take out from Sam's the other night.  I had no idea what the guy on the phone was saying, but he sounded italian enough to give me something delish.  we had the eggplant pizza \u0026 a salad, and i loved it!  \ni will definitely go there again, and maybe next time go for the parm!\nthe only  thing is there is a sign on the door saying 'no pets or strollers'\nno strollers? i don't have a baby, or a stroller... but isn't that justweird?", "author": "Jessica W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-09", "description": "Very disappointing. In a neighborhood full of great old-Italian places, I thought this might be another delicious find, but it is a pathetic excuse for a restaurant that rests on the crumbling columns of its supposed authenticity to attract whatever customers it gets. \n\nMy girlfriend and I came in to pick up a pizza for take-out and were told we could wait in the back room for it, as we were not dressed appropriately. \n\nWe were both dressed in T-shirts and shorts.\n\nThere was hardly anyone in the apparently holy \"dining area\" that might take offense at our unacceptable attire. Too shocked at first to simply walk out, we decided to sit in the unlit back room (hunger over dignity). The guy who had directed us there sat down on the other side of the room and watched baseball, ignoring us until we got a pizza and left. As others have mentioned, customers are made to feel as if they're invading some private party by walking though the door. \n\nThe pizza is mediocre. In a city of great pizza, no one should have to waste their money here.", "author": "Flo B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-14", "description": "By far the best pizza in Cobble Hill/Carroll Gardens. The restaurant is totally old school and the waiter fits right in. Great garlic bread and antipasto. Do yourself a huge favor and order the pizza. It will rival anything you've had in the 5 boroughs!", "author": "Mark G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-28", "description": "Excellent pizza. On the saucy side, which is what I prefer. The sauce was fantastic. Nice, crispy crust. $18 for a large cheese pizza. It is totally old school, which we loved. Conversations with Lou should cost extra, but they don't. I can tell already that we're going to become regulars.", "author": "Abbey C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-25", "description": "if i lived outside of new york, i might think this was really good pizza. but i feel like you can get this level of pizza anywhere in the country. it's not bad, but it just has a sort of generic cheese, sauce and crust.\n\nalso had some of the fettucine bolognese, and was not impressed. it had like a freezer-burnt taste. \n\nthe service took forever. The gentleman serving us was nice and personable, but that doesn't quite make up for unnecessary delays.", "author": "Keith P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-20", "description": "Best Italian Ever. Definitely try the chicken parmesan dinner, the thing is like 2 pounds!", "author": "Julius E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-22", "description": "Hey Louie rocks ... and the pizza is awesome. We're vegetarians so tend to enjoy the EXCELLENT light gnocchi, AWESOME eggplant parm, peppers marinara, potato croquettes (we ignore the ham), and the PIZZA. Been to all the rest but Sam's is the place to go when we're serious about eating good food. And the Italian \"submarine\" decor is a classic.\n\nWe've been going there so long that our 27 year old son (in his \"forbidden\" stroller) ate his first slice here! And, my husband and I had our first dinner together here. It's a part of our family and is the last place we visit before going out of town and the first place we go when we return. Beyond the sentimental reasons for loving Mario, Louie \u0026 Sam's, it's all about the pizza.\n\nIn over 40 years we've never had a bad pie ... always crispy, bubbling, brick oven awesome. Need it tonight. Enjoy!", "author": "Judy M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-21", "description": "The pizza I had before was a take out, and my friend brought it in... Stopped by last night to get lasagna...I couldn't even eat it! It was really unedible, and the the smell in the restaurant was not appetizing. I feel bad for them, because if they changed the athmosphere a little bit, and worked on their food, they would be ok...I'm not going back - waisted money", "author": "Maria F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-10", "description": "I had always wanted to go to Sam's because it's one of those neighborhood places that you just know is going to be amazing. How wrong was I?!!! I went alone (big mistake) as was really dying for pasta on one hungover Saturday afternoon. So, I entered and it was as if I'd walked in on an intimate family dinner that I was clearly not invited to. Nobody greeted me and the bartender kept cleaning his glasses so I sat down at a table and waited for someone to come. I smiled at the bartender and still nothing. After about 10 minutes I felt so weird and uncomfortable, I just left. It was one of the most bizarre experiences as it was literally like I'd walked into someone's home and they didn't want me there. I really wouldn't recommend this place at all as the staff are so unfriendly and unaccommodating. God knows how they stay in business. FAIL!", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-18", "description": "Love this place...great pizza and love the sams special salad.  Also a big fan of their chicken parm.  The best part, I think, is what some people complain about..the waiters.  If you are a true new yorker you can take a little ball breaking and know how to give it back...I love the guys there and their food", "author": "Chris R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-22", "description": "Take a step back in time... to when Irocs and Monte Carlos ripped up Court street. An italian horn was the absolute must have accessory. A neat Chams Debaron shirt, a pair of Capezios, and a Goody brush meant you were decked out, and that splash of Drakkar Noir leave the ladies breathless.  Restaurants resembled your cousins finished basement, and oh, yeah... pizza kicked ass... Come back to Sam's.\n\nIf my description sounds a little Tony Manero, it's because he's still there.  Sam's is steeped in old Carroll Gardens. An unchanging, unmovable and sometimes indignant rock amidst the ever changing facade of brooklyn. You might not remember ordering a side of 'tude with your pizza but that comes with the territory.\n\nI was there once in my very early 20's, and made the \"mistake\" of ordering garlic bread along with my pizza. The waiter looked at me like I was crazy. Pointed out that the pizza is mostly bread (true, that) and, in the most fussy manner, cross the garlic bread off the order - all with the grimace of intense labor plastered on his face. \n\nSmall potatoes though for such high quality pizza, and if you want to impress out-of-towners with an authentic Brooklyn spot, look no further.", "author": "Jobey M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-19", "description": "Pretty good kinda pricey fun homemade", "author": "Dan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-16", "description": "Old school NYC pizza in a Cobble Hill landmark. Decor hasn't changed in the last twenty years and I love that! Pizza is delicious. Definitely recommend this place to many and always bring friends from out of town. Lou, the owner, is a sweetheart and a true Brooklynite, accent and all. It's a real NY experience.", "author": "F P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-20", "description": "Sam's WAS a hidden, authentic Italian gem with pizza that rivaled Grimmaldi's. Unfortunately, they recently began sprinkling the same dreaded American-mozzarella cheese hybrid common to the cheapest pizza in Brooklyn. Please Sam the pizza man, use high quality mozz--your pizza is worth it!", "author": "Anne-Paige D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-11", "description": "I love Sam's been going here since I was a little kid, had it once again this past weekend, and it is still super Delish.\n\nLove it - prob my favorite pizza.", "author": "Eddie H."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Sam’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "238 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/hz4zqtC67Bi3F6PChXOQHA/ls.jpg", "@type": "Restaurant", "telephone": "+17185963458"}