{"aggregateRating": {"reviewCount": 214, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-05", "description": "if you value fetishizing old school atmosphere over price, service, food, or anything else, youll give this place 5 stars. if youre a retired cop that grew up on this block youll give this place five stars. If youre an average joe who moved here 15 years ago and just wants a decent meal, youll give this place 2 stars.", "author": "billy b."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-22", "description": "We so wanted to love this place -- if only for the cool untouched look and feel -- but ultimately the food has to be eatable -- everything was greasy and overcooked.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "The best pizza ever. You might have to wait, but it's worth it. Been coming here for yrs. My husband \u0026 his family have been coming here for over 30 yrs. Love it!!!", "author": "LORI L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-14", "description": "Old fashioned Italian restaurant. Kind of cool.  It feels like you're walking into a 1970's mafia joint in a De niro movie.  The guy Sam seems friendly.  Just wish the food was a little more fresh.  It was pretty good food even still.", "author": "Tia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-21", "description": "I have to admit I fell in love with the place just walking in.  It looks just like my grandparents' basement (as I've learned from reviews, I'm not special, and plenty of Italian grandparents had wood paneling and vinyl furniture).   It has a really unique layout- like an old restaurant out of a mob movie or like a Knights of Columbus hall, as another reviewer mentioned.  There are booths lining the walls and big wide tables, so it's good for dates, small groups, and large groups alike.  I came with coworkers and our boss, who picked this spot for our Christmas lunch.\n\nWe ordered pizza and cocktails.  The cocktails were unbelievably strong; they pack the punch of about 3 cocktails you'd normally get, for just seven bucks.  I don't think we're in Manhattan anymore.  I had some wine, which was generously poured to the rim.  The pizza, which we waited a long time for, was GREAT.  We tried plain, sausage, and pepperoni.  All were really, really good.  Sauce was delicious, cheese was perfect and they showed tasteful restraint in not using too too much.  I don't eat the crust unless it's great, and it really was. \n\nAnd for the street cred part of the review: I've lived in NY since birth, family's part Italian, ate pizza in Italy, tried Grimaldi's, etc.  I simply don't understand how someone wouldn't find this pizza to be a near perfect specimen.", "author": "Allison C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-24", "description": "This is real New York pizza.  This stuff used to be in every pizzeria around the city, now those \"dime-a-dozen\" places serve the same plastic pizza.  Not Sam's.  The crust is what really makes it.\n\nAs other Yelpers have said, if you're looking for a fancy foo-foo place with fancy foo-foo toppings, then this isn't your place.  If you're looking for old-school NY Pizza, then Sam's will probably make you happy.", "author": "Lonnie James L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-23", "description": "Just a bit of background... I work in Carroll Gardens \u0026 every Friday a colleague (63, white, old school Italian woman)  and \u0026 I (30 something, black girl, hipster) go to the local restaurants for dinner. Odd couple, yes I know.  She's been in this neighborhood forever and recommended Sam's. So last night, Sam's it is!\n\nWalking in I was taken back by the decor \u0026 fluorescent lights, on the sign out front it says serving lunch \u0026 dinner for 80 yrs, thats probably the last time it was renovated.  But, I'm still optimistic.  We were greeted, we were seated  \u0026 we smelled...I can only describe it as a hint of cat urine and old grease. But again, I'm still optimistic since my dinner date was so excited.  Plates and cups were old, so I'm not going to use the word dirty, just overused and needs to be discarded.  So I asked for a straw and the waiters response, \"here you go kiddie\" in a playful baby voice. I laughed it off.  Next, the bread came to the table with just butter, even I know it's best served with olive oil, salt \u0026 pepper. We asked for it and sadly informed of the owner's ridiculous rule, oil \u0026 vinegar cannot be served unless you order a salad. So we did, problem diverted.  \n\nMy dinner guest jokingly asks our waiter, if the owner still has the rule, you can only order a pizza at a table of 5ppl or more, but she was serious, that was one of his rules back in the day.\n\nNow onto the good part! My colleague already knew what she wanted, Veal \u0026 peppers and ordered as soon as we sat down with a diet sprite. Not too familiar with \"REAL\" Italian food, I'm more of a suburanite Olive Garden kind of gal, so I had questions.  The menu doesn't offer much of an explanation, which I need as a reassurance, because I am allergic to pork. So after the waiter described Chicken Rollatini, I decided that was a great choice.\n\nMy dinner guest, gets a regular sprite and sausage and peppers, but not one to argue she accepted whatever she got and ate her food, but quietly complained to me. I get my dish and after eating a 1/3 of my chicken, I realize I could possibly be eating pork and my suspicions were right.  I'm furious and shaking because I know the aftermath I will endure later in the evening.  The owner proceeds to tell me, he heard the waiter tell me bits of salami is wrapped in the mozzarella. He said no such thing. Then he corrected himself and mentioned the waiter said prosciutto and proceeded to tell me it was pork as if I was imbecile.  Side note: for a person who doesn't eat pork, I know the word pork in several languages.  The owner was argumentative and wouldn't let me get a word in, he talked over me and attempted to complete my sentences. He also stated that he gets vegetarians in his restaurant all the time and they get mad at him, because he doesn't inform them meat is used to flavor their red sauce, but blamed the vegetarians for not knowing how Italians prepare their food.\n\nWhich leads me to my final conclusion, if you know you are serving people from different backgrounds \u0026 religions, you should put it on the menu what it's cooked with.   Because obviously asking a waiter, will not get you the correct answer either. And if he's had this issue before, why hasn't he done anything to better serve his customers?  Does it hurt to update your menu, does it hurt to train your staff to be better equipped to explain your menu?  What ever happened to customer service \u0026 the customer is always right?\n\nI really wanted to give him a piece of mind, but I didn't want to look like the angry black woman, so I grabbed my coat \u0026 walked out.\n\nSome reviews are great from this place \u0026 some...not so great. This is a place you never know what your're going to get, so enter at your own risk.  The cat pee should of been enough, but I gave it the old college try (Yes, I went to Rutgers Univ, I think I know prosciutto is pork) \u0026 failed miserable.  No wonder the place was empty!\n\nLet's just hope next Friday at Neal's on Hicks St we have a better experience.\n\nYou've been warned", "author": "ImAFoodie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-20", "description": "This is classic old Brooklyn at its best. A total time warp, the decor hasn't been touched since around 1940. It looks like something right out of the Sopranos.\n\nLou, the owner, is worth the trip alone. He plays up his Brooklyn Italian to a T, and is a really nice (but quirky) guy.\n\nI was here with a large group with Scott's Pizza Tour. We got classic cheese pizza, and it was absolutely delish. Go.", "author": "Vanessa W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-13", "description": "I will echo what Dimo wrote. Went this past Friday at 12:10 to find door locked and staff inside. Walked around the block, came back at 12:30 and door still not open. If you can't get in to sample the product then the product stinks. It is arrogant of the owner to thumb his nose at customers by not opening at posted time not even a paper note on door to let you know when they would open. We went to Smith Street and ate at Pane e Vino and had a fantastic lunch. Your loss, Sam", "author": "Penny N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-23", "description": "Wow. I never ran into the problems that some of the yelp reviewers had at Sam's. \n\nI have only been here during lunchtime hours. Loved the pizza and salad. The pizza has a Nice crisp crust with good flavor. \nThe place is old but I love coming here.  Never had any service issues. Wish I still lived in Bay Ridge so I could get there more often.", "author": "Tom M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-23", "description": "The majority of the other reviews are right: no atmosphere whatsoever, ironically surly service, and the same decor as your father's 1970s den.  But the pizza is very good, although of the very saucy variety (which you may prefer - my wife does, I don't).  That's good enough to return. \n\nNB: Don't look for artisanal toppings here.  These are standard NY pizzeria toppings - canned black olives, hormel (presumably) pepperoni.  No matter.  If, like me, you eat pizza for the crust and the flavor of the sauce rather than for the quality of the toppings, then you'll be happy here.", "author": "Raffi M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-02", "description": "I used to love Sam's.  I've lived in Carroll Gardens for ten years, and it was always my go-to place for delicious neighborhood pizza. I loved the old school Italian-Brooklyn vibe and the hilarious no-nonsense waiters. I even put up with the grime and the broken banquettes- it all somehow felt authentic.  *NEVER AGAIN* I just came home from eating dinner there for the first time in a year, and could not believe what a bad experience it was.  The waiter was surly and pushy and clearly irritated that we didn't order wine and a lot of extra food. He interrupted our meal several times with his loud strange opinions about the need to \"finish the meal and not take home a doggy bag\" and then seemed angry when we couldn't finish the last two pieces of pizza.  My friends and I got there around 6:30pm and were told to sit wherever we wanted, as there was only one other family in the otherwise empty restaurant. By the time we left it had filled up to 1/3 capacity.  Our meal lasted about 45 minutes, and within two minutes of the check hitting the table, Mr. Cranky-Waiter comes over to our table and says \"Hey, I got a reservation for this table, so can you move it along?\" Are you kidding me? The restaurant was not full!  And what a way to treat patrons.  If my friends had not convinced me to leave 10%, I would have left no tip at all. He was so nasty.\n\nThe pizza was also just not as good as it used to be.  The cheese was a little off, the mushrooms were not fresh, and the pie was not quite hot enough.  Some of the reviews here say that Sam's Pizza is on par with DiFara or Grimaldi's: Though it used to be delicious, it was never THAT good.  No way, not even close.\n\nIt's interesting to read the review listed here about the owner possibly being homophobic and/or discriminatory to a customer; our dinner conversation happened to be partly about gay rights/ LGBT issues. Maybe he overheard something he didn't like? I'll never know, but one thing I do know: I AM NEVER GOING BACK AND YOU SHOULDN'T EITHER.", "author": "Elizabeth F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-16", "description": "I love pizza.  I love pizza so much I should change my name to pizzaface.\n\nI love pizza, and I'm Italian, and I'm from New York -- so anything that screams \"authentic New York Italian restaurant, don't fucka with me or I breaka you face\"... I love.\n\nSam's is it.  We went on a Wednesday, it was nice and quiet.  Wood panelled walls, checkered tablecloths.  No muss no fuss.  Louie, as I got to know him, has been working there for 30-something years, and was raised in the apartment above the restaurant, which has been in his family for 81 years.  81 years!!!\n\nThe food is good (we just had the pizza, but it did not disappoint), service was good- certainly fun and entertaining (picture your favorite uncle who you think might really yell at you at any second... that's Louie). Wine glasses are FULL. \n\nOh I just love this little place.", "author": "katy f."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-01", "description": "Honestly as cliche as it sounds, I would give this place no stars if I could.  This place had hands down the worst service I've ever encountered!!!  Keep in mind, I lived in a third world country for three years before moving to Brooklyn.  For starters, the waiter was really pushy.  He told my friend and I to order the clams as an appetizer as he took our drink orders.  When I told him we weren't that hungry and were just going to get dinner he made a face of disgust and told us we should reconsider.  If that wasn't bad enough, when we finally did order (which took him about an hour to decide to come over to us when the restaurant only had 5 other people in it), he told us we should order the wine if we weren't going to get the clams.   \n\nI told him we would pass as we didn't have that much cash on us.  He then told me that there was a bank around the corner in a really nasty tone.  We ordered a pizza because they were out of heroes.  We were unable to finish 2 of the slices because it was a big pie.  The waiter walked by and said that we had to finish them because he wasn't going to wrap them up for us.  When we said we were full he proceeded to again tell us we needed to eat it because he wasn't going to let us take it to go.  \n\nFinally he allowed us to wrap the pizza up.  He came over with our slices and said that he had no idea why people order a pizza if they can't finish it.  He also said that he didn't think it was right for us to make him wrap up our food that we paid for!!!  When I got around to heating up the slices the next day I opened the bag to find that he had put the two slices face to face so all the cheese and toppings stuck to each other.  This server was so disrespectful from start to finish!  If you want mediocre Italian food served to you with attitude, then this is the place for you.  I would highly suggest going elsewhere as this establishment should be closed down or at least fire their current staff.", "author": "Philip F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-15", "description": "I'm from San Francisco so the only thing that I could say that Brooklyn has (except the bagels) in terms of culinary genius is its pizza (which, admittedly is pretty freaking amazing). Sam's is our go to spot. Always incredible. Great crusts. Nice old school guys who work there. Definitely a fan.", "author": "Matt D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-14", "description": "Delicious!  There is really no wait when I went on a Sunday evening at 8:30 pm.  My husband and I got a full booth for just the two of us. I tried their shrimp with marinara sauce on spaghetti.  It was heavenly!  The marinara sauce had freshly chopped garlic cloves in them and was seasoned really nicely.  The waiter was funny and having a blast chatting it up with us and other patrons.  My husband got the meatballs \u0026 spaghetti.  The size of a meatball was bigger than your fist.  They are huge!  I hope you go there with an appetite, because you won't be leaving with one.  Just a great cozy place with fun top 40 music in the background.  The bathrooms are clean, and they're located upstairs(well for ladies, that is).  I'm so glad that I came.  It has really great service.  I definitely like to come back and try their pizza which I have heard rave reviews about.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-31", "description": "Found out about Sam's via Scott's Pizza Tour -- he totally saved the best for last!  We've been back a couple times since the tour and have enjoyed the pizza each time. The plain cheese is the best one, although the meatball was good too.  Maybe we'll branch out and try a pasta next time, but why mess with success?", "author": "Cindy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-30", "description": "I will start out by saying that I cannot judge the food because I did not stay around long enough to try it. I was looking forward to eating at Sam´s because there´s nothing my boyfriend and I love more than old-fashioned, home-cooked Italian food. However, the experience was awful from the moment I walked in. The lighting was awful, the place was super stuffy and had a really unappealing, unrecognizable smell. I was still willing to give it a shot, so we walked towards the back dining room where the lighting was somewhat better and the owner/ waiter is sitting back there and just stares at us and rudely asks us what we´re doing. We ask if we can have a table for two and he says go up front. We go to the front of the dining room and pick a table. Three minutes later he comes to the fronts and sternly tells us \"you can´t sit there\" and proceeds to move us to a different table. Already disgusted by the ambiance and totally turned off my the owner´s complete lack of respect, I decided immediately to leave. Luckily, we found Mama Maria´s Restaurant down the street, which turned out to be perfect!!", "author": "Hannah S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-10", "description": "I got a pizza to go, so can't comment on the restaurant sit-in experience, but they definitely make a tasty slice.  \n\nYou could tell their ingredients are fresh (tomato sauce was particularly delicious), giving the pie an unique homemade taste that I definitely look for in my pizza.  \n\nFor basic Italian this spot  is a bit on the expensive side, but I'd go again.  Pretty good for Brooklyn.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-16", "description": "The only reason you go to this place is because you are from the old neighborhood. The pizza is pretty good but it is kinda pricey. The customer service can run from good to mediocre depending on who you are. The owner doesnt take shit from anybody, straight up.\n\nThe pizza is pretty good and the way they put the sauce on top of the cheese makes it amazing. I really like this place. My only complaint is the price is kinda high.", "author": "Hudson K."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Sam’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "238 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/hz4zqtC67Bi3F6PChXOQHA/ls.jpg", "@type": "Restaurant", "telephone": "+17185963458"}