{"aggregateRating": {"reviewCount": 214, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-26", "description": "very overlooked joint here.\nit was an impromptu choice to go in here, and I was quite impressed!\nYes, not the absolute best of all places,\nbut this is some serious old school Italian joint\nThe interior is very old, at least 50 years old, but not saying that in a negative way, it's historic!\n\nIf Lucali is packed, definitely come here,\nit broke my heart that more than half of tables were not taken during prime time dinner hours, but it is a good antidote to your frustrated heart caused by ridiculous waits in Lucali's", "author": "Narim K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-31", "description": "Been going there and recommending for years. That was until last night. I walked in at 5:15 and place was empty. The owner reluctantly says he can accommodate our table of 12 and then proceeded to say we must be out by 6:30. He said it meanly and sternly. I promptly walked out never to return. Balls of him when I am a native brooklyn girl who has many choices. Unreal and disappointing", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-28", "description": "If your wife can't cook, don't divorce her. Come to Sam's and you'll both be happy.\n\nThat's not advice I'm giving you, that's just what's written on the top of the menus at Sam's. And you know what? It actually is advice I'm giving you. This is 2017, so stop expecting your wife to cook dinner every night you sexist pig.\n\nSo not only does this gem have excellent pizza and a restaurant full of characters (both the staff and the clientele), but they are over here solving the inevitable marital problems caused by your blind support of the outdated patriarchy. How could you go wrong with this place?\n\nSam's is old school. What I mean by that:\n\n1. It's been here forever.\n2. They pronounce ricotta \"rigot.\"\n3. There's plastic all over the tables and booths.\n4. You shouldn't come in expecting a bunch of stuff. Including: \n\nFormal service. \nModern decor and dinnerware.\nRomantic ambiance.\n\nWhat you should be expecting though, is excellent pizza, affordable wine, personable service (Steve is the man), and delicious Italian-American staples like baked clams, garlic and oil soaked broccoli rabe, and too much pasta. \n\nBy the way, our waiter Steve was way too grateful for what was not that crazy a tip, so I think there's a few of you out there that need to take care of your servers better. Don't make me come after you.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-29", "description": "The four of us came here after a somewhat underwhelming experience at another famous pizza establishment nearby.  Somewhat full, we went with a pie with ricotta (~$24 total after tip).  We got the full attitude of a traditional pizza joint of the old days which was cool if you aren't stuck up about service (you may have to ask for water, as it's not automatically served).\n\nThe pizza itself was pretty average - not too salty or bland.  Dough was ok and adequately held up to the watery slice.  I would have asked for oregano, Parmesan, or some chili flakes but might have gotten attitude for it.", "author": "Albert W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-21", "description": "Sam's has been on my list of places to go for a while, but after seeing the exterior while I was on a walk with my girlfriend I was a little hesitant to go in. I'm very glad we did because this place is truly a hidden gem and the guy who runs the place makes it 10x better. It's not too often that a business is able to stay around for as long as Sam's has been around so you know they're doing something right. \n\nWe ordered the baked clams and a plain pie. Both were definitely above average, but I do wish the sauce on the pizza had a little more flavor to it. Inside it's pretty dated, but it's actually kind of a refreshing change from all of the trendy spots that are popping up in Brooklyn Heights. Obviously those restaurants are good for certain occasions, but if you just want some good food, a relaxed and homey environment, and great conversation with the owner then you can't beat Sam's. We didn't order any wine, though I hear the prices are dirt cheap and the glasses get filled to the top so next time I'm back we'll definitely be getting drinks.", "author": "Devin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-12", "description": "If you are looking for a quintessential Italian Brooklyn Restaurant experince then you found the spot!\n\nThe restaurant is in an old diner style with retro lighting, wood paneling on the walls, and red tablecloths.\n\nOur waiter had a strong Brooklyn Italian accent to go with his strong Brooklyn Italian personality (in a good way!). He gave us some great recommendations for the toppings on our pizza, and it paid off. The pizza pie is a traditional large thin crusted Brooklyn Italian style pizza. \n\nOverall a very Brooklyn Italian experience you should bring out of towners to to show them the real Brooklyn.\n\nCash only!", "author": "Lina T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-16", "description": "Really loved this pie! We went on a pizza eating marathon and this was the place that stood above the rest. The pizza is gigantic and it was delicious. It will feed 3-4 people easy. No slices.\n\nThe place is old school and has a ton of character. Don't forget to bring cash - they don't accept credit cards. Highly recommended for a great NYC pizza pie!", "author": "Eva G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "Hands down favorite pizza in NYC. Sad it took me living here 15 years before I discovered Sam's. \n\nThe bottles of wine are dirt cheap, the service is no-nonsense (red plastic tablecloth, old school red sauce spot), and the pizza is I N S A N E.\n\nAdvice for 4 person dinner: bring cash, order two pies, two bottles of wine and thank me when you're done.\n\n-plain pie + ricotta + garlic\n-pepperoni pie + garlic\n-Montepulciano perfect pizza wine and is $19\n\nC'mon. This place is a wonderful respite in a city that is sadly going the way of artisanal, fancypants pies, and $15 glasses of wine. We all need Sam's to stick around forever. I just moved to Washington Heights but will be back at least once a month to get my fix.", "author": "Anne R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-18", "description": "I came here with a group of 4 people on a Thursday night.  It seemed like a real local place that has been around for years.  When you walk in, it's definitely a old school Italian place, complete with plastic over the tablecloths on the tables.  It's so old school that they don't even put prices for the pizza or calzones in their menu.  Their prices for alcohol looked very cheap though.  We ordered a ricotta pizza pie which was enough for 4 people.  Each of you will get 2 large slices of pizza.  The pizza was hot that it was still steaming when it came to the table.  The crust was crunchy but not dry.  There was a lot of cheese to the point that it would be soggy if you don't eat it fast enough.  I felt like the sauce could be tangier with more seasoning.  It was still a solid place for a good slice if you're in the neighborhood.  Service was fast and attentive.  FYI - it's cash only as with most old school places.", "author": "Julie Ying X."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-16", "description": "After two hours, I left having eaten only bread and butter. Be prepared to be completely ignored by the one person working the front, and have to yell to get menus, order, etc.\n\nI don't eat beef, but know this is unusual, so I was still somewhat understanding after finding it in the eggplant I ordered from the \"Vegetables\" section of the menu, and also in a side of ziti. Asking about this, I was lectured that it is my responsibility to tell him what I don't eat. Fair enough. The non-beef version I was given 10 minutes later was a cold mush in a watery sauce; inedible. After chasing him down to get the check and to report on the cold, gross eggplant, I got another lecture that I should have told him sooner. When I said I had been trying to get his attention for 15 minutes, he said that he doesn't look at people, so I should have waved my arms. The tough guy act would be kind of cute if the food were good and/or arrived in less than an hour.", "author": "Justin R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "Get the pizza.  Get the mussels posillipo.  Dip the pizza crust in the mussel sauce.  Thank me later.", "author": "Ali I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "Im SHOCKED and disappointed to see Sams only get a 3 and half star rating. \nWhy? Because there should be more places like  this. Sam's is a dying breed of nyc restaurants, one that's actually owned by real new yokers. People who grew up and live here.  They hold a part of history with the neighborhold and have watched it change drastically as new people from outside move in. \n\nIf not for Sam's this probaby be replaced with another SweetGreens. \n\nI thoroughly enjoyed my first visit. I came with my neice - before going to the movies. We came in and were greeted by a welcoming waiter with a heavy NY accent. He was hilarious and made us all feel like we've been there before. We order a small plate of meatballs and a large pie - half plain and half sausage. \n\nThe food was awesome. Their tomato sauce is perfection. The meatballs tasted like an old gradmother recipe. The one you always hear italians talking about. The pizza was just as good. Cooked to the right tempature, the crust had a great crisp and the sausage tasted fresh from an italian butcher. \n\nI want to come back with friends who didnt grow up in Ny. Im sure they appreciate the authenticity of Sam's", "author": "Joe G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "If you wanna kick it old school, you'd be hard pressed to find anyplace more old school than Sam's. Walking in is like stepping onto a movie set, except it's all for real. Sit down in a booth that's seen better days, marvel at the photos on the wall, and order a stiff cocktail and a no-frills pizza from the owner himself, Lou.\n\nYes, the pizza will be in the area of $25 if you want toppings (highly recommend pepperoni and garlic). But it's a large old-school sized pie. And yes, the service will be a bit slow. But hey, that's the way things were done last century. And if it ain't broke, why futz with it?\n\nHonestly, I think we all need to slow down once in a while and eat way too much pizza and pretend we're in a different era.\n\nAn era of cash-only.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "Had a pizza here this evening. I'm new to the area from Jersey. Very much like Papa Tomato Pie in Trenton. One of the best in the state. Same decor believe it or not. Homey and comfortable. Old style pie with a very tasty crust, nice homemade sauce and quality mozzarella.  Plan on many more trips as this place can be a regular, where you tire of trendy joints. Owner, bar man, and chef all friendly and fun. Pasta next.", "author": "Frank L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-06", "description": "If you are looking for real old school Brooklyn style Pizza and real Italian food this is the place.  I'v been going there since the 80's and nothing has changed, great tasting food every time.", "author": "Matt S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "Went to Cobble hill cinema to watch Phantom Thread,on my way home I walked past the restaurant the old world appearance caught my attention,I came to a halt and started reading the menu,got intrigued,the chalk board menu,said ask Louie,I look to my left and Louie is having an afternoon cigarette,so I ask him about the steaks,he says,they're pretty good,we talked for a little while longer and I follow him into the restaurant to get a to go menu and that's when I decide to stay for a cocktail a dirty martini three olives,it was delicious and did the job of getting me comfortable enough that I decided to stay for lunch,I ordered the fried pork chops,with French fries,the entree was more than ample,the service was good,my server SLASH bartender was good also,he saw to all of my needs I will definitely go back,oh I almost forgot,the pork chops were tender and juicy,just the right balance of marbling,not salty but flavorful and fried,their version of French fries were delicious,if you feel like having a me day,catch a matinee and do lunch it's definitely a spot to visit", "author": "Burroti K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Best pizza in NYC. Sam's is amazing. Get the pie with fresh garlic. Louie is the best and they have been a Cobble Hill staple since the 1930s. Support your local businesses!", "author": "Josh V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-31", "description": "Walked in right when they opened up on a Saturday at noon. The place was dark and not one person was there to greet us when we walked in. The restaurant looked like they hadn't changed the carpeting or the booths since the 50's and I felt like Tommy in the movie 'Goodfellas' when he got wacked walking into the banquet hall on the day he was supposed to be made. After getting past all of this and the mild scent of old aftershave that permeated throughout the dining area, boy were you in for a treat.\n\nThe maestro finally comes out of the back to greet us. Lou, the owner is a strong personality and has a sense of humor that not everyone would get/appreciate, but weirdly I did. He's a no nonsense guy and knows we're here for a good pie. What I appreciated about Lou was that he genuinely cared about his customers having good food and it really showed. \n\nNowadays, people use terms like \"amazing\" or \"the best\" too loosely and at times it sounds cliche. However, if I am lying to you when I say that this was the absolute best pizza that I have ever eaten in my 29 years of existence, may God Himself smite me right now. I know that pizza in most other places will never live up to this place and that's kind of sad. You'd be doing yourself a big injustice if you did not give this place a try.", "author": "Mujtaba S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-21", "description": "Zero positives above it this restaurant. Cold, bland food with an under charming attitude. Head I read the reviews prior to going I would not have gone. Waste of time and money. SMH.", "author": "Jonathan F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "Cash only!\n\nMy suspicion is that Sam's loses a lot of business due to being cash only.  It's not that big a deal for more casual, takeout type places where you run in and grab a quick meal for $10 - $15 but a casual Italian sit-down spot like Sam's is really targeting families or groups where you're probably going to drop at least $30 on a meal.  \n\nI've been to Sam's twice now, the first time with friends and the second time with family after an event in downtown Brooklyn.  That last time was on a weekday and we got there around 2:00ish.  The restaurant was totally empty but, having been here before and knowing how awesome the food is, we stuck with it.\n\nOrdered two large plain pies between four people, spaghetti and meatballs, pasta fagioli, and a chicken parmesan hero.  It's hard to explain how amazing this pizza is.  It's similar to Johnny's in Mount Vernon (Westchester), if you've ever been there.  Thin crust with a light  layer of sauce and cheese that has a little bit of kick to it.  The crust is not crunchy so you can still fold it up.  All the other dishes I've ever had here have been phenomenal as well.  Unlike a lot of other Italian places which can't seem to grasp the concept of pasta being cooked \"al dente\" Sam's gets it right every single time.\n\nNow, to the service.  I'm not in the least bit surprised to see such a drastic spread in the ratings regarding the service.  Look, Louie is a very old-school New Yorker.  If you can walk in, smile, laugh a little bit and just generally interact with other humans in a pleasant manner than you are going to enjoy this place.  He likes to talk to his guests and to get to know people.  More importantly, he means well.  He literally tried to convince us to not order so much food because he was sure we couldn't finish that much between four people only (he was right, but I wanted to have Sam's leftovers for dinner anyway).  Go in, grab a pie or five and enjoy eating pizza the way it should be eaten.", "author": "J C."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Sam’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "238 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/hz4zqtC67Bi3F6PChXOQHA/ls.jpg", "@type": "Restaurant", "telephone": "+17185963458"}