{"aggregateRating": {"reviewCount": 214, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "Came here with the family. First impression was that this place was old and dingy, but the food was good. Love the pizza. I had chicken parmigiana, too, but it was too large to finish. \n\nOwner is a bit of a character, but he's a pretty cool guy once you talk to him. Advice is to come early enough that you don't mind when you leave. Came on a day a server didn't show up, so the owner served everyone. He took his time, which was fine. I don't like being rushed, either, so I get it.\n\nOverall, liked the experience. The atmosphere was nostalgic, probably because it reminded me of the family I grew up with.", "author": "Dani C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-17", "description": "A visit to Sam's is like taking a trip back in time to another era of Brooklyn. We were lucky enough to discover this place as part of Scott's Pizza tour and are so happy we did! The restaurant is from another decade (a few decades ago at least, if not 1930 when they opened!) with the dated decor, booths, and signs. There is something charming about this place however.\n\nLouie is a character for certain---the current owner and a relative of the original owners (grand nephew I think?). He was extraordinarily friendly to us, possibly because he was familiar with our tour guide, and was attentive and jovial throughout. Lots of great stories about the place's history and his family.\n\nThe pizza we had was amazing. Even more amazing if you request their special garlic oil be spread on beforehand. Really unique about their pizza is that they layer the cheese before the sauce--never seen that before! It creates this crazy thing where the cheese and sauce become one. A must try for any pizza lover!\n\nIt is cash only so keep that in mind. And prepare for slower service. You can't find an experience like this many places so to me, it would be worth it.\n\nThey also have a complete menu of other food options besides pizzas, if that's not something you're up for. Beer and wine too.", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "I hope this place stays open forever. It's the antithesis to Millennial Brooklyn. No high design and avocado/Kale nonsense to make you me feel cooler than you actually are. Therefore, no 25-35 year old man bun wearing \"social entrepreneurs\". And the food is very good. God bless you, Sam's.", "author": "alex b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-16", "description": "The place was empty. The atmosphere was dank. The faux flowers were dusty...for starters....and finally, the shrimp in the shrimp parm was bad!\n\n It had a pungent, ammonia like taste that couldn't be masked by the fried exterior.\n\n Thank goodness my friend detected it before sharing it with her grand-daughter.\n\n We won't be coming back here!", "author": "Nicole P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-16", "description": "So sad because I really wanted to like it here! My grandpa was a regular back in the day and I had high hopes having heard stories, but omg was the service rude. We come in, nobody sits us or acknowledges us, so we just sit down at a booth. Waiter is obnoxious and smelled of BO. Brought us some nasty bread and just threw it down. Food came next, literally in 5 minutes,  piping hot (think it had been nuked). Burned my mouth. Flavorless. We left over most. Will not be back! Ps. Please re-model.", "author": "Marissa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "This place ruined pizza for me forever. We ordered two cheese pies and they were honestly the most delicious pizzas that I have ever had in my life! The cheese was good quality and perfectly melted. The dough was chewy and well seasoned. The sauce was just right - not too sweet. Everything about the pizza was perfect.\n\nThe ambience of the restaurant is a bit... rustic? Apparently the restaurant has been around for many decades, and the pictures around the restaurant show it. Personally, I really think the place had character and reflects a lot of history. This place is truly a gem.", "author": "Christy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "This is what Brooklyn Pizza should taste like!  This place has been downtown Brooklyn long before the hipster doofuses discovered it and has some of the best Italian comfort food,", "author": "Marguerite T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Having grown up in the hood.... this is the real deal. A rare throwback to the old Brooklyn Italian restaurant. Maybe a better way to look at it is: Try it and you might find yourself thinking your in an old 1970's movie.\nThis was the FIRST pizza place in the hood way back when. The pizza is great, the baked clams as well. Lots to buy. You must be open to a new type of experience to eat here... not the atmosphere of a fluffy place but again the old hood. My kids love it because they are challenged by the owner, do not WORRY he knows how much to push and not to push.", "author": "D A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "Great good. Old school Italian. Lou the owner is the best.  Try the pizza or the calzone. Best in the city.", "author": "Nicole E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "Best pizza I've ever had. They don't do slices so have to get a pie. Cash only. Service is bad, owner is rude. Normally I would care and knock 1-2 stars off but.......THE PIZZA IS UNREAL", "author": "Brian N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-23", "description": "I have been going to Sam's since I was a bump, and many of my life's special occasions were celebrated here.  As a matter of fact this is where my wife and I had our first date.  The place is a lot of fun and the food is great. I can honestly say every single item I have had off of their menu I have enjoyed.  Stepping into Sam's always felt like coming home to me. Mangia.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-21", "description": "If you are not from Brooklyn, you may not get this place. For me- it was like a piece of old school heaven. Booths, yes booths, an old telephone booth covered by boxes. The older waiter was nice, but again no little hostess to greet you when you walk in, I just said I wanna eat- the waiter said........sit anywhere. I took a booth of course.\n\nAte:\nHot antipasto\nVeal cutlet parmigaina with spaghetti\nTotal- $26.50- cheap!\n\nThe hot antipasto arrived in a metal dish with a stuffed pepper, two baked clams, a couple of shrimp oreganata and eggplant parm. This dish was nothing short of BRILLIANT! Every component melded so beautifully with every other and the flavor was reminiscent of the best of every antipasto ever!!! The veal parm on the other hand embodied my least favorite parts of old school- thick, overbreaded, but the flavor of the sauce and cheese fared better the next day when reheated. The sauce here is a great one- deep, rich dark and tasting of the history of the memories this spot must have seen. The pizza looks amazing and want that antipasto again- no doubt about it!", "author": "Franny A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-21", "description": "I love this place so much! It's classic, not pretentious, old school, nostalgic, and so delicious. One of the best pizzas in NY. Great for families and groups.", "author": "Lisa O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-01", "description": "Waste of time with a rotten attitude!  Even though they tell you they are open till 10 on the phone he says \"tough\" when you get there at 9:15.", "author": "Philip L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-12", "description": "Tried to go at 12:20p, after the stated open time. Opened the door and asked if they were open, a rude guy turned and shouted: \"No! We open when I say we open!\"  I did an about face and went Layla Jones a half block up the street.  It was amazing and the staff there didn't act like they ran Brooklyn like half-bit nutbags.  I've met lifers who have a better attitude than these idiots. \n\nReceived a note from Sharon L claiming this is neither a review nor an experience.  However, I beg to differ.  Service starts before, through and after a meal.  If you're going to spit in your customer's face before the meal starts, it warrants other Yelpers knowing about it.", "author": "Dimo J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-23", "description": "The place is very authentic, like it from the movies, no changes since opening 80 yrs ago! Food is excellent : juicy meat , nice cheesy pasta ! The waiter super nice and very friendly . Everything from the entrance till the food have a very special atmosphere. Will definitely come back in the future", "author": "Aleksandra E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-17", "description": "I like this place for old school Italian American fare.\n\nOwner is super friendly, restaurant has been around forever. I think it might be the oldest restaurant in the neighborhood.\n\nCalzones are huge, pizza is really good and who cares about the decor. That's not why you really come here.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-04", "description": "My girlfriend and I have been eyeing this place for years because of its excellent signage but had not yet been in. We finally went last night. Both of us agree: the pizza is one of the best we've ever had. I also got eggplant parm, and that too was excellent. It's a no-frills place but we are both fine with that. Loved the ambiance and our server. We will be back, and will be sending everyone we know.", "author": "Hannah O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-07", "description": "Sam's can be summed up pretty easily: the food is great (pizza/pasta/etc), the service is slow (really slow and the it'll be old school/brash/comical) and the place could use a 1.5 makeovers. \n\nWe went on a Saturday afternoon with maybe 6-10 other people in other parties max. There was one hostess, presumably Sam, who also happened to be making the pizza (presumably everything else too). It was a long wait to get the food and his personality will likely not be liked by most, but growing up in NJ and being exposed to people like that in general, I found it nostalgic as your rarely come across people like that.\n\nIn short, Sam's is somewhat of a niche place for me when I want good food, but don't mind hanging out for a while simply due to the wait for the food. Put another way, Sam's like likely a love/hate type restaurant.", "author": "Aaron C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-16", "description": "I came here because of Scott's Pizza Bus Tour.\n\nApparently, it's the most authentic Italian pizza joint I've been to because according to our guide, the pizza spot is \"trapped in time\" based on their ingredients and process of food creation.\n\nWe had cheese pizza and was very delicious. It tasted fresh and the textures were perfect. I think it was cooked \"upside down style\" meaning the tomato sauce is above the cheese so that the cheese doesn't slide off after taking a bite.\n\nThe owner was probably the most authentic Italian person I've seen (aside from in the movies) and fit about every stereotype--pretty awesome. He set up a long table in the back of the restaurant for the whole bus party. It felt like scene from a Home Alone movie.\n\nIf you're on a great pizza hunt in NYC and want to venture outside of Manhattan, Sam's is a great spot to have truly authentic pizza.", "author": "Marlon T."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Sam’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "238 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/hz4zqtC67Bi3F6PChXOQHA/ls.jpg", "@type": "Restaurant", "telephone": "+17185963458"}