{"aggregateRating": {"reviewCount": 14, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-25", "description": "This is a good local pizza spot near my job.  They have a fairly extensive menu of breakfast food to go along with the pizzeria standards.  I am a fan of the pizza, which has a good sauce to cheese ratio and great flavor.\n\nTheir one big knock is that they can be inconsistent with the quality.  I have come here and had life changing slices and then there have been slices so bad I wanted to send them back.  The pepperoni rolls are to be avoided, but the calzones \u0026 strombolis are good.  If you want to try your luck, stroll on in for a slice, but only if they look fresh.  Otherwise, pass.", "author": "Drex H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-27", "description": "Pizza is alright, not bad if your hungry. But please ffs to the establishment owners : please do something about the beggars! I got hassled by 5 people in two days asking me to buy them food!", "author": "Gabriel S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-17", "description": "My friend took me to a Nets game at Barclay's. The plan was to get pizza before the game, but I mistakenly didn't Yelp a place nearby before we went. I figured you can't go that wrong with pizza in Brooklyn. \n\nOh. I was wrong. This pizza was simply not good. It had no flavaaas. When I need to sprinkle salt on my slice to enhance flavaa, this pizza fiend is not happy. \n\nDon't go here. If you're in the hood, Yelp it up first.", "author": "Priti K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-25", "description": "For the price, it's a solid deal. You get good food for the buck. Pizza is prob the best bet but I haven't ventured.", "author": "Samuel B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-16", "description": "For starters, the lady who answered the phone had us on hold for about 20 mins. Finally was able to order and after have our breakfast delivered, I must say this is THE worst breakfast I've ever had. The pancakes were really dry and gritty, the eggs were disgusting (no flavor at all). Don't really think I'll eat eggs again, and I think the bacon was made out of paper. Sorry, but won't be eating here ever again!", "author": "natalie h."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-15", "description": "Horrible food and service, I've eaten better food in jail. I ordered a chicken roll and some garlic knots and was told it was $5 and they charged me $6 because I asked for a cup of Mariana sauce. Don't eat here, half of the people who work can't even speak english.", "author": "Joshua U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-23", "description": "Ordered lunch here with coworkers. \n\nTheir prices are really really affordable.\n\nI had pasta in vodka sauce. While it tasted very good, it tasted nothing like vodka sauce! \n\nI would order from here again but would probably try something else from the menu.", "author": "Arielle S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-06", "description": "I called to order a pizza over two hours ago. I tried to call and check on the order after an hour, but no one answered (I let it ring about 30 times, and called several times).\n\nThe pizza still has not arrived, nor have they called. We've already gotten food from another restaurant.", "author": "Wendy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-25", "description": "Stopped here after bringing my sister to ballet practice since she was apparently famished and wanted ziti.  I went with the pasta with vodka sauce, I wish I had read the reviews before I ordered, it totally didn't taste anything like vodka sauce, like I could tell they used evaporated milk to make the sauce which leaves me wondering who made this recipe.  The prices were really good but the flavors where just off and nothing spectacular", "author": "Samantha U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-30", "description": "The Italian food is pretty decent considering its being made by Mexicans. Prices are decent. On the other hand the place is dirty, delivery takes forever. They hardly speak english. Have no clue how they are still in business. I would avoid.", "author": "Salim K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-19", "description": "I work very close to Angelica's, and have been actively eating from here for the last two years. Yet recently there food has been getting worse. First I order baked ziti and the vodka sauce was spoiled. Then a salad was purchased for me and there was a bug.\n\nIm done, if I had the time I would picket out front!!", "author": "Innocence D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-12", "description": "I had a plain slice. It was greasy, too thin, lacked cheese \u0026 sauce, \u0026 made me annoyed that I spent $2. Who gets annoyed at spending $2? The pizza at 2 bros around the corner is $1 \u0026 it tastes ten times better.", "author": "Nafeesha P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-07", "description": "They've got a fairly expansive Italian menu, but I've never been able to pass up the pizza.  You can smell it as you walk by.  Two slices (they're huge) will send you happily into a food coma.", "author": "Colin C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-20", "description": "Just stopped at this pizza place because the restaurant I wanted to go to was closed for rennovations until 4 pm. They have a lunch special, 2 slice and a 16 oz. soft drink for 3.25. The service was really fast but the pizza was really disappointing..it wasn't really cheesy and the sauce lying underneath had this unsatisfying tangy taste that probably  is due to the no frills can from which it came. For the price its worth it if you have NEVER experienced real pizza and consider pizza hut to be finest of  Italian cuisine", "author": "Samantha S."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Angelica Pizzeria \u0026 Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Nevins St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/2OE-W-NevRB6Gt15v0be3Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188522728"}