{"aggregateRating": {"reviewCount": 69, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-20", "description": "I was eating my bagel here when I felt something tickle my arm and I instinctively swatted in that area. It was a cockroach. I left my bagel, and walked out.  It says something about how brazen their roaches are to even emerge during the day. Needless to say I'll never eat here again.", "author": "Mike L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-12", "description": "good place to order chopped salads from . you can add lots of toppings for a healthy and  delicious lunch option. delivery is quick although they sometimes forget items or give you something wrong. if you call they always fix it. good choice for delivery / lunch  although I have only tried salads. ask for dressing on the side.", "author": "Nicole K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-18", "description": "I come here for my salads.  The people here are awesome.  They remember me and always start up a conversation.   The salad bar is wonderful.  A lot of fresh choices. Fun desserts too.  I think it is a little pricy and in fact had to cut down after looking at my monthly expenses.  To give you an idea coffee and salad would cost me close to 15 dollars.", "author": "Noam P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-21", "description": "$4.40 for bacon egg \u0026cheese! For that price I'm expecting a real good sandwhich. It wasnt that good and to top it off the cooks are rude. I would definately skip this place.", "author": "Chichi P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-02", "description": "SCAM! The signs at the door as well as the counter says with any breakfast special you can get a small coffee for $0.85. However, I was charged $1.49.  When I asked the cashier, she said \"we no longer have that\" and refused refund.  The signs are still there!!! SCAM!!!", "author": "Chemistry S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-09", "description": "The food is nothing special - but especially over priced\n\nMy soup was salty\n\nMy sandwich was frozen\n\nHad no place to sit inside so took it to go.\n\nThe lines always seem long for some reason - even though i never went during lunch time.\n\nIf you just a bite of food to go then this is the place.", "author": "Michael J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-05", "description": "Don't buy salads here! All the good salad places (like Devin \u0026 Blake) use a big metal bowl and put the final salad in the plastic bowl at the end. At Cafe Metro they put the salad in the plastic bowl as you are ordering, and they don't push your salad down. They don't add very much of the ingredients you order in the first place, but worse is that the more you order the less they add (since they don't push the salad down or use a large metal bowl). I've been here a few times. By the time my salad was chopped, the bowl was maybe half filled (probably less), yet my salad cost around $13 or $14...if you do order the salad make sure to get the small. If you order the large you are only paying for extra lettuce. In this area, Devin and Blake or Tip Pio are way better! They use fresh ingredients (which Cafe Metro does too-the only good thing) and don't rip you off!", "author": "David B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-28", "description": "I love this place! The build-your-own salad is great and fresh. The paninis are excellent and the coffee is delicious. There are plenty of options for customers who are dieting. Only problems: this place is MAJORLY expensive for deli style food and seating is hard. If you can find somewhere to sit outside you're very lucky. \n\nOverall, I like this place a lot and walk there regularly (even though it isn't very close to my office).", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-06", "description": "I actually don't mind the food here and have been buying lunch from this place for a while since I work in the area. I use their website to place my order for pick up which they encourage and offer a discount. Today I went to order my salad online only to find their website down so I called in instead to place my order and got this very rude person on the phone who provided TERRIBLE customer service. She told me that the website is down and everything is full priced. I asked to use the discount since I would prefer to order online if I had that option and that its not my fault their site is not working and she gave me attitude saying its not their fault either and that its too bad but it is what it is. WOW!!! Really?!? That's how you treat a regular customer? Very turned off by this place now. RUDE!!!", "author": "Anna L."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Cafe Metro", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "15 Metrotech Ctr", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/G4Bi-7loO6kjVzcLSpyGcQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182374800"}