{"aggregateRating": {"reviewCount": 69, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "My go to spot for lunch in the work neighborhood. Finely chopped fresh salads and a good assortment of soups and sandwiches. Kale chicken Caesar is a can't miss.", "author": "Gregory T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-09", "description": "Adding an update to comment on their latest sandwich idea; the Cafe Metro version of the traditional New England lobster roll. Its not bad. Lobster-rolls in general are becoming the latest craze / fad which low-tier eateries are adopting to make themselves seem more upscale. \n\nThe problem is, you just cant trust 'their version' once its mechanized and stamped with the franchise/corporate methodology. You dont know what additives or fillers are going into their coy, unassuming, 'lobster salad'. You dont know whats really lurking under that innocent-appearing mixture!\n\nAnd thats true of the Cafe Metro lobster roll. You dont find chunks of fresh lobster meat in a simple coating of mayo. Its a lobster salad; which came out of some vat--and god only knows whats in it. \n\nThat being said, it is a novel treat; a nice change of pace to eat something which tastes somewhat like lobster, on a busy workday, in a busy work week; in a busy work season when the last time you tasted actual lobster is a distant memory.\n\nThe filling is properly salad-like; there' s pungent lobster-like flavor (enough to make the claim of 'lobster roll') and its got a few sprigs of cilantro and the inside of the roll is given a dab of mayonnaise.  Its okay.", "author": "Jorge G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-30", "description": "I started coming to cafe metro when I stared working on the Metrotech area about 4 years ago and since then it has been my favorite for salads. I recommended to all my co-workers and friends. I just loved their make you own salad because I could choose all the items that I like and they were really generous with their portion size. However, since a few months ago I noticed that they salad portions were much smaller than before. They raised the prices (a few times) and even though the salad container is the same size the salad content were much less in both veggies and extra ingredients. I started to reduce my visit from 1-3 a week to 1-2 per month. With so many choices in the area (just salad, hale and hearty, au bon pain, chipotle, ect.) and after today purchased I don't think I will be going back at all. $10+ for a half salad is just simply wrong. I'm so upset that I lost my fave salad place that I bragged so much about.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-09", "description": "Lines are crazy! Especially in the summer. Arrive at 11:45AM if you want to avoid crazy long lines. Would suggest a process improvement to manage the lines.", "author": "S B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-30", "description": "Like the food, bought a few salads and today I bought a burger. A bit over priced but hey everything downtown Brooklyn is over priced.", "author": "Ronnel L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-23", "description": "I don't get all the bad reviews here :/ the food is great and the soup is my favorite. When I used to work in Metro Tech I pretty much ate here for lunch every single day. I wouldn't know it was there otherwise, I discovered a whole new world here now when I came back to get my soup fix. The prices are above average for a deli, but the food is really good too. I like that I can customize my salads and they know how to get the lines out of here quickly. It gets insane at lunch time but at least you won't waste your break in line.", "author": "Kim O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-22", "description": "Food was great, convenience is awesome (right beside my building) and quick service.\n\nCan't ask for much more.", "author": "AJ D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-14", "description": "I have found where all the young business professionals come to eat lunch in downtown Brooklyn!\n\nVery nice environment, I only wish I ever got here early enough to get an outside table. This place is always extremely crowded but the lines do go quickly. \n\nCame yesterday and got a salad where you get to pick what ingredients you want added to it. You pick a bowl of lettuce and then you get to fill it with a choice of ingredients from columns (1 from list A, 2 from list B, and unlimited from list C). My gripe. I wanted like 5 from list B and nothing from List C. \n\nIt was OK but not sure i would really come back again. really overpriced for just a lunch salad.", "author": "Arielle S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-31", "description": "Unless you work within the Metrotech area, avoid this place like the plague.  I've had the pleasure of being short-changed twice now (most likely by the same cashier).  For soups, salads and sandwiches, Hale and Hearty is just a few blocks away.", "author": "James L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-03", "description": "Normal cafe place. Not as good as abp. The chef salad there is good tho.", "author": "Big B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-17", "description": "Works in a pinch - not like there are many close \u0026 quick options in the MetroTech. The two stars stem from the frozen vegetarian sandwiches and the scowling cashiers.", "author": "Sessa G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-20", "description": "The gold standard by which all other Cafe Metros should be judged is the location near Grand Central, which once sustained me for an entire summer internship.  That said, this location does not come close to matching Grand Central's breadth of choices and the food comes out tasting just a bit worse.  However, what Cafe Metro lacks in options/taste it makes up in service.  If you come in around lunch time the restaurant will look overwhelmingly busy, but if you have the patience to stick around you will notice that the lines for ordering actually move pretty quickly.  In addition, once you've rceived your food make sure to look around to all 3 registers (yes...there are 3) before deciding where to pay.  The store allows you to pay for your meal at any register of your choosing and because of its in the back almost no one ever goes to the back register, so if you go there you can be in and out in under 10 minutes, which is a luxury in the MetroTech area come lunch.\n\nOne last thing I will add is that the layout/line for pre-made sandwiches and custom sandwiches is a complete failure.  No one ever knows what side they are truly on and it just gets frustrating for the workers and far too confusing for the customers.", "author": "Fabian M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-27", "description": "Prices are a bit high, but the soups and sandwiches are pretty good. \n\nWhy does eating healthy have to be so expensive? :-(", "author": "Clyde N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-30", "description": "This place has so-so sandwiches priced at a slight premium.  It's a safe bet for the Metrotech area which severely lacks good dining establishments.\n\n***", "author": "Minh L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-21", "description": "Good place to grab quick bites. Breakfast is great, lunch gets real crowded. but Their salad selection is great. Dont like the quality of meat there, but overall good selection.", "author": "Pluto G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-22", "description": "Average, good in a  pinch.  Ordered a bagel and a hot chocolate on the day I moved into my apartment. It did the J-O-B.", "author": "Monique H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-08", "description": "When in a pinch Cafe Metro is the place to go.\n\nThis is a chain of \"delis\" around town so nothing too special.  I have been here a couple of times only because I did not or could not think of any other place.\n\nSince there sandwiches are prepared for the most part I would recommend that you ask them to heat even some of the \"cold\" sandwiches because I know of instances were the sandwiches develop ice qualities.\n\nIt is Ok.\n\nDecor wise; the bar seating around the windows is nice to watch the bustling people of MetroTech.", "author": "Carlos S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-29", "description": "I find during the week this place is wonderful. I do not care for the Saturday and Sunday cook. I find he is polite and charming for Latin customers, he tries to be speedy and efficient for the Caucasian customers. He is hardly adequate to African American customers. I'm going to have to find a different place to frequent on the weekends.", "author": "Kc B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-26", "description": "I don't understand all the hate. I get a consistently good salad for 7.99 (not including tax), I get to choose a main protein, two additional proteins and six additional toppings and everything is fresh - the same which can't be said for their competition Le Bon Pain diagonally across from them (same price, less items, not always fresh). The guys who assemble the salads are friendly and fast. I have also bought some of their breakfast items - the bacon and egg sandwich on a roll is so good! There is a scarcity of good lunch and breakfast places around, and this one is a gem.", "author": "Foodie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-24", "description": "Good food?.. But I hate how the managers and the company slaves their employees...", "author": "Benny B."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Cafe Metro", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "15 Metrotech Ctr", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/G4Bi-7loO6kjVzcLSpyGcQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182374800"}