{"aggregateRating": {"reviewCount": 69, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-03", "description": "I like Cafe Metro. It's not going to rock your socks off anytime soon, but I definitely think it deserves more than the 1 and 2 star reviews all over this page. It's always been one of my favorite spots for a quality salad or bowl in the Metrotech area.\n\nMaybe it's slightly pricey for lunch, but it definitely depends on what you get. I definitely don't think a $10 salad is unreasonable or even expensive for New York. The staff has never been anything but quick and kind to me every time I order (which is a lot).\n\nThey have various stations, from a salad bar to sandwiches to hot entrees. It gets super busy during lunch, but there are multiple registers to get you in and out as quickly as possible.\n\nI have Mealpal, and so I frequent Cafe Metro through the service on almost a weekly basis. The portion sizes are always great, the ingredients are fresh, and I never have to wait for my meal (even with insane lunchtime crowds). I've tried the steak salad, BBQ chicken salad, quinoa tango bowl, and Athens bowl, and have never had a complaint.\n\nAnyways, Cafe Metro is just fine.", "author": "Marina S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-06", "description": "Cafe metro is bustling and busy all morning, but I'm not sure if it's the quality or the incredibly convenient location.\n\nI ordered oatmeal, and it was pretty standard. The main issue I had was that it was quite pricey for how little I got, and the treatment from the staff.\n\nIt was busy, so I wasn't expecting perfect treatment, but it'd be good if they were nicer. I suspect that Cafe metro just doesn't have enough competition.", "author": "Ke W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-27", "description": "I've been going to this place for years - but no more. I think their food is good but overpriced - the attitude of the staff is really bad. Bad customer service - not worth it.\n\nYesterday, I had a chicken cutlet sandwich on a ciabotta roll. They charged me $10.33.\n\nToday, I ordered the exact same sandwich, same toppings. After having it made, and waiting on line - the cashier told me it was $11.33. A dollar more.  She claimed it was because I ordered it on a \"long roll\".  I had asked for a ciabatta roll and they were out of them - so they put it on the exact same sized roll, only a different shape. The amount of the toppings and chicken were exactly the same, too.\n\nShe asked if I wanted to talk to the manager - I said sure, but clearly this guy was not coming over any time soon - and I was not going to waste my time arguing with everybody in the store, so I just paid their rip-off price.\nI will never go back.", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-14", "description": "I love grabbing salad and breakfast from Cafe Metro. They have so many good varieties in food. They have an amazing bacon egg and cheese sandwich and omelets in which you can create how you'd like.This morning I was so disappointed by the customer service received when I went to get some breakfast the cashier Miriam wasn't friendly at all. She doesn't talk to the customer at all and she expects you to know when you are ready to pay or not. Just stands there staring at you. I think she does a horrible job you should put her in BOH if she doesn't like interacting with the customer or answering their questions if they need help with something.", "author": "Emely E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-11", "description": "Overpriced lunches for mediocre quality food. They have an assortment of salads, pre-made sandwiches, make your own sandwiches, and soups. I decided on the lunch special. $10 for a pre-made sandwich, a bag of chips, and a can of soda. The food was just alright. \n\nOnly bonus is the quick lines. They have registers throughout the store, so we're not limited to everyone waiting on one line.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-29", "description": "Absolutely best chopped salads! Freshest ingredients, wide variety, so many choices of greens and proteins and salad dressings and toppings! They fill it up to the brim and everyone was friendly and happy to help. I would recommend this place to everyone since there is something there for everyone. I had a Santa Fe salad and it comes with chicken, tomatoes, cheese, avocado, corn and I got a mix of kale and arugula. There was also spinach, romaine, other mixed greens! Large variety of soups and sandwiches and fast service.", "author": "Kathleen H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-02", "description": "Over 3 bucks for a large coffee. Guaranteed a 12/13 dollar lunch with any drink. If you have money to spend and are in a rush, go here. Otherwise, go elsewhere.", "author": "M R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-20", "description": "Way over priced for a typical salad. If you want to create your own salad you'll be charged extra for toppings that are off of the recommendations list for making your own salad under $10. Floor was filthy. Staff wasn't friendly at all. I came here a few years and I'm still disappointed. I'll never return here.", "author": "Francesca C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-05", "description": "I haven't been here in a while because I prefer to bring my own breakfast to work. When I was regularly buying my bagels here, they would screw up the order regularly and those of my coworkers.  Well today they did it again. I asked for a bagel with cream cheese, got charged for a bagel with cream cheese, and got to the office ready to enjoy my bagel with cream cheese. But it had butter.  And not much butter either. They were not busy, I was the only bagel customer placing an order at that time in the morning.  More people came in after but I was the only one at the time. For crying out loud please try to care a little about your customers.", "author": "cecilia l."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-25", "description": "The customer service is the WORST, i take out food from this place atleast 2-3 days a week not by choice (i have to bring food back for the bosses)and they have gotten my order wrong so many times its to\nThe point i have to watch them complete my order. when i complain the workers look at me and they start talking about me like I'm the one who ordered wrong. I know its not me since i have over heard people always coming back saying the order is wrong or forgot to\nGet what they ordered but they never forget to charge you for what you didn't get, so thats one thing they are good at charging for stuff you wont get. This  is a small take out place that has one job to get a order correct and they cant even do that right. If you have a choice please save the time and try the other places or if you have time to walk back to work and go back to this place to complete the order they messed up then this is the place for you. The worst part i called the main office and left a message for the Manager George that was 2-3 weeks ago and funny how no one has reached out to me,\nBut the way the service is maybe he will get back to me the same way i get what i ordered. I guess i will get a call back when my order is completed so your guess is as good as mine.", "author": "Lance D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-19", "description": "Against my better judgment, I decided to get a sandwich from this place. Knowing how overpriced and pretty standard their food is here I decided to get a metro steak n cheese sandwich. Upon arrival  i see they do not have what i initially wanted. I chose get a hot roast beef n swiss on a roll instead. I advised the person taking my order of such.. he asked me twice if I want anything on it, i said no, just make it hot. I go to the cashier to pay and my sandwich is there already. I asked the cashier if its hot like I requested, I watch her ask the person who made it, was it hot, he replied yes. Im surprised that the sandwich could be hot that quick.  I took the sandwich back to my work location to eat and not to my surprise... the sandwich was not even luke warm but cold. there wasnt even any attempt to heat it up.   Thanks for reminding me why I stopped patronizing this place a long time ago.", "author": "Lance W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-26", "description": "Usually gets pretty crowded during lunch hours. Fresh out and you get the typical portion. Had the Santa Fe salad which was nice. You can ask them to get your salad chopped and mixed well.", "author": "Abhichandra R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-10", "description": "This is a $11.89 chicken parm, and pesto Panini + Lemon Snapple cost. I'm just a little surprised how small it was for that price. The taste wasn't so heavenly or mouth watering. I wish it was more saucey. Barely had any tomato sauce. I think I'd just rather go to a Diner and guarantee that I'd get a better panini. I expected more from Cafe Metro. Now the environment inside was really nice and clean! The staff were friendly.", "author": "Kathy R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-29", "description": "This place gets my salad order wrong EVERY time.", "author": "Jill M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "I used to not like Cafe Metro at all because I thought it was overpriced, but after going to other restaurants for a salad; I realized Cafe Metro is a lot more cheaper and there's a lot to choose from if your building a customized salad. \n\nSince I've developed a liking for kale - I've been coming here a lot more and all their toppings and salads are fresh. They come in regular or large bowl and even a regular bowl you can get a lot of toppings and be extremely full afterwards!\n\nThe salad line can be out the door at times and slow,  but it all depends what time you go. So glad I gave Cafe Metro another shot!", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-12", "description": "Update: at the time of the incident, I sent them a direct complaint via email and the crazy cashier got fired. However, their food is still disgusting, so I'm keeping this review at 1 star. I have stopped eating there regularly since the incident, but the few times I do I can see nothing much has changed: salads are still mediocre to say the least, completely bland, most ingredients are not fresh at all, and the portions for each topping are tiny. Not to mention that if you order ahead of time, they will ALWAYS get your order wrong. Half of your toppings will be missing, the lid of the food container will be loose and you will spill everything out when taking the food out of the bag, and their hot foods section is gross. Their burgers are burnt. Their soups are average. Everything I have ordered from them has been a complete disaster. I give up on them. Cafe Metro is GARBAGE. Stay away from this hell.", "author": "Jules W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-19", "description": "This place looked decent enough to go into for lunch. I ordered a salad which was pretty expensive ($10) for a fast food place. I was halfway into enjoy my salad when I saw a fly mixed into it with the dressing. Never going back. Felt like throwing up after.", "author": "Lissandra C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-07", "description": "You work or have to be in downtown Brooklyn and you find that the average, non-crappy lunch runs about $13. WTF, you say (believe me, I say it a lot, and not just about lunch)! But all you get is a non-crappy lunch. Nothing special that you couldn't make at home if you would just sit your ass down and do it. \n\nSo among the not-so-special places is Cafe Metro, which I like because they have no minimum delivery cost and no fee, and they really serve a variety of soups, sandwiches, and other breakfast and lunch offers. What's odd, however, is that their delivery tends to be better than ordering in the store: I've been standing RIGHT THERE a few times when staff screwed up an order, vs. every time I've ordered online, the delivery is accurate and fast. \n\nThey have better burgers than Five Guys and better sandwiches than Au Bon Pain. That they also have no minimum delivery order (I know, I know, second time I'm mentioning it) is what makes this place better than the other average joints, and they're quick.", "author": "Hopala C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-06", "description": "I've come here twice for lunch when I'm in town for business. I wish I had one in San Diego! Love going places that have healthy options! Both times I've made my own salad- super affordable as well only $8.99 for a very decent size! They have lots of fresh ingredients to choose from- I normally roll with the kale base and then add broccoli, brussel sprouts, squash carrots and corn. (And some avocado!). They have all different types of meat to choose from as well as tofu for a vegetarian option. Then they chop all the ingredients and mix in your dressing of choice to create one extremely healthy and delicious salad! Health and taste bud approved! Perfect for when you're in a rush but want to mindful about what's on your plate!", "author": "Elisa H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-07", "description": "Consistently disappointing. \n\nI have gone to cafe metro quite a few times. It's close to work and that's about all it has going for it. Breakfast is Ok. There salads are pretty terrible. If you must purchase one go for the regular sized. They will charge you for a large and it is always 3/4 of the way full. I have complained online to management and they just tell me to show the manager to get a free salad. Not a process I really dig, considering I will have to go back there again. I would rather have it been a coupon. It's not big deal though. They will not be getting my business anytime soon. Especially because the cashiers are constantly rude and treat customers literally like cattle. There are too many options in this area to waste your time and money here.", "author": "Kevin S."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Cafe Metro", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "15 Metrotech Ctr", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/G4Bi-7loO6kjVzcLSpyGcQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182374800"}