{"aggregateRating": {"reviewCount": 69, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-02", "description": "food was great, but wow rude employee looks at me and says \"what do you want\" seriously never have i been to a place and felt so disrespected.! not my problem if he may be unhappy with his job or had a bad day but he made me feel real uncomfortable. never will i come to this location again, dont care if the food was great because i will not accept anyone being rude to me again. we are from the la area and to experience this was very dissapointing.", "author": "Samantha P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-07", "description": "The prices in this place are high (as most of the reviews have suggested) but the selection is vast.  And I've learned that most things in this area are over priced.  Either deal with it or bring your lunch from home.\n\nI particularly like their sandwich selection.  They have an array of combinations that I would've never thought to try together.\n\nStaff is friendly and attentive.\n\nOverall Rating: B", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-30", "description": "Located at 15 Metrotech Centre, Cafe Metro is a popular option for the office crowd working in Metrotech area. It offers online order, and has options of daily lunch specials. There is seating space inside. And you can enjoy the sun outside as well.\nNow to the food: both sandwiches and salads are poor in taste. They'll put lots of avocado on a dish to make it look like a healthy option and will charge you good money for that, but the food is nowhere near to be called delicious.", "author": "Vivek M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-06", "description": "When I am on lunch break (and I'm only allowed 30 mins sadly) I don't have the time to wait in line or deal with food being made from scratch. This is the place I go to during that lunch hour rush. I am in and out instantly (except for the check-out line). I usually pick a pre-made sandwich which they pre heat for me and never had a complaint. While waiting for the sandwich, I get soup usually Turkey Chili. Still trying to get my hands on the New England Clam Chowder which they keep running out by the time I get there. After all set and done, I get 20 min to myself before I'm back in front of a computer screen.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "This is the best spot for breakfast in the area.  They are fast, friendly, decently priced considering the surroundings and have a huge selection for breakfast and lunch.\n\nThe selections for a customized salad are countless, they have plenty of pre-made sandwiches or you build your own.  As long as I am working in this complex I'll never go anywhere else for breakfast.  (Unless for some reason they aren't open).", "author": "Johnny F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-11", "description": "Easy walk from the dazzler, quick, hearty breakfast, getting more than you usually would from any other chain.", "author": "Christopher B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-12", "description": "I have gotten a quick breakfast here (the cafe is in the ground floor of my office building) as well as many a lunch. This review is mostly on soup/salads - I have yet to try their hot lunch.\n\nThe soup is $5-6 for a medium depending on if you go \"premium\" or not... quite expensive for the quality. I do appreciate that most are lower in sodium than other to-go soups and that they post if there is dairy and if a soup is vegetarian or not. \n\nThe salads are made in front of you - the lines are amazingly long at the rush hour, so go around 12pm or 2pm to avoid waiting 30 minutes for your salad to be made. Also - I recommend getting dressing on the side, as when the guys squirt in your dressing, sometimes they overdo it... \n\nOverall - pricey for a quick bite but I frequent it because it saves me from going out in -3 degree weather!", "author": "Heather H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-11", "description": "About a year ago I would have given Cafe Metro 5 starts for the quality of food, price and service however things have changed a lot since then. I have been getting a salad for lunch at Cafe Metro for about 4 years now and today you get half of what you use to get in terms of salad ingredients plus the price just keeps increasing. If their new trend is less food for money money then its clearly no longer worth more than 2 starts in my eyes. \n\nP.S: I was there today and they added .50cents to my salad claiming there was an extra ingredient, funny thing is I have been ordering the exact same salad for the last 4 years.", "author": "Jewly D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-14", "description": "Cafe Ripoff isn't that bad.\n\nThe area needs a couple more cafes so this is as good as it gets right now.\nThe food is okay but the prices are insanely too high. I suggest you keep an eye on your receipts because prices tend to fluctuate from day to day.\n\n*cash and credit*", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-03", "description": "This is a good option to have around the Metrotech area for a quick lunch. They are slightly overpriced but the place seems clean and the food is decent.\n\nI have tried their sandwiches,their burgers,their salads and a few of the soups and though none of them were spectacular,they were tasty enough and did serve their purpose of satisfying my hunger. I especially like the option of a soup and half sandwich combo.\n\nThe portion sizes seem a little small for the price.The service is quick and to the point.I can see myself coming here a lot this winter,mostly because this is one of the closest spots to my work that serves up a varied menu of hot soups and sandwiches.", "author": "Aparna K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-06", "description": "The food is not amazing, but it's a good for a healthy lunch. You can order what you want online and then pick it up at the time you designated so you don't have to wait on the line to order food when the lunch rush begins.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-21", "description": "Update! No more Fox News. The owner is friendly too.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-17", "description": "I love getting my overpriced salads here! (Please note the sarcasm). But, I come here because it's conveniently located next to my apartment, and there's very little F\u0026B outlets available in the area.\n\nA large salad is roughly about $10. A small salad is about $9. But, a value card will knock-off 10% during lunch hours from 12-3pm on the weekdays. I get my usual small spinach steak and avocado salad, along with other toppings. They have a variety of toppings for your salad, and I wish they allowed maybe 3 premium items, rather than 2. If you'd like to add one more premium item, then it's an extra $1 (that's pricey for less than a handful of egg whites or less than a handful of candied walnuts).\n\nOnce you pick your toppings, then you can have your salad either chopped (no cost for chopping) or just tossed. It's sometimes unbearable to see chunks of steak and pieces of my avocado tossed-out of the salad during the mixing process. And, sometimes if they see items accidentally tossed-out, they'll pick it up from the counter and throw it back into the mixing bowl. Lovely. Oh, and sometimes I'll see random items of cucumber and apple pieces mixed into the salad, even though I don't remember asking for any. \n\nWhat really irritates me is that SOME of the workers are so lazy. Some are lazy, but not all. I'll sometimes request for a topping, that I KNOW they have (even though it's not displayed). Instead, it's either hiding in the fridge underneath the salad bar, or they get it from the back kitchen. One time, I asked for beets because it wasn't out in the bar. The guy making my salad said he'd get it from the back for me. He went from the salad bar to mixing the salad. He handed me the salad, and I asked him about the beets, and he said he was out of beets. How are you out of beets? You didn't even look in the fridge, and you didn't check in the back kitchen. \n\nCome on, now. This is like an open kitchen at a restaurant. I'll know if you're spitting in my food, or if you're picking your nose in front of my food. I can clearly see you're lying to me.", "author": "James W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-19", "description": "I get a salad here for lunch which I love,  I get the Chipotle dressing,  the lines are usually fast.", "author": "Mick E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-28", "description": "Cafe Metro is a decent priced spot to get some good food in a good location smack in the middle of Metrotech. This place has some competition with other great spots such as Panera bread, Starbucks, and other good spots in the area. The staff was ok, not overly excited to be there but cordial at least. The food was better than I expected and I'm sure I will return again for breakfast or lunch.", "author": "Tony C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-03", "description": "I got 2 slices of plain cheese pizza and it was very good! I think each slice is abt $2.50 and it might be bit on the expensive side but I liked it. \n\nThere is plenty of room to sit and eat and more food/eatery in the cafe", "author": "Stanley S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-18", "description": "I stopped by here for breakfast and was really happy with what I got. I had an omelette made with home fires and toast and it was all really delicious and way too much food. I was really happy about the prices of the food as well since these items can sometimes be on the pricey side. I would definitely go back and try this place for lunch because they had some re made sandwiches out that looked really yummy. Definitely a spot I would check out again.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-14", "description": "Went here for breakfast and ordered two eggs over easy with home fries and toast.  Decent meal with no surprises.  The restaurant does appear to ration items like napkins and butter, which are obtainable at the register.  They featured both indoor and outdoor dining areas.", "author": "Robin C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-22", "description": "Holy dollar signs batman this place is outrageously OVERPRICED. Popped in here for a healthy lunch while at jury duty today. I expected to spend about $8 for food and was a tad shocked when the cashier handed me 50 cents back from my $10 bill. Eeps! \n\n1/2 a sandwich, soup and a water should not cost $9.50, especially in Brooklyn. I get that Metro Tech Center is all \"fancy smancy\" and such but my goodness we're still in a recession!\n\n3 stars for the food, 2 stars for the price and chaotic disorganized lines. Why is eating well so expensive?", "author": "Valerie V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-24", "description": "Quick and friendly service.  Even during the busy times, you can get in and out of this place in no more than 5 minutes.  Good for breakfast and lunch.", "author": "Stuart B."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Cafe Metro", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "15 Metrotech Ctr", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/G4Bi-7loO6kjVzcLSpyGcQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182374800"}