{"aggregateRating": {"reviewCount": 3, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-25", "description": "I can only review the falafel\nExcellent sandwich for $5\nAlways fresh and friendly\nAs the pictures show you it is a food cart\nGyros hamburgers rice etc are available for sale", "author": "Jonathan R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-10", "description": "DUMBO is such a mecca for interesting and unique food carts \u0026 food trucks, but I was in a hurry this day and didn't have time to scout around for other quick lunch solutions... so, it was street meet for me! On this visit, I ordered the chicken over rice, which was typical--grilled mushy chicken pieces served over yellow saffron rice with a salad. The flavor of the food was fine, but the portion size was a little small compared to other Halal carts I've visited. Lesson Learned: If you're in DUMBO, don't pursue Halal... pursue something a little more unique... b/c it's available if you've got the time to peruse Front Street, Pearl Street, and some of the other side streets nearby.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-23", "description": "Same two guys. But they tweaked the recipe. I finally ordered my usual lamb and rice from them again after a long hiatus. Frankly, I wasn't planning on eating their food again, but fate intervened today. \n\nSo... 4 stars. Cheap ( though they raised prices by $1) and now not bad at all. Worthy of a spot on my lunch rotation on days when I'm feeling poor.", "author": "Ming O."}], "servesCuisine": "American (New)", "priceRange": "Under $10", "name": "Dumbo Grillo", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "58 Pearl St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/tIeVLnW8-khcrES51dIpDg/ls.jpg", "@type": "Restaurant", "telephone": ""}