{"aggregateRating": {"reviewCount": 18, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "I think this place is fantastic - having been to Turkey numerous times I can credibly say this is very authentic Turkish food. I am a huge fan of the chicken doner (like a gyro but with chicken), very flavorful, perfectly seasoned and has a bit of those delicious browned crispy bits. I prefer the platter / with rice option (and the rice is really great too) - the costs are a little on the high side but the portions are ample so definitely take that into consideration.\n\nAlso, the Shepards Salad, Eggplant and Muhamara is super delish. Make sure you order lots of sides (mezzes) as well since they really make it a Turkish feast!", "author": "Vanessa P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-18", "description": "I asked for 2 orders of just plain falafel. I double checked with them that they were not charging me for the actual entree which came with salad and bread and hummus and was more expensive. I just wanted a plain order of falafel. They assured me they weren't and charged me $22 for 10 minuscule balls of falafel that came soaked in a tub of hummus and tahini, with salad and bread--a veritable entree that I neither wanted nor had ordered. In fact, it was what I had explicitly not asked for. \n\nDo not go here, they take forever, overcharge, and overdress the food. You can find much better Middle Eastern/Turkish/Mediterranean food in Brooklyn, especially somewhere that will actually listen to its customers.", "author": "Sadie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "Great addition to the neighborhood...yummy food and quick service.  Located steps away from Atlantic across from Trader Joes", "author": "Stephen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-13", "description": "Among a number of good Middle Eastern restaurants on Atlantic Ave, this is a Turkish fast-casual and take-out place.  Food is on par quality-wise with the other Turkish restaurants in the area, but quicker. A great option when on the go. I particularly liked their kebabs. Very reasonably priced.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-17", "description": "It pains me to give this review as I like them for a quick drop in meal but ordering in tonight was a disaster. Place was 20 minutes late and they delivered the wrong food. When we called them to resolve there was a serious communications barrier and they did not seem to understand anything we said. \n\nAnyway, there are way too many good ME places in a 5 block radius to run service like this, especially one that bills itself as a quick delivery option.", "author": "Gia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "I just went there today and I loved this place. Vibe is good, waitstaff is friendly and nice, and last but not least portions are good for the price! \nI got the lamb gyro wrap. When I saw it was 8$ I was happy, but when I saw how much meat they put in there, I was happier. It did not disappoint my expectations.\nIf you are hanging out or shopping by the area, pay them a visit.", "author": "Melo L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-29", "description": "My wife and I were visiting from Arizona and wanted something unique and local to the area. This place was exactly what we were looking for. It's small and has a welcoming presence. As soon as we walked in we were greeted by the associates at the counter as well as the chef! He asked if it was our first time, we responded Yes and he explained the menu and made recommendations based on what we said we liked. He was extremely kind and went out of his way to make our experience a good one. The food was exactly how I remember when I had my first experience with Turkish cuisine while visiting Germany. If you're in the area, check it out, you wont be disappointed. The food was delicious and the service was even better!!", "author": "Doug H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-11", "description": "Ordered here for the first time because it was 25% off on seamless. We got the dip sampler appetizer, falafel, and the lamb adana kebab. \n\nI was impressed with the delivery time. The food arrived 25 minutes after ordering. \n\nThe appetizer sampler was good. I love my condiments. The baba was very smoky and good. The muhammara wasn't as good as other places, but was still tasty. The hummus was a big gritty for my taste and could have used more tahini. \n\nThe falafel were tasty and came with a salad, humus and tahini. They were cold by the time we got them, but I could tell they would be great if they were hot. \n\nThe lamb kebab was the winner of the meal. It was very lamb-y and the rice was flavorful. \n\nWould definitely order from there again.", "author": "Brian F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-11", "description": "After the Friday night movie, I wanted something different. Gyros are my favorite but I ordered the Falafel Hot Appetizer to stay. The Waiter brought my food in a to go container, pita bread in a brown paper bag.  The falafel was good, hummus was limited and Tahini sauce was not enough to mention or notice.", "author": "Juices2240 S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-02", "description": "In a neighborhood where Middle Eastern places are a dime a dozen, we rolled our eyes when this opened.  But we really like this place.  The food is very good.  It's not terribly adventurous compared to some other Middle Eastern menus, but everything we've had is very good.  I do find it maybe 20 pct too pricey, but it hasn't stopped us from making it part of our rotation.", "author": "David W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "Ordered delivery for the first time and was really impressed. I've tried a bunch of Mediterranean places in the neighborhood and this is my favorite!", "author": "Allison H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-04", "description": "This unassuming little shop on a busy corner on Court Street is serving up fresh, delicious gyros and kebabs platters for bargain prices. A gem of a spot for a quick nourishing lunch. Chicken gyro is crisp and savory. Perfectly seasoned and stuffed with fresh vegetables and served on fresh pita.", "author": "Adam B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "Yum yum yum!  I am vegan and this place has a lot of tasty vegan options, all clearly labeled on the menu which is so appreciated.  I ordered the quinoa wrap and sides of hummus and muhammara.  The quinoa wrap is *huge* - very filling and loaded with quinoa, hummus, tomato, pickles, cucumber, and other fresh veggies.  The hummus is so creamy and mild - it almost has a light whipped texture compared to most other hummus.  The muhammara is amaaaaazing!  The best combo of savory, spicy, and sweet.  I ordered delivery on GrubHub during peak lunch time and they delivered perfectly on time! I will absolutely order again.  My one criticism is that two small pieces of hard bread were included with the hummus and muhammara - please consider including pita instead!  The small pieces of bread were no way enough for those generous tubs of dip.", "author": "Erin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "Very tasty Turkish food, they have good section of kebabs and nice decoration:). This location is their second location and both of them has tasty foods.", "author": "Ismail Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-04", "description": "The Lamb Kabob was great. The large portion was HUGE. Rice was tasty as well.\n\nNote to management though: the serving sizes for your sauces are really really small. We got one teeny tiny sauce cup with our giant kabob dish. If you're ordering to go, ask for 5-10 sauce cups (I'm not exaggerating, the cups are THAT small)", "author": "Jordan O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-05", "description": "Walked in craving a gyro anf got a delicious lamb gyro wrap and the wife got a kofta wrap. Both were absolutely perfect. Not too much meat, not oily, veggies were crisp and the wrap itself was well cooked and light and tasty.", "author": "Frankie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-26", "description": "Two visits to Sumela confirmed that this is a great place to eat.  Unassuming, easygoing staff.  Delicious food.  We loved the falafel dinner plate ($14), the voluminous white bean salad ($10), the tasty red lentil soup ($6), and especially the eggplant salad ($6) - which comes in a heaping container and is delicious with the warm Turkish bread.  This is different, and we found more tasty than babaganoush. The generous portions gave us enough for a full meal for two of us and with a doggie bag enough for another full meal. This food would work well catered.  They have a sit down restaurant on the Upper East Side.", "author": "Jay C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-16", "description": "Really good falafel sandwich and the French fries are great! My wife had the lamb gyro kebab and also really liked it. The place is clean and well lit and the food came quickly. Large portions.", "author": "Kenny P."}], "servesCuisine": "Turkish", "priceRange": "Under $10", "name": "Sumela To Go", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "145 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/V8j1CqTbSQ9WzSvIlR-ozg/ls.jpg", "@type": "Restaurant", "telephone": "+17188555050"}