{"aggregateRating": {"reviewCount": 49, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-19", "description": "It's really a diner more than a bistro (it even says so on the check you get at the end of the meal...), but it's in our neighborhood, and you can go down for brunch, lunch, dinner, or just a cup of coffee. Or a glass of wine, later in the day (then again, it's five o'clock somewhere in the world, right now!). Not as much of a destination as places in nearby DUMBO or Brooklyn Heights, but a welcome oasis in the City Tech area.", "author": "Massimo P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-17", "description": "Wasn't the best, wasn't the worst. My friend and I were walking back from the Brooklyn Bridge and this was one of the few nearby places to grab a bite. What reeled us in was the vegan options, but what will keep us away was the service and the prices.\n\nOur waiter was friendly and did his job, but was slow to come take our order. Seating options are pretty limited. Four to five high tops, several booths and a few tables, plus seats along the window with a small table as your actual table. They were short staffed and the food wasn't all that impressive with how much we paid for it.\n\nI got a burger that had delicious bacon and thick slices, well actually just one thick tomato, but the fries were average and they don't have many special sauces which always makes me sad. The bun was pretty good and fluffy, but I asked for well done and got borderline pink. My friend got a quinoa bowl that was filled to the brim of the bowl, it was light and refreshing and wasn't drenched in dressing.   \n\nAfter the end of our visit I was sad we chose this place, I'm only here in NYC for a few days and if I could choose something else I would have. Lesson learned, take a hint from mine.", "author": "Amber P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-27", "description": "This place was seriously awful. I don't even know where to begin.\nFirst, it takes 10min to get seated, and they seat us at the high tables only to forget about us, again. Another 20min passes by....\nI asked to be reseated in an actual booth, hoping that will put us on someone's radar.\nThen, we get a server who is literally confused about life. Everything we said was followed by \"what?\"; or he'd look at us like we were speaking words he'd never ever heard of before, like, \"coffee\" or \"fries\".\nIt takes 30min to get a basic Kale salad served to us, and when it does it comes without a fork. This is basic shit, guys. C'MON!", "author": "Sara A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-30", "description": "Not only was this place  extremely overpriced, but the wait staff was unnecessarily rude and unfriendly. I paid $14 for a kale Caesar salad that was small in portion and rather bland.  I was also charged $4 for a coke. Overall, I am disappointed and unsatisfied with my experience here.", "author": "Jennifer A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-08", "description": "I haven't waited this long for anything since Space Mountain.\n\nThe service was surely lacking this AM, but the food was ok until I noticed the pool of oil my egg white omelette was basking in.  Probably a must-miss", "author": "Brett B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-30", "description": "Kind of pissed right now.. my friend had to use the restroom REALLY BADLY after walking the Brooklyn bridge, so we ran to the nearest restaurant possible. This place was completely empty, and we decided to order a drink so that my friend could use the restroom. When we ordered a Coke we said that's all we would like to get, and he looked at us weirdly and said \"you're going to order food also... right?\". We were basically forced to order a salad and when we paid he gave himself an 18% gratuity fee. There was literally two other guys in the restaurant that were only drinking beer and they weren't being bothered to order at all. THENNN another group of girls walked in and only bought a water bottle, and they weren't forced to give gratuity and used the restrooms as well then left. When we left the restaurant, they didn't even look at us. Rohan our waiter, check yourself before you wreck yourself. At least you let her pee.", "author": "Kalei A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-06", "description": "Good scenery, very convenient when stopping in before walking the bridge. Place is pretty and has good vibes. But the drinks are a little over priced. Staff was welcoming and very friendly.", "author": "jade g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-25", "description": "I went here for breakfast yesterday and they served the most delightful and tasty pancakes I've ever eaten! The place is aesthetically pleasing with good background music and most importantly good coffee! \n10/10 would recommend!", "author": "Valentine T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-31", "description": "Avoid this restaurant for breakfast as it could be hazardous to your health. The coke was flat.  The bread was stale and the home fries were hard and tasteless.  The parfait was sour might've been bad. I generally don't complain about food and I was hungry but this is basic stuff.", "author": "Hector M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-27", "description": "EXTREMELY horrible customer service and unnecessary policies on bathroom and card use. It was an unfriendly and uncomfortable environment (there was probably no air conditioner at all). Extremely overpriced food that is mediocre and pointless. Don't eat there. If I could give it 0 stars I would. 0/10", "author": "Sierra L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-25", "description": "Terrible, unfriendly service. We won't be returning. We came in and ordered a coffee and then they tried to stop me from using the restroom. I get that they don't won't non-customers using the bathroom (which I generally disagree with as a policy), but being rude like that is uncalled for. And ... I was a customer.", "author": "Matt S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-21", "description": "What a nice place!  We were hoping to make it in for breakfast, but we just missed the cut off time and had lunch instead.  I ordered the mac n cheese and buffalo wings.  Both were really good.  The mac n cheese was really saucy, which was nice, but could have used some more seasoning.  The dressing that came with the wings was a little vinegary, but the wings themselves were good.  I was able to try the margarita pizza, artichoke dip, and grits.  The grits were rich and creamy and although the crust on the pizza was a little doughy, it had good flavor.  The artichoke dip was REALLY good.  It was a hit with the group for sure.  \n\nThe staff was really nice and welcoming.", "author": "Stacie W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-16", "description": "I went to this place on a whim, after walking the Brooklyn Bridge. It's very close and convenient, hence why I went here. We were able to get a table right away. The inside of the restaurant was very quaint and it was a very nice and calm vibe. \n\nWe decided to go with just appetizers, which included honey bbq wings, Mac and three cheese and Parmesan truffle fries. The food overall was really good, especially the Parmesan fries. \n\nI'd watch out if you decide to get soda here- we got two cokes and it turned out to be 8 dollars, which we thought was a bit absurd, even for NY. \n\nWe didn't get the greatest service. Our server didn't check on us a lot and we were constantly out of water with our waiter nowhere in sight. It was also unclear who our server was, as different people got us drinks/took food orders/ etc. \n\nLast but not least, we had seen on the menu that if you have a party of 6, you automatically have 20% tip added to your bill. This totally makes sense, as most restaurants do this. However, as a party of 2, we were surprised with having gratuity added to our bill. They added an 18% tip to our bill right off the bat which we were not so pleased about since we didn't have great service to begin with. When signing for the bill, they also have another line for gratuity, so I'd make sure to look out for that! \n\nBottom line: food was good, service was not.", "author": "Alicia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-16", "description": "Second time in New York, and my friends and I were walking to the Brooklyn Bridge and we stumbled upon this place. I ordered the vegetarian burger and fries which also came with a small side salad. The food was okay, not some place I would intentionally stop by because the food is kind of bland. The veggie burger didn't have much taste and the fries were not special. Although the restaurant has a nice aura the the waiters are kind, but ehhhh it's still just okay.", "author": "Lia J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-07", "description": "Service was weird! Everyone in here was asleep! The host, the servers, bartender! Sheesh! \nI walked in and told him- the host for one, I wanted to place a to go order... I asked if I could sit at the bar? His response are you drinking or just placing a to go order, i said only a to go order after all it was barely noon.  He proceeded to ask a server if I could sit to the left of the hostess stand she literally just stood there and looked at him, I said she's asleep.... he then asks if i would be interested in sitting to the right of the hostess stand, I said it doesn't matter as I'm placing a to go order, he finally directs me to sit at the bar... wtf dude! \n I'm sitting at the bar and a girl is standing outside of the bar area just across from me starring straight  past my soul.... finally after abt 3 mins she pops up behind the bar to ask how can she help me... I immediately place my order and just wonder \"Am I am extra in the sequel to the movie Get Out\" the energy and the entire staff were so weird man! \n My order finally comes out and it's correct just mad sloppy in the box! \n I ordered the fried chicken sandwich on a pretzel bun! Portions were nice and the food was good but giving this place a second chance is out of the question", "author": "Kris P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-14", "description": "We stopped in here on a chilly weekday afternoon for some wine, coffee and dessert.\nThe place is warm and cozy. It's got a modern, clean, feel, without being sanitized or cold. \nService was top notch! They have good selection of wine, beers and coffee drinks.\nThe desserts we had were excellent and the food \"looked\" super good, but we had already eaten and didn't try it.\nNext time, we're coming back for dinner at this cool little place.", "author": "Charles S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-27", "description": "Great food great service\nReasonable price \nLove to go when I am free\nGood location when you are just off the Brooklyn bridge", "author": "Alex N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-24", "description": "I live in Concord Village and this is the closest place  to eat so I'm in here a decent amount and the food is honestly fantastic, but what is going on with the service?? It's truly terrible. The decor and furniture is completely bizarre, there's basically no vibe, but based on its location I suppose, it survives. Like I said, the food is amazing so I hope they get it together.", "author": "Leigh ann H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-25", "description": "Crowd got away from the staff. Poor service, sat for over an hour and still no food. Sad", "author": "Mike D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Very nice breakfast.\n\nThis is the closest breakfast to the Tillary hotel and on the way to Borough Hall.  So, we would have been happy with less just for the convenience.\n\nStaff was efficient and friendly.  The eggs were good, and when I asked them to butter the toast in the kitchen immediately after it came out of the toaster, they did.", "author": "Dee Dee A."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Brooklyn Bridge Bistro", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "63 Tillary St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/dFI6SHCqLAfotsnxcs1zJA/ls.jpg", "@type": "Restaurant", "telephone": "+17188580007"}