{"aggregateRating": {"reviewCount": 49, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "Foods and drinks were perfectly amazing. The service there was really friendly and nice especially one of the Asian guy who was willing to help me at all cost. I would definitely recommend coming to this place if you're interested in trying new things!", "author": "William Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "Great!! Shahboz and the crew are great, but you gotta check out the Malbec, pizza and the 6Point Resin iipa! Oh,... and the view", "author": "James O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-14", "description": "5.0 star \nAwesome place ! Good staff! Delicious food ! Especially black bean burger with side salad! Atmosphere  in this restaurant is so good as well!! They have unique decoration !!! Love it !!! And waitress  Hana was so cheerful !!!  Thank you for great service )))", "author": "Arthur J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-03", "description": "We walked across the Brooklyn Bridge and were hungry and tired. We stopped in and had lunch at the Brooklyn Bridge Bistro, and what a delight! Service was excellent, creative drinks and creative menu! We loved it.", "author": "Maria K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-01", "description": "Where do I start? Disorganized and bad service to below average food. Even the food came out prety late. Not a place I  would return or recommend to anyone. Left  a bad taste overall.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-22", "description": "If I could give zero stars I would. We sat down and no one came over for 10 minutes. My grandma is disabled and this was the closest place for us to eat. Servers are horrible. Got no refills. All the servers look clueless and not friendly. Ordered a sandwich I wasn't satisfied with and the server refused to let me speak to the manager! The guy told me he could not bring the manager to speak to me. Horrible hospitality. Food portions are small and food is not tasty. Your money and time with go further some where else. Do not waste your time at this place.", "author": "Danielle C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-10", "description": "Caveat Emptor.  I stopped here so my son could use the restroom and ordered a takeout breakfast sandwich, which in the menu was in itself steep - $10.  The waitress then told me the bill was $12.89.  What, I asked.  First she told me it was taxes.  \"Almost 30% taxes?  Why haven't I been charged that much elsewhere in NYC?\"  So she changed her answer, telling me it was tax and a \"service fee.\"  I said there was nothing on the menu stating there was a $2 service fee.  So she changed her answer again, this time telling me it was a required 20% gratuity.  (for a takout breakfast sandwich?!)   I explained that a \"gratuity\" by definition is not \"required,\" and asked where on the menu it stated this.  She then agreed to get the extra $2 off.  (Mind you - I'd generally leave a tip even for a take out, but in this case - hope.  She'd gotten pretty hostile.)  She then went back into the kitchen and said something to them.  We got the sandwich - good grief - pretty pathetic:  for $10, we got 1 very thin slice of ham, no egg, no cheese, about 3 small pieces of greens, and some sort of dressing, on cheap WHITE BREAD.  Seriously?  The place looks so stylish - but some things are all packaging.  Too bad they have such a monopoly at the end of the B'lyn Bridge, which is a great walk.  We'll take a picnic next time.", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-01", "description": "Stopped in after walking across Brooklyn bridge. Nice selection of dishes on the menu. My chicken sandwich was tasty but hard to eat as the chicken chunks fell out of the bun. The mozzarella  sandwhich was good.", "author": "Kristin P."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Brooklyn Bridge Bistro", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "63 Tillary St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/dFI6SHCqLAfotsnxcs1zJA/ls.jpg", "@type": "Restaurant", "telephone": "+17188580007"}