{"aggregateRating": {"reviewCount": 49, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "Came into Brooklyn in the early morning around 7am for a business conference and had breakfast. A lot of great dinner reviews, but I didn't see much about breakfast so I gave it a try. What a cozy corner spot! The Southern Skillet was packed with flavor and they make great cappuccinos! The spice of the sausage in combination with little mini quesadillas along with the typical potatoes and eggs really made the dish. Great service and presentation of food as well. The server was very kind and engaged with me in conversation about my morning and travel. She even went out of her way to bring over some spicy sauces in case I wanted more heat in the flavor. Easy walking distance from Marriott Brooklyn Bridge and relatively close to Downtown Manhattan. I can't wait to come back and try out dinner. Great experience and I totally recommend.", "author": "Ian G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "The margherita pizza and truffle parmesan fries were really good. Pizza was light.. perfect for a snack. Servers were attentive and really nice. A great stop before going to the promenade.", "author": "W D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-17", "description": "Employees rude! and the food is gross. I would never come here again. Me and my family are travelers from virginia looking for a nice spot in brooklyn and when arrived the gentleman had an attitude", "author": "ChaNiya C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-01", "description": "Can't give more. Service is meh! It's more like hurry up and order don't have time for questions! Just letting you know. If you want it they are out if it. So pick something else. \nI asked our waitor what do you have to drink. It's there, is what is said. Then blurted out the drinks.\nI know they are new. But polish up your service.\nThe food, the same I can't say I enjoyed it. My husband and I ordered the Salmon BLT. They forgot to include the Salmon I think. We spent another 20 min waiting for a piece of fish. The restaurant is runner by a bunch of incapable staff.\nJust go elsewhere. It's not worth the wait or torture!", "author": "eva e."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-05", "description": "Came on a sunday night so there weren't too many people. Saw the 3 star review and took a chance, really great food! The sandwhiches definitely filled me up and the Manhattan truffle was pretty good too. Great service as well! Deserves to be higher rated. Sean was a great server!", "author": "Neel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-07", "description": "This new neighborhood spot is awesome...great location right at the base of the Brooklyn Bridge, nice menu of comfort food, and incredibly friendly service. I think this will be my new go-to!", "author": "Krista J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "If you're looking for a cute spot with great pizza, this is the one. Absolutely delicious and I'm in love with the way they serve the food! The potatoes come out in a mini fry pan net! Prices are also fair, would definitely recommend for a quick and fresh meal", "author": "Mary V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-10", "description": "The service was great but my rating is based solely off of the food. I ordered a sirloin sandwich. The steak was dry, very overcooked and they added a lot of brie cheese to the sandwich, making it almost too strongly flavored to eat.", "author": "Bushra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "They have a wide range of beer and cocktail. I love the wine sangaria. They make it really tasty. Also shrimp cocktail is really good. The environment is comfortable too.", "author": "Ng A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "The goal every trip is to try local places. This was not my first choice. However, it said they served breakfast and that's what I was looking for. Unfortunately, they were no longer serving that, but had some breakfast items. I ordered a hamburger well done. I had a hamburger medium raw.... I mean it was bleeding on my plate! My mom and sister ordered the grits and it was the most disgusting thing ever. My friends ordered salad and  they mixed it up. They automatically put a 18% gratuity regardless of your party size and they make sure they provide crappy service because they know people have no choice after walking across the Brooklyn Bridge.", "author": "Shanta M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "I had a court hearing in that area and I got 1 hour break. My stomach was louder than my brain. I decided to check out this place. \nOMG! The salmon that I had was out of control. The best one in my life (keep in mind I'm not even a fan of sandwiches ). \nThe staff is very friendly. I even made some friends there. \nThank you Hannah, Nazario, Oskar, Aziz, Omar, Ali, Naima, Frank, Carlos, Brittany, Denis and Eddie ;) ! Keep it up. You guys deserve it!", "author": "Anara B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-27", "description": "A group of eight of us stopped in for Sunday brunch. It was a nightmare! \n\nWe were seated quickly and courteously and the place had great ambience. Full stop.  The train promptly went off the tracks. \n\nWe were given lunch menus even though lunch was not being served, which we learned when we asked if we could still order breakfast. Elapsed time to get the correct menus? About 10 minutes.  It took another 10 minutes to catch our waitress to put our order in, which included coffees of course. We sat there for another 10 to 15 minutes for the coffee to arrive. We had been there about a half an hour. \n\nFood started to arrive in another 10 minutes or so, but only for 3 of us. Another 2 meals arrived about 10 minutes later, one of which was wrong. By the time we all had meals we were almost an hour in. Three of four egg skillet dishes were served cold. A family that arrived just after us walked out after ordering and receiving nothing after 20 minutes.\n\nWe asked to speak with the manager. She apologized noting they had only been open a week and were working out the bugs. So, apparently, that's my problem. I would not open if I was this \"not ready\"!\n\nWe were given a discount on our meal, but it should have been comped!", "author": "James J. M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-15", "description": "I would not recommend this place if you look for great place or great food. Everything is just average. The waiter was nice but I took him really long to get our order and then to bring the food. The food was just OK for the kids and my salad was really not good. It was big but no dressing, no taste.", "author": "Emmanuelle T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "Love this place!  The michelada drink is great, has a nice kick to it.  The seared branzino has an amazingly crispy skin and melts in your mouth.", "author": "Colleen R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-01", "description": "I had the mac and 3 cheese, which was surprisingly good. Had the bb burger which was okay. Service was odd. Our food took forever to come out.", "author": "Dallana A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-20", "description": "Finally, a quality restaurant in my neighborhood. Cheerful service and a discount for Concord Village residents. Perfect location to start or finish your walk over the Brooklyn Bridge. I plan to be a regular for breakfast, lunch, and dinner.", "author": "Chris R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "Good food! The spinach salad is wonderful and the dessert - the chocolate mousse cake, which tastes so good like in heaven!", "author": "Candace C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "This restaurant is at a prime location right off the Brookyln Bridge on the corner of Tillary and Adams Streets. This place have a great atmosphere, with it's rustic look makes it feel so inviting, and with the Christmas tree up makes feel likehime. The food here is delicious as I had multiple dishes from their menu. The Salmon BLT is so light and delicate. The wait staff is so wonderful and polite.", "author": "F V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-15", "description": "Had just walked over the Brooklyn Bridge...was hot and hungry...they are located at the foot of the bridge walkway.  Had the Black Bean Burger (vegetarian) ...it was moist and tasty.  Served with a green salad with balsamic dressing ...also very good.  The only turn off was getting charged for my soda refill which at $4 seemed unwarranted.", "author": "Edward G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-05", "description": "Brooklyn Bistro \u0026 Winebar is a fabulous newish, Soho styled eatery where we had a perfectly balanced, delicious breakfast.\n\nHanna, a 20 something partner works the room effortlessly serving diners up with good cheer, quick wit and a warm smile.\n\nWe look forward to returning again soon.", "author": "Roberta F."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Brooklyn Bridge Bistro", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "63 Tillary St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/dFI6SHCqLAfotsnxcs1zJA/ls.jpg", "@type": "Restaurant", "telephone": "+17188580007"}