{"aggregateRating": {"reviewCount": 13, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-05", "description": "Great little deli and store! We stopped in to get some breakfast sandwiches and they were really good! Reasonably priced for New York. Recommend to anyone looking for a quick, delicious breakfast or lunch item.", "author": "Holly C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-21", "description": "Good beer selection for a bodega.\nSo far everything I've gotten here (except for maybe the beer) has been overpriced.\nBEC not great.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-26", "description": "Convenient location to a recent hotel stay. Open 24 hours , good selection of soda, beer and snacks. Ordered the Greek omelet combo for 5.95, large enough to share with my wife. Posted pictures.", "author": "Kevin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-06", "description": "First of all, this place is labeled BROOKLYN DELI, so there's that.\n\nI got a Turkey Sandwich from them. Just your typical deli. Nothing too special about it. Apparently they have a nice beer selection, but I wasn't paying attention to that.", "author": "Jacky C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-23", "description": "Short and simple the guy behind the counter said $7.70 which was overpriced for a roll and bag of chips anyways. Swipes my card gives me the receipt for $8.40 and when I said you said $7.70 he says I added tax because you used a card.", "author": "Michael P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-12", "description": "This Deli will sell alcohol to kids [not to me] but to some of my neighbors who look 14 years old but they don't get card. I have witnessed it. \n\nOther than that, I think this deli is too small. Their Arizona cans are pretty dusty. The deli's primary revenue is the lottery. But their counter is always messy and unprofessional. There are lotto tickets everywhere. It's more like a cheap run down bodega. Also their deli sandwiches are kinda 0.50 cents more than the usual.", "author": "James D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "The breakfast sandwich and beef pattie signs always intrigue me but I really stopped here on a diet soda run.  (I'm that person who leaves a hotel to go to a corner store when they feel the price is too high.) I stopped to oogle the very nice beer selection as others have mentioned but it was 1 in the afternoon so we stuck with a diet pepsi.\n\nGreatest thing ever though, dude gave me this tiny bag to put my soda in and a straw.  All bottled soda should be served like this.", "author": "Lisa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-12", "description": "Very clean deli and food is not bad. There breakfast special of 2 eggs on a roll with cheese, home fries and drink for $3.99 can't be beat anywhere around. Also a extra side of home fries is only $0.99 wow!! The deli counter uses boars head cold cuts and prepared foods looks quality to. \nSo if you are in the mood for a nice cheap meal around here. Stop in and grab something to go. No seating of course", "author": "Nick C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-15", "description": "Muhammad, the late night guy, is great! Very nice!\n\nWas my go-to destination whenever I needed sustenance after a late-night bartending shift in Downtown Brooklyn.\n\nThe turkey bacon was a little funny, but then again so is its concept.\n\nService was always fast, polite, and they even have a fair selection of craft beers.\n\nIf I end up back in BK, I'll be sure to hit this place up again for late night munchies when nothing else will do!", "author": "Joe H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "Awesome breakfast sandwiches in the back of a convenience store with most everything that you need for the day like drinks snacks beer etcetera.", "author": "Alex S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-21", "description": "Service = great. Beer selection = awesome.  Food = OK. Bagels = meh.\n\nI work in the area, so I'll obviously be back. The fact that it's far less sketchy than other delis in the vicinity gives it the edge over the competition.", "author": "Heather S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-19", "description": "About the 5 stars.  Those 5 stars are not really for Metro Deli.  It's a fine establishment for sure, but there are probably a million and one places just like it in every borough.  The 5 stars are for the abundance of amazing breakfast sandwiches in NYC, and this just so happens to be the place where my conglomerate and I would re-up on them.\n\nThe breakfast sandwich is simple in itself, a roll of bread with some cheese, scrampled eggs, and either sausage, bacon, or pastrami.  At the same time, the combination is so much more, what with the magical quality of the bread and the complementing breakfast tastes; it really starts off your day on the right foot.  There is really no equivalent out here in Cali.  The only thing that comes close is the sausage mcmuffin, and that's just sad.", "author": "Lino M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-19", "description": "Dark and overpriced.  This place is good for picking up a newspaper and that is about it.", "author": "Anthony C."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Brooklyn Deli", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "115 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/nEfJ1YHYtcFuEAOHfSXamg/ls.jpg", "@type": "Restaurant", "telephone": "+17188551952"}