{"aggregateRating": {"reviewCount": 206, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-17", "description": "One of my favorites. I am familiar with the owners as I am such a regular here and they occasionally toss in freebies. I take the 45 minute plus trip including a transfer to the R here regularly to experience great falafel. Crispy and always fresh and just delicious.", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-01", "description": "Super tiny space, but they deliver some seriously great dishes. I dropped by here to grab a something while waiting for a friend. I ordered the falafel salad and was really impressed - the salad was pretty large and tasted delicious. They have a much more extensive menu - would definitely come back to try some of their other items!", "author": "Ashley F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-27", "description": "A great spot for lunch in Cobble Hill. All the sandwiches and wraps are Middle Eastern-ish delicious and reasonably priced. I suppose my favorites are the Chicken Kifta and the Chicken BLT, but you can't go wrong. Very tiny, charming spot with friendly staff. Also, it's one of the only restaurants in the area that offers lunch before 11 am.", "author": "Casey L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-17", "description": "Tried it again a few years on . . . gone downhill -- chewy lamb.  Nuff said.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-21", "description": "It was over 100 degrees on Wednesday. It was 2pm. I could not bring myself to eat anything all day. As I walked down Court I could feel the h2o in my body evaporating.\nI stopped at Darna as if if were an oasis. It is, the mint iced tea was perhaps the most refreshing thing in the universe. It tastes a bit of orange blossom and/or hibiscus too. The felafel always is on the spot. I must confess thats all I ever have when I go. The food is freshly prepared and an excellent value. The place seems to be operated by a family and everyone I have encountered there is very friendly. Great to have them in the 'hood.", "author": "Kenneth A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-04", "description": "Very nice people. \n\nBut not such a great falafel--soggy, overdressed, and really sorta bland. Sorry. I won't be back.", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-02", "description": "I love this place for Falafel, especially the Kafta.  Flavorful, inexpensive and has great people and tea to boost.\n\nAmazing and I go back often.", "author": "D J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-26", "description": "Great staff. Poor execution on the falafel and pita.  Neither very flavorful.  Wanted to like it, but the seasoning wasn't there...", "author": "Stephen R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-25", "description": "I got a delivery order from this place a couple of weeks back and was pleasantly surprised how good it was. I ordered the Chicken Cobb Salad and Lentil Soup, but they called me back after I placed my order and told me they were out of the soup. They suggested I try the hummus instead.... well, I'm glad I did b/c  the hummus was some of the best I've had. I loved the little pool of olive oil and olives that dressed the top! Yum! The salad was tasty as well, and much better than a lot of delivery salads I've had. I've heard the Chicken BLT is the thing to order, so that's next up on my list! Btw, the staff at Darna Falafel is super nice. Call these guys up or order through Seamless... I think you'll be pleased :)", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-10", "description": "Had the Moroccan Omelette wrap. Food was amazing. Price was great. And even more than that, the energy and the service was perfect.", "author": "Lorenz S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "We tried their falafel sandwiches and they were delicious! Fast service and tasty food. Clean. Wish that the place was a little bigger/had more seating but don't let that deter you.", "author": "Rosa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "Just got the chicken platter. Great tasting and best deal around town for 8.50. Can't believe I haven't been here more often.", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-20", "description": "good lord. this place is the bomb, great small spot with excellent food, amazing baklava, and awesome staff! I can't get down with cucumber at all, and when it wasn't listed as an ingredient but showed up in my order, they re-made it without question - even though I was super apologetic and embarrassed that I can't handle it / didn't realize it was a standard in the mix.\n\nanyway, super super bomb, will definitely be coming back soon!", "author": "Coleman H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-12", "description": "AMAZING! Talk about a party to your taste buds with a reasonable price... Finally! From their golden brown falafel, grilled veggies, crispy sweet potatoe fries and their ever incrediblee mint iced tea this place is just what Court St. needed. And the decor they sure put a lot of effort in turning this place a beauty for the eyes, the benches infront of the restaurant and around the tree were great ideas. Darna I want to take you home with me.", "author": "Majed B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "Had Darna for the first time today and will most certainly not be the last. I ordered the skirt steak sandwich and an order of hummus. Both were outstanding. I come from having worked in a very popular Mediterranean  restaurant in NJ; this was every bit as good, if not better and about half the price. They give you very good sized portions too (this coming from a 6'3'' 235 lb guy). I am very happy I came across this place and I cant wait to come back.", "author": "Andrew T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-15", "description": "Went in on a very hot summer day. The smoothie was a good choice to cool of and the falafel was very good. Had a good chat with the owners as well, very nice people. Would recommend for both take out or a casual sit in place (just beware, not the coolest place to sit in during the summer)", "author": "Mariano G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-08", "description": "I've been to this place on a few occasions since it opened in the neighborhood last summer. They are very friendly and accommodating which lives up to the English translation of the restaurant name. \nAlthough there is a bit if a wait for your food, it is well worth it as the quality has been top notch every time I have been here. \nBest things I have had are the Kifta wrap and skirt steak wrap. There falafels are great as well. \nJust today I had a breakfast sandwich, their egg BLT with chipotle mayo on a soft baguette. Best breakfast sandwich I have had by far. \nCheck this place out if you're in the neighborhood.", "author": "Ray A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-27", "description": "You have not lived until you have had a chicken BLT and a steak kifta from Darna. I mean it. Like don't move out of NY until you have the opportunity,  and then sit there and eat it on a bench on Court St. And think about the fact that you are moving out of NY you dumbass.", "author": "Melody G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-03", "description": "This review is based on one thing and one thing only: CHICKEN BLT.  Yes yes, I know it's a falafel place, but holy hell, the chicken BLT offered at Darna is one of the tastier sandwiches I've had from anywhere in a long, long time.  One day I will actually try their falafel, as that (and their pita bread) is generally the measure of a great Mediterrean/Middle Eastern restaurant.\n\nAnyway, back to the BLT.  It's made with sliced, grilled chicken breast, turkey bacon, which makes me feel slightly better about eating it (although, regular bacon wouldn't sway me, so it's a moot point anyway... sigh), lettuce, tomato, avocado and served with a spicy aioli on fresh ciabatta bread.  I also often have them add goat cheese, because I snap out of that whole is-it-healthy thing after I realize I don't really care how bad it is for me, after all, so just give me the friggin' tasty sammie.  It's just a well-made sandwich and that's really where my appreciation lies, so screw-all to the health factor.\n\nAlso, their french fries are just pure yum.  Perfect accompaniment to my chicken BLT.  Crispy and well-seasoned on the outside and soft and hot on the inside.  \n\nThe staff are always polite and the space is conveniently located and very clean.  It's never been very crowded (I believe they do a fair amount of take-out business) so I've always been able to snag one of their very few tables).\n\nMaybe one day I'll actually try the falafel, and when that happens, I'll let you know what I think, but at the moment, I can't get that damn chicken BLT out of my head and that's all I want.  Try it.  You won't be sorry.", "author": "Catherine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "Love this place! Delicious skirt steak sandwich...just delish!!!!", "author": "Joe S."}], "servesCuisine": "Falafel", "priceRange": "Under $10", "name": "Darna Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "200 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HQYl9gM-6aeJbh6skNtjcg/ls.jpg", "@type": "Restaurant", "telephone": "+13477991673"}