{"aggregateRating": {"reviewCount": 206, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-10", "description": "Amazing food. I am a regular costumer here and always get the Kifta Wrap of Chicken BLT Wrap. Great food, atmosphere and workers.", "author": "Basil A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-06", "description": "Great spot!  Very friendly staff and excellent food. Don't sleep on the French fries!", "author": "Adam G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-13", "description": "A big fan ! The owner is always here and on top of everything. The fresh squeezed juices are excellent and made to order and he makes a range of smoothies very popular with his customers. Our go to is the Egg BLT with (halal) turkey bacon on pita. It is outstanding - filled with salad and a chipotle mayo - it is both satisfying yet wholesome thanks to the generous salad. All the platters look good - copious portions. The place is very pleasant - a small cosy place with seating for about 10 and also outside benches. I recommend highly !", "author": "Kate P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-13", "description": "So, I eat a lot of mediterranean food so this review is coming from a more seasoned palate. So I'll start with the good and then move on to what I think could be improved.\n\nI got the chicken platter and it certainly came with a lot of food so I can't complain about the portion size. There was a ton of rice topped with a generous amount of grilled chicken and it came with a big smear of hummus, some salad, and tzatziki sauce. The platter looked great and I definitely left full. \n\nHowever I do think the chicken itself and the hummus lacked seasoning. The chicken really needed salt and could've had a better spice profile (I'm not an expert but maybe some cumin, turmeric, garlic and onion powder might kick up the flavor a bit). The hummus was pretty lack luster, really just tasted like chickpeas blended with tahini which is pretty bare bones. \n\nIf you've never had mediterranean food than this place will probably satisfy your craving, but if you know good mediterranean food, it's got a ways to go!", "author": "Sam E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-27", "description": "No. No. No. No. No. \nWho were the previous reviewers?? Family members?? \nOr am I just spoiled by Mamouds and Taim??\nHow dare you Darna! I expressly asked if the falafel is green inside. This is how I tell if a falafel is going to be good. The guy even went in the back and asked the kitchen. He came back with a big ole yes and when I dive into the falafel I had a sinking feeling that it wasn't going to be green...and I was right. \nI went out of my FREAKIN way to try this place out. \nWhat kind of reputable Mediterranean spot uses the black olives???\nI can't even discuss the tahini. WTF??? I make a better tahini sauce than this. It was purely tahini and water. No garlic.  No salt. No nuthin. \nThe salad. The salad was dressed in bottled Italian dressing. \nI blame the Yelp reviewers for recommending I go there. Do you people have taste buds??\nSo disappointing.", "author": "Kateria N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-24", "description": "falafel was good but chicken kifta wrap was a little dry.  their shakes are delicious so definitely have one of those with your meal. their cardamom black tea is also so warming", "author": "Lisa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-02", "description": "Yummy yummy food. I never had lamb before I decided to try it here. It was good. I also tried their mint ice tea I think it has a little oregano too. Very refreshing!! A little more sweetness would have been nice. Downsides are the chicken and hummus needed more flavor and salt, the white sauce I'm not sure what it's called was not tasty idk if its my taste buds but I definitely love the use of flavors, salts and sweeteners (in general). The lamb was the tastiest thing on my platter. But i was fine. Will come again ...and ask for some salt.", "author": "Tatiana J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-28", "description": "Does one of those places grab your attention and pull you In sometimes? That's what happens here. Darna looked like a little cafe in Turkey instead of one on Court street. Stopped in on a Thursday for a quick bite and had a salad with lettuce, feta, chickpeas, tomatoes, carrots and olives. It came quickly and hit the spot. I'll be back!", "author": "Shelton H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-16", "description": "Really cute place, stopped by today for the first time and tried their Happy Mango smoothie which was all natural and tasted great. The portion was also generous. I also had a cup of their Arabic chai tea which tasted really authentic (I am middle eastern so I know good chai). Will be going back to have lunch soon and try their mint iced tea which I have been told tastes amazing!! The location is also great!", "author": "Amani A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-23", "description": "My son comes in here all the time. The BEST middle eastern food you can find in Brooklyn. So natural, fresh and healthy. Chefique is an awesome store manager and they always accommodate your requests. \n\nAffordable, amazing smoothies. Fresh food! What more an you ask.", "author": "Martha A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-01", "description": "This food was absolutely phenomenal! I got the chocolate Nutella shake and it was so delicious, best chocolate shake I've ever had! The workers were really sweet and one of them was so cute y'all! I got the chicken BLT wrap and it had the perfect balance of chicken, lettuce, and avocado. The chicken was perfectly seasoned and the atmosphere was exactly what we needed: refreshing, serene, and perfect for having those summer night conversations with your friends. Fun music selection too!", "author": "Jailine D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-26", "description": "Delicious and fresh lamb platter. The place is super small, so it was great to have my lunch to go. The smoothie looked really good, so in addition to my lunch, that I ordered online - I bought a smoothie on-site. It took a while, but he upgraded my size for my wait. The lamb was super tender and flavorful - with such a great value for lunch. I divided the platter into 2 meals! Yum.", "author": "Pinky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-13", "description": "I've been trying to make it here since I moved to the area-it just looks so inviting and authentic-and finally made it over recently.\nIt's a tiny space with limited seating but the service is really friendly and earnest and the food is totally delicious.  The hummus was so fresh I swear they just made it right before they gave it to me-no lie.\nBest part (at least to me) is the falafel wrap I had was too big so I had leftovers...and they tasted better the second time around!! Woot : )", "author": "Allana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "Healthy and quick!\nI've walked past this place so many times and not sure why I'd never gone in before. I was at a gym class nearby and stopped in for a smoothie. For $5 I got a huge avocado smoothie, which was delicious, and definitely would've been double the price at a chain juice restaurant. Good service, friendly staff. Their other items were pretty reasonably priced, too. Will definitely be back to try other items on the menu.", "author": "Melissa E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-21", "description": "Loved this place!\n\nStopped by one afternoon with my friend. Coming from Manhattan, I could not believe how inexpensive this place is. It's a very small restaurant with a good selection of lunch and breakfast sandwiches/wraps. I got a breakfast avocado/egg wrap ($4.95) and it was delicious!", "author": "Kimberly T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-31", "description": "Tahina-overloaded iceberg lettuce classics made by white people for white people", "author": "S M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-07", "description": "3.5 stars - Very hefty portion size, so you certainly get a bang for your buck at Darna Falafel in terms of amount of food. I got the chicken platter and my best friend got the lamb. The platter comes with a lot of different sides--rice, hummus, salad, and pita--so you definitely don't get bored of the same bite over and over. My favorite part of the plate was definitely the rice. It was fragrant, well seasoned, and very tasty; I couldn't get enough. The salad was also good, but average. I'm not a huge fan of hummus so I can't really say whether it was good or not, but it tasted rather plain to me. The biggest disappointment for me was the pita. It was cold and tough. It tasted like store-bought pita that they'd just taken out of the bag and put onto the plate. The chicken was also a bit boring. It was pretty bland and a little dry. I tried my friend's lamb, however, and that was really good! I wished I had gotten that instead. \n\nOverall, Darna Falafel offers some hearty food for a good price. Though the flavor of their dishes could use some work, I'd definitely return for a fresh, filling meal. The staff is also very friendly and welcoming!", "author": "Kira L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "I ordered the lamb gyro and a mint tea.  It was excellent.  I love that they accept credit cards and that they accept lunch orders.  I have been coming here for two years and their food is the best.  Its full of flavors. The staff is very friendly and helpful.", "author": "Anthony J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Love this place! Recently found it when I was searching for good lunch places in the area. The interior and outdoor seating are incredibly beautiful. Kind of feels like a little oasis in the middle of Brooklyn. \n\nI got the chicken kifta wrap (which has french fries in it!!) and came with a salad with chickpeas, tomatoes and olives. All super fresh and yummy!\n\nThe staff were really nice. They let me try some of the avocado smoothie made by the in-house smoothie master -- It was so good I had to get one with my meal and I'm going back to try the other flavors.", "author": "Julia J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Cute small place to eat at but full of great flavors. Great date night I had with my boyfriend. The place is so tiny only has like 2-3 tables I recall. But we decided to eat here and so glad we did. My boyfriend works near the area and grabs lunch here a lot. And now I understand why. I had the chicken platter and it was so good. My meal  came with salad, pita with hummus, and delicious chicken. The sauce that I drizzled onto my chicken (incredible).Of course had to get dessert and Baklava was fantastic. I will have to come here for dinner again. Good job to my boyfriend for taking me here.", "author": "Brenda F."}], "servesCuisine": "Falafel", "priceRange": "Under $10", "name": "Darna Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "200 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HQYl9gM-6aeJbh6skNtjcg/ls.jpg", "@type": "Restaurant", "telephone": "+13477991673"}