{"aggregateRating": {"reviewCount": 206, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-23", "description": "I was lucky enough to be able to dine in right before the lunch rush. I ordered the lamb platter and chai tea (which was freshly brewed). The portions were huge: fresh salad, hummus, pita bread, and lamb over rice. I usually avoid the sauce that comes with falafel platters because it's heavy, but their sauce was surprisingly delicious- I used the whole thing! Unless I catch them on a quiet day, I'll probably order ahead or get the food delivered next time.", "author": "Yen N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "Darna's falafel is excellent: crispy copper brown on the outside and moist and flavorful on the inside. The hummus was very good. Prices are reasonable and portions are generous. The folks behind the counter are friendly. I appreciate the free samples of their teas and ended up with a perfect glass of iced mint tea. \n\nThere are not very many tables, so have a plan to go. Tip: walk one block west to Clinton and sit in lovely Cobble Hill Park.", "author": "Joe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-01", "description": "The tahini sauce was so-so, otherwise the falafel was good. The spinach pie was marvelous! They also have a lovely homemade tea. 4.5 stars.", "author": "June G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-11", "description": "This place serves up outstanding sandwiches and wraps, usually accompanied by a decent salad, at very fair prices--- around $8. \n\nThe Kifta wrap and the chicken BLT are stand-outs. Well-seasoned meat and fresh ingredients. \n\nThe guys that work there are all friendly and very attendant. \n\nOverall, a great spot.", "author": "Clayton A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "The best quick bite in the neighborhood. Staff are great, food's excellent and fresh every time, and the staff is always friendly.", "author": "Jon L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-06", "description": "Great place but honestly calling in for pick up is better than actually waiting there coz he has so many orders and gyro by nature takes time so it just all adds up and honestly more than 20 mins for a simple single lamb gyro is a lot!", "author": "Maya J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-26", "description": "Wonderful quality food, always delicious, served by wonderful and friendly counter folks. Their chicken blt is amazing, and their French fries are superb at all hours of day and night. Thanks Darna!", "author": "Olivia W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-24", "description": "I have enjoyed their Belgian fries, Chicken Kebab, fresh Lemonade but the Falafels they make are not good at all unfortunately ( Heights Falafel in Brooklyn Heights by far the best falafel) and the rice is sub par ~ the guys that work there are really nice and delivery is pretty fast.", "author": "DW W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "Great place to eat. I went there with my brother we had the steak platter and the lamb platter. I liked it all the food was well prepared and the plates were reasonably priced. I have been to a bunch of places to eat in NYC most of them sucked. People make it like the food in NYC is so good most of it is over priced and gross. This place was different the attitude and ambiance was refreshing people here were actually nice and friendly! They have the best hummus I ever had and the plates were full of great food..", "author": "Michael P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-25", "description": "I've eaten here multiple times before and have been happy with both the service and the food.  This last time was a big disappointment.  My falafel was soggy and tasteless and fell apart so badly that half of it fell onto the floor and the grape leaves were extremely mushy.", "author": "April Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-14", "description": "The falafel is seriously outstanding.  Crispy outside, fluffy and light inside.  Maybe the best I've had.  Not the heavy, soggy, clay-like stuff a lot of places feed you.\n\nTahini dipping sauce is thinned out, unlike other places.  It gives it a lighter feel.  Not like you're eating exotic peanut butter.\n\nThe desserts are tasty, but not the traditional, decadent, honey-doused monsters of other places. (I prefer it lighter, but you may disagree.)\n\nVery small place -- maybe 6 seats.", "author": "Julio R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-19", "description": "I feel bad giving this place two stars because the service was outstanding. The guy manning the shop gave us samples of their teas, recommended sandwiches and even wrapped our leftovers. But the food... If you're expecting your usual falafel-and-shawarma shop, this ain't it. The wraps aren't flatbread; they're flour tortillas. The falafel was alright but slightly undercooked for us and came with a mayo-ey sauce that was far from the lemon-tahini I expected. The sandwiches come with a salad, which is a great addition but the dressing is a let-down. The sandwich itself wasn't bad and I ate the whole thing, but it didn't hit the spot.\n\nIf you're looking for Cobble Hill's response to Mamoun's, keep walking. If you try this place, keep an open mind and you may be pleasantly surprised.", "author": "Milena P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-26", "description": "I am rarely disappointed by Darna. What I love most about this place, is you can eat like a pig (french fries, and BLT sandwiches) or you can eat somewhat healthy (falafel salad and hummus). Also, interestingly, some of my favorite menu items (see below) are not the traditional middle eastern foods one may expect from a place with the word \"Falafel\" in the name. For example, they have a great Cobb Salad in which they use dark green lettuce, quality bacon, and cheese (wish they used better quality chicken).  \n\nThey typically have large portion sizes, so you get a big bang for your buck. I have ordered french fries on days i'm feeling piggish and for a few bucks you get a HUGE order. Falafel is always good, but a little on the greasy side. \n\nSome top menu items:\n\nChicken BLT Sandwich - trust me, order it \nCobb Salad\nFalafel Salad\nHummus platter", "author": "Alison B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-01", "description": "Really cute place and super friendly service. I so wanted to love the food because of that, but unfortunately it was just OK for me. The side salad that I started with had lots of browned pieces of lettuce, so that was my first disappointment. I ordered the chicken kifta wrap and though it was served nice and warm, the tzaziki was just too watery and the inclusion of the fries into the sandwich just added a soggy texture. The chicken and everything was well seasoned but those few execution flaws brought it down a tad for me. \n\nThe guys who work here seem super nice and because of that I would probably give it another try (there was a steak sandwich that I was eyeing on special). Let's hope my next visit is better than my first!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-06", "description": "Grabbed a late night bite, skirt steak platter for $9.50? Hmmm....let's give it a shot. Out came a plate with chopped up skirt steak which was seasoned wonderfully with rice, salad, hummus, and toasted pita. Small seating area so not great for groups, grab and go is the name of the game. Gotta go back and try the rest of the menu...and they have a smoothie and juice bar!", "author": "Patrick K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-20", "description": "Review for delivery order - Ordered the falafel platter. The falafels were rock hard and completely inedible. Platter went straight to the trash. Save your money and order elsewhere!", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-15", "description": "Went there on a lunch break after seeing it on Brooklyn's top 100. Grabbed the Kifta wrap and the flavors just popped out. The guy behind the counter was friendly and honest. Definitely going back soon.", "author": "Eric M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-12", "description": "i was very excited to try this place but unfortunately everything we ordered wasn't good.  the chicken and steak sandwiches lacked flavor", "author": "Yasmina F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-03", "description": "Most affordable, delicious falafel I'll ever have. Super friendly, super tasty, super comfortable spot. Would still go here if I had to choose between a spot in Istanbul or this.", "author": "Dalton C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-12", "description": "Very yummy. The person that took my order was charming and delightful. He accommodated me as I swapped fries out and added chicken to my falafel wrap. The meal came came with a salad (which was\npretty but totally boring), and I got the fries on the side (which were really tasty).  Altogether, very yummy... But not the 'out of this world' good that I was expecting after reading the other Yelp reviews.  The mint tea was also delish and refreshing.  I'll go back if I am craving falafels specifically, because those were GOOD, but I'll pass on the sandwich.", "author": "Caitlin M."}], "servesCuisine": "Falafel", "priceRange": "Under $10", "name": "Darna Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "200 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HQYl9gM-6aeJbh6skNtjcg/ls.jpg", "@type": "Restaurant", "telephone": "+13477991673"}