{"aggregateRating": {"reviewCount": 206, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-09", "description": "I always order for takeout when I'm working in the area. Service is great, prompt and reliable especially for someone on a rushed lunch hour. I do love the quaintness of the space, the ambience is cozy and nice and the food....yummy, tasty and satisfying. Never disappoints. Never. Try the catfish sandwich :-)", "author": "Vanya M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-22", "description": "Seriously, don't. The most bland falafel and hummus I've ever had the misfortune of tasting in my 30+ years of eating the stuff. No flavor whatsoever, and the salad had Italian dressing from a bottle. Come the fuck on. Inexcusable in 2018 in Brooklyn or really anywhere else.", "author": "Dave P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Great spot for some quick quality food. Kifta wrap was really good with chicken and fries inside the wrap. The wrap is packed and there's enough chicken inside. $7.50 is a good deal and it comes with a decent side salad. Fiancé got falafel platter with 5 falafels which was also tasty. We got a triangle of baklava for $1.50 and was fresh.", "author": "Anup R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "Back in August, on a random Monday off from work, I decided to take a leisurely walk through SoHo. Next thing I know, I've managed to walk across the Brooklyn Bridge and plop myself in the middle of Cobble Hill! Needless to say, my legs were a bit tired and I was a trifle hungry! Cobble Hill is a neighborhood that I do NOT know well, full disclosure. I didn't even look for anything on my trusty Yelp app. I just said, \"Let's see what looks appealing when I walk by.\" \n\nHello, Darna!\n\nAlready being 4:15 in the afternoon, I figured this was my best chance for getting a late lunch. I went into the small space with its sprawling menu. Though all of the options looked delicious, and was leaning towards something a bit meatier, I went for the Falafel Wrap, which included falafel, roasted red pepper, portobello mushrooms, romaine lettuce, caramelized onions and lemon tahini. It even came with a small side salad. I ordered it to go, but at least outside in Darna's small yet charming outdoor area. It was very filling and so delicious! The lemon tahini was a nice addition, adding a much needed citrus kick against some of the heavier ingredients. At $7.95, it's a good bang for your buck.\n\nDarna, thanks for a rather fitting introduction to the larger Cobble Hill dining scene! I'm glad you were my first!", "author": "Allison C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Oh my god! This place is a life saver...having been suffering from first trimester pregnancy symptoms I literally lost my sense of taste and was not able to enjoy anything...until I ordered a steak platter from them! Everything tasted heavenly and you can tell that whoever owns the place and cooks the food has a very sensitive soul...I am going to go finish my platter in tears now...", "author": "Yunyue W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-04", "description": "Falafel is over cooked and lacks flavor and freshness. The salad dressing is horrendous. The veggies are of a very low grade. Why pay $8 for this when you can get better falafel from any truck?", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-18", "description": "Staff is friendly, food is tasty and not expensive. It's small inside so it's more of a takeout place than an eat in. Overall relaxed and cool vibe, perfect for an everyday spot.", "author": "Hannah D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-07", "description": "TL;DR: just ok for takeout; seating inside is limited, food is not the best, but not the worst.\n\nI recently moved into Cobble Hill and have gotten takeout from Darna a couple times, since I've often walked past the storefront and noticed that there's pretty limited seating. I've had the falafel platter, grape leaves, and the falafel salad, and they're usually ready in less than 10 mins.\n\nFood: The falafel platter is a ton of food - hummus, salad, 2 grape leaves and 5 falafel balls - but all of it is mediocre. My falafel was hard and somewhat dry, my hummus was bland, and the grape leaves were good, but not the best. The falafel salad is pretty similar to Sweetgreen in composition and features 5 falafel balls atop. Given that the salad isn't particularly fresh, you might be better off ordering a side of falafel to put on another salad if you're craving it. \n\nEnvironment: Teeny and cramped. Ordering takeout is so easy, though, and the staff are very friendly and helpful. However, prices on Eat24 are different from in-store; the spinach pie, for example, is double the price on Eat24. If you're able, I'd call for takeout rather than ordering online.", "author": "Hui C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "Awesome little hole in the wall in Cobble Hill!\n\nFirst of all, the quantity of the food is definitely worth the price tag - I got a lamb platter (which comes with salad, tzatziki sauce, pita bread, hummus, and rice) - all for $8. If that's not a steal, I don't know what is! We also got a side order of Belgian Fries for $3; they tasted more like cajun fries, but I didn't care because it was delicious and super crispy, and for $3, you get enough to split with a friend.\n\nMy lamb platter was delicious - lamb was super juicy, and I really appreciated all the sides that came with it. Rice and hummus could've used a little more salt, but I didn't mind.\n\nWe also got a mango smoothie ($5) - pretty good, but the taste I kept getting was more banana than mango.", "author": "Tashnuva E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "This is a wonderful Mediterranean place. Delicious food. Wonderful people. Great place. It's a small place but very cozy. I love how they serve plenty of food in such an affordable price.", "author": "KJ N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "First thing I noticed when I walked in was how low the prices are for a platter. Also, they have a huge variety of salads, sandwiches, platters and even smoothies so you can indulge or be healthy.\n\nHad the steak platter which set me back just shy of $10. It was amazing- the steak was plentiful and seasoned SO well. I can still taste it. Hubby had the lamb platter and was also blown away by the tender meat and superb flavor. \n\nPlatters are huge and include a huge portion of seasoned rice, hummus, salad, pita and sauce. We ordered two platters, a smoothie and bottle of water and spent $23 only. Also, bonus points for the smoothies: he made too much so basically gave us two for one.\n\nI already adore Court street in Cobble Hill but now I love it even more.", "author": "Erum R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "If youre looking for a place to take out, this is the place to go. Its a cute, small shop that I always pass by but finally decide to try and the food was great. They also make fresh juices, even if you want a small drink. But I've tried take out a few times and their kifta wrap is to die for. Must try!!!! I just recommend take out over eating in.", "author": "Joyce L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-13", "description": "I happened to walk by and wanted one of their special breakfast wraps. It was spinach, mushroom, egg and jack cheese. A nice dollop of hot sauce and I was on my way. They let me try their home made mint tea and I grabbed a glass. I sat outside enjoying one of the first hot days.  There was a small area with 2 benches, a little table and some greenery.\nI ordered a few spinach pies to go which were delightful! Not a ton of filling but the filling was perfectly balanced spinach/onion concoction. I grabbed some baklavah as well. They weren't sweet enough for me but may be perfect if you are looking for a less sugary version.\nOverall, I am looking forward to coming back and trying their more middle Eastern wraps, platters and sandwiches.", "author": "Saba F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-20", "description": "I ordered the Falafel platter.  The food is fresh but the falafels were lacking in flavor. The chick pea salad was good and so was the hummus.  Please add Cilantro and seasoning.", "author": "Enidm1273 .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "Hands down the best wrap I've ever had! The Kifta wrap is so well done, with a generous portion and a side salad. I've had it a few times this summer and it never disappoints. The people at the place are also always welcoming and they once gave me extra hummus after I'd asked about the hummus plate. The mint tea that they were giving as samples was also refreshing and wonderful and I'd definitely order that off the menu. I've had the falafel salad once and it was okay, nothing special and a bit on a dry side. Just order the Kifta wrap and you'll definitely get your money's worth!", "author": "Chanoot S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-29", "description": "I have always enjoyed Middle-Eastern cuisine so knowing that Cobble Hill offers a myriad of restaurants with Mediterranean food makes me jump for joy!\n\nAfter a day out exploring Brooklyn and getting some shopping done we wanted some Mediterranean food as our late lunch. Yelp came to our rescue and we found ourselves 100 ft away from Darna Falafel! So in we went and we were not disappointed. \n\nWe had the falafel salad and the lamb plate. It was pure deliciousness. The balls of falafel were juicy inside and crisp on the outside. Totally my thing. The lamb plate has a lot of lamb, rice, side salad, pita bread and hummus. The lamb is so tender and I enjoyed the spices they use for the marinate. They also had a variety of fresh fruit juices. We tried the greens for a healthy option and enjoyed it. \n\nIt does have a little sit-down area with just a few tables. I imagine it could fill up quickly during lunch/dinner hours. I ordered the baklava as my dessert, but they forgot about that order and I had to remind them after our meal. By that point I was already too full so I asked for it to go instead. They wonderfully gave me an extra piece foc and packaged them nicely in a box for me to take home. I enjoyed it as my supper that evening =)", "author": "Belinda L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-13", "description": "One of thee best places for sweet potato fries! Food come in fair portions and the natural juices are very fresh \u0026  delicious. Service is super friendly and accommodating (place is cramped though).\n\nDeff recommend to try!", "author": "Kabir A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-05", "description": "Finally a credible halal joint! When asked if they were halal, the staff was honest enough to let us know that their chicken and lamb are halal, but not their beef. Space is small, however when the weather is nice there is outdoor seating. My friend ordered the spicy chicken wrap and I got myself the chicken BLT. Found mine to be a tad dry but they do provide a chipotle-mayo type sauce that fixed that issue. Eager to try the cobb salad next time.", "author": "Sadia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Great service and great vibe. Had lamb platter and the gentleman on the counter, substituted fries for salad. Humus was fresh and extremely yum. Loved the experience and food was top notch!", "author": "Varun D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-13", "description": "Delicious food and very nice people! If it's warm, it's a great idea to order and sit outside either in the benches or under the tree in front of the place!", "author": "Lincoln C."}], "servesCuisine": "Falafel", "priceRange": "Under $10", "name": "Darna Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "200 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HQYl9gM-6aeJbh6skNtjcg/ls.jpg", "@type": "Restaurant", "telephone": "+13477991673"}