{"aggregateRating": {"reviewCount": 206, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-06", "description": "Delicious, simple middle eastern food. Tiny place but clearly someone's labor of love.", "author": "Matt A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-09", "description": "Delicious, delicious, delicious Middle Eastern food, with some of the most charming guys in town serving you. I'm addicted to their chicken BLT (yes, it hardly sounds Middle Eastern, but it is delectable) and love their falafel as well. Their salads are also lovely. They're doing well for a reason--great food and a really attentive team. Highly recommended!", "author": "Jeff H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-08", "description": "Always amazing. Chicken is always cooked so nicely, get the platter or wrap! One of my favorite spots in NYC", "author": "Kavita B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-14", "description": "I absolutely love this place. My first experience was when I was on my way home from work, I was tired and when I saw that they had falafel I knew I had to try it. From outside it looked like a nice quite spot where you can grab a good meal and just sit back and enjoy. The cashier was very nice and helpful and explained to me nicely as to what would come in my meal. I got a falafel sandwich. The sandwich was great with fresh salad and I loved their tahini sauce wish I could ask for a jar to take back home. Also they have amazing homemade mint tea which is to die for. I'm a big fan of their tea it keeps bringing me back to Darna. Overall my experience here is always great whether it's the friendly employees or the food.", "author": "Tenzin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "Very good falafel sandwich and hot sauce. A little too much tahini for my taste, will ask for less next time. I saw a few salads go by and they looked really good. I am still calling Mamoun's #1 for the falafel sandwich on the go, but since there's no Brooklyn location, Darna is my new local spot.", "author": "Samantha F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "The best Cobb salads ever. Delivery is usually really quick.", "author": "Xavier M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-28", "description": "Stopped for lunch while moving. Had lamb platter. Lamb by itself was somewhat greasy but was perfect eaten with the rice.  My son had falafel platter which was also excellent. Small place so hard to get table.", "author": "H S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-03", "description": "The steak sandwiches are awesome, the Cobb salad is pretty darn good, and delivery is fast and easy.", "author": "Daniel O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-04", "description": "I ordered for a delivery. I asked for it to be delivered ASAP. I got my food almost 2 hours later-- even after calling twice and having them tell me it was on its way. The food was good, but I'm sure it would have been better had it been fresh. The food was warmish, but was getting cold. I was very disappointed.", "author": "David R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-28", "description": "This place is awesome, the food is great, service is amazing, and their Yemen tea is the bomb diggity !! HIGHLY RECOMMEND", "author": "Jae T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-03", "description": "I live right next door and this place is a blessing (though perhaps a curse for my waistline...)! The rave reviews of the chicken blt are spot on - that sandwich is crazy delicious and the use of turkey bacon is genius. The guys working there are always a delight to chat with - sincere smiles every time. Can't recommend enough!!", "author": "Wynn M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-04", "description": "I hardly have words, wait no, that's a lie.  My girlfriend and I were visiting New York on a whim and were wondering around. We had been pounding pavement and riding mass transit for literally hours.  We were cold, tired, and honestly a bit cranky.  Earlier in the morning we each had crepes from Chelsea market, that was it. We needed sustenance and we needed it NOW, also cheap.  I broke out my smart phone and deployed my yelp app deftly, and like some crazy ass food finding ninja I filtered nearby restaurants for highest rating with one dollar sign.   BAM! This place shows up some 7 blocks away like a crazy ass oasis just when it was essential for me and my girlfriend to find one.\n\nUpon arriving we grabbed one of the open tables (of which there are only three, this place is kind of tiny).  The decor was hardwood and welcoming, the soundtrack familiar and pleasant.  I was instantly overwhelmed with joy when my girlfriend informed me that there was a power outlet just below the table top we had chosen as outlets for charging my phone were apparently at a premium in NY (we spent about ten min at a Barnes\u0026Noble looking for a place to charge our phones!).  We checked out the menu and everything sounds pretty damn good, but I'm not one to take things at face value.  I told the affable young man at the register I was considering the Falafel wrap or the Kifta wrap which would he suggest I choose.  He informed me that those were the two most popular and upon further discussion we both decided I'd be best served by the Kifta wrap and OMFG it was heaven in my mouth.  Angels sing from within this glorious delight and whisper sweet nothings into the ear holes of your taste buds.\n\nThe nice gentleman at the register also came by to see if we needed anything at appropriate intervals and gave us small cups of Sriracha (also known as the God's nectar).  He also offered us free samples of the house Tea, which taste like a cross between chai and awesome.\n\nA great visit with delectable food equates to what is probably the longest review I've ever written.  Thank you Darna Falafel, you made my NY trip!", "author": "Eric S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-13", "description": "I have been to Darna multiple times and never leave disappointed. Thought not totally  authentic Middle Eastern food, the wraps are quite good and filling. I have had the kefta wrap and the falafel wrap, both of which are tasty. The kefta wrap has sweet potato fries stuffed in it, which I thought was a clever idea. The falafel is just the right texture and the side salad is a nice touch. The sweet potato fries here are on point as well as the chipotle-mayo sauce that comes with it. I love the mint iced tea here! (Mint is delicious in everything!) Their Yemeni tea is also quite good and the overall low prices cannot be beat. The service here is great as well! Def worth trying out if you're looking for a less yuppie cafe and good food. The Arabic pop music was also a good selection, Nancy Ajram and Amr Diab, always fun haha.", "author": "Hasiba H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "I've never liked falafel so obviously I never have ordered it there.  I get their chicken sandwiches or their breakfast wraps. I get them without mayo and they are still very tasty!  Nice guys too.", "author": "Patale M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-22", "description": "Picked up their Lunch special - Chicken platter. Was not expecting it to be so awesome for under 8$, but I was surprised, Comes with Hummus ( better than I have had among last 5 restaurants in a month ) salad and well grilled chicken. I will surely go there some other time to try other options. Service is great. Seemed like a popular joint for take outs. While I was waiting for my order, The guy was busy filling up seamless bags.", "author": "Pluto G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-18", "description": "I was craving falafel before my dreaded trip to Trader Joe's so decided to give this place a try. I was very disappointed. The space is cute and intimate with fresh flowers on the table. I ordered the falafel plate and sweet potato fries. The sweet potato fries and sauce were the saving grace of the meal. The falafel plate comes with 5 falafel, a grape leaf, salad, hummus with pita, and tahini sauce. The falafel was alright, crispy but not a lot of flavor. I can't speak for the grape leaf because my boyfriend ate it. The salad was a sad mix of lettuce, olives, and what tasted like wishbone italian dressing. The hummus was so dry; very heavy on the tahini and definitely needed a lot more lemon. The staff there is very nice and accommodating. Unfortunately, they were playing terrible music at a very high volume; I felt like I was at a crowded bar trying to make conversation over my dinner. Think Nickelback, Christina Perri, and pretty much the worst music you can possibly imagine.", "author": "Rachelle V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "first time here. Neither loved it not hated it. Will definitely be returning though. I had the falafel platter, which was $7. No complaints about the price. The falafel balls were too hard on the exterior though.", "author": "Emmanuel I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-22", "description": "Used to live near it.  Love it....so clean and great food.  Nice staff.  Highly recommend.", "author": "tahanny c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-07", "description": "Absolutely amazing place !!! Kifta wrap and falafel are to die for !!!", "author": "Anita K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-21", "description": "The falafel is solid. The chicken kifta wrap is really good, and all the hype about the chicken BLT is completely warranted. The two brothers who own it are super nice, too. Also, I agree that the side salad is kind of useless - they suggested the french fries, and they were actually very, very good (who would have guessed?).\n\n(An update: after having the falafel again, I'd definitely upgrade it from \"solid\" to \"really, really good.\" Might be a depending on the batch kind of thing)", "author": "Holden B."}], "servesCuisine": "Falafel", "priceRange": "Under $10", "name": "Darna Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "200 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HQYl9gM-6aeJbh6skNtjcg/ls.jpg", "@type": "Restaurant", "telephone": "+13477991673"}