{"aggregateRating": {"reviewCount": 206, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "Awesome steak platter. Great portions and quality for price. Very nice people working here/", "author": "Matthew H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-31", "description": "The iced mint tea. The semolina cake. The chicken wrap with turkey bacon. \nThese are a few of my favorite things. \nA fine addition to the neighborhood. This is a small space with about 3 or 4 tables and is probably more of a take-out than eat-in. Friendly guys ruining it. Moderate prices. Tasty vittles. \nIt's a sammich go-to!", "author": "Rich B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-07", "description": "The breakfast wraps!!!!  fresh ingredients and well priced. Lots of healthy options and just a really nice neighborhood business. I had the mushroom with jack cheese and spinach wrap this morning and my day has started off with a happy stomach!", "author": "Kate S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-21", "description": "Their falafel balls are mediocre. The sandwich though is pretty sad, with barely any tahini sauce and just a few pieces each of tomatoes, cucumbers, and lettuce. The icing on the cake? The only hot sauce they have is sriracha, which is terrible on falafel.", "author": "Roopa K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "This was my first time trying Yemenite food. It was described as a mixture of Middle Eastern and American. Either way it's delicious. I had the chicken kifta wrap. It had a great spicy kick similar to buffalo sauce in heat. The wrap was seasoned very well and the fries were amazing. The staff was very pleasant and took time to explain the dishes which was appreciated plus they are all handsome men so BONUS!  I topped off the meal with the spiced Yemen tea which paired well with the flavors. The only thing that could have made this better would be a toasted pita vs a wrap.  It is something I would definitely order again though!", "author": "Mrs. Tk L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-27", "description": "The consistency of the food and service does not disappoint.\nTry the Chicken BLT or Hanger Steak Sandwich.\nThe staff remains some of the most professional, welcoming, and efficient I've seen in the industry.", "author": "Qas P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-06", "description": "My sister and I stopped into Darna Falafel while visiting a family member in Brooklyn. Our food came very quickly and it was priced well. The menu has a wide variety of things; I got a falafel sandwich, while my sister got a chicken sandwich. We both really enjoyed our meals. We also got amazing tea that I am still thinking about a month later.\n\nWould definitely recommend for a quick, cheap bite to eat.", "author": "Claire G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-18", "description": "Great people who work here. Great food. I live in the neighborhood so I eat here all the time. Only thing is the two times that I ordered delivery the food was soggy or they forgot something (this is probably because they can get pretty busy). So I recommend ordering in restaurant.", "author": "Cherrie A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-14", "description": "Amazing Staff, great service and great prices. Their Yemen tea is awesome, and so is Cobb salad. Usually just pick up or get food delivered from here. Place is kind of small. 4 stars because overall the food is average.", "author": "Sachin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "Nice, cozy space with the most beautiful flowers. Friendly, quick service. Last and most important, the food was DELICIOUS and FRESH! I had the steak platter and mint ice tea... Best ever!! Can't wait to try the other items in their menu.", "author": "M C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-12", "description": "Stale pita , mediocre chicken ! \nStaff was friendly but the food wasn't up to the mark at all . Yelpers really rave about this place but sadly we were disappointed .\n\nI don't think we will return .", "author": "Supriya K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-24", "description": "This place came highly recommended and the reviews seemed pretty good, for the most part, so directly after finishing our shopping at Trader Joes, we headed over to try their falafel. My boyfriend and I are big time falafel lovers, and he being from Israel makes his standards pretty high. We often disagree, but on this one we were in complete agreement: the falafel was a complete disappointment. The texture of the falafel was awesome but it was tasteless, as was the hummus, and the tahini also was very bland. Not enough garlic or salt for sure. Overall \"bland\" says it all. Won't be back.", "author": "Atty F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-27", "description": "My favorite little gem in this neighborhood!! The breakfast wraps, delicious!! Made fresh to order. Juices and smoothies, YUM!! Everything I've tried has been amazing and reasonably priced.  Definitely stop by if your in the area.  Oh and their customer service is top notch!  Always a friendly smile at the counter.", "author": "Yali C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Phenomenal little place . Falafel was fresh,green and excellent. \nThe owner is a wonderful American who was born in Yemen and his family has a rich and sincere history in the neighborhood. Great attitude and customer service.\nThe mint ice tea they make is phenomenal. \nTruly looking forward to future visits.", "author": "Al T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-24", "description": "The mint iced tea was so refreshing and delicious. I also ordered the falafel wrap, which was fresh, hot, and very filling. Definitely would recommend to people who are in the area. But make sure you bring cash because you can only use a card if it's $10 or more.", "author": "Jaja H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-24", "description": "The place is wow. Their fries are the best. Falafel is fresh. Sauce is booming, clean fast.  Will come back again and again.", "author": "Saddam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-16", "description": "We loved it. Originally from Belgium, we are used to eat good Gyro pita sandwiches. In Manhattan, we have our Greenwich Village Spot but we did not find our Brooklyn place until we came here.\nThe quality was excellent! The choice is great for everyone and whether you eat meat or are vegetarian.\nThe service was great and very welcoming.\nWe did rent a car for this destination and we would do it again I'm case of craving !!\nWe also recommend the Belgian fries and the Yemen tea !", "author": "Aef L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-16", "description": "1.5 hour wait for food that never came...6 calls each time I was assured it was coming...it was sent to another place. Had to go get it I my self...kid in charge who is obviously related to the owners would not look at me and gave me his back the whole time. When I complained, he told said, \"bro, I made a mistake, we all make mistakes\" and refused to speak with me again. The chicken platter we ordered was tasteless!", "author": "Echo Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "Just had the falafel here yesterday. It was your standard falafel platter, pita lettuce olives cucumbers, etc. I really liked that they had Sriracha. That's always a plus in my book. The falafel was good, but nothing special. I really liked the space, small but nice decor and a good homey vibe. I felt comfortable there to say the least. For the price, I'd say it's worth it.", "author": "Joelle C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-14", "description": "Ordered for delivery from Seamless. $5.50 Energy Boost Juice. $7.25 Falafel Salad. $3.50 Grape Leaves. Of all three, the grape leaves were the best. Not overly oily like you often get. Four of five of them in the order. The juice is good, but I'm unfortunately realizing I don't like beets. So that's out. Although this was a large size for a good price. Just my flavor preference. Now the salad is disappointing. The 5 small falafel were likely very hot when thrown on top of the salad. Because the lettuce, tomato, cucumber and olives are warm. Eww. And parts of the lettuce are wilted. Not appetizing. The falafel themselves are okay. I've had better. Not worth the price for sure.", "author": "Sarah K."}], "servesCuisine": "Falafel", "priceRange": "Under $10", "name": "Darna Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "200 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HQYl9gM-6aeJbh6skNtjcg/ls.jpg", "@type": "Restaurant", "telephone": "+13477991673"}