{"aggregateRating": {"reviewCount": 206, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-09", "description": "I work up the street and come here for lunch.  I've only ever had the chicken BLT and grape leaves, but its is so amazing I can't help but get one every time.  The bacon is turkey because they do not serve pork but decidedly deliciously smokey.  The first time I picked up food I was pleasantly surprised to see a small salad with a creamy yogurt dressing and black olives with the CBLT I didn't realize it came with anything.  This sandwich is one of the best chicken sandwiches I've ever had anywhere.  The staff is great, friendly and professional.  There is a skirt steak and blue cheese sandwich that I've been meaning to try if only the siren call of the CBLT wasn't so strong", "author": "Crystal L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-02", "description": "Cozy and friendly, this place has the greatest wraps. Delicious, clean and healthy ingredients - we come almost every weekend. VERY reasonable prices too.  One of our \"go-tos\"!", "author": "Elizabeth B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-30", "description": "Awesome! Best crispy falafel on the outside and moist on the inside. Baklava is beautifully not too sweet. Basboosa moist and not too sweet either. The mint iced tea is amazing!!!!", "author": "Farah S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-11", "description": "This place is TERRIBLE, at least for delivery. I have ordered from them 7 times and had issues with my order 6 of those times. I ordered from here for lunch twice and both times they called and said the delivery guy wouldn't be in for another half hour, which made me wonder why they were accepting deliveries on Seamless. Most times the order sent is wrong. Most recently they sent a chicken sandwich, which I cannot eat as a vegetarian. The worst part is that when we called to tell them they said they could send the right order but it would \"take a long time\". The food is decent at best and definitely not worth the terrible customer service. I guess it's my own fault for continuing to order from them, but I will never do that again.", "author": "Natalie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-24", "description": "Great food!  Highly recommend.  Love the Kifta Wrap.  The place is small, so best for take-out or a quick sit-down lunch for 1 or 2.", "author": "Steve R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-08", "description": "They have some very decent falafel here. It's not burnt.. it's not overly spiced... it's just perfect. Will go back for more", "author": "Sera A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-07", "description": "Imagine you're in the middle east. You've been on a camel in the scorching sun for 4 days with very little water. Then, out of nowhere, can it be...yes, yes it is, it's a Kifta Wrap.  Such was my experience after a long shwarma drought.  It was juicy, the chicken was well seasoned, and the vegetables fresh.  My only complaint would be that the wheat pita was a bit dry and cracking. Overall though, nice people, terrific food. I didn't get to try it, but the falafel pieces are plump, very tender on the inside and looked delicious.  Whatever you get, I recommend adding the hot sauce they give you on the side, it's not very hot but adds a nice flavor.  Seating wise, there are a few two person tables and a bench along the wall--rethink hosting your sweet 16 at Darna Falafel.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-10", "description": "I've picked up take-out orders here a few times and am always really pleased with flavor profile and attention to detail. (I'll fess up, I'm that girl with the complicated order.) The guys who work the counter here are genuinely friendly. Despite my complicated order. I haven't dined in; don't know that I would. The music playing is usually too loud to hold a conversation or get any reading done, and at lunch time, I want to be able to do one of the two.", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-24", "description": "Just had the Chicken Kifta and the falafel wrap and I don't have the words to express the flavors, textures... Just outstanding. For the quality of these obviously freshly prepared sandwiches full of good ingredients I think it was an incredible value. Cute place, friendly service, amazing food. Highly recommended.", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "This place is adorable and the food is great. I just ate the Darna Falafel sandwich and it was so tasty. I also had the fresh mint iced tea, yum!   The guys are really kind and there are good photos on the wall with descriptions. Happy belly and happy mind", "author": "Ally J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-16", "description": "This is a welcome new addition to the neighborhood. Food is delicious and the portions are very generous.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-05", "description": "Solid, affordable food, and super-friendly, helpful staff.", "author": "Todd S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-22", "description": "If I actually opened up my laptop to write a review, you know that the place was either amazing or it sucked, because I don't waste my time unless I vehemently feel people have to know what the deal is with a restaurant.  \n\nVerdict - Darna is hands down the best new addition to the neighborhood.  Their chicken BLT is seriously addictive (I have to actually prevent myself from choosing to have it for dinner too often since I'm trying to keep more variety in my diet).  I don't think they're adding crack, but you'd believe it if they told you that it was an ingredient.  Their fries are seasoned perfectly and the quality of the food is spot on.  I am strange about chicken and meat in general  (I don't like processed meat or gristle) and trust their chicken to be top quality.  I have actually made plans with friends from all over to specifically come and try this place for dinner with 100% positive results.  Try this place out.  You'll be hooked.", "author": "s b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-07", "description": "If you live in the Heights, Cobble Hill, Boerum Hill or Carroll Gardens, Darna is really worth the walk. They do falafel right, not greasy and seasoned properly, and they have excellent, well-prepared, super-fresh tasting other dishes as well, like kebabs and the expected hummus. I think a falafel wrap with a salad for under $9 is a bargain. And they don't skimp on fresh ingredients, eithter. The fries are awesome, they serve D'Amico coffee, and they now serve breakfast. And best of all, all the guys who work there are really pleasant and polite, like they appreciate your business. Refreshing, huh? It's like they take nothing for granted. That's why I'm a weekly customer and I'm spreading the word.", "author": "David S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-12", "description": "Darna gets a lot of love from me both for food and service. Everyone I've encountered is super friendly, helpful and knowledgeable. \n\nThe breakfast sandwiches (ciabatta, goat cheese, caramelized onions, egg, delicious mayo spread) are fantastic, as are the lunch sandwiches. The falafel sandwich comes with a small salad for only $5. Add a side of hot sauce and it's a perfect lunch! \n\nHave yet to try the baklava; I will soon.", "author": "Trish F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-18", "description": "if falafel could kill, i'd be dead right now. slash maybe i am, as i feel like i am in a falafel-induced heaven. in case you were wondering, their falafel is really good.", "author": "julia r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-05", "description": "Best falafel on Court Street!  Excellent mint tea as well.", "author": "Rocco G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-22", "description": "just AMAZING! food is delicious,smiles once you step inside, beautiful pictures and art. You feel very welcomed. i saw Darna from across the street.The food is fresh, you can just tell. If you are ever waiting for a \"10-12\" minute skirt steak sandwich, its worth it! Don't forget the mint iced tea. YOU GOTTA HAVE THE MINT ICED TEA! mint iced tea is like the icing on the cake.  So far i had the kifta wrap, skirt steak, Chicken BLT, and felafel wrap and they're sooooo good! and all the sandwiches come with side salads too which i think is a great deal, you don't get to see that in many small togo food places. At first i thought they were giving me a side salad on the house but then i read on top of the menu, \"(all sandwiches come with side salads)\" lol.  Oh and they also have daily specials. I'm going to try that chicken apple sausage with grilled tomatoes, caramelized onions,  and chipotle mayo one day. that sounds really good. My friends love this place and my coworkers added Darna to their \"Good places to eat \" list. Glad to have you in the neighborhood Darna. Keep up the good work :)", "author": "david r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-06", "description": "I had the best falafel EVER here. The wrap has portabello mushrooms and red pepper which I think added a touch of imagination to the basic falafel with lettuce tomatoe, etc. Welcome to the neighborhood!", "author": "Karen W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-09", "description": "Darna's fine if you don't mind eating whatever someone serves you. If you have any dietary restrictions or preferences, avoid. TWICE I have ordered something whose contents described on the menu are dairy-free, only to find yogurt dressing and feta cheese all over it. Why have detailed descriptions on your menu if you're just going to throw whatever you feel like in there? Plus, the falafel is just not that flavorful and was pretty hard.", "author": "Aqua W."}], "servesCuisine": "Falafel", "priceRange": "Under $10", "name": "Darna Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "200 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HQYl9gM-6aeJbh6skNtjcg/ls.jpg", "@type": "Restaurant", "telephone": "+13477991673"}