{"aggregateRating": {"reviewCount": 206, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-01", "description": "This place is amazing. I eat here whenever I have a chance to. Sometimes I will even stop here on my way to Manhattan to eat. The chicken BLT is the best in the city. But what really makes this place stand out is the customer service. These guys will go above and beyond to make sure your experience is as pleasant as can be. 6 stars out of 5", "author": "Bovice B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-24", "description": "stumbled across Darna a few days ago - had the Kifta wrap and it was absolutely incredible. definitely will be back soon.", "author": "Richard H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-29", "description": "just had delivery so far and it's reliable.  good falafel wrap and falafel salad, got a nice chicken wrap and i'll order from here some more in the future.  hope they keep it up, it's good, decent food in the 'hood.", "author": "Lucia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-19", "description": "I've been here enough times to have been served by everybody multiple times and this is, without a doubt, the friendliest service in the neighborhood.  That alone gets it 5 stars.  But it's also tasty food at reasonable prices.", "author": "John F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-28", "description": "This is my first review on Yelp (although I turn to Yelp for reviews all the time). Just wanted to say how nice everyone at this restaurant is -- which gets huge points in my book. Today, I ordered their skirt steak sandwich and it was hands-down INCREDIBLE. These days, when I'm paying way-too-much for way-too-mediocre food way-too-often, I gotta give a shout-out when I find a place that is reasonably priced, great service and fantastic food. Darna seems to be all of these things. Can't wait to get that steak sandwich again. Good God.", "author": "Matt O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-18", "description": "great wraps. the skirt steak is better but the kofta wrap is good too. the super organic ginger ale with the ginger in it is great with the wraps.", "author": "Mamunur R."}], "servesCuisine": "Falafel", "priceRange": "Under $10", "name": "Darna Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "200 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HQYl9gM-6aeJbh6skNtjcg/ls.jpg", "@type": "Restaurant", "telephone": "+13477991673"}