{"aggregateRating": {"reviewCount": 206, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "Everything on the menu is delicious, fresh, and won't break the pocket. A really great place to get a healthy lunch. I recommend this place to anybody that's around the neighborhood. On top of everything else they always have a  good vibe with good music and the guys that run the place are always cool.", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-12", "description": "Chicken kifta wrap was filling and full of flavor. Definitely appreciate the addition of french fries inside the sandwich. \n\n Falafas was good. Service was really slow when I was there. The side salad they give you with every order is a throw away.", "author": "J A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-19", "description": "Ordered delivery online and the food was delivered quickly. The food itself was hot and delicious. Had the lamb shawarma! Falafel was yum too", "author": "Candice R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "Good food for an even better price! Falafel pita was good - standard, nothing new. Lamb gyro plate was great and tasty. Would definitely go back, for the price if not anything else!", "author": "D L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "Omg!\n\nWe had Lamb and Falafel Plates. OMG. The lamb was so soft, so delicious, just couldn't get enough, the falafel wasn't bland either!  Hummus, salad came with both order and all was so great. The hummus was very smooth and creamy, the service was very kind and great. Sure we will be back!  We ate inside, but there is some place outside too where you can enjoy a great, tasty lunch for an excellent price! \nOh, I almost forgot! Try the Baklava! Won't regret it. ( no worries, the scale won't show it either:) )))))))))))))", "author": "Mint R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-17", "description": "I love Darna!!! the employees are some of the nicest in the city, the chicken blt is out of this world, and must be accompanied by some falafel \u0026 the MINT ICED TEA. OH GOD DO I LOVE THAT TEA.", "author": "Pat F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-15", "description": "the Chicken BLT was solid!! def gonna try the other items on the menu next time! they even have my favorite brand of coconut water there! Taste Nirvana!! ;)", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-09", "description": "Love their falafel! This quickly became my favorite middle eastern joint in the neighborhood. The super friendly staff make great recommendations. The place is tiny but there's usually a free table if you don't want to take the food to go. Their kitchen looks so small we were wondering how they manage to make so much delicious food back there when we saw what looked like a middle eastern grandma delivering home cooked food to the restaurant, so now you know it's authentic.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-24", "description": "First time, AMAZING!  I had the kitka wrap! Delicious! My friend had the roasted veggie, she loved it! Small place, 2 tables, 4 stools. It smells amazing when u walk in... Lots of homemade drinks, and tea and coffee, Sumatra coffee was also yummi. Will not be disappointed, stop in for your next bite!", "author": "Doreen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-26", "description": "Tiny place, EXCELLENT food. Don't miss the chicken kifta wrap, and the falafel is great, whether in a wrap or on a salad. They often let you try samples of their various hot and iced teas. Don't miss the french fries! Really great place. Inexpensive. Simple.", "author": "David P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-12", "description": "If I could write a sonnet to this place, I would.\n\nI've been searching everywhere for good falafel--like, really good falafel that makes you rethink your carnivorous tendencies; delicious, crispy-yet-tender falafel that makes you wish New York's public indecency laws were a little more giving so you could throw it down on the table and make love to it right there and then; falafel so extraordinary that you hold it in your hands, look it in the balls and say forcefully: \"Falafel, I need you inside me.\"\n\nIf I lived closer, I'd be here multiple times a week. The guys who work there are so nice--and might I add cute? Well I just did, so there. They're running a great operation, and I'll keep sending everyone I know to try their stuff. Next time I've got to try the kefta. Pretty much any food that you can refer to as \"balls\", I'm all for.", "author": "Allison S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-05", "description": "This is fabulous middle eastern food, and more! I discovered this one through yelp, and I am glad I listened to the reviews. I had the Falafel supreme wrap (with caramelized onions, feta, lemon tahini and roasted peppers yum!) which was wonderful. The falafel was so fresh and actually tasted like authentic homemade falafel.  I recommended the the Chicken BLT to my BF, who said it was the most delicious thing he has eaten in a while. The seasoned fries are delicious although quite heavy on the stomach. Even the baklava was very nice. I find so many places cant get baklava right, and serve up stale dry/ walnut patties; but not Darna, the baklava  was fresh delicate and had that rosewater taste to it, which I love. \n\nThe prices are excellent, 8 dollars gets your a pretty large and filling meal.  Definitely recommended \u0026 we will definitely be returning.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-29", "description": "Yum!\n\nEver since Olive Vine became Palmayra, I've been down a place with really good falafel and hummus. Zaytoons is OK and all, but again, their dry falafel just really isn't my taste.\n\nEnter: Darna. The hummus is legit, and a side of that with two pitas will only run you about $3.  But, then you'll have to get a side of falafel (because they don't have a platter with these two things together... which is weird to me) for another $3 (for 5 pieces), which is totally worth it because it falafel is DAYUM good.\n\nBe prepared to wait a while, especially if you order the steak sandwich (which you should because it is also DAYUM good) but trust that the wait is worth it-- especially in such an adorable little space.", "author": "Amber S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-21", "description": "waited an hour and a half for delivery only to call and learn that it was cancelled due to the delivery person not knowing how to use a doorbell.", "author": "Christopher M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-06", "description": "Only had their take out, and honestly I have no idea what the place looks like.  \n\nThat said, I like this place.  Delivery is reliable, and they take credit cards(!).  The boyfriend really likes their falafel sandwich.  I am addicted to their homemade mint tea.  The serving size of french fries is on the small side, and I truly dislike the \"salad\" that's on the side of the entrees.  That said, they are a nice addition to my take out rotation.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-02", "description": "Not much to say, but I simply love their sandwiches. The Kifta chicken, the chicken BLT and a the Darna falafel. The falafel salad is also good.\n\nSandwiches come with a little side salad which underlines the quality.", "author": "Roel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-09", "description": "Amazing food,decor, and service. Our sandwiches were fresh and delicious, and will definitely be back.", "author": "N A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-02", "description": "I eat here almost 3-4 times a week. The food is really fresh and yummy, prices are affordable and service is great.", "author": "Andrea B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-01", "description": "I think Darna is great place to eat. people are very friendly, prices are very reasonable and food is very delicious.", "author": "Bilal S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-07", "description": "That was THE best lamb gyro I have had in NYC/Brooklyn! The lamb was deliciously seasoned and cut into juicy chunks. Yum!", "author": "Sarah M."}], "servesCuisine": "Falafel", "priceRange": "Under $10", "name": "Darna Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "200 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HQYl9gM-6aeJbh6skNtjcg/ls.jpg", "@type": "Restaurant", "telephone": "+13477991673"}