{"aggregateRating": {"reviewCount": 206, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "I live within walking and decided to stop in for quick dinner before hitting the books.  This has proved to be the best decision I've made this week.  \n\nI ordered the Kifta Wrap to stay and not a minute after I had sat down, a beautifully plated wrap cut on the bias was placed before me.  The Kifta wrap came with a side salad and cucumber/yogurt dressing what was extremely refreshing.  \n\nService was more than welcoming and made it an really nice experience.  This was much appreciated and unexpected.  Considering the quality of food, service, and value, I'd be happy to come back again soon and would recommend to others", "author": "Luc D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-01", "description": "Best iced tea I've ever had. \n\nBEST ICED TEA I'VE EVER HAD. \n\nAlso recommend the avocado egg wrap for a weekend breakfast. Delicious and fresh! Plus the people who work here are always incredibly nice and friendly!", "author": "Danielle Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-05", "description": "This is a pretty solid restaurant for sandwiches and smoothies. I had the chicken wrap, and it was very good. The french fries inside were a nice surprise. The seating is very limited with only three or so tables inside, and a couple of benches outside. The only downside to my experience was that the guy behind the register came out to have a smoke, and I didn't see him wash his hands before he started working again.", "author": "Lara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "I walked in on a whim and got the Kifta Wrap which had spiced chicken, fries, lettuce, tomatoes, tzatziki sauce, and chipotle mayo. I also got the hummus and warm pita bread. Those two items came out to 11 bucks which isnt bad. I also had a Yemen tea which was sampled before i ordered. Before I left, I ordered one piece of baklava for home which I regret because I wish I bought more:(. Everything was delicious!", "author": "Giovanni D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-20", "description": "Be forwarned, this is a tiny shop with only a few tables so it's really best to get delivery or take-out. The service I got here was great as was the food. The portions were a little smaller than I had hoped for but overall I was pleased with my Darna experience. \n\nMe and a friend went here and I ordered sandwiches. I ordered the skirt steak sandwich (about $9), which is topped with blue cheese and caramelized onions and is served on toasted ciabatta bread with a side salad. It was a great sandwich but was smaller than I was expecting. My friend ordered a special sandwich of the day, a hanger steak sandwich. They told us they only had enough steak for one sandwich so she ordered a chicken BLT (chicken, avocado, turkey bacon, tomatoes, romaine lettuce and chipotle mayonnaise on ciabatta bread). Which was bigger (and a dollar less) than mine. It also came with a side salad. She thought it was great.\n\nMy question, which I didn't feel like asking is: If one was a skirt steak sandwich and the other is hanger and they said they only had enough steak for one sandwich but didn't say which. They had to be lying about one, which one did I eat? It doesn't matter too much, just an observation. The other observation is that my sandwich also had some sort of chipotle mayo or something on it, something I would have asked to do without had I known it came on it. Regardless it was tasty. \n\nWe also ordered a side of sweet potato fries which were good and tasted homemade.\n\nUPDATE: I've gone back for their namesake falafel. You can get a side of it for $3. You get 5 very big balls made to order. It was perfectly crispy outside and light and moist inside. I've definitely had more flavorful and better falafel at Mamouns but they did a solid job none the less.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-30", "description": "Lovely place. The chicken kifta wrap is where it's at. A few bites into it, I realized that THE FRIES WERE COMING FROM INSIDE THE WRAP. I glanced over the description and ordered it with a side of fries instead of a salad. BUT GUESS WHAT? I DIDN'T CARE. Because it was all so good. The fries also come with chipotle mayo, which was quite delectable.\n\nAlso tried the chicken BLT. Found it a little too dry (the Halal-friendly turkey bacon was also probably partly to blame).\n\nThe staff is super friendly. Service is quick and they accept credit cards. Prices are fair, and it's a quaint little shop with benches outside (not so useful in the winter, but I bet when summer rolls around, it'll be a full house!)\n\nI still need to try the falafel. The menu just has too many other tempting items on it! If you're in the neighborhood, give Darna a shot!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-24", "description": "This was my spot for a year when I lived in Cobble Hill! If you're in the mood for a filling wrap or sandwich, come right here for the spiced chicken kifta wrap or the skirt steak sandwich. Savory and satisfying! And if you're still hungry, get a side order of fries. For dessert, get some baklava, or for something different, try the banana date smooothie. Yum! I can't wait to stop in when I'm in the neighborhood.", "author": "Kevin R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "Cute little place with delicious food!  Customer service is great! Got the steak platter and enjoyed every bite. Would definitely come back. Highly recommend.", "author": "Rita F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-08", "description": "Not sure whether 4.5 stars are merited, but it is a consistent place with decent falafel and sandwiches and service with a smile. This was my second visit. \n\nFalafel is good, not the best I've had.  It's a bit dry. They had sriracha out for hot sauce - I would have preferred homemade hot sauce, or harissa - something a bit more neutral.  The hummus was on the thin side, more like a sauce.  I guess that's to balance out the dry falafel? \n\nThe salad which accompanied the falafel platter wasn't fresh, with lots of pink spots on the lettuce bib.  Dressing was tasty though.  \n\nThe falafel wrap was nicely done, but again, dry.  The carmelized onions and veggies were a nice touch, though.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "amazing food and amazing service to match; we found this place by chance while looking for a healthy spot for lunch. Middle Eastern / Mediterranean food is usually a safe spot so fortunately we found Darna. It's a small spot but WELL worth the wait for a seat. I ordered the falafel platter and my girlfriend the steak platter- both delicious! Will absolutely be going again when I find myself in the area!", "author": "Tina A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-25", "description": "Ordered delivery at 6:16 pm through seamless. Got the confirmation at 6:21pm that the order would be here between 6:55pm - 7:05pm.  Never received anything from anyone. Decided to give Darna the benefit of the doubt since it was raining and maybe they were busy. I called and inquired about the order. Mo the person answering the phone replied there are no orders active.  Then checked and said there is an order but, it did not print out not that there were none active. \nShit happens but, it is 2017 if you do online delivery get it right so people who want to try your food for the first time during work aren't stuck with no food or information about it. No offer to make it right away or any attempt to fix the situation. TLDR \nCALL AND CONFIRM THEY HAVE YOUR ORDER or you will be stuck HANGRY.", "author": "David C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-30", "description": "Meh. Dry falafel, bland hummus, salads directly from a bag. Nowhere near as good as the ratings on Yelp suggest.", "author": "Ben S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-09", "description": "Just ate from here chicken platter was so bland. How does the chicken look like it has spice and when you eat it theres no taste?  The only food off my platter i ate was the salad and some hummus. Maybe it was a bad day.", "author": "Ashfa K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-21", "description": "First and foremost, the food is awesome. The falafel is quite good, as it should be when it's up there in the name. However, I think the chicken kifta sandwich is even better. Spiced chicken, lettuce, tomato, fries, tzatziki AND chipotle mayo in a wrap? I'll never say no. It is very, very tasty, and the fries give it a nice body. \n\nThe best thing I've eaten here so far though? The Chicken BLT. Just do yourself a favor and get this absolute bomb of flavor. And all the sandwiches come with a nice little salad (black olives!) that makes you feel slightly healthy.\n\nThey make a surprising variety of items as well: Caesar salads, Cobb salads, sides, stuffed grape leaves, Belgian fries...even a couple bagels. It's a good mix of traditional Middle Eastern and new American classics. Next up, I'm trying that skirt steak sandwich (blue cheese, caramelized onions and ciabatta).\n\nBut beyond the food, I really, really like the staff here. I have reasons. They are threefold (so far). \n\n1. They are just so nice. Always smiling, always making sure you've got everything you need. The way it should be.\n\n2. Every time I get change, the dude gives me a stack of singles like he wants me to go to the strip club with him. I'm sorry Darna Falafel Guy, but I'm in a committed relationship. Thanks for the invite though\n\n3. One time I was waiting for my sandwich, and one of the Darna Falafel Guys confronted a litterer. This crackhead* threw his empty bag of Cheetos on the sidewalk, and the DFG demanded he pick it up. Personally, I don't think it was the best move, if only because DFG immediately got bits of Cheeto spit all over him as said crackhead went nuts, but props to DFG for standing his ground. Because I'm not going to lie to you, when I saw this happening, I got out of the spit radius right-quick. \n____________\n\n*When I say crackhead, I mean that in the literal sense. This man smokes crack on the regular. Sure, I haven't actually SEEN him smoking the crack, but that's only because I've cleaned up my life lately.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-27", "description": "Okay, I love this place. I didn't realize it's existence until far too late in the game. Super affordable with delicious breakfast wraps, served whenever you want them, as well as amazing platters. Loved the gyro one! And the smoothies are just the best. Hangover Cure is my absolute fave. Everything always tasted fresh and was well prepared and the staff is very kind and friendly to boot. I'm really glad I stumbled upon this little spot, even if I didn't get to spend too much time there before I moved out of the area.", "author": "Kelsey B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-26", "description": "This place is excellent! I got a coffee (which is as delicious as fancy coffee places, but priced at bodega levels) and the Cobb salad. It was great, and the menu left me excited to get more. The staff is very friendly, and the food all looks (and tastes) wonderful. Also, if you're a turkey bacon lover like me, or if you don't eat pork, know that typical bacon dishes are made with turkey bacon here! 5/5", "author": "Rana L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-28", "description": "What a busy little place on Court Street. Food was great. Had the Falafel salad plate for $7.50. Huge amount of food: olives, tomatoes, cukes, falafel, Romaine lettuce, feta cheese and tzatziki  dressing. Peta too. Their Mint Ice Tea was so good!  This place also does lots of juices and smoothies. No wonder the place is packed!", "author": "Brownstone P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-30", "description": "Honestly, I'm kind of confused about all the amazing reviews. The falafel was dry, hummus a bit too thick, and the rice was flavorless. Chicken was seasoned well but, sadly, also dry. What gives?!\n\nI thought prices were dirt cheap, but I expect better--even food carts top this stuff. Sorry, Darna--you're just not doing it for me.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "I wanted to try the smoothies in carrol gardens and I stopped into here. Really great atmosphere, friendly workers and very tasty smoothies. I had the happy mango and it was Delish. I plan on heading back for some food. Let's see!", "author": "Nathline C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-10", "description": "Delicious, fresh food. Kind \u0026 friendly service. Great price and cozy ambiance. Will be back! Also, their falafel is gluten free and SO good.", "author": "Molly D."}], "servesCuisine": "Falafel", "priceRange": "Under $10", "name": "Darna Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "200 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HQYl9gM-6aeJbh6skNtjcg/ls.jpg", "@type": "Restaurant", "telephone": "+13477991673"}