{"aggregateRating": {"reviewCount": 206, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-26", "description": "Before Darna I didn't think I liked falafel-turns out I just never had falafel this good before! \n\nI can't seem to walk past without getting a Darna Falafel sandwich, even if I don't think I am in the mood I am incredibly satisfied. They give you a side salad and the stuffed pita for $5 even-a great deal for a hearty lunch. They offer whole wheat pitas that still taste as good as the original. Lastly, the sandwich is stuffed with 4-5 crunchy and not greasy falafel along with lettuce, tomatoes and a great tahini. The last time I went they put so much tahini and it made me realize just how perfectly creamy and savory it is. I always try to eat half and save some for later, but this never happens. Add just a teeny bit of their hot sauce and the taste is totally elevated.\n\nI have dined here and that was cool but there are only a few tables, although it never seems too crowded. I prefer takeout, they don't take long to get your food prepared and I have always had friendly service. \n\nThey also have some nice Mediterranean teas to complement your meal. What a welcome addition to the area.", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-28", "description": "I love you, Darna. I would eat here everyday if I could. \n\nI'm not vegetarian, but I would highly recommend the Roasted Vegetables Sandwich (roasted peppers, romaine lettuce, goat cheese, and portobello mushrooms in ciabatta). I am also a fan of the falafel and the chicken platter over rice. I also love their baklava. The don't actually make the baklava in-house, instead they have it delivered from a bakery. But, it is amazing. It's worth the $3 to get the whole baklava.", "author": "James W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-12", "description": "Look I don't want to start off a 5 star review on a controversial note but their falafel (their namesake falafel!) is not my favorite - a little bit too heavy and deep fried, for my taste. Point being: if all you've ever had here is the falafel (which would make sense what with the whole aforementioned namesake) and don't love it, definitely give this place another chance! \n\nThat said basically everything else I've had there is perfect. Their platters (at under $10) are some of the best - and most delicious deals around. Their sweet potato fries (premised on this wacky concept that maybe, in a future utopia, more restaurants will pick up) actually taste like well cooked, good ol' fashion sweet potatoes! Their salads are super fresh and their mint ice tea (often given out as free small samples by the incredibly nice and helpful cashier/waiter) are exactly what you need on a hot summer day.\n\nSure space inside is a little tight - there is seating for maybe 8 people - but there's also a small area outside that seems nice when the weather isn't too oppressive. There also seems to be a bathroom in the back past the kitchen, which is a much appreciated rarity in places this tiny. My only complaint the last time I was here was that it was way too hot inside - maybe they hadn't set up their AC back in early June - but they seemed to have fixed that today.\n\nAll in all one of the truly great, and super affordable Mediterranean places in the area. Can't wait to come back and try one of their fresh juices and some of their desserts!", "author": "Ian B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-13", "description": "Ordered lunch for pickup. Chicken Kifta wrap is good!", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "I ordered a chicken kofta wrap and a side order of yellow rice for the first time from here. The rice was okay but the wrap was amazing!!! It was one of the most delicious wraps I have had in a long time. The prices are also great and you get a good amount. It was delivered pretty fast since I am close to it and I can't wait to try the other wraps/platters.", "author": "Samira A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "Great food and not too expensive.  Great lunch spot that feels real in a neighborhood of over-designed generic hipster joints.  Yemen tea is great.  Very friendly staff and that's not a given these days.  Pay then a visit!", "author": "Malcolm B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "The food is SO freakin good.\nThe chicken platter, hummus, sweet potato fries, baklava and mint tea were all delectable.", "author": "Rachel O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Great lil spot . Best egg wraps in town . Awesome sandwiches . Caring owners !   Highly recommended !", "author": "douglas g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "Consistently the best food in Cobble Hill. Everything is special, these guys do a dynamite job.  Except when they run out of Belgian fries.", "author": "chuck s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "I finally gave this place a try after hearing so much good things about it from my homegirl- anyways \n\nI ordered and egg BLT for myself and she ordered a falafel whole wheat wrap- both were delicious and my eggs were cooked lovely!\n\nI also ordered the sweet potato fries that were so freaking addictive! There chipotle mayo was slamming as well\n\nI always got myself a hot Yemeni tea- that alone did it for me- didn't need no sugar or milk- just perfect \n\nThe place is super cute for like about 2 people to just have a sit down lunch or dinner!\n\nI deff am coming back for those fries and the tea!\n\nMUST TRY P.S. The person who took my order was very patient with me as I am very picky with my food \n\n-great customer service :)", "author": "Bedor E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "I absolutely love their Kifta wraps. My people, once you take a bite out of the wrap your taste buds will rejoice in ecstasy. I pair it with their mint iced tea and I was in heaven. I even took 2 to go (and one was devoured on the train, I couldn't wait).", "author": "Wilson G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-17", "description": "What in the world is this glorious place doing OUT of my neighborhood?!\n\nLet me just tell you the perfectly prepared meal I ate tonight.\n\nThe Darna Falafel. Each component of this sandwich had a delightful flavor. The pita pocket and tahini was some of the best I've had in Brooklyn and all of the city. I also ordered sweet potato fries (because I judge restaurants based on whether or not they can accomplish a great sw potato fry!) They were perfect. The serving size was generous. I was happy.  Because I was feeling particularly greedy, I also ordered the chicken shish kabobs.  Moist, flavorful and served with a colorful assortment of peppers.\n\nOh, PS...this was delivery. I can't wait to order again!", "author": "Shayla C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-17", "description": "Not sure why people love this place. I've only been in once, and only had falafel, but I was unimpressed.  I'm gonna give an extra star Because the guy there was super nice, but I have to take a way another star for the following: I asked the guy if I could wash hands, and though he was super nice in accommodating me, but I was alarmed that they didn't have any soap!  I was also annoyed at some of the friends that stopped by and comported themselves like there were no customers present.  That kind of thing isn't cool.", "author": "Craig Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-09", "description": "YES! YES! YES! You beautiful delicious SOB! I thought, how good could a plain Chicken BLT really be? Well, it can blow your face off, literally. I have no face. It was spiced to perfection, creamy with avacodo goodness, bacony with nice cuts of bacon stripage, and fresh with soft yet crunchy foccacia. I CAN'T WAIT to try the chicken kifka! Kifka! I just like SAYING the words knowing I'm going to be in food bliss shortly. Rock on my Darna friends, rock on.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-26", "description": "Super delicious and cheap! Small place (a few tables), friendly service, and the falafel was sizeable. Oh, and get the belgian frieds ($3), they come with sauce and are super delicious. I'm drooling right now jut thinking about them. I'll definitely be back when I'm in the area.", "author": "Samantha A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-16", "description": "This place is Awesome food Tasty and well priced\n\nI tried the Chicken BLT , WOW!!!! Taste is amazing will be coming back soon", "author": "Geoffrey H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "The only complaint I have is that I don't know how to decide what to order. I got the kifta wrap and my husband got the chicken BLT. They were both AMAZING. As soon as we walked in the guy behind the counter greeted us with a sample of the mint tea (SOLD) it was so refreshing and just sweet enough. The service was so friendly and swift. Definitely will be frequenting this spot", "author": "Elena M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-26", "description": "This place is so good. The food is so fresh. Best lamb I've had. Excellent quality. Very cute place. Very affordable. Love it. Want to come back.", "author": "Evelyn R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-27", "description": "The falafel in my sandwich was incredible dry and had a sandy consistency. I will not go back.", "author": "Nancy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-22", "description": "I stumbled in to Darna on a Friday afternoon. I was in the area taking care of business and starving. I yelp searched \"Falafel sandwich\" and low and behold about 6 blocks away was this spot.\n\nI took the short walk and enjoyed the scenery. As I spotted the quaint spot complete with bench chair out front I walked in and was greeted kindly by an employee. I took a second to look at the menu and ordered the first thing I saw with the name falafel in it. The falafel wrap sounded delicious with roasted red peppers, caramelized onions, romaine, portobello mushrooms, and a tahini side salad. \n\nAll the reviews say the little salad was nothing to write home about. It was decent to me. Not a fan of black olives so I ate around them but otherwise the salad tasted fresh and was a perfect little side treat to go along with the wrap. \n\nNow the wrap was amazing! Aside from the little bit of paper I ate because I was too eager to fully unwrap it, it was tasted. The multigrain tortilla it was wrapped in was slightly crisp and perfect. The falafel had the perfect crunch and was nice and soft on the inside. I haven't had meet in nearly four years and I was scared that I may have been eating chicken or something. It was so flavorful and filling that something had to be up. Nothing was though! It was perfect. They even served it to me on a cute little plate. \n\nThey have all these cool pictures on the walls and trinkets hanging around to hip you to the culture and the music was funky and fun.\n\nI totally enjoyed my meal here and at $7.50 it was almost a steal.", "author": "Brittany A."}], "servesCuisine": "Falafel", "priceRange": "Under $10", "name": "Darna Falafel", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "200 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/HQYl9gM-6aeJbh6skNtjcg/ls.jpg", "@type": "Restaurant", "telephone": "+13477991673"}