{"aggregateRating": {"reviewCount": 55, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-08", "description": "We visited Gotham Market in Brooklyn on a Friday afternoon around 2PM. It was still very busy. Since there were three people in our party, we all went our own directions for our food. Luckily, since It is a food court-type format, we could all find a neutral location to sit and enjoy each other's company.\n\nI had the crab grilled cheese sandwich from Crabby Shack. It was so good and very filling. I was only able to finish half the sandwich! One draw-back:  it is VERY GREASY! Buyer beware! Their special house tea made of yummy ingredients including strawberries was ABSOLUTELY ADDICTIVE!!! Loved, loved, loved it! $17 for sandwich and tea.\n\nAnother person in our party chose pizza from Apizza Regionale. He was able to order the lunch special which was $12 for an individual pie and a side salad. The pizza was approximately 10\" diameter and had ample toppings. They will additional toppings to one of their specialty pizzas--no problem.\n\nThe final person in our party chose a BBQ brisket and ground beef burger from Mason Jar. The serve specialty beers. The one we sampled was good. The burger came with slaw and pickles. And LOTS of yummy smoked brisket. Wow! Tasty! The price was a little high for not-so-much food, but it was still excellent.\n\nSince the Market is in Brooklyn, I cannot vouch for parking. I'm sure there is little-to-none, but I could be wrong. We took the train from Queens to Brooklyn. The Metro station is not too far from the Market. I would definitely go back if not only to get some more of that tasty iced tea from Crabby Shack \n\nRestrooms were ample and clean. Complimentary water offered to all by the Crabby Shack stand.\n\n4 of 5 Stars because it is a little congested and confusing--and a little on the expensive side for what is considered fast food...", "author": "Robin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "I cannot get enough of The Ashland Gotham Market. I've frequented about 3 times now and every time sort of gets better for me. Food options are limited if you choose to sit in the main area -- you have the choice of pizza or chicken (until they bring in a new vendor in place of the Crabby Shack). The wait staff at The Ashland always do such an amazing job making sure we're good, our glasses are full and our table is cleaned of any trash and trays. I'm a fan of the whole communal eating vibe and I always end up leaning over and chatting with someone during my visit. Yes, I'm THAT person. The music selection is totally on point. They were spinning old school hip-hop and R\u0026B when I visited and that took the night up a notch. This is my new favorite hangout (and perfect date spot).", "author": "Lauren P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-18", "description": "Yet another generic overpriced food court, what is New York coming to? Just because you have exposed brick doesn't change the fact that it feels like I'm in a shopping mall.  While some of the food offerings have been good (I love crabby shack), the atmosphere makes me feel like I'm at the airport. I don't think the space is designed for any sustainability for the food vendors too because they want places to rotate out often.  I recommend reading the New Yorker article titled The Inflated Promise of the American Food Hall which sheds light on the racket these places are in and how it does not benefit restaurant owners or consumers.  Make it stop Gotham.", "author": "Pleasantries F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "Jaime and Jeremy are the absolute best this place is simply amazing. The atmosphere and ambiance is perfect for that date night with the girl you've been thinking about or the intimate cocktail hour atmosphere, in which to win over your clients. These two. Bartenders went above and beyond when I came in looking for a late night snack as yelp stated they are open till 2 am. However since the kitchen was close,  Jeremy apologized and shared a portion of his ribs he was taking home. This is the utmost customer service I have ever received.  I will be back here and telling everyone I come across about this place.  \n\nPS.  the ribs were killer!!! This place is a must go? Don't miss out! Thanks Jaime and Jeremy y'all  Rock!", "author": "Joel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-27", "description": "had some drinks at the mason jar. cool spot because you don't have to commit to any restaurant and can order food from different spots. they also have large flat screens to catch some of the night's games. sweet. nice change up from huddling up at a bar to watch a game. would come back.", "author": "Peter M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-10", "description": "I've never heard of Gotham market until my sister told me she wanted to check it out and the next day I took a trip after work (sorry sis :/). I went at about 7 pm and it was very crowded but not a bad kind of crowded...everyone was chill and moving in between each other seamlessly. Upon entry there are big glass doors that reveal the gorgeous interior which includes beautiful modern lights and wooden benches for patrons to sit. The best way I can describe it is, it looks like a fancy food court with some great food options including The Crabby Shack and other places I'm not familiar with. One of them is soul food, another is Italian which I was super excited about. Apparently, each little food station is a scaled down version of actual restaurants. So, I went to the Italian booth, APizza Originale and ordered a antipasti salad which was delicious by the way but expensive for my taste. I mean, it's a tiny bowl of olives and cheese for $6. It tasted yummy but I felt like I wasted my money because I was still hungry after, lol. The cashier was very nice she took my order, gave me a little device that lights up and signals as well as directs a waiter or waitress to your table. Basically, you sit wherever the hell you want. Fine with me! Oh, and there's also a bar that serves beer and wine in addition to a restaurant way in the back that takes reservations (they're the only ones on the floor that require reservations to eat there). Overall, nice experience but I don't think Gotham is going to last because the prices are a bit much, especially in comparison to other food options in the area.", "author": "Amber A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "We visited the place for the first time and ordered from Flip Bird. We had the crispy chicken sandwich which was excellent, as were the fries. The space is roomy for NY standards and appears to be kid and stroller friendly. Although you order at the counter, food is taken to you seat. The staff was very friendly and willing to go the extra mile. We will definitely become regulars at this establishment.", "author": "Abel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "Very very good experience. Ordered from Flipped Bird $13 combo: three fried chicken pieces comes with 2 sides. Fried chicken was delicious and nicely portioned. Tasted fresh and the sides were yummy and seasoned as well. Had the brown rice and white beans. Everyone that works here looks happy and very helpful. I expected some hiccups since it just opened but nope, had a great time. Will be back to try other food vendors. Great atmosphere.", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-05", "description": "Food was good and atmosphere was great. Ask for Symfanni if you want the best service in town.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "I went to Monday Funday Happy Hour and it was a blast! Great experience and a chance to taste all of the different offerings. On another occasion, I ate at Boqueria - this is my new fav place to go....really delicious tapas!!", "author": "Lori R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "WARNING: The crab avocado BLT from Crabby Shack will make you bust into a happy dance.", "author": "Ashley Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-07", "description": "I live right around the corner from this new place and watched them build it from the ground up. We felt like we should at least give them a look see and maybe even try the food out. The place is beautiful, lots of glimmer and pizzaz. There are about 4 or 5 separate restaurants in the one establishment. We choose the seafood place because at the time it sounded the best. The food is expensive and not really worth it. I had the crab and lobster roll, which was a good amount of seafood but just a bit too much salt, I thnk it was the mayo and spice that made it too salty. definitely not worth the $16 or $18 it costs. Will return sooner or later to check out maybe the Bar B Que joint or chicken restaurant. The way the place is set up makes it like a fancy upscale food court outside of the mall. I give it 4 stars for design and ambiance and 2 stars for the food.", "author": "Rodney S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-16", "description": "The drinks are ok everything else is decent. Food tastes like no effort goes into making it", "author": "Davrel M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-21", "description": "Be Forewarned!  this is the noisiest,priciest,rule-ridden food court from hell I'd never eat at if I were starving.  Walking in to Mason Jar 4 of us were told that we could eat there  but not bring food from other venues there. There were no available tables at 5:30 pm in that area anyway. Further on in this industrial space was Flip Bird where my husband and I got 2 small fried chicken sandwiches for $13@. The crunch was unfortunately subdued by the pink coleslaw atop it.  Although they ask for your name at the order counter they place a number on your table to locate you .  Basically you have to sit in the area that your food is prepared from.  This is unlike most food courts where you are free to graze. Although the beer counter was uncrowded there was a long wait for service.  Our friends wanted Spanish food which could only be eaten in the Borenquien which appeared nearly empty.  the maitre d' apparently was instructed to not fill the tables.   The entire experience was quite unsettling and not conducive to even a snack before the theatre.  The area  is ringed by several theatres and Barclays yet the nearer food choices are limited.", "author": "Riva R."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Gotham Market at The Ashland", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "590 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/Kn5lFO88eHd-6XjIWa2dZg/ls.jpg", "@type": "Restaurant", "telephone": "+17183018480"}