{"aggregateRating": {"reviewCount": 55, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "My most recent visit of this place didn't happen as someone booked it for a private event on a Saturday night. I was completely bummed because my second to last visit was more than great.\n\nJust the week before, I brought my forever date here for a quick snack before heading home after a long, humid afternoon. Luckily, it started to downpour, just as we grabbed two window stools. He had his favorite, Shirley Temple with three cherries, and I had a frozen tropical drink that was served with an umbrella (sorrel and rum?), which came in a tiny old-fashioned martini glass. Small and oh-so pretty but the taste packed a rich, sweet and potent punch. The best I've had recently! The flamingo surprised me.\n\nTwo pretty drinks later and I was ready to try one of the few food options. We were sitting by phenomenal-smelling Hey Hey Canteen, but I saw nothing on the menu that I wanted (plus I know from ordering delivery that they don't serve traditional dumpling sauce with their dumplings), and I didn't want pizza or a burger from The Flamingo, so Bolivian Llama party was a go. Ordered the vegan bbq pork and chicken thigh sliders. Delicious and a tad spicy. I was glad they had vegan options. \n\nService at The Flamingo and Bolivian Llama Party was attentive and quick. Also, lots of seating options at this medium-sized market hall.", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-15", "description": "I would think this struggling food court will try harder to generate business. It's a surprise (a bad one) seeing them posting an unwelcoming sign on their front door. I am a local resident and I take buses very frequently right in front of the door. There's a small individual foyer area between the food court and street. In the winter early mornings, I see parents have their young children waiting in that closed area for the bus while the grownups standing outside looking out for the bus. I personally don't do that but I can see why do parents do that, especially in some really harsh weather. Kids waiting there don't affect the customers inside the food court at all. I can see that it could be a problem when it's packed with bus riders and affecting customers going in/out. But maybe you can try other ways? Posting the rejecting sign is really not a wise move.  I won't visit a place with such unfriendly sign on the door.", "author": "Caitlin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-09", "description": "It was clean and modern with a spacious layout a lot of different options. My personal fav so far is flipbird. \n\nVery cool that you can also have a beer and chill out. If you like people watching and enjoying a meal this is the perfect spot. \n\nThis is also a good spot to get some work done if need be since the tables are a good size and it is spacious. \n\nOne negative is parking is very difficult but that is normal for this area. \n\nI look forward to trying the other options here.", "author": "Nicholas G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "I've been to this new food market a few times, but never for happy hour, and I loved that it wasn't too crowded! There are a few choices here: Noodles\u0026Dumplings, a chicken spot, a coffee spot, pizza, a shared bar in the center of the whole joint, and the bbq restaurant.\n\nI chose the BBQ spot because it was open to the outside, and, Rose was on happy hour! I ordered the Little Gem Wedge salad with grillled chicken....SO tasty. Thanks to my server Jordan who recommended this (I was stuck between their hot wings and the healthy choice ‍) \n\nThe best part of my experience was that I was waiting for 2 friends to meet me and they let me sit down at my table, order my drinks and food, and were friendly about it! I hate restaurants that act like you can't wait for a person and still start your experience....\n\nI'll definitely be back!", "author": "Courtney R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-09", "description": "I visited Gotham Market on Saturday afternoon (around 1pm). The space had a plenty of open seats, which can be great for a morning cup of coffee with a book or cocktail for catching up with a friend. During my visit, I had a coffee at HungryGhost and was able to catch up with a friend without having to yell across the table. \n\nI'll definitely return to dine at Boqueria. This is one of my fav tapas place in the city and I'm so happy to see them in BK!", "author": "S P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "We stumbled upon Gotham Market walking back from a movie theatre and it was awesome. Great overall atmosphere and collection of vendors (beer/cocktails, coffee, Asian, Bolivian and a couple of sit down restaurants).\n\nWe got dumplings (Hey Hey Canteen) and sliders (Bolivian Llama Party) and sat at the bar (The Flamingo). All 3 were EXCELLENT.\n\nSpecial shoutout to Avi, the bar manager at The Flamingo. His knowledge and passion for craft beers was phenomenal and it made me want to go back. The philosophy is pretty simple: if it's good beer by independent brewers, they are interested in stocking it. Seems like a heavenly joint to hang, watch a game and try a long list of cool beers.", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "I love this neighborhood and the diversity you get from this food court. I've been to Mason Jar before for brunch and it was also great (see review on their page!).\n\nI love the way the food court is designed and how you can get pizza, fried chicken, southern food, salads, seafood, and drinks. The wooden tables and chairs also give a nice touch to the food court. It's a great place to hang out with friends or family I would say.\n\nOverall my experiences here thus far has been good and I would definitely return!", "author": "Suki W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-27", "description": "I ordered a bowl of sichuan rice vermicelli noodles (spicy + cold) and pork dumplings at a chinese corner of the market. I was expecting that the noodles would be a soup but it wasnt a big deal for me. I was hoping that my disappointment of not seeing noodle soup would turn into satisfaction after tasting the dish. BUT.. it didnt. I appreciate the portion size but unfortunately, the taste wasnt to my liking. The dumplings were good though. \n\nThe three stars are  for the interior design,the ambiance, and the dumplings.", "author": "Jennah B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-14", "description": "They're busy, its Mother's Day, I get that. However they were clearly under staffed and the service was slow and and inhospitable. \n\nWe left before ordering.", "author": "Natalie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "We ran into food baby here so that was cool (it was like a celebrity spotting). This place has a good selection of eateries so its a good place to bring your picky friends (everyone can find something and you can still eat together). I had southern food and my bf had japanese (i think). Anyway it is very expensive but the ambiance is great. Also one of the restaurants (Mexican) doubles as a co working space during the day time", "author": "Camille H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "From the same people as Gotham West Market in Hell's Kitchen, this is the newest big name food hall and the first of this kind in Brooklyn.\n\nThere are six food/drink options so far, with Boqueria and Egg at The Bird, a breakfast sandwich concept, to open later in February.\n\nThe best things I tried were from Apizza Regionale and Flip Bird, both from the founder of Dinosaur BBQ. The pizzas were excellent and fried chicken thigh from Flip Bird was so good I can't wait to go back to try their fried chicken sandwiches and other items. For something maybe a little lighter, their Pulled Chicken Sandwich was delicious too.\n\nWith so many new dining options popping up around here, this is yet another great new spot to attract more people to hang out in the area pre or post Barclays Center events.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "Food mostly tastes fine and is only slightly overpriced, which is normal for the neighborhood. Also, this place is unpopular enough that you can usually get food without a wait, which is nice.\n\nI generally prefer that my food have fewer human hairs in it, though.", "author": "Dan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "Food halls in NYC are pretty hit or miss, but Gotham Market at The Ashland is definitely a hit.\n\nFor one thing, it's not as cramped as the Gotham West location. Mason Jar has a whole ton of seating.\n\nThe food options are also diverse enough that you can find something for everyone. You've got BBQ at Mason Jar. Pizza at Apizza Regionale. Fried and rotisserie chicken at Flip Bird. And a sit down tapas restaurant at Boqueria.\n\nThe beer selection at Mason Jar is top notch, and it's great for groups. I foresee myself coming back for happy hour many, many times.\n\nYou also can't beat the location. I'm a bit biased since I live a few minutes away, but it's super convenient and centrally located. Close to BAM, the G/C trains and walking distance to Atlantic Terminal.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-25", "description": "I'm sure the food is fine at most or all of the establishments, but this kind of hyper-gentrification food court just makes me uneasy.  I wander around like a homeless person, trying to check out the menus without feeling pressured to order something on a random non-busy afternoon.  Imagine if it were crowded? When traversing one space to the next, I'm always thinking \"Do I need to wait here to be seated?\"  Then I'm wandering around wondering, \"Where is Flip bird...I don't see no Flip bird?\"  Everything is tiered level access in the age of the new aristocracy and this works for a lot of people, just not me today.  Go with a plan.", "author": "Jim P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-19", "description": "Beautiful new food market in Downtown Brooklyn (yay!!!). This is definitely going to become one of my new go-to spots. There are about four or five food stall options. I cannot speak to them all as I have only eaten at the stand alone main restaurant next door, Boqueria, (see my review for that on their Yelp page) and at Flip Bird in the market. \n\nFlip Bird is all about damn good chicken. My boyfriend loved his fried chicken sandwich and said it beat out other fried chicken sandwiches he has had in the past, such as the one being served at Delaney's at Vanderbilt UrbanSpace. I had the flip bowl and this totally rocked - for $11 I was served a very nice sized bowl of brown rice mixed with broccoli, topped with salad and pulled rotisserie chicken (so tasty) and excellent sauces. It was the perfect quick meal! Nice, too, that one stall has beer to accompany your meal.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "I went solely for the flamingo bars cocktails but I also enjoyed some ramen and Bolivian fries. It's a great space to hang with friends,Get a drink, and have some food. There's an inside bar as well as an outdoor one.", "author": "lillian p."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-24", "description": "What you need to know:\n- There are 6 vendors, with Mason Jar and Boqueria more like separate restaurants. \n- Warm, spacious and modern space to hang out. \n- Many of the vendors offer 10% off for BAM members \n\nWhat we ordered: \n- From Flip Bird: I got the 3-piece fried chicken, which came with 2 sides - $13. I got salt \u0026 vinegar fries and white beans with chorizo \u0026 kale.  The fried chicken was really tasty! It had a thick crust coated with spices. The inside was also very juicy. However, the sides fell flat in their face and was just filler food. \n- From Crabby Shack: My friend got the crab roll $15 and honey butter cornbread $4. The crab roll was very dry and fell pathetically apart; she did not like it. The cornbread was moist but her meal was expensive and left her hungry for more food!", "author": "Karen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-30", "description": "Gotham Market at the Ashland is a high end food hall, with beautiful finishes and several food options for the local hipsters and yuppies. Its very close to all the Brooklyn Academy of Music theaters (BAM) and not far from the Barclay's Center. It opens last Thursday and several friends and I decided to try it out for a Sunday night dinner. This part of the neighborhood is still a little quiet, with few retail options, but when 300 Ashland opens up, the neighborhood will be much more lively. \n\nWhat makes Gotham Market Ashland special is really the ambiance. Because there were plenty of tables and no wait, we had the luxury to sit and chat for a pretty long time. The space is inviting, in high ceilinged, repurposed wood, industrial hipster chic that somehow still does not feel cliche. The tables are set up in four tops, two tops, and bar seating. I can see as the word gets out that it might get hard to get a seat, but for now, its pretty easy even at peak meals. The servers walk around delivering food and cleaning up after you - it was actually really hard to find a garbage can if you want to take care of yourself! The servers also walked around offering complimentary coffee from Flip Bird, which was nice. The bathroom was clean, the lighting is great, and you can actually hear your neighbors when you have a conversation. All excellent points. I think the Mason Jar space can be closed off for private parties because there's a big sliding barn door, which would be cool if you ever need to do event planning. The entrance on Fulton is the best for strollers/wheelchairs by the way, although the Mason Jar side does have a big ramp. \n\nAs for the food options, the prices are Manhattan high and the quality is good, but not mind blowing. I agree there are very very few vegetarian options (at least with the existing menus/vendors as of opening weekend) and other than the two bars, there are no options for non-alcoholic drinks that I found. I didn't like any of the vendors enough here to make a special trip for any of the items we sampled. I would visit again for the space and for the convenience of having multiple vendors, but I'm looking forward to the food court at City Point and seeing how those menus will compete. You order at each of the respective stalls and they'll come deliver food to you - keep an ear out for your name! \n\nWe sampled:\n-Apizza Regionale - Wood-fired mushroom white pizza - delicious dough, great quality mushrooms, perhaps my favorite of the evening. Not too heavy and the 9 or 10 inch pie is perfect to share and sample or eat by yourself. \n-The Crabby Shack - we shared a $20 lobster roll, which was about 6 inches long, but came piled high with claw meat. It was very lightly dressed, the bun was toasted, but otherwise is on par with any other NYC lobster roll we had. \n-Mason Jar - specializes in barbecue, we had the $26 basket of ribs. The sauce was delicious and the meat was tender (you get 8-9 ribs per order) so this is also fun to share. The ribs take about 15 minutes to get to your table though, and ours were a bit drier than I'd like. The coleslaw that came with it was excellent. \n-Flip Bird - we got three pieces of fried chicken with fries and brown rice salad, as well as the pulled chicken sandwich. The fried chicken has a crunchy, slightly spicy batter and the meat was tender - good stuff. The shoestring fries are excellent, and the sandwich was pretty tasty and had a great mix of textures and flavors. I think Flip Bird also has the best overall value and the best vegetable options, as they also have salads and sides. \nI did not try Bar Granger. Boqueria and Egg @ The Bird will open next month.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-17", "description": "Found this place as I was walking through Bk. Amazing food. Had Bolivian food for the 1st time ever and it was tasty. Haven't had such good fries from Mexico, long time ago. The sandwich chicken was on point. A great Mai Tai to go with all the yummyness. I'd definitely recommend.", "author": "Ale S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "This is a welcome addition to Fort Greene! Nice airy space with lots of seating. Very relaxed atmosphere and conveniently located. We went for an early dinner so I'm sure how crowded it would be during peak times though. I had the fried chicken at Flip Bird, which was really delicious. The service was great and the food came quickly. The servers were great about clearing food off of tables too. \n\nThe food hall has a restroom for all genders, which I thought was awesome. However, the one drawback of the food hall is that they don't have any vegetarian options. My boyfriend is working towards a vegetarian diet and he could only have a small salad and a kind of sad broccoli side. I would have thought the developers would have chosen a vendor with better vegetarian options. \n\nOverall, I would go back if I'm in the area, and I think it would be a great option for before or after a BAM event, but I wouldn't make a special trip for it. There are only 4 food vendors and two bars, with one food vendor on the way.", "author": "Elizabeth C."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Gotham Market at The Ashland", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "590 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/Kn5lFO88eHd-6XjIWa2dZg/ls.jpg", "@type": "Restaurant", "telephone": "+17183018480"}