{"aggregateRating": {"reviewCount": 55, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-08", "description": "I work right across the street, didn't realize it was a food court. I tried the ramen chicken sandwich from Hey Hey Canteen. It wasn't bad but wasn't great either. I wished the chicken had more flavor. I heard from other coworkers that the dumplings are really good, so I'll try that another time. There's different restaurants here, so I know I'll be back.", "author": "Sherika G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-24", "description": "I was expecting malai ice cream and crabby shack to be there, they weren't. I didn't find the chicken and waffle nor the pizza. The ramen noodle bowl and vegetarian dumplings were nice but drove out to BK expecting more from this place.", "author": "Di J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-07", "description": "Glad that more and more food courts are opening in the Downtown Brooklyn area that bring together all kind of delicious local eats in one place. There is another one opening up soon in the City Point and most of them sit under a residential highrise. Excited to see how this defines the future of the neighborhood.\n\nThe food court was really spacious and had very high ceiling so it wouldn't feel crowded inside, though there were a lot of people there. There are ~6-7 restaurants/bars inside, some are open space and some are like real restaurants that have a confined space. But they are all connected in one continuous space. Wherever you order, you will get a electronic thing that will vibrate once the food is ready and the waiter/waitress will bring the food to you. Super convenient. Despite the good service, there is NO TIP!\n\nI tried 2 places this time - crabby shack and flip a bird. Both are AMAZING! The price is slightly high - expect ~$20-25 per person to have a decent meal.\n\n[Crabby Shack]\n\nCrabby shack is a seafood and crab place that also has another location in Crown Heights. Its Crab BLT was HEAVENLY! BLT would usually be too salty because of the bacon but this one was just right - the creamy, slightly sweet crab with the slightly oily and salty bacon created the perfect mixture of taste, with lettuce crunching up the texture. The bread was toasted. All different flavors were just like dancing in one bite. HIGHLY RECOMMENDED.\n\nIts banana pudding is also irresistible. Not too sweet, not too creamy - it had the perfect balance of banana cream and sweet bread.\n\n[Flip a bird]\n\nIt's a rotisserie chicken place and the chicken was SO TASTY, because of the amazing spices. The chicken was perfectly roasted with spices and oil all over its skin and meat. With the $17 half a chicken, there also came 2 sides - I got the white bean with chorizo (fantastic! very flavorful) and broccoli/brown rice, which was nothing special but also good.\n\nHowever, the only drawback of this food hall was it was WAY TOO LOUD AND NOISY inside. One thing was because the N Q R lines were running right under so the running subways were constantly shaking the building. The other, due to the high ceiling, sound echoes and amplifies itself. Not sure how this can be overcome... but in general the food experience was amazing! Will definitely come back again.", "author": "Shen Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "I've been here twice. It's a New food market in the Downtown Brooklyn area. The first time I went they were having karaoke night. There was music playing inside. They had sports games playing by the bar on a few Flatscreen Tvs. It's a nice vibe, in a upbeat and vibrant setting. It features about 6 different restaurants/bars. Too many to try all in a day. Good enough that you have to go back! \n\nI tried out Mason Jar during my first time there. I ordered the Chicken \u0026 Waffles w/ maple syrup \u0026 chipotle aioli sauce. The chicken was crispy and seasoned very well. I had a chicken breast. That paired with a big waffle that was made to perfection. The chipotle aioli sauce is a must have. It has a nice spice to it. I also has the low country kale salad with kale, bacon, black eyed peas, mushrooms, onion, crispy ham Dijon vinaigrette. It was good as well. \n\nMy second time there I ordered from The Crabby Shack. I remember visiting their location on Franklin Ave sometime last summer and I loved everything I tried then. So I knew what to expect. Let's just say they didn't disappoint. \n\nI ordered the Crab BLT w/ Avocado. It is the best BLT combo I've ever had. It is a must have! I also had the  Shrimp taco w/ cabbage * pickled radish*cilantro*avocado topped with a chipotle mayo sauce. The shrimp taco was good. My only qualm was that I only ordered one. You can't just have one.", "author": "Avril L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "Came here for Trivia Night. Kind of a great set up. You're sitting there with a bar and 2 restaurants; the top 3 winners got gift cards from one of them. The host for trivia was perfect and so was the crowd.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "I LOVE that this market is now in the neighborhood. My husband and I went on Saturday afternoon and it wasn't super full, which was awesome. I think people haven't totally discovered it yet. It's a GREAT option if you're in Fort Greene, at Atlantic Center, or going to a show/game at Barclay's. \n\nThey are going for a steampunk industrial look inside with the decor and architecture. There are 4-5 food options of different kinds of foods so you really get a lot of choices. There's a ton of seating. I can't recommend coming here enough if you're in the area, especially if you're going to Barclay's or at Atlantic Center and want to grab a bite. MUCH better options than Atlantic Center.", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "I went to Monday Funday Happy Hour yesterday when they provided some free food and special price drinks. This was my 3rd time being here. Overall the experience has been good. \n\nThey provided some sliders from Flip Bird, and some other samples from other vendors. Even it was a free event, the quality of food was all decent. It was a good turn out with plenty people showing up and enough food (for me at least).  Also they have outdoor seating as well. \n\nThe other two times I were here, I tried Flip Bird and Boqueria. Boqueria always provides consistent good quality for food (the one in DC was great as well). Flip Bird was nice as well\n\nIt definitely has a higher price for a food court. Its brand new and clean with modern decor. The location is convenient and one block from Atlantic Terminal (and my apartment). I would return if I'm too lazy to go far.", "author": "Maria S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-31", "description": "While the food here is pretty good, great pizza, awesome chicken and fuxins, yummy lobster rolls and good cocktails, on this visit the music was all hip hop and loud and noisy, a bunch of crap music! \nFix that or y'all are gonna lose a bunch of folks!", "author": "Neil G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-14", "description": "Not the most memorable food selection but the location can't be beat. Corner of Ashland/Fulton in the heart of downtown Brooklyn. Near all the new live theater and the BAM. Worth a second look in the summer for sure.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-10", "description": "Actually better and less obnoxious than I expected, Gotham Market has a decent feel to it. If you go to the middle section, you can choose table service, or not (we chose not) and go get your overpriced grub. I do have to admit that the pizza we had was divine. I mean truly. I've only had better recently at Kesta in the W. Village. The wooden tables and heavy chairs are smartly designed, and the bathrooms deceptivley big - from the outside they all seem like singles, but the gender neutral/handicapped on is the only private one. There are plenty of other options in the area, but this spot is worth checking out. Boqeria has a menu I'd like to explore, even being a vegetarian.", "author": "Curtis J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-20", "description": "We stopped in for lunch President's Day 2017 and were very happy we didn't bring a big group because the options are neither that great nor that different, but it's a very nice space in a very convenient location, albeit with surprisingly little seating, even during a very slow time. Judging by the mismatch of staff shirts to venues, people work for the Market and not an individual venue. There was a huge breeze even far from the door because not only do they not have a vestibule, but they leave the outer set of doors swung open in a desperate attempt to welcome new customers.", "author": "George C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-20", "description": "What poor, helpless, aggrandized consultant designed this travesty?\n\nSwing and a miss. \n\nAvoid however possible.", "author": "Trent T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-28", "description": "This place has fallen on it's knees. All vendor have left. New people have come in and not enough staff for the place.", "author": "Ger G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-28", "description": "OK specifically I've tried the Mason Jar here so judge other food spots here on their own merit. I had the fried pickles and the chopped pork sandwich along with the MJ Arnold Palmer. They were all great and yummy options but be prepared for long wait times and frustration because the collard green salad that I ordered never came. I literally take it as a sign that God loves me at this size with my fried food diet with a side of hard liquor. Yes Jesus, I hear you and will obey accordingly.  The pork sandwich is under-seasoned so just know you will need salt.  The kitchen is sssllllloooooooowwwwwww. Don't hold it against the waitress and waiters, they are amazing. But do hold accountable the managers for moving that kitchen along because there was a lot of standing around.  Maybe it's just because they are new, so I'll give them another chance one day...not too soon though. Have the fried pickles which come with this vinegar based bbq sauce...yes...worth it.", "author": "Reshard R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-11", "description": "Lots of choices, bbq, fried chicken, pizza, and the crabby shack. Perfect for an easy lunch, grab a big table and share family style.", "author": "Wayofmouf .."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-17", "description": "New spot in the neighborhood, so I wanted to check it out and see what the hype was with the food halls popping up throughout the city. \n\nI ended up at Mason Jar, one of the restaurants, for Saturday brunch. I was seated quickly (the rain helped, fewer people out), the staff was welcoming, the decor is simple, the music was great.\n\nI wanted the Jambalaya Jar, but they were out so I ordered the eggs Benedict. The food was good, not particularly outstanding given the price, but it was good. I loved their coffee, though.\n\nI dont think I would return to Mason Jar for brunch, but overall I can see Gotham Market being a cool place to take friends for a happy hour. I noticed that they were kid-friendly, at least for brunch. Maybe I will try another option next time.", "author": "Chi M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-31", "description": "Disappointed by Gotham.  It's a nice design and concept, but it wasn't very crowded yet it took forever to get my food.  Food itself was overpriced for what it was. Willing to give it another chance.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-30", "description": "It's a nice, fresh place with a crisp atmosphere. Definitely the place to go with a group of friends, whether it be on a break between classes or work, or a casual night out.", "author": "Safa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-10", "description": "I stumbled upon here just walking around the neighborhood. This place is pretty cool. It's a large open marketplace with different food vendors and a bar. I ate at the flip bird and ordered three piece fried chicken with fries. The fries were good but the fried chicken was extremely salty! The crisp was perfect it was so unfortunate that the saltiness overshadowed everything else. My boyfriend ordered a lobster roll from the crabby shack and he thought it was too small and over seasoned. I think I will definitely be back here just for the atmosphere and maybe a drink. Next time I will try the pizza place and/or the mason jar cause there menus looked really good too. It's also seems like a good place to bring a group of friends and watch a game too.", "author": "Djerica L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-01", "description": "If you are near the Barclay's and are looking for a Brooklyn-themed Food Court, this is it.\n\nWe ate at the Mason Jar. Expensive BBQ-style food. Totally edible. Beer was ok too. \n\nBut walk a block and find a local establishment instead and find a non-carbon-copy neighborhood joint instead.", "author": "Julio R."}], "servesCuisine": "Food Court", "priceRange": "$11-30", "name": "Gotham Market at The Ashland", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "590 Fulton St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/Kn5lFO88eHd-6XjIWa2dZg/ls.jpg", "@type": "Restaurant", "telephone": "+17183018480"}