{"aggregateRating": {"reviewCount": 76, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-28", "description": "Love this place, the vibe is on point. Feels like you're at the beach. Lots of mint and red accents. The music was killer, mixture of reggae and 80s. \nService was on point, really attentive and gave great recommendations. \n\nThe food was pretty decent. Our table shared the seared fish tacos, crab dip and shrimps tacos all of it was great. \nCocktails were just OK. I opted for fresh watermelon juice with vodka added in. Mine was better than what my friend ordered. \n\nThe General Manager was super nice and engaging, he stopped by the table during our meal to check in on everything. Not something you see much in New York. \n\nAll and all if you're in Dumbo and want some tacos and a great vibe stop in. I'll be back.", "author": "Joseph K. S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-14", "description": "Clam chowder runny, had one clam in it. Said something, manager came and offered another one which took long to arrive. The second one was way thicker but way too oniony. They don't quite have it. \n\nThe sweet potato fries were tasty, thankfully.", "author": "Walter P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-24", "description": "We decided to take the kids to DUMBO which is Down Under Manhattan Bridge Underpass In Brooklyn and it was really fun!! We decided to eat at Seamore's and it was pretty good. Host with a beard has a great singing voice and should be discovered soon. Waitress who's name escapes me was sweet and very helpful and patient. \nKids each had an aperitif with pisco in small martini glass. I had a lemon drop instead of the bubbly cider the waitress let me sample, and bf had a glass of Sauvignon Blanc \nMe and BF and daughter ordered tilefish with miso butter sauce and my son had bluefish with charred scallion sauce. Kale and cauliflower mash was good, not great. \nIt's basic fish and good for beginners. \nI would give it 3 1/2 stars but the kids liked theirs more so 4 stars it is.", "author": "Elisa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-15", "description": "A great spot for grabbing a good dinner right in the heart of Dumbo!\n\nAfter strolling the area for a few hours my fiance and I came in for a date night. I know this is more of a brunch spot so even though it was Friday at 8pm, it wasn't overly busy.\n\nWe each had a cocktail (both were good, ask your server for recs), and shared the guacamole, tuna poke, and the reel deal. For a seafood restaurant, the portions were generous and the fish was fresh and tasted really good.", "author": "Jackie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-25", "description": "I really loved the original Seamore's, so I was excited to check out the new DUMBO location. The space is amazing. You get all the pastel colors you'd expect. There's tons of seating. And they run oyster happy hour specials!\n\nI was hankering for a tuna poke bowl for lunch, and $16 later, I had one. It was loaded up with huge chunks of tuna and avocado. All super fresh. I will say it was a bit on the salty side.\n\nThey also give you a bag of tortilla chips (WAY too many, if that's a thing), so you can dip salty things into other salty things. And isn't that all we need in life?", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-24", "description": "Really enjoyed my brunch this Sunday morning. Food was on point. Was surprised the general tso cauliflower was insanely good. This is a dish I wont forget. Also had the red sauce fish soup, was also delicious. All the ingredients taste fresh including the fish. Ended with salmon buger and fried fish sandwitch. Both were very tasty but the salmon buger was better. Also loved the $6 bloody mary also the blood organe bellini was very refreshing but glass was not even filled to the middle. A little cheap on that but the service was good so I decided to still give five star.", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-11", "description": "We dined at the original Seamore's location but this was our first experience at the Dumbo location and also for brunch. We were able to walk in and be seated around 3:00 on a cool and drizzly Sunday in June.\n\nI had the crispy fish tacos and they were excellent. Other standouts were the curry muscles and the fried Avocado Benedict. As with everything at Seamore's, the fish tasted extremely fresh and the presentation was beautiful. Seamore's has a nice selection of both beers on tap and in bottles.\n\nThe space itself is quite nice with a sort of Ikea meets beach house vibe. I liked the open kitchen. Service was very good in addition.\n\n4 Yelp Stars.", "author": "Richard R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-09", "description": "So happy Seamore's is finally in Brooklyn!!\n\nTheir food is so fresh and delicious!! Their Tuna Poké and Guacamole are winning choices for appetizers. For entrees, their lobster roll and tacos are amazing.\n\nTheir cocktails are so yummy and photogenic. This place will be big for bloggers and Instagrammers. It's the perfect place to eat after strolling through BROOKLYN Bridge Park.", "author": "Laurie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "The rapidly expanding Seamore's just opened their biggest location yet in Dumbo right near all of the other restaurants that opened last year.\n\nThey have the same great menu of seafood as at the other locations, plus some new stuff like a Gumbo Tostada that you can only get here.\n\nThere is a big bright room up front, as well as a smaller room in the back that looks like it would be perfect for a private party.\n\nWe got a little of everything, and all was great. Especially that fried fish sandwich with sweet potato fries.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-02", "description": "Some friends and I intended to have a late brunch here last weekend but it ended up being more of a dinner. We made reservations for 3:45pm not knowing the kitchen closes at 4PM and doesn't open back up until 5... When the server shared these details with us we were quite confused, because why allow reservations for 3:45 if the kitchen closes at 4? Maybe there was some fine print we missed?\n\nRegardless, we made it work. We quickly ordered a few appetizers to hold our party over and then had some drinks while waiting for the kitchen to open back up. We ordered the guacamole, tuna poke, curry mussels, and avocado toast. All were good, with the tuna poke and curry mussels being exceptionally tasty. If you get the mussels, be ready for some heat. They are spicy but in all the right ways, and the coconut milk truly helps balance it all out. I would suggest ordering some extra bread because you're going to want to soak up whatever broth is left.\n\nOnce the kitchen opened back up we ordered only a few side dishes, as the appetizers were more filling than we had expected. We ordered the kale and avocado salad and some sweet potato fries, as well as a second helping of the tuna poke. The kale and avocado salad was alright... definitely missing something. It felt like they were being skimpy with the sweet potatoes and walnuts... There is an option to add fish on top the salad, which may have been a wise choice.\n\nAside from the initial confusion regarding our reservations vs. kitchen closing, we were also less than impressed with the service. A few of my friends felt brushed off by our server. None of the food was particularly amazing either, with the exception of the poke and mussels. \n\nPerhaps we need to give it another try and explore more menu items, but in the meantime Seamore's is a solid 3 in my book.", "author": "Clarissa H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-06", "description": "I came in for nice fish and chips but was quiet disappointing honestly. It was not crunch at all and was very wet :( cole slaw was okay nothing special. Malt vinegar was pretty bland. Sorry but maybe i had too much expectation looking at the place. I would try different stuff later", "author": "Hyojung C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-18", "description": "We easily got a table for four on Saturday during busy brunch time (without a reservation). Later on the place quickly packed with people. The place is modern and fun. Menu is interesting. We ordered lobster macaroni and cheese. Tasty macaroni and cheese, BUT no lobster in sight/taste.  A bit disappointing.. Calamari appetizer was delicious. Lobster omelet was good, fish sandwiches were nothing ordinary, regular ... sizeable differences between the two fish sandwiches:( \nKale and avocado salad with haddock was ok as well. A few slices of thinly sliced avocado,  while description on the menu let's one believe it would be a main or the second to main ingredient. Just level set your expectations, avocado seekers! Haddock on the salad was cooked (pan seared?) a bit to well to my taste, but it had a nice dash of seasonings. Overall, a nice place for brunch when in DUMBO.", "author": "Vira A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-21", "description": "Nestled in the middle of Dumbo, is a hidden gem in the middle of the block for those who love great seafood, albeit at NYC prices and some damn good Mac \u0026 Cheese and nice thin fries too.  This spot did not disappoint, from the prompt seating, to our server Adam who took the time to go over the robust menu with us, even saved me a couple bucks on fries, appreciated that to his recommendations from the adult beverage menu, yep should have listened to Adam, the Rose Cider is really freaking good ( FYI). Oh yes and of course the food, we had a couple things: the Lobster Benedict with in house made English muffins was made to perfection, we also had the Avocado shrimp Benedict which was also very good, remember to ask for a side of hollandaise sauce, the New England clam chowder with Aioli was superb, the chicken burrito bowl was fresh, crisp and flavor packed! Not to be outdone, the cast iron Mac \u0026 cheese was a show stealer. But then we also had a taste of the deserts and the Peanut butter mousse egg was very good but the churro with vanilla bean ice cream was even better! If you haven't noticed, I highly recommend!", "author": "Joe T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "This place has AMAZING and unique drinks. My girlfriends and I needed a drink or two so we decided to stop in. Very cute place with a Hawaiian theme! We sat at the bar and the staff and bartender were very friendly. In fact we spent most of the time talking to them! Their drinks were very unique and I ordered the \"smoke on the water\", which was well crafted with a Smokey and ginger taste. My friend got the frozen rose which was only $5. My other friend got this drink with a special name, something like \"your honey on your dew\" and it was so refreshing, crafted with honey dew, mint and ginger beer. We did not have a chance to try their menu but every dish looked amazing. Definitely would come back again!", "author": "Jessica F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-06", "description": "Attractive place in a great location close to the Brooklyn Bridge and shops. The staff was attentive and friendly. I ordered the large tacos - That is the name of them on the menu. The dish was very delicious but I would not say that they were large and even medium-small.\nThey were flavorful tho. The dish came with nothing else just the two smallish tacos on a plate.", "author": "Jean K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "Seamore's is an absolutely delight for seafood lovers. Modern dishes like calamari, fish tacos, and lobster done simply and deliciously. What more can I say? The service is excellent, great location for a evening date, and the food speaks for itself. Get the chocolate cake dessert too!", "author": "Eric H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-23", "description": "I was torn between 3 to 4 stars but gave it a 3 star given that all of the starters we ordered did not meet our expectations. Our party of 3 spontaneously walked into Seamore's to grab dinner on a Wednesday night without reservations and waited about 15 mins to be seated at a table. We ordered blackened shrimp tacos, fish tacos, and calamari as starters. While the tacos may appear \"big\", there wasn't much actual content. There was a lot of batter for the cripsy fish taco and I barely tasted any shrimp-mostly radish. The tortilla was cold, thick and unappetizing. The calamari was thin and lacking texture. However, I did enjoy the entrees. The squid ink pasta and the clam pasta was delicious. Finally some seafood in pasta that isn't overcooked and rubbery. Fresh and no funky after taste. And for these reasons, I'm willing to come back and try out the other items on the menu.", "author": "Luna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Great place to get seafood. I had the crispy tacos and they were delicious. The star of the show was the dessert, churro and ice cream. Best dessert I've had on my trip to NY.", "author": "Gilbert G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "Love everything about this restaurant!\nThe food is amazing, from fish tacos   to poke tuna, everything is super fresh and perfectly seasoned.  Light and healthy but filling too.  The staff are beyond kind and welcoming.  They make you feel like a VIP  whether you're on a date or coming in with a gaggle of children.  Shout out tit the managers too!  They give back to the community in spades, and support local nonprofits serving youth.  Run, don't walk to this gem, beloved by everyone in the neighborhood and beyond.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-08", "description": "The guy Bo was behind the bar so dismissive!!! He was too cool to speak or assist \nHe looked so bothered\n\nLast year we came and the manager too was so flustered and non welcoming name was Alex I think\n\nVery odd because I'm a fan of meatball shop \n\nToo bad...food was good though \n\nThey need nice people", "author": "Bryan J."}], "servesCuisine": "Seafood", "priceRange": "$11-30", "name": "Seamore’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/PWD7eiyZJqEHk6zZKNoi6Q/ls.jpg", "@type": "Restaurant", "telephone": "+17186636550"}