{"aggregateRating": {"reviewCount": 76, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-11", "description": "Feh. Lobster mac was rigatoni with a sparse sprinkling of cheese and about 1 oz lobster. For $26. I could have made that easily for myself and spent $5.\n\nNot impressed. If you have a $26 mac and cheese I am expecting a baked in cheese situation, and at least fresh ground pepper, they just had a table shaker. Another overpriced mediocre and uninspired menu trying to ride the wave of gentrification in dumbo, and doing a good job of catching the peel offs from more popular restaurants nearby.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-17", "description": "Beautiful relaxed place with great fish and seafood, not too expensive.  Fun place!\n\nBeer battered fish sandwich and tacos were great!", "author": "Michael P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-23", "description": "Had a coupon for a free fish and chips so wanted to check this place out. The decor is modern and colorful, but very loud. So obvi, got the fish and chips, New England clam chowder, and the kale and apple salad. Fish was fried perfectly, but our sweet potato fries we kind of soggy. Soup came with delicious croutons and was a great size to share. The kale and apple salad was the winner: perfect flavor combo of sweet potato, kale, and Granny Smith apple with some kind of lemon vinaigrette. \n\nWe also got dessert, some soft ice cream. Overall, wasn't amazing food, but certainly wasn't disappointing.", "author": "Isra P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "My server was absolutely amazing so nice and great recommendations. This was my first time at the DUMBO location and I was very impressed with the spacious, clean, and colorful vibes. The poké was amazing as always. I decided to go with the reel deel and chose the scallops. It only comes with 4-5 but so filling with the sides and appetizer it's more than enough. The Brussels sprouts are so good and the mashed sweet potato or sweet potato fries are an amazing side choice. I definitely recommend. The cocktail I had was also so refreshing and delicious!", "author": "Alexandra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "Great michelada and happy hour oysters!\nFriendly staff, awesome service, will definitely come back!", "author": "j d."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-14", "description": "I came in for happy hour a few weeks ago (they had me at \"dollar oysters\") and the service was just fine. My bartender was just the right amount of attentive and gave me pretty swift service. I read through the menu and knew I had to come back and give more than just discounted oysters and beer a try. Here's where the stars start to fall off.. \n\nI left the employee manual to my brand new job and several important signed documents at the bar. I live pretty far away so I called the restaurant about 5-10 minutes after leaving and spoke with a young lady named Esther who told me she'd found the manual and would leave it at the hostess stand for me. I made it clear that I did not live close by and wouldn't be in the neighborhood again until Saturday (four days later); she assured me this was fine.\n\nFast forward to Saturday. I come in and speak with the hostess and ask her about my manual - it is nowhere to be found at the hostess stand. I'm then directed to Esther, and while she was very helpful, she was unable to locate my manual. She mentioned she would check with the other manager, whom, after ten minutes or so still had not gotten back to her, so I went on my way and thought I'd try back another day.\n\nFast forward another week or so (I know, I know. But! I live in Crown Heights and am in DUMBO fairly infrequently). I stop in one evening after work and ask the gentleman behind the bar about my manual. He immediately knew what I was referring to and said in a very blasé tone, \"Yea that's gone. It was here for a few days so I threw it away.\" After I expressed my dismay since I'd advised a staff member I'd be back for it and did indeed come back on the exact day I said I would, I got an equally blasé reiteration of the aforementioned response. Basically, this guy gave zero f*cks about me or my manual or what his peer told me.\n\nLong story short, service doesn't end once the bill is paid. While I was annoyed my manual was now gone forever despite my best efforts to assure I got it back, I realize it is my fault for leaving it in the first place. However, an ounce of empathy for your customer would be nice. I also happen to work in hospitality and know that it costs you nothing to at least pretend to give a f*ck.", "author": "Charlie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-22", "description": "Although I gave a great review a year ago, I have visited several times since and have been very disappointed each time. The fish is poorly cooked and very small portions. Staff is indifferent to customers and the service is very slow. I'm very sad that this restaurant has gone downhill so fast.", "author": "Lisa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "omg, I loved your venue! The food was ridiculously delicious! The brunch beverage was so wonderful, I ordered three! I would highly recommend your venue if anyone ever asks me for a Brooklyn venue suggestion. I'm definitely returning. Thank you!!!!", "author": "Dayna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "Absolutely great in all regards.  Fresh, wild caught sustainable fish prepared simply but beautifully.  Poke tuna appie is awesome!\n\nService is outstanding and the whole crew are really nice.  The ambiance is elegant and tasteful yet not snobby or uptight.  \n\nAnd biodegrable straws puts them over the top!!!  \n\nWish Michael would consider opening a spot in NJ - preferably in Montclair!", "author": "Darla C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-15", "description": "This place was amazing! I went there on Valentine's Day with my boyfriend and it was just the perfect place with a great vibe! The food was delicious and had beautiful presentation! I had the pesto Salmon which was a special for the evening and it was breathtaking! I will definitely be back! I highly recommend this place for a nice evening!", "author": "Marissa P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-20", "description": "Seamore's is good, but not my go-to. I love that you can truly see the quality of the fish. The presentation is nice, and the atmosphere of the restaurant is airy and spacious. I went with some friends but I feel like it's more of a food for intimate meal than for a group.", "author": "Charles R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Frozen cocktails are $5 during happy hour. By the way, they are sooo good and strong. Bartenders are nice and gave us ideas of tons of places to check out in Brooklyn! Didn't eat but the food smelled amazing.", "author": "Uneak H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "I was returning to my apartment after a boozy brunch when I saw a sign outside for $5 frozé and frozen passion fruit margaritas. I stopped in after inviting a friend to my apartment so we could see what it was all about. I was extremely pleased with the setup and utilization of the open space. I never patronized the previous establishment before it closed so it was my first time seeing the space. My friend and I just made our way to the bar for a couple drinks. The bartender was cool and personable. That's the type of bartenders I can vibe with. Everything was perfect until this server walked up to my friend and I and stated \"What's the probability of you moving down so these ladies can take a seat?\" First off, that's not how you ask a patron to move down. All you had to say was \"Could you ladies move down, please...?\" Secondly, since when do servers walk guests to the bar? Bars are self served. Nobody walked us to the bar. So I don't understand why they were giving a marching band just to ask us to move down one. He needs to work on how he talks to people and his attitude. We moved down one seat as that was never a problem but your tone and how you addressed two women was. That situation really rubbed me the wrong way as he came across as a snarky smart alec.", "author": "Amira A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Solid, through and through. The Tuna Poke is a must. Crispy fish tacos don't disappoint but the blackened shrimp tacos are killer.  Barkeep is knowledgeable and is open to share opinions.  Will absolutely be coming back.", "author": "Robin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-13", "description": "The location was around the corner from job...so happy hour started early.  Love the way the prices flow for drinks 4 pm drinks $4, 5 pm drinks $5 etc etc.  The shrimp mac and cheese awesome, the cauliflower fries were new for me and quite good.  The playlist of music was just what I needed...a lil bit of everything.  All and all I love the vibe the food and the drinks..", "author": "Sharon M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-22", "description": "An attractive restaurant, cool and hip, but I was left underwhelmed by the food and the value. The restaurant itself is beautiful, but be prepared because it's loud when it's crowded. The staff were polite and responsive to our needs. We came in with 3 on a busy Saturday night without a reservation Still, after a short wait they found us a table and I did not mind that we had to share it with another family. Thanks other family!\n\nThe menu is limited and the offerings are esoteric. For a seafood restaurant I would have hoped for a few more traditional dishes on the menu, such as pan-seared scallops. We ordered guacamole and chips as an appetizer. It was delicious and attractively served. For my main, I settled on the lobster roll. At $28, it was one of the pricier entrees.  It was just okay. Maybe there's not much to say about a lobster roll. But I've had better. \n\nThe wines by the glass were also pricey, and I was disappointed by the stingy portions.", "author": "Joey W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-03", "description": "Great spot in DUMBO! \nOpen Kitchen is a plus.\nFood was really good. \nThai cocktail was A 1. Will definitely come here in the Summer.", "author": "Andrew S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "We fell upon this gem as we were exploring the Brooklyn bridge park area and I'm so happy that we did. We saw that they had $5 frozen drinks for happy hour and walked right in . They have beautiful and potentially romantic ambiance and their greeter is awesome. We set at the bar and the bartender and his coworker were very friendly and helpful as they had plenty of suggestions on what we should make sure we see here in NYC. The $5 Froze' was AMAZING, delicious and Strong. Therefore it was totally worth it. I would definitely come back! Oh and I didn't get food this time but it smelled amazing and next time I definitely will.", "author": "Reid M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-26", "description": "Living in charming but tedious Brooklyn Heights, we're always on the lookout for new, walkable restaurants, and DUMBO has more or less delivered. After a brutal work week, I was looking forward to a relaxed Saturday and we decided to give Seamore's a try. To their credit, the space is beautiful and the menu fairly interesting, and while the experience was terrible, I would be willing to give them the benefit of the doubt and assume they're still just finding their sea-legs.\n\nNevertheless, they have some genuine kinks and missteps to work out if I'm ever really going to be a regular customer. First, while it was certainly not slow on Saturday, the restaurant was not even close to full. We were seated immediately, but then waited for a solid 20 minutes before someone took our drink order. The very mediocre prosecco they serve as their sparkling option was served in thimble-sized coupes for a price one would have ignorantly and mistakenly assumed was an actual healthy pour. But congrats on that profit margin! \n\nNext, we waited 45 minutes or so before the server came over to apologize, then we waited longer and she brought over an appetizer as an apology for our continued lack of food. I'd definitely give her an A+ for effort.\n\nThen we waited more...\n\nThen she brought the order, and half of it was completely wrong. So then we waited more. By this time, we'd basically been forced to order two more shots of prosecco.\n\nAnd the only actual accommodation was the appetizer that, while thoughtful and an attempt at rectifying the situation, was still something we'd neither ordered nor wanted. And we still had to wait MORE and the order was still WRONG. And we were still charged over $100 for food that was just okay and bad service. I have no idea if the server made the mistake or the kitchen or both, but here's a recap:\n\n- Charming decor.\n- SLOW service.\n- Embarrassingly small and piss-poor quality drinks.\n- SLOW service.\n- Incorrect orders.\n- SLOW service.\n- Adequate food that is not worth the price.\n\nIf they improve on half these fronts, I'll contemplate going back. I get that opening a new restaurant is tough. But otherwise, the only reason to go is that you're a tourist in DUMBO for an afternoon and don't mind getting swindled.", "author": "Charlie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "We came on a Tuesday night around 7pm. The dining area wasn't too crowded and we were seated right away. We had tried to come here before on a Friday night and they had an hour wait. We got the fried squid which was really good. It looks like a small portion when you first get it but it's the perfect amount. We both got their special combo. You get to choose a fish of the day and 3 sides. It is a lot of food for a great price. I got the Porgy. It was delicious! One of the best fish I have ever had. All of the sides were amazing. I had kale and avocado salad, mac 'n cheese, and sweet potato fries. My husband got the haddock, which was also really good. Our server was extremely nice and helpful too. We will definitely be back!", "author": "Bailey A."}], "servesCuisine": "Seafood", "priceRange": "$11-30", "name": "Seamore’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/PWD7eiyZJqEHk6zZKNoi6Q/ls.jpg", "@type": "Restaurant", "telephone": "+17186636550"}