{"aggregateRating": {"reviewCount": 76, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Went here on the recommendation of a friend and I'm so glad I did! It's a fun atmosphere and the staff are friendly. I got the crispy fish burrito with sweet potato fries, very good! My husband got the lobster alfredo and it was delicious. The cocktails were also great. I recommend the hook, line + sinker. If you haven't been here you should try it!", "author": "Brittany P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-02", "description": "Had drinks and dinner the other night, happy hour was great. Girlfriend had fish and really enjoyed it. Would rate higher, however the burger was a disappointment. I know one doesn't go to seafood for a burger, however I don't think that means stop trying. Basically a particularly expensive McDonald's burger - obviously frozen, two thin patties that honestly tasted like MCD - I would fail a blind taste test. Please try harder, we want to like this new addition to the neighborhood. Also, have a look into the fly situation in the men's room, not great. Hard grade here, but room for improvement.", "author": "Chris P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-20", "description": "Lived in the neighborhood for 20 years and was happy to see this type if place opening up. This was my 2nd visit here and overall we've had good experiencs. We started off with the mussels and fried squid (calamari).  The squid wasnt crispy at all and honestly disappointing. The mussels were good although it seemed like some of the actual mussels were cool while the broth was really hot. Its almost like they cooked the mussels separately, let them cool and then dumped the hot broth over them.\n\nFor mains we had the fish tacos, both crispy and grilled. Both were tasty and were a good size, there are 2 per order. \n\nOverall it was a good experience and we'd go back again.", "author": "P K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-13", "description": "Our group of 5 had an excellent experience here last Friday.  We were a little late with our reservation and they let us change with no fuss.  After our first round of drinks a group of 20+ called and asked if Seamore's could accommodate them, which required us to move tables.  We would have gladly done so anyway, but in asking us if we wouldn't mind, the manager was extremely apologetic and told us he'd make sure it was worth the inconvenience.  And that he did.  They comped us a round of drinks (and then some), and he and the wonderful wait staff checked in regularly to see to it we were enjoying our night.  Honestly, we didn't think the change was a big deal, but that they did, to us, was the sign of good and thoughtful customer service.  We'll certainly be back!\n\nAnd FWIW the scallops were fantastic, too.", "author": "Clayton S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-10", "description": "Great service but once again disappointed with food. I have been there twice now and both times- a real lack of flavor. Very bland. First time had the guac and now fish tacos. And it is overpriced for what it is. If it was flavorful and delicious, I wouldn't mind the price.", "author": "Dana D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-02", "description": "Terrible.. took more than 1 hour 15 minutes and no food. Asked the status and server went to check and gone for another 15 minutes. Still no food and we had to come out paying for the tea. No apologies or even an offer to say, sorry for the trouble, please don't pay for the $3 tea. Avoid at all costs... There are way better places in and around the area. Our Big mistake is your gain.", "author": "Dileep K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-16", "description": "Service is really good，but the food is just awful. Tuna poke is good，lobster mac and cheese is just aint right. Fish main course with heavy cheese，I dont know whats going on.", "author": "Yalun Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-16", "description": "We just went in for drinks and some light food.   The service was terrible.   They didn't come to our table for 15 min.  Then they didn't come back to get our order for another while.   And then the food didn't come until we had to go.  The waitress was not there.   I had to ask the bartender for silverware, boxes and the check.   It's just not worth it.   The food wasn't good enough to deal w this kind of service.", "author": "Old Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "Excellent place. The guacamole and the Lobster Mac \u0026 Cheese was delicious. Food came fast and the workers are lovely. Clean house and bathroom.\nGood for kids.", "author": "Tiago V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-11", "description": "We went in late on a Thursday night yet they were friendly and non-rushed. Great, knowledgable servers and the food was good. Decent portions as well!", "author": "Bruce G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "This place is amazing! Super clean, staff neat and professional. The bartenders are great! Shouts to Leo delivering every drink with a smile. This place def gives off great vibes. Very Modern. Sorry about my pic I drank some and ate my food before I took it  trust me the presentation was great.", "author": "Krystle G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-12", "description": "Seamore's in the Dumbo section of Brooklyn is brand new and perhaps they still have some wrinkles to iron out. \nFirst off I don't normally go to such \"in\" places but it was an old friend's birthday dinner and that's where he wanted to go so...\nFirst off before I even get to the food I have to say that it was really, really noisy in there. Restaurants just don't seem to get that all hard surfaces don't make for an enjoyable eating experience. We could've shouted to each other and no one would've noticed! \nOn to the food:\nWe each had a glass of the Cabernet Sauvignon which was excellent. (I should've ordered a whole bottle.) We shared the Charred Broccoli with some toasted onions on top, and the whole thing was pretty good although it was meant to be a side dish and not served as an appetizer. \nHe had the Lobster Alfredo and I had the Shrimp Amaticiana. I must say his dish was \"the\" winner of the night with a creamy and very tasty sauce on the fettuccine and lobster pieces. Mine was a pretty regular dish of shrimp and rigatoni with a red sauce-not very imaginative.\nWe probably should've tried The Real Deal/Daily Landings which looked really interesting but it involved way too many choices for me. \nThey have just two items for dessert both ice creams. And I must say that the Chocolate Peanut Butter ice cream was the perfect thing for a 65 year old going on 5!", "author": "Larry C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "Great place in Dumbo! We split the crispy squid to start and got the shrimp tacos and gazpacho as an entree. Everything was delicious! Very fresh ingredients.", "author": "Katie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "Went for brunch on Saturday. The service was amazing. Our waiter was helpful with recommendations on beer selections. The food was awesome, had shrimp tacos and tuna poke. They played great music too! The place is all white and has a Beachy feel perfect for summer time. And the location is on a cobble stone street in dumbo. It's really the perfect spot... will definitely be back.", "author": "M L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-31", "description": "So excited about discovering this gem!\n\nThis was our first time here and were pleasantly surprised.  \n\nThe layout had an spacious, loft-like feel, complemented by an unassuming open kitchen off to the side. Our meals came out quickly and were absolutely scrumptious! I got The Reel Deal, which consisted of my choice of one of the Daily Landings fish specials (porgy), a yummy lemongrass sauce, and 3 sides. While it's challenging to make healthy food taste good, this place got it right.\n\nFor any keto (and paleo) dieters out there, this is the place. Just be sure to check with your server on which sides contain added sugars.\n\nWill be coming back here on the regular!", "author": "Tanya N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-24", "description": "Phenomenal food. Brunch was excellent. Extremely fresh fish.  Need some operational work, as they're quite newly opened. But overall, very happy. Note:  VERY kid friendly.", "author": "Jon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-28", "description": "Great addition to the Dumbo restaurant scene. Went on a Saturday night and it was packed but we were seated promptly for our 8:00 reservation despite us running a bit late. My husband got the beer battered fish sandwich and I got the blackened shrimp tacos... both dishes were excellent.  As other reviewers have mentioned, it can definitely get loud on a busy night... this isn't your quiet candlelit dinner type of place; it's more of a hip and lively vibe. We'll definitely be back.", "author": "Dorothy J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-24", "description": "I loved this place!  Staff was super diverse and friendly.  Out Waitress was great!  Lob Cobb salad was awesome.  Hubby had a fish sandwich and he really enjoyed it and is very hard to please.  Sadly, my kid was not happy with her fish cake beniege.  Can't make everyone happy.  Creative and bright space.  Bloody Mary was delish!  Can't wait to come back.", "author": "Nicole T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-09", "description": "Omg been to Restarant's in all 50 states first time. Hanged for a second soda. Are you kidding me. Costs less than a dime. Makes the experience feel very cheap", "author": "C Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-24", "description": "Service was beyond poor, left after 35 minutes of waiting to be asked what we would like to order. Music was too loud for conversation and unfittingly hip hop- you're a sustainable seafood eatery, not a rooftop bar. The community tables are low tops, which is quite awkward versus high tops for constant movement and conversation (which the music is too loud for anyways). It's a shame, the space is quite nice. Will hopefully try to eat there again in a month to see if they have the Dumbo feel down.", "author": "Tanya M."}], "servesCuisine": "Seafood", "priceRange": "$11-30", "name": "Seamore’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/PWD7eiyZJqEHk6zZKNoi6Q/ls.jpg", "@type": "Restaurant", "telephone": "+17186636550"}