{"aggregateRating": {"reviewCount": 76, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "Nice spot. Lively ambiance. Good music. Staff are accommodating. Food is fresh and delicious. Poke a must try. Excellent service.", "author": "Frank P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-02", "description": "Just had drinks here which were really good, but the service slacked off after a few more customers came we didn't even get asked for another round or anything at that matter so we decided to just get our tab and leave.", "author": "Latisha G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-29", "description": "WARNING: The restaurant charged me for a tip amount that was higher than what I left, which was easy to confirm since I took a photo of the original signed receipt before leaving. Not sure who was responsible, but this was clearly a fraudulent charge.", "author": "Christina E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-28", "description": "one restroom (.. long waits), very dark, very noisy. charges for bread (3 \"sticks\" for $2).", "author": "Can C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "Amazing food and awedome atmosphere! I eat here several times a month. The food, management, and service is flawless. Mandatory visit required for all my out of state guests  :-).", "author": "R A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-28", "description": "Great food! Beautiful ambience. Slight delay in getting all our food. Seafood gumbo was delicious! Lobster fettuccine was a hit. Guacamole was a good start! Cool bathrooms!", "author": "Claudia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Good portion. Recommend the bluefish and pasta is big size too. The chef's special is unique. $83 for two people. Price is not bad.", "author": "Summer Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Great new addition to Dumbo. The drinks were very good. Service was excellent. Would definitely return.", "author": "Montgomery J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "I live in the neighborhood and was walking home from the ferry on Friday, July 13 and past this restaurant at happy hour. I've been here once before and it wasn't the 4 stars others have rated it but, to each his own. I sat at the bar and had a clear view of the open kitchen and the people who were working there, especially those cooking at the stove. One of the cooks, wearing a blue baseball hat was cooking a pasta dish. He reached into a large pan with a utensil and grabbed a large mouthful of noodles and, just like you might do at home over your own plate, sucked the spaghetti up into his mouth using the pan, and the contents therein, to catch that which might be dripping from his mouth. After swallowing, he took the remaining contents of the pan, placed it in a plate , which was then taken to a table to be consumed by a customer who knew nothing of the disgusting manner in which it was prepared. I paid for my drink, informed a youngish, bearded manager of what I witnessed and why I was leaving, and left. AVOID THIS PLACE!!!", "author": "Kevin B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-28", "description": "I was so excited to go to Seamore's in DUMBO because I LOVED the one in Nolita and happy to have one closer to my apartment. I raved about it and invited my friends from out of town to meet me for dinner. I was very disappointed once our dinner came. Our sweet potato fries were ice cold, the brown butter sauce was oddly spicy and the kale and avocado salad had no avocado. When we told the waitress, she gave us an offensively small avocado (about 1/4 )on a small plate for the whole table to share. It was very strange.", "author": "Jenna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-29", "description": "Popped in here for happy hour and had a great half hour. The oysters were on point, the draft list was concise, and the ambiance was super comfortable. Special shoutout to Phil, he provided wonderful hospitality and conversation (I was dining alone, and it's hard to find a bartender who's chatty without being overbearing). I'll be back soon for sure!", "author": "Nathaniel L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-23", "description": "We liked Seamore's in lower Manhattan, but recently at the Dumbo location found the portions of the (completely delicious) fish of the day a bit small for the $24 price tag. They should add a couple of ounces, at least. And a couple of the sides are lackluster: The mushroom ragout was gummy and bland, with one-note seasoning (thyme?); the beets with ricotta was better, though it's mostly sweetness. The kale salad is a keeper, though. Beautiful room and nice service.", "author": "C.K. W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "We are tough on new restaurants in our hood.  BUT, 1 time in we are very impressed. 5 stars despite 1 issue, music too loud and bad acoustics.  But otherwise great.  Friendly enthusiastic and knowledgeable for mrs restaurant staff.  Very attentive service )almost overly but I'll take it!). And quality food particularly for price.   Poke exceptional.   And both fish dishes excellent.  Several(maybe 5) folks came by to say hello and check on dinner. I think the last was mr Chernow who was very nice.   Let's hope they keep it up.  It'll get busy in the summer.", "author": "tom n."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-23", "description": "Having been to Seamore's more than I'd like to admit I thought I could provide some deep existential insight into the experience of Seamore's. I think it's important to preface that all the people who work hard waiting, cooking, cleaning and hosting are very nice. That being written the place is fading faster than a bar of Ivory soap in a hot shower. When we first went here we (My wife and I....that sounds strange, \"my wife and I\".....I apologize hon, you're not a possession) we looked at each other and spoke the same words: \"Finally, another option in the hood, we don't have to go to Westville when we are too lazy to go father than 500 yards from our front door\". I jest. Of course we didn't say those exact words but it's close to what I remember. But I digest. Ok that was just silly. Full stop. Our first few visits there were perfectly acceptable. Everything was prepared well and served promptly and politely. We got comfortable. After the last few visits we again looked at each other and simultaneously spoke the words: Is the food not that great anymore, is this place OTL? (Off the list)\". Again it's close to what we said. We concluded that if we want a good battered fish sandwich with a Poke starter this is where we will go. Anything else..........nope. So I suggest exactly that. If you have a hankering (who says hankering?) for a fried fish sandwich get to Seamore's. Anything else swipe left.", "author": "Tom Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-24", "description": "Service was definitely poor. The restaurant lost our reservation, had to show them the confirmation text I received from Resy. Then our party of three adults were seated in a super small table for two. Next, the got our order completely wrong. Definitely not going back.", "author": "Joan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-03", "description": "Came in as a walk-in on a Monday night and we greeted and seated immediately.  Nice ambiance and friendly service. I did not get the name of our server but she was professional and very knowledgeable about the menu.  Cocktails, appetizers and entrees were excellent. However, transition times between appetizers and entrees were unacceptably slow.   When the food arrived some of the order was wrong.  Not a huge deal but still not a great first impression. The GM, Alexander, apologized about the kitchen as they did have a large private party.  He made sure we were taken care of and did offer to pick up our tab, which we politely declined but he did it anyways.  The fact that he went out of his way to make us feel like they really did care will bring us back to the restaurant to give it another shot.  Any other circumstances, we would not be back.  With so many options to choose from now in Dumbo we just wont come back to a place if we are not impressed the first time.", "author": "Avril D."}], "servesCuisine": "Seafood", "priceRange": "$11-30", "name": "Seamore’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "66 Water St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/PWD7eiyZJqEHk6zZKNoi6Q/ls.jpg", "@type": "Restaurant", "telephone": "+17186636550"}