{"aggregateRating": {"reviewCount": 33, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-13", "description": "TL;DR - Wholesome, hearty and big portions.\n\nYou're pretty much spoilt for choice in this food hall, but Foragers offers something a bit more traditional than some of the other outlets... you're basically getting a roast dinner here - and it's totally worth it!\n\nWe arrived pretty late in the day, so not all of the items on the menu were available. We had a quarter chicken each, and a selection of sides... even though they weren't our first choices, everything we had was tasty and delicious. \n\nForagers also has the advantage of having some dedicated seating which saves you the hassle of wandering around trying to find a seat with your huge tray of food!", "author": "Paul B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-24", "description": "I found their mac and cheese to be a little bland and underwhelming. Their cauliflower rice also doesn't really convey any of the curry spices that gives it its color.\n\nI had a great time eating their spicy braised greens! The curry for their curried tofu is a little watery and under-savory, is nothing wow but enjoyable enough. \n\nVery kind, quick service here though.", "author": "Nancy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-30", "description": "I'm giving Foragers a solid 3 stars. I've passed this food stand plenty of times on my way to Trader Joe's, and always admired that they cook home-styled meals with organic ingredients.\n\nI decided to get the entree with 3 sides for $12. I thought it was priced fairly considering the large portions they give you. I ordered the chicken breast with a side of braised greens, sausage stuffing, and brussel sprouts. I enjoyed the braised greens and sausage stuffing a lot. It felt like thanksgiving dinner. My chicken breast was on the dry side and the brussel sprouts could of used more flavor. \n\nWith all that said, I would like to come back and try some of their menu items. For the most part, the food was good. I'm interested in seeing what the Mac and cheese taste", "author": "Xenia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-02", "description": "Came here to pick up lunch a couple of times in the Brooklyn Dekalb  market hall. Tried the quarter free-range roasted chicken with 3 sides - you get to select your 3 sides. Good portion for $14. A little on the pricey side but filling and good. The side options do change...so one gets to try different sides each time. The sliced veggies, brussel sprouts and sweet potatoes are good. Usually about six side options to choose from.\n\nNote: They only take credit card, no cash.", "author": "Winny L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-22", "description": "Paid about $13-14 for lunch here which consisted of 1 protein and 3 sides. I got chicken, sweet potatoes, kale, and Brussels sprouts. This spot and the choices kind of reminded me of dig inn. But I prefer dig inn over this place any day. \n\nThe chicken was breast so it was super dry. It comes with lemon vinegar which didn't really help with the dryness. The sweet potatoes were the best part of the meal. Sweet and spiced and cooked well. The veggies I didn't like at all. I wanted Mac and cheese but they didn't have it that day..bummer. There weren't much other options actually. The veggies were really bland. Boiled, hardly any seasoning besides salt. \n\nThis meal was kind of disappointing. I thought the chicken would be better than that. I also didn't think it was worth the price. I'd rather check out the other options at Dekalb market.", "author": "Alice X."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-28", "description": "Meh. I've gotten food here a few times, and used to think it was alright but this latest time was pretty underwhelming.  Mashed potatoes were soupy.  Roasted cauliflower was bland and mushy.  Arugula salad was drenched in dressing.  And only employee there looked over it.", "author": "Kirk P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-16", "description": "Reviewing the butcher. The pork belly is amazing and you should definitely buy it. The sausages are hit or miss. The skirt steak was pretty good. They source everything from Hudson Valley, which is nice. However, like everything else at DeKalb Market Hall, you're paying a premium. If it's convenient, go ahead and buy from them. But I'd prefer going to a place like Paisano's or Esposito's.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-24", "description": "Ate a casual lunch here consisting of meatballs, sweet potatoes, brussell sprouts and roasted carrots... this place has a similar feel to Dig Inn HOWEVER this eatery doesn't seem to hit the same quality as Dig Inn does... don't get me wrong the food is good but DI is better...\n\nThis place is located in the DeKalb Market Hall at City Point which is a mammoth food hall consisting of around 40 diff. vendors", "author": "Daniel L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-20", "description": "Pros:\n-Sweet potatoes and chicken are so tender!\n-Decent sized portions\n-Discount during weekday lunch 11-3? Seems like it's $9.45 instead of typical $13.75\n\nCons:\n-Chicken is on the bone which is a little annoying\n\n--\nChicken and sweet potatoes are a must! The chicken is fall off the bone tender and the herb(?) seasoning is delicious. The sweet potatoes are similarly soft and flavorful. Skip the brussels sprouts and the roasted cauliflower if riced isn't available.", "author": "Laura D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-31", "description": "$13 for 4 sides (tofu is considered a side now). I got the tofu curry, which I would not get again, I felt the tofu was not marinated in the curry for very long so it did not take the flavor of the curry. The mac and cheese was very creamy and delicious. Brussel sprouts were on point and they were topped with what I believed were sesame seeds. The last thing I got were the braised collard greens which were pretty standard.", "author": "Tassamai S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-22", "description": "The chicken is too salty, chef is heavy handed with the salt! Left there with a headache because of the sodium", "author": "Art P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-08", "description": "So, I actually really like this place! They definitely could use some improvement but I can see the wheels turning and I know they have the potential to get there some day. I've had a couple of their offerings but most recently I went for the quarter chicken with braised greens, Brussel sprouts, and cauliflower rice as my sides. Overall, I do think the food could benefit from more seasoning (simple things like salt, pepper, garlic) to make the food really stand out. As it is, it is healthy food with a \"healthy\" taste, but with the right amount of oil and seasonings, the food could be just as healthy and with full flavor!", "author": "Sam E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-02", "description": "This review is solely about Foragers at Dekalb Market Hall. Overpriced, bland and not sure why they are in part of this food hall. Food Halls are supposed to be curated, specialty food items... not deli hot plates off a buffet.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-27", "description": "disgusting....the food was very disrespectful to human being because its nasty. 13 dollars for the food is a big rip off. i rather go to whole foods and pay 20 for better food or any frozen food.\n\nthe cashier however was extremely friendly and nice. would go again just to talk to the cashier  but not eat.", "author": "Kevin O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-05", "description": "Visited the DeKalb Market Hall with two friends. We had a look around and most of the vendors appeared overpriced. I eventually decided to try Foragers Rotisserie. It seemed the staff had not \nbeen trained prior to service. They were learning on the job. The staff member serving did not know how much a  quarter chicken is and initially cut a tiny piece until a colleague said to cut a half and half again. Having not trained prior to entering service it was not a clean cut\nThe chicken tasted oily like it had been partially fried to speed up cooking and later I was left with indigestion. This disappointed me and particularly given the price. I'd have also liked to see something more about the type of chicken they use, free range organic or battery produced I suspect.", "author": "Victor A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "I went here on the evening of January 24,2018, I was attracted to the place because of the food being organic. I got the chicken with three sides- salad, kale, and Brussels sprouts. The salad was delicious with the lemon side dressing they gave me. The Brussels sprouts were good as well especially the crunchier ones. The kale had a little kick to it maybe cayenne pepper? The chicken was dry which the server warned me about, but the seasoning on it was good. The portions are huge- I had plenty to eat and take home with me! I did re heat everything (in an oven!!) when I got home and added some extra fat (butter and bacon grease) to the chicken and it was much better - not dry. \nMy friend got the meatballs that supposedly have ricotta in it but she was hard pressed to find any cheese. She had carrots,sweet potato and something else that she was happy with. She also had more than enough to take home. \nI would go here again but this time during the lunch rush (yep I'm insane!) just to try to chicken when it's hot and fresh.", "author": "Kia A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-30", "description": "This place is in need of a new food-warming system. While the flavor of the food tastes good, the portions are decent, and the staff are nice, the food in my plate was either lukewarm or completely cold (this included the meat I got). Dekalb Market is such a lovely place so I hope to give this spot a go again, but only after they've fixed this issue with food temperature.", "author": "Rob C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-25", "description": "We really liked this place. They gave a large portion of food. I was able to eat half at lunch and keep the other half for dinner. I had the meatballs, mac-n-cheese, and brushed sprouts. All were really good. They don't use a lot of seasoning and everything is pretty healthy.", "author": "Bailey A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-01", "description": "This place was packed the last time I walked by on the way to Trader Joe's. Came tonight at around 9pm so most of the food items were already gone so that I understand. However, the broccoli was slightly hard and the roasted chicken/herb rice was way too dry. The only decent thing were the rosemary potatoes. For $13 the portion was acceptable and could be split into 2 servings for me. Overall, I think the quality of the food could have been better but granted I did catch them 1 hour before closing.", "author": "Kimberly P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-15", "description": "oh my god my heart feels filled with love.. amazing, healthy and fresh food!!!!! this is going to be my new spot", "author": "Michelle M."}], "servesCuisine": "Chicken Shop", "priceRange": "$11-30", "name": "Foragers", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nDekalb Market Hall", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1MbcectNZlwMmkP6EY-iSw/ls.jpg", "@type": "Restaurant", "telephone": "+19293790449"}