{"aggregateRating": {"reviewCount": 33, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-11", "description": "Foragers at DeKalb Market is ok. The format is that there are a couple of proteins (meat) available, and you choose three vegetable sides to go with the protein of your choice, for $13. If you just want a couple of sides they'll give it to you in a container for $5. (I don't know what it would cost to order just the protein.) I had cauliflower rice and collard greens, nothing special, but good enough. My companion had roast chicken which he thought was great, plus three sides, and he was totally happy with the generous amount of food he got, and the quality too. \n\nNext time I want to eat something at DeKalb Market, I'll try a different food vendor. There are too many choices to stick with the same thing every time. However, if I want my vegetables, Foragers at that location would do the trick.", "author": "Pandora B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-04", "description": "Food- The broccoli is extremely undercooked and in need of some sort of flavor- butter, oil, salt, anything. This is not comfort food. The root vegetables were cooked perfectly and quite good. The Mac and cheese was tasty but dry. And last but not least the butcher special of the night was braised pork, and it was quite lovely but could have used more sauce. \n\nService- The young woman who was serving me was coughing the whole time she served me. Go home you're sick!", "author": "Tyler H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-30", "description": "Great, healthy, tasty food options! They have a cool, $12, meal option (1 protein + 3 sides) that's really convenient. I had the roasted chicken, mac and cheese, sweet potatoes, and Korean zesty cucumber salad. Everything was excellent except the cucumber salad which had too much of a sesame flavor for my personal tastes (it was super fresh though!). They had another daily protein (Italian sausage soup) and multiple sides that looked interesting and good (creamer pot totes, roasted veggies, salad, quinoa, etc.). Customer service was great and swift. Would definitely recommend.", "author": "Courtney M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-08", "description": "This review is specifically for the young man working today at around 12:15pm - he was an absolute delight! He was friendly and attentive and never stopped working. He even checked on me to see how I was enjoying the food. HE IS A KEEPER!", "author": "Ashley M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-09", "description": "Not bad. Not great. I ordered the chicken with three sides. The best thing was the brussel sprouts. Sweet potatoes, apple w/greens salad, and chicken were all ok but seemed to all be missing something. The food is well prepared but flavor wise there is something that just seems to be lacking a bit. Don't get me wrong like I said it was well prepared and it's healthy but not something I'll be running to get again.", "author": "Ladislao B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-23", "description": "For a grab and go place, this vendor is really slow - it's a new place, so I want to give them the benefit of the doubt but customer service is a problem.\n\nI got the chicken salad.  The salad was tasty but was quite pricey for a simple salad ($13).", "author": "Brandon P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-01", "description": "Pricing and menu signs are misleading and we were surprised while ordering (only 2 sides allowed) and at the cashier after making a choice according to what is displayed. The chicken tasted ok however it was lukewarm. The sides were disappointing  because of the lack of flavor. So many great options at Dekalb market that we will definitely not come back to Foragers", "author": "C F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "So happy to have a great butcher in the area. They just opened recently so they will have more options coming soon but so far everything and everyone has been great. The butchers really took time in explaining and answering my questions. He even gave me some advice when I told him I wanted to make liver pate. I will continue to shop here and I appreciate having such a great place to get my brisket, chicken and lard!", "author": "Danielle A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "healthier option on the floor and  good quality of meat and veggies; good for weekday lunch", "author": "Jeremy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "This butcher is amazing. The prices are very fair and the staff are excellent. Every time I've visited the butcher has been very friendly and even offered up a few recipe suggestions. Definitely will keep coming back.", "author": "Gregory T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-20", "description": "The chicken is ok, but all the sides are bland disappointments. So many good places in the food hall. Unless they up the quality of their food, I'd give this a miss. Better places in alphabetical order: Arepa Lady, Bunsmith, Eight turn crepe, Likkle More, and Wilma Jean.", "author": "Noah S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-09", "description": "This was a great little stop. Very quaint. I would definitely go back. Really cool neighborhood. Great service. Tasty bites for pretty cheap. In a cool food market in the masement. So many choices of food in the market. Great fresh food here.", "author": "Burton M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-20", "description": "Have tried many great vendors in Dekalb market and decided to try Foragers this afternoon for some snacks.  Ordered side of kale and Swiss chard along with squash soup and mac \u0026 cheese.  The soup was ok but the sides were overpriced ($5ea) and terrible.  The kale was flavorless along with the mac \u0026 cheese which was also under cooked, had something randomly sandy in it, and was dry like it was left out for a while.  Staff also wasn't friendly.", "author": "Scott W."}], "servesCuisine": "Chicken Shop", "priceRange": "$11-30", "name": "Foragers", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W\nDekalb Market Hall", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/1MbcectNZlwMmkP6EY-iSw/ls.jpg", "@type": "Restaurant", "telephone": "+19293790449"}