{"aggregateRating": {"reviewCount": 42, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-09", "description": "Really didnt like the vibe in this place. This is the only halal place that has ample seating but it was so hot and I could feel the heat emanating from the kitchen. I didnt really care for the people serving me. The guy was hostile and asked me if I had paid when I had literally paid a minute before to his co worker that was standing right next to him. Then I couldn't reach the strays it was so high on the counter and asked him for help. He just started mumbling in Arabic. Now I am not arabic speaker but Regardless you shouldnt be talking to a customer or mumbling when they are speaking to you in English?! Anyhow the part that made me really angry was when I was trying to throw out the trash and a group of guys wanted to pass. They werent willing to wait but also werent willing to say excuse me to me either. One of the counter guys actually yelled at me \"your in the way\"! When I turned around and said \"excuse me\" he got quiet but then just started cracking jokes in his language which made the other customers laugh with him. Are you kidding me?! As a single female I was totally uncomfortable with this behavior. Not female friendly at all seems like a den or hangout spot for Arab guys. God know what crap was coming out of their mouths but next time rest assured I wont be spending my money here. So much for being friendly for everybody as as all muslims whether they are arabic or not! Disgusting!", "author": "Anam S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-10", "description": "found myself here one evening as i could not find some interesting place to eat at the nearby mall (i didn't want to go Starbucks, McDonalds, Subway, etc--at least for that night). well, this is a nice food place for discovery for a dinner way past 7:30ish in the evening in that part of Brooklyn. i had a white fish dish, with yellow rice pilaf with brown beans - i enjoyed it \u0026 came out full such that i had to ask for coffee! staff was friendly, with a lot of \"brother\" thrown in while serving you. it's actually  a no-nonsense place for eating, with middle eastern items pasted on the walls.\n\nwhile having my dinner, i saw a lot of interesting characters, literally, walking to \u0026 fro, that got my mind into thinking, and smiling to myself, as they look like characters on TV and the papers LOL. they must have been giving me glances, too, as i wear long hair myself LOL. btw, the coffee tasted great, \u0026 it was just for a buck, cool!", "author": "Jerome Espinosa B."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Halal International", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "574 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/H8FlO4AvQ20zQSeGrUCfNQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182469700"}