{"aggregateRating": {"reviewCount": 42, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-17", "description": "Truly a basic Mediterranean food hall for the mass. But seriously a $16 for a dish of lamb and rice. :(\n\nI was excited to come here for a quick bite because it was cold and windy outside. This place seems to be perfect for a casual bite. The interior is very bare minimum with chair and table as well as a self service garbage can. I felt like coming to a high school cafeteria. \n\nI was hoping for a ox tail however they are out. Their price list is super super confusing and I will suggest you just get what your heart wants and expect to pay a little extra. Disappointed with no ox tail, I settle with lamb and rice but didn't realize it was $16. Oh well this is prime real estate. Don't get me wrong thou. The lamb is delicious and I will say garment if packaged better. \n\nService is none. You will wait at the counter and pick your food. Clean up after yourself and go. Being honest, I think they should spend some money on renovation and clean the table a little bit. \n\nOther food they have included hummus, Mediterranean standards and a whole fish which is amazing. I might come back for another try.", "author": "Kevin Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-29", "description": "I've grown up eating here, I can't believe I've never left a review! Ok so the food is great but -1 because every once in a while the food doesn't live up the the craving I went there with. Guess you can't always be perfect.  ‍", "author": "Princess S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "I can't argue with $7 pita sandwiches (with white sauce) and $1 baklava. You can also get a pint of hummus for $5.", "author": "Julia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-31", "description": "I was skeptical that the food here would be oily and flavorless but I couldn't have been more wrong! The lentil soup is delicious as not at all greasy. Richly garlicky and generous amounts of turmeric for your immune system, as well as real onions and tomatoes not just soup stock. Big bowl for $5, can't beat that!", "author": "Suri M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-30", "description": "I was really hoping to love this place. Unfortunately, it was extremely disappointing. It's way more expensive than the halal carts outside, for what is actually less food. I understand y'all gotta pay rent and utilities but dang. My gyro had literally one teeny tiny cube of tomato. Didn't taste fresh. Chicken dry and bland. Just overall very frustrating, especially for what it cost. Maybe it was because we went so late at night.", "author": "Jocelyn M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-02", "description": "Taxi cab driver paradise.  The immigrant working class's restaurant. \n\nThe interior is run down and reminds me of restaurants in Yemen. Defiantly 3rd country vibe when it comes to interior.  They got steam tables and make gyro or shawarma sandwiches. \n\nPeople serving are kind and speak both English/Arabic/and African languages to serve the customers.  \n\nI got a half chicken with Veges instead of rice.  Side of hummus, and 1 kofta.  There are a lot of varieties of chicken and beef.  The influence is Arabic \u0026 Indian like with curry style options.  The baked chicken is kind of dry.  Hummus is mad good and so was the salad and stewed carrots.  Kofta was nice, nothing to rave about.  \n\nThe platters are nice.  I had gyro and chicken platters before.  Nothing amazing, like most carts but pricier. \n\nI'd come back again to try the gyro sandwich but I'm assuming it's like everything else, basic. \n\nBasically a no frills joint with some basic Arabic/Indian foods that are kind of pricey and leave you like \"mmmmmm okay\"", "author": "Ahmed M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "Great no frills halal. Slightly more expensive, but much higher quality than the  truck down the street. I had the chicken platter which was excellent and not too heavy like some other platters I have had in the past. The Arabic spice was authentic and not too spicy. They also use cardamom in the seasoning which was a nice touch. The service was excellent, very respectful and hardworking people running the place. Lastly, they gave me a free piece of Baklava. As a Greek-American, I can say that the Baklava served here was some of the best I have had in a long time.", "author": "Donald J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-24", "description": "This is the place the family and I head out to get some really delicious organic halal food when we are taking break from shopping or just in the downtown Brooklyn area. The Mix Gyro is our favorite and the serving per size is abundant and hardy. The curry chicken and rice platter is scrumtrulescent!\n\nThe service at this place is quick and responsive your needs. You get what you need and that is why we cal this place our little hot spot for a quick bite or just a place to catch our breach and renutritionalize our bodies with some hardy health halal-organic home cooked meals!", "author": "B M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-29", "description": "Came here 3 times for a falafel, and was satisfied each time. For the price and size of the falafel you can't go wrong. They put hummus, good salad (not just lettuce and tomatoes, but also cucumbers and some other stuff) and the hot sauce is perfect not too spicy. \n\nFriendly service, I will stop by whenever I'm in the area", "author": "Waleed A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "This is the ONLY halal spot I go too. I don't trust the carts.\n\nI always get the chicken and lamb combo platter with rice and salad.\n\nThe food is SO good. The food is always fresh and the guys are super friendly.\n\nThe baklava is also good.. haven't tried anything else here, but I'm sure it's all delicious.", "author": "Adri P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-22", "description": "Food is great. Wait staff is courteous and friendly. I suggest the lamb and okra if you like okra. BUT the reason I am giving it 3 stars is the atmosphere is AWFUL. Some of the people that sit around that place and \"hang out\"  ruin it. The other day I was eating in there and some men were in the back playing obscene rap music and one man called me baby. I thought to myself if I wanted to be in a bar/club atmosphere I wouldn't be in a Halal restaurant.", "author": "Andrea K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-05", "description": "I got a small #Oxtail. It was so good. I was sucking on the bones. My fingers smelled like #Oxtail when I met my friends afterward.", "author": "FakeFoodBabyNY C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "Ok ok...I am a regular diner here, so much so, that they know my order -  a chicken gyro sandwich with lettuce, green peppers, cucumber salad, and bbq sauce or honey mustard sauce for just $6.50. You cannot beat that bargain and it's hearty enough to hold you for a few hours. The staff is always friendly and willing to guide you through their menu. They're experts at helping indecisive customers weigh their options and choose. There is always a lunch rush, who knew halal food was so popular across cultures.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-31", "description": "Im giving this two stars just because the service was reasonably good. But paying 11$ for chicken over rice is unreasonable when in any cart you can get the same thing for $6. The fact that the rice was undercooked didnt help the case.", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-04", "description": "What a pleasant surprise! I'm always in the 'hood (Barclays Center area), but this week was the first time I actually stopped to grab a meal. The food is fresh and delicious. I tried the whole Tilapia fish with basmati rice and spinach... yummy! The portions are massive (for me), I actually had the other half of the meal for lunch the next day, and it was still bursting with the same flavor. To top it all off, I broke the diet and indulged in their sweet treats with a portion of baklava and another delightful treat (cannot remember its name). Wonderful experience overall, including the friendly gentleman from Gambia whom attended behind the counter. Can't wait to go back. (:", "author": "Sam B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-29", "description": "I came here because of the great yelp reviews. I was severely disappointed. The food was all completely underwhelming. Nothing about this place is special or very good. The food looks better in pictures. Won't be coming back. I got the lamb and okra over rice. I would have given it 1 star but the guys working here are nice.", "author": "Rahul B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-25", "description": "They cook your food the way you want it and right in front of you. They are not cheap with the meat or vegis. They are very nice employees. Place seems clean and organized.  It's not fancy but the food it AMAZING! :) highly recommend!", "author": "Nora A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-05", "description": "Just ordered a falafel. The white sauce tasted like mayo and overpowered everything else. Didn't help that it was drowned in it. Had to toss it after a few bites.", "author": "g. m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-28", "description": "$7 for a no-frills, small lamb and rice with one side. I had the okra as my side but they also offered beans. I've had better rice dishes for cheaper, but I suppose they have to charge more for having a physical sit-down location. Guy behind the counter was super nice. Would come back and try something else.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "Lamb Gyro was delicious!!! My family stopped in when super hungry and it was better than expected. The looks of the place are not that great but the food was so tastey!! Can't beat $6 for a gyro- gigantic gyro!", "author": "Shalom S."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Halal International", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "574 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/H8FlO4AvQ20zQSeGrUCfNQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182469700"}