{"aggregateRating": {"reviewCount": 42, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-16", "description": "This place was a glowing beacon of falafel - producing magic in the midst of a cold Brooklyn night.\n\nIt was 10 p.m. My friends and I were craving pizza. No pizza (besides Papa John's) was found en route to the N train. OH GOODNESS. We were dying. DYING, I say!\n\nAll of a sudden, we see a Dunkin' Donuts, cautiously turn the street corner in hopes of food, ignoring Atlantic Center and it's Applebee's up the street, and find this little hole in the wall boasting falafel.\n\nSCORE.\n\nThe men behind the counter were friendly and eagar to feed four hungry 20-somethings. They really stuffed our falafel sandwiches jam-packed.\n\nOh, and they had strawberry soda.\n\nOh. Goodness. YES.\n\nBetter yet, the men thought I was British because I apparently said \"strawberry\" with a British accent. They were very disappointed when I told them I grew up in Connecticut.\n\nI know where to go for a quick and satisfying bite next time I'm wandering around that area, whimpering like a sad puppy looking for food.", "author": "Allison C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-01", "description": "My favorite spot for Halaal food!!! Everything is so yummy...esp. lamb with okra and rice. A regular stop. The guys here are really nice too. Must visit.", "author": "Natasha R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "Every time I go to NYC I hit Halal Int. up before I leave. Sometimes it's the only reason I go to Brooklyn. Headed to Mt. Vernon tomorrow and will be stopping in Brooklyn to get some food to go. I always bring home with 4 or 5 plates. Nothing is better than some FRESH tender food.  I've seen them deliver the lamb right off the truck several times.  That's what made me  go check them out.  Love it all.", "author": "L G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-20", "description": "Hungry before pub quiz, I had a difficult decision: Subway (predictable and cheap) or this place, an unknown quantity. Luckily, I took the meal less traveled by (!/?).\n\nFirst of all, the place smells AMAZING--inexplicably rather like my aunt's Italian-influenced kitchen, although there was nary a meatball in sight--with different spices and stews all going at once.\n\nI was overwhelmed by the options which, to my untrained eye, all looked a little like Stuff in Sauce. One of the men behind the counter patiently identified everything and then filled a takeout container with curry and rice. After those two things he looked at me expectantly as though somehow he hadn't given me enough and I might want more! I resisted the temptation to try a little of everything, and got my rice and curry and a vegetable patty (what I would have identified as a samosa).\n\nMy delicious feast came to $7 and oh, was it ever delicious. The curry was hearty but not greasy, and I could definitely taste different spices in it. It was like an amazing, cooked-with-love version of my usual sad halal cart standard. I let my friends try a few bites, but watched them jealously to make sure they didn't eat all of it. \n\nWe went on to win pub quiz that night -- obviously not a coincidence.", "author": "Finlay L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-22", "description": "Was passing around Atlantic av. and craving for some Halal , stumbled upon this place and decided to give it a go. I had a mixed Lamb and Chicken over rice , with white sauce and was super delicious and satisfying!  The rice and lamb were very tasty and not bland like some other places. This place also has a wide selection of dishes and salads , next time I'll try the Okra and lamb.", "author": "Omar N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-24", "description": "Ok place but would sit inside. Place to too congested. Otherwise food is ok depending on your interests.", "author": "Dana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-30", "description": "This place is awesome, and the guys working here really are some of the nicest people you can come across. Also not to mention, that the food is outstanding and they give you serious portions sizes. For the amount of food you get, the price is pretty low, so I would definitely recommend trying it out. I can't even imagine how much I would go here if I lived on Atlantic. Yesterday was my second time here with my friend and both of us can't wait to come again!", "author": "Donald W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "Just moved in today and was dying for a bite when I stumbled upon this gift from the heavens. Super cheap and great portions. I got a falafel sandwich (super crispy, one of the best I've had) and my friend got a grilled chicken sandwich and chicken samosas, both of which he loved.\n\nIt's not a fancy place, so you have to appreciate it for what it's meant to be -- a quick and simple eatery that serves quality food. And the guy who served me was super friendly!", "author": "Johanna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-01", "description": "Don't be put off by the looks of the place (it looks like a dump), but it has the most wonderful food! I had the lamb with okra and salad and the meal was so good that I ended up sucking on the bones (good thing the place wasn't fancier). The lamb shank was cooked to perfection as well. Freshly made baklava was the perfect dessert. Warning: since they only provide plastic cutlery and styrofoam cups, you would do better by ordering 'to go' and take the yummy food home.", "author": "Magda G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-16", "description": "Best halal food.  Hands down. The guys behind the counters are pleasant and would definitely not making the long trip to come back.", "author": "Joe P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-09", "description": "$10 for lamb over rice that lasted three lunches. More importantly though, he gave me an extra sauce to go. That's thoughtfulness. Will return", "author": "Matt W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "The chicken stew was delish! The meat was succulent, well-seasoned and jam packed with wonderful flavors. It was also cooked so well that a plastic fork was all I needed to get the meat off the bone! The only set back was that this restaurant doesn't have AC. However, they do have ceiling fans. The employees made me feel very welcome and if I'm in the area again, I'll definitely come back.", "author": "Nella V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "Excellent. Food delicious. Service is very good and staff are friendly. Inviting atmosphere. Food Summary: 1) Lamb Gyro: Succulent, flavorful, well-seasoned, and super fresh. I have had good lamb gyros from carts. This gyro was great. 2) Baklava: TBA 3) Chicken Samosa: TBA", "author": "Justin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-01", "description": "One of the experience halal In the city,11 bucks for lamb over rice, but better quality than the food cart.", "author": "Erin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-07", "description": "I was visiting from Chicago and decided to go here to grab something to eat.  I had the stewed chicken with rice...OMG.  It was SO good.  The guys there were super friendly and made sure that I was comfortable.  I LOVED it.  I wish I lived there just so I could go again!", "author": "Shannon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-26", "description": "Their turkey wings are slamming, they literally fall off the bone! The rice is very tasty and they give you a lot of food.", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "These guys are really friendly and the food is delicious and very reasonably priced. I don't eat from the carts anymore so this is my go to spot for some halal food", "author": "Daniel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-07", "description": "Food was pretty good. Had the pasta and chicken. Came in on the humbug waiting for concert at Barclay right up the street. Felt weird b/c I was only woman in the joint and clientele mostly Arab men. No biggie though. Friendly and good service from server. Would definitely come back.", "author": "Melvina H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-10", "description": "Seriously, I don't care what goes on here behind the scenes... my mind can wander to many places  in terms of hygine, criminal activity, pious activity, whatever! \n\nIt matters not!\n\nWhat matters is how you can eat your face off with delicious and fresh food on the serious cheap!  There is no reason anyone has to go hungry in Brooklyn. I mean for mere cents you can get a decent meal.\n\nTheir beautiful falafel sandwich is bursting at the seams and is four Dollars.. that's right 4 bucks and I'd venture to say would give Mahmoud's a run for its money.  It's not the best falafel i've had but the salads are super fresh, they custom drop your falafel balls into the rolling deep-fry oil for your sandwhich,  so it's never sitting around. Tahini and hot sauce are good.   This is the ish for lunch or dinner on the go.\n\nThey always have a variety of home cooking for platters of mix and match entree and sides. Of course Middle Eastern delights.\n\nLots of veggie options and enough for the meat lovers too.\n\nNo pork if this is something you want or don't want, now you know.  I never judge people's food choices but I always find it curious how various cultures deem one animal acceptable and another not... (i intellectually get it ) but come one?? I digress.\n\nThis place can feed an army on the cheap.  \n\nDon't expect any ambiance or  amenities... the counter fellows can be on occassion pleasant,  but it really depends.   It's best to take it to go.\nIt's all worth it and let us not forget our greebacks,   Cash only!", "author": "Foodie Mamma X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "First time ordering and will definitely be back. New favorite place for the family. Every single thing was delicious and full of flavor. The chicken with rice and salad with white sauce was superb. My husband had the lamb with rice and white sauce with a spicy sauce. He loved it. Finished every last drop. The cheeseburgers for the kids were perfect as well. Can't wait to go back for more halal food!! Worth the trip in every way!!!", "author": "Helen S."}], "servesCuisine": "Middle Eastern", "priceRange": "Under $10", "name": "Halal International", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "574 Atlantic Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/H8FlO4AvQ20zQSeGrUCfNQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182469700"}