{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-12", "description": "I was there for the first time last night and I was happy I had a reservation, otherwise I wouldnt have gotten in. The food, despite my intial reservation was good. The wine was expensive and for a party of ten, the price wasnt bad. I would go back again.", "author": "Adina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-17", "description": "Really, Noodle Pudding?  Really?  Because we definitely had three bottles of wine for the six of us, feasted like kings and piled on the appetizers and dessert.  So how on earth did our check come out to only $60 per head including tax and tip and everything?  That makes no sense!  This is NY!  You're supposed to bludgeon my wallet like a boar uprooting a fern when I have these nights in this town.  Instead, my belly, my wallet, my heart and my soul left this fantastic establishment plump and happy.  I.  Will.  Be.  BacK!", "author": "Dave G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-14", "description": "Great Italian food.  Its really nice to have this place in the neighborhood.  Just really good food.  Its a good selection of not just the Italian standards.", "author": "Matt M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-28", "description": "I had my fears from all the bad reviews here, but wanted good Italian food, so I decided to risk it.  (I brought a book in case it was really slow.)  The place was slightly less than half full.  The waiter seated me immediately at the best table.  (When you're a party of one, you often get bad tables like near the kitchen.) Service was swift and attentive.  (Maybe they read all the reviews here!)  So that was fine.  Food overall was pretty darn good, not AMAZING, and they provided good portion sizes for the prices. I had the gnocci with butter and sage, a glass of the house white wine, and the pear ricotta cheesecake.  And of course the bread and spicy infused olive oil. It was all quite good. That's all.", "author": "Debra D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-26", "description": "I have to admit that when I first visited Noodle Pudding, I wasn't expecting much. The place, however, I soon found out is a hidden gem. They may be a bit short on variety but for the prices and the quality of food one gets, it really is worth the trip. My personal favorite, and a recommendation, is the Tagliatelle Bolognese. The only thing I would like to recommend to people visiting the first time is be a bit patient; the wait may seem a bit long but it is worth it.", "author": "Divya P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-17", "description": "we LOVE it here and have been coming for years... its cash only, it does get crowded... but that just means its affordable and popular! you can read details and see our pics:\n\nhttp://jazzandjill.wordpress.com/2010/08/03/noodle-time/", "author": "Jillian M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-10", "description": "Just love the hometown atmosphere in this place and have been a patron for many years.  Just went back for the first time in a while and it is as good as ever.  Service is fantastic, food is yummy, and the owner is so friendly.  Everything about this place is perfect, and it is a wonderful addition to the great neighborhood of Brooklyn Heights.", "author": "Sean M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-30", "description": "This place is pretty yum. It definitely stands out amongst the blandness of Brooklyn heights eateries. \n\nThe only complaints I have is the service, while cheerful, is sometimes painfully slow. Usually I don't mind because it reminds me of Italy where nothing is quick, except the espresso.", "author": "Rrose S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-07", "description": "I noticed in some of the reviews that there are some people wondering what all the fuss is about. It's like this: You either \"get it\" or you don't. I will admit that the food is not spectacular and doesn't compare with the best cuisine in the city but it is solid, delicious and home madey feeling. The waitstaff is great and some of them including the barman has been there since My-then girlfriend and now wife- first went over 12 years ago. They are always friendly and helpful.\n      It is a 'regulars' kind of place and a great place for a date or a birthday party. I always go for the specials menu and choose game or lamb. Dipping oil is delicious and you will want at least two helpings. It is one of the few places left where you can still have an old-school New York dining experience. Go for the experience and you will be delighted by the food. Go for the food and you will be disappointed and miss the experience. Enjoy", "author": "Ananda D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-18", "description": "4 stars, because they do not take credit cards.  What's up with that!  \n\nI have been to this restaurant several times, and it has become one of my stand by Italian spots.  The food is not of the same calibre as Al di La in Park Slope, but what Noodle Pudding does, they do very well.  The food is consistently strong.  I usually order off the specials menu, as they offer interesting rotating dishes.  For my most recent visit, I had the mussels in a white wine base to start and for my main course, pasta with a seafood ragu.  The sauces were done very well, always the hallmark of a strong Italian kitchen.  \n\nFinal notes: Noodle Pudding has only a few wines by the glass, but the menu does have bottles in the $30 range.  The staff is always extremely friendly and helpful.  All in all, this is a stand-out neighborhood restaurant.", "author": "Adam N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-20", "description": "$12 bottles of wine, decent food, friendly service, relaxed atmosphere, enough said.", "author": "Jack L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-17", "description": "Went here with my mother and my grandmother.  The steak was incredible, didnt even have to cut it with a knife.  The wine was phenominal, to bad I don't remember the name of it but it was a pino grigio.  Love this part of brooklyn. Makes me feel at home.", "author": "Danielle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-08", "description": "Packed to the door, front windows steamy in the winter and open to the street in the summer, this is one of the most enjoyable places you could go in all NYC.  The food is classic, clearly follows the philosophy of using the best ingredients and staying out of the way.  I've eaten here several times, and each has been a pleasure - from a perfectly grilled bronzino with lemon, salt and olive oil, to the homemade pastas, the best grilled octopus I've ever had (am not a fan of octopus but theirs is truly not rubbery).  And a deep yet decently affordable wine list.  The staff are warm and gregarious and the ambience welcoming.  They genuinely make you feel welcome and not rushed.", "author": "Melanie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-10", "description": "What makes people wait outside for 45 minutes at this no-reservations eatery?  The food.   Amazing food.  Bursting flavors of Italy that make you realize why Italian food is renowned around the world.  Service is actually pretty good, too.  It's crowded, loud, friendly neighborhood vibe may or may not appeal.  No reservations and no credit cards can be irritating.  So, so worth it.", "author": "Kate T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-26", "description": "I went to this place last night with some former co-workers and really enjoyed myself.  Its a cozy neighborhood restaurant in Brooklyn Heights and offers really good italian food. I liked the diverse daily specials list and the wine list was plentiful. I ordered the fettucine with seafood ragu and my table ordered a bottle of pinot noir. Everyone finished their plates. I tasted my friend's risotto w/ of prosciutto and that was very good also. I will definitely be going back.", "author": "Randi C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-28", "description": "Did I order the wrong thing?  I waited 45 minutes for a table.  Fine.  Then manager helped me order.  Great!  I had two specials:  asparagus which was quite good and the seafood spaghetti with ragu sauce.  That was ok.  The prices were very reasonable.  The atmosphere was fine but it was kind of loud.  The waitstaff was attentive and very pleasant.  But why did I go all the way to Brooklyn?", "author": "Carol W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-06", "description": "I've been longing to try this restaurant ever since a coworker recommended it to me a few years back. When I drive by this place it always looks packed and the crowd is buzzing. Finally, I decided to try this place last night for dinner, and....AND I left kinda dissapointed! Everyone knows I rave about my favorite Italian restaurants in Brooklyn and the city, and so I will not be adding noodle pudding to my list. In fact I'm pretty much scratching it off my list. There was about a 10 min wait for a table w/o a reservation and the staff seemed friendly enough. The food was nothing special, especially since we waited about 30 min to get the entree. Very kid friendly, in fact I was surrounded by booster chairs and screaming children. For me - this place is not worth another visit.", "author": "Olga T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-23", "description": "always a pleasure to visit here. the gnocchi is good (perhaps a tad underdone and not enough sauce), the tagliatelle received a rave review. for dessert, the flourless chocolate mousse is sublime.\n\nand the bottle of valpolicella was yummy.\n\nthe service is crisp and friendly, and the atmosphere warm and welcoming.\n\ngo!", "author": "Kenna T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-08", "description": "This place is amazing. On my first trip to NYC I was surprised that the best meal of the time there ( and possibly my life) wad at this small Italian place in Brooklyn! we found it on yelp saw that it got good reviews and saw it was close to a subway station and decided to give it a try on out last night. It was busy but not overly crowded. It got busier after we sat down but the staff remained as attentive as the beginning. There was not one thing that we ate that we didn't like. The Cesar and fresh mozzarella ap was fresh and light, the bread is served with oil that has tomatoes in it and it gave it such a light kick! The pasta was perfect, not heavy with sauce but lightly dressed as it should be. And after seeing the desserts roll our to other tables we had to push our stomachs just a bit more but wow so worth it! The real prize though is the atmosphere. Unpretentious, friendly...and the ability to be the perfect backdrop to a festive party or an intimate meal. We had a party behind us but still felt like we were on a date not raising our voices over their festivities! It is cash only so be prepared for that, though it's worth it and very reasonably prices! Just thinking about it makes me want to fly there just to go again! gooooooo! Also, a short walk to the Brooklyn bridge :) so eat freely and knowing you can just walk it off after like we did. ;)", "author": "Christine L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-14", "description": "Certainly a place I keep going back to again and again whenever I know I'm around this neighborhood. Just always remember to bring cash as they do not take credit cards. This normally would not be a problem but the wine list often has me spending more than I should.", "author": "Andrew D."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}