{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "I was impressed with how good the food was, outstanding service and nice atmosphere!! I would definitely come back!!", "author": "Kristina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "Great little neighborhood place. Great appetizers. Had very good calamari and pulpo. Bruscheta was very fresh with black and white olives. Perfectly cooked mussels.  The entrées were good, not excellent. But that nay be due to us being stuffed by the generous appetizers. We had a great Super Tuscan red wine that went so well with everything. All in all a good experience!", "author": "Hoyman L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-07", "description": "Went there with a party of 6 on a Friday night and actually got seated very quickly which is rare. The service was really good and the food was amazing. Definitely a spot that I would eat in again. \nI had the pork chop and it was very tasty and a huge portion. Give it a try", "author": "David W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-24", "description": "Arrive early to get a table! Food is worth the wait. Trad Italian-American dishes, no frills. Fresh food and fun atmosphere. Great neighborhood spot.", "author": "Simon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "Very fantastic food and wine. Good for dinner only. Just a little noisy since too many people in a not-so-big restaurant. If you want to go, which I do recommend, bring CASH. This restaurant has decades of history and never accept credit cards.", "author": "Rhoda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-14", "description": "No other words to describe this place except \"the best restaurant in the NYC\" which basically means the world.  Been here at at least 6 times in one year and the food gets even better. \n\nStaff is amazing. Service is incredible.  Perfect.  \n\nThis Italian hole-in-the-wall puts every restaurant to shame.", "author": "Richard M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Great Italian food right off the Brooklyn bridge. We ordered the garlic bread and the tomatoes and mozzarella plate for appetizers, highly recommend both. The mozzarella is very fresh. I had the lasagna bolognese and my girlfriend had the gnocchi, both were delicious. The service could have been faster but the restaurant was very busy so I understood. Also be aware that they do not accept credit.", "author": "Colin X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "Best place in NYC for authentic Italian cuisine. Very friendly and homey atmosphere. Lasagna and house wine a real value.", "author": "Terry P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-18", "description": "This locals favorite has a charming Brooklyn Italian cafe ambience, and some great food to match. Everyone at our table loved their entree. Does it exceed the quality or experience of other Italian options in the City, or even Brooklyn? Probably not, but it is extremely good, dependable, and just right if you're in Dumbo and crave Italian. \n\nI am giving Noodle Pudding two stars for two reasons, and both because of service. I called ahead to see if the restaurant could accommodate three of us on a Saturday evening. The host said that they could, that it was not too busy, and to come on immediately. We did, but we got there to find the restaurant completely packed. My friends were starving, and the host told us that it would \"only be a minute.\" It was 30 minutes. In short, I really dislike integrity issues where the business misleads customers. Remember: don't be a time bandit because customers only have one life. The bartender was a bit slow and rude after I expressed frustration that I had been waiting on him to pour me a glass of wine while he poured drinks for every server that came to the bar as I waited. \n\nMy other complaint is that they don't take credit cards. Don't even get me started. A restaurant this successful, and they can't take a credit card in the 21st century. I wish the IRS had an app to report suspected tax fraud all over NYC for all of the restaurants and bars that won't take cards. It's time to get a clue, folks. Using Square and an IPAD would be a nice start. Ok, I'm done preaching. \n\nThe food is good, but take your credit card to Vinegar Hill Cafe and enjoy the convenience and the reservation.", "author": "Todd B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-03", "description": "Atmosphere is warm and potentially pleasant.  We were there tonight, enjoying beautiful, delightful unusually mild weather.  The restaurant's large front windows open creating a semi-al fresco experience.  A nice relaxed local feel to this cozy place set the stage for a delightful dining experience.  We ordered a pasta dish and a main course and our food came promptly.  However, all of this good feeling was trashed as we were simply forgotten about and ignored once the main course was over.  \nI understand that it's a relaxed local place and one lingers over one's food and no one is in a rush ... however, after quite some time had passed, and we were keen for dessert, we sat around while our waiters studiously looked in all directions except ours as if we didn't exist, schmoozed with other customers and just disappeared in general.  Finally getting our waiter's attention we requested a dessert menu.  Another seemingly interminable interval transpired as we waited for the menu to arrive.  They must have felt that the we might be daunted by the five or so choices on the dessert menu since eons transpired without any one coming back to take our order.  Finally, my boyfriend had enough with this shtick, and spoke to the manager -- who apologized, took our order and put it on the house.  I saw the manager speak with the waiter and our dessert soon arrived.  The server was cold and aloof, apparently feeling there was no reason to acknowledge -- in any way, shape or form -- that we had complained about his inexplicable lapse in service.  Apparently, he wasn't interested in a generous tip ... and he didn't get one.\nOK, so you'd think now, after dessert, having already complained once, that at least our check would come promptly, especially since we asked for it.  But nooooooooooooooo.   Again, the averted eyes, the \"we don't really see you or believe you exist\" attitude persisted.  And another very long wait ensued.  Finally, the check came, and we paid.  My boyfriend complained once again to the manager who we passed on our way out, and once again he gave us a pro forma apology.\nThe food: we had the Tagliatelle Bolognese and the Grilled Sliced Chicken Breast with garden salad and shared the above-mentioned Apple tort with vanilla ice cream for dessert.  Tagliatelle was delicious.  The grilled chicken was an uninspired, bland affair with a few greens , some sorry ass iceberg lettuce, part of cucumber and half a tomato being the salad part.  The tort dough was tough or stale to chew and it came with a minuscule scoop of ice cream.\nBottom line: nice atmosphere, horrific service, good pasta, mediocre chicken dish, sad dessert.  \nI don't like attitude from waiters, especially when people are being nice and not causing any trouble as we were.   We just wanted a pleasant dining experience and were treated poorly.", "author": "Robin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-07", "description": "Came back for the third time and I am still impressed!\n\nSadly, I was never able to relive my first food-gasm (i guess they're right, nothing ever beats your first time huh?).  They don't offer scallops as their specials anymore!\n\nI had the wild boar ragu and it was HEAVENLY! Highly recommend this dish!", "author": "Diana C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-26", "description": "Fellow Brooklynites rave about this place, and I don't get it.  I've dined here many times, mainly because a) Brooklyn Heights has a dearth of good restaurants, b) its cheap, and c) I keep thinking I'm missing something so I try and try again.  \n\nNoodle Pudding is really popular, so make sure you are willing to wait on weekends and prime dinner hours.  Service is never great, maybe because they are so busy or maybe because its more authentic with a gruff edge - who knows?  Room is a little bit of a mishmash, nice woodsy warm coupled with a rotating selection of kitchy artwork.  As for the food, I've gone through a fair amount of the pastas on the menu, and I've found all of them to be acceptable but not deserving of the raves of other red sauce pasta shops.  \n\nSigh!  I guess I am missing something...  However, the food is very affordable and the wine is even more so, so three stars overall, but Noodle Pudding.. like its name... is a real head scratcher for me.\n\nCash ONLY, so make sure you hit the ATM before hand.", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-29", "description": "Great little Italian place in Brooklyn Heights. Delicious gnocchi, and decent wine. Be warned, they are cash only, but not overly expensive. I went in not knowing, but was still able to pay for dinner with what I had in my wallet.", "author": "Dan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-25", "description": "My neighborhood go to Italian place.  Inventive specials, 5 dollar glasses of wine and feel good 12.50 pasta works for me!  I may not have my nameplate on the bar like Linda but, they always treat me well here and the food is consistently good!  No reservations and cash only!  Stay away between 6-7:30 when the families with screaming kids are there!  Get a babysitter people!", "author": "Janet F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-09", "description": "Nothing about this meal stood out other than how surprisingly average it is - maybe our expectations were too high from the great reviews. My hubs and I actually commented that perhaps we are just spoiled by great italian food in NYC, but after being to cafe e vino in fort green a couple weeks ago we just know there are much better options around.\n\nThe most memorable part was actually the oil/bruchetta mix they give you with the bread. It was one of the best I've had.\n\nWe had the salami \u0026 cheese plate which sadly was pretty pathetic and the waitress (who was very nice by the way) seemed embarrassed to serve it to us. Kinda wanted to make me laugh when I saw her face as she put it down and looked at it awkwardly. It was a bunch of olives spread out (some good, some bad) amongst a few chunks of parmesan cheese, ruggedly sliced salami (which tasted sour and like supermarket quality) and these little pretzel things. \n\nHalfway through our cheese plate, the entrees came out. The waitress was upset that someone served it too soon and topped off our wine towards the end of the meal which was nice. The pasta was ok - nothing special. We had the bolognese and sausage with fennel.\n\nFor dessert we tried the ricotta cheesecake which was not bad but not good either.\nWon't be coming back.", "author": "Jade D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-20", "description": "Nice atmosphere, great Italian food. \nThey`re cash only which bothers the hell out of me and is the only reason why I don`t go more often. Start accepting cards already!", "author": "Gabor C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-06", "description": "I'm so sorry but I have been coming here for years.  I think they have a new chef.  The food dosen't taste the same.  The wait staff is still great but I'm disappointed in the food.", "author": "Precious J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-14", "description": "OH MAN, I LOVE THIS PLACE!!! Everything I've got from here is delicious. Portions are big and hearty. For the birthday ppl, the whole staff sings in Italian for you! Definitely a festive experience.\n\nMUST HAVE-\nA La Carte Rice Balls/Meatballs\n(On the bar menu ONLY, just ask for it)\nRosemary Steak with Potatoes\nLasagne\nSage Gnocchi", "author": "Mandy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "Best Italian food, they make all pasta fresh in house. Had delicious gnocchi here, everyone in my group loved it. Amazing food for reasonably priced!", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-17", "description": "Ill have to break this down here (much like everyone else)\n\nFood:  The food at Noodle pudding is very good!  The olive oil and bread are phenomenal.  I am convinced that the secret ingredient in that oil mixture has to be some sort of drug....because nothing legal can be that addicting.\n\nI have the pappardelle and mushrooms.  it was slightly above average.  The pasta was slightly undercooked.  Not al dente, but one step below that.  \n\nMy brother had Straccetti.  HOLY F%$KIN\u0026 G@D that was good.  The beef was tender and flavorful, the mushrooms were warm and tender, and it all came together with the arugula salad that filled me right up.\n\nWe also had the lasagna which was rich and delicious.\n\nService:  What service?  you mean the hobo who came to our table to give us an attitude, not bring us bread without asking twice, never refill our water or cocktails.  Oh that guy was there...I didn't know he worked there, I just though he felt bad for us since we looked hungry, so he had someone else bring out our food then flung a check that was scribbled in crayon.  If it would have taken less then an act of congress to get him to the table, I might have asked him to explain each line item.  \n\nOverall the food is great, so it is worth another shot.....", "author": "Steve L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}