{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-22", "description": "Fantastic hidden gem!  We had the table wine (red and white) that was more than sufficient and a phenomenal price in NYC.  The food was authentic and really tasty - risotto was even paced and flavorful and the cacio e pepe was amazing.   Ask for some vanilla gelato with fresh ground pepper - sounds strange but it is an amazing combination- they should put it on the menu!  Deserts were phenomenal!", "author": "Michael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "We came for a late dinner so we didn't have to wait at all - which might be the way to go as the service throughout dinner was faster this way. They did start us off with complimentary bread with a nice olive oil. Then we had the bruschetta with peppers and anchovies, which had a great flavor combination but the texture was a little off - the bread being a little too hard. For the entrees, the the seafood risotto was the way to go as it was beautifully rich and the perfect portion size. \n\nThe waiter was on point, quick, attentive, but not overbearing. He complimented my hat too.", "author": "Myles C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-13", "description": "The food was very good here, but unfortunately my wife and I did not have a great experience. Service was uneven, with a long wait to even be recognized at the door then being rushed to sit down. Wait service was impersonal and efficient. \n\nFYI, Yelp is not a very good representation of the restaurant, as the menu changes regularly. On average one would spend at least $40-50 per person, which makes a \"proudly cash only\" place a bit hard to swallow in 2018. The staff sent me \"next door,\" who then sent me a block away for an ATM with max $100 withdrawals. \n\nThere is a quality, pricey wine list. Ours was served lukewarm and (again) rushed. The server split the cork while opening, blaming it on a moist cellar. They ran off to filter it into a decanter.\n\nThere are clearly neighborhood regulars here, and I could see it making a nice dinner under the right circumstances / given the right expectations. But the no-frills approach didn't help our experience.", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-25", "description": "Few things to mention before getting to the food. First off this place is cash only! They don't take reservations so expect a wait. The restaurant is very tiny with hardly no bar space to sit at while you wait for your table. Wear comfy shoes and be prepared to stand awhile. \n\nWhen we finally got seated and ordered, we started off with the calamari. It was good. I liked how they didn't serve it with the traditional marinara sauce but with a spicy mustard sauce instead. Very different. Also tried the garlic bread which was amazing. Perfect balance of garlic and oil. \n\nFor entrees I split the gnocchi pomodoro style. I'm a huge gnocchi fan and these were made very well. The portion was also perfect size. The other half of that split was the cacio e pepe. One word...amazing. Yes it is a simple dish but it was delicious. I scraped the plate. I loved the type of pasta they used in that dish. \n\nThe food was definitely good here but to me it wasn't worth the hour wait.", "author": "Christina C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-25", "description": "We live in DUMBO, and Noodle Pudding had become one of our favorite local spots. After our latest visit, we will not be returning. We had a party of 6 and were looking forward to bringing some friends from out of town to Noodle Pudding. We had the rudest, most arrogant, most condescending server (tall, white man with glasses) who acted like it literally pained him to lower himself to speak to us, let alone do his job that he was doing poorly from the start. There is NO excuse to treat anyone with such an ugly attitude, especially when a hard working family is paying a lot of money to have a rare meal out. Moving on from Noodle Pudding, and I suggest you do the same.", "author": "Mollie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-06", "description": "Dandy place in the Heights - as this neighborhood is known by the local populace.   Presenting a great vibe, fine service and boasting a nice wine selection.   Noodle Pudding features an excellent menu strong on noodles but devoid of pudding.    An array of house made pastas is offered to the discerning patron, each served with an original and delicious sauce.   Arrive early!", "author": "Felix H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "This is a neighborhood Italian eatery in downtown Brooklyn just shy of the bridge overlooking Manhattan on the other side. I walked in around 6:30 PM and already it was filled to capacity. It fills up fast, so its best that you do call ahead for reservations as its a popular eating spot.\n\nI went with the Tagliatelle Boscaiola (wild mushrooms). It was such a aromatic and savory dish. The mushrooms had a distinct flavor to them and it seeped into the pasta. I requested to add extra grated cheese which added a creamy texture to the whole pasta.\n\nFor dessert, I kept it simple tonite and went with the Ricotta cheesecake.", "author": "Eric A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-20", "description": "Very good food, but the atmosphere steals the show.  So genuine, friendly, and family oriented.  Bring cash!", "author": "Steve J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-13", "description": "One of the best Italian restaurants I've ever been to, including the dozens I've been to in Italy! (Seriously.) The food is fresh and amazing. I think all the pasta is homemade. The cacio de pepe was off the charts. The beef carpaccio with shaved artichokes was unique and special and the service was wonderful. Very casual and comfortable local favorite. Menu changes daily. Doesn't take reservations or credit cards. There is usually a wait, but it's totally worth it. The best part is, it's reasonably priced. I can't wait to go back.", "author": "Nancy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-04", "description": "If there are no credit cards, then I want to see them share the savings. And that is what they do. Pricing is very reasonable for this high quality level.\nTonight my wife and I began with Linda's salad that had crisp lettuce, a beautiful tomato slice, and parm in a light dressing. We next moved to eggplant, tomato, and mozzarella, but substituted fettuccini for macaroni.  Pasta was fresh, perfectly cooked, and dusted with parm.  We finished with the chicken cacciatore, with assorted wild mushrooms, sausage, and polenta. A rich, flavorful entree.  The entire meal was perfection.\nIt had been a good 5 years since our last visit, but we have fond memories of that meal as well.", "author": "Stuart M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-07", "description": "I have had this place bookmarked forever and I am glad the restaurant was as awesome as I had hoped. The place seems like the quintessential neighborhood spot, it seems like the perfect gem everyone wished they had in their neighborhood and I am almost positive that most of the customers I saw that day were regulars. I also thought the decor was nice, it was very simple yet rustic and inviting. I would definitely try to come earlier since the restaurant gets super packed.\n\nThe food: \n\nCrispy-Fried Wild Caught Whitebaits- This really reminded me of fried smelt but better. They were basically French fries of the sea, you eat the whole thing. You put a little squeeze of lemon and wham-o, happy stomach. https://www.yelp.com/user_local_photos?select=8pRIHn6vocqhdRS5ZBMifg\u0026userid=Y_iTTjKvV5hLy-880SZzlA\n\nPappardelle w/ Wild Boar \u0026 Mushroom Ragu \u0026 Pecorino Shavings- The wild boar was my fav dish. The boar was so insanely tender and really reminded me of beef but with a slight gamy flavor. The noodles were really nice and they had a good mouth feel. However, I do wish the noodles were cooked a tad more and had a touch more sauce but overall a must order. https://www.yelp.com/user_local_photos?select=5X4tsBm7iW3G0Pg3r-xkyA\u0026userid=Y_iTTjKvV5hLy-880SZzlA\n\nTagliata (Sliced \"Fresh Meat\" Prime Rib w/ Rock Salt \u0026 Rosemary- The steak was good, it was nice, tender and I really liked the whole roasted garlic bulb. I also really liked the salt they put on the steak, it was a good quality salt that went well with the steak. But, I did have issues with the end pieces being a tad tough and the slightly burnt flavor that lingered throughout the bites. https://www.yelp.com/user_local_photos?select=CxIOwgchQln_CbQwPQC01w\u0026userid=Y_iTTjKvV5hLy-880SZzlA \n\nRicotta Cheesecake- The cheesecake was OK, it was kinda standard but I though the piece was really tiny. https://www.yelp.com/user_local_photos?select=Wuqdg2recPawSSq-fV4KjQ\u0026userid=Y_iTTjKvV5hLy-880SZzlA", "author": "Ben L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-08", "description": "I've been here twice and both times the food was phenomenal. Lively atmosphere, helpful staff, and--from the small selection of food I've eaten--I get the feeling that I could go enough times to order everything on the menu and never leave disappointed.", "author": "John W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-24", "description": "I've eaten dinner here twice and both times I've left very satisfied. The pastas are perfectly cooked and they always have something interesting on the pasta menu beyond your standard fare. \n\nOn our most recent trip we had a cacio e pepe with asparagus and a campanelle with heirloom tomato and sage, both were excellent and fairly unique combinations. \n\nThe sides are somewhat disappointing relative to the quality of the pasta dishes, but they are quite generous portions. On our more recent visit we had the broccoli rabe and pork belly, and they were pretty heavily steamed and buttered so it was a bit of a chore getting through them. Next time we'll probably skip the sides and just stick with the pastas themselves. \n\nThe wines are reasonably priced by the glass and there's a decent selection. The complimentary bread is fresh and delicious. Service is great, and it's pretty easy to get a table on the later side - they have happily seated us after 10PM on both occasions and they were not in a rush to get us out the door.", "author": "Ramesh D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Yes as wise people know, this is The Hidden Gem of all time!!!! And if you're Italian and truly know authentic home cooking Noodle Pudding Never disappoints! My man and I eat here at least 3 times a week! Every dish is overseen by the owner Antonio, whom also takes time to greet his customers and makes sure you're satisfied 150%!! The staff is wonderful \u0026 caring towards your needs!! The wait at times is Absolutely worth it! Once you taste any dish your mouth waters and realize the food is cooked with love ! Any one whom feels it's not up to par belong in a greasy fast food joint!!", "author": "Diane M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-27", "description": "The food is decent, but it's nothing near to the other places in the neighborhood.. a lot of prefab. Nothing that blew us off our socks \n(Besides a very unprofessional, and grumpy, staff)", "author": "R R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "Great restaurant in Brooklyn Heights serving authentic Italian cuisine.\nWe shared the salad appetizer, the octopus app, and the razor clams. \n\nFor entrees, we had pork chops with cherry tomatoes; pasta with eggplant; and a monkfish dish, all of which were delicious.", "author": "Bob S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-17", "description": "We had a wonderful experience here last night! The food was outstanding, the wine was great and the service was attentive. Tony came out to talk to us and see how we liked our food, which showed us how much he cares about everyone's experience in his restaurant. Thank you for making our anniversary so special!", "author": "A O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-06", "description": "The service was wonderful and the atmosphere very cute and cozy.  The food was not great.", "author": "Sovi P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "Patrick is amazing - always ask for him. Food is always great. Better come earlier to get a good spot!", "author": "Ekaterina V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-28", "description": "Literally the worst place ever.\nSave your time with these racist, homophobes. There are better places with better environment \u0026 you'll feel more comfortable. \nThe owner should be in jail for how offensive he is", "author": "Banesa H."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}