{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-25", "description": "I've visited several more times in 2010 and just wanted to add that there is really nothing that they make that isn't fantastic.  Case in point: on a recent visit, I had a straightforward and simple pasta that was fabulously tasty, perfectly cooked cannelloni pasta in a deeply flavorful tomato sauce topped with light, refreshing ricotta cheese.  My friend had the fettuccine with seafood, a beautifully plated dish that catches the eye; the seafood was some of the best I ever had, especially the enormous, plump, and perfect mussels.  Such consistently high quality at this price point is really hard to find.  Continues to be one of my favorite Brooklyn restaurants, and one of the top for value, experience, and quality in NYC.", "author": "Valery C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-14", "description": "Regular place. Not much to say about it. I went tonight because it had good reviews in yelp, but I don't agree.", "author": "Willy F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-23", "description": "One trend that is likely to emerge with the more reviews I write on Yelp is that I am just not the biggest fan of Italian restaurants.  It's not that I don't like Italian food -- in fact, it's quite tasty.  But rarely do I find it special or creative and, in a city like New York where you could eat at a different restaurant every night and never have to eat at the same place twice, I have trouble justifying spending a lot of money on food that I don't think is special or I believe I could cook myself.\n\nAnd so, I tend not to be the biggest fan of Italian restaurants.\n\nBut this place is an exception.  It helps that it has sentimental value: this was the place my boyfriend took me on our third date.  I still remember what shirt he was wearing.  He brought me a Tupperware of tortilla soup that he'd made (\"extra spicy\") the night before so that I could have it for lunch the next day (even if he forgot to give it to me and then told me the next day that he was eating it himself.  Still, it's the thought that counts.)  We went back at ate there again for our anniversary last year and we'll probably go again for our anniversary this year, too.\n\nNoodle Pudding is a cute little neighborhood-y Italian restaurant steps away from the Brooklyn Bridge.  Like another reviewer said earlier, I don't quite get the cult following, but that could easily be because of my aforementioned disclaimer about Italian food.  But what I do like about it is its warmth, its reliable tastiness and the fact that everyone there seems happy to be there and seems to love the place.  That just makes for a very nice dinner vibe.\n\nI also like the bartender who let me try a bunch of red wines until I found the one I liked best while I waited for my boyfriend at the bar.  That kind of treatment is something I'll always return for.", "author": "Katie Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-25", "description": "I had the lasagna last night.  Tasted good, but I was throwing up an hour or so later.  Food poisoning?  I think so, and this place has a B grade from the city. \n\nService was very good, but I was charged $12 for a small glass of Chianti at the table when it only cost $8 at the bar.  I feel like I was overcharged, but was on a date and didn't want to make a scene.", "author": "Dylan M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-23", "description": "After a day of wandering DUMBO and the promenade, I was huuungry.  Having told there were plenty of restaurants on Henry St, and that I should most definitely try \"Noodle Pudding\" if in the mood for Italian, which my friend and I were, we totally went for it.\n\nThe ambiance was nice, full of people on a Thursday night. The French host was very nice and accommodating, the wait was only 5 minutes. \nRun through of food \u0026 service experience after that:\nBread and Parsley Olive Oil: Great\nWaiter took forever to even give us menus.\nFinally we look at the menu, specials sounded amazing. Ordered octopus carpaccio.\nWaiter forgot that we even ordered it.\nWaiter finally asks us if we want an appetizer, which we did. When it arrived it was good.\nHe recommended the specials, which we went for: Roast Baby Pig with roasted fennel a la parmigiana, and my friend went for the Quail.\n\nIn between a very long wait, we decided to order wine. Soooo hard to catch the guy's attention! He would even look straight at us and walk away, had to order it from the host. We told them that we wouldn't want it if it came after the food.\nabout 15 mins went by and no wine, then another 5, and another, and there was our food! The host was the one who realized the situation, not the waiter and then here comes waiter dude trying to push some glasses of wine on us but we politely said no.\n\nSo finally! The Main course! Yay!\nWrong.\n$20 for 10 small semi-cold pieces of not so flavorful pork with blaaand boiled fennel with Kraft ptarmigan cheese sprinkled on top.\nMy friend's $20 quail: tasted like bland chicken.\n\nThe specials, which should be the freshest meal available for the day (or at least I hope?) were definitely not  a hit. \n\nHowever, the people's pasta next to us did look yummy, we should've ordered that and spent a whole lot less money.\n\nOh and if you ever get some tall, dark haired, Jack Black looking guy as your server... you might want to ask for another table!", "author": "Jesse G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-01", "description": "When the mercury begins to climb up the thermometer and the dogwood trees boast their blooms, New York City streets changes from canyons of stoic stares to a carnival cityscape where shops windows open like a barker's rictus. Tucked neatly into Henry Street near Brooklyn Heights, Noodle Pudding opens its windows to the summer air and stretches its awnings through cool breezes to serve regional Italian dishes at reasonable prices and glasses of wines for a mere pittance.\n\nThe regional Italian menu offers classic dishes such as Penne all' Arrabiata, carpaccio, Linguine Alla Puttanesca and buffalo mozzarella with tomatoes and roasted peppers. But the menu is fitted with a list of specials that change nightly and which outnumber the standards almost two to one. Of course, favorites like burrata with baby arugula and heirloom tomatoes appear and re-appear due to availability, but recently I was able to order a plate of garganelli with duck ragu and fava beans.\n\nWhile the name is off-putting to some--noodle pudding (sometimes called kugel) is a dish of egg noodles, sour cream and cottage cheese, flavored with vanilla and jam and, of paramount importance, distinctly un-Italian--the quaint storefront is framed in flowers and bustles with four-tops and a wall-length bench that seats half an alley of intimate tables for two. The waiters, runners and busboys tuck their ties into their shirts and bustle about with only a modicum of banter but a bounty of helpfulness, tact and efficiency.\n\nThe last time I visited, the host stand proudly displayed a basket of Zagat Guides (2008, Best Italian Restaurants in the US) in which they were awarded high marks. My girlfriend took one and was rewarded with a smile and a reminder that as a local she could share in their pride and conviviality.\n\nA simple salad of beets, goat cheese and escarole was delivered to our table quickly and we split it with a plate of beefsteak tomatoes drenched in olive oil atop mozzarella cheese; standard fare at any Italian trattoria, but constructed with color and priced modestly. Enjoying the first, delicate greens of spring we watched our dog who espied our dinner jealously from his spot near a parking meter (to underscore NP's gracious service, upon noticing we were with our dog, we were speeded to a table at the front of the restaurant!). We followed with a fine linguine with diced pancetta, fava bean puree (it is spring, after all) and pecorino cheese and a delicious Bolognese which could have been more tender, less beefy but served its function of comfort.\n\nBecause Noodle Pudding is more of a local spot than a hot spot, it might underwhelm visitors. The artwork and décor are simple, unassuming; meanwhile, the house wines are table ready rather than ready to be ruminated on. But as local spot, it is a treasure. The price of a full meal here would not get you a bottle of wine in a similarly popular place in Manhattan. Likewise, Noodle Pudding is not going to insult and berate its patrons with the hipness of Williamsburg or the Yuppie-dom of Park Slope. Off the beaten path of Brooklyn Heights, in a peripheral spot not far from the Brooklyn Bridge, this restaurant is a boon to its neighborhood.", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-14", "description": "Such a cute, homey place. Seems like a definite local place...it looked as though lots of older Italian folks come here. We came at the right time...around 6 PM (they don't accept reservations) and didn't have to wait or get seated in the back where it was super dark. Instead, we scored the last table that looked out onto the street...I felt like a window display.\n\nThe bread and dipping sauce was great. A different take on bread and olive oil. The olive oil had tomatoes, garlic and some other ingredients...very tasty. I actually ate more bread than my entree.\n\nThe bf and I ordered 2 items off the specials list. I got a veal pasta dish ($16) and he got a meatball and sausage pasta dish ($16). Unfortunately, I didn't really like my dish. Seemed more of a veal stew with pasta than anything and although the veal was tender, it tasty dry (is that possible?). My bf's dish was good...the sausages and meatballs were very tasty and definitely homemade as well as the pasta...I think since the shapes of our pasta looked man-made and each piece of pasta was unique in that snowflake-type of way.\n\nService was exceptional and the overall feel of the place is romantic and very quaint. I LOVED the back seating area which looked like it was set-up for a dinner party. They had strung mini lanterns from the ceiling lights and it looked so cute and intimate. Maybe some time I'll have to plan an event here so I can score that back seating area!\n\nNote: cash only", "author": "Janel Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-06", "description": "Was told the food was good here. So I tried it.   On the take out order, they told me it would take 20 minutes. 45 minutes was the total preparation time.  The lasagna was the worse I have ever had.  I think it had one teaspoon of sauce. How can you survive if you serve a dish like this in NYC?? These dishes are so  simple to make!", "author": "Leo J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-29", "description": "The craving started the minute I walked into LAX and saw this hot 18year old who got me wet all the way to JFK. \n\nMy god, that was a painful flight.\n\nI landed famished, sex-starved, drooling, just can't stop looking and about to pop my nuts. But reality finally set in - who the hell am I kidding really -  and we parted ways at the baggage claim - like I was really noticed. \n\nAt the AirTrain, I sent a text to my friend and asked her what's the best way to Brooklyn Heights and was told to just  take the A train and get off - oh, how I wish - at High St.\n\nWith my suitcase,  laptop bag and backpack in tow,  I finally made it to the stop and the nice couple was already there waiting for me.  They then asked if I was hungry to which I replied \"No, but I'm horny.\"\n\nThey just laughed and I said, \"No, I'm fucking serious.\"\n\nThey helped me with my bags and walked to their apartment, freshened-up a bit and walked to get some food.  They asked me what I wanted for dinner and told them that since I can't have sex, to take me to the next best thing.\n\nWell, they took me to this spot. They actually have made reservations and was seated next to the window.  It's a nice little neighborhood restaurant, crowded but without the attitude. I just don't quite get the mirror ball hanging in the rear part of the dining room though.\n\nI started perusing the menu, we got a house wine - which was surprisingly good, especially for $14 - and got me a lasagna as recommended by my friend.\n\nWell, I am pleased to let everyone of you know that although the itch wasn't scratched, the craving was satisfied. That lasagna was the next best thing to sex because I got wet yet again.", "author": "Marco d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-13", "description": "Cara C. I couldn't disagree with you more. I love the name and when my sisters mentioned the restaurant as an option the name put it over the top.  \n  I no longer remember what exactly what I ordered, but that it was a seafood dish with a white sauce and it was delicious. My family are big sharers so I got a chance to taste a few dishes and enjoyed them all. The highlight had to be the $12 bottles of wine though!   Thats like a BYO price!  I highly recommend this restaurant.", "author": "Fritz J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-06", "description": "Wonderful spot in all ways.  A few hints from a regular:  \n\n1. The lasagne is divine -- and cheap!  \n2. The osso buco is top notch. But on occassion you might get a tough joint. \n3. The mussels are very good -- great dipping in the broth.\n4. Try the daily soup for an appetizer -- a delicious surprise awaits.\n5. The gnocchi with butter and sage is sublime -- nutty, creamy, chewy.\n6. The grilled fish are always dependable.\n7. Tip heavily -- these cats will take care of you.\n\nThe veal scallopine?  There are better places in Brooklyn  -- not a strong suit.\n\nThe beef is fine but go next door to Henry's End for a steak au poivre if you want grilled meat.", "author": "O U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "Old NY meets whatever is going on here now. The food is simple and authentic and delicious. Brooklyn Heights encapsulated in one restaurant.", "author": "Sir M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-26", "description": "Best Italian food in Brooklyn. No frills, but just good quality food, good service. Just one stop from Manhattan and so much better than any other Italian place I have been to in the city - for so many reasons.\n\nQuaint, neighborhood-y, and really good quality food. I have never had a bad dish here. The rabbit is amazing, the mushroom risotto incredible and enough for two meals (or two people!), the fried squash blossoms are delectable and for dessert the goat cheesecake is light and fluffy and very mild. I have been there so many times I forget all of the dishes I have tried, but I have always loved everything. I highly recommend this restaurant and miss being able to go more often. In fact I'm headed up there in a month and am planning a visit. The service is attentive and kind and the wine list is very good. It can get pricey if you begin adding wines, etc but overall a good deal for such good food. I was able to treat myself on a grad school budget so it's not that expensive.\n\nExpect to wait if you go at a busy dinner time. They do not take reservations and they are cash only. If you have to wait, you can always have a drink at the tiny almost difficult to sit at bar, or walk up the street to the pub which is more fun anyway.  If you happen to go on a lovely evening, the front windows might be open and the ambiance is intoxicating (aside from the pretty bad artwork). I could just sit there for hours and hours. It's always welcoming and the food comforting and I can easily see why it's a favorite of the locals in the neighborhood.", "author": "Katherine W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-07", "description": "I am not easy to please and tend to look for things that are wrong. Noodle Pudding is not only the best restaurant in Brooklyn Heights, it it one of the best Italian restaurants in New York City. Yes, that's a big statement. But it's true.", "author": "Matt C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-07", "description": "The reviews are true. Really fresh, fantastic italian food in a nice setting. I had the risotto special which was absolutely delicious. I went with my family and everyone was impressed.\n\nOnly crazy thing is they don't accept credit cards, so keep that in mind before you go!", "author": "Adrienne P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-04", "description": "Here's the quick and dirty:\n\n1) Typical wait for 2-3 people is about 45 minutes.\n2) Full bar. Nice wine selection.\n3) Mussels run out in a hurry. I was seated by 630 on a Friday night and they were already out.\n4) They serve fresh bread with oil dip (that I swear on my life has a banana-like aftertaste) as soon as you sit down.\n5) Which is good because the service seems to be a bit slow and you definitely need something to hold you off until your entree comes.\n\nOverall: The food is good and reasonably priced, but I often wonder if wait is worth it. The pork chop was delicious and I'm a huge fan of the mashed potatoes. They aren't kidding around with the pastas either. Any of the meat pastas have quite a lot of meat. (I dare say a bit too much.)The fried calamari is average, but large enough to share. The service was mediocre and seating can often feel a bit stuffy and crowded. If you can get in with a short (or better yet, no) line, then you're golden. Otherwise, I'd suggest spending your time and money elsewhere. The good news is if you absolutely have to eat here, the bar should have enough goodies to keep you occupied.\n\nI'm going to give it four stars as long as you don't have to wait in line. (There are times when it's really slow.) Otherwise, I'd give it a 3.5 stars if I could.", "author": "Mathew T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-26", "description": "Noodle Pudding is one of the best Italian eateries in Brooklyn Heights.  Other than pizza places, it's also the only one.  This may explain why, when we went for dinner before a movie at Brooklyn Heights Cinema, we were told it would be 15 minutes and yet waited for 40.  This is typical; sometimes the wait can be more than an hour.  On this occasion, our name had dropped to the bottom of the list, even though we were the first in line.  This is not uncommon for a place that doesn't take reservations, accepts only cash, and doesn't seem to have an organized strategy for seating frustrated patrons.\n\nThe food is good--the linguini puttanesca is bright and balanced with acidic tomatoes, salty black olives, and perfectly cooked pasta; and the bread with dipping oil is also great.  The bolognese is good, too; if a little dry.\n\nBeware: this place is LOUD when it's crowded (being the only decent Italian restaurant assures a packed house).  Be prepared to raise your voice, unless you're seated near the windows.\n\nI'm not sure this place is worth the trek outside of Brooklyn Heights: Fragole in Carroll Gardens is far superior and similarly priced.", "author": "Matthew A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-21", "description": "OK- the one thing wrong with this place is the name.\nSeriously, my girlfriend that lives in Bklyn hts would call me and say \"come to this amazing place called noodle pudding\" - I would always say no thanks - because I thought it was a thai place and I have to be in the right mood to eat thai. \n\nThen one night I had a craving for thai - called Julie and said I'll meet you at Noodle pudding - to find out it is an amazing Italian restaurant!\n\nWhile waiting for Julie I asked the bartender for a glass of chianti. When he told me $5 - he saw the shocked expression and inquired if I was visiting...... \"kinda I live in manhattan\" to which he replied\n\"Welcome to Brooklyn\".  Welcome indeed!\n\np.s. the big long communal table is always a good time", "author": "Cara C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-02-12", "description": "Truly 4.5 stars.  \n\nWe came here after reading a blurb about NP on a NYT article about a chef and his wife loving this little Italian restaurant in Bklyn Heights.  Heck I figured if it was raved by an executive chef, it was good enough for us!\n\nNoodle Pudding turned out to be a neighborhoody joint that serves Italian rustic pastas, salads and meat dishes.  Our grilled portabello over greens with parm cheese appetizer was delicious.  The grilled sardines with tomatoes and potatoes was simple but refreshing.\n\nFor entree, I ordered the broccoli rabe, sardine and pecorino cheese pasta special and although the dish was very heavy, it was tasty with the melted cheese and sauteed rabe.  My companion's dish was the osso bucco with goat cheese polenta and swiss chard. The sauce was salty!!, even for him who likes his dishes well seasoned.  \n\nI couldn't resist but steal from his plate and if you don't like goat cheese, avoid the polenta at all costs as it oozes of goat!  It was a well balanced plate, with the exception of the heavy salt hand.  \n\nWines were limited by the glass but extremely reasonable.  They have a great wine list by the bottle though.  \n\n\"Nothing here is out of the ordinary but everything is executed excellently\" was stated by my companion; a knowledgeable restaurant goer and I couldn't agree more.  Hard to find parking in the area but don't lose patience.  Noodle Pudding is a great find.", "author": "Irene H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-04", "description": "Let me preface this review with the fact that I HATE most Italian food (esp pasta, cheese).  Yes, I just said it.  Bring on the haterade!\n\nAnyway, I enjoyed this place!  I went with a few of my friends.  We ordered seafood risotto, gnocchi al pomodoro, mussels in spicy tomato sauce, Fra Diavolo, and gelato.  All entrees tasted very fresh and delicious.  I ordered the mussels (appetizer portion, $10) and it was plenty for me.  The dish was quite flavorful and redolent of fresh herbs.  The gnocchi was melt in your mouth goodness (according to my friend).  Everyone enjoyed their respective meals.  I'm not too picky with gelato, but as good as any in Italy.", "author": "Scuba K."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}