{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "Noodle Pudding was such a fantastic experience. The waiter was incredibly friendly and helpful. We were unsure of what to order and he helped us figure out which of the items on the menu we should order. I had the gnocchi with he butter and sage, it melts in your mouth! The waited also gave us the fig and prosciutto crostini and a desert on the house!", "author": "Leigh W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-09", "description": "Went here for my bday dinner last Sat evening.  Was kind of put off by the noise level- voices so loud, tables too close and music raising the volume level even more.\nThe staff was wonderful and the food was altogether noteworthy.  All 7 of us enjoyed our selections.", "author": "maria p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-03", "description": "Delicious.\n\nThey forgot to bring a glass of wine I ordered with dinner. The waiter didn't come back  again after I realized it was completely forgotten (and not just slow), so never got it. But it didn't show up on the bill either. \n\nCash only.", "author": "Tim C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "Amazing place. The service is exceptional. First time I've ever been here and I am definitely coming back. The food is fresh too! Wonderful! Cash only tho.", "author": "Karen P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-31", "description": "I recently took credit away from this restaurantj, because the fried calamari was not crispy enough....A serious yelper sent me the following message......\"Italy Calamari Fritti is not crispy.  In fact, for the dish to be prepared correctly the fried batter should be minimal and light and not even form a continuous crust or coat if you will around the squid.  The freshness of the squid, in good calamari, should never be concealed behind crispy fried batter...\"\n\nSo people, there you have it...this place is then pretty good!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-17", "description": "This popular Italian restaurant in Brooklyn Heights served decent food, but the service was less than desirable.  We had to really flag down the wait staff in order to get service (and menus).  The place was also quite loud.\n\nAll in all, I think there are better options for italian food in the area.  This restaurant could probably benefit from another waiter and a true host/hostess to manage the flow of people looking to be seated.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-08", "description": "This place has HORRIBLE SERVICE and is overrated. We waited in line for 25 mins, sat down and the waitress comes over and was like \"oh let me get you your menu.\" 15 minutes later she totally forgot about us, did not bring us the drinks we ordered even though we tried to wave her over a few times. We ended up asking another waiter for a menu while our waitress chats with other people in the restaurant. Throughout the whole meal, she did not pour us any water or ask us how things tasted - she however, was extremely attentive to the guests who were sitting right next to us. Thanks so much for making us feel like we didn't even exist in the room. \n\nAbout the food:\n\nSeafood Fettuccine with shrimp, clam, and mussels was OK. Yes, the pasta was fresh and chewy, but that's about it. The seafood was over cooked. Shrimps were dried, and clams were so cooked that they shrunk smaller than a dime size. The mussels were not fresh at all and had a weird smell when you chew on it. \n\nLasagna was not good at all. It was too soft and the ground beef in it tasted like bad meat loaf left over from a week ago. \n\nThank you for a fantastic experience....NOT.", "author": "Katie Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-22", "description": "Lovely old school Italian American vibe and thoughtfully prepared dishes. Steak is great, tiramisu is heaven, and the servers know their stuff.", "author": "Eater O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-08", "description": "Food was excellent I recommend it. We had a party of eight it took a little while for them to get us going but after thet a wonderful evening.", "author": "Jeff S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-13", "description": "Our food didn't have much flavor, the prices where super high, the wait was almost an hour and a half, our table was ooberly cramped, the atmosphere was fun, the staff was friendly... wont be going back.\n\nThe pasta was homemade, you could tell, but it was overly cooked so it felt mushy. \n\nI think they could focus on appetizers and drinks instead of trying to give a full dinner service experience.  I don't think the kitchen, the staff, or the space allows for a full 3 course, or even 2 courses.  They have a hit with their bread and olives... and the wine, but the food doesn't seem to get many props (with the exception of the homemade pasta which I experienced and didn't enjoy).", "author": "Cristabella C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-28", "description": "Gnocchi, oh butter sage gnocchi, I just met you today, but I want to marry you. Seriously it was delicious! I also had the arugula salad, bruschetta and house wine. The prices were great, service awesome. Family friendly, paper table cloth, casual vibe. Hit the spot for me.", "author": "Karema P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "Great prices and food. Casual environment and great for families. It's a place with lots of regulars.  Difficult to get in, unless you go early.", "author": "K. B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-06", "description": "The food here is off the charts!!! The arugula salad is flavored perfectly with just enough dressing and pairs well with the fresh bread and olive oil dipping sauce.  Tried both the gnocchi and lasagna which were fantastic of course.  But the real winner of the night was the tiramisu for dessert!", "author": "Ali F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-31", "description": "As I walked down Henry st last night, it was a peaceful atmosphere. Closed bakeries, an indie cinema, a quiet wine bar. And then, a crowd. There was no sign to clearly identify it, but I knew just by the presence of a crowd that we had arrived at none other than noodle pudding.\n\nThe decor and ambience are simply pleasant. There's a lot of ppl so don't expect a quiet evening. \n\nSo the first step you should take upon arrival is to walk past the line of ppl and find the host (who is one of the waiters) and give him your name, lest someone cuts you while you wait for the host to cone to you, a was what happened to me.\n\nAnyway, 20 min later my date and I were given the center table by the front window. Lucky. We could enjoy the breeze and people watch both patrons and passersby. \n\nOk on to the food. $10 appetizers, pasta between $10-20 and main dishes more than $20. House wine was $14 a bottle and was delicious. \n\nThe menu is heavy in Italian so I found myself googling a lot. Ended up getting the calamari for an appetizer and lasagna as my entrée. \n\nThe calamari wasn't that good. That is a major downgrade for someplace with such a string reputation. Texture was fine but the taste was a bit off. And the sauce they gave was neither plentiful nor outstanding. As for the lasagna, it was a small portion, looked real good, but not enough sauce.\n\nOk so bottom line. Initially I thought that the portions were small but more filling than they appeared. In hindsight, I attribute my fullness to inflammation. What is that, say you? It is basically when part of your body swells up, like your ankle when you sprain it. Well I basically had intestinal inflammation. How do I know? Because not only was I uncharacteristically full status post appetizer, but status post meal I had status diarrhea. Can I say with absolute certainty that it was the calamari or lasagna or noodle pudding period? No. But I did not eat much else for quite some time beforehand.\n\n+1 ambience\n+1 service (better than anticipated from reviews)\n+1 presentation\n-1 bang for buck\n+1 deliciously cheap house wine\n+1 variety\n-1 bad calamari (should be a staple)\n-1 diarrhea\n\nSauce lovers will be disappointed. Cheese lovers will not be. Glad I went, but this place is way overhyped. Will rather go to a small joint or little Italy.", "author": "Timothy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-27", "description": "My sister and I went here to carbo load before the Brooklyn Half.  Though the restaurant was packed on a Friday night, we were lucky and only had to wait around 20 minutes for a table. \n\nWhile our server was really nice, the service itself wasn't fast. It wasn't terrible (compared to some of the other reviews I read) but I would avoid going here at peak times if I could. We had Tagliatelle Bolognese, a pasta with clams dish and for dessert, prosecco crema with fresh fruit. The pasta was obviously homemade and really good. The bolognese was better than the clam dish though. The dessert was also really good and a perfect light finish to the heavy dinner. Portions/prices were very reasonable for the quality.\n\nI would definitely go back if I was in the area.... and I would remember to hit up the ATM before - - cash only!", "author": "Linda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "If you are looking for good Italian food this is the place. I love these place and the food they served my family has been going there for the last 14 years and we never had a bad meal. Now these place does not take credit card or reservations but it's so good you won't care. My favorite thing to eat there is the pulpo in sauce and the rabbit it's so good. Service is great very attentive and the prices are decent. A must try in Brooklyn.", "author": "Karla N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-27", "description": "The boy had never walked the Brooklyn Bridge, so I made him cross it this past Sunday to catch the sunset he wanted to see the night before. Halfway across the bridge, the McDonald's he'd had on his way out of Bayside caught up with him: soda and coffee toyed with his bladder and I was hungry so we decided to find somewhere to eat close by. Yay for the Yelp app!\n\nActually, I had neglected to notice Noodle Pudding was cash-only, and we almost missed the restaurant like other reviewers, because the address and establishment sign are inside the restaurant instead of outside...please explain yourself, Noodle Pudding. We were seated, I opened the menu, rifled through my wallet, and then waited for Scott to come back from the bathroom to ask him if he had cash on him. Back to the smartphones we went. We left without a word, and wandered back in a half hour later. The host greeted us, \"You're back!\"\n\n\"Yeah, we had to go to the bank.\"\n\n\"In Manhattan?\"\n\nThe nearest Chase ATM is at the Duane Reade on Court (the actual, ornate Chase branch on Montague was impossible to get into despite its beckoning blue ATM light). Capital One was nowhere to be found, so I paid for dinner. We tipped a little extra, because I didn't feel like asking for a 5 and singles to break my 10 in change, which is fine since our waiter acted as a living water fountain and we are very thirsty people, and service was prompt and courteous.\n\nWe cracked open the menu a second time, and realized we had little to no idea what we were looking at...and Noodle Pudding's spelling is questionable sometimes. The waiter asked if we needed some help, and I informed him I don't eat pigs or cows - he walked me very quickly through the entire menu. Once in a while, though, I delight in being boring as can be. I love a good, interesting meal, but food doesn't always have to be out of the ordinary to hit that magical sweet spot. The preamble is to prepare you for the fact that after all that, I ordered Capelli D'Angelo Al Pomodoro, otherwise known as angelhair in tomato sauce. With a sandstorm's dusting of Parmesan, I was a happy girl. This was after I ate 5/6 of the bread and olive oil. Scott was more adventurous and got the fettucine with mussels, clams, and shrimp. He was full, I had finished off my entire pasta dish, but I couldn't shake the craving for dessert.\n\nThe host found us first. Did Noodle Pudding have a dessert menu? Why yes, would we like to see it? Of course. The waiter: \"There are no pigs and cows on this menu, by the way.\" Haha, okay. We opted to split the hazelnut gelato and the espresso chocolate cake, which must have been flourless because it was closer to a delicious fudge than a real cake, rich with coffee. The hazelnut gelato was flavorful and wonderfully nutty, but I wonder if it took a minute too long to be served (or if the glass dish it was served in was still hot from its last cleaning) because it had melted along the edges more than I thought it would. We heartily enjoyed both desserts anyway, and since I am now owed a dinner, I might find my way back over here again.", "author": "Puja P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-03", "description": "Calamari is the best. I came here twice, none of them disappointed me. I couldn't find a better place to have calamari. The only time calamari is that fantastic is in Orlando. Their service is great too. We two ordered an entree, but they separate them into two smaller place. So sweet. Highly recommended", "author": "Galaxy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-09", "description": "Fabulously fresh greens \u0026 veggies. Love the squid/pasta dishes/specials. Reasonably priced- make sure to bring cash.", "author": "E B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-08", "description": "**CASH ONLY**\n\nHaving lived in Italy, this restaurant truly does make fresh pasta that reminds me of eating in Florence and  Tuscany.  I haven't had any of the steak dishes or meats but the seafood and pasta are great.  The waiters can be a bit distracted but I think that's because crowds come in waves here  .... \n\nFAVORITES: Stracetti and the lasagna.", "author": "Daniel L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}