{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-12", "description": "As usual we're on our way to Brooklyn looking for Italian food read a lot of really nice things about this place so really eager to check it out walked inside were greeted by very rude hostess I understand busy restaurants get volume of people and so that easy to accommodate everybody in a timely manner but there's no need and Apsley no reason to take it out on new customers I want to try your food let alone an anybody so I was ready debating on leaving but my other half decide to still give it a shot long story short we finally were got seated and then we had to deal with the waitress who is a complete wreck and at this point I really want to get up and leave but again we were ready seated and my partner want to give it a shot anywaysThe food was really good the service by this waitress was horrible I would never go back to this place just because of how rude and obnoxious the waitress was it got to a point where we asked for a different waiter and he was a complete sweetheart but this place has the cleanup and that hostess and waitress or just plain horrible and we weren't the only ones complaining about this there were other people sitting next to us they were saying the same exact thing about the waitresses attitude . Regardless of my gonna be coming back here because the service was just horrible and I didn't feel welcome there any possible way the food was good but it wasn't good enough to go through the horrible service. It really was her Renda's I've never experienced that in any of my dining experiences ever and I don't think anybody else should", "author": "Allen G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-08", "description": "My favorite restaurant in Brooklyn, hands down. It feels like family when you sit down, the staff is great and the food is absolutely amazing. If you go, get the fried calamari!", "author": "Val C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-02", "description": "Ok, the name stinks. It also stinks that there is literally no sinage outside, so you walk around for a bit before noticing the street number on the building next to it. Maybe they know the name stinks and they do not want to advertise it? Oh, CASH ONLY with no sinage near the door, too ( no ATM so you have to go outside to the grocery store)  Anyways. Walked in and had a few waiters stare at us for a while by the bar. NBD....until I needed to go over to the group of guys and say \"table for 2?\". Finally, we are seated  and our waitress comes over and takes our order- she seems a little out of it, but it was busy and my mom was a server when I was a kid, so I totally get it ( although, the place LITERALLY just opened for dinner service at 5:30 , so....) We order a glass of wine and an app. The app we got was \"Garlic Bread\". I am not sure in what world that qualified as garlic bread, but it is not what you are thinking- it's not bad, just not garlic bread. It's really Bruschetta/ focaccia. My wine does not come. Our waitress is MIA. Other people are getting their wine. I flag down a guy and he brings me my wine. Anyways, our pasta is good- got the cacio e pepe with asparagus and egg and I have no complaints. As we are eating we notice every single table near us has a loaf of italian bread ( looked fresh) and olive oil....even the table near us that ordered a bread app, too. I gotta say, this is one of my biggest pet peeves. You give everyone free bread, not just some. Again, waitress is MIA and out of principle, I ask the buser for bread. We get the bread and it blows the dry \"garlic bread\" out of the water. Waitress is still MIA. We are just about finished and she comes over and asks us how everything is- that was it. We ask for the check...........MIA waitress charges us for 2 glasses of wine. Kicker? she sees me looking at the check and says \"did I make a mistake\". Here's the deal: you made a mistake and you knew it was wrong and you were hedging on me not noticing.  Bottomline, We tipped 20% because we are not jerks, but we wont be back.  There are too many good italian places around that have better service. I have no idea why people think this place is special ( I'm Italain, so I know good Italian food) Save yourself the hassle.", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "Don't come here, just bad food and over priced. Can get a cheaper and better Italian meal elsewhere.", "author": "Charlie K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-21", "description": "Pretty bad Italian food. We had a swordfish, which was cut into .5\" tight slices, totally overcooked. Gnocchi was soggy, below average. Then spicy sausage pasta was really bad. It contained a heavy dark sause which overpowered sausage and paste flovours. They claim they make their pasta in house but I have doubts about it. We were here 2 years ago and food was good. This time it was subpar.", "author": "Mike K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-19", "description": "0 Star will Never return. After a beautiful walk over the Brooklyn Bridge with my wife she decided to have Italian food, so I search for good Italian restaurants within the vicinity and noodle pudding popped up due to its \"high\" rating. Upon arrival we would not greeted by anyone we had to wait for the bartender to acknowledges and flag someone down so that we can be seated... meanwhile a couple of head of us were greeted and seated with ease. Once we were seated it took literally over 6 minutes for us to receive a menu so that we can place an order. Other patrons that came in after us we're seated and given a menu immediately. Our waitress was extremely unwelcoming and did not recommend anything from the menu. Already feeling uncomfortable I just ordered calamari for myself and shrimp fettuccine for my wife. The calamari came out pretty quickly and indeed tasted very good, but we waited so long for the shrimp fettuccine that I thought they sent someone to the Hudson River to find the shrimp. After noticing patrons that came in after us receiving their entrees, I realized something was up and decided to leave. I spoke to an individual within the facility and let them know the reason why I was leaving. I just hope that we weren't treated like this due to the color of our skin", "author": "Jason A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "Visited the location last night. Excellent food and service. The drinks were well prepared.  the staff was very attentive and made sure we had everything we needed. the food came out timely. We had the antipasti and the mussels to start both were great and prepared well. I had the grilled pork chops and they were prepared and they were delicious!! Overall it was a great experience and I will be going back!", "author": "Elvin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "Delicious, accessible, friendly Italian food in downtown Brooklyn. The gnocchi was delicious. Portions are large, prices aren't exorbitant. It gets busy though.  \n\nCASH ONLY!", "author": "Scott H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "This is hands down my favorite spot in all of NYC. The food is consistently excellent at a reasonable price. It's hard to sing it's praises enough, but I'll do my very best\n\nFood: The style is red-sauce Italian food common to Brooklyn and Bronx, but with a level of refinement, variety and creativity that its competitors lack. About a third of the menu rotates every few weeks, which in addition to nightly specials, provides variety. The staples are nonetheless excellent choices: I'd highly recommend the fritto misto (a generous bucket-load of calamari and fried shishito peppers, fresh and lightly fried) as a starter and any of the pastas (all homemade) as a main. The desserts are weaker than appetizers and mains. This being said, they still make a damn good panna cotta.\n\nDrink: The only restaurant in the city where you can get a bottle of half decent red for under 20 bucks. Enough said\n\nAtmosphere: Airy in the Summer and cosy in the Winter. The ambience is bustling but never ear-bursting and clientele a relaxed mix of young families and yuppies. Hipsters, on the other hand, are a rare sight. I'll let you decide on whether that's a plus point", "author": "Grant H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "One of the best experiences I've had eating out.  We were a party of 6, so we were able to make a reservation.  I'll keep this simple--I know my food, I'm Italian, and I'm a cook.  The food was spectacular!  For appetizers, we had the stewed octopus (SO delicious!), pork belly, mussels, and chicory salad.  Pastas all around--seafood ragu, bolognese, duck \u0026 mushroom ragu, lasagna, gnocchi w/ brown butter \u0026 sage, and plain old rigatoni with pomodoro.  Every dish was very very good.  Amazing wine list with so many good wines for under $40. \n\nThe biggest star of the night was the service.  Our waiter was attentive, knowledgable, and very helpful.  He was enthusiastic about the food, the wine, and the restaurant.  He would bring out a clean glass for whoever ordered a new bottle of wine to sample it, even if it was the same bottle as before--which I don't usually experience, but very much enjoyed.  \n\nI can't wait to come back to Noodle Pudding, and to introduce new people to the restaurant.  5 stars all the way!", "author": "Carmine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-27", "description": "I should smack myself for not having tried this restaurant until now.  I've been living in the neighborhood four years already, and for good reason, avoided most Brooklyn Heights restaurants, since I generally avoid Brooklyn Heights restaurants - especially on Montague Street.  I find them overpriced and just average.  \n\nNot so, with Noodle Pudding (which is not on Montague St, but on Henry St, incidentally), which serves a homestyle brand of Italian, at reasonable prices, with friendly service to match.  Although I'm not overly fond of their soft bread, it comes with a tomato, garlic EVOO dipping sauce which is fantastic.  I tried their fried sardines, which were perfect in consistency and seasoning.   Not greasy in the least.  The angel hair pomodoro was average, but at around, $11, I felt it was perfectly fine.  The shrimp and squash risotto of the day was flavorful and delicious.  This place is a gem, and I plan to return again.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "An simple but remarkable italian joint. Red sauce galore, and so much more. If you're smart, you'll be sitting at the bar (next to someone who has been there a hundred times), bantering with Mike and his crew, and ordering one of the absurdly fresh specials. And you won't skip the bread basket with the tomato garlic oil (live a little). Hostess and entire staff are gems. Your neighborhood restaurant's favorite neighborhood restaurant.  \n\nNo reservations, no credit cards, and no complaining.", "author": "Christopher S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-15", "description": "I showed up with my mother, my boyfriend and another elderly couple for 6p dinner on Mother's Day. We came out of the rain and stood inside the entrance of the restaurant for a minimum of 10 MINUTES before anyone would look at us. Literally. All the waitstaff, the bartender at the bar near the door, EVERYONE refused to acknowledge us. Meanwhile, the restaurant was half empty and half full of tables covered in dirty, empty plates of food, seats filled with small screaming children and the floor covered in toys and dropped food and napkins. It was a mess and when we were finally asked if we had reservations, we answered that we thought they didn't take reservations. The man said yes, we do take them for Mother's Day. Who knew?! He said we could sit at 730 or 9p but we chose to walk out and eat at Bevacco a couple doors down instead. There, the scene was civilized, clean, and friendly and we had a lovely meal in peace with a fantastic Lambrusco. Will definitely not take a 45 minute subway to come back.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-10", "description": "The ambiance was quite lovely and the food was good. However the service is slow and poor. We waited several minutes just to be seated because the host was MIA. It was busy but not so busy to justify such slow service. Our server also looked miserable and annoyed at us the entire time, even though we were a pretty low maintenance table and just asked for a water refill. It took at least 20 minutes just for them to handle our bill. Will not be returning.", "author": "Lina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "This is my favorite Italian restaurant in Brooklyn.\nThe food is excellent, and the staff is incredibly friendly and attentive. I've been to Noodle Pudding 10+ times and have never been disappointed.\nMy two favorite dishes are Lasagna Bolognese and Gnocchi with butter and sage. \nA secret tip... they have a 15 dollar bottle of house red wine that is surprisingly good.\n\nENJOY", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "Excellent place to have a quiet, cozy night with friends, and really affordable for the quality. Spent three hours here finishing our bottle of wine after dinner and was never pressured to leave. Great service, food, and atmosphere!", "author": "Rachel Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-05", "description": "Came here last night for an exquisite dinner.\n\nService: Great. My water glass was always filled, we never felt rushed to leave, and everyone was friendly.\n\nFood: Great. Minus the calamari appetizer which I found to be a bit too tough. But other than that small mishap it was all delicious. The bread with oil is a great complimentary starter. I had the half roasted chicken which was so flavorful and perfectly cooked. My boyfriend had the short ribs with polenta and that was just as good if not better! They have a nice wine selection as well.\n\nGreat night with great food.", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-05", "description": "Noodle pudding is definitely a Brooklyn heights gem. There's not even a visible sign from the outside for anyone to figure out the name of the restaurant. But you'll def know about it bc the restaurant gets filled with people night after night.   The service was excellent and our server was very attentive and patient. We stayed for almost 2.5 hours and he didn't give us the bill until we asked. Pretty uncommon in NYC restaurant scene if you asked me. \n\nWe tried...\n\n- fettuccine with seafood: this had plenty of seafood. If you can take the heat, I would definitely try it with some red pepper flakes on side. The restaurant has a special kind where they dry their own. \n\n- gnocchi with butter sage sauce: this was the hit of the night. Sauce is so creamy and gnocchi is perfectly cooked! Definitely surprised me.", "author": "Haena Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-07", "description": "Didn't make plans to dine here just kind of randomly walked by, liked the atmosphere and tried it. Really glad we did, tried a lot off of the menu and everything was great. Large portions and no room for dessert. Very reasonably priced entrees and wine list. Will return.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-29", "description": "Came here for my birthday dinner. And I'm happy to say I'll definitely be back. The atmosphere is loud and lively, staff is very helpful and attentive.   The portions are quite generous so be prepared to share. We were a party of 6 and got all the appetizers to share and a lovely bottle of Gavi for the table. The menu is seasonal and changes daily. We started with the brushetta with peppers and anchovies (deliciously salty and surprising change from the standard), mussels in white wine and garlic (enormous and melt in your mouth, amazing!!!), calamari (they were OK, a little chewy), mixed olives (delicious), another app was asparagus wrapped in an italian cheese and baked (not my favorite). We all got our own entrees, which was a bit of an overkill but I don't eat pasta ever anymore and I wanted handmade pasta! The lamb chops I heard was amazing, the linguini with seafood ragu was delicious and so was the other seafood pasta dish. Now for the desserts. We got a few to try. I judge an Italian restaurant by its tiramisu and it as amazingly light and flavorful. The chocolate espresso cake was really delightful and the panna cotta was my favorite, incredibly smooth, light and refreshing with some berries. Overall, a very enjoyable dinner and will definitely be back.", "author": "Dina M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}