{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-20", "description": "The best. What a neighborhood restaurant should be. Warm. Friendly. Lively. Delicious. Nicely priced. (Cash only ya'll.)\n\nTried and loved: Lasagna, Butternut squash ravioli with hazelnut something or other. Pomodoro. Calamari. Grilled chicken salad (this is the kind of grilled chicken salad that's worth ordering even at a place with a menu like this.) Gnocchi. Some kinda awesome ribs, etc. \n\nTake friends. Take family. Take home the leftovers, I've never had any.", "author": "Cornelius R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-07", "description": "I love this place!  The spicy oil that comes with the bread is fantastic.  The lasagna is simple perfection, and the atmosphere is top notch.  This restaurant feels like a big, Italian family get together.  \n\nLeave your credit cards at home and come prepared to shell out a few big bills.", "author": "Alicia K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-16", "description": "Roasted chicken is dangerously delicious! Yet safe some room for flourless chocolate square with hazelnut gelato.  Food here has been consistently satisfying.", "author": "Luk L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "It's just great here. Traditional and authentic Italian; food, atmosphere, staff.  A great all round experience. Busy and bustling but casual dining at its best.", "author": "Tracy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-26", "description": "Well, looks like Yelp was right again.  In short, good food, not so good service.\n\nDinner for two on a Sunday evening, the place crowded but not packed.  After waiting more than 15 min for menus, we had to flag someone down to get them.  We had to flag someone down to order an appetizer.  Then get another person's attention to order our meals.  Then another person to get some cheese.  No one asked us how everything was.  No one even offered us dessert.  The staff weren't unfriendly, they just forgot our table existed.\n\nThe couple next to us got slightly better service.  A waiter actually came over to them and asked if they wanted dessert.  They replied they were never given menus and didn't know who their original waiter was.\n\nFood: Caesar salad - one of us liked it and the other thought it was fair.  Gnocchi w sage/butter - very tasty, especially after I was able to find someone for a little cheese.  Pasta w eggplant, basil, cheese, tomato, etc - very tasty.  The bread with oil they had on the tables was also very tasty.\n\nOverall, go, enjoy the food, just be proactive about the meal", "author": "Jjjaaa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "A pretty solid spot - we ended up here last minute as we were visiting some friends in the neighborhood and ended up deciding to stick around for dinner. They had raved about this place so we decided we should all give it a shot - it was a worthwhile visit with food that was imminently satisfying and well prepared. \n\nWhile there are some more solid Italian restaurants around Manhattan and Brooklyn, these guys know how to execute a solid meal, with a reasonable wine selection and decent prices. We're also huge fans of Henry's End down the block, and the two restaurants are nicely bright spots in the neighborhood that I'd recommend to someone, foodie and otherwise, in a heartbeat.", "author": "Ron S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-21", "description": "I had already been living in the Brooklyn Heights neighbourhood for close to three weeks when my roommate moved in from Ohio. We decided to explore the neighbourhood and get to know each other over dinner when we stumbled upon Noodle Pudding.\n\nA perfect introduction the area, this restaurant was promising of the type of good eating we would hopefully be surrounding ourselves with this summer. It was very crowded for a Sunday night, but the hosts were quick to get everyone seated. What appeared to be a small layout opens up to more seating in the back. The weather was nice so the front window was opening allowing a warm breeze for those lucky customers with a table close by.\n\nThe service was really quick, almost too quick, though we were starving so it wasn't the worst thing in the world. We had barely finished the bread basket before our main entrees were placed before us. The bread was so fresh and served with an oil bread dip paired with chunks of tomato giving a liquid bruschetta like taste, so amazing! I ordered a classic tagliatelle bolognese which came as is. Just some noodles and some meat sauce. It was at times difficult to get the attention of the waiters amidst the busy crowds and many tables, but once I had some parmesean cheese topped onto my meal I was ready to go.\n\nWe split a pastry-like dessert filled with ice cream and drizzled in chocolate sauce which was also brilliant. We agreed we must come again and try some of the other meal options Noodle Pudding has to offer as every plate brought from the kitchen past our table looked beyond great. \n\nAll in all, a perfect quick dinner if you're looking for a simple yet delicious Italian meal. :)", "author": "Jess G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-02", "description": "Still my favorite pick for Iow-key yet delicious Italian food in Brooklyn. Noticed that the menu had changed slightly since last time..but still delicious. \n\nThe octopus appetizer was tomato-y and tasty, and the linguine with seafood ragu was similar to my previous favorite (saffron linguine with seafood) although I missed the squid in the new dish. If you sense a theme..yes, I like seafood. Thanks for pointing that out.\n\nAnyway, had to skip dessert AGAIN because I was too full..but this just means I have to go back again and try to eat less.", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-07", "description": "Noodle Pudding is one of the stronger restaurants in Brooklyn.  Its devoted cult following is a bit bizarre to me, though.  It's a neighborhood restaurant.  If you do decide to make it a destination, though, confine your order to the specials menu.  This, in fact, is a good rule of thumb for any restaurant where the specials menu is so extensive and obviously variable.  If Vinnie's Line Caught Montauk Bass is on the menu, give strong consideration to ordering it.  Other highlights include rabbit (depending on daily presentation), octopus, and the heirloom tomato appetizer (they're smart enough to know when the tomatoes are good enough to merit its inclusion on the menu).  Tuna and swordfish are also generally good.\n\nThe regular menu is decent.  I have probably been to Noodle Pudding over 200 times, and therefore have no qualms about occasionally ordering the chicken with leeks and pancetta, or one of the pastas.  But whenever I have been away from Brooklyn for a long time (as, increasingly, I am these days) my return visit to Noodle Pudding finds me on the specials side.\n\nI have always regretted that the beer selection is not the menu's equal.  And the desserts aren't all terrific (notably the namesake).  Go often and you might get a fruit plate.\n\nThe staff is friendly and helpful.  Bear in mind that dealing with hundreds of people of variable mood and sense of entitlement nightly is no one's idea of a picnic.  You might not be pushy, but the guy with the blazer and country club visor who keeps going outside to smoke and scream at his cellphone probably hasn't lived up to your standards of decorum.  So patience goes a long way...and is repaid amply.", "author": "John B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-10", "description": "Heres the bottom line , im ALWAYS right and will never steer you wrong , if I say it sucks , it SUCKS , if i say its awesome its AWESOME ............ bottom line , take a date here sit near window , enjoy the best priced wine bottle list ive seen anywhere and have some ridiculously awesome pasta especially the Gnocchi , After that walk back to Manhattan over the bridge at night , great spot........romantic and 10 ft from the restaurant , and then enjoy getting laid  , you are welcome", "author": "Lance S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-03", "description": "Small place but Great food! \n\nI love the butter and sage gnocchi - soo good!", "author": "NYC D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-29", "description": "New to the neighborhood and found this homey Italian place for one of our first dinners with the visiting family.  \n\nNothing too fancy, but mostly delicious.  Mussels were really good as was the shrimp risotto.  \n\nAlso tried some of the fish and pasta dishes, all were better than average.\n\nI'd say it's family-friendly for sure, although I don't recall there being an explicit kids' menu.\n\nHaving been there twice, service was excellent one night but sub-par another night.  I say sub-par not at all for friendliness of the staff (everyone was really nice), but rathe for attentiveness and time it took to get bread, water re-fills, etc.  Could have just been a bad night, though.\n\nCASH ONLY!", "author": "Ori B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-21", "description": "One of my favorites! The atmosphere is warm and lively. The food is delicious. The wine is cheap ($14 bottle of wine woohoo!) \n\nI really enjoy the gnocchi with butter and sage but everything else I've had here has been yummy as well. \n\nAfter dinner, it's nice to wander over to the Brooklyn Heights Promenade, catch lovely views of the city and conclude your fabulous night.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-11-30", "description": "I was so excited to try this place until I sat at our table to check out the menu and a cockroach crawled across my plate setting.\n\nWe immediately left.\n\nIck!!", "author": "Analia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-03", "description": "Without question the best Italian food in brooklyn heights. Tony, the owner and a real Italian from Italy, has been in the neighborhood before it was chic to be in Brooklyn Heights. The food is authentic and simple, tasty and reasonably priced. the service is attentive and professional. Bring cash, no credit cards accepted here. Great for dates too! The pastas are al dente and usually homemade, they way they should be. During the warm months, the entire front of the restaurant opens up (almost like a garage door) giving it that indoor/outdoor feeling. My in-laws are from Florence so I have spend a lot of time in Italy. Take it from me, this worth the trip.", "author": "Kamuti K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-17", "description": "I had heard good things about this place.  We had friends coming into NYC for their honeymoon, and we decided to take them there for a celebratory dinner, since we weren't able to make the wedding.  We made a reservation that morning and reconfirmed it a few hours before, requesting (not expecting) a decent table since it was a special occasion. \n\nWhen we arrived, promptly at 8pm, we were told it would be a few minutes.  There's no where to wait except in the doorway.  About 15 minutes into waiting, we asked the host how much longer.  He told us we were next, and that he was just waiting for a table to finish up.  We watch that table finish, leave, be reset, and sit empty for a good five minutes why the host stood and talked to the bartender.  At 8:30pm, a half hour of standing at the door with a supposed 8pm reservation, I ask him if we can sit at our table.  He then tells me that the table is for someone else.  I tell him he told us 15 minutes ago we were next.  He said, \"No, there's other people in front of you.\"  I remind him we had an 8pm reservation, it is now 8:30pm.  He tells me they don't take reservations for parties of 4.  I am really confused at this point.  I tell him not only did the restaurant take our reservation, they reconfirmed it just a few hours ago.  He insists no reservations for parties of four.  He says all this with complete indifference, unapologetic, almost belligerent.  \n\nHe then continues, \"Besides you were late.\"  I can assure you we got there at 8pm, not a minute later, in fact we made a joke about our promptness when we arrived.   I insisted we weren't, he insisted we were.  Trying to avoid a heated debate at this point, I tried to reason with him and say, \"I don't want to fight with you, but you can see why I'd be frustrated right now.  We made a reservation, it's a special occasion for us, we have been waiting a half hour at the door, you tell us we are next, and now we are not.\"  His response, no joke, \"Sometimes life's a bitch.\"  \n\nAt this point I ask for a manager, he says he is the manager, his name is Piedro.  If I wasn't there with my friends and celebrating, that would have been my cue to walk out, but I did not want to ruin the night.  \"When will our table be ready,\" I ask.  \"It's ready,\" he says, and motions to the table that had been sitting empty all along.  I am baffled at the game he is playing at this point.  I call my friends over and we go sit, a table by the kitchen.\n\nIt gets worse.   We order our food, and as my appetizer is placed in front of me and I pick up my fork, one of the assistant cooks comes out of the kitchen, eyes completely focused on me and my food with a smirk.  I am waiting for him to look somewhere else, but he is completely focused on me and my plate, no one else at my table.  It was completely awkward.  I finally take a bite, and he laughs and walks back in.  You can read into that however you want, but I waitered in restaurants for 8 years, and my instincts were telling me to put the fork down.  I'm not a paranoid person, I don't usually jump to conclusions, and I was starving.  But it was just way too obvious, this guy.  I pushed my plate away from me, and watch the manager walk back and forth, looking at my plate and me, and only me, waiting for me to bite into it.  \n\nAgain, at this point I would have stormed out, but with friends in from town celebrating their week-old marriage I sat there quietly, boiling inside.  I was pretty sure my friends dishes were fine, as they served by table and seat number, and knew exactly who was getting what.  And there seemed to be no focus on them and their plates.  I quietly asked the waitress to cancel my entree.  I shared my boyfriend's.\n\nIt's a shame one or two people can spoil not only a significant night, but a great restaurant.  The food I did taste from the other plates was really good.  And our waitress, who was completely oblivious to what was going on, was phenomenal.  Toward the end, she started realizing something was up, and did her best to diffuse the situation.  But it was too late.\n\nMy Advice to Noodle Pudding:  The guy greeting patrons and playing host should  not have the grace and people skills of a DMV desk clerk.  And the tricks seemingly pulled by a few bad eggs could bring down your entire establishment.", "author": "Jason L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-13", "description": "Noodle Pudding is nestled on a quaint street in Brooklyn Heights. I went here with my boyfriend at the time and found the food and service to be exceptional.  This is a good date spot. :)", "author": "F N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-13", "description": "One of Brooklyn's best kept secrets. The pasta is outstanding. Favorite dish is the octopus appetizer. The revolving daily specials make it a new experience with every visit.", "author": "Sheldon W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-18", "description": "came here for dinner on a saturday night. the place was busy, but we only waited ten minutes for a fourtop, aka table for four. service was okay, nothing superb, but not horrible either. the food was quite delish and tasty! we had the octopus on top of garlic bread to start, and we devoured the whole dish, including the sauce. we absorbed every little bit with the bread they bring out when you sit down.\n\ni ordered the gnocchi in butter and sage sauce, which was great! the sauce was delish of course, who doesn't like butter?! and the gnocchi were fluffy little pillows that melted in my mouth!", "author": "Pamela s."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-25", "description": "Ok Italian food. Calamari was good. Wines were ok. Mussels were good. I had a mushroom paperdelle which was decent. The tagliatelle was eh, the lasagna was eh. Small place but they did try their best to make it comfortable. Cool name.", "author": "Bjorn P."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}