{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-13", "description": "Noodle Pudding is the kind of restaurant every neighborhood needs. It has a courteous, attentive wait staff serving delicious Italian dishes (both from their regular menu and nightly specials) in a casual setting. I am particularly a fan of the Rigatoni Alla Siciliana, but have never been disappointed with any of my selections. For an appetizer, the calamari impresses, and for dessert the tiramisu is delicious (though I recommend reviewing all the options, as they serve seasonal treats too; I most recently had peaches with gelato and blueberry sauce...yum!). There is a bar as well, but I have always gone for dinner. This place is definitely one where you will go and most likely return again and again, if you live in the area. Just be sure to bring cash, they do not accept credit cards.", "author": "Jeremy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-16", "description": "Would like to add to what others are saying here -- the place has good food, is very reasonably priced, good service and atmosphere. But would like to give particular props to the bartender (Mike, I believe), who served me my meal the other night when I wandered in solo on one of my last nights in the neighborhood after giving up my apartment of 10 years. The guy just handles himself and those he serves well, is attentive, engaging, not overbearing, and has an innate feel for the vibe on any given night. Makes a huge difference when one is eating on his or her own. This is an invaluable addition to any restaurant, and most particularly one that doesn't take reservations and deals in cash.", "author": "R M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-01", "description": "This place was pretty good! I liked my dish (a chicken, spinach, and gnocchi meal) very much. My boyfriend ordered a chicken, leek, and potato dish that he thought was a bit lacking in flavor, but mine was great. As other reviewers have said, it is cash only. While some of the dishes are more expensive, we left with only a $40 bill for the two of us, which is pretty reasonable for high quality Italian food.", "author": "Rana L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-01", "description": "this place had terrible service, and i will never return. i was embarrassed by the staff. i will never support this restaurant. it's trash.", "author": "Jose O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-21", "description": "Great place, service was excellent!!! I had the pasta MAFALDA AL CACIO PEPPE it was delicious. Pasta came with a yolk on top it was amazing", "author": "John M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-09", "description": "CASH ONLY! Something our server neglected to point out until he brought the check. Not happy to shlep a couple blocks to the bodega up the street to use the ATM while the rest of my party is sitting around twiddling their thumbs until I return. More importantly, I'll just say it: restaurants that have been around for a while and still aren't set up to take credit cards are running a tax scam. There's no other explanation. \nPasta was ok, noodles were homemade, but the sauce lacked seasoning (salt). Pork chop had a nice sear but was dry and overcooked. The house wine was good, as were the prices (apparently you can charge less if you don't pay taxes). Atmosphere was pleasant, with large open windows and low-key warm lighting.", "author": "Ruth M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-21", "description": "Food was good but it didn't blow me away I ordered the short ribs and noodle pudding it was good but like I said it didn't blow me away I don't know just didn't really wow me it had good flavor just wasn't on my ratting for it to be a must try now for me it was an indifferent", "author": "Angel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-06", "description": "This place is definition of good down home Italian cooking. You can actually taste the love they put in the food!  I can't wait to go back because the food is amazing. The service can sometimes be a bit backed up so they lost a star for that.", "author": "Garynn N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-11", "description": "Very good service and excellent food. The price is very fair for what you are receiving. I would recommend getting the kitchen sink salad to start. Overall a good spot that I will definitely be returning to in the near future.", "author": "William D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-11", "description": "Good service, though could be better, at a Italian place and they forgot to serve Parmesan cheese. Pasta was pretty good, but felt like the pasta texture could be a little better. Overall very good, cute, place :)", "author": "Jay L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "Neighborhood gem. Service and atmosphere is the perfect BK Heights vibe. And the food is incredible - freshest seafood and generous portions.", "author": "Anthony D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-04", "description": "CASH ONLY is a big turn-off for me. \n\nWent here on a Saturday date night and the place was slammed with families. Kids running around knocking things over, flashing sneaker lights, laser pointer toys and general yelling really killed the vibe. \n\nThis place is the paper table cloth and saw dust on the floor type, which I wasn't getting from previous reviews. \n\nFood is okay. I don't think they're making all their noodles by hand other than the gnocchi, which was way too salty. For that reason, the menu seems overpriced.\n\nBring your parents, who are probably the only people carrying cash these days anyway.", "author": "Michiko F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "Two bottles of wine, 2 appetisers, 7 main courses, 4 desserts - less than $250? This place is awesome if you want an Italian place that's inexpensive and homey like a Mom and pop joint. Must try!", "author": "Juliana O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-17", "description": "What is a noodle pudding? Haha. I don't know why this restaurant is called Noodle Pudding, they certainly did not have puddings made out of noodles, but they did have delicious pasta indeed.\nIts really popular, even on a Thursday night, there was a short line. You can wait at the bar if you want to. Its kinda open to the outside, so we could feel the outdoor breeze. \nThe bread that they serve comes with the most delicious olive oil ever. We ate all the bread and asked for more.\nI ordered the fettuccine with mussels, clams and shrimp in a shellfish ragu. It was delicious. The pasta was cooked to perfection, the shellfish didn't cause a stomachache. The portions are pretty good too. We also ordered the $1 meatballs (make sure you look at the bar, there is a special bar menu but you can order those items at your table). If I had room, I would have tried the $1 rice balls as well. \nThe service was ok. One young girl had her birthday there and a few waiters started singing the happy birthday song with a heavy Italian accent, which was very cute!\n\n*cash only\n*order the $1 meatballs or rice balls from the bar menu", "author": "Stephanie Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "The food was amazing! Gnocchi to die for. The waiter was a bit pretentious. But will suffer for the best gnocchi ever!", "author": "Cathy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "Great experience. Came on a Saturday night around 8 with a party of 3 and was seated within 20 minutes. There was enough space to get drinks at the bar while we waited. Attentive hostess, good bartenders, and great food. Tried the mussels, lasagna, gnocchi, osso buco, and tiramisu. The mussels and gnocchi were highlights.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-28", "description": "Venue - Easy to miss because there's no real sign outside. Restaurant has an old-school style decor, bar area, and plenty of seating.\n \nFood - \nBread - Complimentary bread was just alright.\nGnocchi - So soft and pillowy. One of the best gnocchi I've had. GET THE GNOCCHI.\nCrab Raggu (special) - Great flavor with fresh pasta, but wasn't a particular fan of the pasta it came with.\n\nCASH ONLY", "author": "Katrina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-10", "description": "I liked everything I had here except for my main dish. First I had the grilled Maine sardines and they were delicious. They come in a pair and are relatively large so it makes for a filling first course. The garlic bread, though simple is also great. Their wine list cannot be beat in terms of variety and price. We had a great bottle of wine for only $40. The service is alright. We came on a busy Friday night but it would have been nice to see the waiter just a little bit more. \n\nMy boyfriend got the lasagna, which was really good. I got the fettuccine with mussels, clams and shrimp. It was not so good. The sauce was fine, nothing crazy. I am not sure if they make the pasta fresh on site but it did not taste as though they did. Which is fine. My pasta was a little too al dente for me and I like my pasta al dente. The seafood in it were fine too. What really killed the dish for me was the big leaves of raw parsley on top that were not just for decoration. Once you got a bite with one of those it really killed any other flavor. \n\nI won't be rushing back but I will certainly come back. The atmosphere is great and the food is good. I think I just made the wrong choice on my pasta entree.", "author": "Hillary G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-27", "description": "I walked in at 11:05...I know, I know, I hate to be that guy...but I was...the host or owner told me they were closed even though Yelp says thru are open till 11:30. Yelps times have been wrong before so I wasn't too thrown off.\n\nSo the host told me they were closed for the night, but must have seen the hunger in my eyes. I've got hungry eyes, and took pity on me. He asked me if I was alone. Of course i was, what else is new. He offered me some lasagna and salad, since it was made already. That was very nice of him. I told him I didn't eat pork....he offered me a simple pasta dish. I said anything with creme sauce. He brought out a salad, bread and olive oil and gnocchi with creme sauce....very quickly...he checked on me twice and was very very nice. \n\nThe food was good. I would definitely come back here! \n\nGreat service!!!!", "author": "Ahmed A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "Excellent menu and fantastic food. Prices are great...cash only though.  Best roasted chicken around.", "author": "Fern F."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}