{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-16", "description": "Cash only. Cute and good homemade pasta. Specify how you want it cooked. I judge Italian places by their gnocchi and their's wasn't amazing but certainly passable. Reasonable prices (vs. Midtown Manhattan). I drove but quite accessible. Drinks are solid (house wine is not terrible). I really enjoyed the appetizers (caprese was fresh, short ribs quite food). Desserts are excellent, but quite rich. I drove but reasonable transit. Can get cramped so come on a weekday or early.", "author": "K A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-14", "description": "My favourite restaurant in all of NYC. \nFresh delicious food, good price and great staff. \n\nMakes my mouth water just thinking about it.", "author": "suzanne m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-28", "description": "My favorite Italian restaurant in Brooklyn.  Antonio is the best - his dishes are simple, well done, flavorful and fresh.  Great fish - particularly the line caught fish (trout, bass).  The place is old school and the wood bar is inviting.  The wait staff have been with him for a long time and care about their customers.  Moretti on tap and an affordable wine list.  It's not babbo and doesn't pretend to be anything but what it is - a fantastic old school italian restaurant that isn't red sauce and parmigiana.  Love this place and am there enough to be a regular.", "author": "John A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "Went here on a Sunday without a reservation and were lucky and got seated right away.  We had a 6-year-old with us (4 adults) and it was remarkable how well he was treated.  Our waitress (and I'm embarrassed to say we didn't get her name but she was the only female) was incredibly nice to all of us but particularly nice to him:  brought him crayons right away and extra paper and took the time to look at all his drawings and comment on them.  She brought him a drink and dessert gratis.  We all enjoyed our meals very much, particularly the bread and olive oil concoction which was really well flavored.  The only thing I'd pass on next time is the mashed fava beans with dandelion.  All our main courses were really good from pasta to hangar steak.  You have to be prepared to pay cash.", "author": "Kathleen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-09", "description": "Been here twice in the past 2 weeks.  Will definitely become a regular.  Lasagna is to die for.  The sliced rib eye is also delicious.  A favorite of my fiance.  Their marinara sauce is just like my grandma would make at Sunday dinner.  Would highly recommend!", "author": "V F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-19", "description": "The Montreal Bass is sooo goood! The asparagus and the brocoli are cooked to perfection! The $14 white wine that a fellow yelper recomeneded was superb! Cash only and expect a crowd.", "author": "Kelly C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-18", "description": "Food was just OK -- not a big variety of pastas, and there was little innovation in the menu in general. Service was hands down some of the worst I've ever experienced, as we were one of four tables in the restaurant and constantly had to ask our waiter for help (more water, bread, wrap these up, desert menu...). For two people who only had one glass of wine between us, our bill was almost $100. Probably won't be going back, especially with new restaurants popping up in the neighborhood (and surrounding -- Cobble Hill). Seems like they are resting on their morals a little too heavily. Also cash only.", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-12", "description": "Great Italian food! This isn't your plain old chicken-parmesan-lots-of-red-sauce-my-non-Italian-mom-could-make-this-food-the-same-way type of place...this is legit. Don't let the unappetizing name of the restaurant turn you off. I have been here twice and have loved my meal each time!\n\nSome things to keep in mind: they are cash only (boo!), I never really know when they're going to be open (I don't think they're open for lunch b/c I went by one day and they were closed) and you're going to have to wait ~30-50 mins for a table if you go on the weekend. These drawbacks are the reason I've only eaten here twice.", "author": "Kelly A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-15", "description": "This is another one of those places that for some reason, is completely unforgettable.  I can remember every single detail from my experience:  The romantic ambiance. The way the candlelight flickered. The sweet aroma of fresh Italian food.  The way my mouth watered at the very first bite.  The best service at a moderately priced restaurant I've ever had.  The panic I felt when I realized it was cash only!  The relief I felt when I saw the moderately priced check!  The sadness I felt when I knew I had to leave to catch the 8pm movie next door.", "author": "Opinionated B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-30", "description": "Something sad happened tonight at Noodle Pudding. Our experience was awful. After many years of eating there, I will never return. \n\nOur party of four was seated closer to the wall at a table for six, then a party of two was seated at the end of the table. They ordered, received their wine, and bread before our order was taken.  We eventually requested bread and the waitress came for the order. Only one of two appetizers arrived. We asked for the appetizer and waited ten minutes. The folks next to us received their entrees. After a very long wait, three of our four entrees arrived. One, a lasagna, was room temperature and burnt at the edges. The second had the wrong side; mine was fine. My husband's dish, the roast chicken, didn't arrive. The folks next to us finished their dinner. After a while, the waitress stopped by to say the chicken would be there soon. Still no chicken. Finally, my husband got up, found the server and canceled his entree. \n\nSomeone came out to apologize, saying that the cook had forgotten to make the chicken. Then the server reappeared and said chicken took a long time to cook. When we told her that the man who apologized had already told us that the order was forgotten, she walked away.  My husband's nonexistent chicken and two glasses of wine were omitted from the bill.  It was a terrible night at what had been one of our special places, despite the incessant noise and screaming kids.  Too bad.", "author": "Lee B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-27", "description": "Noodle Pudding is perhaps my favorite restaurant in all of NYC.  The combination of the food, service, and a very reasonable wine list is hard to beat.  Most of the time when I go out for Italian food I think \"I could have done this better\" but that thought never crosses my mind when dining there.\n\nI have been there a number of times so I'll just share some highlights.  The gnocchi with brown butter and sage is absolutely TO DIE FOR.  I have eaten a lot of gooey gummy tasteless ricotta gnocchi in my day and these are anything but.  Little clouds that melt in your mouth and cause you to consume them until you have to skip dessert.  On one occasion the bottle of wine we ordered was unavailable so our server suggested another one.  I didn't ask the price at the time and when I got my bill the substituted bottle cost $14- $14 for a very decent red in a restaurant in NYC is unheard of.  The last time I went I had the special veal cheeks with raisins, pignoli, and...well who knows what else was in there but I was completely drunk on that baby cow.  So tender and flavorful- definitely in the list of top 5 dishes I've ever consumed.\n\nThe atmosphere itself is a little hectic and there will probably be somewhat of a wait.  Get there early and enjoy a cocktail while you scope out other diner's food and plot the best way to consume as much as possible.", "author": "Emily C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-06", "description": "A classic neighborhood restaurant.  Cozy, inviting, always great service, great prices.  While I love the menu, I have always found the food to be very good, never great.   Definitely my favorite restaurant in the Heights/Cobble Hill area.  Watch out for long waits at peak times.", "author": "derek v."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-12", "description": "I guess that maybe I have written a review for this place before bug I have to add to it now. Had a job dinner there a couple of nites ago, 15 people being served a prix fix dinner. Can i just say it was the best dinner I have had in a long time.  Marcello was my point man for setting up the dinner and he was great very accommodating as well as clearly laying out what would happen that nite. We all arrived and did not have to wait for a table. Wine was waiting for us. The appetizers were a little slow in coming, just a little, but once they started, marone! They did not stop coming. Plenty of food. Noodle believes in variety. From muscles to ham to salmon and back to salads and more in between. Then came a little ravioli and then on to the main course. Belisimo! The hanger steak was crunchy and tasty while preserving the medium rear taste. Then on to a variety of deserts.\nI highly recommend this spot! Great food, great price and great people.\nThank you Marcello\n\ng", "author": "gary S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-10", "description": "The food was pretty good here, but the service was awful.  I was really surprised since it has gotten good reviews on this site.  We chose this place to eat because it's near Brooklyn Bridge Park and we wanted to go see the Manhattan skyline at night after dinner.  When we got there, the hostess (very sullen) said it would be a 45 minute wait.  At the end of the wait, when we asked if our table was ready, she pointed to a huge table that was being cleared off.  Apparently, she thought we were a party of 10...we were a party of 3.  So we ended up waiting another 20-25 minutes to be seated.  After we got our table, which was very pretty and at the front of the restaurant near the large open window, we had to wait forever for our server to bring us anything and take our orders.  I had gotten used to a slower pace of service while in NYC, but this was ridiculous.  At the end of the meal, our server brought a dessert menu and then never came back to ask if we wanted anything.  We had to flag down another server to ask for our check.  And even then, it took another 10-15 minutes for our server to come back.  When we left, not a single server or host even looked at us.  I don't expect people to trip over themselves in gratitude for our business, but for no one to thank us for coming or inquire if we enjoyed our meal...especially after we had waited so long...was crazy to me.  All in all, we were there for 3 hours and didn't leave until 11:30pm.  The ambiance in the restaurant was very pretty and the food was good, so that made it not a total bust.  But, my friends and I were very disappointed that this was our last dinner in NYC.  Maybe we just came when they were having an off night, but regardless of how busy you are (and they weren't that busy) servers should be visible and available to their tables.  I would not go back and I certainly wouldn't recommend anyone else do so.", "author": "Katie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-11", "description": "Absolutely delicious food, excellent service, wonderful atmosphere, and appropriately priced. Just got home, and the first thing I wanted to do was reward them with a great review. A warm mix of romantic and friendly, with fresh and desirable dishes that make you feel good eating them (the sauces were especially impressive), it was the perfect night out.", "author": "E K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-26", "description": "this is one of my favorite go-to spots in Brooklyn. Consistently good, reasonably priced, cozy. I've been there about 10 times and It has always been a pleasurable dining experience.", "author": "Audra G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-28", "description": "I've been going to Noodle Pudding for at least 6 years. Every time I come to NYC to visit family we'd go here one night and to Queen's another (located on Court). I really do like the place and it has become one of my favorites in the neighborhood. The place is lively and energetic with that rich neighborhood feel. Yes it gets loud but I don't think anyone should claim this to be a romantic, mood place. It follows the Italian culture- it's loud and energetic, just like my family! Haha. But on to the food... I personally love the mussels in the spicy tomato broth (AMAZING), the calamari and all the pastas. I've heard the osso bucco is amazing but I do not eat veal. They have daily specials which are all delicious as well. Also when they have it, the lemon goat cheesecake is superb. And yes, there is a woman waitress who I hate to say is just really really bad there... I've had her on a few different occasions months apart and she will screw up our orders, take forever and acts very aloof. Every time I sit down and discover she will be my waiter I cringe slightly. Besides that, I definitely think you should give Noodle a try and have a good time! It's worth it!", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-01", "description": "Great local place and ambience. Highly recommend the smoked mozarella salad and the beet salad. The skirt steak was delicious as well, juicy and full of flavor. The fried anchovies were light but needed a little bit more salt and acid.", "author": "Victoria C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "There is no kugel to be had, but this establishment totally lives up to the \"Noodle\" part of its name. \n\nMy friend drove 11 hours from Michigan to NYC (another victim of the economy) to visit his former stomping grounds and I decided we had to go all out. After a beautiful day in Dumbo we made our way over to this Italian restaurant. There was a wait of 30 minutes (seems like everyone and their kids  love this place) but I entertained myself by making funny faces at the adorable children sitting near me. I'm such a creep. \n\nWe were seated in a corner by the window and the table was very small. I could complain about the cramped quarters but having dined at Graffiti I now understand the true meaning of dining in discomfort. Fortunately for us we could use the ledge by the window for our wine. The servers were very professional and made some marvelous recommendations. My boyfriend and I ordered the least expensive red on the menu ($14), the meat, cheese and olive plate ($12), the gnocchi in butter and sage sauce ($12.50) and a skirt steak with tomatoes and onions ($20) \n\nAs the restaurant was very busy we didn't get our complimentary bread until the antipasto had arrived. I consider this a blessing because had it come earlier I would not have had any bread/EVOO w/ peppers/herbs for my salami and cheese! The oil was totally addictive.  My dining partners and myself were constantly eying each other as we spooned the oil and pepper onto the bread, praying there would be some left for the next person. The antipasto itself was a lovely starter, but we barely had a chance to finish it before our food arrived. \n\nThe gnocchi appeared first, and the portion reminded me of why the pasta course is called \"Primi\". It was such an appetizer. A basketball player's amuse bouche. I was ready to fight the boyfriend because I caught him trying to shovel it away while I wasn't looking. Sharing is caring! Especially when I'm being sugar mama for the night! Fortunately the skirt steak came around, glistening beautifully...providing him with the perfect distraction. As he admired the steak I had some much needed QT with that gnocchi. It really was divine. The sage/butter was the perfect sauce to bring out the pasta's natural flavor. All I could think was \"Why haven't I made sage butter sauce of my own? Am I insane? Am I...mentally challenged?!\". That changed when I tasted the velvety and slightly BLOODY (mmm) steak. \"Why don't I make skirt steak more often? It's not that expensive. Wow, what is wrong with me??\". It was incredible. The dishes were so good that I nearly forgot about the wine! Unheard of. \n\nOur bellies were..sort of full. So we REALLY went all out and ordered dessert (every dessert is 7.50). Tiramisu and chocolate mousse cake with hazelnut gelato. It was too much. The chocolate mousse cake was so rich I could hardly handle it. I was hunched over and ever so slowly consuming each bit. Completely sinful. Dessert should not be such a chore. By the time it was done I was convinced that I was going to pass out in ecstasy but the bill woke me up. It did some damage to my bank account but was still very inexpensive for the quality of food that we ingested. I was very, very satisfied with my dining experience. The satisfied groans in the car ride home indicated the same was true for my dining companions.", "author": "Briana M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-01", "description": "Summary: Wait was interminable, service was shockingly slow, atmosphere was really loud, food and bar was good. Make a reservation or come promptly at opening.  Eat at the bar if crowded.  Order only what they are known for - pastas.  \n\nStory:  I have had 2 previous experiences at Noodle Pudding that were lovely.  This 3rd time was sadly not the charm.  Granted, my boyfriend and I decided to go (no reservations) on a Saturday night at about 830p but we were in a patient mood.  \n\nUpon arrival, the place was naturally packed, 10 people deep waiting at the door.  The wait for 2 people was 1 hour - no problem - we headed to the bar which unbeknownst to us ended up being the peak of the night.  Bartender was great - speedy, hygienic (he checked all glasses for spots) and no frills.  Pinot noir was yummy.  Downhill from here.  \n\nOlder Italian couple (Vinny + wife) arrived 30 minutes after us, cut the line and were seated promptly - clearly some VIP.  Another couple who arrived right before us on the list complained and were seated 20 minutes earlier than us - go figure.  \n\nGod bless Ari (the maitre-d) who was sparkley friendly and attentive - maybe he knew he had to overcompensate for the long waits and poor service.\n\nWe finally got our table and the service was awful.  The double-date seated *right next to us* who ordered *at the same time as us by the same server* got their appetizers and entrees far earlier then we did.  We stared at their good like hyenas.  Our server was the brunette with the black rimmed glasses - take note.  What I thought was her natural mellowness turned out to be more like space cadet central.  \n\nTo start, ciabatta bread with oil was good - we inhaled ours from hunger crankies. Our calamari appetizer was clearly forgotten in the kitchen - the runner finally brought it out and apologized for the wait (45 minutes from the moment we ordered).   It was good though.  \n\nOur lasagna and pork chop came about 30 minutes after that and we just gulfed what we could so we could get the check and get the hell out of dodge.  By this point it was already 10:50pm!  \n\nThe lasagna was good, pork chop dry (probably from sitting out too long).", "author": "Crystal B."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}