{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "It had been waaay too long since we've been here and oh man, what a treat! Everything from the delicious bread (served with the finest olive oil and tomatoes), to the decently priced wine, the razor clams, the freshest mozzarella and tomatoes, homemade pasta - top-notch! Prices are fair and portions are generous but not gluttonous. There are so many trendy new places with $40 pasta dishes, lots of hype, but Noodle Pudding tops them all. Staff is unpretentious and attentive, atmosphere is very comfortable. Love this place!", "author": "Jen O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-07", "description": "\"Energy rightly applied and directed will accomplish anything.\" -- Nellie Bly\n\nAfter an exhaustive overworked and stressful week Saturday has finally arrived with good news that my poetry have been published once again as signs of fruitful rewards from great effort and hard work.  Dinner and a drink is how I summon peace and achieve a celebratory moment. ** Noodle Pudding is CASH ONLY. **\n\nLinguine Alla Puttanesca $12.00\nIt was too salty and the pasta used was spaghetti- NOT linguini as the entrée name is written in the menu.  The pasta used is round, but linguine is flat about 4 millimetres (0.16 in) in width, which is wider than spaghetti but not as wide as fettuccine.  Ergo, the name of this entrée should be renamed \"Spaghetti Alla Puttanesca.\"  Minus one Yelp star. Despite of the incorrect pasta used this entrée does contains the traditional basic ingredients:  tomatoes, olive oil, anchovies, olives, capers and garlic.  I skipped the black olives and capers leaving it unconsumed.  This entrée appeared in Netflix's \"Lemony Snicket's A Series of Unfortunate Events\" when the Baudelaire children prepare dinner at Count Olaf's house. It also appeared in \"Sex and the City\" season 4, episode 17, \"A 'Vogue' Idea\" where Charlotte wanted to host Miranda a traditional baby shower with a lovely puttanesca which enticed me to give it a try.\n\nMy waiter is attentive to serve and suggested a good white Italian wine that is very crisp, refreshing and chilled at a cool temperature which was paired perfectly with my entrée.  Unfortunately, I do not recall the wine name by the glass.  It appears the restaurant staff wear white uniform and mostly hang around the bar ready, able and willing to serve.  The bill is tallied by hand and is hand written- NOT computerized.  My one wine glass was not itemized but was included in the calculation as beverage.  Ergo, minus one Yelp star.  Restroom facility is labeled as \"WC\" British for water closet which is extremely dark, dingy and no hooks for bags or jackets placement and mediocre clean.  This restaurant is opens late and is child friendly.\n\nNote:  Cash only.  No credit or debit cards are accepted at Noodle Pudding.  The building façade does not state the business name which is very discreet and unknown.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-28", "description": "This is one of my go-to Italian neighborhood spots. I was recently here with friends visiting from San Francisco so I had to impress them. It's conveniently located close to the A/c or 2/3 trains. We arrived early and had a bottle of Prosecco at the bar chatting with the friendly bartender. Later once our friends arrived we had the antipasto plate and some delicious pastas for our main courses. And the tiramisu for dessert is awesome.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Birthdays, anniversaries and holiday dinners, all of which I returned with friends and families who are now hooked and  I sometimes bump into here on occasion.\ntony is a culinary genius, if you get to know him well, let him design a dinner for you, believe me, he won't hold back to the best quality and cost.\n\nsome of my favourites are the razor clams, endive salad, hangar steak with tomatoes and onions, and cant beat the ciabatta and spicy olive oil.\nto finish with illy coffee and  pannacotta.\nciao tony!", "author": "Joe C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-27", "description": "If you are looking for great service, a kid friendly environment and located in one of the best neighborhoods in NYC, then check out noodle pudding! \n\nThey have a great selection of pasta dishes that can be broken out into dinner and primi portions. In addition, the fresh catch usually doesn't disappoint and can be served for two people! \n\nRemember, cash only but a small inconvenience for this local neighborhood gem! \n\nSuggestions: Lasagna, fish of the day!", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-25", "description": "Love Noodle Pudding so much!  It's my neighborhood go-to.  Still family run and feels \"local\" -- it's reasonably priced, you know the waiters, the food is great (classic Italian-American with well sourced ingredients), and charming to boot!", "author": "Tim M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-25", "description": "It's the neighborhood gem.  No reservations so come early (like 5:30) or late (10-ish) if you want to get in because it is very, and deservedly, popular. The owner, Antonio, is the chef, and more impressively, he goes himself to the market and selects the food and serves it up beautifully.  All dishes are meticulously seasoned, fresh, and delicious!\n\nThe service is prompt, courteous, but refreshingly unceremoniously down home. The ambience is ordinary, and the acoustics problematic, for me anyway, since I'm a bit hard of hearing and the place is always packed.\n\nOne thing: cash only, but that's OK because--for a restaurant of its quality--it's cheap!  The food is the great bargain.  This restaurant does no need my recommendation, really. The crowds thronging in front all evening tell the tale!   Oh, and by the way, the drinks are king-sized and well-mixed.", "author": "perry w."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-12", "description": "Tried the seafood fettuccini it was gross. The shrimp was overcooked, the sauce was definetly not homemade. The place does not accept cards, atm machine was 2 blocks away. This is 2018 what kind of restaurant doesn't accept cards. It was also very loud and the tables were very close to eachother, not a pleasant atmosphere. Will not be returning.", "author": "Annushka I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-07", "description": "Noodle Pudding is a tasty, cute little Italian restaurant in Brooklyn Heights that is definitely worth the trip if you are in the mood for Italian. Especially for any tourists, its way better than anything you will find in Little Italy. I will spend the rest of the review praising this spot, as I really enjoyed our dinner. However, two things to note before I continue: #1- its CASH ONLY, which is annoying, #2- it can get a little loud when crowded (which is often), as the have great acoustics. Let's go on!\n\nThe menu at Noodle Pudding changes regularly, usually based on what kind of ingredients that owner and chef can get their hands on. For us, this meant a dish named Straccetti, which is a kind of beef cutlet grilled on one side. It was amazing. We also had the Endive salad, which was very flavorful while not being too heavy, and the Pappardelle, which was mixed with different cheeses, a light sauce, tomatoes and cooked perfectly al dente. While I'm not sure what the menu will look like when you go, it will be tasty.\n\nThe staff are friendly and offer some excellent wine recommendations and know the food well. They were attentive also. The prices are reasonable, but once again, they only take cash. Also, it can get crowded! So plan ahead, but its totally worth it.", "author": "Nick M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-10", "description": "This unassuming Italian restaurant delivers on everything. Went to NP on a Saturday night at the recommendation of a friend. It is cash only and there are no reservations but the 20ish min wait was well worth it and easily passed at the bar. Once seated we ordered the meat/cheese plate, delicious. Everything was exceptionally fresh. We then had (the special) fish/mussels and the hanger steak. Both were delicious and service was on par. Will definitely return. Can't wait.", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "Come for the food, not for the service. Since moving to Brooklyn all I've heard about is Noodle Pudding. We finally took our chances on a Friday night and walked in around 7:30 - it was already very crowded. It took a good two minutes before anyone came over to us to ask if we wanted a table and when they did come over they said it would be \"a couple minutes.\" It actually was, which never happens in New York. We were absolutely famished but it took forever for our waitress to actually come over. We could tell the people next to us had been waiting for a while as well. Started with the calamari which was incredible. Maybe not the calamari itself but the sauce is INSANE. It's a sweet/spicy aioli I believe. The bread was also great but took forever to come out. It comes with an amazing bruschetta dip. For my main course I got the linguine with clams, zucchini and cherry tomatoes in a white wine / garlic sauce. It was REALLY good. Pasta was cooked perfectly and the portion was huge which I liked. Ended up taking half of it home actually. I would've liked someone to have come around with cheese and pepper but that never happened. Couple other notes: cash only and the ambience is lovely. Very rustic.", "author": "Ali C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-01", "description": "As soon as we entered the restaurant the was no host and nobody as attending the entrance of customers, so we sat on a table and the waiter told us \"you need to get up\" and he made us get up off the table. No apologies no nothing. To me this is an insult, terrible customer service with a very mediocre looking menu. Not recommended at all.", "author": "Manuel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-24", "description": "My boyfriend and I came here on Friday night and it was SO crowded. We put our name in for a table and headed to the bar where Tom poured us a great glass of rose to start our night off with.\n\nWe got two seats and ordered the risotto balls and fried anchovies to start out with. The anchovies came with lemon which tasted perfect on top of the crispy fish; they were absolutely delicious. The risotto balls were good but a little bit heavy.\n\nFor dinner we decided to split the steak and a pasta. Tom recommended the Garganelli so we decided on that.\n\nThe pasta came out first and it was incredible. I loved the smoked mozzarella with the taste of the pesto. However, the true showstopper was the steak. It came with a bulb of roasted garlic that was incredible smeared on each piece, and they were all sprinkled with coarse salt. The flavor was amazing and it was cooked to perfection.\n\nOf course I had to have dessert, so I caved and got the ricotta cheesecake. It was good, but I don't think I would order it again. It didn't have the typical creamy texture of a cheesecake, it was more kind of dry. Regardless, we had an amazing meal and Tom took great care of us.\n\nNoodle pudding is a neighborhood gem and I'm thankful to have such a great restaurant so close!", "author": "Hailey F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-18", "description": "CASH ONLY! \n\nThis hole in the wall is wonderful!  Barely visible sign out front.  Amazing food with giant portions!  The kitchen sink salad is delightful but seriously huge - the three of us could have split it just that salad and still been full. \n\nAll of our entrees were delicious and generous portions. \n\nFriendly staff and cozy little tables.  Go here if you are in Brooklyn!", "author": "Cara G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "If you are looking for an old neighborhood Italian eatery with a real cozy vibe in downtown Brooklyn this is the place for you. This is cash only like many old local places in New York, so leave the credit cards behind.They don't take reservations so expect a wait, it is a small restaurant with a few seats at the bar. The drinks are great and wine list good, pasta was fabulous, portions are more than adequate they have a tiny kitchen and put out a lot of food. This is a fun place for a group or celebration. Make sure to walk across the Brooklyn bridge after you eat those fabulous desserts.  A regular place always while in New York.", "author": "Maggie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-02", "description": "Excellent! Food perfect! Will definitely be back. Had the cacio e pepe. Cooked perfectly! Amazing!", "author": "Jim B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-08", "description": "I loved the food, but getting a table is such a hassle, I'm not sure if it's worth it coming back just because of that. We came on a Wednesday close to 9pm. You would think it would be easy to get a table, but far from it. We had 6 in our group, and they refused to seat us anywhere else except the round table in the back. The previous group who occupied it ordered more food after paying their bill. I noticed there were also a lot of couples taking up entire 6 people tables.\n\nThe food did make up for the annoying wait.\n\nAppetizers:\nFried Whiting Fish - Must order. The fish was so flaky and came in two long skinny fishes. This was shareable among our group of 6, so don't listen if they encourage you to order more.\n\nCalamari - Always a good thing to order to share.\n\nBruschetta - Portion size is small, only 4 small pieces. Came with olives\n\nGarlic Bread - We also got complimentary bread, but still had to order the garlic bread. They put a lot of butter, cheese, and herbs on the bread to make it worth the $6.\n\nPasta:\nRicotta Gnocchi with Butter and Sage - Soft and pillowly. One of their popular dishes, so order this.\n.\nLinguine al Pesto - They were out of linguine so subbed with fusilli, which I like better anyways. The pesto sauce coated the ridges well. Favorite pasta of the night.\n\nRigatoni with Sausage and Meatball - This was my 2nd favorite pasta. Large chunks of mozzarella, delicious pasta, okay meatball, barely any sausage. \n\nPasta with Broccoli Rabe - There were a lot of ingredients in this, but this wasn't my favorite pasta.\n\nHow they handle seating and service could use some improvement, but the delicious food makes it 4 stars for me. As it says in most of the reviews, cash only.", "author": "Jocelyn K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-19", "description": "Noodle pudding sounds like a gross dish and I should have taken that into account when choosing this restaurant. My husband and I ordered fried calamari, fettuccine with shellfish ragu, and lasagne. The calamari was overcooked, lasagne was dry and had literally no sauce, and the seafood literally tasted like a dirty river. Shrimp was overcooked. Just horrible food. \n\nThe service was even worse. The server we had barely spoke to us, didn't even tell us his name. We had to wait 15 minutes for menus after a 35 minute wait to get in.  Never checked on us even once and when we asked for the check 5 minutes after getting our food he didn't even ask why. Our plates were full. Another person asked if we wanted a box and we said no.  They were probably in a bad mood because the air conditioning is NOT sufficient and it was very warm. \n\nIt may look like you found some sort of hidden gem considering there is no sign or name on the building to let you know where you are but if you find the place, save yourself the wait and move on.", "author": "Raven E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-16", "description": "Very different from 10 years ago. The gnocchi here used to be so good, we looked forward to trying it again. Unfortunately, it didn't taste nor look the way it did before. Very bland, forgettable. Poor service while sitting at the bar, when it wasn't even busy. Couldn't wait to get out of there. Won't be returning.", "author": "H Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-27", "description": "The place is well located . I was with my in law a elder guy , the host and the waiter no nice at all , we wanted to sit in the bar there were empty seats but she said she has to ask if we can sit . Then more people came and she allow them to sit freely . The waiter refuse to ask in the kitchen to split a lasagna in two . No Cortez's at all . \n\nThat bar tender a nice guy . I will think to come back", "author": "Ann B."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}