{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "This place is amazing!\n\nIt's definitely popular so we got a glass of wine at the bar while we waited for a table for about 10 minutes.\n\nOnce we were seated the server recommended a house made mozzarella appetizer that we got and loved. The mozzarella was absolutely sublime! Then we got the pork chop and gnocchi for our meals. We followed this up with the delicious ricotta cheesecake and some cappuccinos to end the meal. Everything from service, ambiance, to food was simply wonderful!", "author": "Jennifer P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-05", "description": "What the hell is noodle pudding? I still don't know.  Looks like spaghetti pie. \n\nBesides a seemingly irrelevant name this place is pretty damn good. I don't really know how to categorize this place, you should just know that the food is good. It appears to be modern Italian. They have a daily risotto, which always tickles my fancy. Listen to the specials, order accordingly and be warned. CASH ONLY.\n\nJust an FYI. Parking in the area sucks", "author": "Mitch K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-23", "description": "5 Star joint all the way. Small place but big on quality. Seafood oriented but can deliver a top shelf steak also. Bring your girl or a client as both will be impressed. They run out of fish specials which is a testament to the freshness. One of the best joints in the hood and I recommend greatly..enjoy!", "author": "Joe M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-27", "description": "Nice little establishment and environment is nice. Dimly lit and hidden away, but the food is reaaaal lit.", "author": "Andrew N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-19", "description": "Worst service on the face of the planet. Even on a busy Saturday, after having been asked to wait outside as a table opened, we were treated as if if we were a bother an didn't belong at this restaurant. We were completely ignored by our waiter pretty much from the jump. We had to ask to have our water refilled after being passed by legitimately 10 times (we counted) only to have a snarky bus boy say \"I was trying to ignore you, be right back\" . Ok sure, we give the benefit of the doubt because we are patient customers, it's a busy Saturday, and  and we too have worked years in the service industry. Well that man never came back. We were kept waiting again by our waiter when we were finally able to grab his attention. He was not friendly. He did not ask how anything was. Our table was cleared and no dessert menu was ever offered. We asked for the check and as soon as it came I put the money down so he had to take it right back since we were tired of waiting. He then came back with the change and tossed it down on the table. I paid $100. Cash. And I still left a good tip bc that is how they make money. But they should know how awful they have treated us, and should honestly be ashamed. I don't care how busy you are, this is NYC, it's always busy so you should be used to it. And you should treat all customers with equal respect. OH and don't mean mug them from across the bar to make sure they're leaving you a tip. I saw you. If you have time to glare at me, you have time to ask me how my fucking meal was. \nFood was mediocre at best by the way.", "author": "Becky K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-05", "description": "Noodle pudding was awesome.  Great atmosphere - especially during the summer when they have the windows up.  Warning - they don't take cards at all, so we had to leave and walk a few blocks to get money at the closest ATM.  That being said the food was absolutely delicious- especially the bread and olive oil - some of the best I've had!", "author": "Kia T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-23", "description": "I came here on a Friday night and there were still tables available, which was great! I found the place to be a tad loud even though it wasn't full.\n\nTo start, I got a baby arugula with beets and feta salad. It was a very refreshing salad, but it also isn't a very original idea. Enjoyed it nonetheless. As the main, I got the Fettuccine with mussels, clams and shrimp in a shellfish ragu. The dish was alright. I found the slices of garlic in the pasta sauce overwhelming every time it was in my biteful of pasta, I wished they were smaller pieces. The homemade fettucine was enjoyable, but not as good as other homemade pasta I've had. And the sauce was slightly fishy, but tolerable. \n\nIt was a good experience, but I've had better Italian food.", "author": "Pam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-05", "description": "I came here with Leslie the other night, one of her spots in Brooklyn. I wasn't much in the mood for spending a ton of cash on food so I opted for calamari and mussels. Both were very fresh and delicious. The calamari had no chewiness which is the best. The mussels were in a spicy tomatoe sauce that I just scopped up in every mussel and slurped it down.\n\nLeslie had some pasta dish that was also very fresh tasting and reminded me to just get pasta, instead of my previous choices.\n\nThe one thing that I was annoying with was they said 2o minutes for a table which wound up being like 45.", "author": "Christopher C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "AHHHHHH Mazing!  from the food to the price to the service.  This place has an amazing old school charm.  The food was to die for - which was completely unexpected because what kind  of Italian restaurant is called \"noodle pudding\"", "author": "Tonianne C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "Great review just found this place this weekend and wish I knew about it sooner.  I came two days in a row and everything was fantastic.  Enough items to try something different every time.  I will definitely be returning soon.", "author": "Nathaniel H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "Awesome italian place in brooklyn heights! Went here a few weeks ago with family and everything we had was amazing! I had the pasta with eggplant and it melted in my mouth. It was some of the best pasta I have ever had. My boyfriend got the pork chop and his father got the fish special and they both loved it as well. Perfectly cooked with some greatly seasoned vegetables. Their bread was awesome and their Italian wines are great. Highly recommend!", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-19", "description": "The Straccetti was a surprise. From the menu it sounded like a cow sacrificed his life to land on my plate:\n      \"Thinly-massaged beef grilled on one side, with arugola, mushrooms, shaved parmigiano \u0026 truffle oil\"    -   Whoa!! \"I'll order one, but I secretly want two!\"\n\nI should have been acutely aware to ask, what the heck happens to the other side of my cow Susie?.... nothing...\n\nI like surprises just like anyone else.., like when that pigeon flew by earlier in the day and decided to defecate mid-air, and I decided, that would be a great time to yawn? I kinda french-kissed a pigeon and a cow on that day.\n\nShould you find yourself in this exact predicament..., I have some advice to offer...,\n\n(a) take that Sraccetti, swap half of it with your friend (yes she was a girl) and take half of her cooked meal ;\n(b) with the rest of it, roll it up so it looks like a braciole. It's not as bad when you refocus your tongue on the cooked parts.\n(c) Have them cook it through, and advise customers next time.", "author": "Tony C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "Wow!! Excellent food, service and price!!!\nLasagna, gnocchi (w/ safe and butter), bruschetta, watermelon granitta, bread and dipping oil were all so VERY yummy. If I lived anywhere in NY, this would be a repeat dinner spot for me. \nIt was the best meal I have had in so very many years.", "author": "Ana E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "It's still the best.  We hadn't eaten here in a few years after moving from the Heights and decided to go back.  Two of the guys there recognized us and asked where we'd been.  I loved that.  We wondered maybe if we'd overrated the place in our minds since it was the local place right in our old hood but the food is as outstanding as we remembered.  Incredibly flavorful, rustic, interesting, diverse.  It really is still exceptional.", "author": "David W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-03", "description": "Yesterday was my first time at Noodle Pudding and assure I will be back to try more dishes. Nice ambiance and delightful service while giving you the feel of a homey classic italian dinner. We had a table to the far back left corner which gave us a level of privacy and roomy space. Started off with a few fulling appetizers: fried calamari, mussels in spicy tomato sauce and razor clams oreganata. Which left us with just enough space for our entrees. At our table we ordered: Lasagna, Gnocchi pasta, Pasta E Fagioli and Fettuccine with mussels, clams and shrimp in a shellfish ragu. Collectively were were all highly satisfied and pleased with our plates. The flavors were pleasingly authentic setting a wonderful impression for me. We didn't get a chance to have dessert considering how full we were. I hope for next time to try the tiramisu I thought I would have space for. Until next time.", "author": "Oomi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "Great authentic Italian cuisine. Pastas are homemade and so tasty. The decor and layout of the restaurant took me right back to my short time in Italy. Extremely welcoming staff - a great place to take guests to in order to show them how good NY Italian food truly is!", "author": "Katelyn P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "I love this place! I always order the burrata whether its on the special list or not and they always deliver. Great place to take out of town guests for classic New York Italian. Be prepared for a little wait on weekends and bring your cash (no cc) but great go to spot for Brooklyn Heights.", "author": "Meryl H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "Thoroughly enjoyed the meal and atmosphere.  Friendly staff, excellent service, highly recommend this place.", "author": "Rumproof S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "5 stars for fantastic food, great service, and endless charm. \n\nWe had the best gnocchi, best lasagne, and best tiramisu EVER tonight. And the old school red and white checkered tablecloths had me swooning. They even had a lovely sparkling chilled red wine, which is hard to find on a menu.\n\nMake sure to treat yourself to the Moscato with your dessert. :)", "author": "Sarah Jane S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "We have been going here for over 17 years almost twice a week\nThe food is seasonable. Think heirloom tomatoes and amazing Southern Itslian regional dishes in the summer. Thick lentil soup or a raging  in the fall and winter. Fresh fish all year round pasta dishes to die for. If you are with a party of 6 or more try the \"Trust Me\" menu if it's available. No reservations for less than 6 people. No credit cards.  The owner is from the island of Ishia\nExpect a wait if you go on Friday or Saturday. This place is just fantastic", "author": "Terry W."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}