{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-15", "description": "To be fair, I can understand where the negative customer-service reviews are coming from. The scene upon entering can be daunting for a first-time diner, as there's almost always a line and no host(ess) to speak of. There is, instead, a list held by one of the waiters and if you get on it, you'll find that the wait time is generally no longer than half an hour. If you're not dying of hunger, waiting it out at a local bar is well worth it.\n\nWhen seated, you'll find the waitstaff straight-forward, friendly and helpful, albeit, VERY busy. I've never been to this restaurant and NOT seen it full (even immediately following Hurricane Sandy), and it's important to note that there's a reason for that. This place is very much a local favorite, and there are frequent regulars that get their due attention. After our third visit, one of the waiters who most commonly holds the coveted list recognized my boyfriend as well, and it's nice to know that that many visits warrants a lasting (positive!) impression as well.\n\nAs for the post important part, the food: excellent all around. I firmly believe the negative reviews about the food show an overall lack of knowledge about authentic Italian cuisine on the part of the reviewers. If you came looking for a fried chicken cutlet covered in cheese, you definitely chose the wrong place. I've had the risotto, the pasta, and the steak (in addition to a number of appetizers, including the sardines) and I've been very happy with everything I've tried. The wine selection is consistent and the house wines are completely acceptable (though, as with most places, the better vintage is sold only by the bottle). \n\nTo date, my favorite dish is any of the seafood specials, as they handle shellfish preparation excellently here (no drowned oysters and the like). All dishes are prepared to bring out the best of the main ingredients and not overpower them; you can taste your steak, appreciate the homemade texture of your pasta, and little touches like adding chili peppers to the olive oil make the experience unique and memorable. Dessert is similarly delicious. I for one will be very sad to see the pumpkin panna cotta (which I suspect to be a seasonal offering) go.\n\nIn short, be patient, bring cash, and you will not be disappointed.", "author": "Danielle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-28", "description": "This is one of our favorite Italian places. It's so warm and welcoming and the food is so delicious -- big portions too. Absolutely amazing pasta. The atmosphere is really fun and great. \n\nThe place gets very crowded, so be ready to wait. They also take only cash. The staff is incredibly efficient and it's great to go back over and over and see a lot of the same faces -- they definitely remember you.", "author": "A B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-29", "description": "This has to be one of my favorite pasta places in NYC...Well I mean, I am just a college student that doesn't splurge on $$$$ restaurants but for the price and service and atmosphere and food, Noodle Pudding is on the top of my list, Also its in a great location to go for a stroll around Dumbo or Brooklyn Bridge Park.", "author": "Vincent R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-07", "description": "Although the last time we were here we walked out, we decided to give NP another chance.  Oh my, am I glad we did.  The tomato and fresh mozzarella appetizer was farm fresh. How come the tomatoes I buy don't taste like this?  The cheese was exceptional: creamy,  voluptuous and not too salty.  I remember having the Gnocchi years ago and loving it.  Well nothing has changed:  still little pillows of slightly chewy yumminess.  Wines by the bottle start at $15 and there are plenty of choices in the $30s to choose from.  The maitre d' might seem a bit aloof,  but the waitstaff makes up for this by being a lot nicer.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-29", "description": "Very nice menu.  All items ordered  exceeding expectations.  Not cutting edge but a good choice to please everyone.  Decor and ambiance can use some updating.  Service was good.  I", "author": "J.P. M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-28", "description": "Came here on a Sunday waited almost an hour to be seated, the food was nothing to brag about, I was very disapointed we ordered quite a few dishes and not one was good, the gnocchi was very bland and flavorless  along with everything else we ordered. I'm giving it the second star because the bread and olive oil was very good  but not enough to be returning  save your money", "author": "Bridget P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-21", "description": "I came here my first weekend in New York for girls night out my first weekend in New York after work.  We ordered the Ricotta Spinach \u0026 Mozzarella Raviolis Pomodoro and  Gnocchi with al pomodoro to share.  The pastas were average at best.  While the gnocchi was obviously handmade and quite chewy, the sauce tasted very ordinary.  Not at all comparable to the huge plate of pomodoro I got at Carmine's in theater district the week before.  The ravioli tasted like...well ravioli.  Nothing memorable.  No lingering taste of goodness on my tongue.  And the portions were extremely small.   \n\nHOWEVER, the bread and olive oil was amazing and the highlight of the meal.  The server was very kind, and allowed us to get refills on both items as we worked our way through them, unable to stop.  It was just the perfect combination: soft bread with a slight crunch on the outside, and fresh olive oil slightly seasoned with tomatoes, and herbs.  I would go back just for that.  That experience was heavenly.  I crave it to this day.", "author": "Buggy Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-27", "description": "Prompt service, remarkable food, great desserts. The restaurant itself gets a lot of street noise when the bay doors are open in nice weather. But that goes for most restaurants in NYC. \nI had the sliced chicken breast with summer salad. It was tender and well seasoned. The salad was very unique and a good balance to the chicken. For dessert, I had some hazelnut chocolate thing. It was a nice not-too-sweet end to a great meal. I also had the calamari and octopus for appetizers, which were flavorful and...well...appetizing. \nI'd give it five stars if they could figure out a way to make the space more comfortable and less noisy.", "author": "Tony S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "This place is fantastic. Service is exceptional, very professional, patient and attentive. The food is simply delicious. The only reason why I gave this a 4 and not a 5 is because of the bread and a little too much salt and spicy in the food. For such a great place, the bread offering needs to be improved. It didnt taste fresh and was a bit too dry. I had an order or calimari, which was outstanding, possibly the best calimari I ever had. The only problem is that too much salt was added to the coating and something was spicy. Less salt and no hot pepper will make it perfect. I also ordered the black sea bass, which again, was delicious, but there was something really spicy on there that the dish just did not need. On a light and delicious fish like that, anything spicy should be on the side so the person can adjust the intake. I dont like spicy fish. These are all minor things, that a conversation with the waiter ahead of time can sort out. Otherwise, this restaurant is quaint and inviting. I highly recommend anyone who loves good homestyle italian food to visit. I will definitely go again and again.", "author": "Dana G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-09", "description": "Awesome! Came here for my anniversary dinner with my husband and it was perfect! We started with a fava bean and dandelion green side that was heavenly.  I had a pasta special that had smoked mozzarella perfection on it!! My husband enjoyed the liver entree, it was grilled so much more enjoyable than your typical liver!  The best part of the meal was dessert, a flour less chocolate cake with hazelnut ice cream!! It was perfection!!! We will certainly be coming back!", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-09", "description": "Decent service, decent drinks and decent food.  Don't love or hate it, just pleasant.", "author": "Cyrus P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-12", "description": "Still as good as it was a few years ago.  They made me a special pasta sauce just by me telling them what I was in the mood for (basically and aribbita or however the hell you spell it with ricotta.  \n\nOh.God.So.Yum.\n\nI love this place so much, it's like reason enough to visit NYC.  The food never disappoints and the service is always very genuine and fun.\n\nLOVE IT!", "author": "Ms T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-14", "description": "This probably was the best Italian food I've ever had in NY. I'm not even a big fan of Italian food.\n\nWe ordered the lasagna and the risotto of the day and they were both spectacular! The lasagna was so flavorful and it did not taste too heavy. The balance of cheese, meat, and pasta was perfect. It was heavenly. The risotto of the day was a seafood risotto with mussels, clams, and shrimp. I normally would never order risotto and the only reason I ordered it this time was because it had mussels, but I am so glad I did. The white cream sauce complimented the seafood and the risotto. There wasn't too much of it and it wasn't too heavy. It was divine!! \n\nOk, now that I've discussed the food, I will touch on everything else. \n\nFinding this place can be a little tricky because the name isn't really visible. You kind of just guesstimate where it is. It's really convenient - I might away from the A,C High Street stop. It's also in a prime location in Brooklyn Heights near the Brooklyn Bridge. I love this area!\n\nI've heard this place can get pretty crowded but when my friend and I came here on a Friday night around 6p, there was plenty of seating and no wait. It did seem to pack up around 8p.\n\nThe service was decent. Our waitress was helpful and nice, but I felt a little rushed....even though there were empty tables everywhere. She was attentive though, so I can't really complain.\n\nWe started with a salad - my friend had a caesar and I had regular greens, both had very light dressing. \n\nThe food overall was very affordable. My seafood risotto of the day was only $20, but that will vary depending on the dish. \n\nI highly recommend this place. I am definitely coming back here!!.", "author": "Elaine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-19", "description": "I love the bread they serve.. The waiter is really nice to us.. the pasta is good but I give a 4 probably I expect a little more from them..", "author": "Shing Yiing O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-21", "description": "Solid Italian joint. Nothing fancy or original here, but the ingredients used are definitely a notch above average and the preparation makes you feel like your Italian grandmother just cooked for you. Well, at least it does if don't actually have an Italian grandmother...\n\nThere are plenty of better (and more expensive) Italians in the City, but if you live in the hood (I do) it's a reliable little restaurant for those nights you don't feel like cooking.\n\nI'd skip the dessert there... and go buy something at Almondine ;)", "author": "Yann B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-15", "description": "2 things you need to know about Noodle Pudding. 1) The food is good. 2) There is definitely something strange when it comes to the hospitality. \n\nI totally understand the negative comments from other posters after eating there for the first time.  When you first walk in, you just stand there.  Nobody acknowledges your presence and its like you have to know something to be noticed. Two well dressed, groomed and polite patrons seem like a layup customer to me, especially right at the opening before you are really busy. I can't find any downside to making people feel welcome, but hey I don't own a restaurant, so what do I know.   \n\nIt could also be that all their good food makes up for this shortcoming in the eyes of their patrons. This place is seemingly proof positive that a fair segment of the population is willing to overlook certain idiosyncrasies in favor of a tasty meal (the food WAS good).  Me personally I am somewhere in the middle. I'm not completely put off by my experience, but I doubt I'll be in a rush to go back.  Instead I'll keep trying new spots, and rewarding those that have BOTH good food and service with my patronage dollars. For me Noodle Pudding will have trouble becoming a favorite destination since I'm past the point in life (high school) where I feel the need to impress someone I don't know simply to feel like I belong. \n\nA note on the service: It was VERY hit or miss. Our first waiter asked if we were ready 3 times within 10 minutes of our arrival. Both of our menu's were still open... and we were clearly discussing our options every time he came over. What's the rush, really, I must know... it's not like your shift is about to end (you just opened) and you don't have other tables to wait on so please enlighten me.  Our 2nd waiter (who seemed to take over for the first on his own) was MUCH better. Friendlier, more helpful and patient.  I left him an out-sized tip, hope his coworker figures his job out.  I can forgive the establishment for their somewhat cold reception, but not someone who's job is service... wake up dude whoever you are.", "author": "Kevin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-05", "description": "The service is impeccable! The food here is fresh, clean and home cooked tasting! Simplicity is inherent in every dish here. The portions are appropriate and sharing is encouraged. The ever changing specials are exquisite and for dessert I always fancy a Pannacota!  Give this place a shot its worth the wait for a table!!!!!!!!! Trust me, have I ever mislead you?\n;)", "author": "Jagoda A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-09", "description": "Weird name, amazing Italian cuisine. Grimbaldi's was too crowded, so we went here. Affordable and decadent, with a FANTASTIC wine selection. Go early because the space is small and gets crowded quickly.They really should consider changing their name, however.", "author": "Jordan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-23", "description": "Food was excellent.  Price was reasonable.  They accept cash only.  The accept reservations for parties of 5 or more.  The only reason I did not give five stars was because the service was mediocre.", "author": "Robert G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-20", "description": "From reading past reviews, it's clear this restaurant has off nights. However, we wondered in randomly, loved every moment of our meal, and didn't even know the name of the restaurant until we paid the bill.\n\nAccording to the waiter it was a slow night, there was no wait, 90% of tables were taken, but as a party of four, we were seated right away.\n\nThe bread and olive oil were mind-blowing. I ordered the Chianti per the waiters rec (I had asked for an inky wine) and it was exactly what I was looking for. \n\nThe caesar salad is huge and definitely should be shared between at least two people. We also had the broccoli with oil and garlic (daily special), this too was amazing.\n\nFor entrees, we had pork chops, lasagna, and linguini with rock shrimp (one of the daily specials) ... and everyone LOVED their meals.\n\nWe had the flourless chocolate cake with hazelnut gelato, also ridiculously good.\n\nThis was one of the best dinning experiences I've ever encountered. Even though our coffee came out long after we finished the dessert.\n\nNote, this place is cash only.", "author": "Frances G."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}