{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-11", "description": "My kind of place.  No frills, just good simply cooked Italian food at decent value.  The osso bucco always rocks my world, but its the marrow within that makes the comparatively hefty $28 price tag a non-issue.  It's not unusual to find diners at adjacent tables staring at me in either mild disgust or mocking amusement when I desperately suck, lick, and claw at the bone trying to get every single last tantalizing bit of marrow out.  I've been told I look like a malnourished stray dog eating for the first time in a week.  There's other great stuff there (love the parpadelle w/ mushrooms, half seared buffalo with mixed greens, and pretty much everything they make), but the osso bucco will always have my heart.. tee hee. *wink*\n\nP.S. - I've officially decided to embark on a quest for NYC's best bone marrow.  I am open to... nay... eagerly seeking suggestions from marrow lovers out there. (So far, Prune is at the top of my list to try)", "author": "andrew c."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-24", "description": "I've gone back a few times and every time I have the same thought.\n\n\"the food is really not that special.\"  \n\nSure, cheep wine is nice.  And the bread/oil is nice too.  But when it comes to the entrees, they simply lack anything special.  The bolognese is not delicious... it's boring.  The puttanesca tries to make up for boring with too much anchovy.  \n\nAll in all, I realized I could make the same meal with some fresh pasta and ANY sauce.  OK, maybe not Ragu... but almost any sauce.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-17", "description": "Italian food is easy to make at home, so a good Italian restaurant needs really 3 things.   1) amazingly fresh ingredients worth paying for, 2) reasonable prices to justify not mixing Prago sauce with vegetables at home instead, 3) friendly atmosphere that makes you interested in coming back.\n\nDone.  Noodle Pudding crushes it.    Added bonus, they have a delicious house wine for the price.  A white and a red $14/bottle.\n\nOnly complaint...  worst name ever.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-25", "description": "Great atmosphere, friendly service and authentic country fare. Yummy!!!", "author": "Korye L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-13", "description": "Like everyone else, we almost walked past this restaurant, as there is no sign at all, but I'm so glad we found it and went in! We got there around 5:15, not realizing they didn't open until 5:30, but they were nice enough to let us sit and chill at a table until they opened. The complimentary bread was so, so delicious, as were the peppers...the name of which I can't remember, but they were like spicy grilled peppers. Good stuff. My friend said their gluten-free pasta was solid, but my tagliatelle bolognese was so good, it was like the pasta melted in my mouth! The best part of the meal, by far, though, was the dessert. They had a basil pannacotta with strawberries on the menu. When I let our waiter know I'm allergic to strawberries and asked if I could just have the pannacotta, he said, \"I'll see what I can do\" and brought out the best dessert I've ever had. INCREDIBLE basil panacotta with honey and red and golden raspberries. Oh. My. God. So unreal. The last few days we've just kept talking about the panacotta. If you go, you MUST get it!", "author": "Jana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-21", "description": "Excellent service and food. A homey, comfortable place where everyone feels welcome: families, hipsters, anyone. Food is fresh and delicious: fried fresh anchovies, arugula with a bit of Bibb, prosciutto with fig and melon, grilled Boston mackerel, razor clams oreganata, taglialini with crab. We love the apps more than the mains but you can't go wrong. The waitstaff are true professionals- efficient, friendly, knows their stuff. Prices are great for the quality.", "author": "S_Z_ C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-20", "description": "One of my absolute favorite \"neighborhood\" restaurants ever. Always delicious food, stellar service and a cozy, fun atmosphere that can't be beat. Try the specials, they are sometimes unexpected, and more than often delicious.", "author": "Shira R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "Nice place. Food very good. Linguine with fish excellent, though portion of pasta could have been larger. Waiter and host friendly. Only thing is if you like paying with credit card they don't accept credit card.", "author": "C.J. N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-25", "description": "Everything is delicious, just make sure you carry cash...\n\nBeen here twice now. Excellent both times. Don't bother coming if you didn't make a reservation, it can be super crowded and wait interminable. The portions are just right, as is the price. But why don't they take credit cards, I will never know.", "author": "Jack N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-30", "description": "You would never know about this place cause there's no sign outside, it's in the middle of a residential area! The food is great here, We ordered the fried calamari, artichokes and caesar salad which were all good! The main coarse we had the meat lasagna and stuffed pork chop both were great! This is definitely top 5 Italian in Brooklyn and the service is great as well it just gets really crowded so be prepared to wait at the bar!", "author": "Jimmy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-13", "description": "Great food. I always get their octopus appetizer because it's so good and I've never had better! Great value too...everything is well-priced. I've been here a handful of times and they never disappoint. Service is usually excellent though it can get spotty when they're busy. Take your date here. Take your family here.  Come here by yourself. I see that too.", "author": "Haj da P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-29", "description": "this is an update. noodle pudding has redeemed itself in my eyes!\n\ni was able to walk in with 4 other members of my family and get a table for 5 without a wait, received excellent and very prompt service from all of the staff (who were ridiculously kind that night) and even saw the owner himself.\n\nwhat we had:\ncaprese salad - nice and fresh\nbeef short ribs - pretty good\nseafood soup - amazing - this is a must try!\nporchetta - very good\nlasagna - very good\ngnocci - very good\noctopus - ridiculously fresh and delicious\ntiramisu - good\nbread pudding - ok\n\nall in all, this was a wonderful experience. we could have also ordered one less main dish because we had left overs. the portions were very generous.\n\nyay! i'm glad this place is looking up again since the food is always so great but the service and ridiculous wait had been the nightmare factor.", "author": "M L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-01", "description": "My first 5 star! \n\nPlease please please do not let the name fool you, this is some authentic italian food and some of the best I've had in nyc...wayyy better than Trattoria. \n\nThis was my pick for our date the day before Valentine's day, so it was unusually packed. I had never been either, and the sign is not obvious, making it a little hard to find, but once you do, you have found nirvana...\n\nMy bf at the time was Italian and raised on real Tuscan and roman food so I was wary...when we walked in, he turned me with this surprised smile and said, \"It smells just like my grandmother's cooking\"...it doesnt get any better than that!\n\nThe wine bar was interesting, they know their stock well, and after a  mini tasting, we picked a red wine that was well developed in flavor and about $15 a glass...( i try to avoid bottles since he WILL drink the entire thing).Dinner was equally as great, i cant remember a more easygoing dinner. IT had a homey ambience that transported one to Italy almost, and service was impecccable, especially for a place packed to capacity (i.e. 1 hr wait)\n\nBon appetit!", "author": "Bibiana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-30", "description": "This place is a classic, NYC family Italian restaurant.  The food is very good, the prices are great and the waitstaff is friendly.\n\nHowever, this is NOT an exceedingly hipster-friendly joint.  No whiners, no complainers and if you need your ass kissed there are MANY OTHER restaurants you can go to be treated like a little prince/ss.\n\nAnd a word about the waitstaff.  They are very, very good.  But if you are one of the aforementioned whiners, you will be treated accordingly.  Keep your attitude at home, and enjoy a Brooklyn treasure.", "author": "Adam C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-26", "description": "All I have to say have to say is Wowwww .... Prime Rib!! Enough Said! Let the picture speak for itself", "author": "Don P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-15", "description": "Fantastic!\n\nWe absolutely loved this place and cannot wait to go back.\n\nI had the 1/2 Roasted Chicken and my husband had the Pork chops.  We tried one of the pastas as well but I cannot remember which one. The pasta is homemade I believe and was cooked perfectly. The sauce was bursting with flavor. Everything was absolutely excellent!\n\nThe service was also great. \n\n...but remember to bring cash.", "author": "Cassidy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-07", "description": "Heard a lot about this place. It was decent but I don't think I would go out of my way to eat here. Certainly nothing was bad but it seemed kind of antiquated. Very friendly family environment.", "author": "Rich C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-14", "description": "It's going to take a while to get a seat, but it's probably worth it. I've only been disappointing with one dish since going there. The disappointment was mine, as I went out of my normal comfort zone to (apparently) re-affirm that I don't like muscles. Good news, my other diners did and were happy to trade me! \n\nBring plenty of cash, and save room for dessert!", "author": "Erik C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-15", "description": "Really, really great food, sort of cramped interior but it adds to the atmosphere.", "author": "Batie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-05", "description": "Cash only.  The food was good if a little pricey.  I would definitely go back to try the fish.  The service is good too.  The tables are close together though and my meal was considerably less pleasant given my nosy and staring neighbors and the reason why I haven't returned, despite the good food.", "author": "April Y."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}