{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-06", "description": "NO SIGN ON THE OUTSIDE! We walked right by it. This came recommended by a coworker. We checked out Bo Concept Art First Thursdays in DUMBO so we figured we'd swing by for dinner. It's right near Henry's End, a restaurant that serves an assortment of Wild Game meats daily. Waiters are dressed in white button downs with red ties tucked into their shirts, adorned in red aprons. No wait on a Thursday Night at 7pm. Cash only. This is Italian fare done right with affordable prices. Kudos. I'll be back. \n\nBread - half a ciabatta loaf sliced, spicy EVOO dip w/ crushed tomatoes, parsley, CRACK!\n\nDAILY SPECIALS\n-Shrimp, Mussels, Clams in broth (~$15) - soup tasted like Chinese broth, not oily at all, seafood was yum, good starter\n-Stuffed Seppialini (~$12) - came in the form of one big piece, ample tomato sauce, stuffed w/ breading, one piece of grilled french bread, seppia is cuttlefish\n-Pappardelle (~$12) - heavily infused w/ mushroom sauce, i'm a huge sucker for this pasta, esp when homemade, so good\n\nENTREE\n-Pork Chop ($13) [served with pickled hot cherry peppers] - a tad over done aka dry, nice char on outside, not crazy about hot cherry peppers w/ it, also served w/ a parmesan mash\n\nWINE\n-Fume Blanc ($10 x 2) - perfect accompaniment to this meal\n\nTotal came out to $46/pp after everything", "author": "Jeff C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-16", "description": "Fantastic Italian food that still has a very local neighborhood restaurant type of feel, although the usual long wait for a table suggests its fame has spread well beyond Brooklyn Heights. A usually quite diverse daily menu, along with some really good Italian standbys.\n\nWhen the zombie apocalypse comes, I hope it stays open, because then we can barricade the neighborhood and keep it all to ourselves. Cash only.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-01", "description": "we had a great time. went here with a large group, 8 of us, and the place did not disappoint. good service and great food. it has been a month since we went there, so i forget some of the details. but i recall that the ragu was our favorite pasta, but unfortunately the gnocchi was not so good - the texture and flavor was not what i expected. the chicken meal was well received, could easily serve 2. house wine is not so bad and a good option.", "author": "J P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-05", "description": "My favorite Italian restaurant.  Yes, the name is weird and the place is hard to find because there's no sign outside.  But figure it out and go!  \n\nOddly, the best thing served here isn't on the menu; it's the rosemary infused olive oil paired with their freshly baked bread.  My fiance and I always have to pig out on this and ask for seconds.  During the holidays, they bottle it up and sell it.  Great gift for foodies...\n\nPrices are very good, especially for Brooklyn Heights.  Expect to wait for a table if you stroll in during peak hours, but the host is always gracious and very friendly.  I believe they only take reservations for big groups.  Their table wine is cheap and good, and I have to say, everything I've tried on their menu is excellent.  Beet gnocchi as well as their bolognese sauce are excellent.  Specials change daily.", "author": "Jo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "This place is legend and Tony is the best there is.  I would eat here every night if I could.", "author": "lala l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-29", "description": "Is it cheap? Not really. Is it a good value? Depends on what you order. Is everything delicious? Hell yes!\n\nBe prepared to wait a long time for a table but the wait is entirely worth it. The pastas are particularly good.", "author": "J M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-18", "description": "Good Italian Food with a nice ambience but not too ritzy. \n\nI love the butter and sage gnocci. Thus far, the best italian I've had in nyc. Everything i've tried here is amazing. Portions are average sized not too big not too small. Cash only though so be prepared.", "author": "Asma S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-06", "description": "4 stars for the food, 3 stars for the service = 3.5 stars.  It's been awhile since I've dined here, but I was certainly glad we decided to take our visiting friends here for a cheap bottle of wine and simple, fresh Italian cuisine.  Calamari, braised octopus, gnocchi, grilled chicken, and risotto special were all very straight forward dishes (what I expect from Noodle Pudding after previous meals here).", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-10", "description": "I'm adding my voice to the chorus. If Noodle Pudding were a paper and I were a teacher, I'd give it an A-. Why?\n\n1. As my dad would say, it had a nice buzz for a Tuesday night.\n2. My dining companion ordered a dirty martini, and they left the shaker with extra in it for her at the table. [She said that the martini was \"great\"].\n3. Homemade pasta, awesome bolognese sauce that wasn't too salty.\n4. Price was right\n\nWhy not an A+?\n\n1. We sat for too long before someone came to take our order\n2. Not very personable service\n3. Poorly placed bathroom [careful when you walk around the corner or you might walk smack into a waiter coming out of the kitchen with his hands full of entrees!", "author": "S B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-05", "description": "I passed this restaurant on the way to a concert and thought \"Wow.. that place looks like a great spot.\" Two hours later after the concert, we had a 10 min wait for a table for 4.\n\nFood - very tasty italian (not sure which region). The kind where u're pretty damn sure they make the noodles in the kitchen. Mostly comfort dishes and a few eyebrow-raising culinary avant-garde dishes (my friend had an amazing golden beet, radish, and trout dish). \n\nPrice - very reasonable for the value. Entrees are $12 - $16 and $20+ for the pricier filet mignon dishes. It was about $30/person.\n\nDecor - casual, romantic, bustling. 3 happy birthday serenades in the hour we were there. Candles, colorful strung lamps, and locals hanging out at the bar.\n\nOverall, I would go there a lot if I didn't live across the water. Yes, it's in Brooklyn. And I'm in Manhattan. And we all know it's just a matter of time with long distance.", "author": "Catherine L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-06", "description": "I wasn't that impressed by the food but I really liked the friendly neighborhood atmosphere. I'll definitely be back. I had the Tagliatelle Bolognese which was okay but a little bland. It could have benefited from a little more meat. My friend had the bass which she liked but I wasn't crazy about. We shared two tomato appetizers - one w. mozzarella and the other with cucumbers and onions. I enjoyed both, especially with the table bread and olive oil. We sat by the window. which is opened to the street in the summer. Total tab, w/ a glass of wine, before tax/tip was $69", "author": "Will S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-08", "description": "Noodle Pudding always hits the spot!\n\nMy favorite things to get:\n   - Tagliatelle Bolo Gnese: Great classic meat sauce. \n   - Lasagna Bolognese: Unbelievable flavors.\n   - Strozza Preti Alla Siciliana eggplant, tomato and ricotta : This type of eggplant flavor is something I have never experienced....DIVINE!\n   - Cesare Salad: LARGE, definitely can split this with someone if you are not eating it as your meal, BEWARE: Anchovies included (I tell them to keep 'em off my salad)\n\n\nAtmosphere: 5 stars. I couldn't ask for anything more. I see some people have been complaining about the noise, screw em. If you are used to a stuck up place which has thick tension the minute you walk in then this place is not for you. They open up the large windows in the front when it's nice outside and it's lit just perfect. Yes, there is noise, but it's people talking which makes the place more relaxed. This really is a local place, which has a lot of personality.\n\n\nTry it out, you won't be let down.", "author": "Robert I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-05", "description": "Great local neighborhood restaurant.  The host is super friendly and welcoming.  We went early to avoid the crowds (a little after 6pm) and were glad we did... got a seat right away and the noise level was low.  At about 7pm, the crowds began to appear, and it started to get pretty noisy in there.\n\nWe were happy with our food.  I ordered the gnocchi with butter \u0026 sage -- yum.  He ordered the lasagna, which didn't have too much cheese in it, so they got the balance of flavors just right.\n\nService was fine.", "author": "Cynthia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-07", "description": "New York is incredible for the sense of community that one finds there. You can walk around the neighborhoods in the evenings and look at the neighbors and families sitting on their stoops and socializing. Everyone seems supportive and everyone seems to treat and watch out for each other like they are family. This is what makes New York City so incredible.  When I walked into Noodle Pudding, I realized that this restaurant epitomized this neighborhood and community culture.  \n\nGranted, my boyfriend grew up in the city and knows many of the families that work in the restaurant, so my experience may be a little biased.  Regardless, I have never experienced as warm of a greeting as I felt when I walked into this charming restaurant. We were welcomed with open arms and were treated to phenomenal Italian food in a warm and cozy environment.  From the tomato mozzarella appetizers to the freshly made pasta, we just devoured every single bite.  I loved this restaurant and I look forward to returning to New York and reserving a special night to eat here again.", "author": "Amanda L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-17", "description": "The greatest thing since the promenade...\nNoodle Pudding, I will sum you up in haiku:\n\n(Dinner, I Love You)\nCheap house wine not bad!\nItalian goodness, simply.\nGives me warm fuzzies \n\n(Ode to dessert)\nSoaked with espresso, \nTiramisu on my chin\nInvading my soul\n\nSo, haiku is 5-7-5, right? Just checking.", "author": "Blondie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-12", "description": "YES! Noodle Pudding is great!\n\nI really enjoy sitting at the bar if there's a wait and then if there's room and having a drink while I watch all of the satisfied diners before me and the bustling waiters all delivering perfect dishes to the crowd!\n\nOnce seated, almost anything you try will please you.  I've had the salmon (cooked perfectly) with garlicky greens and it was a great combination. My boyfriend ordered a special that they had that night which was beef carpaccio.  I was hesitant to try it at first but one succulent bite had me coming back for more. It was served over a bed of greens with sauteed mushrooms and shavings of parmigiano reggiano...ahhh, to think of it now!\n\nGo, with the willingness to wait for great food, and you won't be disappointed.", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-30", "description": "This little Brooklyn Heights gem is the best Italian that I have had in NY. I visited this restaurant on several occasions, and have been pleased every time. \n\nThis restaurant reminds me of a restaurant in Connecticut owned by good friends of mine, because it is simple, fresh italian. Don't mistake simple for red sauce and pasta- these are mostly authentic italian dishes. The dishes are just usually very elemental, created to highlight good quality components, rather than smother poor quality ingredients. \n\nMy favorite dish is a special that is frequently featured- mussels in a light seafood sauce made with lobster. There is something about this sauce that is just sublime and amazing... and I can taste it as I sit here typing at my desk. The mussels that Noodle Pudding uses are large, clean, and plump, and absorb the flavor wonderfully. I also have tried and can recommend the beet ravioli, the venison ragu, and the buffalo mozzarella. That last item, the buffalo Mozzarella, is another favorite of mine, a creamy, silky cheese that perfectly compliments the drizzle of house olive oil that they pour over it. \n\nWhile the service at times has been curt and a little spotty, these were during very busy times, and was never rude or lacking enough to formally complain about. It is also pleasant to not have overly doting service when trying to enjoy good conversation and good food.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-20", "description": "This place is pretty darn good.  I came on a super rainy night, and given that my friend hadn't yet arrived, I was able to snag a seat beforehand (a lot of NYC restaurants don't let you do that).  It would have been nice to have been asked, but I had to request it.  In either case, my waiter was very excellent.  \n\nThe free bread in the beginning is just so delicious with their olive oil concoction.  I want to know how to make it because it's probably the best olive oil dip I have ever tried.  \n\nI also ordered the pasta (with eggplant and tomatoes) and I just loved the big FAT pasta.  So yumz.  My friend ordered the clams which looked delicious, and they give you a generous amount.  \n\nAll in all I believe I would definitely return.", "author": "Jane P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-02", "description": "Don't worry about the strange name. This is a great Italian place with an attractive menu and ambiance. It serves a variety of Italian dishes that border on the fancier side (i.e. not spaghetti and meatballs).\n\nI had the rabbit bolognese and my dinner mate tried the seafood risotto. We both raved about our choices. \n\nIt is only one stop from Wall Street in a nice neighborhood of Brooklyn, so need for the Manhattanites to be afraid.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-22", "description": "Noodle Pudding is an Italian restaurant that emphasizes simple, straight-forward dishes in a warm, unadorned space.  It is consistent both in terms of the quality of the food and the professional, courteous service.  The dining area has a comfortable feeling that is contrasted by the cacophonous buzz of a much revered local restaurant.  The staff are attentive without hovering and are good at their jobs.\n\nSuggested dishes are the butter and sage gnocchi, lasagna, most all of the daily risottos, and the calamari appetizer. They occasionally have a fish special called \"Vinny's line-caught Montauk bass\" that is excellent.  By serving line-caught instead of net-caught fish, the chef is able to limit the excretion of a stress induced hormone that can negatively impact the flavor of the fish.  The fish is delivered fresh that day and is prepared in the careful, un-fussy manner that is a staple of the restaurant.  Always examine the specials carefully as they change often and are frequently quite good.\n\nThe food has always been affordable ($15-25 entree) and in the ten years since I've been going the owner Antonio has only raised the prices once.\n\nTo respond to the superlative and  occasionally negative tone of expectation of some of the other reviews it should be noted that Noodle Pudding is not \"the best\" Italian food in the city. But for the combination of consistent quality, good prices, and an unpretentious environment - I can think of few other places I would rather enjoy a meal.  This is a restaurant you will go back to as a Brooklyn standard and encourage your friends to go to as well.", "author": "Philip R."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}