{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-02", "description": "When I first started going to Noodle Pudding about five years ago there was never a wait.  Now, you really have to get there early to get a table immediately.  Usually when a restaurant becomes popular the food goes down.  This is NOT the case with Noodle Pudding.  I tend to crave their food when I'm not there for a couple of months.  Their pasta with ricotta and mashed eggplant sublime, the lasagna superb, and their daily specials always with the freshest of ingredients.  Okay, now my mouth is watering....I'd head there now if I wasn't working.", "author": "Valerie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-20", "description": "I had a very nice meal here with some regulars and I am glad I went with them. First, it's probably not a place I would stop in if I saw it passing by, it doesn't have the look of \"aw, how cute, lets' try this\", but looks can be deceiving. Homemade pasta, truly. nuff said.", "author": "annie c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-12", "description": "this place is dynamite. i went over the weekend and had a 45 minute wait at 6 pm!!! the food was delicious though. I would give 5 stars but the wait and the crowd really were a bummer. People pile in the door like sardines and wait a loooong time for a table. We ordered the gnocchi and the meat sauce pasta (i'm italian impaired). Like someone else said before me, it could have been made by grandma, it's that good. Very simple, fresh, and yum yum yummy italian food! just don't go because I don't want to have to wait any longer", "author": "Aimee R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-28", "description": "Excellent homestyle Italian food.  Happy atmosphere.  Very nice staff.  Recommend!", "author": "Judy E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-28", "description": "This place is great! You have to time it right if you want to avoid having to wait a long time to be seated. If you do have to wait, order a bottle of wine at the bar to sip on while you're waiting. Once you're seated, look at the menu but don't settle on anything until you hear the specials. Always ask the waiters for their recommendation, they've never been wrong every time I've eaten there. Save room for dessert and head a few doors down to 50 Henry Street wine bar where you can get served a glass of port, any variety of coffee and something simple but sweet.", "author": "Erin F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-27", "description": "I live like 3 blocks away.  It's pretty much the quintessential neighborhood restaurant.  Nice and rustic inside.  Excellent servers.  The bread and spicy olive oil is amazing.  Word of warning.  Make sure your date has some too or else your breath will scare them away.  hah.  The bolognese is delicious.  So is the spicy tomato penne.  The calamari comes in a giant portion -- perfectly fried.  The menu overall is very balanced...and huge!  The mixed drinks are under 10 bucks.  They have a bottle of wine that is actually good and is $14.  I mean, what more can you ask for?  Definitely in my top 5 of restaurants in all of NYC.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-25", "description": "My favorite thing about this place is that every time i go, i always want to order 10 different things on the menu.  That, and the fact that they have a very decent house red for $4 a glass.  A great neighborhood spot.", "author": "Dan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-15", "description": "This is one of the best Italian restaurants I've been to.  My parents lived in Italy for a while, I took them here on my second visit and they loved it as well.  My Mom said they made the best tiramisu she ever had.\n\nWhat was good?  Gazpacho, grilled artichokes with arugala salad, the bread, mussels in white wine sauce, carpaccio, octopus in tomato sauce, all the pastas, desserts, wines.\n\nWhat was just ok?  Roasted chicken, seafood risotto.\n\nWould I go back?  every single day if I had the money and lived in Brooklyn.\n\nOh yeah, cash only.", "author": "Jon T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-12", "description": "Over the years, my wife and I have gone to Noodle Pudding a lot.  We love the food and it's very reasonably priced but very rarely do we escape without some sort of service snafu.  This past time we sat and ordered at least 15-20 mins before the table next to us.  Sure enough, their entrees came out long before ours did.  \n\nThey're always very apologetic and will often comp a dessert or drinks to make up for it which is always very much appreciated.  Something just always seems to happen though with each visit.  We'll continue to keep it as one of our local go-to places but go in knowing that sporadic service is the price you pay for good food and low prices.", "author": "Peter W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-03", "description": "An old stand-by for our Brooklyn Heights pals, this Italian eatery is our Fragole-away-from-home spot. Our friends are major regulars and treated like royalty there, so our experience may be tainted... so too, this review. I literally have no complaints... OK, there was a wait and it was crowded... but it always is and that's a good sign. Also, our friends are breeders, so they have toddler in tow these days. No matter - the staff was still accommodating to no end. And so, a rather boring report card: Environ? A+. Service? A+. Wine list? A+. Food? A+. How dull, right? C'mon, trek up to Brooklyn Heights - God knows they need the foot traffic... it's so quiet up there!", "author": "Dan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-27", "description": "Went here with a couple of friends.  I had their risotto of the day..I believe mushroom?  Very very very good.  One of the best risottos I have ever had.  The brick chicken is also very well done.  Compared to the chicken and risotto, the butter and sage gnocchi was good.  Not their best dish.  Bread is also awesome especially if you get the mussels which has a delicious tomato based sauce! So good, we asked for three servings of it and they didn't care :)  which i always like in a restaurant.", "author": "Anna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-02", "description": "back in the day, this was our neighborhood joint.  we went at least twice a week and wow did it nevereverever disappoint.  when we moved from NYC, this is the place we chose to have a farewell dinner with our friends (all hardened jersey city superhipsters) and they all adored it.\n\ntwo things to know:  no credit cards and there's no sign (just follow your nose).\n\nthe food is universally delicious and just rustic enough that it feels like somebody's grandma could be cooking in the kitchen.  it's by far the very best dining experience b-heights has to offer.", "author": "Nic F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-21", "description": "I love Noodle Pudding.  It's very cozy and neighborhood-ly, I always feel happy to be there the moment I walk through the door.  The seafood, bean and vegetable dishes are the only things I ever get due to my being a pescetarian, but I have heard fantastic reports from my dining companions on everything else.  If you want to keep it on the healthier side, go for the salmon with white beans and escarole or the shrimp appetizer which also comes with a bit of salad and a pile of large white beans....sure, everything is doused in olive oil, but at least that's good for your heart :)", "author": "Erica D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-28", "description": "I went here for the first time last night and I will most definitely be back!  Some of the best Italian food I've ever had.  The bread and the spicy olive oil, wow.  The lasagna is classic and fabulous.  The gnocchi was so fresh and tasty.  Incredible service, a wonderful bartender, I just wish I lived closer.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-14", "description": "My favorite restaurant in Brooklyn! The staff is so friendly. Once they get to know you, they treat you like family- true Italian style. Their ingredients are so fresh and their food is generally excellent. The prices are amazing. There are several entrees around $10. The Osso Buco is the best outside of Italy. Don't miss this place!", "author": "Jade P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-28", "description": "We have been coming here for over 10 years.  The food is consistently good and the staff is very friendly.  It is also a good place for families with kids.", "author": "rj s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-19", "description": "Noodle Pudding can get away with the long lines and the cash-only nonsense because they serve delectable food in a festive, warm and pleasantly frenetic environment.   The wine is affordable, and the food ranges from Really Good to Amazing.  Last night we had a very fresh octopus salad, fried artichokes with arugula, scallops, and veal saltimbocca.  Their lasagna is incredible.  One of my favorite places to eat in New York.", "author": "Rachel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-11", "description": "Fantastic very tasty neighborhood Italian. Good alternative to Grimaldi's if you're in the neighborhood. Cash only. A bit stroller-crazed with kiddies and early family dining, but the food is top-notch. Super cute old-fashioned styling.", "author": "N B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-09-15", "description": "Everytime I visit my friends in Brooklyn I demand to be taken to this place.   We always go early to beat the crowd - it's a smaller place with a cozy atmosphere.", "author": "Brando n."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-03", "description": "Charming neighborhood place with really nice service. We showed up last Saturday at 8pm and were told it would be a 40 minute wait. No problem, we said; we'll go get a drink down the street and come back in 30. Sure enough, by the time we came back we had a table ready to go. GF ordered the octopus and the pork belly, and she seemed to like both. I thought the pork belly could use some seasoning, but that's me. I ordered the beef carpaccio and the tagliatelle. Beef carpaccio was chuck full of mushrooms. WTF? There were far more mushrooms than beef and it totally lacked sea salt for taste and texture. Additionally, it was made with frisee in lieu or arugula. Tagliatelle was likewise light on the flavor department. I would say the seasoned oil presented with the bread was a winner though. All in all, I did enjoy the warm service by all those with whom I interacted but the food we had left me with a feeling of bland \"meh!\" No need to go back.", "author": "Luis P."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}