{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "Throw me back, throw me back, to old Brooklyn, old Brooklyn heights where cobble stone street reigned and waiters sang at your table (*note no waiters sang at our table but I wish they did!) Dinner for 4 on a lovely Tuesday evening a few weeks back. The ambiance was on point, casual but not too casual. We sat around 7:30 follow a dollop of wine or two at the bar and dove right into a 2 hours dinner delight. \n\nWe started with squash flowers stuff with ricotta cheese (#allthefeels) and then moved our way into the main dishes. I went with a standard lasagna bolognese and it was divine. Light and airy almost, but with robust flavors and it didn't make you feel like you just ate a stone, it was perfection. My companions and the misses dabbled in eggplant parmesan and caprese salad - needless to say all plates were cleaned by close of course. \n\nA couple of things to note, there is basically no signage so I walked by the restaurant possibly twice before I finally had an 'ah ha' moment. It is CASH only, but before you grumble, just prepare in advance and recognize that the prices are actually a bit cheaper because they're avoiding swipe fees. And hey - that's what Venmo is for. \n\nSo no, Noodle Pudding is not some weird hipster pudding joint, but you're next great Italian adventure! \n\n*Fun fact - we actually saw two sous chiefs bringing in MASSIVE fish, caught it seems that day, through the front door! So yeah ... it's fresh ... so fresh", "author": "Kenneth K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "Noodle Pudding is a charming rustic Italian cafe with a neighborhood friendly vibe. The majority of its menu is stellar and the prices are affordable, especially considering the location in Brooklyn Heights. It is CASH ONLY and has virtually no signage, so it has absolutely no qualms with doing its own thing. They're family friendly and have a great location near Brooklyn Bridge to continue a nice evening out. \n\nOn one particular date night we showed up at 6 pm - they do NOT take reservations - but we were lucky enough to get a great table to by the window immediately (which they open up to the street in summer months). Service is a bit rushed, but super knowledgeable and try to give you space to have a good time.  \n\nWe ordered:\nTomatoes and stracciatella soft cheese\nSpaghetti and stewed octopus\nSalmon and escarole\n\nThe meal was excellent, with very fresh ingredients, superb execution, quickly delivered plates, and a lovely crusty rustic loaf of bread to sop up all the leftovers. They offer lots of seasonal and daily specials, which is awesome. If you're in the neighborhood and the wait isn't longer than 20 minutes, I'd say this is a great option.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-16", "description": "I cannot say enough good things about the food. So authentic and auhhhmazing. The wait is always a pain, but that tells you something about the quality of food. A+ on the homemade noodles.", "author": "Holly R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-14", "description": "By far one of the best restaurants my family has had the pleasure of eating at.  We have been there several times, and never once have we been disappointed.  The owner and the staff are amazing.  Our favorite waiter is \"Piero.\"  You are missing one of Brooklyn's best if you don't try this restaurant out.", "author": "Ann A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-27", "description": "Came here after a long cold walk across the Brooklyn bridge,  we were so hungry and the food did not disappoint.  4 of us ordered two appetizers and a main each.  The only reason I am leaving out a star is because we had no idea how huge the portions would be!  We would have skipped the apps and just had mains.\n\nEverything tasted incredible and we took Home a lot of left overs, friendly staff, great atmosphere and unbelievable prices for the quality of food.  Brilliant wine selection also!! \n\nWill 100% be back and bringing others here (just make sure you don't eat a lot before you come!  Such a Shame to leave leftovers of such delicious food.)", "author": "Laura J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "This place has incredible Italian food! If you are looking for good pasta in Brooklyn Heights, Noodle Pudding is a must. Their gnocchi in particular was the best I have ever had, it was the perfect fluffy consistency and the pomodoro sauce on top was absolutely delicious.", "author": "Sara S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-09", "description": "We just had dinner here and had a condescending waiter and the food was bland.  At one point the Maitre d asked if we would move table to accommodate a larger party which we did.  However, at the new table I was repeatedly jostled by customers and waiters even to the point of a waiter carrying two dishes of food directly over my head.  At the end of the meal I spoke to the Maitre d about it and he acted dumbfounded as if he couldn't image what I was complaining about.  It was very disrespectful.  We used to like this restaurant but we won't be back nor will we recommend to friends and clients.", "author": "Irene D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-05", "description": "Absurdly delicious with very fair prices.  Everything I've ever had is delicious but always available standouts include the house Chianti, Lasagna, buffalo mozzarella with tomatoes/basil and tiramisu.  When specials are offered I urge you to get them, the fish and rabbit specials are beyond delicious.  The service is perfect and the ambiance is vibrant.  A perfect Brooklyn Heights establishment : )", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-30", "description": "Such a wonderful neighborhood restaurant! Every time I come here I have a lovely time. Good food, good service, nice neighborhood ambiance. Always seems to be a big family celebrating a birthday. I just wish they weren't so popular so it was easier to get a table!", "author": "Molly B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-04", "description": "This is probably my favorite Italian restaurant in all of NYC. The food is always great, the service is always on point and helpful. Good wine selection to choose from and their prices are very reasonable. \n\nMy wife and I love this local spot. Always one of the first places we recommend to friends and family visiting us in Brooklyn Heights.", "author": "Greg L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "One of my all time favorite NYC legends. Worth the trip to Brooklyn Heights if you don't live in the area. Great service, fun atmosphere and the food it top notch. Perhaps that's why I've been coming here for more than 10 years.", "author": "Onyx B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-03", "description": "Terrific neighborhood restaurant -- we have been going regularly for more than 10 years and it never disappoints. The house wine is good and inexpensive, the service unpretentious and attentive. You can't miss with the lasagne, the fresh caught fish and green beans, most of the pastas and for dessert, the panna cotta or tiramisu. Ambience is warm and energetic.  It's often packed  and they don't take reservations but if you go after 8 you can usually get a table without a wait.", "author": "Ann D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-06", "description": "This a Brooklyn Heights Henry St. staple along with Henry's End. Food portions are a decent size and staff friendly. Salmon Carpacio is house cured and comes with a side of Beet Salad. It's a big portion enough for two and delicious. Straccetti is traditional Roman beef dish. The beef is thinly sliced and grilled on one side with the top a Medium rare topped with parmigiano cheese and celery. It comes with a sweet tasting Potato chip and small salad. The beef had a nice smokey taste. The Skate was absolutely delicious grilled with a caper sauce. The only hiccup was the entrees took awhile to arrive so much so a table was seated next to us after we finished our first course, ordered and got their entrees before us. Hopefully that is just a one time thing.", "author": "david l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "Delicious food and cozy atmosphere! My friends and I were able to score a table by the window, and with the radiator on and festive interior the restaurant had a great ambiance. We ordered the gnocchi with butter and sage, straccetti, and pappardelle with boar and mushroom ragu.\n\nI loved the pappardelle--I like my pasta on the firmer side of al dente, and this was perfect without being too heavy. The boar was extremely tender and not overpowering; with the mushroom ragu, it tasted deliciously earthy and complemented the pasta well.\n\nThe gnocchi was also good (as many other Yelp reviews can attest), but I felt that it wasn't as interesting to eat as the pappardelle. Flavor-wise, it was creamy and rich, but I ended up preferring the pappardelle because it had more texture and was more fun to eat.\n\nI was pleasantly surprised by the straccetti; we ordered it not knowing quite what it was, and when it came out as a single piece of what looked like very thin beef with vegetables I wasn't sure if we made the right choice. But it actually tasted delicious--the beef was tender (the menu noted that it was grilled on just one side), the small side salad it came with bright and acidic. I also loved learning about the dish itself when I got home; apparently, straccetti translates roughly to \"rags\" of beef, which I thought fit the way we ate the dish (tearing the beef into pieces) surprisingly well. I recommend this if you have never had it and want to try something new!\n\nThe one downside is that we didn't get any free bread. The table next to us had bread, but I think it may have been an actual dish you have to pay for. Obviously not a deal breaker, especially since our food came out very fast, but just something to I kept in mind!", "author": "Ziqin Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "Came here a few times. Recently celebrated my Parents' 50th \"Golden\" Anniversary, with a big group..best experience w/this place since! Great food, great service \u0026 ambiance! It helps that the Owner/Chef is from Ischia where my Parents are from so you know the food is AMAZING,One of a kind \u0026 feels like home!\n\nSide note: Most of the food served on my Parents' 50th Wedding Anniversary was not on their regular menu so l think those dishes we had were for either big groups or a set menu for special occasions.", "author": "Brooklyn A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "This restaurant was surprisingly good! \n\nWe visit Brooklyn every year and have never been here! With a name like noodle pudding it didn't really give me the impression of an authentic Italian restaurant, but boy was I wrong! \n\nThis place was phenomenal! All the pasta's were made from scratch! the sauces, everything! The rapini was to die for! \n\nI would come back here in a heart beat and I highly recommend if you're in the area and trying to decide if this place is a yay or a nay? Just skip merrily to noodle pudding saying yay all the way!! You won't regret it, I promise!", "author": "Nada S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-24", "description": "I always enjoy eating here, it's a solid spot with lots of options and a great place to take out of town visitors, family, and those looking for the white tablecloth experience and great old school waiter/waitress service. Lots of classic American Italian fare for those looking for the standards as well as ever-changing, interesting specials. I also really like their house wine - bottles are super reasonably priced as well. Eat your pasta, drink your wine and head to the promenade for a walk... just don't forget to bring cash.", "author": "Toby L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-08", "description": "This place is amazing. I'm at a loss for words because my brain is scrambling to think of what to highlight first! Is it the pillowy gnochi?! That the g is silent in gnochi?!-How cooky! That the atmosphere is perfectly elegent yet relaxed at the same time moment? The fried calmari with spicey sauce is perfectly cooked and fresh? Is it that the \"cheap\" wine is not \"cheap\" at all because that would be a negative, it is only $15 and mild and delicious? That the special of goat with goat cheese pasta was crafted on a whim and turned out to be excellent? That the waiter was so cool and laid back yet professional and informative? \n\nOh. So I guess thats it.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "Basing this on my experience last night, when I had to get my bearings right, lost in a neighborhood I'm not familiar with and intoxicated with whiskey. Friendly staff let me in, even though they were closing, to use their bathroom and call an Uber. Really sweet. Would come back to try out their menu", "author": "Jess B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-04", "description": "Ingredients fresh from the market, flavors that stimulate the body and soul the experience truly stays with you. Zucchini flowers lightly fried stuffed with ricotta mozzarella, razor clams with breading and garlic, grilled octopus cooked to perfection in a Boop sauce, and that was just some of what we ate. With an atentive staff that leaves you wanting for nothing, be warned this is not for the uptight and posh... real people only. Cozy close quarters allows for a true intamite setting. \nBring your appetite cause portions are generous. If you don't clean your plate the Chef just might send the dish back out to you!!!", "author": "Dran L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}