{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-13", "description": "Strange name, no sign out front, cash only, very loud.  But the food was good. Although I know I didn't choose the most representative menu choice - hangar steak and wedge salad.  The steak was good and cooked properly on the inside.  But the outside was over charred for me.  I still enjoyed most of it.  The bread and oil served when I sat down was superb!  The oil had chunks of red peppers and spices.  And the bread was very fresh and just plain good!  And for desert I had a chocolate cappuccino cake that was super delicious.  It was closer to a flourless cake.  It paired very well with my after dinner glass of super tuscan - which was really good also!\n\nThe bar is very small.  It fits 7 people.  There are tables that face the outside with giant opened windows.  So that is nice.  The dining room decor and setting is quite comfortable - except for the super lively and loud crowd.  And the service was good.\n\nBut what is the deal with all these NYC restaurants that don't take credit cards?  For that reason alone I won't be returning here.  Especially as a business traveler whose charges are automatically identified and reimbursed by my company through use of my corporate card.  Instead I have to 1) find an ATM 2) take out my own money 3) fill out paperwork to be reimbursed.  Who carries cash anymore?   This is an inconvenience that isn't worth it in a city full of great restaurants.  \n\nI'd give it 3 1/2 stars but Yelp doesn't allow that. So I'm giving them the benefit of the doubt as I didn't order a real Italian dish.", "author": "Jack S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-14", "description": "I did a little bar/restaurant hopping and ended at Noodle Pudding.  Almost walked past the place because no signs were on the establishment.  Food was fresh and simple(in a good way).  Mussels were outstanding with red spicy sauce.\n\nI would high recommend this location.", "author": "Ricky F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "I don't go to Brooklyn so often but the dining experience at Noodle Pudding was certainly worth the trip.\n\nThis is a very authentic Italian restaurant which the name doesn't justify the food it serves. The restaurant does have a good variety of Pastas but I don't think they have pudding to offer.  \n\nI had the squid ink pasta with clams and cherry tomatoes for the evening. It was as good as it can get and the sea food was super fresh. Squid ink pasta itself was as good as what I had in Napoli, Italy. My friend Nicole and I finished the meal with a Tiramisu, an item on top of the dolce menu for a good reason. \n\nOn another table, a guy named Chuck was having his birthday. The waiters were in good spirit and invited the whole restaurant to sing the birthday song for chuck. The restaurant was more well-lit than many other similar Italian restaurants.  I see families, friends, coworkers all having a good time in Noodle Pudding on this lovely Friday night.", "author": "Min B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-15", "description": "Not worth it. The wait was so long as there was no reservation available. No place to sit while you wait. I stood and kept getting hit by the customers and waiters coming through. The head waiter kept telling us that our table was almost ready when it actually wasn't. \n\nFinally we are seated. To even get a waiter's attention was SO difficult that I contemplated leaving. But since I had already waited an hour for this place, what is another 10+ minutes? We ordered. Water does not come until our food comes. AND my ravenous self was staring at the tables near us, THEY ALL GOT BREAD. WHERE WAS OUR BREAD?!?!?\n\nAnyways, so my friend and I got the tagliatelle bolognese as well as the pork belly.\n\nPork belly was just all fat. NO meat. What kind of dish is this?! I understand that pork belly has a lot of fat.. I've eaten it at a lot of places. But if I order the entree version, I expect some meat on it! \n\nThe tagliatelle was less disappointing. It was a homecooked pasta, something you can make yourself. Not exciting. Not innovative. But this place isn't that. I recommend it if you want a down to earth meal.\n\nBut you can get this pasta anywhere else in the city, don't suffer through this long wait and horrible service for it.", "author": "Lisa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "Great food, reasonable prices, really nice atmosphere, and the best service I've ever experienced!!", "author": "Jacqueline B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-07", "description": "One of my favorite restaurants in NYC. Relaxed, convivial atmosphere, talented and personable wait staff, and an always reliable, delicioso kitchen!  The risotto du jour (what I typically order) is consistently scrumptious, yet the chef-owner also offers a nice homemade lasagna and does a great job with fish. Rest assured, what ever you order will be tasty at a minimum, but probably fantastic!  (Leave the credit card at home, they only take cash).", "author": "Patrick D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-20", "description": "Ok, this place is easily one of the best Italian places I've been to. I loved everything about it from the food to the service to the ambiance. What makes it even better is that it's located about a block away from us in Brooklyn! Woo hoo! I have a feeling that the staff at Noodle Pudding will get to know us really quickly!!\n\nSo, the deets... I'll start with the food. I ordered a pasta dish with Bolognese sauce, and everything about it was on target.  If you're not familiar with Bolognese, it's essentially Marinara sauce (or some similar tomato-based sauce) typically mixed with sausage and/or beef. This rendition was served over Campanelle pasta... you know, kinda like the wavy shaped pasta that was in the now discontinued Chef Boyardee Roller Coasters. Well, let me tell you-- the meal was awesome.... and leaps and bounds above a Chef Boyardee meal. The sauce was seasoned and spiced perfectly, and the meat melted in my mouth. Vinny ordered a pasta dish as well and was equally pleased with his choice. \n\nAs for the service, it was spot on and impeccable. In fact, we could tell that our waitress was having a bad night (earlier we saw her accidentally mess up an order and get scolded by a manager), but she kept a smile on her face the entire time and was attentive throughout the evening. In fact, she could sense that we were sympathetic, and I think we helped make her feel a little better. \n\nThe ambiance at Noodle Pudding is nice as well-- intimate and classy yet rustic with low light-- perfect for a romantic night out. I was a little surprised to see so many couples bring their kids in, but they all seemed well-behaved, so it didn't bother me too much.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "Their service is slow. It takes quite a while for the waiters to notice you standing by the door waiting to be seated. More time to wait for the menu, the food, and the check.\nBut I still give them a good review. Why? Because the food is fantastic! It is the best pasta I've tried in New York City, better than those in Little Italy.\nI will go again when I have a lot of time to kill.", "author": "Charlotte G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-25", "description": "Very good Italian food. Cash only, no reservations. Gets busy, you may have to wait, it's worth it. Not very expensive. Lots of variety on the menu and different specials every time. Great staff, very professional and friendly.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "The main problem with Noodle Pudding is that they often have a long wait for a table. They don't really need another good review, but so what -they're a great restaurant in a neighborhood that has almost no good dining options. Seafood is always a highlight here, and if there's a special the staff recommends, go for it. The salads are wonderful, especially in summer when they get heirloom tomatoes. Pastas are excellent, as may be expected in an Italian restaurant. Service is very good, fast and friendly. they don't take credit cards, but then their prices are reasonable for the quality. It's one of very few places where I'm willing to wait for a table.", "author": "Serge F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-15", "description": "Food is excellent. Price is agreeable. And the volume of business they bring in on a Friday or Saturday night speaks for itself. Service can be spotty and I don't like the wooden chairs with the arms, but if you can overlook that you're in for a treat.\n\nFavorites: $1 meatballs, tagliatelle bolognese, and the arugula salad.", "author": "Aaron F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-10", "description": "Was in Brooklyn for my great niece's 2nd birthday. This is her favorite place. I had a Cesar salad and seafood pasta.  The good was good.  There are many more excellent restaurants in New York. But it was family friendly and has a cozy decor.", "author": "karen b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "This is an old school favorite.  Cash only, classic dishes executed with great care and precision.  The food is consistently amazing, and the bar always making some of the best hand made cocktails.  \n\nGetting in isn't easy but it's worth the wait!  \n\nOn any given night while other establishments on the street are empty this place is hopping!", "author": "Fritz S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-24", "description": "Noodle Pudding is our favorite date night spot in Brooklyn Heights. They always have amazing, fresh specials (for appetizers, entrees, and sides) and all of their dishes are spot-on. Troy's service tonight compelled us to sit down and write a review - he (and all our servers in the past) have been extremely friendly, helpful, and courteous, offering honest recommendations and great service. Not too pricey at all, but the food is fantastic. \n\nThe vibe there is also excellent. It's on the border of upscale, but not snotty or stuck up. It's classy but has a neighborhood, laid back feel. You could walk in with sneakers and they wouldn't bat an eye.", "author": "M B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "Most delicious bolognese!  My table loved the risotto of the day and the seafood fettuccine.  Sneak tasting confirmed that every bite is flavorful.  Of course the dreamy green-eyes server enhance the overall experience.", "author": "Vee K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-27", "description": "What a great find. Our server was delightful, the food was delicious, the tiramisu was delectable and worth the extra calories. I'm sure the neighborhood regulars hate the guests that discover this hidden gem within easy walking distance of the Brooklyn Bridge. My only reason for 4 instead of 5 stars is the fact it is CASH ONLY. Thanks Troy!", "author": "Terri R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-17", "description": "My friends and I came here last Friday night, and I was really disappointed with the quality of food and the price. First things first, though, I will admit that we didn't order \"smartly:\" I got a fish dish, one of my friends got duck, and the other got the tagliatelle bolognese. \n\nHere are my tips based on this experience: \n\n1) DON'T waste time and money on the appetizers. The bread and oil is quite good (not the best quality olive oil, but it's free so whatever), and the apps just weren't worth the money.\n\n2) DON'T order anything other than pasta, and have a backup plan in case they're sold out. I ordered gnocchi, but 15 minutes after I ordered the waiter came back to tell me that they had run out. I ended up ordering salmon trout which was so mediocre I got a burger from shake shack after we ate here. (Don't judge me, I have needs). \n\n3) DO bring cash, and lots of it. \n\nMy friend's duck was very fatty, but the tagliatelle bolognese my other friend ordered was delicious. \n\nI want to go back and try the gnocchi eventually, but I definitely will not order anything else on the menu.", "author": "Emily H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-18", "description": "I really don't even know where to begin. Any friend of mine knows that this is my favorite go-to spot. My first question whenever I know I'm going to have a visitor is, \"We're going to Noodle Pudding, right?\" Well, it's really more of a command than a question.\n\nThis is by far my favorite restaurant in the area. It is unfailingly good, reasonably priced and everything is always extremely fresh. Not to mention, you can get great food in a non-pretentious atmosphere. \n\nHandmade pasta, juicy tomatoes, $4 house wine and an ever-changing list of seasonal daily specials. Why would I ever go anywhere else? Oh wait, I don't.\n\nOnly downsides are that it is CASH ONLY and they don't take reservations, which can sometimes mean a long wait and less-than-speedy service. 100% worth it.\n\nGo, please!", "author": "Rebecca N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-13", "description": "Came here on a date night awhile back and have been meaning to check this place out for awhile. The pasta is home made which is nice and one can taste the difference but portions are a bit smaller. Taste was great but service was a bit lacking. There were a couple of times we were struggling to get the waiters attention.", "author": "Cindy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "Doesn't get more authentic.  I felt like I was in Italy.  I felt like I was home.  The food was beyond delicious and the owner was kind enough to come to our table to say hello and talk about Ischia.  Perfecto!", "author": "Pam T."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}