{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-16", "description": "mmmm good! \nafter having a so so experience with some much desired italian food in sf's north beach i was looking forward to some good italian cooking on my visit to ny. noodle pudding did not disappoint. simple and delish. not one complaint from the five of us about the food though the cash only policy is a tiny pain for those used to slinging plastic.", "author": "Zoe s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-06", "description": "This place is around the corner from us -- lucky us! The food is consistently delicious. never boring. It is the most interesting italian food i know of. I also like that it seems like a regular restaurant. It reminds me of a restaurant in Cleveland  -- in a good way. I love the asparagus that is wrapped in fried cheese. I love all of the seafood pastas. My only complaint is that some of the waiters are douchy. I like the older broad with the ponytail -- she knows her stuff.", "author": "Sara M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-12", "description": "I came here with a big family, party of 10 so we made reservations at 6pm. Reading the reviews there is a long wait if you don't make reservations. Food is excellent. Recommend the fried calamari, mussels with garlic, monk fish over pasta and monk fish stew with clams and mussels. Each of us ordered a main dish, shared 4 appetizers and 3 desserts, 4 bottle of wine, plus tax and tips = $500. Was definitely a great night. good food, good service, good ambiance...what more can you ask for?", "author": "Sirikwan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-15", "description": "It's all true. This is by far my favorite Italian restaurant. It's reasonably priced (you can get a drinkable glass of wine for $4 for chrissakes!) and the food is just excellent across the board. On our most recent visit, we had mussels in impepata (melt-in-your-mouth-tender w/ a zesty broth), the gnocchi w/ sage and butter (simple and perfect), and the veal cheeks special (again, melted like butter in my mouth). Nothing was less than spectacular. The service is attentive but not irritating. The only drawback was that the dining room was a bit too cold near the front door. Luckily, our waiter reseated us without any fuss. Also, you have to plan ahead because the restaurant is cash only and does not take reservations. It's worth it. And how.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-28", "description": "I went here tonight with my friend around 6:30. We got seated right away but our server didn't come for about 10 minutes. Once we ordered we got our food relatively fast and it was very good. We both enjoyed our meals and we shared two desserts which were also very good. Overall we really liked it and want to go back again, just hopefully next time the service will be a little bit better.", "author": "Kahlie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-02", "description": "everything is a very good. but too crowded in the restaurant;(", "author": "Erika K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-12", "description": "Long wait but I truly enjoyed my dinner here.\nI had bread, salad, a salmon dish, and wine. It all tasted so fresh and authentic to the flavors I experienced in Italy.\nThe waitstaff was helpful and friendly. It was a bit loud and crowded but for good reason.\nI can't wait to go back this fall and try a pasta dish!", "author": "Nancy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-19", "description": "Good, solid food . . . Period.  No fancy bells-and-whistles, no amazing innovations.  Just good, solid, reliable, delicious Italian food.  And oh yes - the entire staff is great!  Bravo!", "author": "Jerry S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-04", "description": "its tasty homemade pasta.  nothing crazy amazing. just solid good stuff reasonably priced in a setting that feels cozy.\ndont go in expecting to find heaven. youll only find a good tagliatelle, lasagne, mussels, gnocchi....", "author": "suzanne k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-31", "description": "Ok, this food was good. Really good. The service was attentive and the prices totally reasonable. I did not care for the wine by the glass selection and the house wine was not very nice but the food and service was aok. Will go back.", "author": "RadicalNewTherapy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-22", "description": "This has become the go-to neighborhood restaurant for my fiancé and me. It is consistently excellent, reasonably priced, with wonderful service, and always has new seasonal specials that are delicious. Highly recommend it.", "author": "Aaron R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-16", "description": "I love, love, love this restaurant for a delicious meal, but in the past year the service has gone from bad to worse. I live in the neighborhood and go about twice a month. The food is incredible but I really hope the management realizes there is a definite decline in service. There seems to be plenty of staff, yet no one has assigned tables or duties. And, I know this seems silly, but they no longer serve ice! Who wants room temperature water? Put some damn ice in my glass. So, overall, you will get an insanely good meal if you don't mind some insanely frustrating service.", "author": "Erica P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-19", "description": "The stars are for the great food but the lines and the noise are just impossible.  Every parent in Brooklyn Heights loves it here because they just let their kids run wild, which is really tough on the other patrons.  If you want a quiet Italian this will not do.  It is so sad because the chef is solid.  But if I'm going to wait an hour or so for dinner it has to have some ambiance and I had better be able to hear my dinner companion which is impossible at Noodle Pudding.", "author": "Bx L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-06", "description": "Walking in on a cold fall night, it is not hard to understand why this popular Brooklyn Heights' neighborhood restaurant is a big hit. Noodle Pudding simply oozes warmth, good Italian food and friendly service. The prices are more than affordable, and you are dining in a romantic golden colored candle lit room. \n\nThe menu focuses on classic dishes with an adventurous twist. The pappardelle with venison ragu was simple but yet so flavorful. Although tiramisu was ordered on every other table, and looked very yummy, at the end of our meal I was simply too full to try.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-24", "description": "I am always happy with this place.  Great food and service. Big fan of their fish specials.  Great if you have toddlers b/c the noise drowns out any shouts or things being dropped on the floor. :)", "author": "Tatiana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-07", "description": "We went to Noodle Pudding on our weekend getway to NYC in May.  Noodle Pudding was highly recommended by a friend.  If you didn't know it was there, you'd never know it existed!  There's no sign, you just have to know.  I'm not even sure what we ate since our friend made arrangements for the restaurant to \"take care\" of us.  Every dish that they brought out was good.  We even had some sort of pasta with rabbit meat.  If I wasn't told it was rabbit, I would have thought it was turkey.  It was so so good!!  Would love to go back if we ever find ourselves in NYC again.", "author": "Dannie W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-15", "description": "I have been subjected to endure the mediocrity of this place way too many times and now my husband has finally seen the light!  The food is barely adequate (pasta is always overcooked and menu is sooo boring), the waitstaff are incompetent (never know the preparation of the dishes???), wine list is just awful, the NOISE is unbearable and the \"reservation\" system is a travesty.  We will never go here again and will now always enjoy places like the wonderful Al Di La where we can hang at their charming wine bar until our table is ready!", "author": "Jake K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-24", "description": "After hearing raves from various people, I was eager to try this place while visiting friends in Brooklyn Heights. Unfortunately, we had the crap luck of the night: Kitchen/Server mixups, food wasn't put in the computer and when it finally was, our server was told by the kitchen that they were out. This was 35 minutes after we originally placed the order...yikes. My gf and I were quite perturbed, but being classy folks, we didn't raise too much hell. We were almost more dumbfounded by how it took so long for the communication to happen between the kitchen and server. I ended up ordering a straightforward linguine with a spicy red sauce (an arrabiata, probably). It was bland..kinda like the order, but at that point I just wanted to get out of there. They brought us some free dessert which saved the night from being a TOTAL disaster. Being that I'm rarely in Brooklyn Heights, I'll never go back, but even if I visited more I'd probably avoid it like the plague.", "author": "Adam H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-04-21", "description": "I went here last night with my parents. We were enjoying our meal, and were just commenting on how attentive the service had been, when we received the check. It seemed a bit too high--my mom and I had both ordered a $8 pasta dish, which should've added up to $16. It looked like our waiter had originally written 16 on the check, scribbled it out, and then wrote the double, $32. When we brought this to his attention, instead of looking it over to see what he'd done incorrectly, he just laughed and walked away with the check. It almost seemed like he was completely aware of what was going on and either he (or someone else) was trying to rip us off without us noticing. Perhaps it really was just an honest mistake, but since this place takes cash only and the check is written entirely in pen, the whole thing seemed a bit shady. So please, don't forget to check the bill before you pay!!! I'd be interested to know if this has happened to anyone else here.", "author": "Caroline Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-18", "description": "Nothing bad to say about this place...food is always good and very reasonably priced.  try the lasagna!", "author": "Heidi S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}