{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "Hadn't been to Noodle Pudding in 10 years, and it was even better than I remembered.  Great food.  Nice atmosphere and service.  Good value.  I was particularly.  Found the \"house red\" for $15 delicious, pork chop was cooked rare as requested, and the pasta was quite tasty.  Desert could have been skipped, but otherwise a very solid experience.", "author": "Craig Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-07", "description": "Here I go again with 5 stars. Service is great. No rushing even with a line out the door (as there usually is). \n\n$5 red wine a bit too sweet for me. But palatable. Green salad with house vinaigrette is delicious.  Winter minestrone could have a tad more flavor but a shake of Italian sea salt and some fresh ground pepper do the trick. \n\nSalmon over escarole and white beans is a plate of heaven. Roasted chicken with potatoes was the best chicken my\nFriends ever had! Rigatoni siciliana with eggplant was quite flavorful and the diver sea scallops wrapped in pancetta over risotto with mushroom ragu was just perfection. \n\nLovely ambiance and a good neighborhood vibe. It's a gem!", "author": "Jan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-14", "description": "**cash only\n\nDecor 4/5\nSeating for.. A lot..\nClean warm, cozy earth tones \nBathrooms are cute and clean \n\nService 5/5\nFriendly, funny, informative. \nWater was or filled very frequently \nLarge selection of wine \n~4-5 beers on tap\n\nFood 4.5/5\nComplimentary Bread with herb oil was nice, bread was soft \n\nOctopus bruchetta - amazing. Huge portion, the tomato sauce is delicious, not overly salty, octopus is melt in mouth tender. Minus .5 points BC the toast was a little burnt \n\nRoasted chicken \n- I can't remember the last time I had such a perfectly cooked chicken. The skin was hot and crispy with all the fat rendered out, the meat inside was fork tender bursting with juice.\n- over a bed of crispy thick bacon bits and leeks, so delicious\n\nStrataccelli\n- this is like beef tataki (appologies for the Asian food reference) over salad\n- also amazing it was melt in your mouth tender \nSo good..\n\nI'll be back..", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "I don't usually review a restaurant, but this one is so great! I would say, it is beyond my expectation! The mussel is so fresh and delicious, the hand-cut pastas are so amazing. I've never been to Italy before, but this place makes me feel like they make real Italian foods. Also the desserts, taste like magic. This one deserve a second visit, definitely.", "author": "Yueying Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-27", "description": "Cash only. Otherwise, everything is delicious. Came here with family and we all had a wonderful time. The quality of the food and portions are great. Its Italian rivals it's more expensive counterparts in Manhattan.", "author": "Adam M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-29", "description": "Noodle Pudding is a delightful (yes, delightful!) Italian restaurant with an odd name.\n\nWhile checking out the DUMBO Arts Festival this weekend, my friends and I decided we were starving and needed food stat. I called a few restaurants but this had the shortest wait (we were quoted 40 minutes). Fortunately, it only ended up being about 10 minutes when we got there. \n\nThe restaurant seemed really disorganized and frantic at first and a woman even collapsed outside the restaurant (she ended up being fine), so fire trucks came by. It was really bewildering and the owner/host seemed stressed. \n\nBut as soon as we were seated, our experience was amazing. The waiter was funny and helpful, our wine was only $15 a bottle (the waiter mentioned the owner doesn't like to upcharge it as much as other places), and the food was honestly delicious. The pastas all had a twist that made the meal less conventional since Italian food can be more or less the same. They also have a number of daily specials with a focus on seafood. A little pricey, but worth it! \n\nWhat we ordered:\n*The calamari = Came with a spicy aioli sauce instead of marinara, which was a nice touch). This was awesome. \n*Seafood fettucine = Probably the best dish. It was tomato-based instead of Alfredo-based. \n*Pasta with broccoli rabe and clams = an interesting dish but the clams were a little too small and the rabe was very bitter. I think I preferred the fettucine though.\n*Tiramisu = consumed in 1 minute flat.\n\nI also have to sing praises about the free bread and olive oil. BEST BREAD AND OLIVE OIL EVER.\n\nIf you're in the area, definitely go here.", "author": "Valerie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "A hole in the wall, but this place is gold. I found Noodle Pudding when I first moved to Brooklyn by asking a random person on the street where my family and I could get some good Italian food. We've been regulars for years now. The staff is amazing and always remembers us. The location is awesome -- walking your food off around the promenade afterward is always a good idea -- and the food is worth every penny. Definitely pay this place a visit, it's worth the wait!", "author": "Andreana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-08", "description": "Great neighborhood restaurant. Do not go if you want to get in and out but if you're looking for a long sit down meal it's great. Food was good, nothing that wow'd me but the restaurant had a good vibe that makes me want to return. I had the roasted chicken with potatoes. The chicken was moist and tasty. My two friends ordered pasta dishes which they both enjoyed. There is usually a wait on weekends.", "author": "V M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-15", "description": "Been here three or four times now and no disappointments. The pasta dishes are awesome and the house red tastes like it's better than house. The service is pretty good and the ambience is nice!", "author": "Chris C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-07", "description": "The food and service was wonderful, and the prices are very reasonable. My boyfriend out-ordered me by getting the lasagna Bolognese. I got the gnocchi, which was good, but his had more flavor. We had the burrata and tomato appetizer, which was supposed to serve 2 people, but they were nice enough to make it large enough for 3 and charge for 1.5 orders instead of just making us get two whole orders. Very accommodating. \n\nThere was really only one downside, which is that they only take cash and they don't have a cash machine. I had a hard time getting cash because the closest store's machine was down, and it was raining. We worked it out and because the restaurant is so reasonably priced, I didn't need to make two transactions because of the $200 limit on the cash machine. \n\nOh, and the location? Can't be beat. It's a wonderful, charming neighborhood, walking distance from the train.", "author": "Rebecca K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "Noodle pudding was great. I got the spaghetti with lemon, which was terrific. My friends got the pasta with meatball and sausage, and the pasta with clams. The appetizers were delicious too - garlic bread, burrata, tomato and mozz, and Caeser salad. Only complaint is the burrata came on two pieces of bread so it was rather hard to share. Service was a bit slow, but not horrible. Would definitely come back!", "author": "Dorothy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-12", "description": "We haven't been to this area for dinner in a long time, it's a little out of the way usually.   Glad we made this trip though, it was totally worth it.  Parking around here is not easy, one should usually take the train.  We came on a Wednesday evening so we had no wait for a party of 2, which was quite nice.  The restaurant seems a lot more fancy than it actually is.  The waitstaff is uniformed in white shirts and the hosts are in suits.  However, once you're inside, everyone is friendly and the atmosphere is very laid back.  There is no pretentious air where the customers/staff look down on you if you're not in a suit, just a nice restaurant.\n\nWe ended up ordering from the daily specials menu for both appetizers and entree.  The app was an oxtail ragut and the entree was grilled black bass served with Maine mussels, clams, and cherry tomatoes.   \n\nThe oxtail ragut was served with ribbon pasta and it was just delicious.  There was a comfortable taste and feeling to it, it was basically comfort food.  Surprisingly, the dish was pretty filling and easily shareable for two people.  \n\nThen came the main seafood entree.  The bass was perfectly grilled and the meat was tender.  The fish had just enough texture that you can bite into it without it falling apart in your mouth.  The skin, my favorite part of a fish, was flavorful and crisp, magnificent.  The fish was surrounded by mussels and clams.  Only complain is the clams were about the size of my pinky nail, tiny clams, not satisfying.  Good thing the mussels more than made up for it.  The mussels were sweet, hearty, and flavorful being brewed in the seafood broth.  \n\nWe thoroughly enjoyed our meal here and would love to come back many times.", "author": "Leila L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-22", "description": "This place is not great at all. The first thing that doesn't make sense here is the table arrangement. A few tables in the front and one lonnnnngggg table that cuts the restaurant. Then they have four tops? Wouldn't it be better to have 2 tops and combine them? The hostess seemed nice from far but she was very rude. When I asked for a table separate from \"farmer style\" she looked at me like I was stupid and she was like \"um what? What did you say?\" How do you speak to a customer like that? She goes \"anyway this is an Italian restaurant.\" That has nothing to do with farmers style tables. She obviously has no idea what she's talking about and is super unprofessional, especially with the way she obnoxiously chews her gum. Your hostess is what gives your customer the first impression of the restaurant, and this definitely should NOT be her job. The waitress we had was HORRIBLE!! She pours our water and I ask for a bottle of still. I ask her to take the cups away and she goes \"NO I can't.\" WHAT???? How can a restaurant have such bad customer service? While taking our order, she didn't even wait for us to finish and walked away!! What?? At this point it was obvious we were irritated and when my husband looked up, the hostess and the waitress were looking at us and talking about us. We were ready to leave when another waiter came up to us, and kindly asked us what happened. We explained and asked if maybe she was having a bad day? He told us \"yeah she was pretty wound up before you guys.\" She was having a bad day, so we get the attitude? Not normal and unprofessional. The only high light was the waiter who came to check on us after her. He was really sweet. The food was really good, loved the pasta al limons with arugula and the fusilli al pesto was also amazing. Wish I could give more stars but very upset with the way things went.", "author": "Angelica H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-03", "description": "What a lovely restaurant! The best Italian food I've had in New York! Everything was amazing: people who work there, ambience, wine, and of course the food! \nGnocchi with butter and sage are indescribable, so so good.\nAnd don't forget the dessert, the tiramisu is a real melt-in-your-mouth experience", "author": "Karina P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-11", "description": "Just ok. The service was good- waiter didn't come by too much, but seemed a little annoyed when we weren't ready to order and needed some time to think.  Then, he never came by once food was delivered to offer cheese atop the pasta.  Food was ok- my fettuccine was actually NOT al dente (as other reviewers have complained), it was a bit over cooked.  Probably won't be back, but had to give it a go.", "author": "Cristen H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-14", "description": "Went this place 4 month ago we had some like local fish was not so good also the pasta was pretty Standard nothing special flavor", "author": "Ndr N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-24", "description": "The food wasn't horrible but for the price it wasn't worth it. The WORST part of the evening was the service. The waiter never came to check and see how the food was after he dropped it off. We were drinking water and they never came to fill up our drinks once. I asked one of the servers assistant and he said to me \"Don't worry, i didn't forget about you... I will be right back.\" He said it with an attitude and just as you guessed it, NEVER CAME BACK. The waiter walked by our table a hand full of times and never asked \"how was your meal or would you like dessert?\" So after 15 mins of waiting for some recognition, I asked for the check. He came back i instantly gave him the cash and when he dropped off the change what do you think he said to me??? NOTHING. No thank you for coming, have a great evening or anything. BEWARE. These other reviews of the restaurant are bullshit. They probably got paid to say that. I promise you that. Worst restaurant experience TO DATE.", "author": "Travis S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-25", "description": "How does this place have good reviews? The food is just ehhhh-ok (more toward the ehhhh.) Please try Forno Rosso (it blows this place away and has a better selection.) I've tried the same things at both places and certainly will not be back to Noodle Pudding, despite being only a few blocks away. Got lasagna, tagliatelle, gnocchi and the salumi cheese app- best thing was the salami on the app. The lasagna was decent, barely any sauce mostly meat and no cheese, but it was still not bad. The tagliatelle was a little under al dente, so it didn't really feel cooked and the gnocchi was luke warm which is a shame because it was in a butter sauce and no one wants to eat congealed butter. \n\nThe service was also bad. My server first checked on us after our plates had been cleared for quite some time, we'd had empty drinks since the app- good thing I had a water bottle lol.\n\nSkip it... OH AND it's cash only.... Definitely skip it\n\nAlso forgot to mention the wait was an hour at 5:45 on a saturday- so get there when it opens or a bit before- if you must try this place\n\nKids EVERYWHERE", "author": "Bethany W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-06", "description": "Cozy, value for money, unique italian cuisine. Calf liver was interesting. Fish entrees were delicious! Trendy place and gets really packed by 7pm. Awesome service", "author": "Panganiban A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-09", "description": "I recommend the gnocchi, pasta dishes and the mussels, they are awesome and delightful options. Service is fine but not so great.", "author": "Gary S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}