{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-27", "description": "A timeless little nook in the beautiful neighborhood of Brooklyn Heights. The all over 50 year old male staff, atmosphere, recipes, menu are a time warp, but a good one! Delicious large rigatonis in an oxtail ragu and fettuccine with seafood were superb, and maybe only slightly over salted. Wine selection was robust, but only a few by the glass options. Cash only and affordable. I appreciate this restaurant and will be returning.", "author": "Alex R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-07", "description": "Increased prices and complicated a menu that was simply great. Good portions but this \"try to modernize simple family Italian food\" is not really fitting. Still good food, just a turn to modern era...", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "Outstanding experience tonight at Noodle Pudding. Fantastic atmosphere, great service and phenomenal food. We had the Calamari, Endive salad with Spicy Walnuts and Gorgonzola, Rigatoni with Eggplant and Spinach Ravioli. Finished off the dinner with an espresso chocolate flourless cake with fresh whipped cream that was amazing. High recommend a stop here if you are in Brooklyn. Followed it all up with a walk across the Brooklyn Bridge.", "author": "Troy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Great place, fabulous food, friendly service. Cash only, no reservations so be prepared to wait but we'll worth it.", "author": "Ron S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "This is the kinda place with great food and you simply feel at home. Kids spill milk on the floor? It's all good. It's homey with out too much homey-ness. Just go.", "author": "Sam Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-10", "description": "A great standard but fell far short the other night. Endive salad dry. Gnocchi butter no sage. Eggplant pasta good. \n\nVery surprised as one of our Italian stalwarts", "author": "A B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-06", "description": "Besides the name which I've never been quite sure of- it's a solid neighborhood staple. It's usually very busy so get there early or late if you don't want to wait because it gets hectic. The lasagna is always on point as well as their meat dishes. I like the pork chop, comes with cherry peppers and a solid mashed potato. The tiramisu is a must. Expect courteous service but a no nonsense attitude. Appreciated the raised eyebrow when we wanted the pork chop medium well ( I know I know) we settled on medium to medium rare and it was perfect. Prices are reasonable but minus one star for cash only.", "author": "Ray C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-26", "description": "UGH. Food was so overpriced and bland. Can't believe I paid $80 for pasta and 2 glasses of wine.", "author": "C. P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-25", "description": "CASH ONLY. YOU MUST BE A REGULAR TO RECEIVE GOOD SERVICE. Completely ignored by the bartender for over 10 minutes while he waited on every other individual at the bar -making sure all the regulars had their the place settings, waters with lime and lemon, and second round of drinks.", "author": "Emily H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-06", "description": "I'm not a pasta fan (I find it boring, not bad) and my gut said to give this place 3 stars. But logically its too well priced for that. This is as solid a 4 star place i've ever been too. Fun atmosphere, good prices, quick service, consistent food, did I mention good wine prices? \n\nI highly recommend this to people that like pasta, red wine and some authentic italian attitude with out NYC prices.", "author": "B C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-03", "description": "Got here because someone recommended it. Read the menu and it said no Credit Cards accepted, so we almost left, I am glad we stayed the place and the food were great, fresh pasta good wine, delicious bread. You can tell its a place where people go and become regulars, they stay because the food is great and it's a place for conversation and enjoying your food, no rush.\nSo, there's an ATM a block from there, get money out and enjoy this cozy place.", "author": "Juan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-18", "description": "This restaurant came up on our Foursquare app and I immediately saw a review of amazing gnocchi's. So we headed there on a Thursday night and were seated right away. This is your old school, NYC type of Italian restaurant (at least in my mind, I'm an Italian from CA). The place was hopping, the bar was full and it just gave us a homey- cozy feeling. \nOur server was amazing, wish we knew her name! Sweet but no nonsense. And yes CASH only, there is an atm down the street. They also take checks..\nWe had the gnocchi- both ways, RIGATONI ALLA SICILIANA, and Pesto noodles. ALL were amazing but our favorite was the gnocchi. You have to try it out! We also split the tiramisu for dessert and it was really tasty! Oh and for starters their bread and olive oil dipping sauce is really good. We also had the kitchen sink salad! \nI highly recommend this to anyone in the area visiting. The prices are very reasonable and the overall experience is just wonderful!", "author": "Lisa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-26", "description": "Good food is worth waiting for. Local, farm fresh organic and delicious Italian food without the pretentiousness. Warm, inviting staff. No sign out front but look for the hordes of people waiting. \nAs a person that hates tomatoes when I come to Noodle Pudding I eat a whole plate of them. Their food is delicious and prepared and balanced excellently. Cash only. Service is attentive without being overbearing. It's simply the best Italian food in Dumbo and Brooklyn Heights.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-09", "description": "Having lived around the corner for 6 years we finally caved and braved the crowd at Noodle Pudding. The hype of this place may be skewing my  review. With all the buzz \"how have you never been there\" , \"it's heaven\".......etc., our expectations were  probably unrealistic. There is NOTHING wrong with Noddle Pudding. It is perfectly adequate. The meal was solid Italian fare. The appetizer (Calamari and Anchovies) was a bit oily but satisfying. Our entrees were fine. (Seafood linguine and rigatoni with egg plant). The staff was attentive with water and any thing else you might want. I'm having a hard time writing this as there is nothing wrong with this place . That being written, what's with all the hype and \"house rules\"? No reservations, cash only, a total scene ....... it's just a good neighborhood Italian joint. I will for sure go back but would not wait for a table . The neighborhood is \"turning\" exponentially with other choices . Bottom line, if you're looking for good Italian and can get a table ; go. If not there are many new places to choose from.", "author": "Tom Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-17", "description": "Noodle Pudding happens to be my 1000th Yelp review...it's been ten years since I started writing reviews and I wanted this one to be super special. I've been wanting to try Noodle Pudding for five years (what's been stopping me, I know), ever since I moved to Brooklyn Heights and a friend recommended this restaurant. I finally made it! \n\nMy friend and I went for dinner on a Friday night. We knew to get there early since they don't take reservations, and we definitely just beat the crowd by arriving around 6pm. \n\nThe restaurant is located on Henry Street near Henry's End, but it's a bit hard to find since it has no real sign. When you walk in, there is a small front dining area by the window, then tables near the bar, and a larger back section. Most of the tables are two or four tops, but larger groups can be accommodated. \n\nWe started our meal with some prosecco, wine and garlic bread, which I really enjoyed. It had a bit of a spicy kick to it, which I liked though my friend found it a bit too overpowering. For our entrees, we took the recommendation of our friendly server and ordered some of the homemade pasta. I opted for the Fettuccine with Clams, Mussels, and Shrimp in a red sauce and my friend tried the Tagliatelle Bolognese. Both meals were nice-sized portions priced around $13 - $19. I loved my meal, but would have preferred a white sauce with the seafood. \n\nThough the restaurant was very busy and there was a line of people waiting to be seated, we never felt rushed. We even stayed for dessert, getting the Bread Pudding and a second round of cocktails. \n\nOverall, I really enjoyed my Noodle Pudding experience, but I wish they took credit cards.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "Best place we have eaten in Brooklyn, great atmosphere, food and servers. \n\nWe wish we had bough more cash for desert!", "author": "Harmony S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-05", "description": "One of my favorite places to go in the Heights, some of the best food in the area for fair price for what you're getting.\nOnly thing to keep in mind though is that they do not take card and they do not take reservations, so you either ought to avoid the busy weekend nights or just shoot a little early. You can always sit at their bar and warm up your appetite too!\n\nExcellent food quality, great service, only positive things to say about this place. Great restaurant to bring a date or visitors too.", "author": "Ayla A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-22", "description": "My friend and I were looking for somewhere in the area to get Italian food on a Saturday night and found this place on Yelp. It is so hidden without any signs that we walked past it twice! We were lucky we came right when it opened at 5:30 because around 6:30, we noticed it was a full house and there were people waiting for tables. \n\nWe got the tagliatelle bolognese, a pesto green pasta  and an eggplant lasagna style side dish. The food came out fast for us, maybe because we were one of the first ones there. However, both pasta dishes were only lukewarm.. the eggplant side dish was the only dish that was actually hot. The sauce for the pasta is on the low side -- just enough to cover each strand of pasta and not a drop more. My friend, who likes pasta sauce, wasn't too thrilled about this. She actually liked the olive oil, tomato dip for the bread better than the entrees. I thought the pasta were OK but I liked the eggplant side dish the best -- if only it was a little bit bigger!\n\nTip: You can order half size pasta dishes if you don't want as much.", "author": "Yookyee W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-01", "description": "I enjoyed this restaurant.  For an appetizer I had a huge tomato with mozzarella salad.  It was great.  The tomato was very fresh and juicy.  I had the spaghetti bolognaise which was very good.  The portion was a little small.  For dessert I had a delicious tiramisu.  The biggest drawback was cash only.  The atmosphere was cute and quaint.", "author": "Melanie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "Antonio is the best.  His food is pure and as he says e come sei a casa.   Bravo tony", "author": "Peter M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}