{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-26", "description": "Nice place. Decent food. Would come back when it isn't crowded.", "author": "N S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "My friend was visiting from out of town and after not being quite sure where the restaurant was, we found Noodle Pudding :) What a wonderful surprise. We'd heard good things but this exceeded all expectations. It was a Saturday night, we were told there would be a 20 minute wait (that was accurate) and we're glad we stuck around. The place was super busy but the wait staff was very attentive. We ordered the endive salad, the fettuccine with seafood, and the pappardelle with oxtail ragu. After getting the complimentary bread and olive oil, we got our entrees (seriously- like 10 minutes later). My friend mentioned that we hadn't gotten the salad we ordered and the waiter was suuuuuper apologetic and said he would make it up to us. This is where things went from delicious to spectacular. In addition to the great entrees (the dishes were well seasoned, piping hot, the pasta was house made, the oxtail meat was tender...), we also got the following complimentary items: a fava bean side dish, two desserts, and two cappuccinos. The staff went above and beyond to make sure we enjoyed every moment of our evening. What a great way for us to spend a Saturday night. We'll definitely be coming back and highly recommend others give the restaurant a try.", "author": "Jess J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-26", "description": "With a name like noodle pudding i was expecting either a Chinese restaurant or a Jewish fusion place\n\ni was pleasantly surprised when i saw the menu. everything  on it sounded amazing, but the shrimp and artichoke risotto....fantastico!\nalthough i normally prefer my artichoke with a bit more zest, this was good nonetheless. \n\nthe service was on point , but the no credit card thing was a bit odd. but i guess its the \"in\" thing now since so many places are starting to get on that band wagon ( dont they realize that noone carries cash anymore???)\n\n\ni am eager to come back and try some of the other dishes, and of course help myself to one of the most delicate and delicious panacotta with berries i have ever had.\n\njust thinking about it makes my mouth water.", "author": "Mabel P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-20", "description": "With a name like Noodle Pudding, I was a bit reluctant...but hey, why the hell not!\n\nI went with a group of six for my birthday early this month and the food was great!  I am still thinking about the endive, walnut, and goat cheese salad today.  Add the grilled calamari to the mix and you're good to go.  We also had the penne and grilled fish and two bottles of wine.   Of course I didn't pay because it was my birthday but the total still came up to only $30/person.\n\nI only gave it four stars instead of five because our waitress was a bit distracted and spacey.  She was helpful but she seemed rushed the entire night.", "author": "Kathy H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-21", "description": "Food 2.5\nService 2\nAmbiance 4\n\nO/all 2.5\n\nShocked by the reviews and the score for this place. Service was slow and nothing our table ordered was that good. The best dish was the free bread with the spicy oil.  My seafood pasta was terrible. The pasta itself had the right texture reflecting homemadeness and proper cooking but the seafood and sauce caused me to give up on the dish. The sauce was too salty, shrimp was overcooked and the clams plus mussels had some weird taste.\n\nOur mussels in red sauce failed to impress as well.", "author": "Pat R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-16", "description": "I have been here many times and every time it is great. This place is my favorite Italian restaurant in Brooklyn. The only down side is the limited desert menu and it is a cash only place, so hit the ATM before.", "author": "Jeremy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-17", "description": "Tried out this place for dinner last Friday around 7:30 and hooray! No wait! I ordered the gnocci with mozzarella and tomato sauce, and it was just delicious. And awesome. Plump little pillows of awesomeness that melted in my mouth. The dish tasted extremely fresh and surprisingly light - no pools of grease at the bottom of your plate here! Portion sizes are just right - enough that you're full but not keeling over. \n\nService was super fast and attentive as well. The only catch is it's cash only, so stop by the ATM beforehand.", "author": "Gloria C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-16", "description": "This place is actually a clear 3.5 star place. The food is quite good, though in the three times I've been there, each time I've felt like I missed the really good thing on the menu. Every entree I've had has been on the good side of acceptable. Their wine list is both good and about as reasonably priced as you can imagine multi-course restaurant being.\n\nHowever, the service is relaxed to the point of being non-existent when you're at your table, but especially coming in the door. People are milling around in the doorway all the time and you don't know if they're in line or have already given their names or what, and no waiters or waiters bother to come up and get your name, so you have to flag someone down and give your name. It's extreme in a way that I haven't seen at a restaurant of this caliber before, and it's quite irritating. That lack of attention carries over to when you sit down. YOu might wait 15-20 minutes before you get to give your wine order, and if you have any questions about the menu they'll get answered, and then you'll get another 15 minutes before you get a chance to give your order.\n\nyeah, it's nice that they don't rush you, but I prefer to have this stuff happen _after_ I've gotten my food, not before.\n\nAnyway, the service is good when it pays attention to you, and the food is good when you get it, and they don't cram you in when you finally get to sit down.\n\nBut, oh yeah. Cash only. Can you believe that there's still a place that costs on average of $60 a person and doesn't take credit cards? It boggles the mind. I guess they don't want to pay the half-dollar or whatever it costs for transaction fees.", "author": "Chris S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-09", "description": "My fiance wanted to take me out to a special dinner and since we are new to the neighborhood, we are very interesting in trying a lot of the local restaurants. We had passed this place a lot, but because there is no name on the outside, we could never remember to look it up. \n\nI was pleasantly surprised by this restaurant. At 6pm on a Saturday night, I was not expecting it to be so crowded, but we were able to get a table right away. We ordered the fried calamari, mussels in red sauce, the swordfish and straccetta and everything we ate was so delicious. We came to the restaurant starving so we finished the bread very fast, but we slowly enjoyed the rest of our meal.\n\nThe service was a little slow - it appeared that there was only one waiter and many servers, but he was pleasant considering how busy he seemed. It was a beautiful evening and I can't wait to go back.", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-04", "description": "Was looking for a good Italian restaurant nearby to take my fiancee out on a date this past Saturday night and saw all the great reviews for Noodle Pudding and decided to give it a try and I am SOOOO happy I did. Both of us absolutely loved this place. The next day my fiancee couldn't stop talking about how amazing dinner here was and she even said, \"That was one of the best meals she ever had.\"\n\nSo here's what we had: First, the complimentary bread and olive oil was very nice and as soon as one of the servers saw we finished off all the bread before getting our appetizers (because we we're starving!), he asked if we'd like more, which we agreed to.\n\nAppetizers: She had the Fried Calamari, which both of us thought was some of the best calamari we'd ever eaten and we are avid calamari-app-eaters. I had the Mussels w/Red Sauce, extremely tasty and good size portion. The sauce was so good after eating all the mussels I spooned up all the sauce like soup. Yummy!\n\nEntrees: She had the Swordfish, which was exquisite. Swordfish can often be bland or very dry if not done right, but the swordfish here was juicy and very tasty. I had the Straccetti, which I had never had before but I absolutely loved it and the salad on the side complemented the thinly sliced beef perfectly.\n\nWe have been living in the Brooklyn Heights area for 6-months+ and this is by far the best restaurant we've been to so far. In fact, we have already planned a second trip here for dinner in a couple weeks. It's obvious that others feel similar to us about this place as the restaurant was packed on the Saturday night we went, but our 2-person table was available right away and the staff was very kind and courteous. Would recommend to all food lovers either for an intimate date, with family, or group of friends. Well done NP!!!!", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-08", "description": "3.5 stars.\n\nbetter than your average, run-of-the-mill, queasy-feeling-after italian restaurant, but i still prefer the type of italian restaurant that serves more inventive dishes than just pasta and chicken parmigiana.  nevertheless, our food was very tasty -- i had the [type of pasta i can't remember the name of] with eggplant and fresh ricotta, and my bf had the gnocchi.  both were quite good, but still very carb-heavy. at least the portions were moderate, so it wasn't an obscene amount of food, but i can't say it's our favorite restaurant on that block.", "author": "Lily T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-17", "description": "I think this place is fine. Nothing really to complain about, but i don't understand why people are giving it 4\u00265's. It is good but definitely not great.\n\nAlso, they don't take reservations, so be prepared to wait 30-40min.", "author": "Sachin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-14", "description": "Happy Valentines, Noodle Pudding.  The place is bedecked with decorations, including Valentines hearts with crayoned names posted on the mirror behind the bar.  It was cheery if crowded on Friday night, when my wife and I made one of our occasional pilgramages there.  When we were courting, she lived just around the corner, and it was our favorite spot, by turns romantic and comfortable.  As a result, it is in the running for my \"favorite restaurant of all time\" status.   The pastas are always excellent.  I had the rabbit and a simple arugala salad to begin.  The fairly priced Primitivio was warm and rich.   The owner inadvertantly bumped into my wife, and as recompense sent over a dessert.  My only complaint is with the failure to take reservations, but I suppose the managment has its reasons.  Splendid, once again.", "author": "Mark M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-02", "description": "Great pasta. I try a new pasta dish almost every time I go there and I have yet to be disappointed", "author": "David W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-19", "description": "Great, honest food in a casual atmosphere at reasonable prices. The lasagna, carpacio and the stracetti (filet minon pounded thin and grilled on one side only leaving the other side completely raw) are major hits that keep me coming back. The only downsides are (1) cash only and (2) no corkage fee option despite a limited wine list. \n\nThey don't take reservations, but the restaurant is fairly large by Brooklyn standards and I have never waited more than 20 minutes.", "author": "Alex B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-13", "description": "It started because I had never walked across the Brooklyn Bridge. Its just something as a New Yorker you should do while you live there. Its a great experience but when you finish you are going to be hungry and what better way to refuel than a fantastic italian meal. Fresh food, great service, good prices. You should give it a try!", "author": "douglas B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-30", "description": "If you can find this place (there's a very faded sign near the door) it's a nice quiet restaurant for dinner. You can tell it's a favorite with the locals since it's also the most crowded restaurant on the block, even in the early evening. They only take reservations for parties of 6 or more, but there seemed to be plenty of tables in rear of the restaurant, we ate near the window. The deboned and roasted chicken and potatoes were cooked perfectly, as was the Lasagna. Mixed green salads were exactly that, no other vegs. Service was exceptionally friendly, fast, and professional and I was introduced to a locally brewed KelSo beer (on draft) that is now another favorite. The only complaint I have is that they mistakenly threw away my doggie bag....;-(  All and all a great neighborhood restaurant that we hope to visit again. Didn't know it was CASH ONLY. -- so we were limited, but it was worth it....", "author": "Dennis F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-24", "description": "cute italian place with good food, decent prices and great ambience. cash only -- so exotic in 2013! probably the best in b'lyn heights after henry's end. less comfortable than jack the horse tvrn., but better value-for-money.", "author": "Per P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-19", "description": "I absolutely LOVE this place. I force all my Manhattanite friends who refuse to \"trek out\" to Brooklyn to come just so they could try the awesomeness that is Noodle Pudding. It is also one of the first stops of my personal NYC tour for any guests I have in town (before taking a stroll along the Brooklyn Promenade, of course!).\n\nI've been here several times, and I have yet to be disappointed with my experience. The service is great (though at peak hours, you do have to track your waiter down sometimes); the wait staff are all extremely friendly, attentive, and knowledgeable about the dishes. I usually order from the specials (which have been different each time I've gone! amazing!), because I like trying new, creative concoctions. Their attempts to innovate are definitely not futile as the fresh ingredients blend beautifully together into a heavenly dish. From the daily menu, the mussel appetizer was spectacular as well as the organic roasted chicken entree. The complimentary bread with the dipping sauce is also amazing, that it takes a lot of restraint not to ask for a 2nd (or 3rd) helping before the main course. And, of course, we can't forget dessert. Make sure you save some room for a sweet conclusion to your meal as the desserts are equally pleasant to the palate. If you ask me, there's no better way to wrap up the evening than an extended conversation with good friends over a light, delectable dessert avec un cafe.\n\nWarning: Make sure you free up a whole evening when you plan to pay Noodle Pudding a visit, because you can't help but stay for hours and hours to soak in the fine food and cozy, cheery ambience!", "author": "Esther C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-24", "description": "Fresh pasta! Great feel! Great staff!!!  Beautiful food!!! Authentic Italian food! Best hidden Italian restaurant around. Worth traveling over Brooklyn Bridge.", "author": "Erik G."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}