{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-30", "description": "This place is great! Excellent food, bustling atmosphere, and friendly wait staff. The bread and whatever-it-is-that-they-give-you-to-dip-the-bread-in were the highlights of the meal, but our entrees were also very good. We will certainly be coming back.", "author": "Dan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-14", "description": "the best reataurant in the world!\nthis place gets better and better.\nevery appetizer and main course - from the bread and oil to the deserts - you cannot beat this place.  what I find funny is as left I see that it had a B rating and walked another block and another place which I have yet to see one person in had an A rating! just goes to show how alot of people in all business go through the nonsense.  anyway, I am one of the most picky people in the world with everything - especially what I eat, and you can take it from me, this is the place to be.", "author": "John D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-15", "description": "went again on a sunday for a change, food was good.\nbut people please, for christ sake leave the freaking babies at home. they always cry and are freaking annoying to have to listen to while eating dinner.\nIt think it is so rude that parents do this. its unfair. babies cant help it but parents can.\nthe place was crowded, the owner gave us free deserts and is a very nice man.\nbut this is not for me.", "author": "Adrastos C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-23", "description": "Pros: The food is amazing. Great Priced - ordered the $1 meatballs, $1 riceballs, garlic bread, fried calamari, and the rigatoni alla sicily (w/ eggplant) and the bill came out to $75. Was stuffed at the end of the meal! Really authentic italian. The meatballs are a favorite. The rice balls a bit too lemon-y  for me. The fried calamari, garlic bread and pasta dish were amazing. And the 'free' bread they give you is so soft and yummy. The service as far as refilling the water glass and checking on us frequently was very good.\n\nNow to the Cons: Came on a friday night. Told that there was a 20 minute wait which ended up being an 45 minutes to an hour. The host/bartender service isn't the best; took us 20 minutes to order a bottle of wine at the bar; $29 bottle of Cab Franc. The way the seat people is confusing. People who had just walked in the restaurant would get seated right away and we had been sitting there for 45 minutes. They don't take reservations so you have to just got there and wait. And CASH ONLY no credit cards. The wooden chairs suck and are super uncomfortable.\n\nMy Suggestion would be to go on a weekday when it's not busy because Friday and Saturday it's packed and not very enjoyable until the food comes that is.", "author": "Rhea D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-04", "description": "This place is  a must try ! It's hard to find since there's no sign but believe me it's worth it ! My favorite pasta dish there is the Gnocci , they are so accommodating and prepare it any way you'd like. April is usually our waitress and she's so funny ! Just be prepared to grab a drink by the bar and wait for a table !", "author": "Lauren V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-06", "description": "Had the Fettuccini with a bolegnese sauce. really good. Best ever. Pasta was done just right. Will go again.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-03", "description": "Came to celebrate my birthday and brought family visiting from California (with 3 teenage children).  The food, as always, was delicious.  The lasagna bolognese was, as the kids said, the best they ever had.  Same for the gnocchi with pomodoro sauce.  Loved the zucchini flowers which was something none of us had ever had before.  And the angel hair pasta with pomodoro was spot on.  The service, despite it being so very busy, was attentive, helpful and so pleasant.  And a candle-lit tiramisu was brought to the table and the owner and all the waiters sang happy birthday!  Love this place!", "author": "Lynne W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-08", "description": "AMAZEBALLS!!\n\nNoodle Pudding is everything you'd want in a homey Italian unpretentious neighborhood restaurant. From the dimly lit dining room to the quaint decorations in the bathroom, everything is set to make you feel like you stepped into a warm and inviting environment. \n\nPeruse the main menu, which is fairly small, to the daily specials, which is large and diverse and really get a feel of what you want before ordering. \n\nLast night, some friends and I shared the Mushroom Tortellini (a daily special), which was some of the best pasta I ever had with a very light and perfectly salted mushroom sauce with chopped, firm mushrooms. I had the Fettuccine with Seafood Ragu, which had ample seafood with giant Mussels. My friends had Rigatoni with Eggplant and Ricotta and the Fluke with white beans (a daily special, I think). The bread with sun-dried tomato and olive oil dipping sauce that came at the start of the meal was divine. I was trying my best not to scarf all of it down, taking more than my friends and filling me up before the real meal. The Pear and Ricotta cheesecake that our waiter suggested was divine. And House wine for $4 a glass, yes please!\n\nNow I'll admit our server was a bit stiff, but we got just enough attention from him and the manager. And you know those rare busboys that keep a restaurant really on-par service-wise? The ones that pick up your scarf when it falls on the floor, keep your water glass full, make sure you have bread and dip, take your plate or wine glass away at exactly the right moment, with you barely noticing. Yea, THAT guy. He was really at the top of his game on the night of my fantastic Noodle Pudding dinner. Amazing. \n\nNote: CASH ONLY!", "author": "Patricia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-04", "description": "Ok, I have to update my review because this place is absolutely fantastic.  I have now been here 5 times in 3 weeks and I am going to continue to update that count.  EVERYTHING I have eaten here is F\u0026$king amazing.  I can't go through everything with adjectives because I would run out.  But I have had the following dishes that stand out and haven't been let down:\nStracetti, Tagliatta, Pappardelle with Mushrooms, Mushroom Tortelli, Lasagna, Bruchetta, Flourlesss chocolate cake.  \n\nEverything was just absolutely outstanding.  The service is awesome.  I am learning all the wait staffs names and they already know mine.  I take everyone that comes to my neighborhood here and will continue to do so on a regular basis.\n\nRemember that it's cash only and bring your appetite.  But seriously, don't fill up on the bread no matter how good it is (and the olive oil that comes with the bread is ridiculously good).  It's always about a 20-30 minute wait, but the wait is always worth it.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-13", "description": "Their pappardelle with yellow tomatoes and goat cheese was some of the best pasta I have eaten, ever.  Lasagna was also very good.\n\nAs other reviewers noted, the service was only OK, specifically we needed to wait a  while for our order to be taken.  Still, I felt all the staff had a genuine desire to help and were  friendly.\n\nThe atmosphere was low-key, comfortable, not loud.  Good place for a date, a casual dinner with a friend, or a big group dinner (there was even a couple of children, who remained extremely well-behaved and quiet).\n\nCash only, and reservations can only be made for 6+ people.", "author": "Timofei G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-22", "description": "This was a completely charming place in Brooklyn Heights. The waiters we so accommodating and had great suggestions. The bruschetta was absolutely delicious! We also loved the wine selection at this place. Cannot wait to go back!", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-14", "description": "Can't go wrong with this cash-only, first rate classic Italian restaurant.  This has long been a family favorite.  All the pastas are incredible.  The gnocchi, lasagna, and seafood pastas are amazingly delicious.  Try the seared steak sliced over fresh arugula.   There are always great specials.\nThe fresh fish is the freshest best fish we have ever had at any restaurant in the city.\nTiramisu and limoncello for dessert and you are good to go.  Prices are totally reasonable. But be prepared got wait -- this place has a big following.", "author": "MIranda M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-16", "description": "I don't understand what's the hype about. The food was not tasty, mediocre at best. Very loud, impossible to hear a person sitting at the same table.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-02", "description": "If you see the duck and mushroom ragu on the menu-order it. It is so so good. The seafood pasta is really good. They have gluten free pasta and they're super friendly about it. Last night they had a fava and dandelion special-it was amazing.", "author": "Bee C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "Great neighborhood place. Casual atmosphere. We come here every once in a while after a stroll at Brooklyn Bridge Park. And we know we will get a homey and satisfying Italian meal.\n\nUsually there is a wait, but in general, the times that we've been, we've waited less then 30 mins. We would usually start our meal with a bottle of their house red, priced at $14-15 a bottle, it's a decent bottle of wine and that's what a neighborhood spot should be.\n\nThe bread comes nice and warm, with accompanying side of extra virgin olive oil flavored with tomatoes, peppers, garlic. The ingredients they use are fresh, you will notice when you try their meat or fish dishes. The homemade pastas are what we usually order. Very satisfying flavors and well portioned. The pastas are cooked well, and they are well seasoned. By the time we finish our meal, we are generally stuffed, so we have not tried their dessert.\n\nDefinitely will come back again.", "author": "Bruce K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-01", "description": "Used to come here about once a week.  But I think the hood has just become too crowded for them to accomodate. Have been treated poorly three times now and the food has been going down in quality... Head over to Bevacco down the block. I am happy to report that after being really awful for a long while, they hired a new manager and are much much better now. And they have WAY more space.", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-24", "description": "Food: The complimentary bread is delicious and the dipping olive oil is superb. Their Gnocchi with butter and sage is one of the best I've ever tried, and their Rigatoni Alla Siciliana is really great too. It's not the type of cheesey, oily Italian, they have very traditional dishes. My carnivorous friends enjoyed their dishes as well. \n\nService: Attentive, friendly, and some actually speak Italian! \n\nCost: Fairly inexpensive.   CASH ONLY\n\nParking:  Pretty bad.\n\nNeighborhood:  I love Brooklyn Heights.  Walking around the neighborhood on a nice day is an added bonus since you're right by the water.", "author": "Rebecca R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-08", "description": "Homemade burratta was ridiculous (In a good way); gnocchi was light and fluffy; eggplant delicate, crispy and melt in your mouth ... Service friendly, warm and non-rushed (despite the madness of a line waiting for tables). Loved loved.", "author": "Sabrina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-22", "description": "Wow. I've lived in Brooklyn for most of the past 25 years and had never been here. It was great. Great food, service, value. Excellent for kids. The place fills up as soon as they open on Sunday evening. Fast turnaround. Can't wait to go back.", "author": "Eric S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-14", "description": "I'd give no stars if I could. This is CRAP food and what's more infuriating is the snobbery of their staff!  Our waiter treated us like second class citizens. Who knows why, but he assumed we weren't going to spend money.  Not to seem mean, but the customers seem old and a bit bland.  The waiter rushed us to order and gave us very short one word answers on any questions that we had about the food.  The biggest regret for us was that he didn't tell us the specials.  So we ordered something from the menu.  Then not but 5 mins. later, he proceeded to read off a long list of specials to the table right next to us.  I would have liked to order something that was fresh, but never had the chance. As I said, the food was very crappy!  The waiter was a jerk!  We normally tip 30-40% for good service. What a mistake that idiot made. I guess we have to be 75 years old to get good service.", "author": "Tia M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}