{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-21", "description": "In the mood for Italian and wanting to try something new in Dumbo, we headed to Noodle Pudding. To our surprise, it was really busy and we had about a 40 min wait. The atmosphere takes you back to the early 90's, which is a precious thing in this city.\n\nWe started with two glasses of red wine, a simple salad, and one of their specials of sardines stuffed with raisins and some sort of breadcrumbs. For our entrees, the BF had an artichoke pasta dish and I had the rigatoni Norma. No complaints on either, but his was tastier than mine. For dessert, we shared a slice of their airy Ricotta cheesecake.\n\nWas it the best Italian food in the city? No. But if you're looking for a warming spot to fill up on some hearty Italian food without breaking the bank, then Noodle Pudding is just right.", "author": "Danielle M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-21", "description": "Noodle Pudding.  If you saw that name in most places, you'd be like - gross.  But somehow the Brooklyn Heights staple made it work, and for many years.  I think at one point the food was very good and so the name didn't really matter - at least it was memorable. But all that has changed, and now the Henry Street landmark has come back around full circle to put the caliber of the restaurant back on par with its cheesy name.  \n\nHaving not been there in several years, I took a date there for Valentine's Day, 2019.  To my credit, I suggested we leave after taking in the dozens of tacky red balloons which were floating on strings over the dining area, coupled with cheesy heart stickers all over the walls and bad lighting.  It did not feel like the romantic ambiance I was looking for and was already an anticlimactic buzz kill as I was looking forward to revisiting what I remembered to be a pretty solid Italian joint.  Moral of the story part 1: follow your gut.  You know, the \"blink\" mentality - it works.  We should have left.\n\nInstead, we stuck around and ordered an endive/goat cheese/arugula salad, burrata, pappardelle with braised short rid, and a Valentine's Day special, heart-shaped beet/squash ravioli.  We also ordered a local Cabernet Franc from the Finger Lakes - from Red Hook Winery - the highlight of our meal. \n\nEndives are strong and bitter, and delicious.  But you have to know how to use them, and how to balance flavors.  Noodle Pudding didn't get the memo, and clumsily sliced whole endives rather than peeling the leaves off, so that the taste overpowered everything, even the arugula.  It was just a pretentious mix assembled without any discerning taste.  Then came the burrata - served so cold it could have been out of the freezer.  When I complained to the waitress, she said, \"oh, it's supposed to be served that way.\"  I assured her it was not, and, to his credit, the chef later came out and apologized, and agreed that burrata should be served warm, or room temperature at a minimum.  The heart-shaped ravioli was an embarrassment - the flavor was mediocre, and I think there were about 7 ravioli on the plate - and not even heart-shaped, but circular.  They were slathered with a heavy cream sauce that was just wrong on so many levels.  The pappardelle was a little better, although the portions were small and the pasta was cooked a minute or two past al dente.  Was I really at Noodle Pudding?  About three-quarters of our way through the meal, someone realized that they should at least pretend to have a romantic setting, so they dimmed the lights.  A small comfort after I spent half the night grabbing balloon strings that were floating by my head and swinging them out of the way.  \n\nStill, the tasteless food and cheesy ambiance didn't seem to deter the Valentine's Day crowd, who for whatever reason were still lining up at the door.  You can't teach taste - and maybe an established restaurant has enough cache to make people think they're eating someplace special - but Noodle Pudding was anything but.  Although I didn't use the restroom, my date did, and she told me they had bad Yelp reviews lining the hall outside the bathroom in some attempt at being ironic.  It was ironic, indeed, but not in the way they had intended.  I was completely floored at what a tacky, mediocre experience this old neighborhood gem has turned out to be.", "author": "Eric J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-01", "description": "Thought NYE would be enjoyable here. NOT.\nFood was terrible and owner couldn't give a damn.\nReservations for $105 per person we paid and then we notice the owner allowing people off the street coming in to fill up empty seats at about 11:00pm just to have a snack or desserts.\n\nDear Tom:\nYou have soiled my memories of a past fine Italian restaurant with your SCAM of a New Years Eve.\nPoor excuse for customer service when we complained about your poor excuse for Filet Mignon and Duck.\n\nRemember us? I know you do. And then to sit 6 children right in front of us at about 11:30p was real class.\nEven Marty Markowitz was pissed.", "author": "Betty O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-05", "description": "On my first occasion at Noodle Pudding, I gave it five stars. The service was excellent, the staff friendly, and the food delicious. I told everyone I knew how amazing it was and that they had to try it. But, on my most recent visit, I waited over and hour and a half for a table for three, without much explanation. After searching for the person to put my name down with, I was told 45 minutes to an hour. Many parties who put their name\ndown after us were seated ahead of us and we were given no explanation as to why and our inquiries were rudely disregarded. After finally getting a seat, the wait staff was dismissive and cold. The food was not nearly as good as the last time. What an unfortunate turn of events.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-26", "description": "I wonder if the waiter I had last night is the same waitier in all the poor reviews to. (Guy with glasses, but not the younger looking one) He was terrible it took forever to get our main course out and the waiter didnt apologize. He seemed arrogant with no apology or any regret in his absence of being a waiter. We left a generous tip still because he seemed so arrognat that I assumed he has a  miserable life outside of work. Although the Host who sat us and checked in on us was marvelous and outstanding.  He deserves a full 5 stars for keeping it afloat. Quite disappointing in this experience.\n\nGo somewhere else. They aren't worth the hassle.", "author": "Isabella H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-19", "description": "The common saying \"Don't judge a book by its cover\" would seem to apply perfectly to Noodle Pudding. However, rather confusingly, Noodle Pudding doesn't even seem to have a cover to judge it by - there's no signage on the front of the store, no clues that inside these doors is a fresh, flavorful restaurant; almost as if you had gone home to your grandmothers and she had put out a place setting for anyone walking in off the street. While most restaurants try to burnish their family focused chops, Noodle Pudding puts it front and center, sourcing in ingredients from local farms in New Jersey and \"proudly\" not accepting credit cards. \n\nWe had the fried zucchini flowers as an appetizer, filled with ricotta cheese and lightly fried mixing salty and sweet together. For a main course, I chose the Fettuccine with mussels, clams and shrimp in a shellfish ragu sauce. Amazingly spicy with a full plate of seafood, each piece almost falling out of the shell, and coated in the ragu sauce, I didn't stop eating until the plate was clean. Finally over cappuccinos and espressos, we shared a delicious sweet peaches and vanilla ice cream.", "author": "Edward M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-05", "description": "Noodle pudding is a bright, rustic restaurant near DUMBO with delicious and affordable Italian food. \n\nI can't comment on a ton of the food - everyone got the Cacio e Pepe! It was delish. Just enough cheese, asparagus, and we all got an egg in the middle (it was extra $). \n\nService was awesome. We had a server who joked around with us and was overall very cool. We had some house vino with our meal, and bread is complimentary. \n\nA nice sit down spot after a walk across the BK bridge, or a night out with the ladies. Great bars nearby for after too.", "author": "Mary A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-27", "description": "I was looking forward to dining here and attempted on three separate occasions. Finally I gained admittance and no longer wanted to be part of the \"cool club\" when the wait staff was dismissive. The food mimicked the wait staff.  Great potential but scored average at best for me. Just a note- I enjoy authentic Italian cuisine and have lived abroad and travelled extensively...Our pasta dishes were yummy but not yummy enough to warrant the wait or the wait staff.  I am not sure if I will return.", "author": "Cara S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "I'm inclined to state that Noodle Pudding has been around for quite some time. Unfortunately with no website available (at least I couldn't find it online), I'm unable to actually note when they were established. In addition, I saw some conflicting menu prices and food selections through third party websites which added to some confusion.\n\nHere's the lowdown. My friend and I were enjoying a nice (albeit unseasonably somewhat chilly June) afternoon in the DUMBO area. DUMBO with its charming cobblestone layout is a haven for many great restaurants. I was showing my friend around and when a few other options became unavailable as far as dinner was concerned, we landed at Noodle Pudding---actually we were the first ones to arrive.\n\nThe atmosphere/interior was adorable with exposed brick, a small bar and many tables. Yet, once prime time dinner rolled around, you will find people waiting on a line for a table. \nAll the windows were opened for a semi-al fresco dining experience and as such, we chose a prime table.\nIt didn't take too long afterwards for the entire restaurant to fill up quickly--it's that popular.\n\nMy friend and I settled for wine by the glass. A rose was only $7 while the house white was $5.00. Great deal.\nCiabatta bread was served with a nice side of bruschetta toppings in a small bowl. I nearly devoured two of those small bowls!\n\nFor starters, we shared a Fritto Misto--with a twist (I'm accustomed to the zucchini sticks that I've always enjoyed)--fried calamari, fried anchovies and fried Shishito peppers (spicy). This was plentiful and quite delicious served with a side of spicy mayo. \n\nFor main--we selected the same dish which was Rigatoni Siciliana  This was pasta combined with tomatoes, roasted eggplant and fresh ricotta. Absolutely filling and tasty. We enjoyed our meal very much. I didn't leave a drop behind on my plate.\n\nA few things to note:\n*no reservations for parties under 6\n*cash only (this usually annoys me as I like the option of either cash or credit cards especially if prices are somewhat average/high (and this was true for Noodle Pudding)\n*open at 5:30 PM for dinner\n*only one unisex restroom (another slight inconvenience)\n\nBecause we arrived super early for dinner, there was no wait time; however, I'm not one to stand on line endlessly for a table which is why I'm happy to have experienced Noodle Pudding considering it was my first time. Good food, atmosphere and service.\n\nOne to try.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "I haven't had a meal out this satisfying in a long time. My friend suggested this place for dinner as she had a good experience the last time she dined here, and I must agree. The entire meal was absolutely delicious. \n\nThat being said, here are some notes about this place:\n- They are only open for dinner - from 5:30pm \n- They only take cash\n- They don't take reservations for parties of 6 or less\n- They invite you to go and wait for a table  \n\nAfter a 45 minute wait for a table, my three friends and I finally got settled into a nice, rear-alcove, corner table. Our waiter came by to recommend one pasta special, but said the rest was whatever was on the menu. We went completely with the menu items, decided to share everything, and ordered the following:\n\n- Razor Clams Oreganata (4) - Clean, delicate clam flavor, dressed with a crust of seasoned bread crumbs and a squeeze of lemon juice. Yummy starter! \n\n- Crispy-Fried NJ Whiting (2) - Two crispy-fried whole whiting. I took half of one whiting with the head and ate the entire head! That's how delicate this fish was! Delicious! \n\n- Fried Calamari with Spicy Aioli and Lemon Wedge - Crispy, nicely-battered, good texture/bite to the calamari without being too chewy. Nicely flavored Aioli to go along with it, but not spicy at all to my palate. \n\n- Hand-cut Linguini with Clams, Zucchini, Cherry Tomatoes and Fresh Pepper - Homemade, al dente pasta with fresh clams so clean that they were delicate in flavor. The zucchini and cherry tomatoes added another layer of freshness and texture. The entire dish together tasted more like a light pasta primavera because there was very little clam flavor coming from the clams. It could have used a dash of clam juice, but it was still good. \n \n- Pappardelle Alla Vaccinara (oxtail ragu) with Pecorino Shavings - Homemade, al dente pasta coated with oxtail meat stewed tender. A hearty, meaty, chewy, flavorful bite with each forkful. This has a heavier, comforting mouthfeel compared to the pasta dish above. I liked having both of these dishes as a contrast in flavors and textures. \n\n- Roasted Whole Porgy - What my friends and I especially liked about Noodle Pudding was all of their locally sourced seafood. Not only do you support local fisheries and eat sustainable species, you eat the freshest caught seafood! This whole roasted Porgy was perfectly cooked! Evenly cooked and slightly crispy skin enveloped flaky, white, tender meat. Simply seasoned with a few rosemary sprigs inside its belly, the meat was still moist but fell off the bones easily. I love fish head, so I picked all of best morsels off of the entire fish head, especially the eyes! Fish lovers will love this dish! \n\nDessert was:\n- Ricotta Cheesecake - More of a floured cake than a cheesecake, this delicious slice had bits of candied fruit that you would typically find in Panettone. Lightly sweet and moist, it also had bits of lemony flavor, which likely comes from the Citron. A lovely dessert that I would order again. \n\n- Panna Cotta with Fresh Berries - Silky, lightly sweet, and light are the best three ways to describe Noodle Pudding's take on my favorite dessert. Everytime I see panna cotta on the menu, I always havta order it. This one did not disappoint! The fresh berries that went along with it were sweet and ripe. A great complement! \n\nOverall, I had a delicious time at Noodle Pudding. Needless to say, I will be returning for more.", "author": "Wendy F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-02", "description": "This outing was decent. I went with my mentor. The service was horrible. It was like being served by a person without any arms or legs. The Salmon was decent. I could've stayed home and cooked it better.", "author": "Julius S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-16", "description": "I have eaten at Noodle Pudding at least 5 times now and love this place to the bottom of my heart. Here's a handful of my reasons:\n\n1. The food is very good. This isn't edgy new-wave Italian fare. It's classic. It's provincial. It's comfort. And it's also delicious. @EricJ and @BettyO each gave some pretty negative reviews, but they also both went on holidays: Valentine's and NYE. I've never been to Noodle Pudding on a holiday, but frankly, eating out anywhere on holidays is usually a recipe for disappointment as the prices are high and the kitchen staff is run ragged trying to serve an exceedingly high number of tables. I don't question their experiences, but I think the context is a good thing to keep in mind. On our last trip to Noodle Pudding, we ordered the Crispy-Fried Whiting, the Mafalda Al' Cacio e Pepe w/ the Egg Yolk (a must), the Bucatini Con Sarde, the Pork Braciola w/ Gnocchi, and another fish dish that I can't remember. But they were all delicious.\n\n2. The menu is in Comic Sans. It is the 21st Century. I am confident that this choice of font is not that of a provocateur, but of someone who isn't troubled by the pursuit of Michelin stars or Eater's praises. I can't understate how important this is. Food culture is more often than not a pretentious mess that exhausts chef and eater alike. It is so refreshing to enter into a restaurant that simply wants to feed you and see that you enjoy your evening. I have this sense every time I enter Noodle Pudding. So much so that even Comic Sans is redeemed.\n\n3. House wine for $15 a bottle. Enough said, yeah? You can pay more, but honestly, I'm not sure why you would. Sitting with a group of friends and ordering three bottles of wine without nervously tallying the bill in my head makes for a lovely dinner. This kind of reasonable pricing is all over the menu and reaffirms my 2nd point: Noodle Pudding is an environment that seeks to put you at ease, which makes both food and conversation more enjoyable.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-17", "description": "Delicious pasta at a surprisingly affordable price for the city. We liked our green pasta with lemon a bit more than the special pasta we tried, but that's a bit of personal preference. Excellent fresh pasta overall though!\n\nNot sure why this place is cash only. It's definitely large enough that you would expect them to take credit cards.", "author": "Lauren A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-29", "description": "Dropped by on Sunday for a 6pm dinner and the location was already jam packed with an hour wait. We managed to get seats at the bar, but definitely surprised at how many people were coming in and out and how busy the place already was for such an early dinner. A ton of families and from the conversations between the staff and the customers, a TON of regulars as well. \n\nNoodle pudding has a very homey, loud and lively vibe. The interior is quite cramped as well and there are some long tables that looked communal. They lay paper on the tables and saw customers bringing their own crayons to draw on them. Noodle pudding is cash only which feels a bit ridiculous given the menu items are in the $20+ range. For two people, we got two pastas with no appetizers or drinks, and it came out to $50+ total. Throughout dinner hours there was a pretty constant stream of people coming through waiting for tables, but never got mobbed or overwhelming. Service was a little spotty and very slow, and it felt like the staff were a bit frantic running around. \n\nThey don't seem to have a website but the menu was different than the ones we had googled online. There is bread on the table that comes with a slightly spicy, tomato olive oil that was delicious. We had the cacio e pepe with short curly noodles (they looked like mini lasagna noodles). Very al dente and heavy on the pepe portion, in a generous portion. They also had a noodle dish in a mushroom ragu that was delicious as well - the mushroom was plentiful in different varieties but not overwhelming. Thought the pasta in the second dish had come a tad overcooked. There is also entrees with meat and fish options, although seemed like most of the tables were ordering pasta. \n\nOverall, really delicious pasta and very cozy, lively vibe. Not sure if I would wait an hour for the food here but if you catch Noodle Pudding on a less busy night would absolutely recommend dropping in.", "author": "Pam C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "My friend and I were craving some Italian food around DUMBO and I'm so happy we found this place! The wait was a bit long and it is CASH ONLY. We ended up going to sweetgreen and getting a salad to share before coming back for our reservation. I'm glad we also waited instead of finding another place because of the wait. Everything was super delicious and cooked perfectly. I was especially surprised with the seafood pasta. The seafood was lacking a bit (wasn't as fresh as it could be) but the pasta tasted completely homemade and super flavorful on its own, as if they cooked the pasta in some sort of broth instead of just regular water. \n\nThe decor is also super cute in the front, you don't even feel like you're in NYC!", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-08", "description": "A friend of mine wanted to try this restaurant for a long time and a group of (4) of us finally went. \n\nI am pissed about having spent any money here. I had eaten prior to this so I wanted a beer and something small. The beer was $8 -- totally fine. The anchovies bruschetta appetizer dish *FOR 1* that I got was priced as $7 per 1/ $14 for 2 or something similar.\n\nWhen everyone got their dishes, they were good. Mine however.. The bread was so hard, we should send it over to our troops so they could block bullets with it. I eat salty fish all the time -- the anchovies with the peppers and olives were way too much on each piece. Like, do you not taste your own food before you serve it to paying customers?\n\nThat wasn't the bad part. The manager saw me push my plate to the side and completely ignore it -- a universal sign of not wanting to eat whatever is on my plate. Either he isn't very bright or chose to ignore the fact that I wasn't satisfied with my order several times. Well, you're managing a restaurant, you must be competent enough to know I didn't like the food. Our waiter was really bubbly and kind at the beginning, and then of course after this incident (coincidently) shyly put down the dessert menus, and then even more discreetly came by with the check without saying a word. But proceeded to paint a full, vibrant picture of all the desserts they had to the table next to us. \n\nThis stupid establishment charged me for the price of 2 PERSONS when the actual bill says \"FOR 1\" \n\nService is garbage. The food I got was disgusting. My friends' dishes were good apparently but then again Italian food is the cheapest, quickest and easiest type of cuisine to cook -- that is why its a go-to for broke college students after all.", "author": "Alana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-21", "description": "I know everyone is excited about the italian food here, but nothing gets me more excited than 5$ house wine! (15$ for a bottle). Also the food is good too", "author": "Stacey F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-30", "description": "Really enjoyed visiting this area of Brooklyn and trying out this Italian restuarant! The restaurant was decorated with a fall/Halloween theme inside that made it an even more fun and interesting place to eat. The service is what I call \"typical\" for an old school Italian restaurant, which means it was efficient but somewhat gruff. They bring bread and an olive oil dip to the table, but we also ordered the fried calamari for an appetizer. The calamari was pretty standard, nothing great or bad about it. \n\nWe ordered the house wine to drink and for $15 it was surprisingly drinkable. With a group of friends I could easily see ordering a few bottles for the table and your wallet won't be in pain. \n\nFor entrees we ordered a gnocchi with butter and sage sauce, and something similar to a rigatoni with short rib, ricotta, and basil (don't remember the specific name). The gnocchi had a perfect texture, but the sauce was very plain and could have used a lot more seasoning. The short rib ragu was excellent, and the ricotta was a perfect match with it. \n\nIf I am ever in the area again I would definitely try this place again, and order some more of that cheap house wine and short rib ragu.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-14", "description": "What a find. A birthday celebration for a 2 year old although, apart from the birthday boy, the attendees were much more mature. A party of 10, we practically forced our way through a heaving, happy mob of diners to reach our table shoe-horned into a corner. Our canny host ordered antipasti for the table which just kept coming, beautiful dish after beautiful dish. Simply awesome. Could have almost forgone the entree but I forced myself to try the chicken dish. Fabulous food, but fabulous extended family fun in a friendly, authentic space is hard to beat. All round fantastic experience.", "author": "David F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-01", "description": "One of the best Italian restaurants I ever been too. We don't have a lot of great one in the Bay Area so my taste buds were in for a surprise. The only thing is that they don't take card and it's cash only. But another great thing is that this is probably one of the only places I would consider eating in Brooklyn near DUMBO, it's off the bridge, walking distance to the water. I would reccomend this place. BTW, our waiter was from North Carolina, I think his name was Teddy, he was one of the sweetest people every which made our experience great! Have you guys heard of square card? You can get more costumers if you offered CC options. #JustSaying, if not I don't know if I saw an ATM near by... HAHA \n\nThanks for the experience. Shout out to Teddy!", "author": "Hazel I."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}