{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-16", "description": "A-OK. I'm not quite a fan, but I do like the place, the space, the location and the food is good. So why 3 stars? Because I'm applying the Italian scale of measurement. \n\nArugula and shaved parmigiano: This simple salad combines the pepperiness of the arugula and the butteriness of the parmigiano. Everything was good, but the arugula could've been more peppery and the cheese more buttery. I'd order it again just cuz I like it.\n\nTagliatelle bolognese: The pasta wasn't quite al dente. The bolognese was good, but again, didn't take me back to Italy. Flavorful, but should've been more flavorful.\n\nWheat panette w/ spring veggies, in this case baby zucchini and fava beans. Simple and fresh. The veggies melded together making it harder to discern individual flavors. \n\nTiramisu: it's good.\n\nPear ricotta cheese cake: It's better than the tiramisu. \n\nIt's not a bad 3 star review, but I can't say I liked it enough to be a fan.", "author": "Ed S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-24", "description": "This place is great. Went here after the line at Grimaldi's on Labor Day weekend was retardedly long on a whim. And by whim I mean I pulled out my yelp iPhone app and picked.\n\nCash only was ok.\n\nWe had the grilled sardines and zucchini parmesan as appetizers.\n\nI wish we had gotten like 5 grilled sardines. They were so deliciously smoky and succulent. \n\nMy boyfriend's parents were in town and his mom had called her friend whose family is from here and she mentioned that her sister in law lived in the area.\n\nGuess who we saw as they headed towards the restroom?\n\nI have awesome restaurant picking powahs.\n\nApparently she and her husband are close friends with the owners and they normally don't come there on the weekend because it's crowded so it was extra lucky. \n\nBoyfriend and his dad had gnocci two ways (one with a butter sauce and one with a tomato sauce). \n\nHis mom had the salmon with black barley salad and I had a perfectly rare hangar steak with tomatoes and onions. \n\nI adore walking around Brooklyn Heights so I'll make sure we go back again. \n\nNo pictures as I didn't think we'd be going anywhere worth snapping (I've done Grimaldi's twice through photos) and left my camera at home.", "author": "Michele G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-17", "description": "Picked this place because of the Yelp reviews. Thank you everyone I loved it! \n\nTry the Gnocci with sage mmmmmmmmm", "author": "Jade h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "You can't beat the $4 house wine. I also enjoyed the service, the waiter was quite attentive.\nThe bread and spicy oil they bring out was delicious. U also had a tomato mozzarella app, which was very skimpy thin slices of tomato, but good.\nI had the gnocchi butter/sage for an entree, which was fine but pretty bland. Wouldn't get it again. \n\nThe Dessert was AWESOME! Tiramisu, and the Strawberries/Blueberries and whipped cream.\n\nOverall lovely ambiance", "author": "James C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-13", "description": "I eat myself silly every time, couldn't be happier.  After everything, order the bread pudding.  Staff is exceptional and very friendly.", "author": "Arthur S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-24", "description": "Mom + Dad came down from Vermont for our show at the Met, Vermonters in hopes of finding of an awesome dinner out in NYC they could actually enjoy without breaking the bank (i.e. it's hard for our family to relax when were spending money).  \n\nNoodling Puddling knocked it outta the park.  Whole wheat pasta with pureed winter vegetables killed.", "author": "Luke R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-27", "description": "Came here on Easter Sunday with my boyfriend for a quick small bite to eat. We sat at the bar. The place seemed as if it had a lot of regulars as patrons walked in and said hello to the waiters as if they were all great friends.\n\nWe tried a pasta dish (was good) and the arugula salad (not enough dressing, and very bitter). Because I didn't really have an appetite I didn't eat too much so my dining experience was just OK. Would come back if ever in the area to give it another try.", "author": "Siv L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-22", "description": "Great food. Great service.\n\nWent there at 8pm on a Friday night and was seated immediately. We ordered a delicious artichoke appetizer, which came out in a very timely manner. Our waiter was very friendly and attentive, and very quickly replaced my wine when I noted that the glass was dirty. \n\nI had a daily special of pappardelle with roasted tomatoes and ricotta. It was delicious and a very decent portion. All the ingredients were fresh and  flavorful. Even the bread and parsley/olive oil sauce they provided as a complementary appetizer were delicious.\n\nOne downfall - the restaurant is cash only.\n\nI will definitely go back there again.", "author": "Sara W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-30", "description": "After eating at Noodle Pudding I see why it has suck mixed reviews.  I wonder if everyone who complained about the service had the same terrible waiter that I had. As the other reviewers agree, the Gnocchi is amazing. But, not good enough that I would go back.\n\nThe wine selection by the glass was almost non-existent so I settled for a glass of Sangiovese.  I will say it was a generous poor. \n\nI ordered the Caesar salad which was extremely good. I was very impressed with the quality of the lettuce, very crisp and fresh. As I mentioned above, I choose the Gnocchi with butter and sage which was very tasty. I finished with a cup of cappuccino which was also good. \n\nUnlike some of the other reviewers, the man running around with a pitcher of water kept my glass nice and full. This is something I find very important so I did appreciate him. On the other hand, I did not appreciate my actual waiter at all. I placed my order with him and then he did not return to my table again until it was time to give me the check. After having my salad plate taken away I waited over 30 minutes for my Gnocchi to arrive. Again, very tasty, but not that good! When I finally saw my waiter again I did tell him that I felt I waited an exorbitant amount of time for my food. He had no reply. not even a simple 'sorry'. \n\nIf you decide you want to try Noodle Pudding as the food reviews are great I will warn you of one final disappointment. Others raved about the complementary bread. I must have looked like I do not eat bread because I had to ask for it. I was very excited about it after reading the reviews, but very disappointed once I tasted it.\n\nOverall, if you are in Brooklyn and looking for reasonably priced Italian food, please try Noodle Pudding. But, be ready for poor service. And, if you are willing to pay a little more or travel a little further, cross the bridge and head to Little Italy.", "author": "Diana B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-07", "description": "We went here tonight to celebrate my parents' 40th anniversary. The food was great. That's where the greatness ended. The service was SOOOOOO slow. We were there over an hour and a half before we received our entrees. Thankfully we'd eaten apps and weren't starving anymore. The food was very good. Some highlights: the mussels were delicious in tomato sauce, the pesto special and rigatoni special were both really very good, the gazpacho was velvety goodness. The Caesar was meh as was the zucchini side (slathered in tomato sauce).\n\nThis is a terrible place to go if you want to have a conversation. My almost 80 year old father is hard of hearing and I think missed most of the conversation. I could barely hear. It was SO LOUD. I requested that the music (Van Morrison, btw, weird) be turned down because it was pretty loud over the din of the restaurant and I was told \"I'll try but the owner likes it loud.\" They did turn it down slightly, but it eventually got really loud again. \n\nI don't know if I'll go back. Too many other restaurants to try.", "author": "sarah K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-31", "description": "I've know Noodle Pudding as a 30 year resident of the Heights.  It certainly had it's day but that was long, long ago.  After a dismal meal a year ago, I decided never to go again.  However, out of town visitors had heard about it and really wanted to go, in spite of my advice to the contrary.  So we tried it again the other night.  The food and service are mediocre, at best and the service simply stinks.  Our visitors apologized for forcing us to go there. This place survives on an old reputation and unknowing tourists.  Never again.", "author": "David C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-10", "description": "It's not tucked away so much as unmarked but once you find it, don't forget it. The food is authentic and the waitstaff is very helpful. We knew we'd have to wait for a table (because when it's this good, it just makes sense) but with the Brooklyn Bridge almost overhead, it's no big deal. I mean, you can't fault a place for doing business, right? I suggest ordering any pasta. It's all fresh and you can tell. My friends enjoyed the rabbit and other various meat dishes but I'm rooting for the pasta. With seafood if they have it.", "author": "Marin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-15", "description": "Love this place.  I've had the homemade pastas, the seafood, the veal, and mostly every type of main dish here.  The quality of food is high.  Wines are delicious here.  The place is romantic and fun for a group.  The service is great too, owned by a family.  Everyone is so nice.  If you want to come here, bring cash and also go early to get a seat.\n\nI'll see you soon Noodle Pudding.", "author": "Anne D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "Authentic Italian restaurant with real deal Italians in the kitchen.  Best rabbit aside from the one you prepare in your own home.  Quality of food is excellent.  Definitely worth a trip to Brooklyn Heights.  \n\nDownside:  Super long waits on the weekends, so don't go there is you are starving; slightly cramped inside...\n\nCASH ONLY...", "author": "Meredith B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-17", "description": "After high recommendations, I was disappointed. Caesar salad tasted like they forgot to put the dressing on it. Service was slow, and the bottle of wine we ordered never showed up. The hanger steak special was the highlight of the visit.", "author": "Sam T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-26", "description": "FAMILY STYLE- AS LONG AS YOU DON'T BRING YOUR FAMILY:\n\nI normally wouldn't write a poor review unless absolutely warranted.  These guys have a seemingly nice Italian menu and I've read all the positive reviews.  \n\nBut be it known that they're not very accommodating or friendly people when it comes to service.  \n\nI called for an early 5:30pm reservation tonight for a table of six, and a stroller with our 6-month old twin babies.  \n\nWe arrived at an empty restaurant and four servers all worried about us taking up too much space from other diners - mind you, there were none.  \n\nTo be polite, we moved to a quieter spot in the back, where we thought for sure we'd take up as little space as possible.  But our server then came to our table, trying to convince us that we should maybe move - or push the babies' stroller under the table with them in it!  \n\nAgain, with not a single diner in the restaurant, the staff did an amazing job at unwelcoming us, as i suggested that maybe they'd be more comfortable if we left.  No one was opposed to that idea!\n\nSurely we left, with no apology from the staff, or even mild attempt to help us out.  \n\nReally dumbfounded by this - one of the most unprofessional service attitudes I've ever seen in this business.  And we work in the industry.  \n\nSadly, I won't go back.  And hope that one of the staff may read this, so you may take consider this feedback the next time you're servicing a small family.", "author": "J D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-05", "description": "I love this place.\n\nFirst of all, the complimentary bread and olive oil dip is amazing. I usually can't stop eating it. They have a good selection of wine with one decent, really cheap option (only $14 for the bottle.) The food is great and reasonably priced too. I've gotten lasagna both times so far. I've also had the bruschetta which was on special and absolutely fantastic. The tomatoes actually tasted sweet.\n\nThe atmosphere and service are great too. It's always packed in there, but they turn over tables really quickly. I've waited 20 minutes or less both times I've been, but it never felt like a long time. In the summer, they open the windows onto the street.\n\nI definitely recommend Noodle Pudding. It's a good place to go with your family, friends and guests.", "author": "Heather A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-12", "description": "Love Love love this place. Thanks to Daniel with the cash only that help. The most delicious food ever. Must try", "author": "Jade P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-06", "description": "Wow - talk about overrated.  I took my 15 year old niece here for her birthday last Saturday night.  We arrived at 630 and waited 45 minutes before our appetizers even hit the table (a salad and some scallops).  I had to ask another server for a drink as our waitress seemed to wander off, and he offered my niece wine.  Long story short - TERRIBLE service, no atmosphere, and very mediocre food.  Definitely not going back.", "author": "Jenny W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-11", "description": "My first foray into Italian dining in NY was a disappointing one. I had such high hopes and I know this isn't Manhattan so perhaps that is the difference here but I wasn't all that impressed. I had the gnocchi in butter sage sauce. The gnocchi itself was ok but the sauce was really bland. When I think of a butter sage sauce I envision browned butter, large crispy pieces of sage maybe some garlic and white wine but this was literally melted yellow butter with small slivers of sage and that's about it. At least, that's what it tasted like. I had a bite of the girlfriends red pasta (don't remember the dish) and it was mediocre as well. Nothing was really bad, it's just that I feel unless you live on the same street, you can find better options in NY. \n\nThe prices were ok but they were also cash only.", "author": "John W."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}