{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-01", "description": "Sunday afternoon a little after they opened at 5pm. There were a few people in there at tables. I got a table right away. This place filed up very quickly. When I left there was a small line outside the door.\n\nI did have to wait for bread \u0026 oil which came out after my appetizer. I think that should have been the first thing placed on the table besides a glass of water. I ordered the fresh mozzarella for an appetizer, it was good enough for two people to eat. On the plate was 4 pieces of fresh mozzarella, 6 slices of tomato, \u0026 some fresh greens \u0026 olives. For my main dish I ordered the Rigatoni with Eggplant, it was good but the pasta was a bit undercooked. I was disappointed with the portion. Any italian place I've been too theres always like entire meal to take home, not here. For dessert I ordered the taramusi, I was very disappointed it was watery not fluffy or moose like. It tasted like it was watered down \u0026 not much flavor. The service was ok, my waiter never even asked me how my meal was! I know it did get busy in there fast but at least ask how I'm doing.\n\nAs for price for the amount of food I got \u0026 the service it was not worth $40. \n\n**CASH ONLY**", "author": "Nicole B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-02", "description": "Went there last night for dinner.... Long wait, but worth it.... My wife started with the minestrone soup and I had the bruschetta, both were excellent.... She then had the lobster risotto and I had the rigatoni alla sciciliana.... They were both good, but I could have used a couple more  rigi's on my plate.... For dessert my wife had panacotta with berries and I had tiramisu.... Both great.... Overall a great experience.... Cash only FYI.... And speaking of, it was pricey.... I am surprised it only has 2 $$ signs....", "author": "Michael B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-08", "description": "Food was delicious! They don't accept credit cards which I didn't realize until I arrived. Five stars if they take credit cards. Ordered the Linda Salad and Gnocchi - delicious!", "author": "Ben L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-10", "description": "-Friendly staff\n-Great bread/ dipping sauce (but we had to ask for it)\n-Got the Gnocchi with butter and sage (after reading all the rave reviews)-- it was good, but both my friend and I received the dishes and they were barely warm, if not cold.\n- My other friend got the risotto, which was a big hit.\n-Overall, it was a good dining experience, but I think that without the glass of wine before (while waiting for a table) and the bottle of wine during dinner, I would have been a little bit more sensitive to the pitfalls.", "author": "Katie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-04", "description": "I tried this place as a recommendation, and it turned out to be one of the best.  I am not a fan of Italian food but this was an exception.  \n\nI ordered Skirt Steak and Soft Shell Crabs as appetizer. The steak was tender and well seasoned, perfect to my taste.  Soft Shell Crabs were very crunchy.  They almost melted in my mouth.\n\nDue to the restaurant location, after dinner, I went to walk around Dumbo to help my stomach to digest the food and to get whole view of Manhattan Skyscrapers and Brooklyn Bridge.  It is very romantic for those couples out there and great for singles also, a place where you can be honest with the ones you like.\n\nI highly recommend this restaurant.", "author": "Francisco L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-16", "description": "Noodle pudding is my favorite restaurant. I've been to all high end fancy restaurants noodle has them beat hands down. Antonio is a Magician in the kitchen. The bolognese is out of this world, the reason everything is so good is because he puts his heart and soul Into every dish. Nothing is bad on this menu. Highly recommended.", "author": "Anthony P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-06", "description": "God this place has gone downhill.  As you can see from my previous reviews, I really loved this place.  \n\nI don't give out too many 1-stars, but this place finally warrants one.  My glass of water from the beginning to the end, refilled only ONCE.  I had the Caesar salad as an app and the seafood fettuccine as my entree.  15 minutes after being seated, the bread comes out.  20 minutes after that, my salad.  45 minutes after that my entree.  At this point, I was so disgusted, I asked the check, paid and then left.  I thought this was a one-off experience but some friends that went recently encountered the same thing.\n\nAlso, they've completely redone their dessert menu and have left off essentials such as cheesecake and tiramisu.  \n\nI will never be going back.\n\n*", "author": "Minh L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-21", "description": "Such a cute spot, great food but terrible service. Our server only gave us one menu between 4 of us and we waited a considerable length of time for him to take our orders. The rest of the party had got there earlier and already had drinks so I ordered a glass of wine with my food. When the food came I had to ask again for the wine, no apology. Slow service in between courses taking away our plates. Before dessert our wine glasses were take away without being asked if we cared for more. After around 15mins we had to ask for the dessert menu which took a further 10mins to arrive and then another 10mins for us to get the servers attention to order. Such a shame as aside from the terrible service everything else was great. We went on a Sunday night, although it was busy at times there were several empty tables around us so either the place is understaffed or the servers need more training.", "author": "Tara R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "Solid 4 stars - all the pasta is fantastic, cooked to perfection and the wine list is great. I really have nothing to say, which is rare, so I'll just put this to bed. Go to this place, you'll be glad you did.", "author": "Brad D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-01", "description": "Excellent service, even more excellent food. The cutest atmosphere. Walked in around 6:30pm and sat down right away. The waiter was extremely nice and witty and informative. He helped me pick out my wine and gave us as much time as we needed - which was a lot. The pastas and desserts are house made.  The gnocchi was to die for. Definitely coming back.", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-14", "description": "Meatballs were good, rice balls were good, tagliatelle bolognese was very good, did not care for the stratacelli, I know other people here recommended it but it tasted a little too...idk how to describe it except \"grill flavored\" ...definitely going back, sticking with the pastas. Cash only.", "author": "Kristine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-03", "description": "This is my new favorite place. Classic, well-priced, delicious, cozy but still vibrant ambience.  Perfect.", "author": "Natalie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-19", "description": "GREAT Italian restaurant... I'm so psyched it's so close to my apt but not too happy that they only accept cash.  boooo!\n\nAnyway, I highly suggest their seafood risotto - the calamari and scallops are cooked to perfection (literally melts on your tongue) and the whole dish makes my mouth water just trying to discribe it.  They usually have awesome specials, their prices are reasonable, the atmosphere and service is very friendly and they are so spot on when it comes to even the most basic things.  I think my favorite thing I had there was a spring tomato, onion and avocado salad.  \n\nthe wait can be kind of annoying, but they're very accommodating and so unpretentious I usually don't mind.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-11", "description": "Couldn't even eat here because we were waiting for ten minutes to be seated. It was not that the place was busy because there were tons of tables available but that the host just never helped us. He originally said \"one minute\" or something to that end and after that completely ignored us and several other people behind us who were waiting, too. Terrible, rude service. I don't care how good the food is, I don't need to try this hard just to get you to take my money. What a shame.", "author": "Chelsea D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-04", "description": "Fantastic food and service!!! All dishes served were outstanding, especially the homemade burrata, cheesecake, and tiramisu. We came in with two wiggly toddlers and they treated us especially well. Prices were very reasonable for the neighborhood and the house wine was a steal; we'll definitely be back.", "author": "Brian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-29", "description": "Enjoyed it thoroughly!  The ambiance was great, and it was nice to come in after a dip in the pop-up pool - excellent menu choices, and our waiter made solid recommendations - attentive, without being overbearing.  The straccetti was phenomenal - extremely tasty and the meat was flavored to perfection.  I started with the sea scallops and split a salad; my husband had the capelli D'angelo al pomodoro and enjoyed it.  Dessert was the ricotta cheesecake for me and vanilla gelato with peaches for him.  I have no complaints on any aspect of my meal, and look forward to visiting again. Well priced, nice atmosphere, great staff, and great food.  It's a nice, casual place to go with a few friends or with your date - I saw quite a few couples, but plenty of good friend dinners happening as well.", "author": "K G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Brooklyn Heights is known for its strange dearth of quality restaurants -- but this place is the exception, and has been for years. Lively atmosphere, solid pastas, generally excellent fish, reasonably priced wines ... two thumbs up, which is a lot more than I'd say for most other places in the vicinity, including the ones that also have four stars on Yelp. Moving out of the hood soon after many years here, and it's really the only restaurant I'll truly miss.", "author": "marian b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-31", "description": "I came here for dinner on a Saturday night for a party of six. Initially I read reviews and learned that this was an Italian restaurant with an intriguing name.\n\nSeated promptly, I ordered the red wine carafes since I wasn't sure how bad the bill was going to be at the end of the night (and I had cash ready in my moth filled wallet). This was very good considering the price. While osso buco, bass, mussels and pasta dishes were absolutely delicious (see photos), the fact that they had liver on the menu damned me. I ordered the calf liver, took 3 bites and reminded myself: \"it's still effing liver.\" \n\nThis would have been a strong 4 star restaurant, but if you're going to put liver on the menu (a bold move) it better be good. Too bad liver sucks any way you make it. I would return for the other savory entrees.\n\nIFHTP 1", "author": "Peter K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-22", "description": "I can't count the many ways I love noodle pudding. You want to take your parents to a nice dinner but don't want to trek into the city? Take them here. Want to take your friends out for a birthday dinner? Take them here? Want a relaxing date night? This is your spot. Hungry for delicious Italian food? Here you go.\n\nThe prices are complete affordable, with pastas typically around 11-14 bucks which is more than enough to stuff you. If you're feeling like a little more go, for some of the entrees which are $15-25. I'm in love with the Strachetti - try it! And if you're a regular be sure to mix it up with the specials. \n\nThe servers are mostly friendly and attentive, some more than others. They manage to keep the classic Italian cool without coming off as obnoxious or snobby. However I will say there are some of the bad apples which is why they're not getting a 5th star. On occasion there will be an inattentive host who has ignored a group waiting by the door to chit chat with the bartender - for 10 minutes...\n\nThat said - the food makes up for any of the off nights of service and generally I can count on noodle pudding for a happy belly full of food.\n\nAlso, they have $15 bottles of house wine. Yes. $15. And its freaking good. Try to beat that anywhere else in the heights.", "author": "Jen F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-20", "description": "Everything about this place is welcoming and wonderful. Rustic Italian, bustling on a Saturday night. The staff and the food is amazing. Definitely a favorite spot and well worth the wait!", "author": "A H."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}