{"aggregateRating": {"reviewCount": 547, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-20", "description": "So.good. We all finished every last bit of our food. The risotto and bolognese were soooooo delicious. I had amaretto gelato that was so good I would go back just for that! Great neighborhood gem!", "author": "Alex A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-23", "description": "Love this place!  The angel hair pasta is divine!  If you're going on a Saturday definitely make reservations and get there early.  Just a great place to bring a date or a group of friends.", "author": "John S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-05", "description": "Noodle Pudding is my vision of what an Italian restaurant should be.  Four of us ate there around 4 in the afternoon on Easter Sunday.  The place was buzzing with families and groups of friends.  You could imagine that some of the people were just returning from church, a christening, or whacking some Irish mobster up in the Bronx.\n\nThe food was amazing.  For appetizers, we shared steamed mussels and raw clams. Main courses of various types of pasta were breathtaking -- lasagna (both the meat and the mushroom) and a spaghetti dish.  The desserts were also scrumptious.\n\nThe staff was warm and funny even though they had been going at high speed for hours.  Even with occasional kids running around, the place was festive with an old world feel to it.\n\nSo, after your next wedding, funeral, or shake-down, drop by the Noodle Pudding and celebrate with the family.", "author": "James P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-01", "description": "The menu at Noodle Pudding includes a whole lot of solid dishes and a few creative riffs on Italian-American classics. The spaghetti with cherry tomatoes, hot peppers, and Manilla clams arrived piping hot and tasted just fine. Their sage-butter gnocchi looked deliciously decent. An interesting dish featuring pounded chuck, arugula, mushrooms, cream, and truffle oil arrived as advertised, containing each of the ingredients it listed. \n\nThe service tried their best. \n\nIt's a nice little spot on Henry Street.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-25", "description": "After 30 minutes wait on a Friday night for party of two, we were so excited for the dinner since I read so many positive reviews.\nTheir wine by glass doesn't allow much selection, but starts from $4 which is unbelievably cheap.\nThe bread and spicy olive oil were delicious. I would say that was the best part of the dinner.\nThe appetizer, tuna calpacho was wrong. Tuna was too thin. Didn't really go with the olive oil.\nMy main, pork chop was lack of flavor.\nMy sister's main, the day of risotto - lobster - had too many corns which destroied the flavor, and also tasted cheap.\nService was not quick, but nice and friendly. The portion was large.\nOverall, I enjoyed the dinner, but not positive if going back.", "author": "Monica J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-23", "description": "A.M.A.Z.I.N.G..simply put - this is one of the best restaurants in the area.  You wont go wrong by stopping by here.  There's a reason why it can be packed on Fri/Sat night - because it deserves the reputation it has.  The wait is worth it!  Great for a group - a little on the loud side, but nonetheless a fantastic meal will be had by all.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-14", "description": "Love this place!  This place makes you feel like you're in Italy.  It has such a warm and homey, italian feel.  The food also reminds you of being in Italy.\n\nThe complementary bread and olive oil is quite wonderful.  They add tomatoes and some other stuff to the olive oil which makes the whole thing fantastic.  There wasn't one thing I had here that wasn't good.  Hubby and I dined with friends who know the people here and a word of advice, order what's on the daily special menu.  They have the best stuff on that menu. I have to say my favorite dish(es) of the night were the mushroom risotto and mushroom lasagna.  I usually am not a lasagna person b/c its too cheesy, but it was hardly noticeable in this dish.  Extremely flavorful.  The panna cotta dessert was pretty good (usually I don't like panna cotta).  The bread pudding was tasty as well.\n\nThe portions are perfect and the price is great.  As others have said, it's cash only.  \n\nIf I lived in the neighborhood, I'd be frequenting this place.  However, this just gives me a reason to venture to Brooklyn.", "author": "Michelle H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-24", "description": "3.5 stars.\n\nBeing a New Yorker for nearly a decade and not walking the Brooklyn Bridge is blasphemous that upon my return to my hometown, it prompted me to go get this must-do-in-NYC over with.  As a reward, I trusted fellow Yelpers and walked a short distance post-bridge to Noodle Pudding.\n\nI am not sure how much it was a reward.  When we arrived to the restaurant, it took 10 minutes of standing in the restaurant clueless before a waiter seated us.  Then it took 10 minutes of sitting down waiting for our waiter to come.  You know where this is going--practically every step of the dining experience (order, getting bread, asking for pepper/cheese) was well-separated with 5-10 minutes of lag time.  Overall, the service was sub-par.\n\nOn the other hand, the entrees (gnocchi with butter and sage and the papardelle special) were tasty.  We ended the meal with a decent expresso semifreddo.\n\nAside from the many \"little\" waits, Noodle Pudding is simply a charming cash-only (which is a bit questionable considering the prices of the dishes) eatery with good Italian food.", "author": "Judy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-25", "description": "Noodle Pudding is one of my favorite restaurants in New York.  The food is unbelievably good, particularly the gnocchi and daily risotto.  The atmosphere is neighborhood-y in the best way -- very low-key and homey.\n\nIt should be noted that they only accept cash, but that's hardly a downside when the food is this good!", "author": "Micaela L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-22", "description": "Where do I begin. Amazing home-cooked Italian food that will not break the bank. Only negatives -- this place gets really busy and you may have to wait awhile for a table, and it's cash only.", "author": "Rob A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-12", "description": "I know this place is supposed to be amazing so perhaps my experience was a \"one-off\" bad experience.  I should say first - my poor review is almost entirely based on bad service.  But it was just so bad it really overshadowed the food.  We went very early on a Sat evening thinking it wouldn't be too crowded - it was, but we didn't have to wait long for a table, maybe 20 min.  As soon as we sat down we ordered everything (having reviewed the menu why we were waiting) - this was at 6:50pm.  We decided to split a ceasar salad for an app and then I got the strattecci entree and my BF got a special - spaghetti w/ sausage and spicy peppers.  At 7:35pm our salad came... 45min to make a salad.  We commented to the waiter and he was completely unapologetic.  Around 8:15pm our entrees came. We could not believe how long it was all taking - our entrees were not difficult, time consuming entrees to make.  I mean Strattecci is beef pounded paper thin and seared!  My beef dish was fine - I probably woudln't get it again, but it was good.  My BF's spaghetti however was SO disappointing.  There was no sausage bits in it and no spicy peppers.  I don't mean it was very scarce, I mean there wasn't any at all.    Complete FAIL.\nWhen our waiter asked us if we wanted any dessert, my BF half-joked if we could get comp'd something since we had to wait hours for our food.  The waiter was so rude, arrogant and completely ungracious.  Before he could even answer us I told him to just bring us the check.  This place didn't deserve our business a second more.\nMaybe we just went on an off night and had a randomly bad experience - but it was so bad, we will never return.", "author": "Krista C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "This is our favorite Brooklyn spot! We started with oysters and mussels which I can honestly say were the biggest and best I've ever had.  We all ordered the dinner specials which were fabulous-friends got the Osso bucco which fell off the bone and I got the tuna and swordfish dish which was perfectly cooked.  The only complaint was dessert, 7.50 for a strudel the size of my pinky.  Would definitely skip dessert next time.  Not inexpensive, but you get what you pay for.  Superb food at this place", "author": "April B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-13", "description": "The service here is so bad. Food is ok.i won't be back. They need to train there waiters to give the guest attention and make sure they have everything they need .The busboys and runners should be the waiters they are nicerI", "author": "Joseph D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-28", "description": "When my friend first suggested this spot, I'll admit I was slightly confused by the name. Italian is not what came to mind, but I was so happy to find out I was wrong. My friend just moved to Brooklyn Heights so we ventured across the river to check out her neighborhood and catch up over dinner. Without much wait, we were seated at the communal table on the right when you first come in. The restaurant was bigger than it appeared from the outside.  Service was a little sporadic, but the food was delicious. I chose a special, which was homemade fusilli with short ribs. It was a simple dish, but so tender and flavorful. I also tried the Rigatoni Alla Siciliana which was quite good, and recommended by the waiter. Cozy atmosphere. We opted for a second bottle of wine instead of dessert. How can you beat a $14 bottle of Sangiovese?? Cash Only.", "author": "Nicole D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-20", "description": "My girlfriend and I got a table at Noodle Pudding tonight after many failed attempts. Unfortunately we were disappointed. The food was mediocre (and that's being generous). My girlfriend ordered Salmon and some type of white fish was brought our by the food runner. We then heard the waiter tell the table next to us that they were out of Salmon. He then did not say a word to us the rest of the evening. Pretty cowardly. Don't waste your time and money. Bevachio on the next block is much better.", "author": "M. L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-24", "description": "True humor occurs when you post a review with a very important section about there being no reservations and cash only and then you go on a lark and forget to get cash.  So you have the great meal and then you have to run all the way to Peas and Pickles to get cash.\n\nOn a Tuesday night this place was packed by the time we left.  The service is not super-attentive, but it is more in the way of just letting you enjoy your meal with no rush instead of just ignoring you so it isn't a big deal.  They are also busy and the servers are never just standing around.\n\nThe rigatoni dish was fine, nothing over the top, I enjoy the gnocchi much more, but to have a neighborhood restaurant like this is such a great thing and I always enjoy my meals here.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-13", "description": "I've held off writing about Noodle Pudding because my first two experiences over the past five years were lackluster. It has quite a reputation among Bklyn Heights folk (my peeps) that I wanted to give it one more try before opining. \n\nFirst the good: The food is slightly better than average. \n\nThat's where it ends. \n\nThe NOISE LEVEL is unbearable. It's one of those places where you can't hear your companion 3 feet across the table. Maybe I've become an old fogey--but the meal was ruined by jack hammer level blowhards in stereo and everyone else trying to talk above them. We couldn't wait to get outta there. \n\nThere's always a wait to get in; a no reservation policy. They only accept cash. The service is distant. \n\nThree strikes and they're out. Basta. It's Carroll Gardens for Italian from here on out.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-13", "description": "Nothing bad to say about this place. Always a wait - that's a good sign so go next door to the wine bar and grab a drink. They'll come get you when your table is ready.Friday and Saturday they have live music.. if you sit next to the guy he'll chat you up and sing anything you want. \n\nLove the Bolognese and any of the fresh pasta. 3 people, 3 entrees , a salad, and a bottle of wine for under $60. Can not beat it.", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-05", "description": "This place is really good. I thought it was going to feel like a low key neighborhood spot,  but it is actually quite classy. We walked in early on a Friday (5:45ish?) and we were seated right away. I think we had perfect timing because within 20-30 min the placed was completely packed. Despite how busy it was, we had great service. If our waiter wasn't available, others were checking on us and ensuring we had everything we needed. The food was really good too. We had a whole branzino on special, and they put a few sides with it. All was great. We got a side of pasta for our 1year  old son who was with us and that was good too. Also had a dessert and salad, all of the food was great. The décor was nice too, although I recommend they get rid of the Christmas lights as it makes it seem a little cheesy. They were super accommodating to us having a kid with us, although the restaurant does not feel like a kids restaurant. Would definitely recommend it.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "Very good Italian food here.  Menu is all in Italian so I had to ask the server for recommendations.  Their lasagna had a perfect flavor, not too strong, not bland, a little overcooked on top but the flavor was perfect.  \n\nTheir pasta all has the same meat sauce so it all tasted okay.  \n\nTeramisu is the BEST.....Bread Pudding was so delicious....their desserts are 5 stars all the way.\n\nVariety is 2 stars (no white sauce, all red sauce and the red sauce tastes the same for all dishes). Dessert 5 stars in value and taste.", "author": "Ckai D."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Noodle Pudding", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "38 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/Ha7iGEA0T9nmPsmWwuLGYg/ls.jpg", "@type": "Restaurant", "telephone": "+17186253737"}