{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-07", "description": "Been ordering from here for years. Delivery is always fast, food is great, prices are low for the area.", "author": "Mk T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "Very yummy, authentic Indian food. They were about to close but still sat my hunger, desperate family with a smile. The palak paneer was one of the best I ever had and they recommended some other dishes on the menu we overlooked first but enjoyed.", "author": "Jane C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-10", "description": "I went with my brother last night. I must admit, I have been living nearby for almost 2 years and never felf like I should go.\nWell... I had a very good dinner for $14 each including appetizer + entrée. More than enough food!\nI stayed classic and ordered a chicken masala. Very good!! My brother food was good as well (I can't remember the name).\nFinally, the service was not super fast but they were really nice with us.\nI would go there again without question, I will also order some for delivery soon.", "author": "Victor C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-25", "description": "I always order from this place for delivery. It's not the best Indian food that I have ever had - but for the area and the price it's well worth it and hits the spot. \n\nCome here at lunch and you can get a large portion of food for $9 that comes with a meat, vegetables, rice and naan. I always order the chicken tikka masala and I love it! Friendly service and fast delivery will have be coming back for more.", "author": "Crystal A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-15", "description": "Delicious Indian food. Best lunch hour deal in the area with lots of options and quick service!\n\nTheir chicken tikka masala is the best I've had.", "author": "Nicole G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-19", "description": "I won't order from Curry Heights again. Besides serving sub par Indian food, they tried to charge me higher prices for takeaway than the menu published on their official website.  When I pointed out the lower prices they advertise on their website, one staff member first claimed that it isn't their website at all, and another then asked me not to order over the phone again.\n\nRest assured, I won't.", "author": "Raj J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-17", "description": "Best Indian food in Brooklyn Heights.  And I'm Indian, so take it from me.  All the choices are great- I'm vegetarian and love every veg dish.  My father really likes the fish, and my son really likes the chicken.  Lots of turnaround so the food is always fresh.", "author": "Manish R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-03", "description": "I have JUST ordered from here via grubhub and I have to say I am very upset and disappointed by the delivery person who just showed up here. I receive the order and I give him money and ask him for change so I can give him a tip. He then proceeds to suggest how much I SHOULD give him because it was a big order (which I can assure its not) before giving me the change back. This is seriously disrespectful and unprofessional.\n\nI feel I will not be doing business with this place again.\n\nUPDATE: I am very sorry. I gave this place another chance as the manager seemed sincere in apology after my first bad encounter but this time I felt was even worse. I ordered lunch before 12:30 from here. I was notified that it was to reach me between 1:05- 1:15. I didn't receive the food until AFTER 1:30. I called the number only for it to not be ringing. I called customer care who also had an ordeal trying to reach the restaurant with the number provided.  This is bad. I try very hard to not be like customers that are rude and feel self entitled but this time I am sorry to say this was unacceptable. To make it even more awkward upon receiving the food the delivery person made 2 excuses under one breath of why he was late. A) it was really busy and B) It is really cold outside. However there are several places on both Remsen and Montague that deliver to my office on a daily basis for seven years and they have delivered despite cold. I will not tell anyone to eat here because when all said and done they need to see for themselves. However (though in my mind I honestly feel the establishment does not care) I feel that after 2 times of being burned I don't think I will go for a third time or any other time in the future.", "author": "Bowser F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-25", "description": "I'm visiting from Detroit and staying at the Marriot Brooklyn Bridge,  this is very close within walking distance.  I ordered chicken tika Mattela it was the best Indian food I've ever had. Rocky,my waiter was extremely kind and hospitable, made me feel right at home.  A must go if you like Indian food.", "author": "Ray A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-21", "description": "This is my favorite Indian restaurant in the area,mainly due to its lunch specials,which offer a variety of food to pick and choose from . My usual combo is the tandoori chicken with a non veg curry which is always consistently good.\n\n I usually go with chicken tikka masala for the curry which is boneless pieces of chicken in a heavenly tomato cream gravy. I don't like dark meat in chicken much and this seems to be one of the few Indian places which uses chicken breast pieces in curries. The tandoori chicken too is tender, juicy and incredibly tasty,with a choice of boneless or bone-in pieces served with sauteed onions and peppers.\n\nThe naan served with lunch is soft and fluffy and the perfect vehicle to sop up the curry.The curry is also served with rice which I almost always have to skip because its a lot of food!\n\nI really like this place for its consistency and also because it doesn't seem to skimp on portions at all!", "author": "Aparna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-24", "description": "Listen. Listen. LISTEN. this place. This darned place. I've ordered from them throughout my three years at Brooklyn Law, and they never disappoint. I'm writing this review about five minutes after I just devoured the three entree lunch box, which I had with chicken tikka, chicken vindaloo and goat curry. I've had a lot of Indian food, and I always appreciate a fantastic lamb or goat dish whether it's curry or biryani, and Curry Heights has one of the best goat curries I have ever had. Perfectly tender, succulent and flavored, even if the idea of a gamey meat makes you uneasy, their goat curry will change your mind and palette quickly. \n\nThe chicken is always great, but their variety of curry is impressive. \n\nI also opted for an order of the lamb samosas, which was a mistake only because I had a food overload. But the lamb was delicious. A bit salty and oily, but it's a lamb samosa--that's to be expected. \n\nMy only critique, if you can call it that, is that they don't leave the bay leaves whole, so if you aren't careful, you'll get a piece of leaf in a bite of food, which as we all know, is not pleasant. \n\nOtherwise, I love this restaurant. Oh and also, the delivery guys really really are gentlemen.", "author": "Hooney H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-17", "description": "Very good value for the money. Definitely fills the Indian crave. Service was good. Food selections and portions were adequate. Quality of naan was poor. Otherwise quite impressive and got a 20% discount for a Yelp check-in.", "author": "Pat A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-09", "description": "I have been here with my friends. Chicken tikka biryani was awesome(spicy). Chicken biryani was good. Veg-biryani was ok.\nBad thing- we sat there for an hour. No one bothered to serve food. Still I gave a good tip for the tasty food.", "author": "Rajalingam S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-29", "description": "Solid Indian food. I always get the dinner special. For 14.95 you get naan, rice, an appetizer and an entree. You also get all the sauces. I've had the jalfrezi, tandoori, tikka and masala. The portions don't look huge but are so filling. Enough to make two meals out of. I'm a big fan of their pakora's also. Good, friendly service.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "No frills service but Good Indian Food. \nGets the job done when you have a hankering for Indian food.", "author": "Cec M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-25", "description": "The Chana masala and vegetable biriyani was absolutely delicious. Me and my friend really enjoyed the food. The atmosphere was clean and the staff were really friendly! Will definitely be back again", "author": "Sayma N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-19", "description": "After watching a great movie FINDING DORY...we went to a lil gem in Brooklyn Heights...authentic Indian food...we ordered chicken tikka masala, yellow daal, chicken biryani, and mango lassi...the best in the area", "author": "Redsouljah A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-19", "description": "We ordered on their website for delivery. After an hour and the \"FREE FAST DELIVERY\" sign on the menu staring at me, I chose to call. When I called the man assumed I ordered from seamless and stated he had no orders. I advised him of our ordering platform, he then states \"WE JUUUST GOT IT!!\". \nAll of that to say they loss brownie points on the hour and 40 minutes I waited for my food. (-)\nThe delivery guy was dismissive and didn't acknowledge me at all (-)\nThe food arrived hot (+) with a decent flavor balance (+). Yet (as agreed with my spice lover coworker) the spice and authenticity of the dish lacked: / (-)", "author": "Innocence D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-15", "description": "the first time i walked into this restaurant there was no body in sight. ended up going somewhere else. But this time i took my roommate out for indian food since we were craving for it. All things aside, the food was amazing! \nPros\nAmazing food with nice ambience. \n\nCons\nCould do better on service\nSalt Lassi could be better", "author": "Preet K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-29", "description": "Didnt even eat the food, Service was so bad we had to walk out. The waiter was rude, obnoxious and cocky. There was one other client in the restaurant that was also upset at the service. The waiter is the laziest person I ever seen in a restaurant. The waiter spilled water on my legs while serving. One of the clients asked the waiter why are you so lazy. His response \"if the customer is good Im good\" what does that even mean? This place is a joke, I dont know how they are still in business. The owner really needs to know what goes on in there. We sat for 20 minutes without being acknowledged. I never been this upset in my life in a restaurant.", "author": "Omar K."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Curry Heights", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Remsen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/iIj1UCMlKN5sqaZzkBIziQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182609000"}