{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-04", "description": "One star because maybe their food is good, but wouldn't know.  Order was over an hour late when I called for a status update and was told the delivery was a few minutes away.  After another 40 minutes called and couldn't get an answer.  Had already paid and no delivery.", "author": "Trae H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-21", "description": "I was looking for a place to dine with my lady, and was hoping for great taste , and man this place was on point, the food smelled great and it tastes amazing . The best part was after I came back a second time , it was the same results.", "author": "Sam P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "We love your food. This is awesome place to eat and chill. Service is absolutely nice with friendly stuffs. Chicken Tikka Masala, Chicken Tandoori best choice of meat. From the veggie, saag paint, Navarratan korma are the choices . We love to visit this place often.", "author": "John R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-03", "description": "I ordered food on seamless and it came longer than one and a half hours. I called the restaurant and they made empty promises. BAD", "author": "Yinii Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-19", "description": "Great Indian food. Used to be to thankful when I was a student at Saint Francis College. They were quick and decently priced. They had a buffet lunch special which had a little bit of everything. I love there vegetable curry and samosas.", "author": "Mariclaire N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-17", "description": "My coworkers and I usually order online because they are close and the food is delicious. But after two incidents claiming they never got our order, we are officially done. Today they claimed they never received our order but then the clerk try to charge us again for re-ordering. Don't order online especially if you are hungry...you will starve.", "author": "Mrs G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "This place is ridiculously good!  Best Indian I've had in NYC and a great neighborhood spot.  The servers are very friendly and patient in explaining the food items/making suggestions.  A few things I love here are the garlic naan, baigan bhartha (mashed baked eggplant), lamb biryani.  Also anything with that tomato cream sauce is just addicting!\nRelaxing music too- I felt like I was in a meditation hour.", "author": "Ashley B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-20", "description": "Amazingly, every time I get this food it is consistent.  Still great, across seasons, months, commutes.", "author": "Rose P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-04", "description": "4/5 for delivery. 1/5 for in person dining. 15 minutes for them to take order. 30 minutes to get most of food. Still waiting for the Naan that goes with my meal. \nLiterally no service mentality here. They treat their pickup customers better than in house dining customers. One guy was waiting 2 minutes to pick-up and they gave him free Mango Lassi. Meanwhile we were still waiting to get their attention to order.", "author": "Tazmun N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "It's annoying people are bringing their seamless grievances here-- this is by far the best and most authentic Indian food in the area. It is reasonably priced and the entree+appetizer special (with naan) for $15 is a Great deal. The chicken korma and the dal makhani is absolutely delicious.", "author": "Cim B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "This is hands down the best Indian food I've had the US. Absolutely the best. My friends and I were so happy, we went there twice in one day. This was the first time when we told someone to make the food spicy, they actually made it spicy. \nWe ordered Chicken Lollipop (SO GOOD)which came with our beloved Schezwan Chutney, Gobi Manchurian (Super Spicy), Chicken Karahi and Vegetable Jalfrezi (Both amazing). Ordered parathas and naans, that were like  nice buttered pillows and some delicious Mango lassi. Also took home some Chicken Chilly which was pretty good if not better that the rest of the meal.\nGoing to visit this place every time I am in New York for sure.", "author": "Ketaki A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "My favorite Indian restaurant in the area. Friendly service, lots of options for people who both do and don't eat meat, great tandoori choices. Very reasonably priced.", "author": "Louise H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "This place is definitely my favorite Indian restaurant within the facility of Brooklyn that I'm in -the chicken Teaka masala is perfect from the sauce to the chicken its just amazing and the garlic chicken noon is just an amazing combination that they always get right. It's all about consistency baby and this place has it.", "author": "Allen G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-01", "description": "Even though the service is slow, the food is pretty good. You can get a full size meal for less than 15$", "author": "Abhichandra R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "My go to place after my workout. The absolute best Lunch Specials. Great price and generous portions. Always a Freshly made Mango Lassi nearby. I am a Vegetarian and there are great choices for me. The Manager always makes me feel like I am family. I am greeted and made to feel like I am a guest. I would not have Indian food any place else.\nI highly recommend Curry Heights ...who make their food with love....and go a long way to help you feel comfortable.", "author": "Diane C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-16", "description": "Love this place. I'm in town on business and wanted a good Lamb Tikka Masala. This place was amazing!! Highly recommended!!", "author": "Barry W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "Great Indian food, the best paneer in nyc (soft And melts in your mouth), had garlic Naan, gobi Manchurian (I prefer more crispy, but not bad), shrimp madras, and veggie curry. The chai tea was also good. Things are made to order, not microwaved (or at least I didn't notice). I appreciate fresh food!", "author": "Mina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-30", "description": "I love their curry--the medium spice is my fave. Staff is super friendly, when i get delivery or take out. 5 stars!", "author": "Julianna A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "The food is amazing. One of my favorite places to eat. I love their lunch special. I reviewed one bad experience i had, but that was only once.The staff is really friendly", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "I rarely review restaurants but Curry Heights' lunch deal is absolutely phenomenal. Saag paneer was delicious, melt-in-your-mouth. Tikka Masala was also great. Second time coming here and will be back for more! Don't understand the low yelp reviews.", "author": "Kevin L."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Curry Heights", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Remsen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/iIj1UCMlKN5sqaZzkBIziQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182609000"}