{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-22", "description": "With the dismal quality of brownstone Brooklyn's Indian restaurants, we were eager to try Curry Spot.  We came away favorably impressed.  The entrees were flavorful and not overcooked.  The salmon tikka was probably the best we've had.  The aloo saag was spiced differently than we've eaten before, but very tasty.  Other parts of the meal were less successful.  The kachori was too runny for our taste, and the sweet lassi was not frothy and diluted by ice cubes.\nUnlike the September reviews, service was prompt and attentive (to be expected when only two couples are dining).  All in all, we're glad to now have good Indian food in the neighborhood.", "author": "Marisa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-21", "description": "YUMMY!!! Now I'm not an expert by any means on Indian food but I absolutely loved the Curry Spot. I go to school only a few blocks from it, and my friends were pretty hesitant to go. (They had to though, the cafeteria was closed and I had a craving for Indian food.) When we first saw it we almost turned back because of the flags, and other crazy decorations out in front of the restaurant but In the end, my friends all thanked me for finding this place! As college student's we're all about deals, and their two course meal deal, $13.95 is a little steep for us but for an appetizer, an entree, naan bread, and rice, it was definitely worth it. There was no wait at all and the service was great! I've recommended it to everyone, including those who have grown up on home made Indian food.", "author": "Vanessa Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-27", "description": "Decent food. Good prices. Had the chicken biryani and a dal (lentil) dish and both were tasty. The naan and the samosa appetizer were nothing special, but they were good nonetheless. We ate in the restaurant. During the time we were there, their delivery business on this cold Sunday night was quite brisk.", "author": "Darrell R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-14", "description": "Terrible service. I tried to order and they hung up on me twice before I could get through. When the delivery took over an hour, they hung up on me a third time when I called to ask where it was.", "author": "Dan V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-17", "description": "Amazing Indian food!  They have the best chicken tikka masala.  They also have a really good naan that's stuffed with coconut and raisins.  I would highly recommend this place.  The prices are pretty good, and they have a great special where you get an appetizer, entree, and naan for $12 or $13.", "author": "Jessie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-17", "description": "I order from this place all the time and have generally been very satisfied, but last night it took 1.5 hours for the food to come, the food was cold, and I found several hairs in it. I asked the delivery person about getting a discount (probably not the right person to ask), and he just smiled and shrugged. I will probably order from Amin next time.", "author": "El D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-25", "description": "Great food, great service. Excellent vegetarian options, and really good lunch deals!", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-27", "description": "The food is great, but the waitstaff is completely uncommunicative.", "author": "Restles S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-26", "description": "Finally, a delicious Indian food option in the neighborhood! I agree with what's been said about working out the kinks, but I'm willing to be patient. The food is lovely, the staff is kind and attentive, the prices are more than reasonable, the space is new and clean, and it's quiet and not packed with people on a Friday night. I really cannot ask for more.", "author": "Trish C."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Curry Heights", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Remsen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/iIj1UCMlKN5sqaZzkBIziQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182609000"}