{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-08", "description": "Took my old school freind out for her birthday , she really enjoy the Indian food. I got the chicken tandoori masala  with some white rice and red wine , it was pretty good the only thing I didn't like the chicken had too much bones , the waiter  sat us behind the door but it was close to the entrance door  and the cold air kept coming in every time the front door was open , so he was kind and nice of us to move to the wall table . It's location right in the upscale \"Brooklyn heights \" neighborhood where all the fancy brownstones are located across the street from Saint Francis college campus  . It's right near Neiman Marcus last call Department store and Sephora Fragrance store  !!!!\n\n\n\n\nVery convenient by the mta transportation:\n2,3,4,5,R - trains ,borough hall train station,\nA,C,F- trains, Jay street -metro tech station.  \nAnd the b41,b25,b52,b103 etc bus lines that runs in the area !!!", "author": "L L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-23", "description": "NYC DEPT OF HEATH GRADE STILL PENDING. \n\nSTAY AWAY! I got VIOLENTLY ILL from the food I ate that evening and vomited all weekend, likely on account of their dirty food preparation and kitchen facilities. SEE THE SCARY INSPECTION REVIEW by the NYC DPT OF HEALTH (see screenshot). Stay away at all costs!! There are many other Indian options in the neighborhood!\nTHIS PLACE IS SIMPLY DISGUSTING!", "author": "Ben T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-21", "description": "I am giving this place a five-star review not because it is a five-star restaurant - it's a solid four-star restaurant - but to offset some of these clueless reviews with 1 or 2 stars - most notably, the guy who talks about the \"flavorless\" food; this food is so flavorful that I think this guy must work for a competitor or something.\n\nAnyway - granted - the service is awful.  They just haven't figured this part out.  I don't do delivery from there much, I mostly eat in or take out - so I can't speak to their delivery service.  But even when you dine in, it's buffet style for lunch (the only time I go), so you stand on line, get your food, and bring it to a table.  If they happen to fill your water glass - consider yourself lucky.  But once you know the place, you can always just get up and fill your own glass from the silver pitcher on the counter.\n\nSo - why the high rating in spite of this?  Because the people who work there are nice and accommodating.  I'm a regular, so they know me and always bring me fresh hot chillis on the side.  But the main reason for the high rating is that the food is excellent, period.  Whether it's tandoori chicken, goat curry, dal makhani, tarka dal, chicken vindaloo or saag paneer - all of it is surprisingly good, and a great value at right around $10.  You can't beat it.  It even comes with warm, freshly made naan.  The ambiance is decent too - you can have a conversation.  Unfortunately, they have the TV on in front of the place, but I just chalk it up to a bad idea from folks who don't know any better.  I guess some people like to watch the news while they eat, but really it's unnecessary and disruptive.  But the food - it's tasty, fresh, spicy, really you can't find better Indian food in the neighborhood at this price.  Great value!  IT'S ALL ABOUT THE FOOD!", "author": "Eric J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-18", "description": "Food is good, but this rating comes for consistently terrible delivery. Expect 30-50 minute delays every time and plan on ordering elsewhere if you ordered food because you were planning on eating :\\", "author": "Matthew D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-31", "description": "POLICE SHOW UP DURING DINNER!!\n\nI was visiting NYC and staying at a friend's in Brooklyn Heights and was craving for Indian food on my last evening in town so we decided to stop by this place to check it out. \n\nThe food was mediocre and the portions really small. The whole restaurant was rather filthy and the dishes and cutlery badly cleaned with still traces of food on them. The service was also quite deplorable - we had to ask more than three times to get our glasses refilled with water. Unacceptable.\n\nDuring our dinner, we heard a staff member getting into an argument with a customer/patron and before you knew it the staff was screaming at a customer in the back of the restaurant and cursing at him! It was truly embarrassing and disturbing. Within a few minutes the police showed up and from what we overheard it seemed like the customer had been hit by one of the staff members.\n\nNeedless to say, we quickly wrapped up our dinner.\nThe police were still present as we were paying. To make matters worse, we also happened to learn that these types of patron interactions (where cops need to be called) are normal occurrences at this \"has-been\" restaurant. \n\nNEVER AGAIN!!", "author": "John J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-27", "description": "Their delivery service is not merely terrible. It's FAR WORSE than terrible.  It's amazingly incredibly astonishingly AWFUL.\nFigure to wait at least an hour and receive cold food from a guy whom the restaurant repeatedly says is \"on his way right now\" or \"waiting outside your house\" when in reality he's nowhere near and the wait just goes on and on and on and on while the food being delivered gets colder and colder.\nAs for accuracy-I rarely get EXACTLY what I ordered.  Something minor is usually missing!!!!\n\nSo sad because the food would be decent if it arrived on time and reasonably hot!!!", "author": "Dean K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-03", "description": "Most of the reviews here said the delivery was bad but the food was good, so I decided to pick it up myself thus avoiding the major issue - so I thought. I got the saag paneer, which is my go to Indian food order to check if it's worth coming back for. Unfortunately, I would say that it's not. I love Indian food but this tasted like it barely qualified. The food was so bland that I could barely taste any flavor, if it wasn't for the different texture that the saag paneer gave the rice I would have thought I was eating plain rice. I'm honestly shocked that it's possible to have such flavorless food - especially with all that spices that Indian cuisine normally requires.\n\nThe man behind the counter seemed sweet but overstressed and overworked, as he had to constantly ask me to wait as he ran to get things like forks, bread, and containers for the side dishes. The entire place seemed a bit disorganized, and while that's fine if the food is good in this case the food didn't make it worth it.\n\nIt is a ton of food for very cheap, especially with the lunch special, so I guess if you're starving it's okay. But I couldn't bring myself to finish, even with all the add ons of onions and limes. It's 2 stars because the guy seemed nice, and the food didn't taste BAD - it just didn't taste of anything", "author": "Ming L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-12", "description": "As much as I love the food here, I don't order anymore because it always takes much longer than it should for delivery to Boerum Hill (over an hour sometimes). I hope this changes because I really do like the food.", "author": "Sam M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-08", "description": "So sad how the service has deteriorated...\nI'm a long time neighborhood customer.\nOrdered takeout a month or so ago. Repeated - extra sauce, extra order of basmati to the guy at the register.( I've always repeated my orders since my favorite server- Raki went home.)\nWalked home with my order to find only one set of sauce, and no extra rice,... and I was charged for it!! grrr!\nI haven't been by cos I was so disappointed! However, today I had extra time and craved the curry!\n\nThere was one server when I came in. After seating me, I had to flag him down to order.\nWhen I asked for condiments- he said sure, and forgot. Asked another guy who came out - he got me take out cups with the sauces. My original server never came back after placing food on the table. \n***Luckily the food was right!***\nMy water glass was never refilled. Three guys fiddled with a music cd and the video on the flat screen multiple times.... The music was then too loud to contemplate adding a chai or dessert! \nI finally called out to one of them for my check. \nWaiting for my check took over 10 minutes,.... There were 1 to 4 tables the entire time I was there.", "author": "VioletL P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-17", "description": "It's hard to review a place like this, as others have pointed out. But I've been biting my tongue for too long.\n\nCurry Heights has been the only go-to option for a while. I've tried to justify this review with as much positivity as possible, but after countless instances of the same delivery patterns, I just can't ignore this anymore. It's not a one-off situation that I'm sure the owner will claim in a response to this and apologize for, but at the end of the day, apologies don't fix this situation, you do, by improving your business.\n\nHere are some details, in two simple points:\n\n- Portion sizes are great. That's the positive. However, it's always delivered cold, even in warm weather, but nothing a microwave can't fix. When asking for extra spicy, it's resulted in the same bland food. So if you like spicy I guess you just have to accept that it never will be. White people, right? That aside, the flavors and quality appear to be good, so I'm happy with the actual food in general.\n\n-Delivery speed is unbelievably slow. As in, never have I ever had a restaurant take this long to deliver in my life. None of the other reviews complaining about the slow times are inaccurate, wrong, or deceptive. Expect 1.5-2 hours. Every. Single. Time. Cannot under-emphasize this. My wife and I strategically plan when ordering here, placing it an extra hour early so that we aren't suffering by the time it arrives. Not even joking, it's embarrassing just writing this down.\n\nAnyway, maybe you'll have more luck or if you live in walking distance stopping by will probably be a better experience. Delivery is simply not worth it in my opinion. Thankfully other options are opening up nearby that won't take 2 hours to deliver 2 cups of rice and mushy vegetables in plastic containers.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-18", "description": "Food is so good I can eat here everyday! Extensive Menu and there's something for everyone.", "author": "Karim A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-01", "description": "I hate giving this restaurant a bad review, since they have both good food and good in-store service during the two times I've been there. However, a botched order--without any sort of explanation or apology--will do that. (They do liste a way of contacting them other than by phone; hopefully this review will help spur them to fix what appears, based on other reviews, to be a systemic problem.)\n\nI've placed three orders with Curry Heights in the last two weeks (all through Yelp's Eat24 service); in all three cases, the orders were scheduled to be delivered within 45-60 minutes. The first was delivered in 60 minutes; the second took 75 minutes. \n\nThe third order (placed on 4/30/2018), however, never showed up. 75 minutes after placing the order, I called the restaurant. They claimed they didn't have the order, and eventually told me to call Eat24 before hanging up. I then called Eat24, who told me that the order *had* gone through without any issue, and the representative called the restaurant to see what was going on. After calling the restaurant, however, the representative from Eat24 told me that the restaurant had told him, \"Just cancel the order\" and promptly hung up on him, too. \n\nI can live with an order being a little late from time to time, and I can live with the fact that people make mistakes. What is not acceptable, however, is when a restaurant peddles in dishonesty in order to avoid taking any responsibility. There were half a dozen opportunities for the restaurant to get this right or fix the problem, and yet the restaurant failed to take any of those steps.\n\nI may still consider going to this restaurant in person in the future, but unless the restaurant ends up taking responsibility for its poor service, I'm going to have to find another Indian restaurant in the area from which to order takeout.", "author": "Jon E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-26", "description": "I have made the mistake of ordering from this restaurant maybe ten times. Roughly eight of these times, the order has been delivered at least thirty minutes after the time the restaurant said they would be delivering by...and about 4-5 times it took at least an hour and a half. As a point of reference, I live a block and a half away. Every time I call them on the phone I am told \"just give us two or three minutes\". Apparently two or three means thirty or sixty to these people. Food is always lukewarm at best and while it tastes good, I find myself having to reheat it as soon as it's delivered. Poor performance. I will never order from them again.", "author": "Peter C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-30", "description": "The food is amazing. But I found two pieces of plastics in my food two days straight. I didn't want to give a bad review but 3 of the dishes had those. My friends were disgusted by it . Other than that I love the food. Whatever I ordered was really good.", "author": "Elma A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-26", "description": "Amazing food! Very good chicken Tikka and amazing service and vibration. The guy was super nice and very", "author": "Bojan _."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-29", "description": "Wouldn't recommend ordering over the phone but overall the food is pretty good. The staff had trouble understanding my order and were not so helpful in providing recommendations for what to order. The food was good but I wasn't really a fan of the service.", "author": "Malisha S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-14", "description": "Thank you for the response! The dish that was an issue was the shrimp vegetable curry and not the shrimp Masala. I appreciate you guys giving me a complimentary shrimp masala since I had a bad experience with the shrimp vegetable curry. I will see how it goes today. Thanx again.", "author": "Fiya G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-05", "description": "It's located at the Remsen St, Brooklyn. One of the best Indian food I have had in Brooklyn. And yes, they do have a lot of vegetarian options.", "author": "Aditya J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-24", "description": "We stumbled upon this hidden gem because it was across from the college I spoke at, it was dark out, and we needed to be heading home. We were not disappointed to find there was something right there.\n\nI started with a drink. No liquor, but they do have both kinds of Indian beer, the big beer and the smaller beer. The big one would go great with a paper bag and a straw. I had the smaller one, as I was driving.\n\nThey played Indian music, which is nice. When I go to an ethnic restaurant I want the full immersive experience. They continued this theme by cramming us into a tiny table worthy of a country with over a billion people. Outstanding! \n\nWe had four lamb samosas. They were tasty but we had to put in a special request for sauces. The taste and consistency of the tamarind was enough to make me wish I had ordered the big beer.\n\nWe finished with the lamb saag and chicken tikka masala. With each bite we remembered the place was open and close to our car.  Brilliant!", "author": "David M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-17", "description": "Curry Heights definitely reached my expectations. \nPresentation, taste, and portions were in my favor.\nGood service too. I would recommend the chili chicken (tastes like general tso's chicken with an indian touch ) and the chicken biryani.", "author": "Anika F."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Curry Heights", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Remsen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/iIj1UCMlKN5sqaZzkBIziQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182609000"}