{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-04", "description": "Great for lunch pick up. Had the chicken tikka masala and chicken tandoori over rice w/ naan. They did reheat the chicken tandoori in the microwave which threw me off slightly but it tasted good nonetheless and i'm sure it was prepared fresh. Great flavors, good portion, great price. Would come back next time i'm craving indian food and in a rush. Service was quick and good.\nUpdate: I just tried the naan and it wasn't great. I've definitely had better, would still return to this place", "author": "Danielle G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "visited few times already , food is good , service was alright , place is very small , room to improve though", "author": "Khondokar R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-03", "description": "The food is good. Unfortunately,  the customer service is terrible. I ordered through Chase pay. They didn't have my food and also said they didn't have a relationship with Chase. Clearly the worker was misinformed. He was also very rude.", "author": "Patrick B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "Best Indian lunch in downtown Brooklyn.  Not the best in the City but best in Brooklyn.  Excellent Indian food is nonexistent in Brooklyn.", "author": "Retu S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "Why are the reviews only mediocre? A friend told me about this place and their food is stellar. Highly highly recommend. Very authentic and so flavorful. Delivery is also super fast. Yum!", "author": "Marissa P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-08", "description": "I usually like to buy the food in store during my lunch time. However, during my past 2 visit times, the fish is not as good as before. Disappoitng now.", "author": "Joanne J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-14", "description": "A delivery which I was told would take 40 to 50 minutes took an hour and 40 minutes.  I called after waiting an hour nd was told it was on the way.  Before I could say more, they hung up on me.  When the food did arrive it was ice cold and inedible.  This is made all the worse because they are overpriced.  Never, ever, again.", "author": "J B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-19", "description": "We came in to get take out on a Saturday night (yes, we are lame).  The staff was very friendly and helpful.  Most importantly, food came out within 15 minutes!  I really liked my chicken vindaloo (some place put too much vinegar, but not here).  Rice came with the order but we also ordered nann.  I would add this place to my take out/delivery list, because it is also very close to where I live.  Please note the decor is very minimal if you are looking for a nicer dining in experience.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-22", "description": "First of all Thanks to all Curry Heights Team and chef.\nI again got chance to visit Curry Heights with my friends for Lunch today.I had Combo lunch there.It was so tasty and enough in quantity food,We enjoyed our lunch.It reminded of Indian Home made food.\n\nThanks", "author": "Raj P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "Came here on a weekend with my bestie so no clue on the buffet but the saag paneer \u0026 chicken tikka masala are delish! Service was great and the staff were attentive to our needs. All in all would def return!", "author": "Grace A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-28", "description": "Awesome lunch specials!! A lot of food!!! Tandoori chicken is really good. The staff is friendly.", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-18", "description": "It's the worst kind of beef vindaloo.  Beef felt like old tire.  My husband had to spit out most of the meat because he simply could not chew.  Plus overall food wasn't good at all - seems like too much spice of one kind but missing in others.  My channa masala was not bad.\nThe worst of it was ambiance.  Somehow gym music was blasting.  Why the electronic dance music at Indian restaurant??  I finally had to ask to turn it down.  My chair seems like it has only 3 legs - shaky and unstable.  And ah yes, it took very long time for waiter to notice us.  Considering restaurant was nearly empty, 6 minutes seems too long.  One redeeming quality is that food is rather inexpensive.  But not worth it.\n\nUpdate: After reading a response comment from the owner himself, I feel pretty horrible about the bad review I wrote.  Therefore I am changing to 3 stars.  Never mind my \"beef-tough-as-old-tire\" and \"electronic-gym-music-blasting\" crappy ambiance.  The owner is apparently very nice and I certainly do not want him to lose business because of my experience.  As for coming back?  Ah...no thanks. But good luck Curry Heights.  For the love of God, stop that horrible Indian techno dance music thing.", "author": "H L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-13", "description": "Can't speak about the food.  All I can say is they litter my property, both home and car with their menus when I clearly have 5\"x7\" signs asking not to leave any menus or advertisements.  For this reason, I won't even try them even though I love Indian Food.  They need to make sure their staff distributing materials can read English and over local laws\nUnfortunately I had to put 1 star in order to post this.", "author": "Karla H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "Pros: Lunch specials and dining service.\n\nCons: Not as spicy for regular Indian food connoisseurs.\n\nRecommendation: Tandoori chicken, Chicken tikka masala, chicken vindaloo, lentils, and chickpeas. \n\nThis is my usual go-to spot for Indian when at work. You get a decent amount of food for the price you pay. If you are here for lunch (highly recommended) walk to the back and check out the 10 or so combos you can have. I go with the 2 meat + 1 veggie combo. All combos come with rice (white or brown) and 2 pieces of naan. What a deal!\n\nThis chicken is cooked very well and juicy. You get nice big pieces of chicken and the spices they use are authentic. Though its a buffet style of serving the food is high quality. I usually dine in during lunch and the service is great. They tend to your table and fill water by the sip at times. Always a pleasure here.", "author": "Karim A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-27", "description": "Said 35-45 minutes, was an hour and 10.  Everything was cold.  Chicken tikka masala sauce was consistency of water and not good.  Kappori chat was good.  Naan was good but cold.  Find another place.", "author": "Jason F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-26", "description": "Love their goat saag. Very fast and convenient for take out.", "author": "Sandra K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-05", "description": "Honestly being an American Bengali I'm very picky about my Indian desi food but I have to say ever since I discovered this spot during my break at work one day, I've been so obsessed with their food. Especially their butter chicken I get it alarmist every week lol. The owner is super friendly and so is his staff, plus the restaurant itself is so cute on the inside. Definitely recommend this spot for anyone in the mood for some authentic Indian/Bengali food. P.s their garlic naan is so stinkin good", "author": "Tahana A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-05", "description": "Three stars is right on the money for this place. They have a pretty good lunch special that you order at the hot bar in the back. I had the goat curry with a side of saag panir (a creamy spinach dish with cheese curds). It was served with rice and naan. The goat was pretty good and I liked the saag panir, though it was pretty heavy. The naan was as fluffy as everyone says it is and was definitely the highlight of the meal. I definitely did not leave hungry!\n\nLunch specials start around $7, but the 1 meat + 1 veggie entree I got was just under $9. Still, I think you'd be hard pressed to find a better deal in the area.\n\nLunch ends at 3pm so don't get there too late or they'll be out of the good stuff.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "Really friendly staff \u0026 really tasty food! My favorite food is chicken korma and mango lassi.", "author": "Reina C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-19", "description": "It's ok at most. The delivery service is terrible, they spilt everything and just shrugged it off when I asked about it. I even indicated for them to put them in a plastic container to prevent it. The chicken tikka was really really dry. I wouldn't say it's the worst and definitely not the best. But if you're craving some chicken tikka masala or saag paneer. Then this is a spot for you.", "author": "Karmen A."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Curry Heights", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Remsen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/iIj1UCMlKN5sqaZzkBIziQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182609000"}