{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-15", "description": "Ended up eating here with a friend one very cold night this winter. The service was super and both waiters took such nice care of us. The food was DELICIOUS. Really great dinner prix fix menu. Excellent Chicken Tikka Masala and delicious naan. A lot of Brooklyn Indian restaurants aren't very good, but Curry Heights knocked it out of the park.", "author": "Pepper P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-14", "description": "I order the chicken tikka Marsala from meal pal.. the food was tasty and excellent! good portions very happy with the choice! I was initially skeptical a bit due to yelp reviews but after try it out.. so happy to find good Indian food. only bit problem is when i went there.. the meal wasnt ready yet.. i had to wait to pick it up, luckily it was already pre-made.. but it be nice to just come and pick up", "author": "Celena S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-12", "description": "Curry Heights is one of my favorite place in the area. It's near my office and I take like 3/5 of my lunches there. I took number of my office colleagues also there for lunch - though they were not used to Indian food but they really liked the food and place. I love thandori chicken - make sure they warm it up well - and all the vegetables as cabbage, okra and spinach with white rice.", "author": "Ahmed S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-24", "description": "Great tasting food. I love the tandoori chicken and garlic naan. The staff is friendly and service is good.  Great place to go if you want a great lunch.", "author": "Yeemei C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "I absolutely love this place. I have to children that are very picky eaters, and i was afraid i wouldn't be able to find anything on the menu for them to eat. well to my surprise they enjoyed every bit of their dishes. and i must say besides the food being great the restaurant its self was very pretty. the portions of food and the manner that it was served was a big plus. definitely coming back!! \n\nP.S... The price range was reasonable!", "author": "Fatima S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-15", "description": "This is decent American-style Indian food. The problem with Indian food in America is not that it's spicy, but that it's watered-down, sweetened-up and spiced-down to please palates that enjoy sugary salty pap like American-style pad thai and Dunkin' Donuts croissandwiches.\n\nIf you've tasted Indian food in London or India then you'll be disappointed - but, in this neighborhood, Curry Heights is about as good as you'll get. The meats were tender. Everything was tasty, though nothing was spicy. (Other users who've written that everything is too spicy just have no idea what Indian food is - how can basmati rice be \"inedible because it was so spicy\", as one reviewer wrote? It's not even flavored!) If you want Indian and you're in the neighborhood, this is a comfortable bet. I'll be back.", "author": "Josh Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "I love Curry Heights and I dont care who knows it!  Being a white girl from California, I don't purport to be an expert in Indian food and I cannot weigh in on the authenticity of the cuisine at Curry Heights, but there is literally nothing to hate about this place.  Their meal deal, at $14.95, is my go-to each and every time.  The food is hot, fresh, flavorful and just all around wonderful.  I also think the paneer at Curry Heights is the best I have had anywhere in the vicinity, they just cook it perfect every time.  Their naan is perfection.  When I order out, the delivery is quick, and when I eat in, the servers are incredibly nice and attentive, so much so that I feel as if I do not deserve such quality service for the very reasonably prices.\n\nIf you want pretentious Indian food with expensive alcohol and small portions, I recommend Dosa Royale on Court (no hate, I go there too and its wonderful-- just a different vibe).  Otherwise, Curry Heights its where its at.  All day every day baby.", "author": "Vanessa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "This is not the BEST Indian food restaurant but its certainly not the worst.\n\nI vote take out/delivery over dining in. decor is nothing to subject yourself to.\n\nMy favorites: Vegetable Samosas (like a gigantic fried potato pierogie or dumpling), Chana Saag (chickpeas and spinach), Naan (soft bread) and Mango Lassi.", "author": "Michelle G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-12", "description": "I've generally had okay experiences here. The food is okay, but not exceptional.\n\nTonight, I ordered through Grubhub at around 8 and got a confirmation at 8:15 with estimated delivery at 8:45 to 8:55. At 9:15, they told me that their delivery guy was on the way. This was a lie. At 9:50, they told me that their computer was down and they hadn't seen my order. As of 10, it's been two hours and I still don't have my food.\n\nI don't mind that their computer malfunctioned and my food is late. That kind of problem is unavoidable. But it's absolutely unacceptable that they lied about my status when I placed my first call.\n\nThey get 2 stars instead of 1 star because I've had okay dine-in experiences before.", "author": "Benjamin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "The peshwari naan, coconut samosas and chicken korma are out of this world! My standard order whenever I go! I love this place!!!", "author": "Beth V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-30", "description": "I've eaten here twice. The chicken is always as dry as jerky and the rice is over cooked till soggy. The portions are not great comparatively speaking and spicey means a dash of hot sauce. Really disappointed.", "author": "Kay Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-12", "description": "Fast, cheap Indian food with solid lunch specials. Decent amount of space though a bit dark/dreary. Note: I've only had the large-batch prepared stuff under the glass, never ordered from the menu at the table.", "author": "Meg M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "All the food was great. The mulligatawny soup is very tomatoe-y but they warned me verbally about that and I enjoyed it, although I like it with a bit more lentil ultimately. The vindaloo is really spicy, which is exactly what I wanted. The rice had good flavor and a bit of oil in it and cumin. The sauces with the papadam were the most memorable thing especially the coriander (nice and tangy and dairy free) and the tamarind sauce, nice and fruity, not sugary and thin.", "author": "Jesse H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-20", "description": "I used to live in the East Village, and Curry Row always baffled me. I never understood why so many Indian restaurants would set up all in one spot and directly compete for the same business. \n\nBut regardless of whether or not it makes sense to me, I loved it. Perhaps because it's automatic quality control. Since there were so many options so close together, the restaurants had to serve stellar food, or risk going out of business. And as a result, I was never subjected to the blandness of my meal at Curry Heights (the only Indian option nearby). \n\nThe tikka masala was watery and thin; it tasted like sweet tomato soup, with chunks of chicken in it. The chicken pakora was entirely too bready, and although the lamb bhuna was edible, it was unremarkable in every way. \n\nAlthough you do get a sizable meal for your money, I think I've eaten too much excellent Indian to justify a return visit.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-10", "description": "I usually get the chicken tikka with a side of masala sauce, with veggie samosas. I think this is the best Indian food in the area. \n\nThe food isn't perfectly spiced, but it's a nice chill environment, good service and solid Indian food. I've been here a handful of times and is now my go-to in the area.", "author": "Tanya M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-26", "description": "Everything you expect from a good Indian food joint. Cheap. Big portions. Plenty of choices. Lunch specials are incredible - entrée with 1, 2 or 3 sides. Food tastes fresh. Counter and wait staff are pleasant. I would go back in a heartbeat.", "author": "Chuck G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-29", "description": "Curry Heights is one of the few Indian restaurants in my area, so if you're craving naan and such, you're pretty much stuck.  \n\nThe place is cozy and friendly, and the prices are reasonable.  Also, the portions are generous.  The problem is that the food is nothing special, so that tempers my excitement about the prices and portions. \n\nThe saag paneer was probably the best thing I had--it was tasty and savory, but the chicken tikka masala was lacking.  The sauce was mysteriously smooth and thin, whereas better iterations are a bit thicker and chunkier, with a more assertive flavor.  There was plenty of naan to soak everything up and I left really full and pretty satisfied.  Given the dearth of Indian food where I live, I will probably be back and venture to try something else that may be better executed.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-30", "description": "Wish I could give 0 stars. Was told that my food would be delivered in 30-40 minutes, but hasn't arrived after 2 hours. Don't waste your time here.", "author": "Eric S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-17", "description": "First, the staff was really rude to me the entire meal, I almost got up and left. The music was way too loud and the base was distracting the entire time. Not a very good environment. The food was not that great either and overall didn't love the experience.", "author": "Julie W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-21", "description": "Well, the hospitality sucks, they don't know how to deal with people, very rude. I won't go again ever.", "author": "Pranav T."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Curry Heights", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Remsen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/iIj1UCMlKN5sqaZzkBIziQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182609000"}