{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-05", "description": "This place has a sticker outside on the window that says \"People love us on yelp!\". Man people should not up those stickers if it's a lie! I mean I'm giving them a good review right now, but overall it does not seem that people love them on yelp.\n\nThe waiters were very nice- I wanted butter chicken but didn't see it on the menu. I asked them if they had it and they said \"we'll make it for you, no problem at all.\" It came out very good! Their naan is fresh baked and is the fluffiest and softest naan I ever had in my life. They brought us a basket with 3 pieces in it! (We were only 2 people). I forgot what my friend's dish was called but it was also very tasty. I'd eat here again if I was in the neighborhood.", "author": "Catherine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "I've ordered from here a lot since my last review and upping to five stars because you guys are awesome!!! (And I have enough rice now, thank-you :)", "author": "Christine P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-03", "description": "This place is always empty. I have only eaten in two times and both times the staff was attentive and the food was ok. I have also ordered from here a couple of times as well. The delivery comes really fast and the food is as good as it is in the restaurant but maybe slightly smaller portions. \n\nThey have a pretty great deal for $14 you get naan, chutneys, an appetizer, and an entree.", "author": "Collin B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-03", "description": "Meh?\n\nDespite others issues with delivery, mine was quick and friendly. \n\nThat's about the end of the compliments I have for curry house. I had a greasy samosa, rock hard onion bhaji and watery and unflavorful vindaloo and tikka masala. \n\nThe naan was alright. Nothing was bad, but nothing was really any good. \n\nNext time I'll spend the extra $1 per person and order from Baluchis.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-22", "description": "Looking forward to eating this oily looking chicken tikka masala with my hands since apparently $18 doesn't buy you a fork and napkins \"unless you request them\"", "author": "Asher E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-31", "description": "This is one of the restaurants I frequent in Brooklyn Heights because it is the best of everything. First of all, their food is great!  Well flavored, and spiced. I keep going there after having tried their dinner menu, and their crab curry (yum..that freshly made curry with lots of fresh real crab flesh! I don't eat processed foods!) has been my favorite while my husband (who is an utmost vegetarian) loves every vegi dishes there. Only several months ago, I found out they have  great lunch special menu, which I have been missing out all along. During the lunch special, it is very crowded, as people who live and work in the area would know it is the best place to go to get a quality food for a reasonable price. I don't like to spend too much money on food which are not worth it (considering how many other restaurants in that area charge outrageous price for a so so food- a bubble!), and usually don't want to spend too much money daily for a regular meal (i have a busy schedule, so has to eat out most of the time). I have been so happy after finding Curry Heights as there are only a small number of restaurants in that area where I can get a great food for a reasonable price. Sometimes, they don't seem to have many people there at night or after their lunch special (which I like), and I recently found out it is mainly because they have so many delivery orders coming in.  I also love the staff there, they treat you like a friend, very generous, and attentive. \n\nI have introduced this place to my coworkers and friends  and all of them loved the food. \nThis is an absolutely must-go place if you are in Brooklyn Heights, looking for delicious quality food at a reasonable price.\n\nHmm, now my husband and I are almost addicted to their spicy lentil soup, which cleared up my husband \"cold\" recently. I strongly recommend this place if you are into healthy eating. I am trying to keep in shape, recently having gone from 150 pounds to 134 within 3 months (5 feet 9 inches tall) while eating their dishes, so obviously with all the delicious and rich tastes, their food is healthy enough, and not fattening.\n\n\nHighly recommended! Keep up the excellent food, service, and price! I will go there forever!", "author": "Soo C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-07", "description": "*DONT ORDER DELIVERY IF YOU'RE HUNGRY*\n\nYou can get an appetizer and entree for about $12.00 all the time which is great.  They have a huge selection of vegetarian entrees and meats.  \n\nI've never actually sat in the restaurant but order often from seamless web and usually wait 1hr - 1hr 15 minutes no matter which night of the week or how the weather is.  Also they have forgotten items I've ordered before.", "author": "Daniel L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-12", "description": "This place is about it for Indian food in the neighborhood.  I've been here twice for lunch with colleagues and both times the food was edible but simultaneously bland and overly salted.  There was really nothing noteworthy about any of the items (I've tried a few curries).  No spice, and the chicken was just chunks of the same meat mixed into different sauces. The saag paneer was a bit watery, too.", "author": "Sara H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-15", "description": "I like the Dal Malkani a lot and the Broccoli appetizer with onions. I'm not a vegetarian, but when I order from here, I like to get both of these dishes.\n\nLove the tomato and pesto sauces that come with the meals.", "author": "Stefanie J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-16", "description": "bad food ever.. quality is worst. informing about food got the response like your test is different, there are thousands of people coming for eating at our restaurant and the owner is billionaire \n\nwhat does it make difference to me if the owner is billionaire ..\n\nyou will see very strong food color in their foods.. even after washing hands with soap, it didnt go..we order paneer tika masala and paneer quality was too bad..never go to this restaurant..", "author": "Vijay K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-06", "description": "This place is kinda in the cut. Upon  entering the establishment I was greeted by a shaded waiter. When I asked him  why does he have shades on in a dimly lit place he told me that his allergies were messing with him... Hmmm... First strike... The atmosphere is nice.. Quiet but yet busy. I can they'll that they have a large take out  crowd . The delivery man was coming in and out constantly.  I ordered the bonna (sp) bread as a appetizer and the curry chicken as a entree. The sweet sauce to the bread was AMAZING  I would go back just for that, the chicken was okay. Could have been more seasoned but all and all if was okay... Would I go back again... Ummmm maybe to order out. MAYBE!!! ..", "author": "Jonathan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "Mystery to us how the 2015 reviews could be negative. We used to love this place, then it went a bit down hill last year. Decor isn't as nice as it was, which is the only reason we take a star away.\n\nWe've had excellent Mahli Kofta, Lamb Saag, Tikka Masala, and Chicken Biryani. And their take-out portions are huge. And, now they ae open some nights until 2am.", "author": "Mary R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-18", "description": "I've been here a lot and get the same thing every time, #4 with chicken tikka masala. I highly recommend it. Everything is already made and sitting on steam tables, so it's convenient if you're in a hurry. I gave it 4 stars, but that's just me comparing it to other lunch places in the Brooklyn Heights area... I don't know how it compares to Indian food elsewhere in the city as I've only been here.", "author": "Alexis M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-04", "description": "I ordered through seamless to pick up, but they said they did not receive the order even though he said exactly what it was and i got charged for it. Disappointed that i wasted my break time for this misunderstanding.", "author": "Camille N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "The food and the service at this restaurant is stellar.The staff especially Raki are committed to providing a superior customer experience.The food is fresh and very delicious. I highly recommend the Chicken Tikka Masala, Chana Saag, all in all everything you order will be an amazing taste and dining experience.", "author": "Mary R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-20", "description": "This place was awesome. I was stuck doing jury duty in the Downtown Brooklyn area and wanted to find something inexpensive, delicious and relatively healthy to eat. I got lucky and stumbled upon Curry Heights. I asked the owner Karim for some help in choosing the food. He set me up with a platter of Tandoori Chicken, Okra, Spinach and Aloomotor Gobi The food was delicious. The food was inexpensive. Where can you get an awesome lunch for around ten dollars anymore? And, the service was phenomenal. They were extremely courteous, friendly and super super fast. Go and ask them whats good to eat. You cant go wrong. Great experience there!!", "author": "Glen K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-22", "description": "My family and I came here when they were in town.\n\nLet's just say we ordered a lot of food, I mean a lot.  From Chicken Korma to the Biryani to every type of Naan possible including the Alloo Paratha.   Honestly this was awhile back and i forgot to write a review but the food was really really good! \n\nThe service was horrible, and the food honestly took foreveeeeerrr!!! \n\nI tried ordering delivery to see if it was any better and a 30 min delivery time took close to an hour.... food was still good but wait time was a bit out of control!! \n\nHighlights of the meal was the Biryani, the Korma and the garlic Naan!!", "author": "Dena A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-08", "description": "The food is ok, for a $8 lunch special. Nothing mind blowing.  I find it odd that they microwave the chicken tandoori before they pack it up to go. My chicken tiki was cold today. Saag paneer was ok", "author": "Paul L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-26", "description": "My sister lives a couple blocks away from this joint and recommended it to me for dinner on my way home from her place during today's blizzard.  The first bad sign was after I placed my order online, I was presented with a screen that said \"for best service, please call us to confirm your order.\"  Now, I've ordered online takeout hundreds of time, and I figured it would be pretty dead, so I just decided to go in about 20 minutes later.  They had not started my order yet.  So I ask the guy if it's ready and he feigns confusion, checks the computer, and mentions that he had to check in the back.  He returns and says to me that \"it'll be ready in just a few moments.\"  I ask him point blank if they just started it, to which he responds. \"Yes...just 6 or 7 more minutes!\" \n\nAt this point I almost walked out, but I was really in the mood for a nice curry and I didn't want to wait for delivery in this weather... Despite my better judgment I waited.  When my food came out, he said \"you know, you should just come in...don't order online.\" I responded that had I ordered takeout, they never would have gotten to it, his only response was \"next time just come in!\"  No \"thank you so much for your patience.\" No \"have a papadum on us...the weather is really lousy!\"  Just kind of a \"don't let the door hit you on the way out.\"\n\nGiven my sister's recommendation, I decided to mask the bad taste in my mouth and just try to enjoy my food.  The paneer tikka app was pretty good.  The onions and marinade were smoky, the paneer squeaky.  But the pieces of cheese were just too darn big!  \n\nMy chicken madras, which in the picture looked like a bright and thick tomato sauce, was pretty much dried out chicken in a watery and tasteless brown curry with a few chunks of tomato.  Severely disappointing.  \n\nPortion sizes were decent but the place was not cheap... next time I'm going back into Manhattan, blizzard or none...\n\nPS the tamarind chutney? tasted watered down...", "author": "Matt L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-22", "description": "This is one of the few places in the area that will take credit cards AND deliver to my office in DUMBO.  My office had tried them for an end of year party, and the food was alright.  I was told that the spices weren't as complex as they should have been, but for an Indian food novice such as myself, this was probably not a bad thing.  So I decided to order lunch there one day.  \n\nI ordered online, and the food came just when they said it would.  They have different lunch specials you can order online.  The choices are fairly limited but the price is reasonable and they didn't charge a delivery fee for my less than $10 order.  Unfortunately the naan had a hair in it, and I discovered this after I had eaten everything else.  Completely ruined my appetite. \n\nI gave them one more chance when my coworker wanted to order, and this time delivery took almost 90 minutes.  By the time we got the food it was only luke-warm.  I ordered at about the same time as the first time, so I don't know what happened, but I was not pleased.  And the delivery guy was pretty rude.  I'll save my money and find a better place near my house next time I'm craving Indian.", "author": "Rebecca G."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Curry Heights", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Remsen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/iIj1UCMlKN5sqaZzkBIziQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182609000"}