{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-13", "description": "I am friends with the boss. and I know that there was a person on the  crew who was extremely rude and insincere but was fired So who ever rated this under 3 stars. I strongly reccomend you visit Curry Heights again and rate again based on your expierence.", "author": "Meghla S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-01", "description": "We ordered delivery from Curry Heights, choosing to try their lamb korma, lamb tikka masala, and butter chicken. I'd rathe the lamb tikka masala as the best out of the three; korma was not the best, but the butter chicken was delish--as was the garlic naan. The price and punctuality of delivery were good, and both of us were happy with the portion sizes.", "author": "Louren enid C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-04", "description": "The best curry for delivery in the heights!  I'm a fan of the generous portions with the Two-Course Meal Deal that is One Appetizer, One Entree And One Naan.  I've enjoyed their samosas, chicken korma and saag curry.  Can't wait to try more dishes!", "author": "Lindsay M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-09", "description": "Super-fast delivery, a little more $ that what I was accustomed, but fair.  Plan on going back.  Chicken Tikka and Garlic Naan are my fav, and seem to be very reliable...like consistent.  Haven't had a bad menu item yet...", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-01", "description": "Solid local Indian food, and their spicy means HOT, which makes the hubs happy.  I've had better Indian, and if Kinara in Fort Greene will deliver to you, I think the food is better.  But this is solid... with the exception of the navaratan curry.  That was pretty icky.  But otherwise we've had good vindaloo, tandoori fish, and spicy shrimp curry.  PS - the banana pakoras are a yummy little treat if you get the dinner combo deal!", "author": "Katie Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-17", "description": "I ordered with seamlessweb.com, and it said it would take 30-45 minutes.  It took 26 min to get the food to DUMBO!  And it's good!  The \"medium\" spice is really spicy, so I'm glad I didn't get \"hot\".  I'm so thrilled to have another delivery option to DUMBO, since we have slim pickings down here.", "author": "Jen W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-14", "description": "Get exactly what you pay for. Order delivery via Seamless. Took longer than expected (about an hour), and it was not very spicy at all (ordered medium spice). But it was good and hot. Pretty much what I expected. Nothing to write home about, but I would order from here again.", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-30", "description": "The disappointment continues.  Can someone please open a decent Indian restaurant in the area??  We ordered three vegeterian dishes and they all tasted pretty much the same, which is to say bland and slimy.  Of all the things to miss in an Indian restaurant, I just can't believe *flavor* would be one of them.  \n\nI give two stars instead of one based on: (a) fine naan, (b) on-time delivery, (c) no local competition whatsoever, and (d) a lack of digestive issues (which may be unsurprising given the comcomitant lack of spice).", "author": "David B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-23", "description": "Curry Heights' food is bland an inauthentic, much like all the other Indian restaurants in the area. I have tried 3-4 different vegetable curries from them, all bland and made with vegetables which do not belong in Indian cusine. Today I got a vegetable curry with broccoli, and carrot and zucchini cut in batons. Really? It makes me wonder if the people in the kitchen are even Indian. The vegetables were prepared as if for Chinese food. It was the most tasteless curry ever. It's just a shame there is no good Indian in Brooklyn Heights/BoCoCa. (And strange that they all keep changing their names and moving around, but many share the same wording on their menus.)", "author": "Aqua W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-13", "description": "Wow!  Unexpectedly, I have found a new Indian favorite, and just in a nick of time!!  (My all-time favorite here in NYC was Madras Cafe, which recently has closed its doors in Manhattan.)  So what do you do when you're grieving a love lost?  Distract yourself with  a delicious replacement, of course! \nWhile I was working late, I decided to give the relatively new-ish theCurry Spot a try.  I ordered some takeout to scarf down while still at the office, and I'm so glad I did!!\nWhile I usually tend to order entrees like Saag Panir or Malai Kofta, this time I opted for the Yellow Takra Dal (Yellow lentils with onions, fresh garlic, and spices.)\nIt was deliciously flavorful---rich but not too heavy, with subtle spices that left me with a really satisfied feeling.  It was served with delicious Basmati rice, with something orange added (spices?)  I also splurged and ordered the Garlic Naan, and it was garlic-y goodness beyond compare.  (Probably not a good thing to order during/before a date, although it was quite tasty...)\nJudging from what I've had so far, the other menu items promise to be very good as well.  Everyone working there was so friendly too!!!  I can't wait to go back!", "author": "Joolz M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-05", "description": "Here's a breakdown of lunch yesterday; my first time at Curry Spot...\n\nI ordered: lamb-mint samosa and lamb biriyani lunch special, which includes naan, a bit of lentil soup and a dessert. \n\nThe Good: In fairness, the lamb-mint samosas were delicate and flaky. The lentil soup served with my lunch special was quite decent. \n\nThe Bad: First bite of lamb from lamb biriyani, pure gristle. Had to discard on plate. Second bite of lamb from lamb biriyani, pure bone! Nearly chipped a tooth. Biriyni itself was meh. Not so great, so I didn't eat too much of it, but not so bad that I wouldn't consider it as a dinner/leftover consultation prize. \n\nWhich brings us to...\n\nThe Ugly: Where this place fails HARD is with the service. I was just about the only person in the restaurant, but the waiter was angry, uncaring, and perhaps had a depth-perception problem. There was no \"hello, what can i get you?\" Instead, dude just shuffled up to the table and demanded my order. As glasses and plates of food arrived, he dropped the plates the last 1/2inch to the table like an angry Jersey diner waitress and shuffled off again. Clank! Bowl! Clank! Plate! Clank! Clank! \n\nWhat the hell, dude?  \n\nAt meal's end, I had half of a meh biriyani left that I wanted for leftovers. Nope! Same guy storms over, and starts clanking plates-- clank, clank, clank! It's nearly cartoonish. One of the first things he grabs was my would-be leftover biriyani. As I raise my hand to say, \"wrap that please\"--clank!-- he stuffs the bottom of my soup bowl right onto the remaining biriyani. \n\nEpic Lunch Fail!", "author": "tim m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-05", "description": "It wasn't bad and it wasn't good.  The sauces were tasty, which covered up the dryness of the lamb.  I don't eat Indian food very often so I am far from an expert but I would say this was mediocre at best.  The place was pretty empty so each table had their own server, so I can't complain. Service was good.  The naan was delicious, but that's hard to mess up, right?  Would I come back here? Probably not but mostly because I learned that I am not a huge fan of Indian food.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-02", "description": "This location on Remsen Street has seen a string of Indian restaurants, each less memorable than it's predecessor. Thankfully, Curry Spot has turned that trend around. The food was fresh and tasted home made from high quality ingredients. Looking forward to the next meal.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-13", "description": "This place is crawling with mice.  Our waiter comforted us by saying that \"they come every night.\"", "author": "Charley T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-17", "description": "I'd been craving Indian for some weeks now, and I finally had the chance to order some. A friend and I have ordered from here via GrubHub a couple of times and our food was delivered a full half hour before the estimated delivery time both times, which earns a star in and of itself in my opinion. Despite the difficulty I had understanding the delivery guy when he arrived, I think this is a good choice for Indian food if you are ordering in. We both ordered the chicken tikka masala which was delicious and enough for us each to get 2 meals out of it. I have not had a whole lot of Indian food before, but my friend grew up eating it and she said it was very good. We also ordered some naan, which was fresh baked and yummy. Although I think $2.25 for one piece of naan is a little ridiculous, this seems to be the trend at all the Indian places in the area, so I'll deal. I would definitely order from here again.", "author": "Natalia O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-19", "description": "I'm in the area regularly and I like going here when I don't feel like cooking or venturing out. It's usually this or In the Heights.\nTheir dinner special is great, although it doesn't exactly save you much. I'm not an expert on Indian food but I have tried many different places in the city and this was definitely one of the better ones.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-01", "description": "If you are looking for a large amount of Indian food for low price, Curry Heights is the place to try in Brooklyn Heights. The food there is good and the place has delivery. I tried the Lamb Tikka Masala while my friend got the Lamb Curry. The  portions were large and the food filling but I was left a bit disappointed by the quality of the meat. The curry, however, was impressive and better than a lot of other Indian restaurants that I have tried.", "author": "Divya P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-22", "description": "The food here is excellent. I would definitely eat here again, only I would make sure to order it as take-out next time. The service here was atrocious. I felt unnecessarily neglected for the entire meal... until they dropped the check; that was prompt enough. TLDR: great indian food; get it to go.", "author": "Conroy W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-23", "description": "Just ordered here for the first--and last--time. Thank you, Curry Heights, for ruining my lunch! First, I have never had papadum (papadom) this awful. It's a wafer for goodness sakes, how can you mess that up?! It was overly spiced but more importantly, it wasn't crispy. I was shocked that I had to work to break into its staleness. Just bad. Second, DO NOT order the Kachori appetizer. It's awful and not even close to the description in the menu. It was supposed to me stuffed flattened pastry when instead it was a pile of soggy, fried (if I had known it was fried, I wouldn't have ordered it) chips with some chick peas at the bottom and a topping thrown on top. Terrible. Third, when I told them I was getting a message from their online ordering that the restaurant was closed, they pointed to a computer. Um, OK, how does that help me? I have to go out now and spend more money on lunch since I couldn't eat Curry Heights's crap.", "author": "Marie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-27", "description": "This place was delicious. The servers were friendly and the food came out quickly. It could be because we came past the dinner rush, but we did not experience the wait described by others. Check it out for some tasty reasonably priced Indian food.", "author": "Inna Z."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Curry Heights", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Remsen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/iIj1UCMlKN5sqaZzkBIziQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182609000"}