{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-03", "description": "Terrible. Used to be good. They must have changed owners. Never again. The dal is just garlic chopped with undercooked beans from a can. Their naan is bag bread. Disgusting", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-08", "description": "Having moved recently to bklyn heights we were happy to find decent Indian food nearby.  Have eaten here three times and happy with chicken tikka masala and malai kofta.  Reasonable prices.  One time with takeout the bread was underdone and cold, but otherwise good.", "author": "Michael T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-22", "description": "This is the best Indian restaurant in the neighborhood- their delivery is amazing, the guys work hard to get you your food quickly, while it's still hot! It's consistently delicious (garlic naan is awesome), and I just wanted to share my support!", "author": "Colleen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-12", "description": "Great food and good service. I've had the tandoori wings, lamb chops, salmon, spinach and paneer, spinach and chick peas, garlic naan and shrimp masala. They are all delicious. I highly recommend Curry Heights. I come from NJ and pass Little India in Jersey City and Edison to go to Curry Heights.", "author": "Chaunelle R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-05", "description": "Delivery service is absolutely horrible I had to call back 3 times and they ended up being over an hour later than they said they would be.", "author": "Steven R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-09", "description": "Terrible delivery service - 45 min late this last order but unfortunately it's a pattern with these guys. Rude owners and staff onsite. Hung up on me twice when trying to inquire about where my food was. \n\nFood is really only average. In business because there are no other Indian options locally. Will be taking my business elsewhere.", "author": "Jenny F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-07", "description": "The food is excellent; great portions at reasonable price. They failed my water refill test (when you see empty glass, what do you do as a waiter or restaurant staff); became very impatient after waiting 15 minutes after card was given to pay bill; it probably would have been more than 15 minutes if I did not ask for debt card back while still in their black leather recepit holder; end up paying cash after their staff wanted to process the debt card; me and my fiancee still left a tip. \n\nWhat I took from this experience; we probably need to order takeout from them instead of sitting in; based on the wait to close our bill. You get to see what's priority.", "author": "F.A. R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "It seems the low rating reviews are mostly for the delivery from here, because eating in was a pretty good experience and the food was delicious. Maybe it also had to do with the fact that it was pretty empty with it being between Christmas and New Years?\n\nAnyway, our server was helpful in suggesting a few vegan options from the vegetable curry section, and I went with the Mixed Vegetable Curry. It had a great combination of flavors, a little bit spicy-hot but nothing that made my mouth burn or anything. It also wasn't super heavy or oily like some curries I have had elsewhere.\n\nService was good. Our water glasses were refilled a few times without us needing to ask for it, and they gladly brought another bowl of rice when we requested it. The only weird thing that puzzled me was that the entire time we were there, they were moving giant metal racks through the dining area into the kitchen from outside. Just not something you'd expect to see while eating dinner.", "author": "Barbara C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-09", "description": "This place is fantastic and they really go above and beyond to make sure that we feel like valued customers. We order from this place every week and I'm really happy to be a customer!", "author": "Emily J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-05", "description": "I can bet two hands down that the cooks  taste buds have been compromised by something, ....why I  saying this is because they are heavy on the salt...hence my self and my company couldn't taste the food, so it makes me wonder what is being hidden here, salt can be used to hide old meats or to cure old meat thus keeping it longer ... I suspect in this case they cure there meats a brine thus preserving the meats keeping it longer... aging the lamb  mark you nothing is wrong with doing that however over indulging in the salt is  not halal which makes me suspect other thing...I believe in tasting the Integrity of the food that is served to me I don't need to camouflage of salt sugar or any other condiment over powering the food, I believe that is a popular taste bud opinion, I can assure you that this is not a traditional Indian restaurant... this is a want to be Indian restaurant ...", "author": "Reo A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-17", "description": "First time here - great service and great food! They accidentally got our order wrong, but caught it before we did and quickly fixed it.  Flavors were good and people were nice. Would come back.", "author": "Les G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Honestly the chicken vindaloo is everything I've ever dreamed of and more. I could and would eat this everyday.", "author": "Ella B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-30", "description": "I love the food at this place. This is the only Indian restaurants in the area which can sometimes backfire on you. I am so glad that Curry Heights has not gone down in their quality or service. The prices are reasonable as well which is definitely a bonus!! The people that work there are very nice and accommodating. They are always willing to answer a questions of \"what is that?\" or \"Is that going to be too spicy for me?\" I love the seafood korma here- it is so fresh and creamy. It is a big enough portion to last two days for me. (And I am greedy) I have also have had food from the buffet which is good as well. I was leery just because it is out there under the lamps and Indian food can be your worse enemy if not kept in optimal conditions... I have never had  a bad experience nor have any of my friends that eat here. I also love their nan! It is yummy and freshly made for you. The mango lassi is good too! I'm so happy that they are still in the neighborhood!! Cannot wait to eat lunch here soon!", "author": "Kia A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-12", "description": "Terrible delivery service. The attendant lies on the phone saying 30-40 minutes when actually it took TWO HOURS AND A HALF to delivery 2mi away from the restaurant. Food ok", "author": "Paula S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-16", "description": "A bunch of tables.... 1 server. Phone is constantly ringing and service is slow. \n\nThe server finally came over to take my order and I asked if a substitution could be made. He said he would check and never came back. \n\nI ordered take out from here one other time and the food was mediocre and again took forever. \n\nSave yourself and order/sit elsewhere. Would not recommend.", "author": "Ramon R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-05", "description": "Don't order on weekends.  They can't handle getting slammed and deliveries are missing orders and takes anther hour or two to complete.  Very poor execution.", "author": "Vincent M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-05", "description": "This restaurant is a piece of JUNK!!! I went with my family for a evening dinner last week. I ordered for Veg Korma and they gave me Navratna Korma which has fruity flavor. We have specifically asked not to get Navratna Korma as we don't like fruity flavor. But he got Navratna Korma instead. When we inquired, one of the person said it was Navratna Korma and he went to check with his manager for replacement. The manager came after making us wait for 10 mins and said that it is Veg Korma and no fruits were added. We half-heartedly accepted and requested for check with none of the food tasted close to being tasty. Manager came with Navratna Korma written in the check(N Korma in attached image) and changed it to Veg Korma(V Korma) in front of us. I inquired why they are behaving so cheap to the Customers by not accepting the mistake the chef or their people did and making Customers eat what they prepare instead of what is being ordered. The Manager throw-ed my credit card on the table and shouted at me that there is no need of any money. \n\nPeople go to a restaurant for two main reasons:\n1) For good/quality food to satisfy their taste buds and hungry tummy.\n2) For better customer experience sitting in a restaurant.\n\nThis restaurant offers nothing but a PIECE OF SHIT!!! If you don't believe me, please check the image which i attached as a proof. There are dozens of many good Indian food in Brooklyn and Manhattan area. So better try those and don't make a wrong choice by eating in this restaurant.", "author": "Arunkumar B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-01", "description": "Food was good but don't pay through yelp because this guy will act like you are trying to steal from him.\nLiterally asked me how he gets paid from yelp.... as if I would know.\n\nThen when he realized I was right, he just said it's okay you can take it... and waved me off like I was inconveniencing him.  Probably won't go back but not because of the food.", "author": "Lee D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-02", "description": "WOW!!! India right in Brooklyn!\n\nI've been to India quite a few times and loved both the food, as well as the friendly people and hospitality. Not to mention the enormous amount of quality food you get for your buck. I've been living in NY for many years and never quite found this \"perfect Indian\" combination. Not until yesterday when I first visited Curry Heights.\n\nThe food is amazing. Genuinely Indian with the best of ingredients. Whether chicken, lamb or goat, it was all extraordinary. The variety is also impressive.\nThe hospitality is exceptional. These guys really make you feel like the center and will do anything for you to enjoy and all in a very friendly attitude.\n\nAnd finally - the price. Fair is an understatement... an amazing dish twice the size than in Manhattan will pretty much cost half here and with no compromise on quality. On the contrary!\n\nI even got to sit with the owner who came to say hello and had chai with me :)\n\nBottom line - warmly recommend. Totally worth the short train ride from the city!", "author": "Ron L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-29", "description": "Struggled a lot with writing this review since it was a bit of a mixed bag. The food was mostly great. We had a chicken tandoori, bindi masala and saag paneer. The tandoori was good but not spectacular; the bindi and saag were excellent. \n\nUnfortunately the service on a Sunday evening left much to be desired. We were seated promptly but it took nearly half an hour before a waiter came to take our order. We almost walked out since we were waiting for such a ridiculously long time. They appears to suffer from a fair queueing problem, where the delivery orders keep preempting the staff so they only come around to the tables once the phone stops ringing, and since the place is apparently quite popular for delivery orders, it's rare that the phone ever stops ringing. \n\nThe decor could also use a bit of an update; it's pretty dim inside and the carpet and interiors are a little on the threadbare side. Anyway I'll probably be back soon enough since the food was just about worth the wait.", "author": "Ramesh D."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Curry Heights", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Remsen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/iIj1UCMlKN5sqaZzkBIziQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182609000"}