{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "Screw the spoiled transplanted yups who turn their privileged noses up at this place - Curry Heights is absolutely awesome considering the low prices. I'm heading here for lunch in 28 minutes.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-12", "description": "Really just not good. Oh, and there was a STAPLE in my chicken tikka dish. Yes, I'm serious. Chana masala was flavorless too. \n\nThe place itself is just sad. On a Friday night at 8 pm when I went to pick up my food there was 1 couple in there.", "author": "Ariel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-01", "description": "I've been ordering at Curry Heights for a few years now and their Chicken Masala is amazing!  I could have it every day of the week... seriously that good!  Of all the Indian Restaurants in Brooklyn Heights this is by far my favorite.  The Naan Bread is to die for and my husband orders some pretty good vegetarian dishes from them as well.  Also highly recommend the Vegetable Rice, yummy!\n\nThey could improve their delivery time.  It takes from 30 mins to 45 mins to receive a delivery from them when my house is a block away.... Overall a delish but tardy order out joint and cute/ romantic dinner with a date.", "author": "Anna J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-02", "description": "So very disappointing: we ordered Medium spicy, but this was the only time we have ever experienced Indian food that was boring and bland. Would not have thought it was possible! It seemed as if the lamb curry was watered down. Only 9 chunks of lamb in a 16 oz container of flavorless sauce. Mulligatawny soup was plain and watery too. Never again.", "author": "Shari H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-14", "description": "Going a bit downhill.\n\nThere are new features: a buffet during lunch, which is well priced ($8 for options of one meat dish, one veg dish, a naan and rice), and a flat screen tv (oh, boy!)\n\nThe buffet is not bad but not great. I guess that is to be expected, but it's disappointing nonetheless. Today my chicken tikka masala tasted overly sweet and creamy, and lacked flavor. My saag paneer had very little \"paneer\" in sight. The non-pre made food, however, is still a good option, and better, as it's made fresh to order.\n\nAdditionally, the service is still deplorable. They forget things until you tell them five times, and are slow with bringing check and change. The guys at the buffet are, for lack of a better word, annoying. As I stood trying to decide what I wanted, they literally recited every choice. I have eyes buddy, I can read myself. I told them it's OK, and I could read on by myself, and they went \"Oh, so you \"know\" indian food.\" Actually, I DO know indian food, and, aside from hubris, it was just distracting for them to do that. Quite annoying.\n\nAlso, we saw a dead cockroach on the floor there last time we went.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-11", "description": "3/9/16 - 4 stars. FAST FOOD LUNCH! The place to stuff yourself for $8 with a real ceramic plate, tablecloths, forks, knives and glass glasses. [Grab some lime slices for your water ;) ] So what if it is cafeteria style for lunch,, the food is so good again and they also get a star boost for keeping their price point the same when everyone else keeps raising theirs. Goat Curry, Fish, Rice, Okra, spinach, Dahl, BBQ Chicken all great choices (not hot enough for me, but that is an easy fix!) \n11/20/11 - 2 Stars. When they first opened the chef they had made the sauces from scratch and it was unbelievably good. They have since turned into an ordinary but OK Indian restaurant, but the only real choice in the heights. 4 Stars for the mulligatawny soup and okra Bindi Masala.", "author": "Walter R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-26", "description": "Someone PLEASE dethrown me as duchess because I am not a fan.  I have been to curry heights twice and that is the same number of times i did NOT enjoy the food :-(  Overly greasy and was nothing like any Indian food I have had before.  I dont think I will be back.", "author": "sarah e."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-03", "description": "I ordered from Curry Heights for the first time on Sunday. The food was quite good, had just the right amount of heat without it being too hot. I loved the Garlic Naan and the Vegetable Biryani. I was given a 30 minute wait time and it arrived in even less time and was still nice and hot. I will be ordering again.", "author": "Dorothy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "I love this place. I order from here regularly and I haven't had any problems. The vegetable Korma is delicious.", "author": "Dominic D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-12", "description": "We stumbled into Curry Heights after a reading at Bookcourt.  The stakes were high - we were both starving, and Brooklyn Heights feels like a long way from Inwood.  We needed some serious refueling. \n\nOur first glance at the restaurant made us afraid that we were out one of those places that serves nauseatingly creamy saag paneer (reheated from the lunch buffet), buttery naan, and watery daal.  But once you get past the slightly unattractive space (note to Curry Heights: neon signs never, ever create ambience), the food is actually very impressive: we shared the chana poori (yum), two samosas ($2.90 for samosas?! How reasonable), daal (which I loved because it wasn't excessively watery), bhindi (really well done), and chicken saag (probably my least favorite of what we ordered, only because it had a slight tomato taste).  The service was great, the waiters were very kind (our experience was enhanced by the fact that my husband chatted with the waiter in Bengali, and the waiter was super excited by this, so also gave us free mango lassis), and the entire meal was very reasonably priced- the whole thing came to $36, and we have enough food left over for dinner tomorrow.\n\nThe long and short of it: Curry Heights might not be a great date place (unless you're trying to let your new someone special know that you like neon), but it's definitely good food, and certainly a cut above what passes for Indian food in most restaurants.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-06", "description": "We've been to many Indian Restaurants, this is one of the better ones for the price and quantity of food. Very good service. Table was clean. Garlic naan was awesome. Lamb boti was a sizziling platter. Drinks are not over priced. We had a table of 12 and ordered 8 dishes and 4 orders of naan and were full.  With drinks, tax and tip it came out to 11 dollars a person.", "author": "Gregg J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-03", "description": "Curry Heights hits the spot for midday Indian cravings. It's the best in the area. Decent Indian food, ready immediately for a quick lunch, the place is clean, and the staff is nice and seems genuinely thankful for the patronage. I'll be back.", "author": "Elsa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-19", "description": "I've ordered from here a few times on Seamless, and it definitely takes a while for delivery. That aside, the food is ok. I like their paneer bhurji; it's the one thing I look forward to ordering. The rice is lightly spiced, better than plain old rice, so that is a plus, though it's not nearly as soft and fluffy as I'd like. The samosas have an average, satisfactory taste. For people ordering online or whatever, they have 3 different fillings for the samosas, including the weird coconut one, so be mindful of that. Overall the food tastes fine; it's not something to write home about but has enough spice and flavor that unless something really goes wrong in the kitchen that day, it should probably be a sufficiently satisfying meal-- unless you've been traipsing around NYC on a mission for a truly delicious, gourmet Indian meal. In that case, you're not going to find it in Brooklyn Heights.", "author": "S H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-21", "description": "Not great, but unmatched in the neighborhood for providing a quick, cheap, and filling work lunch. Most of the lunch buffet options are disappointing, but the chicken tikka masala always delivers, and it's all you'll need to get full.", "author": "Prentiss M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-08", "description": "Ive only gotten deliveries. From that I say its reliably tasty food and the lunch specials are a good deal.\n\nsag paneer, lamb samosas, bhunas, kormas, and crab meat curry are good!\n\nThe phone service for delivery is usually pretty rude. No biggie tho cause they always get the order right.", "author": "suzanne k."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-18", "description": "Terrible service. They are rude, speak too fast, demand that you order quickly (even if it's really slow), respond to questions with frustration, many don't understand English well and are not sure what you're ordering. I was rushed, stressed, and they couldn't understand me well enough to know what I wanted. I tried to order potato samosas and left with coconut samosas, despite trying multiple times to explain myself and my order. What was crazy was there wasn't anyone behind me. No line at all. A practically empty restaurant, and yet they were rushing me and yelling at me and acting like I was an idiot. The food is as good as any Indian place around but I would not recommend them unless you're getting takeout.", "author": "Adrienne H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-20", "description": "For a very reasonable price, you get a ton of food.  I'm talking an app, entree, and a fair amount of sides.  The chicken tikka as an app was pretty good.\n\nThe Masala was also very good.  The only thing I could really ask for was more spices in the actual curry sauce, otherwise very good all around.  Naan was fresh, and you also get standard basmati rice.  \n\nWhat really wins me over here, however, is the delivery guy.  Ridiculously nice dude, and an all around great guy.  I order from this place when I need my Indian food fixing.\n\nNote, when they ask you if you want it mild, medium or hot, just keep in mind, hot is HOT -- I mean BLAZING, which isn't necessarily a bad thing if that's what you're looking for.\n\n****", "author": "Minh L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-30", "description": "Disappointing.\nChicken tikka masala was unpalatable at best. Chicken was dry and the runny sauce had no flavor. Chicken makhani was bland and oily- the ghee had separated from the sauce.If you like thick sauce with a lot of spice look elsewhere.\nAlmost redeeming were the onion relish and cilantro chutney with the papadum. Delicious. \nWhy can't an Indian place with great papadum also have good entrees? And why can't a place with great entrees have good papdum? Mysterious.\nGarlic naan was good, as was onion kulcha. \nToo bad I have to give these guys a bad review, because the guy on the phone was very kind and the delivery man was courteous and pleasant.", "author": "inga m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-13", "description": "So the place is under new management and there is one major change that I think was needed badly.  A fresh hot bar with prepared food, which was just installed a few days ago.  It's a pretty good deal.  One vegetable and one meat plate, rice, and naan for 8 bucks.  For a dollar more you can get 2 meat plates.  My GF had this option -- some eggplant thing and a chicken tikka masala.  She said both were good and tasted fresh.\n\nThere's another special that's 13 bucks or so -- one entree and an appetizer with some curry sauces, rice, and naan -- which I think is a pretty good deal.  The chicken pakora appetizer is very good actually (think Indian fried chicken tenders mmmm).  I come here pretty regularly, both when it was the Curry Spot and now that it's known as Curry Heights, and I usually get the chicken tikka.  Every time I order this, no matter the waiter, they always remind me that it's the dry one (and not the masala).  Lol.  I know...it's just a bunch of pieces of chicken and onions.  They bring it out on a skillet and it finishes cooking in front of you.  Then, everyone looks at me as I enjoy my dish...and I leave smelling like food haha.  It's a pretty good dish though.\n\nThis place needed that express hot bar badly -- so it was a great idea to have it installed.  Overall, this is a solid lunch, take-out, or delivery option in the area.  The service can be a bit slow and forgetful.  But whatever.  This also helps in my homesickness for the Bay Area...the interior of this place reminds me a lot of the Indian restaurants found in strip malls off of El Camino.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-03", "description": "Decent Indian food. Will delivery. Chat them up and ask them to cook they way you want, and they will.\n\nWent again and had meat filled potato chops. Have rarely seen them outside the Indian sub-continent", "author": "Harry C."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Curry Heights", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Remsen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/iIj1UCMlKN5sqaZzkBIziQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182609000"}