{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "Located this place 2 weeks ago.  It like a hidden place just opposite to St Francis collage. Very friendly restaurant. Comfortable sitting environment.  The people waiting on u r very polite and friendly. I went on a Sunday afternoon with my husband. Food is delicious. They have great menu. Taste is great. We liked it so much following Sunday took our 10yr old. He loved the food. He ate chicken lollipop for first time and loved it. We 3 are going again today. Must try place. You will like it.", "author": "Sumalena T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-13", "description": "This place easily gets 4 stars. \n\nThe food was incredible. I had the chicken Tikka masala with rice and it was sooo good. \n\nI came here with my friend Saturday evening after peeping the Festival of Lights show in Dumbo. We were in the mood for Indian after we tried to get into an Indian spot in dumbo but got denied because we didn't have reservations. Meh.\n\nWe hopped on the train and made our way to Curry heights. It's easy to get to but a little hidden when you reach the block its on so keep your eyes peeled. \n\nThe food and service were equally spectacular! The waiters are so nice and accommodating. Inside is quiet and calm and you feel a zen vibe while eating. This place is perfect for a quiet and intimate romantic date night or if you want to come with a friend to have a good meal and talk. \n\nI cannot wait to come back here, and yes, I WILL be coming back here :)", "author": "Tashana B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-24", "description": "This place has a great LUNCH DELIVERY SPECIAL available through Seamless. For about $14, you get an appetizer, a main entrée, rice, and naan. The appetizer and entrée variety selection is HUGE as are the portions themselves.  I have a very healthy appetite for Indian food, but couldn't even finish the lunch, it was so filling. \n\nThe vegetable samosas are delicious, perfectly crispy and savory. The chicken tikka masala was a HUGE portion. The chicken was excellent, all white chicken meat, cooked perfectly tender. However, I wasn't a big fan of the curry sauce. It was much sweeter than I'm used to, and definitely not spicy at all, which is why I was a little bit disappointed. The naan and rice are great (I mean... can you really screw those up?). \n\nOverall, this is a yummy place to order lunch delivery from, with an impressive variety of items available for the lunch box. Personally, if I'm in midtown, I prefer Darbar Grill which has an equally large lunch box but for only $9. A lunch of $14 is a little bit overpriced, but still reasonable.", "author": "Nicole T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-10", "description": "Had a terrific meal tonight. Their special combi offer included an appetizer and a main course, nan and a selection of sauces and chutneys all for $15.95. An excellent deal. The service was absolutely perfect. Generous portions allowed for a nicely packaged doggy bag.  I will most definitely be back.\nThank you Curry Heights.\nPamela", "author": "Pamela V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "What's not to like about Curry Heights? This local Brooklyn Heights favorite serves authentic, delicious Indian cuisine that's reasonably priced -- a rarity in the borough. The staff makes you feel like family. Don't miss the chicken tikka, lamb vindaloo, dal makhani and peshwari naan. Oh, and the mango lassis are just ridiculously tasty. Enjoy.", "author": "Mary K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-26", "description": "I don't have Indian food often, but sometimes the craving for heavily fragrant and hearty food unexpectedly hits, and then nothing else will do. When it does, my feet often turn in here to Curry Heights. \n\nIn the afternoon, the lunch specials are clearly popular with the local businessfolk who quickly fill up the tables to dine and powwow. As a result, I tend to get takeout, and whether I order through Grubhub or Seamless, my food is always ready well before the estimated time. A favorite of mine is the chana masala, a sauce-heavy blend of tomato, onions, and a bevy of spices that my untrained palate always has a hard time teasing apart. Still, every other spoonful unearths the odd bay leaf or whole cardamom seeds, which coyly reveal just a few of the ingredients in the magical, spicy, winter-thawing blend.  If I'm really hungry, I'll also indulge in an order of samosas, which are pastries that are stuffed with a savory blend of potatoes, peas, and lentils and then deep fried (there's also a lamb and green pea version available). Though there are only two per serving (for $3.50), I'm often overstuffed after polishing these off, rendering me sleepy and unproductive for a full afternoon of work. \n\nCurrently, they're running an special through their website (www.curryheights.com) that allows you to take $5 off your purchase of $20 or more with the coupon code HOTSPICE. As the cashier handed over the paper advertisement, he whispered, somewhat conspirationally, \"Or you can use the code CURRYLOVE to get 10% off\". \n\nWhether that was meant to be kept a secret or not, I figured I'd share it with the Yelp community anyway. Enjoy while it lasts!", "author": "Jane I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "Take me to the Taj Mahal.\n\nFor whatever reason, the little, understated Indian restaurant on Remsen Street transports me to a place far far away.  I don't know what it is about Curry Heights that makes it so endearing, but it is.  There's nothing aesthetically outstanding about the place.  Wooden tables and chairs line a dark gray carpet.  Few cultural paintings adorn the walls.  But there's something in the fresh wilted roses that rest atop those wooden tables that make sitting down feel special.  I guess what speaks to me is its simplicity, yet its ability to stay true to its roots.  The menu is traditional and extensive.  It's fairly priced and consistent.  The staff knows you and knows your table.  The waiter knows what you're favorite dish is.  If you want Indian, it's the real deal.  It's as simple as that.", "author": "Alexandra J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "We ordered takeout, then a week later we tried their buffet; everything was excellent. I'm a vegetarian, and there was plenty for me to eat. My wife loved the chicken tandoori, which the owner brought it out to her, along with some naan, straight from the oven. That this place is just a few blocks from our house makes our choice to move here all the better!", "author": "Phil R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-31", "description": "The food is usually good. But this time it was horrible and very bad service. We asked for the check and the person gave me the il be there in a minute finger. I'm serious!! I got few breads without the entree and I don't think anyone would eat just the breads. \n\nI took vegetable vindaloo. I am used to eating very very spicy food but there was something wrong with this one. None of us had more than a spoon.\n\nOverall the food does not compensate the bad service. May be a take out would be a good option.", "author": "Ashwath B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-07", "description": "I have had Indian food many times in London, Tokyo and New York, and can say that Curry Heights was delicious and as good as the best of them. Okay, my chair was a little creaky, but our waiter was very friendly and added to our enjoyment of the dinner on a Saturday night. Lots of parking meters around as well - free after 7pm. The place was full. \nThe lamb tikka masala, their flavored rice which comes with all curries, and their lightly garlic seasoned naan were especially good. We also had some tiny tandoori chicken wings, and a creamy broccoli dish - both very good. And my son liked the mango lassi. \nAs their rice was soooo good and perfectly cooked, next time I would like to try their biryani. Our waiter also suggested the fried breaded chicken lollipops for our kids, sounded great, but we were trying to avoid gluten that week so turned it down. Anyhow all our dishes were really delicious; I am sure that in NY the taste of their food is one of the best, and the ambiance of our waiter too.", "author": "Tetsuo I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-26", "description": "a ton of food under $9. would go again.\n\nreinstating the fact that the chicken tikka masala is amazing.\n\nI also like that they give you naan and rice.", "author": "Arin K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-19", "description": "I'm not sure why this place gets such rave reviews on eat24/from my friends. I got the lunch special (which agreed - is a good deal), but the food itself was nothing special. Dine in area seemed a little dingy, so maybe take out is better option.", "author": "Vaibhav M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-28", "description": "OK, did the delivery thing again and this time it was perfect!  I didn't really comment too much on the food last time, so here goes.  Curry Heights more than delivers on taste, quality and portion size.  Compared to some of the other places I've eaten in NY, this is probably near the top.\nThe samosas are nice and crunchy on the outside, and filled with seasoned potatoes and peas (my preference).  You get two nice sized pieces in the order.  \nLoved the Chicken Tandoori Masala.  Tender and delicious.  The Aloo Mattar Gobhi was perfectly spiced. Naan - big and fluffy.\nYeah, this is my go-to for Indian in BK.", "author": "Rick S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-16", "description": "Honestly, some people have no business opening Indian restaurants. This place is most likely catered toward local Western palates that cannot adequately appreciate an honest tasting curry. Might as well just open a vegan soup spot instead and call it a day. \n\nThe curries are rather unflavorful and any bits of chicken or goat are Thar Desert dry and would make great natural replacements to Kevlar (seriously guys get that defense contract). The Naan comes with certains orders and I usually opt for storing it later to be used for carrying clothes on my next move-in day while the actual cardboard boxes I purchased are a more preferable bread option. \n\nA star for large portions.", "author": "Davis K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-09", "description": "Best place for mango lacchi and goat briyani. Felt like those food actually came from heaven :) try these item , u won't regret . Service is awesome too :) love this place and recommend all friend and family.", "author": "Reaz P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-25", "description": "Great takeout and lunch specials, very reasonably priced.  No frills atmosphere but genuinely caring staff and good food more than make up for less-fancy decor.  A fine neighborhood place.", "author": "Jane P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-17", "description": "Not the best food out there but depends on what you order obviously. It is overpriced. It's like paying 11-12 dollars for an entree that is worth no more than 8. The restaurant has extremely dim lighting and the tables are nicely spaced. Beautiful ambiance but food is not worth it.", "author": "Brooklyn R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-14", "description": "Great place to grab lunch. The food is authentic and fresh and the staff if very friendly.", "author": "Jacek P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-14", "description": "In studying late on campus, I opted to try a new delivery spot. \nHORRIBLE experience.\n\nMy naan is burnt and the food was average. I could overlook that but the restaurant overcharged my card and hung up on my TWICE when I called to inquire. My email receipt clearly differs from the paper receipt brought by deliveryman and the only response was that the online ordering system is out of date.", "author": "Stacey J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-05", "description": "I'm a fan for take out, lunch, or sit-in on a low key night. \n\nSamosas, Banana Fritters, Lamb Vindaloo (spicy), Nann and Dal Makhani have never let me down.", "author": "Danny R."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Curry Heights", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Remsen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/iIj1UCMlKN5sqaZzkBIziQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182609000"}