{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-29", "description": "Delivery took two and a half hours to arrive (I was given an estimate of 1 hour on Seamless).\n\nI ordered an okra dish and a chicken tikka masala. The okra dish was quite good and flavorful. The chicken tikka meat was dry white meat, although the sauce was OK.", "author": "P C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-19", "description": "I have to admit  I till recently I've stayed away from Indian food. This not because I didn't necessarily like it but this sort of food especially in Brooklyn and the City simply aren't authentic enough. They tend to lack the bold, colorful flavors that Indian food is noted for. Nevertheless, I ordered take out from Curry Heights fully expecting this to be watered down and somewhat bland. \n\nBoy was I wrong.\n\nI ordered the Goat Vindaloo and mulligatawny soup as part of their 2 course 13.95 special. First, I have to say this is a lot of food for that price. I spread it out over two nights. \n\nNow, for the food I was pleasantly surprised. The vindaloo sauce had the serious kick you would expect from authentic indian vindaloo. I was soaking the included naan (bread) in it and almost didnt have any naan left for the other sauces that were provided to dip the naan in. However, the food was not without its fault. The goat meat while somewhat flavorful alone did not have the fall of the bone tenderness as described in the menu and some pieces was unfortunately dry. Also, there seemed to be more potatoes in the goat vindaloo than goat. \n\nThe mulligatawny soup was delicious. It was thick and had the necessary (but downgraded from the vindaloo) heat that you want in a good indian soup. \n\nOverall, I was very impressed with this place and plan on making it my go to place for Indian food in Brooklyn for the foreseeable future.", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-03", "description": "I came here for the lunch buffet. The staff was quite friendly, even as I took a bit too long staring at the selections. I ended up with chicken tika masala and spicy dal soup, served in separate bowls with a side of rice and naan. The food was a little cool, even after sitting in warm trays. The flavors were a little on the bland side. The amount of food was generous, and not a bad deal at $8.66. The server was quite attentive in filling water, which was much appreciated. I left satisfied but without a strong desire to go back.", "author": "Ian M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-15", "description": "Wow.  I've never written an online review before, and I don't like the idea of being inspired to write my first by a horrible experience.  NEVERTHELESS... Wow.  This place sort of ruined my night.  First, the person who took the order was super rude, which normally I don't really care about.  Sometimes I think it can be chalked up to language barriers or what-not.  I laughed it off, even though I had to call back after the person took my address (but not my order yet), then set the phone down for several minutes.  I could hear him taking other orders in the background.  When I eventually told him I wanted to pay by credit card, he questioned me and tried to talk me out of it.\n\nI waited an HOUR AND A HALF, and finally called.  Someone different answered, and he was very deferential and apologetic. He said that they were very busy, but that the food was on its way.   ANOTHER HALF HOUR later the buzzer rang.  I went downstairs (I am in the top floor of brownstone, no buzz-in).  The delivery man had no pen for me to sign the charge slip with.  I told him it would be fine,  I told him just to sign it himself, that the restaurant would have no problem taking the money out of my account -he looked stricken - and closed the door.  He immediately started pounding on the door and shouting.  I opened the door, went back up to my 3rd floor apt. got a pen, and signed the charge slip.\n\nTHE FOOD.   There were none of the three sauces/garnish that normally come with an Indian food order.  The chicken in the Tikka masala was so overcooked it was hard to chew.  And the naan was inedibly undercooked - the dough was still, well, literally just dough on the inside.   I'm sorry but they really don't deserve to be in business.", "author": "Peter O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-17", "description": "Huge portions for good prices. Staff is super nice. We had a good experience eating here. The samosas are divine as is the basmati rice. I have had better naan but it was acceptable, especially when combined with other dishes. Beware of what is labelled Hot and Mild. I thought I ordered everything mild but some dishes were definitely not mild.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-23", "description": "So much more authentic than Baluchi's on Henry Street, fresh meals with absolutely addictive rice.  Curry Heights has nice prix fix offering: appetizer plus entree with naan for $13.95.  Don't miss the tikka naan- it is delicate, puffy and slightly chewy.  Never been a big fan of samosas but these were less dense than most.  Loved the onion relish and \"green\" sauce which I always forget the name of.  The waitstaff is nice and the restaurant is dark, just fine with me.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-16", "description": "We've been going to this place for a long time and we use to simply Love it! Do not if there has been changes in ownership or management or what! The truth is it has gone downhill badly. To the point I just found myself out of options for Indian food in the neighborhood! The last few times, service has been terrible. After being clear about having the \"deal meal\", we got a check with all the items separated... The excuse, \"he is in training\", who they wanted to kid? As mentioned I've been a regular for a long time. Last, but not least the most important part: the food has suffered a lot and it has reached the point where I am not going back!", "author": "Rolando P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-08", "description": "I'm very happy that we now have a good Indian option in the neighborhood.  I have to agree about the wait, since I experienced the long wait during the first week.  \n\nEven though I had issues with the delay, given the quality of the food, the wait was well worth it...", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-23", "description": "I've had nothing but good experiences ordering in from here. The delivery is timely, the food is delicious and the service is excellent. They have such great menu choices -- I'm a big fan of their chicken saag, tikka masala, naan bread choices. When I'm thinking of ordering some Indian, this is the \"go-to\" place for me.", "author": "Shar Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-07", "description": "The food is just OK.  It is nothing special but is edible.  As an Indian, I can honestly say that this is the blandest Indian food I have ever had. However, the service absolutely sucks.  I have been here several times and they ALWAYS get our order wrong.  Without fail, it is always incorrect.  You will never get exactly what you order unless you make a huge stink about it.  It is pretty ridiculous considering it is the slowest takeout service on the planet.  Seriously,  if communication is so bad that the employees can't understand your oder correctly on a systematic basis, there is a problem.  Still looking for a good Indian place in Brooklyn Heights.  This isn't it.", "author": "George C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-11", "description": "Now they seem to be called \"Curry Heights,\" but little else has changed. Upon return visits, I still like them, but I think my original 5-star rating was generous due to excitement of having a new restaurant nearby.", "author": "John S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-29", "description": "This place has the rare distinction of  being the most horrible India food we've had in the greater nyc area. The food barely qualifies as Indian. I know that the manager and servers were not Indian. I bet the chef has no clue on preparing India meals. Dal Makhni \u0026 naan were tolerable. I have eaten all kinds of Indian cuisine, but the concept of potato paratha was martian, not Indian. Saag panner was strange, bland and watery. Save yourself and eat somewhere else.", "author": "Akshat V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-24", "description": "I was highly disappointed with the customer service that I received today. I was rushed to place my order and given attitude when I corrected them about an incorrect order. Its quite disappointing because the food was pretty good but the service was poor therefore my coworkers and I will not be coming back here ever again.", "author": "Jenny F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-21", "description": "Everything was delicious.  Vegetables, chicken, chickpeas and spinach, cheese, breads. Did not try dessert.    I did not take notes on the dishes we ordered. I had no intention of writing a review - until after we ate and we all enjoyed our meals so much! -  My only regret - I ordered 2 appetizers instead of an entree.  And my food arrived long before the entries. Next time - I would ask them to serve 1 of the appetizers with the meal. We certainly plan to meet here again !", "author": "Thelma M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-01", "description": "Food is meh, but it's the best indian food in the area.  Most dishes have very little flavor and ithe saag paneer for instance, is too watery.  But, if you're craving Indian, the food here will suffice.\n  \nBe forewarned, their website sucks.  If you place an order via their website, call to make sure that they actually received your order. Otherwise, you'll find yourself waiting for an order that will never be delivered.", "author": "Stephanie A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-02", "description": "This place is still working out it's opening jitters, so go in when you have some patience.  I had a leisurely dinner there the other night, and though it took a while to get out food, everything eventually came out as promised.  I am not an expert on Inidan food, but I've had both good and bad, and this is definitely good.  The naan was fresh and plentiful, and the lamb in our stews was tender and flavorful.  The spices were spot on (to my judgment, anyway) and exciting.  And what a bargain!  Go for the two course special served during dinner hours (and perhaps lunch as well, I'm not sure).  For 13.95, you get crispy flatbread to start, an appetizer and main course with naan and rice, and rice pudding after your meal.  The beverages are interesting as well.  We tried the Indian Iced Tea and Drink of the East which were both fragrant and refreshing.\n\nGive this place you business.  I want them to stick around!", "author": "Romy V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-25", "description": "This is my go-to place for Indian lunch takeout at work. I always go for the chicken tikka masala, saag panir, rice and naan special and ask for extra sauce on the rice. It's quite filling and a pretty big portion of food and good for when you just want something warm and satisfying. There are hardly any Indian restaurants in the area, but this one is not bad for an only option.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-26", "description": "I've ordered from this place many times. It's very cheap \u0026 has quick delivery, but the food is way too spicy. I know some people enjoy spicy/Indian is supposed to be spicy, but they don't really give you the option of mild spice if you want it. Even though I check \"mild\" on seamless, the dish comes out very spicy every time. I even ordered a side of basmati rice (to help decrease the spiciness of the dish), but that was also inedible because it was so spicy! The naan is good though - I'll give them that.", "author": "Katie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-27", "description": "Came here for some light and spicy Indian fare, \nDidn't expect to be the only customer here.\nI trust the dishes are authentic and very good,\nBut points off for service being so damn rude!\n\nI was in the mood for spinach \u0026 lentil soup,\nBut the Sunday noon server told me they don't have it...so I felt duped.\nWhen I ordered samosas \u0026 spicy lentils with a tomato-based puree,\nHe asked me why I wouldn't order a full entrée.\n\nI admitted my stomach couldn't handle so much food,\nThen suddenly he gave me an attitude.\nHis reply: \"If you're going to order so little, why not do take out?\"\nI decided to get up and walk right out.", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-24", "description": "Papadum was A+ awesome.  Rice was fantastic (peas and cardamom. perfect).  Chicken vindaloo was nice and hot. Maybe a bit too sweet for perfection.  Naan was decent - not as crispy as my tastes prefer but very fluffy and good.  The delivery guy was awesome.  All smiles and very nice.", "author": "Michael P."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Curry Heights", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Remsen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/iIj1UCMlKN5sqaZzkBIziQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182609000"}