{"aggregateRating": {"reviewCount": 249, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-19", "description": "It's edible and there are some good things about this place, but I'll pass on it in the future.\n\nMinced Lamb and Pea Samosa - the dough was perfect - really nicely done. Flaky and tender, but strong enough to hold all the meat in. Really good dough. However, there were no peas in the filling, and the lamb was very very finely minced, nicely seasoned.\n\nChicken Tikka Masala - really dry white meat cubes in a sauce made of sweet tomato sauce and cream. Not very good. Pass.\n\nNaan - good! soft and chewy, great for sopping up sauces. If only the sauces were worthy of sopping up.\n\nRaita - overly sweet, too much carrot, not enough cucumber. Pass.\n\nGulab Jamun - they made a mistake with the order it seems and I got Ras Malai instead. Really not a fan - too milky - but as far as Ras Malai goes, this one was decent.\n\nDelivery was within the projected time, and the delivery guy was very nice and polite, so points for that. But if you're looking for Indian food, look somewhere else.", "author": "Carina H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-16", "description": "Reliable, fast delivery, nice when you visit. It's a pretty standard Indian place, never had a bad experience, my go-to for delivery in Brooklyn Heights.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-18", "description": "I originally gave this place one star based on it's decor and tiki masala.. and now I'm updating it after giving them two more tries! \nI wasn't a fan of their tiki masala but everything else I've had is pretty decent. I always leave full and satisfied. Best part of my meal was the Baigan Bhartha (eggplant, peas and spices).", "author": "Grace S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "Came in for lunch during the weekend with some colleagues. It was absolutely delicious. The waiter was polite, the food fantastic and reasonably priced, and the bathrooms were OK. Great place!", "author": "Christie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-04", "description": "We ordered take-out here for dinner and really enjoyed the flavors.  Their Tandoori chicken was well seasoned and their Lamb Ticka Masala was quite good.  The meat was nice and lean but not too chewy as well.  We also tried their Shrimp Madras (too spicy for me but my dad loved it) and Baign Bhartha which was also spicy but filling, so overall this place is a nice neighborhood Indian restaurant that we will be frequenting.  It's hard to find good quality Indian restaurants as sometimes I find the sauces watered down or too creamy for my taste.  This place hits the flavors just right.  Next time I'll ask them for less spice but overall I think it's a great option here.  My parents went to college in England where they constantly ate Indian food and they even approved of this place (which they are normally pretty picky when it comes to Indian food).", "author": "Amy L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-24", "description": "Horrible service!!! I was rushed to order and then they made mistakes with what I wanted because they were not listening. Then they were extremely unprofessional by giving me an attitude and sucking their teeth like they were children. Never going here again. They were so rude!!!", "author": "Celeste V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-30", "description": "Restaurant advertises 11:30 opening. I arrived at 11:30 and headed for a 2-top in an empty restaurant. The manager charged at me and bellowed in a loud voice \"we're not ready!\" \"Go wait in front for at least a half-hour\", while motioning with a hands-up \"get-away\" gesture. Needless to say I won't be back.", "author": "Tom I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-26", "description": "For $15 you can get a deal for 2 samosas(any appetizer), bread and entree with rice. there's no better Indian deal in BK heights. I have never really had bad indian before so IMO it's good.", "author": "Ralph L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-11", "description": "**** Vegetarian reviewer ****\nWent at 9:30 on a Sunday, the board said they were open, but when we went in, they said they closed and can't serve the food. But the staff was sweet enough to at least let us order food to go. The yellow daal was decent for veg jalfrezi curry was mediocre and the salt lassi was too salty.", "author": "Nish A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-07", "description": "Hey- cheap and great Indian food in Brooklyn Heights? This is your place.\n\nThe 2-course dinner special ($13.95) is great. Appetizer, Naan, and Main, pretty well rounded. We ordered 2 so we could mix and match it up a bit. Everyone raving about the Naan is right- probably the best Naan I've had in a loooong time. Fresh baked- can't be beat.\n\nGiving this place 3 stars due to our Samosas. One was (as advertised) filled with potato and awesome (Mine). The girlfriend's was brimming with shredded....coconut? That was it. a Samosa stuffed with shredded coconut. Tres strange.", "author": "Dustin W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-15", "description": "This used to be my go to in my neighborhood.  I just ordered from them tonight and had a bad experience.  First of all, the delivery guy calls me to say he left it outside my apartment building.  Then he says the food was with the doorman.  I don't have a doorman so I insist and he comes to the right location.  He was on a completely different street.  Then my food  (saag paneer) was in a much smaller container than usual so it was considerably less food and it was cold and very creamy which it usually is not.  I'm not sure if ownership has changed but it certainly feels like a different restaurant.", "author": "Geeta D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-19", "description": "I got the lunch special here on Monday (delivery) and was very disappointed on taste. The chicken tikka masala had no heat (I'd ask for medium) and the sauce tasted like tomato soup mixed with half and half. The naan and rice were decent, but the samosa's were greasy and also bland. \n\nYou'd get better indian food in the TJ freezer section. Don't recommend.", "author": "Eimear K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-08", "description": "Usually pretty good food, that delivers fast.  Waited over an hour for my lunch, and I don't know how long most people get for lunch, but I only get an hour.  Chicken Tikki was absolutely dry.  Not a tear drop of sauce on it.  I never saw it on the menu, but apparently plastic forks and knives are extra, as I've yet to ever receive any.  Although on occasion I love Indian food, probably won't be ordering from here again.", "author": "Robert F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-25", "description": "Terrible health conditions and an unsafe work environment. Twice in the past three months the restaurant has left their gas burners on, allowing gas to fill the entire building, threatening the residences of the building above. This wrongful act was deemed suspicious by responding firefighters. The city has been notified as well as National grid and the FDNY. Also their food is not of the best quality and there is most certainly a rodent problem.", "author": "Javier G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-03", "description": "I ordered delivery from this place and granted it was pretty late, around 10 pm, they delivered the food within 20 min. But I think I know why - probably because they used velveeta cheese to make the malofta curry. It was so nasty and in a color I've never seen malofta curry. And the mint sauce was watered down.\n\nIt makes me wonder how seamless gets their reviews when I couldn't even post mine. I should have used Yelp as a secondary source.", "author": "Vivi N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "I frequent this location on a frequent basis. They have a great lunch buffet special which is why I go.  However,  after going a couple of times,  I realized how consistent they are.  The food is great,  my favorite dish is the chicken vindaloo,  it's spicy.  The attention is great,  the location is very good.  The portions are large and the chicken is  always fresh.  No I don't work here or own the place,  I just love thier food. I will say this,  they need to put on Indian music not '80's contemporary.", "author": "ric s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-20", "description": "I thought the food here okay. I get it every week. The delivery is around 45 minutes and the food is fresh and hot. Sometimes, the chicken in the chicken tika masala is drier than usual, but I have learned to get used to that because the sauce is great! Everything is premade so you can't get anything completely fresh, so when I asked for the chicken vindaloo to be extra spicy, it wasn't that spicy to cater everyone. Overall, the food is alright. Would recommend for lunchtime eats.", "author": "Tim F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-25", "description": "Since moving to Brooklyn Heights, I have been desperate to find GREAT Indian food...and I am still on that mission.  There really seem to be only two Indian restaurants near my apartment...one named Amin (which according to Yelp is not worth my trouble) and the other is Curry Heights. \n\nThis past Sunday, I decided to order in some Chicken Tikka Masala and Chicken Biryani from Curry Heights to see if they were going to be my new favorite Indian delivery. \n\nThe delivery was pretty fast (about a half hour) and I was happy I could use Seamless Web to order.  The Chicken Biryani was pretty good, though not very spicy (which is OK for me).  I'm very picky about my chicken and the boneless white meat in the Biryani was up to my standards (no fat).  The Chicken Tikka Masala was OK, nothing outstanding and I didn't love the consistency of the chicken.  But I will say the portions were large and I was full after my meal.  \n\nI'd order from Curry Heights again, but I am still looking for amazing Indian food in the Heights.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-30", "description": "I went about a week ago with couple of friends around 2-3pm and as soon as we walked in the waiter was like they were closed, however there was no indication on their hours and door of it being closed. Also I have visited the place before around the same time. It felt as if they did not want to serve us. I do not recommend.", "author": "Nusrat Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-15", "description": "The food is decent and the lunch menu is quiet affordable. My gripe with this place is with the people who take my order. All but once my orders were messed up or something wasn't delivered. Upon calling back, every time instead of help I get an attitude back when it's the restaurant that gillian anderson to include food that is part of my order. And then they're always out of delivery men, so when they do forget to deliver something, it takes an extra half hour to an hour to get it, completely ruining my lunch since I only have a specific time to clock out for lunch and eat. Unacceptable.", "author": "Kessie M."}], "servesCuisine": "Indian", "priceRange": "$11-30", "name": "Curry Heights", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "151 Remsen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/iIj1UCMlKN5sqaZzkBIziQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182609000"}