{"aggregateRating": {"reviewCount": 36, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-07", "description": "Not the best gyro I've ever had, but really good for the money spent. Quick delivery too! Definitely a new go-to lunch.", "author": "Majlinda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-13", "description": "Nice and clean restaurant with friendly staff. One of the girls recognizes me and knows what I will order. They make the best fried chicken with mashed potatoes. Sometimes she gives me a little extra more. \n\nLately their portions of the chicken size have been going down, but it's okay. I understand business is business so they need to make money. Overall, they have really tasty food. Also they have nice variety of soda and drinks. \n\nI like the Wifi here too. \n\nOverall, I enjoy coming here every week for a quick bite to eat, without breaking my wallet. So thank you lavatera.", "author": "James D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-29", "description": "Opened a new location on old Fulton Street. Ask for Alice she was fantastic and the atmosphere was great.", "author": "Kim H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-15", "description": "The ladies who worked the line were friendly and helpful.  However, the male cashier tried to cheat me out of my correct change.My purchase cane to $8.17, and so gave him $20.  The register clearly displayed my change to be $11.83, but the cashier only gives me back a $1 and the change.  Needless to say, he claims that he made an error when and meant to enter 10 and of 20. Yeah right!", "author": "Catherine E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-09", "description": "This place is near my office with lots of vegan and vegetarian options, so it has been an easy choice when I forget to bring my lunch. That being said, it has slid dramatically in value and service. For what ever reason, they refuse to acknowledge that the place has changed hands, but it clearly has. The food is still fresh, but portions constantly vary (mostly going smaller and fewer) and everyone has an attitude. They have also changed some of the recipes, not for the better, imo. I may still buy from here again, but if I have more time, probably not. Very disappointed.", "author": "Bo H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "So I ended up in here on my way to the pizza shop because I couldn't decide what to eat for lunch.  The customer service is excellent the young man who helped me explained everything. I ordered the lamb shawarma with baba gnoush, tomato cucumber salad and tzitki (forgive me for my spelling ). I had this on the white pita bread. It was really tasty I devoured it at lunch. I will definitely be back.", "author": "Andria A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-13", "description": "Lamb Wrap was great. Nice place. reasonable prices. service is fast.", "author": "Patrick S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-21", "description": "Amazing Delicious food in a super clean space with attentive kind people behind the counter. A place I'll be back to again and again.", "author": "A. L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-20", "description": "The staff is friendly but I honestly could not eat the food. I took my sisters here (who can eat anything) and we couldn't finish our plates because the food was so dry and tasteless.. good concept but please improve the quality and quantity", "author": "Zeiad S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-09", "description": "So I accidentally bumped into this place and I am so glad that I did! The food is amazing! I had the baked potato with mashed potatoes inside which was out of this world. In top of the mashed potato, I had chicken,feta cheese, and mushrooms.Everything was fresh and super tasty.As dessert, I had baklava which was out of this world! I can't wait to go back! Note: This place is a bit on the pricey side but it is definitely worth it!", "author": "Paola C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-06", "description": "I like this place a lot. It's clean, fresh, and lots of interesting and unique choices. It's really new, and it looks really sleek and nice. The staff are all really friendly and helpful. One word of caution: beware the harissa! That thing is so good but so spicy that you'll want to keep eating more and more, which ends up with your mouth on fire.", "author": "Tony J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "Food is fresh and with great options.  Was in town for work but would stop back here again the next time I'm in the area.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-19", "description": "Twas our first time. Great selections that wanted us to try all at once. The ambience is chill and pretty. Food is tasty and healthy. Happy lunch indeed. Extra appreciation for the free very delectable dessert called balaclava.", "author": "Aubrey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-07", "description": "Great, friendly service and delicious food! A lot of healthy options and really good portions for what you get. Would recommend if looking for a quick option in the area.", "author": "E L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Excellent food, very fresh, great prices and people are very friendly. Definitely a great choice when hungry. Nice place absolutely would recommend to try", "author": "Stan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "I cannot begin to describe my level of satisfaction with Lavatera. It is a family owned restaurant that treats it's patrons as if they are part of the community. Andrei and I worked very closely together to cater my event (and on such short notice), and his dedication was tremendous. He physically made sure that we were taken care of, so much so that he and his family even came in during their day off to make sure that we had everything we needed. Olga even DROVE us to our meeting because we were planning to take the train. The service is wonderful and the food was remarkable. Feeding 45 people who all have an idea of how Mediterranean food should taste is no easy task, but it was a huge success. Everyone loved it and went for 2nd and 3rd helpings, raving about the delicious dishes. I promise, they will not disappoint. Thank you, Lavatera!", "author": "Jen C."}], "servesCuisine": "Mediterranean", "priceRange": "Under $10", "name": "Lavatera Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "88 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ul150LJgtEHpW_EZtLHtzg/ls.jpg", "@type": "Restaurant", "telephone": "+13476893800"}