{"aggregateRating": {"reviewCount": 6, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-28", "description": "The food is really fresh and a good value. There is a lot of potential here. \n\nI had the chicken gyro salad bowl. The chicken was good and very generous. The hummus was a stand out and excellent. There was a bit too much tzatziki but it was good anyway. \n\nThe only thing that would have improved it would have been outside seating.", "author": "Lizzie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-27", "description": "Enjoyed the chicken salad! Love this area. Refreshing hip hop music! Cool spot Friendly bar tender and staff", "author": "Adrian C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-20", "description": "stumbled upon this place as i was hiding from the rain last week. Absolutely love it here. Great food at a great price as well as great staff! I definitely see myself becoming a regular here.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-25", "description": "Fresh, delicious, clean and their falafel is homemade. Forget the lines for Pizza and Shake Shack on the block. This is much quicker.", "author": "Florence W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-06", "description": "This place must be brand new or something. The hours in Yelp are wrong. It was open on Saturday. I went there after waking the Brooklyn bridge and my wife went to get some pizza at be ignazios. I'm a no dairy guy so I looked for some nearby falafel. I'm glad I found this place. It's one of those make your own bowl places with a lot of options. I love those places and I loved this place. The food was all very fresh and super flavorful. I got some rice hummus falafel baba ganouj cabbage olives and tabouli for 10 bucks. That's what I'm talking about. Also got a baklava because who can say no to baklava. All of the food was da bomb. If you like that type of food and you're in Brooklyn go. If you like pizza then try ignazios. My wife said it was good.\n\nEdit: I forgot to mention that the cashier was super nice and had a huge smile on her face. I wish I remembered her name so I can give her credit. Smiles can sometimes be hard to come by in NYC so it's always a plus.", "author": "Brandon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-28", "description": "Clean, good location and very fresh good food. I take a chicken gyro and it was very tasty.", "author": "Jari R."}], "servesCuisine": "Mediterranean", "priceRange": null, "name": "Lavatera Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "17 Old Fulton St", "postalCode": "10038", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/NQCkdt513Mi4nJ5zEbvXVA/ls.jpg", "@type": "Restaurant", "telephone": "+13477992217"}