{"aggregateRating": {"reviewCount": 12, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "Recently joined forces with the Warung team for a very large corporate catering client and they were excellent partners. Every step of the process was seamless -- from the initial menu tasting, to planning and communicating logistics ahead of time, to execution on the day of the event. \n\nTheir Pad Thai, Holy Basil Stir Fries and Chicken Satay all hit the mark. \n\nWould absolutely recommend reaching out to Trevor and his crew for special events and/or an elevated office lunch experience.", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-23", "description": "So this food truck made an appearance at my school for an event. We had a choice of Medina Halal, Gorilla Cheese and Warung Roadside. Of course being the foodie that I am, I needed to Yelp each truck before deciding, and already being a sucker for Asian food, Warung won hands down. All of the pictures that they had on Yelp looked amazing. Then I looked at the menu for the options we had and the food was all the same. I thought, great! You'd be an idiot not to choose this truck. \n\nANYWAYS, WOW, what an extreme disappoint is all I can say. They were offering their Pad Thai which was described as \"Award winning Bangkok street style wok-fried noodles with tofu, scallion, bean sprouts, egg and peanut\". Let me tell you, this Pad thai they gave out was the WORST pad thai I've ever had in my life. First of all, it looked absolutely NOTHING like the photo. (The photos look effing amazing). The entire dish was plain, flavorless and sauceless. The noodles were plain white, no added sauce or anything like it. They were definitely not wok fried as described but tasted like they were plain boiled. Image boiling a box of pasta, straining it and then eating it JUST like that. That's exactly what this entire dish tasted like. There was no tofu, scallion or bean sprouts. I had to add SRIRACHA to the dish for flavor. You don't add sriracha to pad thai!!! But I was desperate for some flavor. \n\nI'm sorry but WHY would you demolish your entire dish just because you're on a college campus? I'm sure the school is paying you very well to be there and what you did is basically RIP THEM OFF. Does the school know you did that? Or did you tell them beforehand that you're going to revamp your dishes for the worst because this is a school event? I'd love to know. No wonder the Halal line was almost 10 times as long. People probably know the deal. This was my fist school event so I had nothing to go by. \n\nIf you can provide a valid explanation I will take down this post. However as of now, I will never recommend anyone to eat from this truck. Worst pad thai/Asian food I've ever had in my life.", "author": "Kristina P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-17", "description": "The absolute worst Thai food I've ever had in my entire life.  This is not an exaggeration.  I ordered pad Thai and it was a soggy, salty, overly fish sauced, sweet, sour slop.  I had to throw it out.  I couldn't even make it past half of it.  What a waste of $9.", "author": "Anne H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "Delicious mushroom buns (eat them right away)! Try the holy basil stir fry and make sure to get the fried egg on top. Excellent food truck.", "author": "Whitney W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "Had the Holy Basil Stir Fry with mushrooms at the Famous Food Festival in Deer Park and it was by far the most flavorful thing I had that day. Topped it with a poached egg and it was absolutely divine. I wish they had a restaurant - it would become my favorite Thai spot!", "author": "Prachi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "Love the chicken pad thai with egg on top. Lots of flavor and great texture. Pork buns are delicious too. Always happy to see them pop up in bk.", "author": "Ryan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Authentic Thai food from a passionate and skillful chef. I've had their food at several different events and can honestly say their food is deliciously consistent. Try it for yourself!", "author": "Ben G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "def one of the better food trucks in dumbo. staff is super friendly, the ingredients are fresh and high quality, food is very tasty and most importantly, fairly priced. can't think of anywhere else in dumbo i can eat lunch this good for under $10.", "author": "Tommy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "hands down the BEST food truck i've come across in NYC and that's saying something. the holy basil stir fry is one of my favorites and the pad thai is always on point too. these guys recognize me every time i visit now and they always treat me with so much love.", "author": "Raj S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "Tried them out at the Queens Night Market. They get busy with the magic. Best food truck there. The sausage was . I suggest y'all give em a try. I went back to the truck like 3 times and ordered almost everything on the menu. If you're looking for that flavor, look no further.", "author": "Jarred G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "Warung's holy basil stir fry is really something special that everyone needs to try. The pad Thai is great too. I am here once per week for lunch. Highly recommended!", "author": "Todd S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "This is probably the best Thai food truck I ever have in New York. Yum!!!!!  I can confirm this because I'm from Bangkok.", "author": "Sutathip A."}], "servesCuisine": "Thai", "priceRange": null, "name": "Warung Roadside", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "Dumbo Lot", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/00fi6DiL1OubBI5pNV-Eow/ls.jpg", "@type": "Restaurant", "telephone": "+17733391458"}