{"aggregateRating": {"reviewCount": 156, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-21", "description": "I'm going to give them another chance. I love the layout and the ability to build your meal but the food was very flavorless to me. I order the Vegan AF and I couldn't finish it. It needs spice and salt. It's also kinda expensive for fast food. My friend love her salad though. I'll give it one more chance but I think I just prefer to go to a Thai spot. The drink choices were okay.", "author": "Meeka A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-02", "description": "I cannot stress enough how much I would LOVE for this place to be located near my office!  I was staying in downtown Brooklyn for a conference and needed to grab a quick lunch this past week.  I found this place on Yelp and so my boss and I took a stroll to it.  They have computer systems that you can walk right up to and pick either one of their per-determined items such as Red Curry Thai or Garlic Chicken or you can build your own.  I did my own version of the Red Curry Thai Noodles and a lemonade.  I got back to my hotel room and finished the whole thing of noodles surprising even myself.  The flavors were so mouthwatering in every bite.  If this place was located by my office on the west coast, I would definitely be going at least a couple times a week since they also have salad options.", "author": "Amanda K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-22", "description": "Outstanding customer service.  The gentleman working the customer facing area (beard, glasses, tattoo sleeves and glasses) was incredibly accommodating.  My order had the wrong cheese (blue cheese) when I had on my receipt requesting feta.  I typically wouldn't care about a mistake of one ingredient but I just cannot stand blue cheese!  I told him and he immediately resolved the situation and provided me with a new salad.  On top of that, there was no more bacon left that was in my original salad so he asked if I'd like to double up on another product.  I added more avocado.  This is the reason I will come back.  More than just for the food.  It's how the establishment makes me feel and this gentleman made me feel great as he listened and truly cared about my experience.  Thank you for such a wonderful experience.  I will be back!", "author": "Andrew F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-31", "description": "This spot is honest, clean and inspiring. You can choose a stir-fry, salad or yogurt- all made to order. It's like a chinese take-out crashed into a chipotle.\n\nI had the togarashi tofu on brown rice with broccoli, sprouts, spinach with 5 spice soy topped with fried shallots and crushed nuts. \n\nHealthy, yummy and I just love the veritable combinations. Only caveat- they heavily sauce and the trimmings are super flavorful, so I'd ask for half sauce or sauce on the side. For me this time, I actually ordered an extra rice on the side to mix in.", "author": "Elisa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-05", "description": "Wish they had better cell service. Overall decent salad/stir fry.  A little bit expensive for portion size but sufficient nevertheless. Would reserve around 10 minutes wait time.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "Honeygrow can eat sweetgreen for lunch.  \n\nGreat salad, stir-fry and beverage options.  You can custom order or pick from their menu.  I love their self-service kiosks.  Wait times are fairly short for lunch rush hours.  You follow the progress of your order on a display that shows order numbers.  The ingredients are fresh and the experience is quite streamlined.  I especially like the \"make it grain\" option that allows you to have a bed of grains not greens for your salad base.\n\nNow I only wish they opened more locations in New York.  Hopefully soon!", "author": "Srini V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-03", "description": "When my friend told me we were planning to have Thai for dinner, I didn't expect honeygrow to be thrown into that category.  This place is an anomaly all on its own.  Based on the price and portioning alone, this leaves something for your stomach to be desired.\n\nOne star for the tablets that took our order; at least I had some faith that the order would be taken accurately.\nOne star for the convenience of the location from just off of MetroTech center and in walking distance to our final destination.\nOne star for my not needing to use any of the provided condiments in the seating area.\n\nIf you asked me what stuck out from this place, I honestly can't tell you.  The layout had the right idea in mind for you to take your order and then sit in the back, but we lucked out that it wasn't swamped when we came here on a Thursday at 6:30PM.  I guess because it was a holiday weekend that the lines were shorter, but our food turned around pretty quickly.  \n\nThe two bowls we got looked pretty much the same, and we weren't told which was which.  My friend got the chicken bowl and I got the tofu.  How can you not tell the difference between tofu and chicken?  Trust me - we tried.  The chicken bowl I thought had more flavor, but not enough to have me running back here.\n\nVery underwhelming when there's other options in the area, but for under $25 for two people with two waters?  That's pretty decent.", "author": "Jaclyn C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-06", "description": "I'm all for fast casual, but wasn't really impressed by Honeygrow. The ordering process was easy enough (there are touch screen machines so you never have to deal with cashiers). Then you go to the back and watch their flipboard for your number. My order took forever to show up (about 10 minutes) and the crowd grew about 12 deep, and when my number as on the board, everyone at the counter was too busy either making orders or on the phone taking delivery orders. Would've been good if they actually labeled the trays so I didn't have to wait for someone to tell me which tray was mine.\n\nAnyway, I went with the NY Pastrami stir fry, which was pretty disappointing. The egg noodles were good, but the veggies were kind of lame. Just a crap ton of green beans, and some bell peppers. It was largely brothless too, even though it's listed as having broth. And I thought the sauerkraut would be interesting, but it was unevenly distributed and gave random bites of sour. The pastrami was okay. As sodium filled as you'd expect, and just a few thin slices. More of a gimmick than a well-thought out dish. And for a hair over $12, I expected better.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "The wait time is brutal- especially on a weekday night but total worth the wait.\n\nI always order the spicy garlic tofu. As a vegetarian I love that I can customize.", "author": "Shruthi R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-17", "description": "I love love love honeygrow and was so excited when they came to BK- but speed and efficiency is not this location's strong suit. At all. And alot of times orders aren't correct. Good thing the food is good otherwise I wouldn't bother stressing myself by coming here.", "author": "Marisa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-13", "description": "I like it. It aways my first choose when I want to have lunch. I feel the noodles taste like Thai food and I also like salad. Next time I would like to try the yoghurt.", "author": "Jiaqi Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-21", "description": "God again. So I haven't had time to get in touch with the comment left here on my review. But tonight, with 5 people in the store my order of \"regular\" dressing somehow turned into wet/watery barely there dressing. To pay $12 for a salad and either not have dressing on it or not have the normal consistency of dressing is just not worth it. \nHoneygrow is decent in busy lunch hours but clearly has failed me in off hours (which makes no sense)", "author": "Sacha-Avi S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-11", "description": "I love this place and have been ordering here for a while but it's disappointed as of late. \nMy last three Caviar orders have come without sauce or mix-ups on the ingredients.\nSuch a shame cause it's not cheap!\nWill continue to order, just hope they get it together.", "author": "Lauren B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "I've eaten here twice and loved it both times. The food is fresh, filling and a nice change from the ordinary. I really like the ordering process... There are several touch screen computers in the back and you can place your order. Want dressing on the side,? No problem. What about switching your chicken with shrimp? They can do that too. Each step is easy and itemized so if there is an extra cost it will be displayed. After you place your order you swipe on the pad attached to your pad and it prints out your receipt. Then you step the side... and the're off! Let the races begin! You watch a board similar to those at the race track to see your number. You wait in anticipation and when your number comes up you go to the counter, grab your bag and go. \n\nThere is a fixing station with a few sauces and utensils. There is also a soda machine if you ordered that. \n\nI will go back because I've only had the noodles and i'd like to try the salads.", "author": "Kiki K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "I came here for the first time today with my coworkers for lunch. The ordering process is very simple you order on a screen and then they call out your number when it is ready. I had the sesame garlic stir fry customized to my liking everything was fresh and tasty. I cannot believe this food is healthy it tastes so good! I also had the orange juice which was refreshing and did not have an overly ginger flavor which a problem I usually have with ginger in my juice. The location is very clean which was great I looked at the prep stations and I did not see a mess at all. Very happy with honeygrow. I plan to have lunch there again very soon!\n\nUpdate- 9/7/2017 - we ordered for a large order about 20 stir frys and the staff was very accommodating. We received everything we ordered with no mistakes and a smile from the employees! I can't wait to return to honey grow!!", "author": "Lucy D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-10", "description": "Have been going to this spot since they opened, and the locally sourced products are definitely quality! The major part that is lacking is the staff. Although I pay for extra toppings every time there's always stuff missing when I get home. The staff want to hang amongst themselves rather than with honey grow clients. Collectively they are really nice but when paying $13 for a salad it would be nice to have all the ingredients included. It could also adapt better hygiene policies.", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-07", "description": "I love this concept--it's automated, fast and surely the new wave of fast casual dining. I came on a Thursday evening around 6pm--there were no lines and only a few people in there.\n\nI got the coconut curry with tofu, rice noodles and added broccoli. The flavors of the dish left me wanting more as it was quite flavorless. The description of the dish sounded more appealing than it really was.\n\nI also appreciated how each item listed the calorie count next to it. I like how the cooks make it fresh and you can see them making your food--just wished it tasted better!", "author": "Alyssa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "HoneyGrow is my favorite place for stir fried noodles and veggies in the downtown area.  I always get the Sesame Garlic option with egg white noodles and shrimp.  Everything is cooked to perfection.  The restaurant is clean and they move swiftly.  I love that the kitchen is open and I can see them preparing my meal.  I probably have this once a week for lunch.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-29", "description": "I lived in Philly for several years and that is where my addiction for HoneyGrow started.  It has the best concept which is fast, fresh, healthy, and LOCAL food.  When I moved from Philly to NYC I was slightly devastated that I was no longer within blocks of one.  \n\nThis location is clean, has helpful employees, and gets your food out in a reasonable amount of time.  My favorite stir fry is the spicy garlic with chicken and shrimp.  This is a great place to grab something fast, casual, and healthy. They also sell salads as well, and an app you can order ahead of from.  Be prepared for a wait during lunch time!", "author": "Dominek T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "I had a stir fry and it was delicious n a much healthier option but still just as tasty compared to my fav Wok to Wok. They have zucchini and sweet potato noodles yall which I love! As for the experience, its very easy to swap and customize your order in their self-order screens - my favorite interface that Ive seen at fast-food spots. I will say I was a bit annoyed that they didn't have prices available on their physical menus - I also didnt see a menu for their honeybars, which I may have ordered on top of my stir-fry otherwise. However, once you start using the screen, ordering stir-fries and salads is pretty transparent - the costs are all laid out.  Overall my high rating is for the great tasting and healthy food options plus the ease in which you can customize your order. Also, the wait was pretty quick! Looking forward to trying out their other options.", "author": "Sand Ra N."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "honeygrow", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "194 Joralemon St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/E0yiPDizg6M9k1mst3llzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13474220714"}