{"aggregateRating": {"reviewCount": 156, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "honeygrow is a fast casual, build your bowl/salad/stir fry chain, and it's a great option if you're trying to eat a little healthier.\n\nIt's tempting to draw comparisons with Chipotle, but the similarities being and  end with being able to customize your meal. When you enter the restaurant and walk past the long counter, behind which the staff prep, cook, and serve the food, you will get to a series of screens where you choose what you want to order. Then you're given a bill with an order number, and another board where the available order numbers appear. There is very little interaction with the staff, and it's remarkably quiet for a fast casual restaurant. This system of ordering might be a turn off for people who have questions about their order or want to customize beyond what is available on the screen. \n\nThere are a number of set options for salads and stir fry, but I chose to make my own stir fry with a double order of chicken, a number of veggies (3 are free, and there's a cost per additional veggie), the spicy garlic sauce, and toppings of cilantro and sesame seeds (2 are free, and there's a cost per additional topping). As I'm on a low carb diet, I picked Boston lettuce as my base. I think it might be a good idea for honeygrow to have more low carb base choices; zucchini noodles maybe? Another option would be to offer a meat and veggie stir fry for a slightly lower price.\n\nWith all the extras, it came to around $15 for a smallish portion stir fry, which is pretty overpriced, but the food was flavorful, tossed around well, and the meat to veggie ratio was perfect! I didn't try any of the other sauces, but I've been here twice and was perfectly satiated. \n\nThe food is ready within ten minutes, and my only complaint is with the app because I tried ordering through my phone once, and only after I had built my order was I informed that there are no more pick up spots for this location. \n\nThere is also a honeybar with juices, sodas (with cane sugar, as advertised!), Yogurts, and fruits, but they're all a little overpriced. \n\nOverall, a very good option for a quick, plant based meal for a variety of food preferences!", "author": "Shivani P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-26", "description": "The food is okay, it's comparable to some of the other stir fry restaurants out there.\n\nHowever, the food is way overpriced for the portion that it gives. Are they trying to feed a baby? I don't understand how they can justify charging 10-15$ for a small child's portion. If it weren't for the portions this would be a 4 star review.", "author": "Xu X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-12", "description": "I went in thinking this place was going to have healthy stuff, but I was pretty surprised to see that a good amount of the options are relatively high in calories and have a lot of sodium. I ordered the Spicy Sesame Garlic Stir Fry and while it wasn't terrible I would not pay $11.50 for it again. The place was absolutely packed at lunch so I would definitely recommend using the app to order or getting there after the lunch rush.", "author": "Devin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-26", "description": "This place has the perfect mesh of healthy and feel good food. I was craving noodles but didn't want too many calories, etc, and stumbled across honeygrow. You order on a touchscreen which makes everything super efficient, and then you get your food relatively fast. Perfectly portioned and super yummy, I made my own stir fry and left content but not grossly full. Will be back for sure!", "author": "Jessie W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-18", "description": "This place is right next to my doctors office, so I stepped in after a visit for lunch. I'm all for this modernizing no need to talk type of places. I was always the one that can't be heard when I order. Its why I never order salad. Telling the person making it what I want in it is frustrating when my voice is low, and I'm short, so they can't see me over the counter. Ahh.. Modern technology. I ordered a stir fry with beef, edamame, fried onions, and mushrooms with spicy garlic dressing. First of all, regular dressing is too much dressing, ask for it on the side. The food was ok. I'd go back when I'm in the area and don't want to spend too much money. Its quiet. so maybe it would be a good place to get some work done.", "author": "Sarah T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Was in area and needed a quick to go place. \nLove love love thus concept!\nOrdered garlic noodles! Soooo yummy! \nFriendly staff and fresh delicious hot noodles!", "author": "Kerri G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "I was thoroughly impressed with the food here! \n\nI had a custom made salad and they really custom make it to your wants. You order at a little computer kiosk (an introverts dream), pay, and wait towards the back area for your number to come up. I ordered a not-so-standard salad (not standard because I got to customize it to my likes) and also a side of their bread. While you wait in the back (near the drink fountain) a bunch of numbers flip, old school style, and when you're pops up your order is ready. The salad I ordered was HUGE! I was really surprised. I thought they made it to perfection, they tossed it so the dressing was evenly distributed and wasn't too heavy. They weren't so stingy on the toppings I wanted either so it wasn't just a bunch of lettuce and spinach with 3 pieces of walnuts. I don't recommend the break very much, it was pretty unmemorable. Will def be back.", "author": "A Sofia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-30", "description": "I have ordered the custom stir-frys a few times now, and two out of the three times, my order was messed up. The first time, they forgot to include the sauce that I wanted on the side, and the most recent time (as part of a group order), they forgot both the sauce AND the Boston lettuce cups which is supposed to be the \"base\". (How do you forget what is supposed to be the most important part of the order?!) And one of the times that I was waiting for my order to be ready, another customer also found that he was missing his sauce. So, this is apparently a trend.\n\nWhatever their system is - for checking that everything ordered is included - doesn't work. I mean, they made up for forgetting the Boston lettuce and sauce by delivering the forgotten items over to us (we were just a couple blocks away) and offered a drink to compensate for their mistake, which is a very nice gesture ... but these kinds of mistakes shouldn't be made in the first place, especially when you have the electronic kiosks to take orders that eliminates the human error aspects of it from the ordering process. But when you don't have someone who actually checks the order against the receipt, it kind of doesn't matter.\n\nThe food is pretty decent, though, and I appreciate that you can make a very healthy salad or stir-fry (of course, depending on what ingredients you include, as you can still make an unhealthy salad with unhealthy ingredients). There are a few vegan and gluten-free ingredients to make your order vegan and gluten-free, which I also very much appreciate. A few more V \u0026 GF options would be nice. However, it is a little on the bland side, so you HAVE to use one of their sauces (which was why I was annoyed I didn't get a sauce my first time there), or use some Sriracha sauce that they also have available.\n\nI have yet to try a salad from here ... maybe I will someday.", "author": "Barbara C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-18", "description": "Good spot for lunch. You can make your own stir fry. Sauces are good, nice selection of the ingredients. Price is kind of high for a stir fry though. NY pastrami can go for $15.\n\nThe honey bar is pretty expensive too. Haven't tried it, but I can get same thing for half of the price from a deli.", "author": "Maria B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "I love this place so much. I wish there was one near my office so I could eat it every day. In fact, it's so delicious, I'm not entirely sure it's healthy. Nothing that good is good for you. I'd like honey grow to open a branch in my kitchen! I only ever get the coconut curry stir fry because I'm boring like that but it's awesome.", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "This is one of my to go places! I go to soul cycle in court street so I could have this! Everything tastes so delicious, from salad to the stir fry. I don't always like pork but even the pork is so delicious. I ask for less sauce because I don't like food to heavy. It's so good! And cheap", "author": "Cyu L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "Place was very clean and welcoming. Very efficient . I had the chance to customize my own stir-fry as my brunch today lol. It was so tasty with the spicy garlic sauce. My only downside to the place was that my order was takeout and i felt that my serving could've been bigger with the container they placed my food in.  My total was $12.42 that includes the $1.50 la Croix drink that I choose. At that price I would've expected the container to be filled nearly to the brim. It was so good I didn't even allow that to fully irritate me.", "author": "Akiba W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-23", "description": "First time visiting today to grab a bite and I got the pasta with crab.  I didn't know how to order so was told by the young lady it's all through a kiosk which was also cool.  It was really delicious and fresh. The ingredients used were freshly cut and you can taste in every bite. I would definitely visit again...I gave it a 4 because the staff was a little stand off-ish but in any regard one should definitely pop in and grab a bite.", "author": "Dina M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-24", "description": "I really enjoy the make your own salad concept. However, when I pay extra for additional toppings, I am usually missing half of them. It shouldn't be the customer's job to micromanage the staff to ensure everything is added to a salad, it's a very simple process. I hope the manager reinforces to staff to pay attention to all ingredients listed. \n\nWhen I do get what I want, it is usually very good.", "author": "Christi C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-28", "description": "I come to this place for lunch every so often, and it's always delicious. But the real reason I come in because of one of the staff members. His name is Brad and he's always got a smile on his face. He makes everybody who walks through the door feel welcome even though half of them are just picking up to-go orders. I've worked in food service at numerous places and I know what it takes to be friendly and welcoming. He's attentive and extremely helpful and while some people can fake that, it's easy to see when someone is being authentically helpful and accommodating. Promote this man right now!! :)", "author": "Dan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-23", "description": "This is a relatively healthy place to go for a quick bite. There's a good selection of bowls with interchangeable options within each one. I liked that one could place an order electronically which eliminated queuing. My only complaint would be that the beef in the bowl I got was a bit too chewy and somewhat cold. Other than that, this is a nice alternative to nearby fast food joints.", "author": "Rob C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-30", "description": "Came here because I was starving and desperately needed a meal after an Equinox class (trust me, I hate myself for even writing that sentence)\n\nI was pleasantly surprised with my custom stir fry with the sesame garlic sauce. It was much more flavorful for a self proclaimed healthy place. What was upsetting was that they forgot to add one of my ingredients (broccoli! in a valiant attempt to be healthy) and also forgot to give me my green juice. It's like honeygrow wants me to continue to be my disgusting self.", "author": "Angela C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-26", "description": "Went there a couple of days ago. Had the beef and broccoli with noodles. Was delicious. Service was quick", "author": "Bea E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-28", "description": "They claim to have delivery service and unless you live in the zip code of the store, you can't order online or over the phone.  We were ordering for a corporate lunch (12 meals) and they wouldn't take our order for delivery because our credit card billing zip code was NJ (from a corporate account).  \n\nI called and talked to someone who was no help and didn't care that we couldn't order- said \"Yep, that's right you can't order if you don't have our matching zip code\" and hung up.  I called back to ask for the manager and they were no help either.  \n\nAfter taking time to enter all the orders in online just to find out the order can't be delivered and no one at the store cared is very frustrating.  I walk by this store everyday on my way to and from work and I won't be stopping in.", "author": "Valerie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Excellent salads! The place is cozy and the staff is super friendly. Brad was so nice and helpful... this is my new spot to stop by and have an amazing lunch!", "author": "Melly V."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "honeygrow", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "194 Joralemon St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/E0yiPDizg6M9k1mst3llzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13474220714"}