{"aggregateRating": {"reviewCount": 156, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "This place is awesome. You make your own stir fry on a touch screen. It's easy, fast and delicious!", "author": "Lee B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-17", "description": "Very clean Honeygrow location. Don't let the front of the store deceive you, there is a large back space that is open with a lot of seating! Customer service was great and as any other Honeygrow, has a lot of options to personalize your order.", "author": "Brigid K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "love this location ! always fast service with the cooks and cashier Sharon is very welcoming and helpful thank you", "author": "Esther L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Thank you Rashel and the gang at Honeygrow.  I'm addicted! Between the Walnut Noodle salad and the Spicy Garlic stir fry, I have dinner almost every night. Right off the train at Court Street/Borough Hall, the food is always delicious and fresh.  Some of the staff is still learning so it's not a bad idea to check your order before you leave. But tonight when I got home and realized my order was missing a few items, Rashel took great care of me asap! Whipped up a new salad and it looks amazing. Thank you to DJ who is service with a smile...pretty soon they will be flawless but give it a try now. You will definitely be back for more!  (Tip from a friend in Philly if you are trying to cut calories..get the sauce on the side for the stir fry..food is tasty without it and you can monitor how much you use). Can't remember how I lived without Honeygrow!!!", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-10", "description": "I like the salads and bowls which I usually order online, but I have to mention something that is somewhat small but is still very annoying. They play great music at honegrow (i heard Hendrix last time i was there) and maybe this is old-manish of me, but its SOO LOUD. Maybe its because the speaker is right near the ordering counter but i find myself having to shout to hear anyone-its like walking into a club or something.  Keep the great music but maybe turn it down just a little?", "author": "John D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-09", "description": "This is a great alternative to places like Shake Shack where all you can really eat is either burgers or chicken sandwiches. Everything here is fresh and good and the best part is that you design it all yourself if you want to. A great addition to the neighborhood.", "author": "Robert A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-12", "description": "Food is okay. Nothing to rave about. The customer service, though, SUCKS. Always a crowd. Even when you use the app and you have a scheduled pickup time. You wait in a crowd, with not enough room and loud music blasting, so uncomfortable. And they are rude/overwhelmed at the cash register and it can take FOREVER just to get someone's attention to check on status. After waiting 20 minutes past my pickup, with no end in sight, I was told they couldn't cancel or refund my order and that I would have to waste more time finding customer service on the app. Nope. Done. Never again.", "author": "Sean B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Guys, I'm obsessed. Brooklyn Heights has a fair deal of restaurants, but very few of them are good. This place is efficient, healthy, and SCRUMPTIOUS. The honey ginseng green tea is amazing, and I like to make my own stir fry - wheat noodles with chicken, bell peppers, shallots, and red curry sauce. Also the fruit cup - strawberries, blueberries, and pineapple with honey and coconut. Go now and support this place. We need it!\n\n*One note for the management: There is no phone signal in that place. Any way to fix this? Thanks!", "author": "Whitney T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "My experience was amazing. The food is so wholesome and naturally delicious. The employees can practice being a little more personable, but the employee JP was awesome. He was so empathetic and made me feel like I was the only customer  in the entire store. Charlene was also so warm and nice.", "author": "Wilfredo R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Everything about this place is amazing! It felt like I was eating the food of the future; right as I walked in, there were touch-screen kiosks to customize, order, and even purchase my food. It was the ultimate use of technology and very convenient! I was able to pick and see exactly what I was buying without even having to wait on line or talk to a staff member. Although I see a lot of customers on here complaining about the wait times, there was no line at all when I arrived, and my food was made fairly quickly. I ordered the sweet soy sauce stir fry and it was incredible; very flavorful and the ingredients tasted super fresh. The location appeared very clean and I will definitely be returning!", "author": "Jerry Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-10", "description": "I was a huge fan of Honeygrow in Philly and I'm thrilled they're here in downtown BK! My favorite is the spicy garlic sauce. You can't go wrong with any sauce! The salads are healthy and good too. Warning: there usually is a wait but be patient, it's worth it!", "author": "Lisa Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-17", "description": "It's OK.  I was expecting more vegetables with the stir fry.  It's pretty much all noodles.  If you're are in the mood for some Chinese lo mein, getting one of the noodle based stir frys is a great healthy alternative to the salty and MSG-laden alternative.  However, eating a box of noodles with a couple of pieces of broccoli is not what I consider a healthy dinner.  Much prefer the bowls at bGood.  The salads were fine but not life altering.  I do like the set-up with the self-serve kiosks and staff is friendly.  For me, it's a once a month thing, not a weekly thing.", "author": "KB S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-25", "description": "The food here is just OK.  The staff is friendly and their system is cool and efficient. I have tried it a few times.  Dos Toros around the corner is tastier.", "author": "R J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-22", "description": "It pains me to say that I can no longer go to honeygrow. My first case of salmonella at the Hoboken, NJ location was minor and they rectified the situation with a refund and free meal. The Brooklyn Heights location is right across my job, so I have gone there a few times. Inconsistency with the meals is one issue I didn't mind so much. No one is perfect. But when I ordered again about a week ago (the one meal I always get -- tofu brown rice bowl with egg, shallots, kale, carrots, pickled cucumber, sesame seeds, and coconut sauce), I got salmonella...again. It sucks. I love the food, but don't love getting sick by it and feeling terrible for 2-3 days after. I wouldn't go so far to say that the employees completely disregard sanitary protocols, but they don't always clean the salad board when they're prepping salads during the lunch rush hour (I don't order the salads because of that) and that screams \"cross-contamination\".\n\nI will also mention that my boyfriend got sick from the Hoboken location, as well, and has never returned because of that. Guess I wanted to keep the faith a little more, but now I have every reason to not return.", "author": "Pita S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "Sabrina is amazing! The driver brought me the wrong food order and Sabrina made up for all the inconvenience. She has incredible customer service skills", "author": "Luis C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": "Delicious food, super friendly staff! Red curry with rice noodles was yummy. Can customize everything. Pretty quick too.", "author": "Creagh B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-18", "description": "Great food. But started doing Caviar orders and all caviar orders get priority over the 10 people standing in house on the line. Please fix this. Food is supposed to come out quicker and people in the restaurant should be treated better.", "author": "Tb 1."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-01", "description": "This place is one of the best. It is fresh real food and the staff is awesome. The food is tremendous and the technology that they use is top natch. All around the place is great", "author": "Lawrence L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-31", "description": "I've ordered from the app several times and it was very efficient.  Last night I ordered dinner on the app.  When I arrived to pick up there were several people waiting for their orders.  One of the honeygrow employees shouted...If you're waiting for your order you can go to the back area and look for your number on the board.  I did that.  After waiting for over 10 minutes in the back area I decided to go back to the front and check if my order was there.  One of the employees asked what my name was and said...Oh your order is here.  How long have you been waiting?  I said over 10 minutes because you said my number would appear on the board and it wasn't showing up.  She said that if you ordered on the app your number doesn't show up on the board.  Nice to know but she didn't say that initially.  She didn't apologize, just went about her business  Decent food but poor customer service.", "author": "Paul A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "I always love the noodles at this cool spot. The food is always fresh and the service is quick (outside the lunchtime rush). Lots of options to customize your meal. Great service always. Thanks Rashel + Team + OZZY!!", "author": "Orin A."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "honeygrow", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "194 Joralemon St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/E0yiPDizg6M9k1mst3llzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13474220714"}