{"aggregateRating": {"reviewCount": 156, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "Stopped by here for takeout right before the lunch rush. The set up here is interesting. Different from most places. I can see the convenience of it but at the same time, if it gets busy the place may crowd a lot. I got the coconut curry stir fry. I thought it was all premade but to my surprise they stir fry everything fresh in front of you. Seasoning-wise it was a bit bland and I don't even eat very salty food. The ingredients seem to all play a different role rather than the dish coming together to something delicious. Maybe a salad or meat stir fry dish would've been more flavorful. I still walked away happy because it was fresh, edible, fast, big portions, and good service.", "author": "Ferdinand C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-01", "description": "Food is healthy, fresh and made-to-order. Mostly salads and stir fry meals. The combos sound great but actually don't really come together to form something beyond ordinary. I had the coconut curry stir fry. It was good but lacked spiciness and deep flavor. OK, but not worth going out of your way for. Also, iPad ordering was a bit confusing as I thought I was substituting beef for tofu, but it was an addition rather than a substitution. Prices ranged from $8-13 per dish.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-14", "description": "Great food and service.  This week I got a takeout order and they forgot to put in the chicken.  I did not discover this until I went back to my office.  Only 1 elevator was working so it took awhile to get to my office.  When I got there, the chicken was missing from my salad.  Ugh!  So I went back and of course they gave me the chicken.  When I went back the next day, Lisa remembered me and gave me my lunch on the house.  REAL SMART.  I came back even with the mistake the day before so they weren't gonna lose me as a customer because I like the food so much, but she did the right thing and now I am a customer for life!  Lisa and her colleagues work real hard and are fantastic.  They deserve a raise.", "author": "John S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-12", "description": "I had a very sad lunch from here - my colleagues and I ordered 3 different stir fries via Caviar and all were lackluster. None of ours had enough sauce or veggies to integrate with the noodles - I had 3 florets of broccoli and a little bit of chicken with a bowl of plain rice noodles. If there was coconut curry in there I didn't taste it. Same with my colleagues.\n\nBased on the good reviews of this place I am guessing we just had an off-day lunch, but maybe better to visit in person rather than order from so you can ask changes to the dish.", "author": "Alicia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-07", "description": "Stopped by today on my way home before the storm hit. My friend had the cobb salad which was so delicious,we got the honey ginger dressing which was just  a tad tangy and a bit sweet. I had the Red coconut\nCurry with jalapeno and pineapple. Wow it was so good. Spicy fresh and down right superb.\nThe staff was friendly , Our food came out quick. I was surprised how busy they were considering it was snowing so hard. I bet they rock during lunch time.", "author": "Rob B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "Into the crowded salad landscape of chop't, sweet greeband just salad comes this Philadelphia born healthy food in a bowl place.   They serve noodles along with salads.   There preselected salads were limited and was not so fond of interface.  After order needed to stare at this board for the number.\n\n\nThe salad was good as ingredients tasted fresh and liked could get salad in real bowl.   Prices were similar to others as my salad with meat with five toppings one of which was nuts cane in under 10.   They do the real cane sugar sodas which I understand but if having soda I am okay with Coke,\n\nThey also have location in Hoboken near path.", "author": "Bryan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "The food was AMAZINGGGGGGG- I hate the 20 minute wait for it but after tasting my food I think it was worth it. I love how I can order my food myself at my own pace on the iPads. I don't eat here too often because the food isn't filling at all and a little pricey but I stillll love it!", "author": "Lola C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-07", "description": "I always get the 'make it grain' salad, which is awesome. Today I decided to get red coconut curry stir fry and I added shrimp. The stir fry is okay, not enough sauce . It needs a little kick to it to make it awesome.  The shrimp on the other hand, was frozen and had a weird taste to it. It was very mushy. \nI would recommend this place for the salads, put don't add shrimp, cause they're not fresh!", "author": "Darriel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Usually when you think of stir fry, greasy MSG soggy vegetables come to mind. Not at this place. Low oil, super fresh inspired wok combinations are at the heart of this establishment. The dishes are also very customizeable with the very user friendly computer ordering stations. The staff is seemed very motivated as well. \n\nI almost hesitated to write such a good review because I know this place is gonna blow up soon and there'll be a line out the door. But healthy affordable options are so limited in Brooklyn it'd be a shame not to let others know. \n\nI know I'll definitely be back to work my way through the menu.", "author": "Jason F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-06", "description": "Very disappointing. Trying to be healthy and low/no carb. I ordered the something with garlic sauce that required me to sub-out the turkey for what I wanted, the chicken, Very complicated ordering process on the screens. I got the lettuce instead of rice or noodles to stay low carb. \nWhen the bowl was ready it was only about 1/4 and the lettuce was on the side. Very very small portion for $10-$11. I asked about this and was told I could have added more veggies or chicken but that was extra. I said how would I have done this? She said there were ambassadors near the order stations and at the register. I said, How was I supposed to know that and there was NO one near the order stations. \nAlso, the sauce was very very spicy and I did not order the spicy sauce. The wok and salad station were filthy. My friend ordered a tofu dish because he's a vegetarian and they used the same wok/stir fry as they just did for what appeared to be a chicken or pork dish. Yuch.\nFinally, the soda machine was broken. It came out about 90% soda water/seltzer and extremely light on the syrup flavor. I told the cashier, it was looked at and I was todl it was OK. It was not! Lastly, very expensive for what you get. No menus! \nI just didn't get it.\nThanks.", "author": "garret r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-11", "description": "I thought the atmosphere was great and food was delish! Quick simple and clean. I wish the staff were more attentive. If this is your first time there it can be hard to figure out when your order is ready if you don't see the board and there is little guidance. Other than that I had an enjoyable experience and my meal was great!", "author": "Heaven R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "In and out, it is not however delicious and tasty it is! I would have given 5 stars however as a busy Brooklynite I prefer my preparation wait time to be less than 10 minutes-- they had me waiting 15 and my chicken was cold in the middle of my strir fry bowl so what's the excuse? Ah, guess I'll have to just chalk it up to an off day. The food really is delicious here and it is a welcome addition to the neohjborhood. Also appreciated a staff member going around the cafeteria area asking people how they are enjoying their meal. This form of hospitality especially at a \"fast food\" type joint happens far too infrequently. Happy to see that they care about their customers. I'll be back for sure!", "author": "Elle L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "Love Honeygrow for lunch! I usually order on the app because it's CHAOS in there during lunch time. But they do a really good job. I always get the coconut curry stir fry with no jalapeños.", "author": "Jordan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-29", "description": "I wish I could do 3.5 -- orders the curry noodles and the roast pork seasonal special. The places is very sweetgreen-esque because they get all their ingredients locally and they have a very modern facade. The curry noodles came with too many noodles which made it hard to taste the curry. It also came with pineapple and tofu in the dish; could have used more veggies and some crunch. The roast pork noodles were delicious and buttery, and came with crunchy broccoli and perfectly cooked lomein noodles. Would go back if I was in the neighborhood but would necessarily make a special trip.", "author": "Isra P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-21", "description": "I had a stir fry here last night.\n\nI'm not sure if it was the sauce or the cooking preparation method, but it had a terrible, almost chemical taste to it. It may be because they use the same pan repeatedly, so the oil had gotten old and gone bad? Or it could have been because the entire pan of food caught fire while being cooked? I don't know, it tasted kind of like lighter fluid or something, so I did not eat it all. \n\nI definitely do not recommend the stir fry or the coconut curry sauce.", "author": "Kate K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-07", "description": "Quick and casual spot to get noodles or salads. You can choose your own ingredients. The noodles I had were very tasty, but also pretty salty, which was not ideal since it seems to be marketing itself as a healthy place. But the food was fresh and definitely worth trying again.", "author": "Allison P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-23", "description": "I don't know what all the hype is about. The concept is cool and ordering is easy- but the food itself is really subpar. I've had both a stir fry (sour cherry BBQ) and a salad (make it grain) and both were relatively flavorless. Their sauces and dressings are seriously lacking. \nNeedless to say, I'm super disappointed and won't be going back.", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-05", "description": "I visited Honeygrow for the first time last week and I've been back for the past 3 days! Portion sizes are reasonable for the price you pay and you get to customize your bowls if you want ! The staff there is friendly and the manager walks around and asks if you're okay. Rashon \u0026 Sharon are always so helpful to me. Great experience, will highly recommend!!", "author": "Silver S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-02", "description": "Sabrina and Tyler made my experience at Honey Grow so wonderful. It was my first time here and they welcomed me with a smile and explained to me how everything works right away. It's rare finding great customer service like this in Bk let alone nyc so you can bet I'll be back to enjoy another stir fry", "author": "Angie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-07", "description": "Good food. You can alter the ingredients to what you like.You place your order on the little big tablet screen and you can pay there with your debit/credit card as well. The place is clean and they have wifi which is a plus. The people that work there are helpful and nice as well.", "author": "Morgan L."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "honeygrow", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "194 Joralemon St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/E0yiPDizg6M9k1mst3llzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13474220714"}