{"aggregateRating": {"reviewCount": 156, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "My first visit to Honeygrow and I was so happy. Ordering from their Kiosk was fun and simple. I wiek in Park Slope and have tried many salads, but Honeygrow is another platform. I built my own salad with Arugula, chicken, hard boiled egg, avocado, quinoa, grapes(don't know where they got these sweet little red grapes cut in 1/2) apple, pecans, pomegranate, lemon vinagrette dressing. So fresh, so deliciuos, very big, enough for 2. This pkace is a hit. Too bad I couldn't lug home dessert. The yogurt looked amazing!", "author": "Terri Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-08", "description": "Discovered this gem last week while looking for place to grab lunch. I was so pleased with the food, I returned the following day with 12 co-workers!\nIn an attempt to save time, I ordered from the Honeygrow app and even though I'd set my store to the Brooklyn location, my order went to Philadelphia.\nI was upset but Ollie was kind enough to speak with his manager and they were able to get me my order pretty quickly during the lunch rush.\nThe food was great and so was the service. I've gone back since and the glitch in the app has been corrected. Looking forward to my 4th visit", "author": "NiCo R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-17", "description": "So I came here looking for something fresh and light tasting and I heard amazing things about honeygrow from a friend but sadly I was disappointed. \n\nTo start off, I thought the ordering system was pretty good, and especially great if you're the type of person who doesn't like direct interaction with people. Basically it's a computer and you go up to if and either select a specific stir fry recipe or you can create your own (which is what I did). Then all you do is swipe your card (or insert cash) and wait for your food. \n\nThe service was great too, even though there isn't exactly a wait staff, several workers did stop by to check up on us throughout our meal. They were also super friendly. \n\nThe downfall though was the food, maybe it was just an off day but I just really did not think it was super fresh tasting, despite watching them cook it (which was a perk). I felt a little sick afterwards too. Honestly it was probably from the sesame garlic sauce rather than the veggies but I just felt so so gross afterwards and the food was overall lacking in flavor anyway. \n\nMaybe I'll come back one day and order something different (without the sauce) because it's so convenient but the food definitely was disappointing.", "author": "Claudia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-15", "description": "I love honeygrow! Both the salads and stir frys are excellent. I always do a create your own, and the togarishi Turkey is yummy, plus they have sooo many choices for fresh vegetables. I like it hot, so I always get one of the spicier sauces. \n\nThe only negative is that sometimes they don't cook the stir fry long enough, and the vegetables can be slightly raw. I avoid this by just walking to the counter and asking them to cook it a little extra, which they always say yes to. It was very sad the first time I came home with it undercooked and found my raw green beans mixed in. \n\nThey also recently started putting out bags so that YOU bag your meal for take out rather than them. I know it's a dumb thing to criticize, but come on! It's not that hard to put my meal in the bag for me. \n\nEither way, great fresh food and definitely recommend.", "author": "Lucie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-20", "description": "Yes! This place is good. I was here twice in a row and had no problems getting a seat for a quick lunch. You order via touch screen and then you wait for your number to appear. To stay portions are larger than take out though!\n\n-Spicy garlic noodles - Loved the spicy sauce! You can customize it a little and add or take away toppings.\n- Made my own salad with kale and noodles. Really enjoyed the Sriracha Tahini sauce! \n\nHope they expand into the city because this place is delicious!", "author": "Sara Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-27", "description": "My stir fry is mostly noodles. I think there was 2-3 pieces each of the veggies. I paid $.49 extra for 4 or 5 to tiny pieces. Meanwhile there has to be about 4 cups of noddles here. So much for a healthy lunch. Because you have to order at a computer and you don't get to watch them make your order you can't ask to customize anything. I paid over $11. Ugh.", "author": "Jo S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-01", "description": "I LOVE honeygrow. The Brooklyn location staff is always super friendly and efficient and the food is fresh and delicious. This is my go to lunch spot in the neighborhood and I highly recommend it. Keep up the good work!", "author": "Jaclyn P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-02", "description": "Simply amazing place!! I instantly fell in love with it.  The system of order the say they prepare the food, I had the tuna salad, I can honestly say this was the best salad I've ever had.  The show you how many incalories every meal.  You can build your own salads on the self ordering touch pads. I highly recommend!", "author": "Shaniel Sean G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-21", "description": "I am a big fan of HoneyGrow and eat there pretty often. It can be expensive but I am mostly fine with that given the area. What I am not fine with is what I perceive to be as greed. First, I have been using the mobile app to order my food in advance and just pick it up for quite some time. This is something that was encouraged by employees at this location because it can be incredibly hectic and busy at times. Recently, I have come to notice that there appears to be an additional charge of approximately $1.50 when using the mobile app.. When i noticed this, it infuriated me because it not listed as additional charge. It's sneaky to have my order total jump from $12.55 to $14.05 (pre-tax), without stating why. It's also bad business. I no longer preorder, which means I rarely order. But on my way to work today I decided to go in. Sidebar- its too loud in there. But that was not the problem today. Today my order was overcooked. I was not happy about that but the fact that i was then charged an additional 50 cents for additional sauce, i saw a sheer greed. You guys use very little sauce, which can mean too little flavor. In any case there are plenty places in Brooklyn Heights that not only allow you to order on line for free but also deliver the food. To charge extra and I still have to pick the food up is unacceptable to me, and again just plain ole greedy. no thank you, honeygrow.", "author": "Kyra R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Literally the best salad/dressing I've ever had in my life. Everything is so fresh and flavorful. I make my own salad- mesclun, kale, romaine, grapes, apple, mushrooms, onion, roasted carrots, and avocado with walnut lemon and mustard soy dressing.\nI first went in Philly and and so excited to find out there is a Brooklyn location!!!!!", "author": "Alexis D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-25", "description": "I don't get the rave reviews! Honeygrow is clean, efficient, techie, and fun. The staff should be commended for their service. However, the food was ultimately bland, common, and boring. I got a stir fry with rice noodles, beef and shrimp, edamame, spinach, mushrooms, and some other stuff, all in a garlic soy sauce. The beef was dry and almost inedible, and the shrimp was slightly overdone. The rice noodles were clumpy. The sauce was almost nonexistent. I'd describe it almost as mediocre Chinese food. \n\nI would try it again, but go for the salad bar to see what that has to offer.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "First time here!  Perfect place for after a workout at the next door equinox. \nThe food is delicious ! So yummy, healthy and awesome. \nThe staff is fabulous . They're so hard working, thorough and quick. They really seem to love their work.  I wish that I was allowed to tip them.  \nAnyway I figured I would just write them something here.  Thank you!  I think it was rashel and the crew . I'll be back. This will be my post yoga ritual :) \nI hope they open more near my work.", "author": "Arsenia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "First time ordering and I used the app to p/u at the counter.  Fast, convenient, and possibly the best salad I've had in a long time.", "author": "Tracey L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "IT'S SO GOOD I CAN'T EVEN.\n\nSo happy this is a block from my apartment.\n\nThe only drawback is that it DOES take a while to get your food -- my stir-fry took about 10 minutes, and it wasn't too busy in there, so i can only assume it'll be a nightmare once it really picks up speed.", "author": "Bella Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "I love that you can easily customize your food options. I was really craving some noodles and went with the Spicy Garlic stir-fry. The flavors were great, but WARNING: when they say spicy, they absolutely mean it. My husband and I can take spicy, but even the \"regular\" amount of sauce seemed a little too much for our liking. I would definitely recommend the \"light\" amount option when customizing, otherwise your mouth might start to feel numb from all the heat! I look forward to trying some of the other menu options the next time we are back in this part of Brooklyn.", "author": "Jamie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "I've been to Honeygrow several times in Philadelphia and am so excited this is near me in Brooklyn now!\n\nThere are computer kiosks to order so you can take your time deciding on different ingredients. There are both salads and stir fry options which is perfect if your partner doesn't want a salad.\n\nThere are many salad chains and I'm not sure what exactly the secret is that makes it so much better except maybe having fresher, more interesting, and higher quality ingredients.", "author": "Young R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-06", "description": "Seriously just had the best salad of my entire life the red wine vinaigrette dressing was really good", "author": "Lindsey N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "I LOVE THIS PLACE! So healthy, fresh, fast and delicious. Left feeling full but not tired - completely satisfied. The sauces and salad dressings are unique and amazing and I want to try them all! Plus the use of the ipad to order and pay is so fast and easy. Open more locations!!!", "author": "Phoebe R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-25", "description": "I ordered two stir-fry lunches from honeygrow via Caviar, and was it was.. kind of disappointing. My bf got the CYO shrimp stir fry, and he mentioned some of the shrimp weren't cooked thoroughly. Also, regular sauce was ordered for both dishes, and they were wayyy drier than expected. Besides those issues, my chicken stir fry was tasty, and they do give a good amount of noodles. Overall, I expected better based on the reviews, but I'm hoping it's because I ordered online. I'm willing to try honeygrow again, however will definitely make the trip there instead.", "author": "Ivy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "This place is a WIN.\n\n1st off- Technology advanced. Clean concise screens to place your order...Extremely simple to use. Options are simple, clever, tasty, healthy and FRESH.\nQuick, easy, fast.\nPrices are fair for location, offerings, etc... \n\nOptions: Yogurt bar with toppings, etc...\nsalads - kale and spinach options + a protein (chicken, turkey, tofu) + toppings\nRice noodles, egg white noodles, brown rice or salad base\nOption to make your own as well\n\nLove the dressing options\n*Spicy Garlic\n*Red curry\n^favs\n\nEnjoy :)", "author": "Samantha L."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "honeygrow", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "194 Joralemon St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/E0yiPDizg6M9k1mst3llzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13474220714"}