{"aggregateRating": {"reviewCount": 156, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "Just discovered this place recently. I like that you can order from a kiosk (eliminate human errors for orders.) You can customize either a stir fry or a salad or you can order the presets from the menu. After you order and pay through the kiosk a receipt will come out with an order number. \n\nI was confused at first because I waited a long time and realized they don't call out the numbers. Instead, there is a flipping number board (like the Harry Potter train board) in the back by the utensils and sauces that will indicate which order numbers are ready. \n\nI ordered a custom stir fry. Food was a bit salty but you can customize to get the sauce on the side, which I will probably do next time. It's a great lunch option and they also have a honey bar. \n\nI also like that it's near all the workout places (NYSC, yogaworks, soul cycle, etc.) It's a good healthy/quick post workout meal option.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "This was my first time here \u0026 the food was amazing. I had the blue crab stir fry that also came with egg white noodles \u0026 onions. I substituted the veggies it came with for broccoli \u0026 mushrooms (which was .50 for each substitution). It's a good portions size, but not necessarily like $13-$15 worth, but I get the area it's in \u0026 all that good stuff. This definitely isn't everyday lunch, but a good lunch treat here \u0026 there. F.Y.I all the stir fry options come in one size. It would be nice if there were different portion sizes. The service was also fast, considering it was around lunchtime.", "author": "Felicia I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "Was happy when HG arrived in Brooklyn Heights, since the neighborhood has recently had a surplus of health minded eateries. \n\nFirst two visits consisted of complimentary meals provided to the community therefore was able to go two days in a row and try two different meals with a comp drink.\n\nThe self-serve kiosks for ordering is great because you get to create the meal your way without interacting with a person.  It's amazing how it is a totally self-service experience, except for when you obtain your meal, someone will hand it to you.  While you wait there is a old style flap number board that updates every few seconds to display the completed orders. \n\nOverall space is neat, clean and open and the condiment section is always fully stocked with all you need to complete your experience.\n\nMy all time favorite dish is coconut curry vegetable fried noodles, it's so good.\n\nIf you are in the area and are hungry, definitely give them a try.", "author": "Esmeralda C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-02", "description": "Honeygrow is another healthish dining option chain testing the waters in NYC. The set up is very smart: you walk in, place your order via touchscreen computers, wait for it to be prepared, and then eat in or take it to go. However, since you don't interact with anyone until you pick up your food, those with a lot of questions might be turned off by this. I went on a Saturday afternoon post-work, and found it pretty easy to place an order. I built my own stir-fry bowl with brown rice, chicken and veggies topped with the sesame garlic sauce. The staff is very friendly and quick to fulfill orders. Prices are around $9-$12, more if you get fancier ingredients.\n\nSo why three stars? I didn't feel like the stir-fry lived up to the hype or it's almost $11 price tag. It tasted like a step up from Panda Express. Maybe I should have opted for a suggested option or a salad, but I wasn't satisfied with my meal. I'd be down to give Honeygrow another shot, and if you are looking for something that isn't fried or fast food in this area, this might be the place for you.", "author": "Chey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "Healthy spot in Downtown Brooklyn. Ordering is easy and done via terminals. They offer juices, smoothies, açaí bowls and custom stir fry bowls. Everything tasted fresh and the servings are a shareable size. Very pricey for a fast casual place, however so might be worth it to consider sharing dishes.", "author": "Corinne C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "Yet another fast casual chain, this one has a number of other locations on the East Coast, this one in Brooklyn being the first NYC store.\n\nThis one has a long counter when you walk in with workers prepping ingredients and bowls, but it's not in fact Chipotle style where you build your bowl with somebody by steps. Instead, it's one of these places where you can have zero interaction if you choose, by placing your order on one of the self-serve kiosks and then picking up your bowl when your number shows up on the board.\n\nThe Pastrami Egg Noodle Bowl ($11.45) was surprisingly good for a fast-paced quick service chain. They also have salads and the \"honey bar\", which has yogurt and fruits you can choose from for dessert. I would definitely return for a salad if I'm trying to not be disgusting or more likely one of the noodle options.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-04", "description": "Unique order process, innovative and ez to navigate. Tasty stir fry with many choices. Tofu was the best I've had in a while. Small portions is my only criticism. Dining area wasn't clean had to request table be wiped down.", "author": "Fee M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Delicious food and the most amazing staff! They forgot to add whole wheat noodles to the salad I ordered and they kindly apologized for the error. As I was walking to my seat, my flip flop popped and broke. Luckily I had bought an extra pair in my bag but they had a zip tie since they were new sandals. The manager (lady) I guess saw me and came over to offer help. She lend me scissors and then one of the workers came and gave me a bottled water. They were so friendly and professional. I'm definitely coming back. Take my money honeygrow lol \nAND...\nI will definitely be trying other items on their menu!", "author": "Jenny S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-06", "description": "Do you like interacting with humans when you order food? Cool, me neither; I'd much rather customize my order on a nifty touch screen before slowly retreating to my windowless office. At Honeygrow, they definitely have the fast-casual method down; you order through the computer, pay, and then wait while they make your food. I was in and out in 10 minutes when I stopped by, although I came during early evening.\n\nI went for a make-your-own stir fry, with egg noodles, sesame garlic, roast chicken, and a few assorted vegetables. If you get a stir fry to go they package it in a Chinese takeout-esque container, which is good in theory but really hard to eat out of in practice. All my vegetables were stuck under the noodles (which had clumped together) and I ended up having to dump it in a bowl rather than eat out of the container itself.\n\nBut as far as stir frys go, it was pretty delicious. They definitely had a light hand with the toppings and protein (I had maybe 3 pieces of broccoli) and heavy on the noodles, but the flavors were there. They also provide tamari and hoisin sauce at their condiment station, which is great if you need that extra oomph of umami. The portion sizes are a tad on the small side compared to price, but if you're not starving it's still more than enough food.\n\nIn any case, I'd still come back. It's a really cool concept and while I might skip the stir fry option, their salads look pretty great too.", "author": "Marina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-02", "description": "Loooove Honeygrow! As far as affordable pick-me-up lunch it's an unbeatable value! In Brooklyn Heights there aren't many fresh, quick, and high quality options so HG is definitely a welcome addition. I like the clean modern clean and efficient layout.", "author": "nina s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-22", "description": "I think I eat here too much, but is that really a bad thing? The food is good and you can choose the prepared meals or make your own stir fry dish and get a fountain drink. Since everything is cooked just be prepared to wait a bit (it's no biggie), cause it's gonna taste friggin delicious.", "author": "Michael D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "All of my dear Philly friends are going to say how late I am to jumping on the Honeygrow bandwagon, but better late than never. I've heard of this spot because of its quick popularity in Philly and because the founder is a Temple Alum (hoot hoot!), so I was excited to find out that they brought it to my dear Brooklyn. \n\nWhen you walk in, you pass by all of the delicious ingredients and it leads you to an area with a cash register and then a bunch of kiosks. I'm pretty sure you can just order with the cashier but it's so much fun to watch your order come together as you play on the kiosk screen. They have many popular, pre-created choices that you can quickly choose, but I opted to create my own stir fry and the kiosk was very simple to use with picking what you want. You get to choose a protein, base, veggies, sauce, and garnishes. \nI went with chicken, brown rice, few green veggies, a garlic sauce and some chili flakes to garnish. Let me tell you that this was one of the best stir fry dishes I've ever had! The sauce was sooo good, and they give you so much of the food that you definitely leave satisfied and full. The chicken was juicy and the veggies were fresh. Everything about my bowl was amazing. I like that they have chopsticks there for those who prefer their rice or noodles that way, or those who like to practice their chopstick skills (me). \nAs soon as I was finishing up, one of their staff members came and grabbed my trash before I even had a chance to throw it away my self. 6 stars for that!", "author": "Robin T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-28", "description": "I liked the cobb salad and thought the portion was fine - worst thing about it was the price, $12 something. IDK, $10 seems more appropriate to me. But ok. Another day I tried the spicy pork stir fry. It was ok and maybe it's just me but I'm not a fan of pork with pineapple, peppers and a sorta sweet sauce. I can't blame my taste on them though, and you can switch up the ingredients, but I wanted to try it as they present it and see what they had in mind. I was in a hurry - my bad. \n\nThe ordering system I do like - fast and efficient. You enter the order on a touch screen. I\"ll take the nourishment Hal. Be sure to step in to the dining area to watch for your number to flip up on the Amtrak (of old) style board. \n\nIt's three stars cuz it is sorta pricy, otherwise would be 4.", "author": "Matt J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-12", "description": "I was really excited to try this place after seeing that its two main dishes are stir fry noodles and create-your-own salads. However, the food itself was a bit disappointing. \n\nI've only been here once, and I'm willing to go back and try another dish/ location, but man was my food super lackluster. I ordered the red coconut curry and I hate to say it but nothing about these noodles tasted like coconut or red curry. The noodles themselves tasted rather bland and were too oily. I had to add a bunch of hoisen, sriratcha, and soy sauce to even taste any flavor. The tofu was very bland, even for tofu. The menu said seated spicy tofu, but it was not spicy at all. It's possible that this could be their blandest dish because it was their only vegetarian option (many places forget that veggie dishes can have flavor too), but if that's the case, I still would rate this place the same. The veggies in the stir fry were fine, and the rice noodles were cooked okay, just very little flavor. \n\nI like the touch screen kiosks to order (gave me time to look through the whole menu without rushing). And I thought that the flap down number board was a cool, shout-free way to find out when your order was ready. The juices and salads looked nice from afar, so I'll definitely go back to try something else. I really want to like this place, but it definitely fell short of my expectations especially after reading all positive reviews.", "author": "Lauren C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-24", "description": "A bit overpriced because every \"extra\" is expensive ... I really shouldn't be spending $13+ for lunch to keep full for the rest of the work day. It is also really confusing because the green curry with stir fried noodles have very little green curry taste to it. You would also think that because they use electronic kiosks to order food, that the service would be fast. The wait is too long if you don't have much time for your lunch break during work. This place is only eh!", "author": "Pinky C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-01", "description": "Salads are terrible and I regret it every time. Please look at chopt and just salad as examples. My salad portion was tiny and each ingredient measured about a tablespoon. Not going back.", "author": "shana l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-21", "description": "Yes yes and yes. I wish them much success. The city and world needs more places like this for food xo", "author": "Anastasia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-16", "description": "Its amazing...the food, service, and value...\nJust don't go there when it's lunchtime- because Honeygrow doesn't live up to their standards when they get busy and overwhelmed.  \nThe Staff is great.  Food is fresh and tasty.  The lines only get really crazy around lunchtime.  That's the ONLY complaint that I have with Honeygrow.", "author": "Angie T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-11", "description": "Ordered via Cavia and apparently this is what $35 worth of food gets you. One of the boxes was only half full... the other barely... avoid.", "author": "Matt W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-07", "description": "11/7: First time and will definitely be back! Found HG on yelp downloaded the app place my order and picked up with no issues plus a $5 credit.  Food was nice and hot when I got back to my job.  Portion size is just right.\n\nThank HG", "author": "Amette N."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "honeygrow", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "194 Joralemon St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/E0yiPDizg6M9k1mst3llzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13474220714"}