{"aggregateRating": {"reviewCount": 156, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-13", "description": "I give this place 3.5 stars because it has good and bad stuff about it. \nFirst the atmosphere is very chill, they have tablets you can order on which I LOVE because it has pictures of the foods and shows pictures of all the ingredients in it and gives you the choice to substitute anything for an ingredient you don't like. They order stir fry and salads. And there's a choice is getting noodles instead of lettuce in your salads which is really cool. \nI came here twice. The first time I decided to try the garlic stir fry which i found to be extremely oily, like the type where after every single bite you have to wipe your lips with a napkin cause you have a blob of oil on them.. that type of oil. \nThis place looks very healthy oriented so i was kind of disappointed in that but... \nI gave this place another chance \nSo the second time I came I got a salad and substituted a few things and ended up loving it. But with all my substitutions my salad ending up being a whole $18 which i feel like salads shouldn't cost that much. But even without crazy substitutions an average salad is about $13-$15 which is still a lot. \nThey charge $3 for chicken and $4 for tuna. I am a tuna lover but don't get tuna in your salad... trust me", "author": "Shabnam D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-12", "description": "I usually order the stir-fry with rice. Delicious, but leaves me hungry. It's mostly rice. My wife has ordered the noodle dishes and it's the same thing. The grain or pasta makes up the entire dish. This was really evident today when I took an order to go and turned it over onto a paper plate at work. You can see the rice surrounding the small portion of other food in the middle. What would this plate look like if the rice (the cheapest ingredient) was removed? There would be nothing left. This is the sesame garlic stir-fry with chicken and broccoli. Again, it is delicious, just not very much food. It would be great if they offered a slightly smaller size with a lower price and a slightly larger size with a higher price. I think most people prefer to take a bite of the main ingredients along with the grain or pasta. You're not able to do that the way the dishes are currently prepared because all you're left with is rice after a few bites. I just finished eating this for lunch and I'm already thinking about what else I have to eat. And I'm a smaller guy. A hungry reviewer is not good for business, Honeygrow.\n\nRe: Honeygrow's offer to \"assist me\". \nWhile I appreciate the offer, I believe that the quantity of food is carefully considered on a corporate level. I don't see that changing unless enough people realize the value is not really there, and they start losing business to other similar spots. Like \"Cava\" for instance, which offer great value and an appropriate quantity of food in my opinion.", "author": "Vince C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-23", "description": "Stopped here randomly with the family on a Sunday afternoon. We needed a quick bite to eat after a trying morning. Place was very quiet. We were surprised to discover the ordering is done via kiosks. This was actually fun. For a \"build your own\" salad / stir fry place like this, the ability to take my time thinking through all the customization options is actually perfect! I didn't feel pressured by the presence of a waiting human being at the other end of the interaction... nor was I concerned about the next person in line pestered by my indecisiveness. \n\nI am definitely a fan of technology (when used appropriately to meet needs, as it is here),  so the Honeygrow experience totally worked for me. \n\nAs for the food - I had the sesame stir fry noodles, which was very fresh, with mild, pleasant flavors. I liked the garnish options and was able to select cilantro. My husband enjoyed his salad, though wished for more dressing options. I liked that there was a kids menu, which was a smaller portion of the stir fry. The honey with fruits and yogurt was delicious! The ingredients are sourced locally and the taste reflects the quality of the selections.\n\nWe would definitely come back and try more selections. It is a very nice option for a healthy, fast, and interesting meal.", "author": "C Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-11", "description": "I've come here twice and both times I ordered the Red Coconut Curry stir fry... unfortunately it just doesn't have enough flavor for me. The second time I ordered the extra sauce and even then I felt as though a certain flavor was missing, perhaps salt? I like how many healthy options they have and all the gluten free choices .. if I come back I'll try a salad.", "author": "Shivani S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-30", "description": "This place is soooo good I love it the food is very flavorful\nI always get the stir fry you don't even need meat with it.", "author": "Love M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-11", "description": "The service here is incredible. Staff is welcoming and amazing. Kitchen is visible and very clean and organized. My meal was delicious. You MUST try they parfait. Fresh chop fruits. This would definitely be my new go to stop on the regular. Prices is affordable and worth it.", "author": "Kisha V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-30", "description": "Ordered what was supposed to be a vegetable stir fry with rice noodles. Got a box of noodles with 3 - 4 small pieces of broccoli and a teaspoon of chopped cilantro. (I'm not exaggerating) I guess if you actually want vegetable you have to double everything (which of course drives up the price). Won't be going back.", "author": "Elizabeth A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-24", "description": "Honey grow isn't your typical stir fry restaurant. It's definitely a restaurant built for generations Y and Z. You build your own stir fry bowl on one of their kiosk machines and then wait for your order to be called. Just like all of the other \"build your own\" food spots, you choose your base carb, protein, vegetables, and sauces. You can completely customize your stir fry. They also offer customizable salad options.\n\nI made my own chicken stir fry with egg noodles, nuts, and bell peppers. It tasted pretty good. Almost like it was made just for me ;)", "author": "Preston I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-15", "description": "This is the first time I tried Honeygrow and it won't be my last. Everyone working here was very nice and willing to help. I love the fact that you can see the whole kitchen as they prepare your meal. I had a HoneyBar yogurt parfait and it was delicious! This was the equivalent of kids going to get ice cream after their shots! Might visit my doctor more often just to pass by Honeygrow!!", "author": "Leslie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-08", "description": "Take out with class!\n\n1.Wide variety of noodle and salad dishes\n2.Build your own option (amazing!)\n3. Self order kiosks\n4. Dining area \n5. Polite staff\nYou can be in and out just as fast as it took to read this post with enough time to enjoy the awesomeness that is honey grow.", "author": "Kelly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "Came here not expecting much, but was absolutely blown away. The bowls taste so good!! The egg noodles pair perfectly with the lox and are seasoned to perfection. I tend to be very picky with how my noodles are cooked, and was pleasantly surprised here.  It's layered with toppings that provide a nice crunch and great texture. Looks as good as it tastes! \n\nOn top of the taste, the service here was great. The lines move fairly quickly and wait times were kept at a minimum. This is great place for quick lunches or on-the-go dinners. 10/10 would bookmark for future reference!", "author": "Karen R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-23", "description": "Food here is fresh.  Walk in, order on a computer (liked this better then talking to someone), got my food in five minutes. I got the crab with egg white noodles. This was really good and the quality is superb. They also have fresh yogurt with fruit. But this location is very crowded. A lot of conscious eaters. Also, the quality is high but so is the price. I paid 14 bucks for a small bowl of noodles with a few pieces of minced crab. \n\nI'd go back and try other options.", "author": "Ahmed M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-13", "description": "Noodle salad is delicious. You can customize greens, add ons, and sauce. I wish they add ons were a bit vigger portion but overall is a good salad.", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-06", "description": "I walked in around 3pm on a Sunday and it was practically empty. I walked around looking for some sort of how to order. I approached the human behind the counter and was directed to order from the computer screen behind me. Is this the world we live in?\n\nThe menu is on the wall but also on the fancy screen you're tapping. Choose your meal- noodles, salad, or grain bowl? All ingredients are listed on the pre-made selections. I got the Walnut St. Noodle Salad. It comes with arugula, cold buckwheat noodles, Parmesan crisps, raw broccoli, and raw mushrooms. I added chicken for $3.25. The entire thing was dressed with a lemon vinaigrette dressing. Was actually pretty tasty despite the few ingredients and it tasted fresh. \n\nWatch the humans behind the counter magically make your order. Grab a water cup and hydrate while you wait. \n\nIt seemed clean here. The food was fresh. The location is right downtown close to Perelandra (smart move on their part). Download the app on your phone to become even more addicted to technology and detach yourself from all human interaction, you'll save $5 on your first online order. Pick it up on the side counter (still, no human to say thanks to!)\n\nA cool millennial spot if you're feeling like you need a day full of salad and a full body cleanse of all your poor health decisions.", "author": "Dana M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-12", "description": "Disappointed of my order .... no carrots and peas, bad service and that was not full.\nthe food is good but I did not get my order", "author": "Milena R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "Technology much? Wow! Sometimes I feel torn for loving self ordering. On the one hand the way I like controlling wtf I want; especially being vegan. The machines don't give you that blank look when you ask if something is vegan or dairy free. Three managers in will usually get you the answer you want. And on the other hand (you forgot about the torn part right?) I hate that people are probably losing jobs. It's true. You can't convince me otherwise. The control freak in me always wins though. Cuz self ordering is the perfect combo of two things I love most: technology and food. \nIf you're still reading this ...you're probably wondering \"Is she gonna talk about the food?\" But I'm all about the experience. Many have tried this self ordering model, McDonalds (YUCK), Panera Bread (not so well) et al. \nThis feels different. I didn't feel pressured and they (see I call screens \"theanswered all of my vegan questions with consistent notations. \nAnd what about the food. My god! Delicious!! I want more! Would that be too greedy? I can get to-go and eat it...later. \nI'm gonna dream of this place and be mad at myself if I don't take something home.  I'm thinking. I'm thinking.", "author": "Kateria N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-19", "description": "Mediocre food that's insanely overpriced--that really sums up this restaurant. Service is awful, lot of rude people working here. Wasn't always like that but it seems there's a high turn over rate here because there's always new staff members--says a lot about how poorly managed this place is. Don't waste your money here, you will be disappointed and still hungry! There are sooo many better places to eat in the area!", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-30", "description": "$18 bucks for a salad and yet....How is it that I order a salad with oil and balsamic, only to come without oil? Gross. Honestly, this place is more concerned with getting out a massive amount of orders at once than caring to see that your salad is as you ordered.", "author": "Nick L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-04", "description": "I will never again be tricked by white people selling \"red coconut curry\".   \n\nAfter selecting and paying extra for more vegetables, my order was essentially a box of rice noodles with tofu and a few small pieces of broccoli.  I had also ordered bean sprouts, mushrooms, and spinach but that was completely missing from my order.  They either forgot the red curry sauce, or maybe the sauce is supposed to be just oil with no seasonings.  Half of the tofu was completely charred; I like a little bit of grill marks but this was unmistakably burnt.\n\nMaybe their salads are great, and maybe I just got a weird order, but the vibe was also pretty unpleasant.  It seems like this place serves middle-upper class people taking their lunch break, and the lunch hour was completely mobbed with people who were not aware of how much space they were taking up or that they were standing in the middle of walkways.  I'm not blaming this business for their self absorbed customers, but would appreciate a better system for folks to order and pick up food.", "author": "Kallie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-08", "description": "Not bad for a fast and healthy food option in the lively part of Brooklyn. We came here after a long  walk along the Brooklyn Bridge Pier and wanted to keep up the healthy lifestyle. With the number of calories written right next to the dishes on the menu, honeygrow delivered. \n\nWith machines to take your order, and fast delivery of service, this place is certainly the spot for millennials looking to get a quick bite after their yoga sesh. The machines are quick, easy, and honestly refreshing to use. I wonder why similar establishments don't make more use of them. \n\nI will say, though, if you are looking for an authentic Thai food experience, honeygrow isn't the place for you. The flavors are never going to be as robust as a real Thai restaurant, but they will certainly be healthier. \n\nHere, you either pick a dish with a salad base or noodle/rice base. We got the Make it Grain salad, substituting carrots with pears to make it more fun, and the Sweet Soy Five Spice, substituting the green beans with mushrooms. \n\nWith quinoa and arugula, regardless of the feta, grapes and pears, Make it Grain was a bit boring to me. It needed a tad more protein, so get it with chicken or some other meat of your choosing if you don't mind paying an extra couple bucks. \n\nSweet Soy Five Spice was served hot and heated my stomach. I enjoyed the flavors a lot more there, but I can't say it tasted Southeast Asian. The turkey went well with the mushrooms, so you may want to substitute the green beans or onions for them. \n\nI would totally come here to try the other dishes if honeygrow opens near my workplace. The portions were large enough and the price wasn't outrageous. Hope they don't change their prices and portions as they grow as a business.", "author": "Beril E."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "honeygrow", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "194 Joralemon St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/E0yiPDizg6M9k1mst3llzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13474220714"}