{"aggregateRating": {"reviewCount": 156, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-09", "description": "This is a solid lunch place. I have a gluten allergy, and they have many gf options. I didn't have an allergic reaction after eating here, so I definitely trust it! I got the red curry rice noodles with shrimp-- very good! And a decent price, too. I will definitely be back many times.", "author": "Lauren T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "A much needed eatery in this neighborhood. So happy to have some healthy options for a great price. I've tried the white bean tuna salad and a customized noodle plate, both delish. Can't wait to come back!", "author": "Karen S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-29", "description": "Return? Maybe. Its right around the corner so pretty convenient location wise. Food is pretty good but the wait is interminable. This is a novel concept in Brooklyn but a dime a dozen in Manhattan - and much, much faster!!! The only way to make this palatable is to order via the app and pickup 40 minutes later\nAtmosphere (2) - Gets very crowded because they are so backlogged on orders. 25 people just standing around in silence. There is a bunker in the back that has about 9 tables or so but no windows and ambiance of a cell block. This is strickly a take-out place\nService (2) - Not terribly friendly or helpful. I get it, they're working non-stop filling orders but it wouldn't hurt to call out an order # when its finished, They have an old school scoreboard in the backroom but an electronic one by the pickup area would be more helpful. Waited 40  minutes for my order to get filled\nFood (4) - Portions are small (don't expect leftovers), sweet soy 5 (3)\nDrinks - n/a\nCost = Total tab for 1 meal before tax/tip $9.50", "author": "Will S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "Customer service and food is great!! So worth the wait; order online to avoid the lines", "author": "Anonymous P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-22", "description": "Found a big ass rat in my stir fry. I am beyond upset because I am a regular here I bring my whole family at least twice a week but this is the final straw. Only thing I might come back for is the bottled drinks, very delicious!", "author": "Tyler B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Stop Looking. GO here now. Fresh amazing local food! Reasonably priced. Incredibly friendly staff, seriously. You just found a regular. Thank you!", "author": "william p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-15", "description": "This place is awesome! Their food is great, fresh, given in big portions, and if you ask for add ons like avocado they give you plenty and don't skimp out. Affordable food and quick wait time.", "author": "S M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-15", "description": "good value, fresh and tasty, many options for gluten-free or other starch/protein etc. fast too,friendly staff and comfortable seating.", "author": "Leslie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-17", "description": "I had never heard of honeygrow but was in the neighborhood and stopped by for a salad. I made my own and it was one of the best salads I've had. The kiosk makes it easy to order and know your options, it was quick to get food and the seating is clean and plentiful. Cool spot, hope they open some in Manhattan!", "author": "Amy P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-23", "description": "The concept of this place is great, and I have previously gotten salads here that were delicious and fresh.  Today I tried the stir fry and was super disappointed.  The veggies were all brownish, the five spice \"sweet\" soy sauce tasted overwhelmingly like black pepper (maybe vinegar, too?), and I ordered rice noodles but received overcooked wheat noodles.  I fished out some of the veggies and chicken because I didn't have time to go back and get them to correct the order, ate a few bites and threw it out.  Too bad- the pictures online look really delicious so maybe it was an off day, but it isn't a risk I'll take again.", "author": "Katherine H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-12", "description": "I can only judge from a salad perspective. The place is overrated, expensive, and lacks customer service. I ordered a salad that took the staff 10 minutes to make. No other customers were in the store at the time but there were plenty staff. After the long wait... someone just dropped my bag on the counter and walked away. No number was called and no apology for taking so long. Lastly, the salad was bland and cost 10 bucks.", "author": "Nizka L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-13", "description": "I'm surprised at the positive reviews about this place. I've actually been craving Sweet Green but decided to give this place a try since there aren't any Sweet Greens in Brooklyn Heights. I was severely underwhelmed by the experience. I do like being able to order from the touch screen kiosks. However, the rest of the experience was sub par. First, I was standing there with several others because they only seem to call some numbers and just throw down the orders of others without calling them. Mind you, the bags are pretty oily. My order was ready, I'm not sure for how long, but after I realized orders after me were being called, mine was there all along without anyone saying so. I walk to Cadman Plaza to sit and have my lunch and realize that the Tuna White Bean salad I had ordered was lacking White Beans! So I had to walk back mid-chew to have them add my white beans. No apology or anything. The quality of the salad was not up to snuff. There are so many salad places in this city, but they are rarely any good. Except for Sweet Green. I wish they'd open up in Brooklyn Heights....", "author": "Janice P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-13", "description": "Went here for the first time recently after having gone many times in Philly. Just like in Philly, I'm never super satisfied with the food but somehow I'm always excited to go back again for another custom stir fry. Just like my experiences in Philly, my Brooklyn stir fry seemed undercooked (not hot enough) even though the vegetables were overly-blackened. The red curry sauce was too little in quantity and lacking flavor. But of course I'll be back, probably multiple times per week because it's fresh, healthy, and customizable. Somehow I'm addicted to Honeygrow despite never really liking my meal.", "author": "R C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "awesome ingredients and combinations .Fantastic service as well . Just come here and you won't leave dissapointed.", "author": "Wais A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-16", "description": "Amazing. Awesome. Healthy. Tastes great. The workers could not be nicer, seriously. Its a breath of fresh air when the workers actually care about customer service. SHAYNA IS AMAZING she needs a promotion", "author": "Louis L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-04", "description": "Hope you don't like getting what you wanted on your salad. I've twice ordered take out custom salads and twice had them leave off crucial things. Things like chicken. And cheeses. At $12/ salad this is really uncool. AVOID till they prove they can fill an order correctly.", "author": "Rootin' T."}], "servesCuisine": "Salad", "priceRange": "$11-30", "name": "honeygrow", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "194 Joralemon St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/E0yiPDizg6M9k1mst3llzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13474220714"}