{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-25", "description": "Eh.  I'm sorry to say that this pizza legend didn't live up to my expectations.\nAfter living in NY for nearly a decade and enjoying some of this city's best pizza, I can't say that this joint belongs in the top 10 -- or even the top 20.\n\nShowing up ~30 minutes before opening time is key.  I was nearly the first one there.  No wait at all when the doors opened.\n\nBut sadly, the pie left plenty to be desired.  Although the dough is pretty tasty, the pie is cooked unevenly (yes, seemingly without love!), so parts are overly burnt, and others are white and doughy.  Boo!\n\nWe got half pepperoni, half plain.  In retrospect, would have gotten all plain or at least another topping.  The pepperoni was very poor quality.  Seriously, if you want good pepperoni, go to Angelo's in midtown.  Their pepperoni is the tastiest and leanest and spiciest I've had.  Grimaldi's pepperoni tasted like it came from a supermarket package.\n\nThe sauce was alright.  The cheese was abundant, but not particularly good. \n\nAll in all, a real disappointment.  But the saving grace was the Brooklyn Bridge when we had washed our hands of the pie!", "author": "Erica K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-15", "description": "Honestly, the pizza did not taste like anything. The customer service and ambiance were great.", "author": "Sonia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-20", "description": "Very good and worth the wait. But 30 mins is still a BIT long. Pizza was really good though. Toilets are horrible!!", "author": "Leila B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-17", "description": "5 starts for the food as its probably the best pizza in the nation.  Up there with Cheeseboard in Berkeley, CA.  The Arizona and Las Vegas branches taste the same so no need to wait in the 30 minute line at this original location.", "author": "John L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-15", "description": "I was only here for a weekend and wanted to try some good new York pizza. This didn't disappoint. The line seemed long but it moved fast enough. The crust has a really good flavor and the ingredients tasted very fresh. You won't be disappointed with this choice. Note that you don't come here for service. The servers did everything we asked but they were so busy running around that they didnt stop to ask how you were doing or refill your water unless you asked. We didn't mind.", "author": "Paula W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-12", "description": "You call this pizza... For the price... wouldnt you expect they would used fresh ingredients....", "author": "Anthony D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-20", "description": "The service at this place is lousy. There are so many pizza joints and I've definitely had better pizza. It is tasty but that is no excuse for treating the customers like garbage. I won't be back unless I am in the mood for abuse, which happens now and again.", "author": "naheed c."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-10", "description": "Soggy crust, should be done and crisp.Tasteless, I've had better frozen pie Way over hyped. We wanted a cannoli, but the waiter never asked about desert. No personality from the wait staff.", "author": "Judy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-21", "description": "Quite a long wait, but it was really worth it. Their pizza is one of the best I have tried. I really love the thin crust. The place is pretty small, so the space is tight. And the waiters are always so busy that it takes some time before they can take your order. But in other words despite the long wait, tight space and more waiting to order food...nonetheless the pizza is awesome!", "author": "Sandy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-21", "description": "I love this place! If you want quality pizza then this is the place to go. I recommend going some time during the day in the middle of the week to avoid the massive lines that form on the weekends.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-27", "description": "Completely over rated tourist spot.  Burnt pizza, shitty service.  SO much better throughout NY", "author": "jill g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-02", "description": "Wow, great pizza, super fast! I guess I was lucky as there was no line and we were not rushed to leave at all. Group of 4 had two large pizzas, beer, wine, cappuccino, \u0026 canoli and were there for over an hour. The pizza was delicious and came within 5 mins of ordering, wow!!! I will definitely go back!!!", "author": "Mark G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-02", "description": "I think Grimaldi's pizza is a bit overrated.  It has almost become a cliche tourist destination.  Even without the line, I have found many better pizza places in the city.  I recommend visiting once during the non-tourist seasons to see what the hype is about.  You get a good thin crust pizza but the cramped quarters and rude service are not worth the trek.  However, River Cafe and Brooklyn Ice Cream are definitely worth the trip.", "author": "Madhav T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-22", "description": "I love Grimaldi's one of the best tasting pizza places in NYC.  It's thin crust pizza with perfect sauce with lots of cheese and lots of choices.  Clean, lively restaurant, nearby to Jacques Torres and the Brooklyn Ice Cream Factory with great views of the bridge.  Be prepared to wait, and sometimes outside in the cold!  Worth it though!!!", "author": "Sandra G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-02", "description": "As we got off High St. off the subway (we opted not to walk on the brooklyn bridge for time and energy sake), it was my first taste of Brooklyn and from afar, I saw a long line facing the East River, it was the line of hungry people waiting for the grimaldi's pizza! Initially hesitant, we decided to be part of the excitement of trying NYC pizza amongst other tourists (as well as locals). The wait = 1 hour. The result = heavenly pizza like I\"ve never had before. Using a coal brick oven, the crust is crispy and the fresh mozarella cheese and basil along with our choice of sweet peppers, mushrooms and sausage was just simple yet simply delicious. It was worth the wait and a must-taste if you're visiting NYC and have the patience. Now, that I'm back home, I contemplate replicating it with trader joe's pizza dough and my conventional oven....yeah right!", "author": "Jenny L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-30", "description": "Tried Grimaldi's during the Slice of Brooklyn Pizza Tour.  We ordered a Margherita pizza and it came out in less than 10 minutes.  (Apparently the pizzas cook here less than 3 minutes and come out perfectly).  The pizza was delicious and flavorful.  One of the best pizzas I've had.  I'll definitely come by again if I'm around this area.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-28", "description": "believe the hype- worth the trip! i have been known to eat an entire pizza by myself.  in order to justify this, walk across the bklyn bridge and back- don't take the subway.  \n\nbe prepared for long waits- the times i have been there, even though i get there before they open, there is a line to get in (and there is not much to do in the area).\n\nthis is not somewhere to eat alone unless you can eat the entire pizza-- they do not serve by the slice.", "author": "Jason N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-26", "description": "Yes, the pizza is good, but at this point in the history of pizza in New York, the food can't be considered exceptional. While the pizza is priced well, the overall atmosphere has some distinct annoyances. #1 They could stand to figure out a beer/wine license. Pizza goes well with beer. #2 While they wait for their liquor license, they could stand at least stand to figure out a soda fountain. I don't like to be handed a plastic bottle of anything in a restaurant, even a very casual one. #3 The service -- maybe it's charming to some people, but I found it annoying. #4 The \"door policy.\" How about a reservation policy? Or at least being able to put your name in instead of waiting forever in a line. #5 Cash only -- as always, I find cash only an unnecessary inconvenience.  All that said, I'd go back (probably better for lunch), because the pizza is good and the location is great, right by the water, so it's a nice place to eat before walking around by the water.", "author": "David S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-19", "description": "I haven't had better, so five stars it is. We just got the cheese - small was big for two. It was delish! I'm not sure if it was the dough, the sauce, or the coal burning oven, but there is definitely something different about this place that makes you remember the taste and texture.", "author": "Annie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-31", "description": "great pizza.  Line out the door and a crazy wait.  A little out of the way, but a great walk across the Brooklyn Bridge.  Eat your pizza then have ice cream under the bridge.  Don't go hungry.  In fact, bring a snack for the wait, but the pizza was delish.  Plus, they give them to go on a cardboard circle in a flat bag with a little pizza-saver in the middle.  Neat!  Thanks for skipping the box.  The pizza is gone too fast to warrant wasting the cardboard.", "author": "Joanna G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}