{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-12", "description": "Not a big deal. It is just ok for a pizza, totally not worth the wait in the line. I have had much better pizza here in baltimore. This is just a tourist fad floating around. If you are going for some awesome food, forget it, if you are going just because you are around the corner, then go for it.", "author": "Srinivas B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-28", "description": "pizza pizza pizza. truth, crust/bread portion is a bit thick, but thick aint necessary a bad thang. i wouldn't have normally hit the place up, but we were in the area later in the evening so there was no line full of aggressive tourists", "author": "Connald C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-11", "description": "Still as good as ever.  Come during off hours and the service is super speedy.", "author": "John O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-26", "description": "it takes forever to get into this place. and they unfortunately DO NOT take reservations... however, when you do enter this blast from the past traditional family-run italian establishment... it will never be forgotten. Luckily, i used to live in this neighborhood... now i travel just to go here... it is nestled at the foot of the FAB brooklyn bridge... you can see the entire manhattan skyline, so... as you wait, the view isn't so bad.\nYou are in for the BEST pizza I have ever tasted... thin crust, crispy....  INCREDIBLE!! It will be crowded... and they do NOT do carry-out OR delivery... it is WORTH EVERY SECOND YOU WAIT!!!!", "author": "Jenna C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-27", "description": "I came, I ate, it was awesome. \n\nI managed to miss the line around the block. I'm not sure if it was a fluke or what, but we waltzed right in and grabbed a table and a pie and it was rad. \n\n\nGreat slices. Great place.", "author": "Lanny K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-01", "description": "Classic\n.\n.\nDelicious\n.\n.\nCramped Seating\n.\n.\nworth it to come again and again-- out doors is beautiful so take a walk and burn off some of those calories!!\n\nand the bathroom is almost always a long line (one bathroom for the place)\n\n3 people w 2 pies at 3 toppings a pie= $41\n\nentrance is too skinny for a wheelchair", "author": "Jean H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-27", "description": "I was in NYC for business.  Everyone I met said, \"you know where you can get the BEST pizza here?\"  and I would say, \"I know!  under the brooklyn bridge?\"  and they would say \"Absolutely, but you can only get pies.\"  That's the but??\n\nI forced my gal pal to wait in line with me.  We went at 3:30 on a Saturday afternoon.  We waited exactly 45 minutes before having our name called in to be seated.  Hey that's actually not that bad of a wait, given that most great places have a 15-20 minute wait, right?\n\nWe ordered the small pie with pepporoni.  Yes, this is good pizza.  It wasn't mind blowing, but it's good.  That's all you need to know.  Oh and to bring cash.", "author": "Giang L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-25", "description": "Had better NY pizza in Manhattan.  Cheese pizza was OK.  Not a lot of flavor to the sauce and the crust was a bit burnt.  Oh and cash only.  What the?", "author": "Karen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-07", "description": "This place doesn't need another review to show how great the pizza is. Best NY thin crust style I've had with the perfect sauce, just enough cheese and crunchy crust....coal oven baked.\n\nWe were lucky the wait was not too bad (15 mins) but it is so crowded it is very difficult to get in \u0026 out of your seat w/o touching the neighboring tables with your ***....eek.", "author": "Katie K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-15", "description": "Grimaldi's does make good pizza.  I will not try to talk them down in this regard.  But there are serious issues here.  The obvious one is the ridiculous wait in line outside for a seat.  In total, we wound up waiting almost 2 hours before we finally got our pie.  This was on a Thursday night. The other issue is the price.  Upper $20's for pizza is tough for me.  3-stars because of those reasons.  \n\nAll of my New York friends claim this to be an institution.  I think I get it.  But it wouldn't surprise me to find out that all of the New Yorkers send their tourist friends to Grimaldi's so they can enjoy equally good pizza somewhere else without crowds of tourists making long lines.  Ah, New York.\n\nAs a tourist, you can make quite a nice evening of things by walking across the Brooklyn Bridge, down to Empire-Fulton Ferry State Park for some good views and photos of the Bridge and Manhattan.  Go to Grimaldi's for dinner (be sure to leave plenty of time to account for the wait, of course) and stop by Jacques Torres Chocolatier for an after-dinner cup of coffee or hot chocolate or Brooklyn Ice Cream Factory for dessert.", "author": "Dennis C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-25", "description": "The wait is a pain in the ass but the pizza is very good. We had the Margherita. The crust was flavorful, the balance of sauce and cheese was correct.  I would eat here all the time if I lived nearby and the wait wasnt so bad.", "author": "Alan B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-24", "description": "Dont waste your time. New York is known for its good pizza. You won't find it here. We waited in line for 20 minutes for a mediocre pizza and contact with the nasty people working there. The thin cheese coating, I swear, looked like latex paint and tasteless, along with the meager sausage bits that they sprinkled on the pie. The service was rude, with not a smile on the faces of anyone working there, especially the older guy barking orders to customers. Their reputation doesn't match the experience. Kind of reminds you of the Seinfeld soup kitchen atmosphere, where we should be grateful that they are willing to take your money for food, except in this case, it is not incredible tasting pizza. They can't be bothered to take credit cards, or offer slices. The place is tiny, dirty and crowded, with 6 inches separating tables. I asked for the bill 3 times and waited 15 minutes while the servers socialize. It wasnt busy while we were there.", "author": "Rich R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-18", "description": "Pizza, as good as it gets. Great sauce, great crust, fresh mozzarella, fresh basil...how bad can that be? With all of the buzz and a line out the door, they have kept their prices reasonable and there's no fuss or pretension. You can watch the cooks churning out the fresh pizzas with the coal burning brick oven at work behind them. And they have tortoni! You must get this delicious, hard-to-find dessert -- it's amaretto flavored ice cream with a cherry on top. The cannoli was also delicious. 2 small pizzas, 2 toppings, 3 soft drinks, and 2 desserts (plenty for 3 people) was about $42 before tip.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-02", "description": "Great fantastic pizza, but one of the disadvantages of using a coal fired brick oven to cook a pie is that for every 4 perfect pizzas you get that one that didn't turn out quite perfect. A small gamble for sure considering the deliciousness of Grimaldi's perfectly charred pies. \nAll five of the times I came here I was always in a party of two so I usually never waited more then 10-15 minutes, I did pity the fools in front of the line who'd been waiting forever for a table for six to open up, so DO NOT COME IN BIG GROUPS!", "author": "Gee P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-24", "description": "By far, best pizza I've ever had-anywhere. And being from Chicago, I say that at great personal risk. \nI come here every time I venture to NYC, and over those trips, I've learned the ins and outs of dining at Grimaldis. \n\n1. Never, ever come on a saturday unless you want to wait an obscenely long time in a line that literally goes down the block. \n\n2. Instead, get there early or, better yet, get there during the week when everyone else is at work. \n\n3. They are almost always filled to capacity, so don't expect 5 star pampering and service. If you're looking to have your ass catered to, this is not the place. People come here for the food: not the service. \n\n4. Always order the large, even if its just you and a friend. You will want to take the extra home with you.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-05", "description": "Even though the lines can extend down the block, service is fast and food is FRESH! And once you're seated and enjoyed your pie, if you'd like to order another one hosts are only happy to accommodate. One of the few places that can actually say \"less is more\". Their pizzas pack so much flavor and their crust is amazing.", "author": "Sharifah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-15", "description": "So here is the thing, Pizza is awesome and one of my favorite food groups (right next to chocolate and fries). Unless someone really screws it up, any place that serves pie will automatically get 4 stars.\n\nWhat makes Grimaldi's special is the fact that they have fresh ingredients and stick to what makes a great pie. They start with a dough that is cooked so that it is crunchy on the outside and chewy on the inside. Then they put a little homemade marinara on there, made with their own blend of tomatoes and spices. It was sweet and gave the pizza great flavor without overwhelming the other ingredients. Then they pile on the toppings: mozzarella, basil, roasted red peppers and spicy Italian sausage or whatever you choose to order. The pie comes out hot  after being in the coal burning oven for a few minutes.  The pizza is cheesy with the right amount of everything. The only sad thing about this experience is that there were 2 pieces that went uneaten. \n\nMy tip is to get there before it opens as there will already be a line. I got there about 30 min early and was seated shortly after opening, sure beats the hour and a half wait that others experienced. Don't forget your cash: my meal with a small pizza, Snapple, beer, and cannoli cost around $25 plus tip. Don't put too much pressure on this place to be something its not or you will be disappointed. This joint is about good old fashioned NYC pizza with no bells and whistles. Unfasten your belt and get ready for a great meal.", "author": "Courtnay P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-14", "description": "It is a toss up between Grimaldi's and Juliano's a couple of shops down,personally my preference is Juliano's, especially with the entire story about Patsy Grimaldi taking a stand but both of them are pretty good. Grimaldi's seems to be the more iconic choice though hence the bigger lines outside it. Best is to get the pizza and go sit at the pier to have it.", "author": "Shehzad G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-29", "description": "Their pepperoni curls up \n\nand gathers a puddle of pork fat. \n\nA puddle of pork fat.\n\ndo you understand?", "author": "Gunes K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-18", "description": "Don't go there for the atmosphere, go for the pizza.  We stopped by at 8pm on a Tuesday and were seated immediately.  The restaurant felt a bit dusty and dingy, and the long seats along the walls are uncomfortable (you can feel the springs through the seat cushions).  I didn't have high hopes.  \r\n\r\nBut then the pizza arrived, and we decided right away that we were coming back.  This was one of the best pizzas I have ever eaten.  The dough was thin, with a nice crispness underneath from the brick oven.  The toppings were fresh and tasty - real Italian olives, mushrooms, fresh basil and thin slices of mozzarella.  Lesser pizzas are oily or have too much sugar and dried spices in the tomato sauce.  Grimaldi's did not - the sauce was light and not overwhelming, and all the flavors and textures melded together well.  It was just simple, and delicious.  \r\n\r\nWe were very happy with our visit.  Just don't go there on a romantic date.", "author": "Adrianne Y."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}