{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-02", "description": "The battle over the 'Best Pizza' seems trivial to me. A great pizza is great. And there are a few places that can make a great pizza. So I'll enjoy all of them. Seriously, how can you nitpick among two great pizza places?\n\nGrimaldi's I is good, Grimaldi's II is good, and when someone splits and opens Grimaldi's III, it'll be good too. I know those aren't the names of the joints, but it's the family name that just has it going on in the pizza business. \n\nI'm from the west coast. I thought of thin pizza as lacking ingredients and flavor. Well, I obviously hadn't had NY style pizza in New York. My whole pizza world has changed. And it all started as a tourist visiting Grimaldi's under the bridge. Now I can't get enough.\n\nI'll say that if I'm down at Grimaldi's I or Grimaldi's II for pizza, I'll pick the line that appears to be moving faster.\n\nActual names of the pizza places have not been given so that you can decide which is which for yourselves. Really, they're both great.", "author": "Kevin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-28", "description": "Great pizza. Horrible service. They just take the orders out whenever so someone who sits down WAY after you could end up getting their pizza before you. I know that sounds a little nitpicky but that sort of thing really ticks me off. The pizza itself is really good. If you have to stay in line for over an hour save your time and come back a different time or go to the one in Hoboken.", "author": "Madelyn S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-10", "description": "1. I call bullshit on the line outside the restaurant. Takeout orders and seated guests wait on the same line for several minutes, yet the place is not that chaotic once you get inside. In fact, after 20 minutes on the line I bypassed the process by walking in and sat at an EMPTY bar. I was served immediately. \n\n2. The pizza was good. But it's brick oven pizza so that's a given.\n\n3. Cash only establishments irk my NERVES. Even more annoying is the ATM that is located in the rear of the restaurant charges a $4.50 transaction fee!\n\n4. Oh yea, how could I forget the fact that I was served white wine in a low-ball Collins glass.... (call me snobby, but it was a $9 glass of wine)  \n\nMeh, I'm over it. Will not be back", "author": "Amanda M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-18", "description": "Wow, I've found the best New York pizza! Word of caution: arriving 20 minutes before the place opens will only get you 40 people away from the door. Yes, the line gets long before the place even opens. \n\nGiven the choice between deep dish pizza like the one found in Chicago or New York style pizza, I'd definitely choose the latter. It worked out well that I got to experience this awesome pizza joint. On my first trip to the Big Apple, our group made sure to include Grimaldi's on the list of destinations. We lined up as if we were at Disneyland, 20 minutes before opening hour. After getting to the front of the line and getting our table and getting situated, we hungrily ordered two large pizzas. When it was ready, the pizzas came thin, crispy, and right from the oven!! Each bite was soooo GOOD! Can't wait to come back again!!", "author": "Grace C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "We frequent the one in Douglaston.  EXCELLENT!!!  You cannot buy pizza by the slice; but you wouldn't want to.... you want as much as you can eat.  The ceasar salad is also great, as well as the desserts.", "author": "Sue P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-08", "description": "Crust is good. Pepperoni tasty. But the cheese is wrong.  Born in NJ, I still think the pizza is better there. I doubt I'll return.", "author": "Emme S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-15", "description": "This is a review of Grimaldi's back when they used to be at their old location which I found out is now Juliana's. The pizza here was great. The crust was thin and crisp but still had the right amount of fluffiness. The mozzarella here was great and fresh and went very well with the variety of high quality toppings you can put on your pizza. We had a mushroom and ricotta pizza as well as a sausage and onion pizza both of which were excellent. I'll write an update once I make it out to their location a few doors down.", "author": "Paolo C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-07", "description": "First, this isn't the REAL Grimaldi's. They just bought the name. Second, I don't care how long the line is, the proof is when I sit down and eat.\n\nFirst, the place was unkept, dirty dishes and glasses about. They had enough staff to keep up. I've waitered many years back so I know. No excuse for a dirty restaurant. \n\nThe menus had tape over the alcoholic beverages because they were \"in between\" getting their liquor license renewed. How cheap can you be? Reprint \u0026 laminate the menus. It'll cost a few hundred bucks - max - to have it done professionally. And they had bottles of wine on the premises which they were pouring - obviously for people they knew. That just pissed me off.\n\nThen they were out of like, 2 or 3 kinds of soda. Like, WTF?!! If you're a busy place, for heaven's sake, stock your products!!\n\nNow we come to the pizza. I'm a connoisseur and have eaten pizza in many places, east coast, west coast, up north, down south \u0026 midwest. I've had slices from all over the city.\n\nI ordered a meatlover's with green \u0026 red peppers. When the pizza came, the first thing I noticed was the burnt basil on top. Do you know what BURNT BASIL tastes like? BURNT PAPER. I don't even own a restaurant and I know that you put the basil on AFTER the pizza comes out of the oven. Basil is crisp, refreshing and slightly sweet. It is an excellent component to a delicious pizza.\n\nBut it was burnt. Smelled burnt. Tasted burnt. And it gets worse.\n\nThe sausage bits were tiny and rolled into balls - like the meatballs, not cut in strips - which it should be for purposes of taste \u0026 aesthetics. I couldn't tell which was which. The ham was diced up far too small to appreciate. It was like eating pizza with tiny granules of meat. Not pleasant. \n\nThe vegetables were also so thin and tiny, that I couldn't really enjoy those either.\n\nFolks, if you read other people's 4 or (God bless their generous hearts) 5 star ratings, then they've never eaten truly good pizza. I have. A handful of times. Most of which, were in places that don't pull in these kinds of crowds on their celebrity.\n\nOn top of it all, everything you add on is an additional $1 or $2, so by the time you're done, without and beer or wine, you've got a $30 pizza that tastes like crap.\n\nBetween the unsanitary conditions for such a famous restaurant, ridiculously absent details - the f'ed up menu and to top it off, a bad pizza - I recommend you pass.\n\nBest (2) pizzas I ever had: Woodcliff Lake, NJ and Lyndhurt, NJ. Can't remember the places because they were deliveries. Go figure.", "author": "Scott M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-10", "description": "One of the top 5 or so in NYC.\n\nTheir sauce is very fresh and the pizza perfectly cooked", "author": "Daniel G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-05", "description": "The pizza here: deserving of every one of the five stars.\n\nThe wait staff: Eek!  Methinks not.\n\nThere are enough reviews on here to cover the quality of Grimaldi's pizza, so it seems appropriate to focus here on the fact that the waiters are pretty bad.  Pretty unbelievable, considering how amazing their pizza is, but maybe it shrould be expected, a better-than-thou attitude that comes from knowing you're the best.  We're going to get your money.  Sit down and we can do what ever we want to because you simply want to eat amazing pizza.   Still, memories of amazing pizza aside, the servers were pretty lousy.  Like would-get-fired-from-a-Dubuque -Pizza-Hut bad, so three stars.", "author": "Ryan W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-03", "description": "\"Walk across the Brooklyn Bridge and then have some pizza in Brooklyn\" seemed to be the agenda for most tourists on that day...and you'd probably be tempted to do the same like I was. \n\nWARNING: Do not go here if you are already hungry! We waited 20 minutes for a table, then another 20-25 minutes for the food to arrive. \n\nOrdered a small pizza with pepperoni, Italian sausage, and mushrooms. The pizza ingredients were each good on their own, but together something was just missing - maybe not enough fresh basil or spices? I don't know, I just didn't feel the Grimaldi's magic. \n\nService was horrendous. Our waiter practically disappeared after bringing our order, so we had to ask two different people for water refills and the check. \n\nI wouldn't come back unless there was no line.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-03", "description": "Had to go here just because I NEEDED the reassurance that this place had the best pizza in all of the city. Verdict? Nah- doesn't even cut close to it. This restaurant is beautiful though. High ceilings, windows, 2-floor seating and a bar- it doesn't get as cool as it does to dine here. However, the wait was too long, along with the time it took us to receive our pizza. The pizza was just OK. What kind of disappointed me the most was the fact that it was barely warm. Yeah yeah, your restaurant is by the water so it's automatically much more chilly in the area but not the pizza alright? Leave the pizza out of this... Overall, a place to go if you're willing to wait and experience what's supposed to be 'the best', just don't expect much from the food itself.", "author": "Tiffany M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-17", "description": "A windy trek across the Brooklyn Bridge was rewarded with two delicious, pipping hot, New York style pizza pies. This was after a half hour wait, before the restaurant actually opened. The moral of this story is, get here early! The dining room is not known for its spaciousness and you will most likely find yourself snuggling next to a burly stranger. Nevertheless, the famous coal brick oven pizza is worth the wait. \n\nMisjudging the size, we ordered two smalls for two people. Another case of me getting greedy and my hungry stomach doing the decision-making. A 14\" large, which has 8 slices, is more than large enough for two people. The pies are priced $14 for a small and $16 for a large with additional toppings costing $2 each. We went  for a regular mushroom and a regular Italian sausage. \n\nThe pizza itself was what a New York pizza should be, in every way. The dough was perfectly chewy, as was the crust; the fresh basil was fragrant and flavorful; the tomato sauce tasted special; and best of all, the mozzarella was cut into slices (not shredded), and had the creamiest flavor. I loved the classic coal oven finish because you simply don't see these ovens being used to cook pizzas anymore. I have searched for the perfect New York style pizza long and far, but I think I have finally found it at Grimaldi's. Simply ambrosial.", "author": "Bailey Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-22", "description": "Line? What line?\n\nI came here with a friend of mine on a brisk, early autumn, day. That point where the temperatures haven't quite dropped yet. Ok, that's a lie, we were just in the area and I had always wanted to try this place. I've waited in my fair share of lines, and the prospect of standing on one for PIZZA was daunting.\n\nBut that one day, we were about the 3rd group back, and were seated within 10-15 minutes of standing in line. We opted for a Pepperoni and Sausage pie and some Brooklyn sodas.\n\nWhile I am typically not a fan of what I call \"fancy pizza,\" this place was fantastic.\nIt came out piping hot from the COAL oven, and the wait-staff was quite attentive but not overbearing. It felt very much like a close family run operation and it showed in their food. They made everything in plain view, and the ingredients are fresh(how could they not be with that turnover rate?).\n\nIf you're a real pizza lover, then the rules posted in the front of the restaurant shouldn't be deterrent at all. NO SLICES and CASH ONLY, but totally worth the trek and wait.\n\nDo yourself a favor and traipse over the Brooklyn Bridge on a partly-cloudy day, enjoy the Manhattan skyline from DUMBO Park, and then hop in line for a delicious pie from a classic New York joint.", "author": "Henry C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-13", "description": "Experience was from 2012:\n\nSummary: Not sure it's worth the wait! Pizza is okay.\n\nDetails:\nPizza is decent; not great! It is cheaper than the previous place we ate at; $14 for small here with $2 for additional toppings. BF reports that the cheese is put on first; so heat didn't retain as well and made the overall pizza cool down faster. I have to agree with previous reviews that the crust isn't as crunchy and the flavor isn't as full. \n\nOur service was good at the beginning while ordering but not great when trying to get anything else in the middle or the change for our payment. I noticed that the table next to ours had to wait for quite awhile to place their order and didn't get any service during the meal. \n\n We waited in line for 30 mins-ish the line was to the old Grimaldi's location.", "author": "MaryAnn L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-24", "description": "Pizza was fine, but made the mistake of ordering a calzone. Awful. Inside was a whole tub of cold ricotta and not much else. The place is sad and disheveled matching the attitude of the staff. Should have stuck out the wait at Julianas.", "author": "Jay F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-10", "description": "Damn good pizza. This place is usually packed out, so its a wait to get a table (a long line outside) and you may be seated closely next to people you've never met if you're not in a party of 4- however, that worked to our benefit, as our \"neighbors' swapped some of their slices with ours so we got to try different pizzas. \nHighly recommend.", "author": "Vicky E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-22", "description": "I really didn't care for the pizza here at all...especially after having joe's pizza and Juliana's pizzas first.  Not to mention the host guy is weird, rude and has no rhyme or reason for how he seats people.  There is a line outside and you would think he would go in order but instead took 4 other parties of two ahead of us despite us being at the front of the line...just weird.", "author": "Gena L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-08", "description": "The pizza is not bad, but I would NOT wait on that ridiculous tourist line just for pizza.  I went there on a late Tuesday night and there was no line.  I tried a few different pizza's and thought it was good, but it wasn't that great...especially not if I had to wait on line, which I didn't (sorry for my run on sentence).  \n\nHowever, the host outside was super cool and friendly. He greeted every guest with such warmth and gave my friend's baby a little gift.", "author": "Annie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-24", "description": "So worth the wait. There was a line of about 20 people when we got there around 1. They only have pizza and toppings nothing else. The pizza was very good. I would come back. And it's cash only!", "author": "Amanda W."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}