{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-07", "description": "I do not often find bad pizza in this city so it is hard for me to be impressed by any of the alleged best pizza places.  However, this probably was the best pizza I've had so far.  I thought the service wasn't bad considering that it's a pizza joint.  Once the server took our order our pie came out quickly.  We did 1/2 plain and 1/2 pepperoni.  Both were great.  \n\n*This review doesn't take into account standing in line because my 3 friends and I were seated immediately.  (6:15pm on a cold December Monday)  It strikes me as strange to stand in line for over an hour for pizza in a city with good pizza everywhere.", "author": "Laura B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-12", "description": "not friendly, very bad service I would never go back to this location again, only people that were not friendly during my vaction, never go here if u are in Brooklyn go to the other location. but good pizza", "author": "Jacob R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-21", "description": "Seriously...the best pizza i've ever eaten.  Granted I haven't been to difarras which i've heard is amazing but i'm been to totonnos, lombardis and a bunch of other spots and this was hands down the bomb.\n\nYes we had to wait outside for like 30 minutes but it was def worth it\n\nPros-\nAmazing Pizza\nGood service\nMuch Cheaper then manhattan prices for pies(did the whole walk the brooklyn bridge thing with the gf, great date on a nice day)\n\ncons:\nonly feeling stupid when a tourbus drove by outside and stopped to take pictures of us", "author": "Eric Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-22", "description": "AMAZING. Grimaldi's gets a 5 star from this SF native.  After walking the brooklyn bridge on a Friday afternoon we finally reach Grimaldi's around 2pm.  \n\nHoly crow the line was about half a block long.  After going inside to use the bathroom, I thought it was going to be a 2 hour wait for sure. However 45 min later i was seated.\n\nOrdered half sausage w/ mushroom \u0026 fresh garlic and the other half pepperoni \u0026 anchovies.  My husband and I ate a large pie.  That's 4 slices each.\n\nWhat I lovea bout Grimaldi's is their cheese.  The pizza is super cheesy because they use slices of fresh mozarella instead of shredded cheese.  Also instead of putting the sauce first, they dribble the tomato sauce last on top of the toppings.  Then they top all their pizzas with fresh basil.  Yes, I got all this while waiting in line for the bathroom.\n\nThe menu is really simple with only a few key toppings (pepperoni, sausage, mushrooms, garlic, anchovies etc.).  Service was decent.  I would definitely come back, on a weekday, and at a random time to avoid the line.", "author": "Terry D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-22", "description": "I used to go to the old Grimaldi's when I lived in Brooklyn Heights.  The sausage pie was the highlight of the menu, but sometimes it came out burnt and other times soggy and undercooked... \n\nI thought that when they moved they might make a change for the better... but apparently they didn't... the line is just as long, thes service is still kurt and you still get rushed out when you are done eating... as for the pizza, it isn't any better than it was in the old space.  I got the margerita this time around and it was pretty bland and the crust wasn't firm enough... Next time I am in the mood for Grimaldi's pizza I am going to go  next door to Juliana's and get it from Patsy Grimaldi himself...", "author": "Nirro L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-21", "description": "Sweet mystery of life at last I've found you!\nThis is the best pizza served anywhere.  \nI recommend being a purist about it.  Lg pepperoni, carafe of house wine(only 16$!), and cannoli for desert.  \nYou can't go wrong.  This place made us fall in love with brooklyn period.\nMUST TRY if you're in new york.", "author": "TJ Lee W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-24", "description": "Look, there's a reason Grimaldi's is a NYC institution. As aggravating as an hour+ wait for pizza is, I refuse to let it affect the rating. It's an experience EVERYONE should try at least once. It really has been the best pizza i've ever had in NYC.\n\nGrimadli's is set up picnic style with cozy tables that can be mixed and matched to support any size group. Walls are lined with photos (signed) of famous celebrities who have stopped in here for food; the selection ranges from Micky Mantle, Frank Sinatra, and Sammy Davis to Miss USA and Michelle Obama.\n\nPizza here is otherworldy good. Everything is made fresh on site, and you can watch the chefs prepare in real time. Pizzas are fired in coal ovens, which aren't even legal elsewhere but are grandfathered in at grimaldis.\n\nAfter the meal the owner came by and kibitzed with our group, sharing jokes and history. He apologized for the wait (a great gesture, even if it isn't his fault) and was genuinely warm and welcoming after what had to have been a busy day in the heart of tourist season.\n\nGreat experience.", "author": "Josh F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-19", "description": "We had to wait outside for about 15 or 20 minutes before being snubbed several times by the old dude who seats people.  The wait was not a big deal, but once seated, the service was pathetic.  Our waiter ignored us for a while before taking our orders and forgot our antipasto (which was not that good once we finally did get it). The pizza was delicious though and the prices are reasonable.\n\nIt isn't Grimaldi's fault, but this place is very touristy which makes it kind of lame.  Maybe that is why the waiters are grumpy, but the whole experience was nothing too special.", "author": "L T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-24", "description": "Food was pretty good, but I feel like I had to add all the shakers on the table to make it taste better (Garlic powder, salt, pepper and red pepper flakes).  The service was terrible though.  Rude and inattentive staff made me feel very unwelcomed. This will probably be my first and last experience at this place.  I'm still a fan of NY...just not a fan of Grimaldi's...", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-03", "description": "After hearing about all the hype that is Grimaldi's I was well prepared to wait an hour for the best pizza I've ever had. \nBut now I have to write a review because I am absolutely shocked that this place has gotten so many consistently positive ratings. \n\nNever before have I had to salt pizza. There was absolutely NO flavor, none, it was disgusting. The pizza only stays fresh for the first slice, afterwards the cheese starts to harden and has the texture of a stale gummy bear and the crust becomes a soggy mess that leaves brown pools of sludge all over your plate. Does that sound appetizing to you? \n\nDEFINITELY NOT WORTH THE WAIT. .", "author": "Rachel F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-31", "description": "Grimaldis isnt even in the same galaxy as Lombardis. luckily we didnt have to wait in line to eat here. if there were a line then i'd turn back around and eat at lombardis. their \"customer service\" is horrible and just left a bad taste in my mouth. The cheese was super runny and the sauce tasted weird. \n\nVerdict? LOMBARDIs all the way!", "author": "Eve W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-01", "description": "Yes, that is correct. I waited in line to eat the best pizza New York has to offer. Waited total 40-50min in the freezing Winter weather and had the regular pizza. They don't sell it by slices and only accept cash. So remember to hit the atm before you go! I didn't think the regular pizza was worth it but the next time I go I want to try the white pizza. It looks mad good and also, I heard the deep dish square pizza is the best!!!! Too bad we didn't know when we went but there's always next time! ;D", "author": "Grace B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-01", "description": "3.5 Stars\n\nGrimaldi's is the quintessential NY pizza. \n\nI've only made it here twice. After the second time, the wait was just so discouraging to warrant a third visit. If you don't mind it, then you should go. The problem with this place is that too many damn tourist know about it! That is the reason for dropping a half star. The pie itself deserves 4 stars. \n\nSurprise-surprise!!.....it's cash only. Like most places in Brooklyn! \n\nI've you decide to go, let me know when your halfway through the wait so I can follow and jump in the line!", "author": "Los X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-12", "description": "If you are visiting NY you must venture to Brooklyn and eat this thin crust pizza. It's the best I've had in the area and it's in a great part of Brooklyn with amazing views of the city. \nCash only is the only drawback.", "author": "Lindsey M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-14", "description": "Great pizza, great location (you can walk the Brooklyn Bridge from Manhattan and end up right near here). \n\nNot sure I would wait the 60+ minutes again. Maybe. \n\nIt really is in a great spot because you can walk down the street afterwards and get some yummy ice cream (Brooklyn Ice Cream Factory) , and enjoy it at the waterside park with a great view of the NY skyline.\n\nI'm not really sure why everyone is so obsessed with NY pizza (?) My quest continues...\n\nPS If 3.5 stars was an option, I would've chosen that...", "author": "Kelly F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-21", "description": "Fine. There's no doubt that Juliana's has better pizza, but the vibe here is much more interesting given the extremely weird diner-in-a-diner layout, the larger and louder clientele, and the spooky top-floor bathroom area.", "author": "Prentiss M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-26", "description": "Once you have had this place, your top scale rating for pizza moves up a notch and therein after you shall always compare other pizza as: \"is it Grimaldi's good?\" \n\nFresh ingredients, Thin crust, tasty sauce and of course the cheese.... All that you need in a perfect pizza.  If your out of town and want a NY Style Pizza this is the place to go, just be prepared for the wait and bring cash.", "author": "Akram T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-18", "description": "I've visited twice. The first time we were able to walk right in. The pizza was perfect in every way. Crispy, the right thickness, the perfect combo and amount of ingredients. The sauce was created to perfection, almost magic in nature. The second time we visited we waited in line for 2 hours. Was it worth it? Yes. The food was as good as the first time around. Had the 2 hour wait been our first time here, I think we would have given up in search of other nearby pizza. But, knowing is half the battle. Well worth the wait. If you have a choice of visitation time; choose to visit mid-afternoon on weekday. Avoid weekends at all costs.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-06", "description": "Someone put an end to this over-rated piece of shit dining facility that serves like a cafeteria for public school children with money to throw around. \n\nAt $18-$22 a pie of thin slices I can understand that its fresh pizza. But the ridiculous line of tourists and commercialization is just killing it. It's over-rated and unnecessary. Don't encourage the behavior. go have a glass of wine and break some bread at the nice bar/lounge at 9 Front Street, and enjoy the ambience of downtown brooklyn. \n\nScrew Grimaldi's! And their soggy after 20 minute thin slice pizzas.", "author": "Paigee C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-04", "description": "I've been here a few times! In fact, on \"pizza fridays\" at my office, we'd ordered enough pizza pies for about 50-60 people from this place, I don't know if it was because it was such a large order by 12:30 on friday but a lot of the pizzas would come slightly burnt. So I've been there 3 times on my own. I was never wowed by Grimaldi's. I would never stand outside on that freezing cold or desperately hot line depending on the season for some of this stuff. I will admit, it has a unique taste and is different, but that doesn't always mean 5 stars.", "author": "Tristan B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}