{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-30", "description": "Guys, do not waste your time standing in line for this. Pizza is ordinary. Service is atrocious. People are rude. And it is EXORBIDANTLY pricey. Do not validate bad food and worse behavior. Spend your hard earned money on something to be proud of.", "author": "Pizza M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-30", "description": "Great place.  I had family visiting from out of town and took them here for some good NYC pizza.  It was delicious and my family couldn't have been happier.  The line is worth it and afterwards, walk towards the water and see a great view of the city.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-07", "description": "Keeping it short to avoid repetition of the obvious...\n\nYes, the pizza is fantastic.  I studied abroad in Italy and consider myself somewhat of a pizza snob.  I was pleasantly surprised by the pizza and would love to have some again.  Five stars for the pizza!\n\nThe service was horrible though.  I knew there would be a line before I went, so my review has nothing to do with the fact that I waited 40 minuted to place an order for takeout.  The \"bouncer\" at the door was incredibly rude to the patrons in line.  He picked parties out of the middle of the line even when parties of the same number were closer to the front.  He ignored the people in line when they questioned him about it.  And he had the nerve to let three people who hadn't waited in line at all place take-out orders when there were at least two other parties ahead of me who had specifically told him they were placing take-out orders.  \n\nWhen I was finally allowed in, the man taking my order treated me like a brick wall.  Absolutely no eye contact.  He whispered responses despite the fact that the restaurant was crowded and noisy!\n\nIf I ever go back to Grimaldi's it will only be because I'm desperate for great pizza at a random time when the line is a bit shorter.", "author": "Danielle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-05", "description": "pizza is good.. but not worth the line..  nice view though", "author": "O K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-30", "description": "grimaldi's has a new location in a historic looking building at the corner.  given it's \"fame\", this new location does it more justice.", "author": "Foodie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-28", "description": "I went here while I was on vacation with my wife and parents.  We had to wait in line for about half an hour.  It was worth the wait.  The pizza was fantastic and is still made in a brick oven.  Plus, right outside is a beautiful view of the Manhattan skyline.", "author": "Luis G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-23", "description": "Look, if you go for lunch, chances are there won't be a line. I was just there last week again, and they were filming for some movie. I was surprised that they were filming while the writers were on strike, but that's not the point. The pizza is worth the trip to NY in itself! I usually walk across the bridge just to work up a decent appetite to eat here. Lines will be seen, an hour or so wait for dinner during the summer months. ATM on premises, but just bring cash beforehand and you'll be fine. If you are a tourist and don't have a car, take a cab there if you don't want to walk the bridge both ways, because there's no way in hell you're going to find one on the street to bring you back. The trains are pretty far, and the ferry only runs at certain times, car service is available upon request. REMEMBER CASH ONLY!", "author": "Pat T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-24", "description": "The best pizza in N.Y. It's a family style, non pretentious, classic pizza and Italian restaurant. I love the red and white picnic table clothes. They bring out the whole pie to the table rt from the oven. My absolute fav is their margherita pie. It's a must if you're going there. This place is a true classic.", "author": "Zinat M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-27", "description": "I've said it a million times, I don't get it... people wait in line 1 hour to get in this place and then another 30 minutes for the pizza to come and I don't know why. The pizza is OK, I've had as good, I've had better too. The prices are good but not enough to wait an hour for. For 1 hour I expect it to be free! The atmosphere inside the restaurant is crowded and dirty, Drop ceilings and lenolium (sp?) floors that look dirty. Oh and guess what, I hope you went to the bathroom before getting in line cause there's a wait for that inside too!", "author": "Derek N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-20", "description": "There is always, always a line here and guess what?  \"No Slices!\"  But the pizza at Grimaldis is wonderfully delicious.  I love it so.  I like to go visit my boyfriend who works in DUMBO so that we can hit up this joint.  A really great time is to pick up a pie and hit up the movies in the park during the summer.  Watching a flick in Brooklyn Bridge park with Brooklyn's finest pizza is the way to go for sure.", "author": "Sara L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-08", "description": "I went here back to back weekends, the first one it was beautiful weather and it was the most amazing pizza I've ever had.  The second weekend, it was a torrential downpour and it was the soggiest pizza I ever had.  Advice: go on a good day.", "author": "Ethan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-02", "description": "I dream of eating Grimaldi's all the time. Best pizza I have ever had hands down.", "author": "Deepak J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-22", "description": "so. let me add to the 200+ reviews that are bestowed upon Grimaldi's. My cousin brought me here on my first trip to NY. It's so good. Aside from the almost hour long wait to get seated, the food was fantastic. We got a traditional margherite pizza. It was a thin crust pizza and was probably the best pizza I've ever had. It's New York Baby!", "author": "Tiffany W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-08", "description": "I'm usually not a fan of thin crust pizzas, but Grimaldi's is the exception to that rule.  Had to wait for about 10 minutes but it was worth it.  The pizza wasn't very greasy so I didn't feel like going into a coma afterward which is a very good thing.  All the ingredients were very fresh and tasty.  I'd highly recommend this place if you've got a hankering for pizza, but want to be a bit healthier.", "author": "Devin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-11", "description": "I had to go here b/c everyone says it's the best pizza. After waiting a long time in the rain, my friends and I were rewarded with delicious thin crust pizzas (my favorite kind)! I really enjoyed the food, despite the cramped quarters. Perfect amount of toppings, not so much that they slide off the piece when you pick it up, and not so little that you only taste the crust. Doesn't beat Cheeseboard Pizza in Berkeley, but of course it's a different style of pie! :)", "author": "Joy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-10", "description": "There's nothing I could say that hasn't already been covered by the 137 other previous reviews to date, but I thought I would do my part and give Grimaldi's it's well-deserved five stars, just slightly bumping the overall average from four and a half, to four and a half and a bit more.", "author": "Kurt S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-06", "description": "One of the best places to get a pizza in Brooklyn, and perhaps in all of NY. I found this place in my search for an authentic NY pizza pie.  You can definitely taste the quality in the toppings they use at Grimaldi's, especially in the fresh mozzarella they used.  The crust was thin, crisp, and delicious.  The decor inside was not fancy, but what would you expect from a pizza joint?  It did have that authentic NY feel though.  So authentic, I kept wondering to myself that someone named \"Fat Tony\" would walk in with 2 goons by his side and try to force me into giving him my pizza.  Boy, would that have been a fight!  After it's all over, I can say to myself that my last meal on earth was definitely worth it.", "author": "Rob C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-02", "description": "It's a long line...but, it's straight to the point (order, eat, enjoy).  No frills.", "author": "Jac T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-20", "description": "Came here on a Saturday night...I figured there'd be a long wait...I didn't however expect the enormous line out the door even for take out.\n\nFortunately I was just in the neighborhood and wanted to try it out so after a half hour of waiting, the guy with the clipboard told me to just go into the back and order take out. \n\n10 minutes later I had my pizza. I walked across the street and ate the whole thing on the steps of some law offices. (It was a small and I love pizza, give me a break).\n\nThe pizza is very similar to Lombardis...in that its Amazing. Coal charred thin crust with that balance of crisp and dougy soft, Fresh tomato taste, delicious fresh snappy mozarella, mouthfuls of chopped basil, crispy small pepperoni and nice big slices of mushroom. I think the crust might have been very slightly thicker than lombardis but I could be mistaken.\n\nObviously with the number of good reviews for this place it goes without saying but...Excellent Pizza. Go by yourself and see if you can pick up a pie ahead of the line...they might hassle you a little if you go straight into the door, but you might get lucky and talk them into letting you order. Then take it out and enjoy with friends. Or go on an off day/time and eat in. I don't really recommend going on a weekend night unless you really wanna wait up to two hours.", "author": "T F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-13", "description": "this place deserves more than 5 stars and every bit of hype that it gets here and in all tourguide books all over the world.  the wait is atrocious, but the host graciously and good-humoredly takes it all in stride and very efficiently seats people.  \n\ni came here with my mom at 4 in the afternoon to find a slight line and a 10 minute wait.  with that behind us, we set to ordering a sausage and mushroom pizza.  FOLLY.  \n\nthe pizza was awesome, but we didn't realize it tastes perfect just as it is--with fresh mozzarella, basil leaves, sauce that seems to have been extracted from vine ripened tomatoes and a thin crust that has a bit of chew and is SALTY.  it comes piping hot and is fairly cheap considering it's reputation.  \n\nwould totally come here again.  if you can't bear the lines, take it to go and walk down the street to the pier and look at the pretty scenery, which is what lots of people do, judging from the piles of pizza bags in the trash down the road.", "author": "kathleen c."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}