{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-07", "description": "I've never once written a restaurant review and signed up with Yelp just to do so now.  I'm so angry that I need to do something.\n\nI've had the most disappointing dining experience of my life this weekend.  Grimaldi's was one of my favorite restaurants in Arizona, and I figured that now that I've moved out east, I could still visit their flagship location in Brooklyn once in awhile for some delicious pizza. \n\nWe went the Brooklyn Bridge location this past Saturday, and after waiting in line for 45 minutes (at 4:30 in the afternoon mind you), we finally got seated and experienced some of the worst service we've ever had in our life.  My wife's plate had some crusted cheese on it, so I stopped one of the servers to ask for a clean plate, and he literally snatched it from my hands without even saying a word, walked to the next empty table and swapped it with a clean plate from that table, brought the new one over, and literally threw it on our table.  I asked for a manager and explained this situation to him, and he just blew me off.  Unbelievable!\n\nAfter all this, our actual waiter never even once visited our table after initially taking our order...not to check on drink refills, not to ask if I wanted another beer, not even to bring our check.  After we finished eating, we literally waited 30 more minutes before finally asking the manager (who happened to be walking by the table to take the next table's order) if we could get the check.  \n\nI could even look past most of this...chaulk it up to them having a bad day, or just extremely busy, or *something*...but the pizza itself was even crap.  Crust way too thick, not cooked long enough, not enough sauce.  I cannot see myself ever going back again, which is truly unfortunate given how much I loved this place in Phoenix.", "author": "Bryan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-25", "description": "Waiting in line at Grimaldi's reminded me a bit like the soup nazi experience in Seinfeld, mixed in with some of the Godfather. The older gentleman at the door was strictly business. You get the feeling with him, that it was an honor and privilege to be eating his pizza. If you don't pick up your pizza when they call out your to-go order outside? Fuhgeddaboudit. No pizza for you!\n\nOf course, I jest. You get your pizza, he'll just give you a hard time about it, saying the pizza will get cold. Just listen to the man. That first slice I had was absolute pizza bliss. After a half hour of walking across the bridge, then another 45 minutes of waiting outside perspiring profusely in the heat, it was well worth it all.\n\nI'm a huge fan of NY-style pizza. I could probably eat it every day. I like my crust thin and crispy and my toppings minimal, even the cheese melted a certain way. That coal-fired brick oven at the back of the kitchen looked like it had been there for hundreds of years. Yet, it looked alive and well, churning out pizzas left and right. I just couldn't understand how people could eat this pizza with a knife and fork. It's all about the fold-and-tuck when eating NY pizza.\n\nThe menu is simple. Small or large, then choose your toppings for extra. No medium or personal-sized or slices. We ordered 2 smalls and it was enough for 3 hungry people. The crust had that perfectly burnt, smokey flavor, slightly chewy on the inside and crispy on the outside. The wilted basil on top gives the pie a nice hint of flavor.\n\nYou can taste the fresh mozzarella, melted and gooey, with a slight dairy flavor. Just make sure to eat it fast, as that cheese hardens quickly and becomes a bit chewy and rubbery to digest. The pepperoni were quarter-sized and thicker than the typical big flat ones. My favorite would be the white pizza, sauceless and with garlic. Yes, service is virtually non-existent, but if there's no line, I'll return the next time I'm in the city.", "author": "Dru C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-14", "description": "Absolutely overrated! This is all hype.  #1-The hours posted on the website are wrong; said 11:30 opening but really opened at 12.  #2- Line is insane and we waited 1.5 hours.  #3- The guy who works the line is rude.  #4- They are part of a pizza tour and those patrons skip the line and add an additional 45 minutes to your wait.  #5- it's just not that good. I've had FAR better, exceptional pizza at Lombardi's in Little Italy.  \n\nAll and all, don't waist your time while in NYC!!!!!", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-19", "description": "\"Does NY Really have the BEST pizza?\" pt 1\n\nIf Grimaldi's is a pizza ambassador for NYC, then it does a noteworthy job. I love pizza and have thus tried a TON of pizza.\n\nComing to NYC, I had to manage my already high expectations. Thankfully I prepared for mediocre service and that's exactly what I got.\n\nFirst in line on a Monday morning...\n\n...I braved the NY winter and got there an hour before the shop opened so you can imagine the built up hunger and anticipation... (if you end up arriving too early, try heading over to Brooklyn Park and gaze at the Manhattan skyline. GREAT place to do so.)\n\n...and it was worth waiting almost 1.5 hours...compared to every other place I've ever been...the pizza is good because\n\n...the taste of the bread/crust is pleasantly distinct and crisp...everywhere else the crust and dough are pretty forgettable\n\n...the sauce, toppings and cheese are tasty but not overpowering. the ingredients taste fresh.\n\n...the pizza is remarkably, not oily. You eat anywhere else that's not Grimaldi's (or Lombardi's) the surface of the pizza can saturate layers of paper towels with grease.\n\nIt's a fine establishment, Get there early, experience great pizza and if your stomach has room, the Brooklyn Ice Cream Factory five minutes away is a recommended finishing touch to your NY dining experience.", "author": "Brian W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-01", "description": "It was my first time this past may, when i came here to eat dinner. the line was mindblowingly long, but the wait was very reasonable given the number of people they serve.  there was an ice cream truck outside, which presumably gains all its business from people waiting in line for grimaldi's.  after about 45 minutes we were seated in the relatively cozy joint.  \n\nit's just something about their crust that makes their pizza so incredibly wonderful.  the sausage is hand picked apart and thrown onto the pizza from their large clump of sausage filling, to make a wonderful semi-hard crunchy layer on the outside and oh-so-flavorful juicy goodness on the inside after it comes out the oven.  the crust itself is not very thick at all. if i had time to go back to brooklyn to wait in line for this, i'd gladly do it again. cheers for one of the best pizzas i've ever tasted!", "author": "Albert L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-31", "description": "This pizza was ranked really high according to a show I saw on the Travel Channel.  So when I traveled to Brooklyn, I figured I would give it a try.  Sorry to say the pizza and calzones are pretty terrible and lack some serious flavor.  My calzone was stuffed with plain ricotta and tasted bland.  The pizzas (I ordered one regular and one white) lacked any type of sauce and the cheese was anything but cheesy.  Not to mention I ordered it to go and it was in the thinnest paper bag you can find in restaurant depot.  For the price and flavor, any hole in the wall in Brooklyn or Manhattan can do better.  Your tastebuds will thank you for it.", "author": "Johnson R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-07", "description": "the line is eternal but it is worth every second. Best pizza I have had in NY as of now.", "author": "Jeff Y Laura K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-13", "description": "I've eaten here twice and it's seriously worth waiting in line. The crust is magical. The pizza isn't too overpriced either.\n\nI've been on the lookout for the best pizza in NY. I've eaten a lot of pizza and this was up there.", "author": "Desiree L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-12", "description": "The first time we at here, I thought the pizza was just okay.  Then when we were back in Oregon, I tried to come up w/a pizza I liked better....  No dice.\n\nThen we came back this September and had it again, and I can definitely say that this is my favorite pizza of all pizzas.  I started craving it around June.  The crust is a great consistency:  thin, crispy and tasty.  The sauce was simple and tasted fresh.  The mozzarella is sliced, not shredded, so it melts in this weird awesome way to make the texture unique.\n\nWe had a party of ten this last time and had to have 5 pizzas and no leftovers (We had some big eaters).  If you're wanting alcohol, I recommend against the beer.  It's never very cold.  They have a pretty big wine selection, though, and even the house red is pretty good at $4.", "author": "Sam W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-07", "description": "I came here with my roomies on a quest to find the best pizza in NYC/Brooklyn.  We were shocked to see there was a crazy line at least 30 people long.  Of course we took this as  a great sign of what we would be eating.  WRONG!  Not only did we wait for 30 minutes outside sweating, we waited another 15minutes once we had our table before we were even acknowledged.  The three of us let this slide thinking okay maybe this is like a Seinfeld 'soup nazi' situation.  You aren't there for the service or ambiance only the amazing amazing soup, in this case of course pizza.  The pie we ordered was actually the worst I've had in NYC.  It was dry, with no flavor.  We also ordered some sodas which we never received but were charged for.  This is 3 hours of my life I will never get back.  Maybe they're paying people to wait in line.", "author": "Maria S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-17", "description": "The manager treats clients like ANIMALS. He made us wait in the rain outside and kept screaming at us to get in line and move. We ended up leaving. I have never been treated like this in a restauant. This place is not worth going to.", "author": "Zaki L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-13", "description": "Well, there seems to be an anti-tourist slant here, so I'll address this to the tourists.  If you are in Manhattan on a nice day, take the subway to the Brooklyn Bridge, stroll across it, hit Grimaldi's for a pizza, then walk down to the end of Fulton St. (grab a cone of very good ice cream at the Brooklyn Ice Cream Factory if you have room left in the tummy), stroll the short distance to the edge of the East River and enjoy a one of a kind view.  Will you have had the worlds best pizza?  Who knows, but you'll have had an experience well worth the effort, I promise.\n\nOh, almost forgot.  Time your trip for off peak dinner/lunch hours and you can avoid the dreaded wait for a table.  And don't let anyone make you feel bad about being a tourist.  This may shock some people, but as soon as a New Yorker leaves the 5 boroughs they're tourists too.", "author": "Pete W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-01", "description": "We visited Grimaldi 's back in June on a Wednesday night. We arrived  around 6:00 pm after walking across the Brooklyn Bridge. This was our first trip to NYC and were super excited to try \"Real NYC\" pizza!  We were expecting a long line after reading all the reviews, but to our surprise our party of 3 was able to be seated right away. It was a very small dining room and the tables were very close. Our waiter came right over and took our order which was a large Margherita Pizza.  Our pizza arrived very quickly and was definitely the best pizza we had ever eaten! The best part about Grimaldi's was the price. It was by far our cheapest meal in NYC, and one of the best.  We will definitely be back on our next trip to the city. Oh, and when we left there was probably about 20 people in line...so definitely go early.", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-22", "description": "This is one of the most well known pizza places in all of New York. The crust is thin and crispy, yet still chewy. I went with a classic margherita pizza, the mozzarella fresh, the basil flavorful and just enough sauce to give the pizza the best consistency. Make sure you wait on line because there is never NOT going to be a line and eat this pizza immediately while it's still hot and fresh out of the oven! It's not so good when it gets soggy. \n\nThis is a classic NYC pizza joint, if you're looking for NY pizza...this is it.\n\nAll you Chicagoans with your deep-crust pizza....go suck it.", "author": "Emma C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-26", "description": "Really fast, fresh pizza. I go to the church pizze near 23rd street.", "author": "Joshua J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-25", "description": "BEST THIN CRUST PIZZA I EVER TRIED.\n\nI ate here about 2 years ago and still have not had another thin crust pizza that measured up to my expierence at Grimaldi's. \n\nIt was a lovely day when we went to eat here. We walked across the Brooklyn Bridge from Manhattan and worked up a crazy appetite (there was also a cool spot for taking pictures a little past Grimaldi's with Manhattan and the bridge being a beautiful backdrop in close proximity to Grimaldi's). It didn't help much that we had to wait almost 2 hours to be seated. The place is super tiny! You're basically touching arms and elbows with everyone. This place having the last (or one of the last, I forget) brick oven(s) that exist was pretty cool. I spent about 10 minutes just watching everyone make the pizzas. It was like an assembly line of 10 people with different and specific jobs - kneading the dough, throwing the toppings onto the pizza, throwing it into the brick oven, rotating the pizzas in the brick oven, take them back out, etc. \n\nI forget which pizza we created by choosing our own toppings but it was amazing. Since I was super hungry, I had a hard time trying to take my time enjoying the different flavors. I was just in awe with how something so basic could taste so delectably \"fantabulous!\" \n\nFor anyone traveling to NYC, you MUST, MUST, MUST, make a pit stop at Grimaldi's.", "author": "Tarie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-02", "description": "I had to wait in a 2 hour line and the doorman was extremely rude. The pizza itself was mediocre way too much salt and the crust was burnt completely. Will not be coming back.", "author": "Aaron V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-22", "description": "Dammit!!! Why are you so good!!??!! \n\nAbsolutely dig this pizza and without any inclination to justify my unequivocal bias towards this hot spot I will say this: go with someone who can carry a conversation. Yeah, most likely you will be waiting a short while (30-45-1hr) so going with someone who is a mute or an introvert will find you talking to yourself most of the time or to the other patrons who all usually speak some sort of foreign language with minimal understanding of the english language. I've done this twice. With two different people. Long story!! \n\nAnyways, the pizza was absolutely delicious and baked with fresh ingredients. This is as good as it gets people!! My favorite is the Tomatoe \u0026 Basil Pizza with extra cheese.", "author": "Notis T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-04", "description": "Eh, go to Lombardi's instead.  I don't know if it because we added too many toppings on our pizza, but the dough came out soggy and limp.  Also watching them prepare the pizza by the restroom I could already tell there will be inconsistencies from pie to pie. Plus it tasted better coming out of the fridge later that night.\n\nIt's right next to the Brooklyn Bridge, which is a nice walk back into Manhattan.", "author": "Danny E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-23", "description": "If the pizza is burnt, the burnt taste and smell comes out of your nose, and you can taste it burnt charcoal to the back of your tongue. Now if you remember anything that is you paid 20 odd bucks for the bunt piece of charcoal. \n\nA few days ago I read the Times 20 things to do in which they wrote a great review of the Pitsaria but I don't know what I missed out, perhaps I missed out mentioning I work for a big newspaper corp. Anyhow I went in at the bar area and the bartender gave me the menu with a dry attitude. Fine no one has to smile at me, it makes me feel weird anyways. So I sat there inconspicuously while I could see the line outside the window and I smiled in omniscient. I placed my order and waited for around 35 min for the pizza only to know that they gave my pizza to people next to me who ate a piece of it. I went to the same guy that took my order, who looked too busy and he promised another pizza. And so I waited for another ten minutes and I looked outside the window at the que in envy.  No more waiting. I went to the front desk and politely but firmly asked the pizza to be packed. Here they had my pizza ready only to see it was smoked to charcoal. It was burnt on the sides and the bottom. Is this how its meant to be I asked the owner and he gave me some reply like \"its not an electric oven so\"...OK right now I have rats running around in my stomach. Fine I'll take the pizza but I will not leave any tips... \nThe pizza was burnt and it tasted like charcoal and I want my money back......\n\nDon't go there, its a horrible place. The old Grimaldis is shut down and this is a new one. Definitely not worth the money.", "author": "Food A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}