{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-20", "description": "This grimaldi is overrated.  It was so not worth the 1 and half hours wait.  Compared to the manhattan one, this grimaldi is cheap about their toppings and they do not taste as good.  It was super dry with too little cheese.  I saw more crust than I did of cheese.  It was the worse experience ever.  I was hungry and I expected more than just horrible pizza.  \n\nI can't wait to try Juliana that is opening next to them.  The Grimaldi family is back in the pizza business!", "author": "Panda C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-23", "description": "I'm not sure if it was the standing outside for thirty minutes when you were told you would be seated in ten to fifteen or waiting 45 minutes for the pizza to get to the table after ordering. Maybe if we had known it would have taken that long we would have had a snack before going. Aside from patiently waiting or experience was also combined with poor service, granted it was busy but I saw our server once when we ordered and then when we had to find him to get our check. When the pizza came it was nice and hot. I personally found their sauce to be bland and in need of some spices but after that wait it was nice to get something in my stomach. The redeeming quality of this place is that the cannoli was off the chart, so if you're there for some mediocre pizza make sure you end on that sweet high note of a cannoli.", "author": "Kenneth C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-24", "description": "Best pizza I've had in a long time. Get extra tomato sauce.", "author": "Laura W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-11", "description": "This is not Grimaldi's, I repeat this is not the real Grimaldi's.  I hid from the superbowl during the Madonna performance in this place with the bubbles of burnt crust, sweetish sauce, meager cheese, and burnt basil.  I'm glad people are lining up outside the door of this place that bought the Grimaldi's name, this impostor, so I can cheerfully join the smaller line to Juliana's, which is owned by Patsy Grimaldi.  At first going to this \"Grimaldi's\" confirmed the fact that maybe I don't like any Neapolitan pizza.  Then, just by chance, and due to my ex-boyfriend's more democratic and less paranoid taste, I got to enjoy the superior pizza from Juliana's original woodfired oven, generously distributed sweet fennel sausage, mushrooms, perfect fresh sauce, I'm a believer in Neapolitan pizza again.", "author": "Dian L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-15", "description": "I'm not from new york, so I can't tell you what REAL new york pizza pie tastes like or where to get it.  Up until I visited Grimaldi's, I was beginning to believe that it was a myth.  The pizza hear is just great.  No frills, just great ingredients, awesome crust, well priced, and well worth the wait.\n\nAnother great food place added to my list of my \"must visits\" for NYC, anytime I'm there.", "author": "david l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-10", "description": "Some of the finest pizza I've ever had.  IF YOU GO, AND IT'S YOUR FIRST TIME, DO NOT GET A TOPPING!  I think it might be illegal.  But for real, you won't need a topping - it's that good.", "author": "John L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-06", "description": "It's all been said before. \n\nYou will stand in line for an hour.\n\nIt's worth it. The pizza is bomb!!!! Thin crust, melty cheese, and fresh basil! Perfection. I will be standing in line again the next time I'm in NYC and I honestly can't wait.", "author": "Ashley K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-03", "description": "forget about this place;\n1) With a coffee i finally paid 33 Dollar for a fucking pizza what is far too much for what i got.\n2) I took 4 additional ingredients. Thats why the price was so high - for every ingredient they take more money. Totally fine! BUT then half of the pizza was empty. Only dough. My chosen \"chicken\" turned out as maybe 40,50 gramms?! \n3) Interior is like a canteen and reminded me about school time. Maybe some people like it? I don't. \n4) No tuna available. In general, such a few things to choose for the pizza. And they solely sell pizza.\n5) Unfriendly waiter. It's mass tourism. \n6) Doorman is a fu*kin bast*rd!!!\n\nFinally no tip. The queue at the entrace must be the popular name. Cannot explain. Do people really go there more than once? So many better places for this money! \nMaybe my German expectations are just too high ;) i definitely ate better pizzas in my life ;))\nFuc* Grinaldi's!!!!", "author": "Fredmeister A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-26", "description": "Very cute and cozy place. Well worth the wait. Whoever was the guy managing the place was so much fun! Reminded me of my uncle. Very homey feel to it. Pizza was great. My husband and I finished an entire pizza! It was so good I wanted to have another one but my stomach wouldn't have been able to handle it. They sang happy birthday to my husband with an Italian version of the happy birthday song playing in the background. He was embarrassed getting put on the spot but I was thankful for the yummy complimentary canoli!", "author": "Anna G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-18", "description": "Want undercooked, wet pizza?  Look no further.  Sure to impress your out of town guests.", "author": "Yttrx S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-20", "description": "Ok ok so I hear this is [one of] the most famous pizzerias of NYC. I had lived in NJ for the past three years and I recently came up to visit my friends. I don't know how else to describe my experience at Grimaldi's other than bizarre. \n\n\"Mr. Grimaldi\" [or, the man who acted like him] was very austere. Our first interaction with him was when he called a group of four [us!] inside and we skipped a bunch of people on the line [that was great!] but later... he walks to our table, pushes my friend and I aside and pushes the table closer to our other friends sitting on the booth side. Then he proceeds to push myself and my friend [sitting on chairs] closer to the table so that there is more space [the restaurant is crampped, as expected]. However, I would have gladly moved myself, as far as I know, I'm not 5 any more. Did I mention, he didn't say one word in this entire process? And neither did we as we were stunned. \n\nLater he comes over again and makes a nasty face when I say I'm from Miami. Not cool. Then we give him our check and we needed change. He proceeds to give us whatever change he thinks is appropriate. You do the math. Our check came out to $26.25. We gave $47.00 and he gave us back $5.60.... \n\ndid you do the math yet?\n\n\nOk, so obviously we would have been tipping $15.00 on a $26.00 check. I don't know if it was an honest mistake but... that was rude.\n\nMy friend's and I were blown away by the entire experience. Our server was very rude too. Didn't ask how we were doing. Not a smile, not a laugh. Not a \"hello, how are you today?\" Ugh. The thing that irks me the most is bad service. \n\nI don't care how famous a place is, I'm not going back to be treated unkindly. \n\nYes, the pizza was pretty good but didn't blow me away. I think there are TONS of other places in NYC and NJ that make great pizza. I'll take my business elsewhere next time.\n\n\nNOTE: For a different take on this experience, see Anne L.'s review. Same night, same people, same pizza. Different opinions.", "author": "Patty G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "I have been here a couple of times when they were located where Juliana is. It is very touristy especially during the summers. The wait can get quite long. This pizza is not that good for a 2 hour wait that's for sure. Come back when there is less people. The pie's overall is solid. Its cartoon pizza that you eat with a knife and fork. But it is pretty good and the ingredients are fresh. I would recommend a venture out during non peak hours.", "author": "Sam M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-18", "description": "I first tried Grimaldi's midweek at 3 pm on a warm summer day. I expected two things...a short off hours line and to find out that the pizza was over-hyped. Neither was true!  There was a 45 minute wait and the pizza was incredible!\n\nSince I was alone, I beat the line by getting a pizza to go, then walking it over to a nearby park where I ate more than half the pizza!  The rest made it to about 9 pm that night :-)\n\nIf you like good pizza, this is the place to go!", "author": "Neil B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-08", "description": "I don't care if I have to wait an hour in the blazing heat or damp rain, Grimaldi's is worth it.  Best pizza I've eaten, hands down.  You can literally taste the love they put into each pizza.  Fresh, melted mozzarella, crispy, meaty pepperonis, thin slices of mushrooms and fresh tomato sauce and basil to top it off.  A large, thin crust is easy to polish off with a friend...and I get full pretty easily, so that's saying a lot!  I also love the fact that Joey Grimaldi and his son still work in the restaurant (he even brought us our bill when he saw we had finished our meal).  That type of personalized, attentive service is what makes this the famous establishment that it is.  Remember to bring cash, though!\n\nOne final thing, do not order the olives on your pizza unless you want super salty olives that overpower any other flavor on the pizza.  My friend and I ordered it once and it was so pickly that we had to remove them all before we could continue eating.", "author": "Anjali M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-15", "description": "I love this place.  Great, consistent pizza.  Much better in the newish larger space.  But still a line outside at peek times, the only reason that they get 4 stars.", "author": "Alexander F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-16", "description": "I would give it 4 stars, but I just thought it wasn't worth the wait. I had a friend in town and thought this would be the perfect place to grab lunch after a walk over the brooklyn bridge. We had the large pizza with pepperoni, onions and mushroom. Don't get me wrong, it was good but would I wait an hour again to eat here. Umm no..", "author": "Jo K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-25", "description": "Obviously we went by the reviews that said this was the best NY pizza - everyone told us it was. We weren't impressed. I did like the pepperoni, it had a nice flavor, but it really wasn't anything special. Just pizza. Sorry! Save yourself a wait and call in your order for pick up. Eat in the park instead of waiting in line for an hour. They only take cash and the staff were a bit bossy. We walked across the Brooklyn Bridge to try the pizza so maybe we were expecting something a little tastier for the effort!", "author": "Jessie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-02", "description": "This was my second trip to NYC, and I couldn't believe I just forgot to go on a quest for the most amazing New York pizza during my last trip. We got here for lunch on a Sunday, and there were only a couple of parties in line in front of us, thank god (we were starving and it was freezing outside). \n\nWhen you're inside, you can see their brick oven being used and the guys making the pizzas. Fresh pizza at its best! The cheese they use made the pizza taste really fresh and not too heavy. I believe that this place only sells pizzas by the whole pie - you cannot order individual slices... but who would really want to, anyway? If the line is that long and the pizza is that good, you better just go for the entire pizza! :)", "author": "Anna V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-24", "description": "Do you like pizza? Yes? Then you'll like Grimaldi's.\n\nI'm not sure if it is \"Best.Pizza.Ever.\"status but there is no denying how good it is. When I went we had the original and the pepperoni, both were amazing. Between three of us we ate a Large regular and a Small peperoni...no leftovers.\n\nBe prepared to wait in line to get in. There is a little market down Front St 3 blocks where they have takeout beer and brownbags. This is definitely helpful.", "author": "D N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-21", "description": "Maybe they were having an off night, but the staff was indifferent and the pizza was mediocre. It's a nice place to eat if you're already in Brooklyn and want to spend some time in the park by the water, but probably not worth the trip if you're from out of town.", "author": "Alex K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}