{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-19", "description": "Awesome flavors. Had the three tacos so could try a bigger variety. My granddaughter had seen them on a food truck race and thought their food looked good. If you are visiting NYC highly recommend you check them out. Only a couple of blocks from the 8th St. Subway stop.", "author": "Nancy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "I loved this place! It was highly recommended by friends. They still have the brick oven here so the pizza is amazing. We ordered the antipasto which was mozzarella cheese with tomatoes and olives and also ordered a jalapeño and pepperoni pizza. The crust was thin and the jalapeños were fresh! They added basil on top and the cheese was delicious.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "Absolutely outstanding pizza. Killer crust, tasty mozzarella (with the perfect amount of 'bite'), and just the right amount of sauce.\n\nI always order the basic mozzarella and basil, but each slice is so perfect that I never have the desire to add anything more.", "author": "Daniel B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-01", "description": "Grimaldis is a Brooklyn icon. If you like coal fire thin crust pizza this a place you have to try. We walked over the Brooklyn bridge from NY City to go for dinner. Not a good place for parking so I recommend public transportation or a walk on a nice day. We ordered 3 pies regular, white and extra sauce. All three were great. You can't make reservations. You get there and put your name on a waiting list. Depending on the day and time the wait can be long. The larger the number of people the longer the wait can be. I would suggest 2-4 for a shorter wait. It was raining when we went and Grimaldis had umbrellas on the sidewalk that gave us shelter and kept us dry while we waited. Considering the customer is always key for a restaurant. The service was good and the food was great. The atmosphere was good but it was a tad warm in there. Overall a place to experience. Just yelping out. Follow me at @justyelpingout", "author": "Kirk I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "Despite the long long long wait this place was perfect. Ideal location for an after dinner stroll  the food was amazing.  Not too kid friendly but my kids are very use use to going out to eat and waiting on line. Lo e this place", "author": "Therese S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-18", "description": "Im just upset that these guys sold their name and then started making terrible pizza that doesn't even give a hint of their original style.  This is a tourist trap.  Do not fall for it.  Go down the block to Juliana's (the original and best Grimaldis) .  \n\nQuote from Juliana's : \"Juliana's is affectionately named in honor of Patsy's mother, Maria 'Juliana' Lancieri Grimaldi.  Juliana was born in Melfi, Italy, the youngest child of Domenico and Amalia Lancieri.  She had three older brothers: Luigi, Franco and Pasquale.   In the early 1900s, the family emigrated to the U.S. and settled in New York City.  In 1925, Pasquale (by then known as 'Patsy') and his wife, Carmella, opened a pastry shop on First Avenue in Manhattan. In 1933, they converted the bakery to a pizzeria and restaurant, which is known today as the famous Patsy's Pizzeria, still in its original East Harlem location.\"", "author": "Neville G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-26", "description": "Grimaldi's Pizza is a fantastic pie with fresh motz and pepperoni.  I crave this pizza every time i'm in NYC.  This pizza place usually has a line outside depending on when you get there (I waited 30 minutes to get a table) but it was worth it.  \n\nBEWARE **DOES NOT ACCEPT CREDIT CARDS**\nATM is in the building but there is a service fee", "author": "Christopher J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-09", "description": "As I recognized a long line, I learned that it was Grimaldi's. My friend and I had no intention to visit this place, but we eventually did because we were hungry, and the line was gone by 3:30 PM on Sunday Afternoon. \n\nA guy with a hat welcomed us into the restaurant immediately as we stood by the door and lead us to sit on a upper floor. \n\nA pizza tray holder on a table gave us little excitement. \n\nAs we glanced a menu, we were surprise to find out prices weren't a tourist price, and also noticed that atmosphere in the restaurant resembled with a little authentic Italian Cafe at North Beach in San Francisco. \n\nAlthough our order was taken smoothly, we had to wait about 15 to 20 minutes to get  a pizza with Jalapeno, Chicken \u0026 Basile. My friend got irritated, but I remained clam. \n\nFinally, our pizza was placed on the Pizza Tray! Fresh Basil (really), Fresh Mozzarella that don't make different from a Farmer's Market at Ferry Building in San Francisco and Lucca Deli on Valencia Street in San Francisco. We enjoyed our Pizza so much, and a small Pizza became our supper. Whatever other reviewer said, we loved our Pizza, and we fell in love with this place. \n\nThey also serve authentic Cannoli. I would have ordered it if I hadn't eaten three scoop of ice cream from Brooklyn Ice Cream Factory. \n\nAt this moment, we learned that our server didn't care about our table, so we had hard time to get more drinks and a check while other table still had very courteous server. \n\nMissing One star is due to the server who left us ;otherwise, I give five star. \n\nThank you Grimaldi's. We all have good Pizza and a wonderful time at Brooklyn.\n\nFor New Yorkers, this place might be mediocre for your folks, but your mediocre might be our best.", "author": "Vicki S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-16", "description": "The pizza is average. It's good, but nothing special. 20 bucks for a small and two toppings. Classic wood fire pizza. The service isn't very good either. Only 1 water refill even though I asked for more. I would choose another pizza spot if you head to Brooklyn.", "author": "Hannah B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Amazing pizza and family like service. Just be prepared to wait in line outside for a table but know it is well worth it. Also they only take cash and seek full pies but is a must try. They are also located right by the bridge making it a perfect location to eat some pizza and walk around after to enjoy the views and neighborhood.", "author": "Brittany G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-21", "description": "I REALLY REALLY REALLY enjoyed coming here!! Yes, there is a humongous line but worth the wait!!\nOrdered the White Pizza (Large) with Sausage and Pepperoni. So hungry and eagerly waiting for our pizza we were eyeing everyone elses pies!! Ours came out like 10 mins after ordering and we INHALED it!!! Crisp crust, fresh ingredients, amazing!! The fresh mozzarella was delish and creamy. The pepperoni were thick and oh so tasty. Sausage had a good spice. You can definitely taste the difference in the pizza by how they bake it in a coal oven. The taste is more smoky and that distinguishes this place from the rest of the NYC pizza joints I have tried (Rays, Lombardis, Angelos). \n\nI am seriously craving for more!! And this stuff is way better than ANYTHING you get in Cali!! (The sad sad truth!!)\n\nPizza will never taste the same again......", "author": "Angela D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-27", "description": "Came here a few times and all of it was good tasting pizza.  The last time I came here was w/ the GF, she's from out of town so she wanted  to taste authentic NYC pizza.  Bingo!  This place was it.  Good thing this time the line was not long at all.  She liked it so brownie points for me.", "author": "Jimmy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "Wow....\n\nMy wife and I were here about a year ago as we were wandering in Brooklyn.  We decided to stop in and ordered a pie.  The pizza is real thin, so normally a pie would be crazy for two people, but in this case it was just right.\n\nWe had one half pepperoni and one half plain.\n\nO  M  G...\n\nthe sauce and cheese are out of this world.  The dough was a bit crispy, but not too crispy.\n\nI'm really surprised I haven't gone back.  It's probably because the traffic in Brooklyn is insane, and if you do make it there, good luck finding parking.\n\nYou need to go here at least once in your lifetime...", "author": "A H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "I always have a great time at Grimaldi's. The pizza is brick coal oven made and it is simply the best way to make pizza.\n\nI went to Grimaldi's before they move a stores up, still a great family experience.\n\nGo early, like few minutes after open or else you will suffer the extremely long line of death.", "author": "Danny Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-10", "description": "Grimaldi's doesn't live up to the hype. I've simply had better pizza all over Brooklyn, and in other states as well. If this restaurant is supposed to be the pinnacle of New York pizza, prepare to be underwhelmed.\n\nThe building itself looks quite nice, on the corner , 1 Front St, but it would be better suited for a bar or small club, honestly. The service was casual and nonchalant, borderline inattentive.\n\nThe food is decent - we ordered the small cheese pizza, which should have been really flavorful since it's basically just cheese, sauce, and dough, maybe basil if you want to get fancy. Instead, the pizza was just basic. Literally, nothing special. \n\nDon't stand in line for this place. If you are in the area (for whatever godforsaken reason) and can't find anything else - Grimaldi's will do.", "author": "Morgen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-10", "description": "The BF really wanted to try this place, and since we were planning on walking on the Brooklyn Bridge, we stopped by for dinner. The line was crazy long but the wait wasn't actually too bad, but that's probably because we were just a party of two (got to bypass large groups, yes!). Unfortunately, we discovered it was cash only and I sucked it up and paid the $4.50 transaction fee to use their ATM machine. Sigh. The price we way for delicious food.\n\nWe ordered a large regular pizza (in retrospect, that was ambitious of us) with pepperoni, Italian sausage, and garlic (I love my garlic, don't hate). It was very delicious, and it was a thin crust pizza, which is my favorite. However, each topping is $2+ so our pizza ended up being 20 bucks with 3 toppings. Quite pricey, if you ask me. However, I've had better pizza elsewhere (in Seattle, can you believe it?), but I will admit their pizza is very good.", "author": "Karen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "My favorite New York pizza so far! Loved everything about my experience at this place! Wood fire flavor is unbelievable, add a little garlic and you won't be sorry!!", "author": "Peter K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-17", "description": "After a long day walking around NYC, this place was AMAZING. I am from Chicago and grew up in a family that loved to order thin crust pizza. I have had thin crust all my life but I have realized that I never actually knew what good thin crust was, until I experienced Grimaldi's pizza. Seriously, do NOT pass this one up!!!! :)", "author": "Liz R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-10", "description": "I can't give this place less than 5 stars. We come here pretty often, usually on a night with bad weather, or a random weekday. The lines are the worst part though, so we usually come here with the option of going elsewhere if there looks like a long wait.\n\nThe pizza is fresh, hot, and comes to your table within a few minutes of your order. We tend to get standard fresh mozzarella and basil. (Highly recommend).\n\nIf the line is long, and it is a beautiful day/night, I recommend calling for pick up, grabbing a few plates/napkins, and bringing the pizza to enjoy at the park. You can not beat the NYC skyline and a fresh hot pie. \n\nAlso, this is a great place to bring guests.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-07", "description": "Some of the best pizza I have ever had. My boyfriend and I stopped at the brooklyn location the other weekend while we were in nyc. This place is very popular and the line was out the door. I actually considered going to the pizza place next door but my boyfriend had been dying to go here. Fortunately, we were able to get seated after waiting probably 15 minutes. We were seated on the second floor of the restaurant.  Grimaldi's has waiter service but is not fancy at all. Service was good but everything was very busy In there. We ordered a plain medium sized pizza and my boyfriend and I split it. It did not disappoint. Their pizza is amazing and I love that they use mozzarella cheese on it. Also, it's not overly greasy and doesn't leave you feeling disgusting after. I will definitely be back whenever I'm in New York.", "author": "Samantha H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}