{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-14", "description": "This place came highly recommended so I had to try it out. I was not disappointed! \n\nThis was the best pizza I've ever had. I couldn't give it 5 stars because I had to wait on line for 30 minutes in the hot sun to get a seat. \n\nIf you're patient - this place is worth the wait!", "author": "Sunny D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-23", "description": "Think of the worse service your've every had a chinese restaurant, and then multiply that by 100 - that is how extrodinarily crappy the service was at grimladis.  I would give this place no stars if I could; the only reason I came here was because the bf wanted to come before they had to move locations.  \n\nTo sum it up: horrendous, worst ever service and their pizza is not all that.  Total tourist trap and you will be disappointed that the pizza is nothing special.  NEVER AGAIN, NO MATTER WHERE THEY END UP MOVING. \n\nHere is a brief recap of my experience:\n- Wait on line for a hour.  Read and re-read the signs on the variety shop next door advertising chair rentals for $3 and cold drinks for $2.  Seriously tacky...\n- Get seated, no one comes over to our table for 10 mins, while customers seated after us get attended to right away.  A few waiters make eye contact, but continue to ignore us\n- Can't take it anymore and say \"excuse me\" to a waiter that just finished taking someone else's (who was seated after us) order, and ask if we can order.  The chubby mexican waiter gives me a nod, but doesn't come over.  So is a nod the restaurant sign language equivalent of \"Whatever\"?  Needless to say, he never comes back to take my order\n- Finally get a different waiter to come over, skinny, pale white guy with dirty blonde hair and glasses.  He somehow takes our order without saying more than 5 words to us.  No explanation for the wait.\n- Pizza comes very quickly.  My anger is intensified by the extremely chewy crust/bread that is making my jaw hurt.  Ingredients are fresh, dough is too chewy, burnt crust is yuck.  Why did I wait an hour to come here?\n- Flagged down a different waiter to get our check so we can get out of this hellhole.   But he forgets and goes clears tables for another 5 mins so we have to remind him again.\n- Check comes, they charge tax, oh and they round up your tax to the nearest dollar.  Is this even legal?  They are already cash only and overcharging for pizza.  Talk about IRS sketchy.   BBB should look into this.\n- I make sure my bf does not tip.  \n- We get out of there and my anger subsides slowly, but my jaw still hurts from the burnt, chewy dough.  \n\nDon't go here.  seriously... there are so many other awesome pizza places.  \n\nWhen you read other reviews on how this is a total overpriced pizza, rude service, tourist trap - well, just believe them.  I wish I did.... \n\nI don't mind no frills service, but this was just totally rude service.  This place ruined my night", "author": "Jess L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-22", "description": "waited 1.5 hours on Sunday afternoon, as expected\n\ntotally worth it, plus I was with 7 friends, so it wasn't bad, and it was a gorgeous day with perfect photo ops of the skyline, got ice cream delivered to us from the Ice Cream Factory by a friend\n\nfirst time there\n\nthin crisp pizzas, super quick, got 5 pies, $12-14 each, sausage and pepperoni are the best, olives are authentic so look out for the super flavorful salt kick", "author": "Jomei L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-24", "description": "Maybe it was the day I was here, but our pizzas were so dry and they were barely sauced. Flavors of the sauce were ok, but I've honestly had much better pizza elsewhere. Service was spotty, and the wait is stupid long. Too long for sub par pizza, IMO.", "author": "Ji P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-13", "description": "You loose..\n\na star came here on a weekend the wait was about an hour or so to sit down. The pizza seems good as before but i guess it is not only thing that makes this place great. Came here with a friend he was pissed at the wait time in line. After we sat down another long wait and he just wanted to leave by now due to the wait. \n\nI feel like that ruined the whole experience because when you are pissed or upset about the wait, you can not truly enjoy the food and the place because you just want to leave. \n\nThe best time to come here is on the week day when the wait is alot less and you wont be as pissed.\n\nAs for the pizza it self - was good but not very good\nThe coke came cold and in about 5 min was hot again - coke is served in 20oz bottles which are not really kept cold. Maybe just a bit cold.", "author": "Michael J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-23", "description": "Worth a try if you want to try out what all the talk is about, but aside from the vanity of having done so, I can recommend better pizza elsewhere with less lines and better selection.", "author": "Cristobal T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-10", "description": "Highly overrated, which as expected for any place that supposedly has 'the best pizza in New York.' \n\nIt's not even New York style pizza at all. It's pretentious, super thin, designer pizza that's tailored to snobby food critics. It's fine, but I'd take a $2 slice from a random corner pizza place in Manhattan over it any day.\n\nAlso, the line is ridiculous, it's cash only (guess they didn't hear it's 2010?), and they only sell whole pizzas.", "author": "Michael K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-01", "description": "this place gets three and a half stars.  there are a few reasons why i give it this review but since we cant give half stars...ill round up.\n\nthe pizza is good.  i cant take that away from them.  its a nice little pizza joint close to the brooklyn bridge.  after eating the pizza you can make a little trip down to the ice cream shop.  this is not a bad route if you want to go on a date,  but here are some of the negatives about the place...\n\nit takes forever to get a seat.  it sucks.  there's so many people waiting outside and ts in brooklyn.  if you live in manhattan you understand where i am coming from.  its also not as good as lombardi's, sorry to those grimaldi's lovers.\n\ncoming here during the summer can be fun especially if you have visitors who dont mind wasting a day traveling/walking/waiting to eat and do a little sight seeing.  coming in the winter will suck cause more times than not you'll have to wait for a real long time and thats no fun.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-19", "description": "ya know, i really do believe the jokesters that say that pizza an emotional experience.  this place was good, don't get me wrong, but take away the nostalgia and I don't really see anything special about their pies.", "author": "Josh C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-05", "description": "It's good. I mean, I enjoyed it. Would I wait in line for hours or walk over a bridge to eat it? Probably not, but I can see the appeal for tourists, and the next time my company wants to bring them into the office and hand out slices for free, I'm there.\n\nThe crust is really fantastic. It's thin and crispy and has that big huge clay/stone oven flavor. The sauce is mediocre (crushed tomatos and very little of anything else), the fresh cheese is tasty and spread out well, and the slices are pretty big.", "author": "S H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-26", "description": "kind of cramped but there is a reason it is so busy. fantastic pizza that is fresh and not overly seasoned. the brooklyn pilsner was good too and complimented the pizza.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-25", "description": "Wonderful pizza \u0026 shocker, this is my favorite pizza restaurant in Brooklyn. Sure, the lines are long, but the quality of pizza here is well worth the wait. It's also a fantastic place to take friends who want to experience what real New York pizza tastes like.", "author": "Anthony A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-03", "description": "Delicious \u0026 classic! Laid back if you're there on the right night. Can't beat it.", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-13", "description": "Go to luCALi it's good pizza. \n\n2 stars because the pizza we got after our first order was replaced was actually edible. First let me start by saying the line to get in is not worth the wait.  My sister lives near by and we came from DC to visit her, and was excited to try this pizza place. We ordered two pizzas , one with black olives on it that were too salty to ingest.  Maybe I am not familiar with 'real' olives as the guy in charge rudely stated to us when we made the complaint. I find it hard to believe the salty, strange taste of the olives would be acceptable to any client. My thing is this, if someone makes a complaint to you about the product, don't try to embarrass them loudly in a packed , congested room. Just simply say that I am sorry, how can we make this better. We were willing to buy another pizza we just wanted one that we could eat and enjoy and not have to vomit over. \nMaybe they need to place a disclaimer in the menu that the olives are highly salty. \n\n2nd thing , the seats are on top of each other u can sneeze and mucus would land on the pizza of the person at the other table. Not a very hygienic place. \n\nThey rush you out the door. Wow the people are so rude at this place. One guy  came to our table when we were waiting for our replacement pizza to collect our plates and clear our table. At the table next to ours there were two people that had payed their bill and were talking , and waiting for a friend in the restroom. The  guy in charge kept giving them strange looks, then I guess he got too tired of waiting the less than 5 mins that they were sitting there , so he went over to them and said if you are done u need to leave. They told him they were waiting on a friend in the restroom and he said ' can you wait outside'. Wow that's the way u treat someone that just spent their money in your establishment. \n\n\nThey care too much about making money and because they have so much business they can do whatever they feel like doing. \n\n\nI say don't waste your time on the line if it's long,  take your pizza to go if and only if there is no line. \n\nGo to lucali , \n575 Henry St. Pizza is better there anyway.", "author": "Rebecca M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-13", "description": "Yum, yum yum yum yum.\n\nMy favorite NYC pizza place. I've never stood in line for it- avoid weekends and standard meal-times by an hour and you should be fine. I usually split a small with someone \u0026 wind up stuffed. It's casual, hurried, you very well may be seated directly next to strangers, and is a can't-miss in my book.\n\n(Follow with a walk around the end of Water St to Jacque Torres Chocolates, then across the Brooklyn Bridge to start walking it all off).", "author": "Liz Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-16", "description": "i finally got a chance to stop in! my bf and i were in brooklyn one friday afternoon and decided to go.. and to my pleasant surprise there was no line! which was great! \nso, here we go, my first time here and its exactly what i expected! sharing tables (every single one was taken!) and small!\nthe pizza is good but not the greatest, i guess i just expected something else. we ordered a plain pie, i expected it to be thin crispy and airy but it was way more doughy than i expected and i HATE doughy pizza but the sauce and fresh mozz. helped it along.\noverall, this place was good but i have to say Lombardi's is more to my liking, but hey i'm still on the hunt!", "author": "melissa b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-01", "description": "Taking a look at the five star reviews you'll notice a lot are not from New Yorkers.  The pizza I had here was not close to being the best pizza in New York.  It is obviously pretty good (the supporters aren't crazy), but I was seriously disappointed.  The dining experience isn't particularly great either, and I found the service poor (not expecting much here, but it was of the 'slam down the dishes' variety).  I will admit that I have only been once, but I don't have any particular desire to go back.", "author": "Ed W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "I gave this a 4 stars because like many other top pizza locations, they all taste the same. Before you bash me saying how I'm ungrateful for living in a country that sells orgasmic pizzas, what I'm trying to say is that all GREAT pizza taste the same. So yes, this is great pizza.  I went on a pizza adventure with 2 of my friends whom are girls (bad idea, small stomach). We went sometime in the afternoon, but heck we waited effing 2 hours to get the pizza. Traveling all the way from Bay Ridge, we felt cheated if we didn't get our metro cards money's worth, so we decided to wait. Plus everyone on the line said how the pizza was totally worth the wait. We waited and waited, then some guy in front of us started talking about the best icecream in the world near the river cafe (about two blocks next to grimaldi). It was featured on rachel rays blah blah blah. Yes, I eavesdropped, sue me. So then we decided to travel there leaving my friend waiting on the line. AND YOU KNOW WHAT?! NO, it wasnt the best icecream in the world. But I gosh dang paid the price for it. Could get the same thing from any breyer's box. Should've been more suspicious when there was no line there. Good things comes to those who wait, we didnt, so we got something bad. When we went back on the pizza line, we continue to hear that guy raving about the icecream. (actually it wasn't the first time we got gypped into buying something we eavesdropped on. ie: ippudo pork buns)\n\nedit: i found out that that place was called Brooklyn's Icecream factory. DAMN YOU BROOKLYN ICECREAM FACTORY!\n\nAnyway, so grimaldis serve by pie btw, no slices. so that was a letdown since I was with two girls. The waiter was not very nice. I asked why I was charged more, he smirked and told me its tax [dumbass]. (no he didn't say dumbass, hence the brackets, but i know that he did mentally). We didn't want to pay tips or tax so we decided to take the pizza on the go. We didn't want it to get cold, so we ate on the sidewalk. Yeah it was damn good pizza, but like I said, all best pizza taste the same. I went to Lombardi's next and no, it didnt need a 2 hour wait and the pizza tasted just the same.", "author": "Jane L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-10", "description": "If your looking for the best pizza in the city, you have to come here.  The first time I came here, it was winter time and I waited about an hour in the cold.  Since then, I haven't had to wait on any line longer than 10 minutes.\n\nThe pizza is very fresh and when you eat it you don't have the normal feeling you would get from eating pizza.  (You know the greasy feeling).  So I would assume it's healthier than most pizza's.  I would recomend getting a (small) pie for yourself.  It is maybe one or two slices too big but the slices are thin so you can if your hungry you could probably finish it.", "author": "Scott M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-09", "description": "This is kind of the epitome of Brooklyn pizzerias. No reservations, cash only, long line out in front, grumpy service, oh, and great pizza. The good news is that you can get a Grimaldi's pizza in Midtown if you don't like waiting in the line. Apparently there's also one in Arizona. Weird.", "author": "Phil B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}