{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-30", "description": "I walk the Brooklyn Bridge just to go to Grimaldi's.  The line's usually out the door, but it's quite worth the wait.  One of the top 10 things I miss about NY!", "author": "Helen T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-13", "description": "I thought this place was good. Very good. The best pizza in new york? cant say it was. It was very good though. They really cram you in and i think the experience might make the pizza better. Any time you wait so long for pizza anything is going to taste amazing", "author": "douglas B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-24", "description": "I came here last Winter and had a very memorable meal. Expect to wait in a fairly long line, but don't get too discouraged because it does move fast. Once you take your seat it's a little hard to move around, but it's a great way to meet new people! Grimaldis has a great reputation as it should. The service is lightning quick and friendly, and the pizzas are fabulous. A definite place to stop by if you're ever in the Brooklyn area!", "author": "Jay L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-10", "description": "Might be the best pie in the city. I pair it with their $15 bottle of Montepulciano, a salad, and eh fugetaboutit.", "author": "Bentobox S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-29", "description": "Okay admittedly I just glanced at a few of the 600 other reviews, but am I really the only one to experience poor service? There was virtually no line, nobody being difficult or bitchy, but the guy at the door (I think he's like the bouncer) had a total attitude ...... we got there before another group but he said they were there first, then got upset when I just wanted to get take-out, let only one person go inside to order it leaving my friend standing out in the rain, etc. And like I said, it wasn't as though it was crazy packed and hectic, it seemed like he just felt like being a jerk. Anyway, the pizza was delicious, but the poor service kind of turned me off to the place.", "author": "jessica f."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-29", "description": "My favorite pizza in the NYC area (though I have not been to Di Fara's yet).  Be prepared for long waits - if you are a local, call ahead and order for pickup.  You can skip the long lines and pick up some pies to go.", "author": "Oliver S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-18", "description": "Would have never went to this pizzeria if my cousin hadn't come to nyc. obviously a tourist place so went with her and my brother. Arrived in DUMBO and had to wait about 20-30 min. Again this is the place i always see on tv, people raving about their pizza and plus my cousin was exicted. anyways we sat down, ordered the large with pepperoni and mushrooms. pretty good pizza, but definetly not the best pizza in nyc. i pretty much think this place is overrated, because of the tourists. overall pizza was good, but while i was eating a slice, i was thinking of so many other pizza joints tat certainly tasted better.", "author": "Deborah J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-03", "description": "this place has some of the best pizza you'll ever eat! \n\ni've gone a few times and never mind waiting for a table - i mean seriously, the flavors are explosive and all of the ingredients are fresh. \n\nGrimaldi's is a must for any pizza lover.", "author": "Jasmine L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-06", "description": "So not worth it!!!! Waited over an hour for chewy, flavorless pizza! Not to mentioned being squished in between another couple. Our local pizzaria is so much better! Never again!", "author": "Alice B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-15", "description": "In a word- amazing.  This was definitely worth the wait.  I have tried to go many times only to find a huge line outside the door.  I finally stopped in around 10:30 pm on Friday night- no line!  The pizza was so hot and fresh...so satisfying!  Can't wait to go back again soon!", "author": "Erin N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-22", "description": "Is it the best pie in NYC? Maybe, maybe not. Is it really darn good? For sure. This is one of those places that is a well-known tourist stop but still hasn't become a caricature of itself. Combined with a walk over the Brooklyn Bridge and post-meal dessert at Jacque Torres Chocolate or the Brooklyn Ice Cream Factory (maybe both!), and you have yourself a perfect NYC pizza experience.", "author": "Bing S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-05", "description": "Did the touristy walk over the Brooklyn bridge on a Sunday and was in line at Grimaldi's by 11:30a. We were towards the front, but at noon they let a huge tour group in. We finally made it in around 12:15. Not too bad and we were glad to find that it was worth the wait! Whatever toppings you get, definitely make garlic one of them!", "author": "Melissa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-05", "description": "Best pizza I've ever had hands down. Went based on a recommendation from a friend. You can taste the quality when eating it. If nothing else, the long line outside during a rainstorm shows how much the locals appreciate this pizza place.", "author": "Brian T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-16", "description": "Delicious! We barely made it (came in at 10:50pm on Sunday) and had to do take-out.  We were staying with friends nearby so we walked our pizza (hurriedly) to our place but not before we each took a bite of that slice. seriously - soo good. the dough was perfect!", "author": "Susan K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-16", "description": "I went here with friends. We ordered a large regular pizza with pepperoni, sun dried tomatoes, and mushroom. I thought it was ok. It wasn't the best pizza.", "author": "Althea D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-08", "description": "I love this place! There is usually a line but it is totally worth it! I have actually stood in the line in the rain before. I always suggest this place to friends who are coming to visit NYC. I even wrote about them in my blog at letsjetset.com", "author": "Adam A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-13", "description": "I like crispy pizza!  The wait sucks; we got there like 10 minutes after opening and still had to wait for 30 minutes, but the pizza really is good.  I'm sure there are other places in Brooklyn with equally if not better pizzas and no lines... please tell me where they are!", "author": "David X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-25", "description": "Love the 'NO SLICES' sign painted on the door. This is classy pizza eatin'. The host poured our wine for us and served up the last slice (he picked me!). He was fun to watch. Older gentleman who kept the front door open by shadowboxing it. Very good pizza, warm family style restraunt, and walking around DUMBO afterward was a great way to start the night. Oh, and the view of Manattan from across the water? Incredible.", "author": "STEVE L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-31", "description": "I used to live in this neighborhood and would go here all the time (before the buses began bringing the Manhattan tourists out, so I can't really comment on the long lines). I love this pizza more than any other pizza I've ever had. Incredible. You will not be disappointed.", "author": "Darwin Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-19", "description": "My husband is a self-proclaimed pizza connoisseur.  Hailing from Long Island (which has the \"best pizza, anywhere, ever\") and having lived in DC for a while (a city with \"no good pizza places except for maybe Vace\"), he's pretty picky.  The wait at Grimaldi's was long enough that I feared he would be \"anti\" even before trying the pizza...but he was \"pro\"!  Yay!  Too bad it's too far from the UES. His final analysis: excellent crust, but John's Pizzeria has better sauce.  (Or maybe it's the other way around.)", "author": "Mimi V."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}