{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-02", "description": "So, as we walked in the hostess pointed out a table \"there in the back\". Friendly woman but we felt forgotten in the back corner she put us in because after 10 minutes no one had approached us yet to offer us refreshments or anything else. The waiter responsible for our table was too busy flirting with two S.African ladies 2 tables further. My gf had to go up to the hostess to let her know we were ready to order. The place itself looks a run down. A paint job is needed. Also, where they placed us in the back we had to deal with flies! What attracts flies? \n The pizza was brought quickly by someone who didnt even spare a second look at us, let alone speak to us. The pizza is defenitely not the number 1 in New York. There 100s of places where you will find more tasteful pizzas. I was dissapointed to say the least. It was bland and the toppings kept sliding off which indicates that the pizza is too oily and probably low grade oil.\n\n Overall, the service was frustrating and the pizza was average. 2 stars is generous according to my gf.", "author": "Alexander O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-03", "description": "I almost gave this place four stars just because the pizza burnt the roof of my mouth and I am still recovering. But just like the wait in line, time heals all and it won't be long until I am enjoying pizza again soon!\n\nWe didn't wait \"too\" long in comparison to the people at the end of the line on our way out. Our mushroom, onion, and black olive pizza came quickly and was just as delicious as I imagined. \n\nThe people here aren't overly friendly because they know they don't have to be. While I liked the ambiance of the place, I think next time I would grab it to go to enjoy down by the park or in the comfort of my room. \n\nI'm lucky to live close enough to Grimaldi's to make it my go-to pizzeria. Now the trick is to figure out the perfect timing to get in and out. But that's a game that I'm willing to play. However I now know to eat a little before so that my hunger pains  don't lead me to eat a scalding hot slice in exchange for the repercussions!", "author": "Cassie P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-17", "description": "Some overrated bullshit pizza. Sad loveless antipasto. Terrible atmosphere just raking in that tourist money. Never going again.", "author": "Dan G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-24", "description": "I have been to this place a few times. Most times I have had to wait outside on a line, which the food and service definitely did not justify. True, the pizza is pretty good artisanal brick-oven pizza, but the tacky Italian-American decor (THAT much Sinatra? Really?) and the grumpy service made the place feel less like a gem than an overblown name in a pricey neighborhood. People love lines, and when they wait on one forever they sometimes justify it retrospectively by trying to like the place more than it deserves, and I think Grimaldi's is a perfect example of this.\n\nInstead of the hike to DUMBO, and waiting on line with tourists, try checking out either a nicer restaurant in Carroll Gardens which would cost the same, or better pizza at any of the nice, cheap, friendly pizza places and artisanal pizza shops all over the borough.\n\nIn my opinion, Lucali's beats Grimaldi's any day.", "author": "Jerry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-29", "description": "Worth the wait. Worth dealing with the tourists. Worth dealing with the rude servers. Worth it! Delicious chewy crust, love the amount of cheese they use and the basil too! My favorite topping is the italian sausage! When it's nice out, my friends and I like to take a pie to-go (still need to wait on the damn line) and eat it on the Brooklyn Bridge.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-02", "description": "I had been to Grimaldi's a few years ago when they were in the smaller building next door (probably mid-2010) and had a wonderful experience. So when my family visited this weekend and wanted pizza, I thought it would be a great place to take them. Unfortunately the quality of the service and the food have gone down quite a bit since my last visit.\n\nFirst of our, our waiter was absolutely terrible. (He was also taking care of the couple at the table next to us, who we ended up chatting with, and they agreed.) After he took our order, he literally didn't stop by our table once except to bring us the check at the end of the meal. He didn't even bring us our drinks or our food--we had to ask another waiter to check on both for us. I know he had a few other tables besides us, but the restaurant was barely half full and he spent a great deal of time flirting with the teenage girls in line outside and trying to look down their shirts. I thought I was imagining things until the guy at the table next to ours said out loud \"what a creep!\" and we ended up talking about it. All the other staff were professional and friendly, but for some reason we got stuck with this guy who was just gross.\n\nThe food was just... not good. We started off with the antipasto, since the ovens were shut off for cleaning when we arrived (they're coal-burning ovens so the restaurant is legally required to clean them every few hours or so--I knew to expect that, so not a problem at all). The olives and the peppers were fine, but the bread was stale, and the mozzarella was pretty dry and seemed like it had been sitting out for ages. The pizza wasn't bad, but I remember being really, really impressed back in 2010,  and this was just okay. Not sure if they've changed the recipe since the move. It also didn't seem hot enough to have just come out of a 1,000 degree oven, but that may have been due to our negligent waiter.\n\nGrimaldi's doesn't sell slices or accept credit cards, which are hassles I don't mind if the place is extraordinarily good, but there are just too many better pizza places to bother. We had planned to stay for dessert, but ultimately decided it wasn't worth waiting another half hour for food that likely wouldn't be good anyway. We ended up walking down to Brooklyn Bridge Park for ice cream and a view instead. Hopefully our experience was just a fluke, otherwise it's really a shame the place has gone so downhill.", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-03", "description": "Best Pizza I've had in NY, amazing staff and you don't have to wait long for a table! Delicious! Make sure to talk to Rafael the host, he's the funniest guy around especially when waiting in line to get in.\nDefinitely a pizzeria to check out!", "author": "Alec L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-03", "description": "the walk here was beautiful.\nyou can see the Brooklyn bridge and all the tall buildings, lights.\nahhh it was such a beautiful sight!!\n\ni was afraid of a line and waiting in the freezing cold but surprisingly i didn't have to wait at all, i got seated right away.\nit was so warm inside so it made me even more happy to be eating Brooklyn pizza.\n\nordered the large pizza with mushroom, onions and italian sausage.\nAMAZING!!\ni think the best thing is the cheese.\nyou have to eat the pizza warm, when it gets cold, it's not as great.\n\nthe staff were nice.\npizza is even better.\n\nyou MUST come and try pizza here!", "author": "Jessica K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-13", "description": "I have yet to leave Grimaldi's with anything but a wide grin on my face.  Though wait times can be extensive depending on when you go, the pizza is phenomenal.  The service has always been impeccable and their large with fresh mozzarella, basil and garlic is my absolute go-to.  Their Douglaston location is great, but you can't beat the DUMBO location!", "author": "Hooney H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-27", "description": "Why does such simplicity taste so good?\nWhy does the smell entice you so much?\nWhy do the tourists make me wait so damn long for my great tasting pizza?!\n\nAll those are legit questions you ask yourself each time you trek out to Grimaldi's. Like I mentioned in my Quicktips, you'll want your 1st time here to be quick, easy, and simple (kind like your other 1st time was...wait what?! Lol). Making things easy your 1st time at Grimaldi's will help you handle the crowds. You'll get your pizza faster, be happier faster, and be in-and-out faster. Most importantly though, you'll have that heavenly slice in your hands faster.\n\nGrimaldi's gets its fame from the quality taste of their pizzas. You can smell and taste the freshness in each bite, and it's not usually a soggy mess that one can sometimes expect in other pizzerias throughout NYC.\n\nLike most tourist spots, nearly everything here will cost a little more (including drinks). But you'll be doing yourself a diservice if having gone through life and never sampled one of NYC's most famous pizza-joints.\n\nEnjoy and get there early! :-)", "author": "Victor R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-28", "description": "Came here as my last meal in NYC before I returning home from a week-long eat-everything-in-sight trip.  What a fantastic decision that was.\n\nWe waited for...not very long, surprisingly, because we went a bit on the early side.  I hear of horrendous waiting stories of up to 2 hours (?!?!), so definitely try to go during off-peak hours.  \n\nWhen we were walking to our table, we passed by tables after tables of people with the white pizza.  \"We must get that,\" said all of us collectively.  I thought it was a white sauce pizza, but turns out, NOPE JUST LOTS OF WHITE CHEESE.  Sorry, people who had to sit next to me on the plane ride later.\n\nBoth the white pizza and the regular one were delicious.  I am usually a fan of thick crust, but this was really good.  I personally like pizzas with lots of toppings, but they charge by the # of toppings here, so there's a sort of trade-off there.", "author": "jon y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-26", "description": "Trekked across the Brooklyn Bridge to Grimaldi's. Got there around 3pm, and luckily the wait was short. We waited for 10 minutes, most likely less. The prices are average, not crazy expensive - not necessarily NY premium price. \n\nThe pizza was good, and it was nice to see the pie just come out of the oven pipping hot and onto your table. The first slice was amazing. It was hot, crusty, chewy, and the cheese was gooey! But by the second slice, the pizza cooled down and lost it's effect. The tomato sauce was nice and fresh. Overall the initial chewy and crispy crust wasn't that great. My jaw got a little tired. I think I like Lombardi's more, but it's been two years since I've been : X", "author": "Vanessa K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-24", "description": "Last weekend I was in NY and after reading some articles about the best pizza in the city I ended up at Grimaldis. First, it seems like there is always a line and it does not move fast. Second, the service is no particularly polite, which at least I was expecting after a 30 min line.\n\nNow, all of that would have been ok if the pizza was as promised. My impressions where a lack of tomato sauce combine with a raw dough. The ingredients were fine, as well as the size. The pizza in general was ok, but not what I was expecting from \"one of the best places in the city\"\n\nThe only thing worth it is the view in the dock that is one block away. All the Manhattan Skyline combine with the Brooklyn bridge. Overall is a complete tourist trap...", "author": "Carlos P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-04", "description": "Honestly, this place is so overrated. The pizza is just ok. Juliana's next door is way better. And the service here SUCKS, big time. It's a tourist trap. Do yourself a favor and eat at Juliana's instead.", "author": "D K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-05", "description": "Pizza is great, service is neither bad or good.... Last time the owner/manager tried to sit us down next to another couple in an empty restaurant... Basically creating a double date at a four top... Uh no we will sit at the bar instead.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-23", "description": "I'm gonna make this short and sweet, just like our visit:\n\nGrimaldi's is not worth the hour long wait that sometimes piles up. It wasn't as spectacular as I had hoped based on the hype it receives. And it was cramped, we felt rushed, and it was cash only (meaning an ATM stop mid-meal was in order).\n\nBut the pizza is excellent, the menu is plentiful, and they definitely know what they are doing. While I haven't found better pizza in New York than here, I'm still looking.", "author": "Rebecca C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-02", "description": "Actually deserves 3 1/2 stars. The napolatean pizza is the type where they put wide slices of cheese on top of the sauce before baking. I've tasted better.... like Lombardis in Little Italy.... but this is not bad. Try it because everyone makes such a big deal about them. In other words its good, but a bit over-rated for a NY pizzaria.\n\nPS... I tried thier location is Arizona..... horrible.... unauthentic... so taste varies by location... this review is for the Brooklyn Front Street. Service is bussy, but cordial.", "author": "Chazz N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-15", "description": "My boyfriend and I had dinner here for Valentine's Day (last night, to be exact).\n\nEverything was awesome: We were seated right away. The staff was so pleasant and upbeat, they even asked how our Valentine's Day was going and promised to make it as wonderful as possible. Our food came almost immediately, and of course, it was delicious. \n\nThe only con is that the seating is a little tight, but it was no biggie, really.\n\nIt was a sweet experience, including a comfy atmosphere, happy people, reasonable prices and great quality food. I'd definitely recommend this for a \"cheap\" date. I'll be returning for sure.", "author": "Ashley C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "Great pizza! The service was very fast (to say it was as crowded as it was). If you're in the area, it's a must!!", "author": "Bayou K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-26", "description": "My last experience was horrific and after doing some more research, I'm never going back.  \n\nMy younger sister was visiting from Ohio and I thought she had to get some true New York style pizza!  When I heard thad Grimaldi's was scheduled to move November 28th (a week away at the time), I thought we have to go!\n\nMy sister, boyfriend, and I ate there the night before Thanksgiving.  The line was thankfully very short.  While we waited for our pizza, we looked around.  Half of the pizzas were burnt, like charred black, inedible burnt.  We were worried our pizzas would turn out that way.\n\nLuckily our pizzas came out well.  But while we ate, no waiter check in on us.  Our water glasses were empty for our entire dinner.  We even asked a waiter for water, and still no water arrived.  It wasn't until we got our check that they finally refilled our waters. \n\nAs soon as we paid, they wanted us out.  We couldn't leave, because my sister was in line for their tiny bathroom.  We didn't feel comfortable taking her things and waiting outside because she had a lot of bags and we didn't want her to go outside in the cold without her coat.  \n\nIt would have been fine if our waiter had asked us politely to leave, but our waiter slammed a bunch of plates and menus on our table.  A couple minutes later, while my sister was still in line for the bathroom, the waiter rudely urged us to leave.  He was clearly irritated with us and loudly grunted, \"Can you please go?  There are people outside and it is very cold.  Can you go?\"  \n\nWe started to grab our things and the waiter already brought in the next family.  They stood breathing down our necks as we had to grab my sister's coat, purse, bags, etc.  The waiter almost pushed us out the way to set up the table while we were still getting our belongings.\n\nIt was the most terrible experience I've ever had.  They ruined our night.  We've always brought our family and friends to Grimaldi's, but no more.  We have never felt so unappreciated.  After seeing how they make everyone's pizza 1/2 burnt and how they treat us, it is clear that they do NOT care about their customers.  They generate so much money from the number of people that come in that they don't need to care.  I don't want to give my money to a place that feels like the restaurant is above the customer.  Where the restaurant feels like it can get away with anything.\n\nAND AND AND...the reason why they're moving is because the owner (Frank Ciolli) owes rent money, despite the fact that he owns 18 pizzerias nationwide.  Sleezy.  The original creator of Grimaldi's also regrets selling his business to Ciolli.  What does that tell you?", "author": "Anne H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}