{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-13", "description": "So we have Grimaldi's ... some call it the best pizza in NYC. Some call it the best in the world. Regardless, you can't say you know about pizza without having gone through the process of heading down to the Brooklyn Bridge and waiting in line (sometimes for 2 hours) for the right to eat at this legendary pizzaria. Part of it may be the charm and ambiance of being so close to the Brooklyn Bridge and a stones throw away from some of the best views of downtown Manhattan that NYC has to offer, but Grimaldi's backs up the claims that so many have made about the pizza that sprouted roots in Brooklyn more than 70 years ago. Burning coal was banned in Manhattan at the time so Patsy Grimaldi decide to make his home base in Brooklyn since he believed that coal was king. The original oven is still charring pizzas to perfection today. Once you are in,  the ambiance is excellent even though the place seems a bit run down. You can see the cooks pounding out dough as you wait the usual 30 minutes for your pie. Drinks (bottled no fountain) are in your hands within 10 minutes and you can take in the fresh ingredients displayed out front. An occasional peek inside the coal oven reveals flames licking the top of the brick and pies going in and out. You'll most likely find yourself staring at other people's pies while you wait. In the end, your first bite from a steaming folded slice is worth it. The crust has a seasoned salted flavor and just the right amount of give, courtesy of the fast and hot coal cooking. The slices are thin but hold all toppings well. Tomato sauce is not as tangy as some other places but the San Marzano tomato flavor pops out and is quite distinct. Basil and mozzarella typically complete each pie. Small 6 slice pies start at $12 with $2 extra per topping. Non-alcoholic drinks are for the most part $2. A small 6-slicer is perfect for a couple. Total damage with sodas will run you about $24 bucks. But any more than 2 persons will require an 8-slice large which starts at $16. Now a note about the toppings ... the italian sausage is OK but not house made perfection like Lombardi's in Little Italy. Ask for extra basil for a more flavorful pie. 2 - 3 toppings max please ... this is not Pizza Hut. Overall this is really a right of passage for a foodie. Do it ...  \n\nA note about the lines: smaller groups are sometimes allowed in earlier than larger groups. It just depends on how the place is moving along. Fire code only allows 65 so plan on consistent but slow turnover no matter what time you go. However,  ideal time to go wait is 5PM. You should be in by 6 on weekends and much faster on weekdays.\n\nP.S. NO SLICES. NO CARDS. CASH ONLY. TAKE-OUT WAITS IN THE SAME LINE. Also, call ahead and pick-up your pie for faster service and no wait.\n\nNow go eat some pizza ... and walk to Manhattan across the Brooklyn Bridge afterwards and burn it off ... unless you get ice cream at the Brooklyn Ice Cream Factory nearby afterwards ... then walk to Manhattan and back.", "author": "Amik A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-29", "description": "Grimaldis has great pizza if you have the time.  They dont take reservations so Its first come first serve and there is ALWAYS a wait.  They dont sell by the slice. . its by the pie only and you can have ANYTHING you want on it.  I went with peppers, onions and sun dried tomatos.  Me and a friend finished a whole pie by ourselves.\n\nBe prepared to not have a personal conversation as this quaint pizzaria has you right on top of the table next to you. Its a must if you have the time and find yourself in DUMBO.", "author": "Joseph H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-04", "description": "Mmmm... the quintessential thin crust pizza.  You should go - it really is that good.  There's always a line but it moves surprisingly fast.  I usually go light on the toppings so as not to ruin the essence of the crust and the sauce + cheese.\n\nOn a sidenote, I don't understand how people can abandon their crusts.  Now sometimes I throw away crust of regular pizza because it tastes like cardboard and is a waste of calories but come on people... this is Grimaldi's!  The crust here is perfectly crispy, slightly chewy and just salty enough.  If you don't want your crust, give it to meeeeeeeeeeeeee!!!", "author": "Joy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-31", "description": "All together now...OVERRATED!!!!  The pizza was ok at best...I get better pizza from the grocery store freezer section.  The door guy was a prick too and we were shuttled in and out like cattle.  Even with the short wait it wasn't worth our time or money.  The bridge walk was gorgeous tho and the ice cream around the corner was delish = ]", "author": "Michelle K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-08", "description": "Before I start my review, let me say...GRIMALDI'S IS A TOURIST TRAP!  GO SOMEPLACE ELSE!!!  Trust me!!!\nWe arrive and stand in line for 30 minutes in 32 degree weather (with windchill it was 22 degrees).  3 attractive women and a guy get in line behind us and also wait in line.  5 minutes later, the women walk in to use the bathroom while the guy waits in line.  I can see the 3 girls through the window talking to a Grimaldi's employee named Ralph.  Ralph takes the 3 girls to a table and one comes out to get the guy out of line.  Totally blatant cutting the line.\n10 minutes later we get inside, we get a number on the back of a business card and go up to the third floor bar/holding area to wait for a table.  By the way, we pass the 3 girls and the guy sitting at a table already.  So here we sit upstairs for another 30-45 minutes before we are seated.\nPizza was not bad, service was ok.   I asked the waiter to talk to the manager about the party cutting the line ahead of us.  Manager's name was Kris.  I told him what happened...his reply was, \"Yeah, so?  We have friends here.\"  I had nothing more to say to him, but 5 minutes later he brings me a card with his name on the back and \"NO LINE\" written under it.\nThen I see the check and there is an unknown charge.  I ask the waiter about it and he says, \"This is a tourist restaurant and this is a service fee.\"\nI pay the amount for the pizza and drinks.  I don't leave a tip or pay for the service fee.\nI will NEVER go to Grimaldi's again.  I suggest you don't, too.", "author": "Stephen G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-21", "description": "Shared a 6 cut pizza with another friend. We ordered half pepperoni with meatball and half chicken with mushroom. The taste was good, a little plain on the chicken one. But you can tell they use fresh and better materials to make the pizza. LOVE THEIR CRUST!! The cheese taste very different, wonder which kind they used. We were going to find out on the way out, since they had an open (sort of) kitchen. But we forgot...", "author": "Wei Juan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-03", "description": "stop #23 on our FOODSTRAVAGANZA\n\nstill ranks as #1 for pizza in my book. better than anything i had in italy (see previous review).", "author": "Regina C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-03", "description": "The only reason I went is because a.) my friend from cali was in a venture to find the best pizza b.) i have an excuse to go to grimaldi's c.) my other friend from NY wanted to give it a whirl\n\nEnd result?  Ok, anyone else who been here knows the wait sucks.  Atleast the view there is beautiful, especially at night.  Once we got inside, the staff are very helpful, and thoughtful.  When we got the pizza it was ok.  I'm not much of a fan of thin slices but I didn't feel that WOW factor eating.  I just felt like I was eating an overpriced pie.  I wont make any mistake that the ingredients in it was freshly made, but I got really annoyed that part of the crust is non-existant.  Lol, no i shit you not, part of our pizza crust is not even there I dont even know what happened.  Anyways, it was a great experience just to go and try, but I wouldn't come back.  My friend who came from Cali wasn't really that impressed either.", "author": "Jessica C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-20", "description": "Good pizza, but I've had better outside nyc -- didn't really live up to its hype as potentially the best in the city (and hence the country).\n\nOnly real downside is it started out great, but the crust got soggy quickly after ~5 min", "author": "R P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-19", "description": "Some of the best pizza I've ever had. Great location near the Brooklyn Bridge and nice overall feel to the restaurant. It's pretty loud and only accepts cash which are the only real down sides. But the downsides are minor in comparison to everything else.", "author": "Chase Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-15", "description": "Being a NY institution, I knew I had to try it. So on a freezing late November day, my sis and I decided to brave the elements and wait in the long line for a late lunch. I think we were in line for an hour before we were seated and I was never so glad to be in a warm room that I can remember. We ordered a large sausage, mushroom and sundried tomato pizza and it was really good. I'm glad we tried it and I would go again, but I probably wouldn't wait an hour for it. Definitely not in 40F weather...if I try it again, I will make sure to go on a weekday =P", "author": "Diana C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-18", "description": "I write this with a mixed review/opinion. From a taste and food perspective, awesome. It was everything I hoped for! It was worth the 2 hour wait. \nAs far as service, I expect some \"NY attitude\" but not to sent away with a to go pizza by the owner. Yep, I was a party of 1, waited ~2 hrs and was told by the owner that he didn't want to give up a table for 2 to seat me. He said my only option was to order to go and catch a can back to my hotel to eat or eat on the street. What??\nWell, I really wanted to pizza so I did that but that was rude. The dude is like the \"pizza nazi,\"", "author": "Todd W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-28", "description": "Best. Pizza. Ever.\n\nI'm not even a huge pizza eater but I dreaaamm and droool about this place.  Crust is thin, soft when warm, and delightfully chewy when cooled.  Cheese is generously layered on in slabs, tomato sauce is light but wonderfully textured.  Ohhhh myyyyy.\n\nAlways have to wait in line to get in, despite going at the oddest hours but SO INCREDIBLY WORTH IT.", "author": "Carol C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-11", "description": "The pizza was very good - thin, crispy yet chewy dough/crust. Fresh mozzerella and toppings.  The pizza came out very quickly.  After you are done, you are less than a block away from a beautiful view of the Brooklyn Bridge and the NYC skyline.", "author": "Ben C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-27", "description": "Best thin crust I've had in New York. \n\nHighlights:\n\n1.The pepperoni is thick and spicy\n2. The cheese is creamy and thick\n3. The pizza actually tastes better the next day when put in the oven.\n\nSo much better than Lombardi's.", "author": "Ariel K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-16", "description": "It's my last week in New York (after a 2-month gig in the city) and I was only convinced to visit Grimaldi's not because of it's stellar rankings in the NY Pizza space....... but after hearing about the shop's run-in with the law and potential move out of its legendary sub-Brooklyn-Bridge location. ( Say what? )\n\nI came in on a Sunday night near closing time. The wait was only 20 minutes as opposed to the 3-hour horror stories I've heard from friends. Arriving at 10pm, coupled with a light sprinkle deterring most tourists, was my best bet I thought. And indeed, it was.\n\nNo sign-in sheets. No reservations. Just get your butt in line and count the number of people who exit the building to determine when you'll be next. Ordering to-go? Yeah. Get in line, too. \n\nWhat I liked:\n- fast service, fresh ingredients\n- less greasy than expected (so healthier, right? heh d:)\n- fairly affordable -- my party of 2 ordered  a small w/ mushrooms \u0026 sausage ($22 incl. tax,tip)\n\nWhat I disliked:\n- tomato sauce could've used more pizazz; the fresh mozzarella was a little too mild for my taste buds and I needed a stronger base sauce to compensate for the lack of flavor \n\nWould I come back again? Probably, especially if the wait is less than a half hour. Did I think it was worthy of \"Best Pizza of NY?\" ....not sure yet. Haven't had a mind-blowing slice as of late, but I'll keep you posted.\n\nTip: walk it off with a 1 mile stroll over the Brooklyn Bridge (especially at night, and especially if you want to impress your date). Open 24/7.\n\nNews about Grimaldi's rent evasion: http://www.brooklynpaper.com/stories/33/34/all_grimaldiseviction_2010_08_20_bk.html , http://www.huffingtonpost.com/2010/08/11/grimaldis-pizza-restauran_n_678352.html", "author": "Salina T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-14", "description": "Delicious.  If you can stand the wait (and its worth it) they are definitely in my top 5 pizza places to eat in Brooklyn.", "author": "Jerome W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-28", "description": "I have been waiting to go here for years now.  I have heard so many good reviews from critics, New York city food magazines, and from a few friends and acquaintances that I've always had a curiosity about the place.  I'm normally not in the area.  Usually I end up here way too late at night, or when I'm not too hungry or I'll be dissuaded by the long line (I have a passionate hate for lines). I'm always thinking I'll stop by in the next few days, but that has turned into years.  Then I heard this week that the place was going to move.  Fearful that the change of places and oven might change the pizza (it might not) I hurried over here this past weekend with my best friend and braved the line finally.  \n\nThe line was definitely worth the wait.  I absolutely loved the pizza.  I had a small regular pie with my best friend. Everything was just great and yummy; the mozzarella, the tomato sauce, the basil, the crust. The mozzarella was so chewy and delicious. The crust was charred just right.   I loved it \u0026 highly recommend it.  I really wish I had braved the line years before. I just want to eat more and more of this pizza.\n\nI really loved the atmosphere too.  Yes, it was very busy \u0026 very loud. The place is small and tight, you'll end up sitting right next to strangers and overhearing a bit of their conversations over some background music.  Normally, I don't like noisy places, but I rather enjoyed the atmosphere anyway.  Maybe I was just too happy to finally be in here, but I just enjoyed watching and listening to everything around me.  It feels like a microcosm of the city.  Everything is noisy, people are always coming and going, servers never missing a beat, running around picking up plates, placing down plates, taking orders, running back and forth.  You also get a view of the kitchen. I got to sit right in front of the kitchen and really enjoyed watching the guys making pizza after pizza. It was fun.  I also liked the decor.  I have a soft spot for pizza places with Frank Sinatra love and walls with frames of celebrities who've stop by.  It's a super busy, crowded place but I definitely loved it.", "author": "Karen P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-09", "description": "Definitely a must do when you're over in Brooklyn. It's not a secret that over the years it has unfortunately become very much of a tourist trap (immensely overrated), so expect a wait in line but not an amazing pizza.  Don't get me wrong, the ingredients are fresh and the pizza is good, just doesn't blow your mind away.", "author": "Samantha L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-27", "description": "If you want tasteless pizza, this is the place for you. Really overrated. Crust was good but sauce had no flavor and prefer regular Mozzarella as fresh mozzarella doesn't melt well.", "author": "Lorri C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}