{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-27", "description": "Totally worth the wait! If you can go now while its still cold outside!!! The line gets much longer in the Summer because of tourists and such. I recommended getting there early because you will get hungry from the smell! The place is definitely pretty cramped as they try to pack as many people in there as possible, so I wouldn't bring any shopping bags or such. \n\n I like the original pizza here the best, but have also had it with sausage and it was good too! You can also get black cherry and cream soda here! Clearly I am fan.", "author": "Jenny T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-08", "description": "I visited 2 major pizzeria's on my trip to NYC. This one and Lombardi's. My friends and I came here after we walked the Brooklyn Bridge, so you can imagine how hungry we were for lunch after we had just had a nice morning stroll. The line was so long, we waited for at least 30-45 minutes just to get a table. My favorite topping in NYC are the pepperoni's, they taste a lot better then Cali style peppies. Grimaldi's is known for their coal brick oven pizza, but I thought that the pizza was too burnt and I didn't enjoy it. Definitely go to Lomabardi's over Grimaldi's.", "author": "Angelina L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-27", "description": "Pizza is amazing service is horrible. I got the regular pie with mushroom and pepperoni.", "author": "Lynette H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-19", "description": "Miserable place...Called to make sure they were wheelchair ACCESSIBLE and we were promised over and over again that they were!so we decided to have a fun stroll across the Brooklyn bridge from little Italy to grimaldis for dinner!Little did we know we were lied to our 40 minute walk was destroyed when we realized the front door had 3 steps!!!Cant get a wheelchair in there!!!So we called the place up since they wouldn't let me go in to talk to the manager!And to add insult to injury the manager cursed me out!They basically dehumanized a disabled person!I don't care how many shows they've been on they are vile!", "author": "Derek R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "Came here on recommendation of two friends as I was looking for pizza. As a tourist I came alone and sat at the bar, ordered a small pepperoni. The pizza was delicious: the crust was perfect, the cheese was fresh and the pepperoni was great. I finished the whole pie (it's pretty big) and loved it! cash only, no slices.", "author": "Alex Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-29", "description": "LOVE. THIS. PLACE. It is absolutely worth waiting in line for. Even better, if you make it there on a weekend around 11:30, the place opens at noon and you will likely get seated with the first group of people. Grimaldi's moved relatively recently and now occupies a much larger building than before, so I imagine that wait times have decreased as well. The pizza here is perfection, hands down one of the best places in New York. If you have guests in town that want to experience quality pizza, Grimaldi's can't be missed. Not only is the food amazing, it is CHEAP. One pizza easily feeds 2 people, 3 if you're not that hungry. Seriously, if you haven't been here yet you're missing out.\n\nHeads up: CASH ONLY.", "author": "Cynthia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-23", "description": "Damn good pizzaria. Old fashioned, brick oven cooked, great waitstaff and owner was just as friendly I guess as a Brooklyn raised native can be. I got the feel of the genuine Italian family style ran restaurrant where the owners and staff spoke to you like you have been there for years. \n\nThe pizza was great and well made. Large slices w just the right amount of topping portion sizes and the simplicity of this style impressed me. Fresh ingrediants and thin crust made for a delicious pie.\n\nThe pricing was reasonable, really couldnt complain. \n\nI would recommend to get here before lunch time or after the lunch hours, a line formed around the side..another indicator that we had made the right choice", "author": "Josue M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-27", "description": "Horrible line and horrible doorman . I went to ask him a question and he completely ignored me. You can get better pizza elsewhere with less line and no attitude.", "author": "Christina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-26", "description": "A marvelous reward after an exhaustive walk on the Brooklyn bridge. Best pizza in NY at all.", "author": "Victor M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-16", "description": "Grimaldi's is one of the best pizzas ever!! It probably is the best. I love it because you can actually taste every single ingredient on the pizza which is how it should be. The pizza actually comes fast but the wait to get inside can be long depending on what time you come. \n\nThe wait is so worth it though if you love pizza. I love pizza! It's one of my #1 favorite things to eat and sadly there isn't a lot of good pizza joints in Southern California. So every time I head to NYC, I have to get good pizza. \n\nI'm craving Grimaldi's as I am writing this. I can't wait to come back and eat more of their delicious pies!", "author": "Sarina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-17", "description": "Ever since I moved to New York, I've probably heard the phrase \"You've gotta go to Grimaldi's\" once a week. I finally went with my boyfriend this past Sunday, and wow: I see why NY is famous for its pizza.\n\nWe arrived after a pleasant stroll over the Brooklyn Bridge and said to each other,\n\"Are you hungry?\"\n\"No. Are you?\"\n\"No. Wanna go get pizza?\"\n\"I'm already looking up directions on my iPhone.\"\n\nSo we started our quest towards Grimaldi's. It was a bit difficult to find since we over-shot it coming off the bridge, but eventually, we found it... and were confronted with an intimidating line out the door. Neither of us our patient people; we decided to wait fifteen minutes, and see how we felt after that.\n\nThe problem was that we both had to use the restroom. When we went inside, the line for the restroom was right next to the oven. So, while waiting to pee... all I smelled was fresh mozzarella, basil, olive oil, while my face was warmed from the heat out of the oven. I almost forgot I had to pee. It was then that I knew that no matter how long the wait was, we'd be eating there.\n\nLuckily, since we were a party of two, we were seated earlier than expected. We ordered pizza and mushrooms with the pizza... and ten minutes later, we were in pizza heaven. Fresh chewy-cheese mozzarella. Thin and chewy-- and not at all crispy-- crust. Fresh barely-burnt basil. Lightly drizzled olive oil. Even though the crust was half-burnt (uneven flame distribution), it was still excellent without much charcoal taste. I bet it would have tasted even better, actually, without the toppings because the pie was just that good.\n\nYup: best pizza in New York that I've had, yet. It's a Must Eat when in NY. \n\nFive stars, all for the food! The service was mediocre, but to be honest, I wasn't paying attention since I couldn't stop thinking about the pizza.\n\nThe pertinent details:\n- Total wait time: 30 minutes (Sunday around 1pm)\n- Line is outdoors: bring a coat\n- Take out is same line as eat in\n- No half pizzas or slices\n- Cash only, not many banks near by\n- Does not taste as good re-heated, but still adequate\n- To get here: take the stairs where the Brooklyn Bridge forks, go towards Brooklyn Heights\n- Crowded quarters: you'll love your neighbors for sure! And you'll smell their pizza. Smaller groups are better.\n- $14 small (16\"), $16 large (18\"); $2 on average per topping, same price if half or whole pizza\n- Table has red chili peppers, garlic powder, salt, parmesan, pepper.", "author": "Debora L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-01", "description": "One of my pet peeves is \"real\" New Yorkers hating touristy places on principle, or arguing that *insert hole-in-the-wall-no-name spot* is the REAL best ______.  Honestly though, the sheer pain of standing outside for an hour for perfectly good but not mind-blowing pizza puts a strain on even my attempts to not be hostile to the tourists that help fund Mike Bloomberg's latest vice squad endeavor.  \n\nIs Grimaldi's really good?  I mean, yeah, all the people waiting aren't insane.  The ingredients are good, the crust is nice and thin, and the prices are acceptable.  If you are in town for the weekend or the week, absolutely hit up Grimaldi's for a New York experience and then head on over to Brooklyn Bridge park, or even the Brooklyn Ice Cream Factory if you haven't had your fill of waiting in lines yet.  \n\nBut, if you want an equivalent pie minus the wait, you can feel free to go to another pizza joint with 4 stars on Yelp...", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-26", "description": "On a recent trip to New York we tried this place on the recommendation of a friend whose husband is a chef. I thought the pizza was really good - fresh ingredients and dough, worthy mozzarella, and the pizza was a good thickness (I'm not a deep dish fan if that helps). \nNow if you're a tourist expecting smiles and greetings when you walk in, you may consider walking back across the bridge to a tourist-friendly spot. This place is no nonsense, cash-only, get in, and get out type of establishment. Their food is legit, the service seemed quick (we came on a weekday), so I have no complaints about the guys who served us.", "author": "Erin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-15", "description": "Grimaldi's is absolutely delicious New York brick oven pizza !!!!!\nIt's worth the wait and is a fun place to bring out of town guests for that true New York experience.  Their sausage is made with just the right mix of spices and shouldn't be missed.", "author": "Ed G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-19", "description": "I had to wait 2 hours unthe summer on line for this pizza and it was by far the best wait of my life. The pizza was amazing oven-baked pizza I had. \n\nThis place is worth the wait, the environment is super comfy. \n\nHighly Recommended in the top 3 of pizza places.", "author": "Essa V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-19", "description": "Definitely my new favorite go to pizza place here in NYC. My boyfriend and I were actually greeted and walked in by the owner himself (pretty awesome and laid back guy). Ordered a small pepperoni pizza with basil.. Cheese was superb.", "author": "Karen G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-05", "description": "I wish I liked Grimaldi's, but I have to be honest and say that the pizzas here are a bit mediocre and overhyped by the media. It is not the best pizza in NYC, and the line is always ridiculously long. However, it is good to give this place a try. If you don't want to wait at this Grimaldi's, there are a few around NYC. The most recent one opened is in Brooklyn (across Luna Park entrance).", "author": "Ann S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-27", "description": "I hate to be a Debbie Downer, but Grimaldi's didn't live up to the hype. I felt like the crust to sauce/cheese/topping ratio was off... like 3:1:1. For a \"brick oven\" pizza, I found the crust to be too fluffy and bread-like. And as a topping hound, I would have liked to see some specialty options (read: lots of pre-selected topping combos), rather than a DIY list of choices. \n\nWe entered at around 45 minutes to closing and were seated right away. The staff was gracious and accommodating even though we closed out the place...always greatly appreciated!\n\nRemember to hit up the ATM pre-meal... this place is CA$H only.", "author": "Morgan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-11", "description": "The Skinny:  Good casual place to take your fun date, not the crazy one!\n\n Atmosphere: Classic pizza-place look. Who cares! I was there for food.\n Price: Mid-range. aka affordable\n Food: Fresh and delicious!\n\n\nThe Long Review:\n\nGoing to Grimaldi's on a weekend requires a ritual: you have stand on line that often stretches beyond the horizon and curves to the next block over. Reminds me of people waiting on the gas line after a storm. But like gas, waiting for a fresh pie at Grimald's is worth the wait. We went in and sat on a small table that barely fit us both in but not before shoving us right next to three other couples. It can be LOUD in there. But hold off on the headphones there now! When they bring out the food, they sometimes chant, letting the house know another fresh pie is about to be eaten. \n\nThe food: \n\nThe pizza at Grimaldi is fresh in taste. I had a margarita pie and my buddy had a pie with different toppings. Both arrived at the same time and the waiters yelled out \"two hungry boys\" as they brought us our pies. And oh we were hungry indeed. After all, we had a good 5 mile walk from the Island of Manhattan over the Brooklyn Bridge and taking the elusive walk-path stair exit that leads us pretty close the restaurant.\n\nThe taste was rich with a gentle balance of sauce, flavor, cheese, coupled with the soft bites of crunchy slices that just made love in my mouth. D-licious! \nWhen we were done, we paid for it and went off to a dessert place.\n\nOverall:\n\nGood place for adults; not exactly a great place for tiny little kids but the owner/manager will try to accommodate people with kids. \n\nThe people:\n\nThe people are nice but they are fast paced. Well, they have to be because they have to make fresh pizza and bring them to the table in much much shorter time.", "author": "Al Fatah K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-26", "description": "This is not quite the Grimaldi's I recall from when it was Patsy's back in the 90's but it was still better than average brick oven pizza. I think they skimp a bit on the toppings (seriously, 2 baby pepperonis/slice) and the cheese is a little light, but the pizzas come out quickly and cooked perfectly. \n\nThe ambiance is nice if you're a sports fan like me, with multiple TVs showing ESPN highlights and just the right amount of noise to speak loudly but not be able to hear or be heard beyond your own table.\n\nThe staff seems a bit cold, but that's to be expected from most old school pizzerias. \n\nOverall, I would say this is good for a quick lunch but if you're expecting greatness and inviting friends for dinner, you're probably asking for disappointment.", "author": "Jay S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}