{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-26", "description": "I live in Los Angeles and finally visited NY. I was on a hunt for that \"NY Pizza\" I've always heard of. I was told of Grimaldi's from a good friend, and my God...it was all I hoped for!!! It was so good in fact that we ate here twice during our 1 week stay. I can't wait to come back to NY just to eat here. We went simple and ordered a pepperoni pie. The ingredients were fresh and the flower they use has to be super fine, because it doesn't leave you with that over stuffed feeling.", "author": "John Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-06", "description": "My pizza and soda was $26 and tax $2.75\nBut they gave me  $33.75 bill.\nWhen I asked them he said it include tip, but they didn't tell me the bill includes tip! \nI was going to leave $40 to cover the tip, so if i didn't ask I would have left even more money for the tip on top of the tip that wasn't listed as tip on the bill!!\nMy waiter never come back to me and didn't ask about food!!\nService is bad!!!\nWhy they include the tip on bill without telling??\nI'm never coming back again.\nIf you want to go have to make sure you check your bill!!", "author": "Yunee J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "I love going to Grimaldi's to get pizza when I go to visit the Brooklyn Bridge Park. The pizza is delicious and authentic. It has fresh ingredients and the BEST cheese. The staff are usually very friendly and patient throughout your time there. They never rush you in or out. The only downfall is that a lot of tourists come here, and they don't take reservations. So sometimes the line is long, but it typically moves fairly quickly. Also, if you want to order a pizza for take out, you typically still have to wait in the long line of people waiting to be seated.", "author": "Brittney R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-15", "description": "This place is right at the corner and is easy to find. It was hard to get the server's attention since we were put at the far back corner in the restaurant, though they were nice and polite more than your typical restaurants. They were also pretty friendly which created a welcoming environment. The pizzas was a pretty good price, you choose the size of the pizza and then you pay a la carte for each topping you choose on top of the pizza. We got anchovies, sausages and mushrooms.\n\nThe pizza was kind of wet which was a turn off to me, not sure why it was so wet with like water but not oil. It was like kind of soggy, besides that the pizza was pretty tasty itself, it had the right amount of ingredients and was extremely filling for 4 of us, and we got a single extra large pizza.\n\nI would definitely come back and try one of the other pizzas out, I hope it's not soggy and we though.", "author": "Christopher L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-06", "description": "I don't understand all the great reviews about this pizza place. For starters the mozzarella they use feels like rubber. The crust is good but the sauce is almost flavorless. I saw many customers adding lots of salt and garlic which means the main components (cheese and tomato sauce) lack in flavor. This specific place has industrial noisy fans because they don't want to turn on the A/C. My waiter was good however the 2 people in charge, a dude and a lady, are so rude that it makes it hard to come back. They were just more interested in counting the money than taking care of their customers. My pizza came with most of it with no sauce and a very few burned basil leaves. I will not come back and since I had the same bad food experience in Dallas TX, I can't recommend it. A dollar pizza slice tastes like a real NYC pizza, this one doesn't... at all!", "author": "Guillermo G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-08", "description": "I expected better quality pizza coming from Brooklyn. We were going to Juliana's but we got there too late and it was closed so we ended up coming here instead. The pizza wasn't bad but I didn't walk to Brooklyn for \"ok\" pizza. We didn't look over the menu since we already knew what we wanted and we were starving and that was a mistake. We were trying to figure out a random $5 charge on our check but thought it was our drinks. It didn't add up but we didn't think about it until I started reading the reviews and figured out it was a service fee. We were only 2 people and they charged 5 extra dollars when we had already left a $6 tip. They should make sure they physically tell people about this fee instead of writing it on the bottom of the menu. I wouldn't be this pissed if we would've had excellent service but just like the pizza service was just ok.", "author": "Natalia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "Brooklyn institution. Or at least I thought. Turns out ol' Patsy Grimaldi was making Pizza since age 10 at his uncle Patsy's Pizzeria in 1941 Italian Harlem. Glad he stuck to his guns and opened up Grimaldi's years years later, as their classic thin crust Neapolitan style pies are good enough to remind you those vacations in Naples.\n\nBe sure to try Julianas's, the restaurant Patsy opened after selling Grimaldi's and coming out of retirement.", "author": "Christopher D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "Heard a lot about how good the pizza is here so decided to check it out while in nyc. Very fresh ingredients and the mozzarella is out standing! Oh and the pepperoni and the sauce was amazing! The service is good and the pies came out super quick. Fun old building too. Happy we came. Definitely would recommend!", "author": "Hal W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-07", "description": "pizza isn't bad compared to all other pizzas I've had , when it came out it was only warm. Wished it was pipping hot. Pizza crust is quite crunchy, which is good. Basil on the pizza gives it a herby taste.", "author": "Howie Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Pizza.\n\nHoly shit.  Just do it.  Do not pass go. Do not collect $200.\n\nI'm f*ckin' serious.  The food snob has spoken.", "author": "Janine P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-03", "description": "Average pizza. Nothing great about the crust as i had heard. Julians across is a better option instead.", "author": "Nitesh S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "There simply is no better nyc pizza. I say that with confidence. We travel 45 minutes to eat here and it's worth every second. I love Grimaldis, I love the staff, I love the food, and I love the atmosphere. \n\nJUST GO.\n\nAnd tip- its cash only. They do have an ATM but it charges like 6$, so brig cash.", "author": "Whitney P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-21", "description": "People line up here just cause they're A line outside. They became famous because of the old owners that sold and move down two stores to Julianas pizzeria. That's where you get real pizza. Just because they have a lot of tourists waiting on line, they are very snobby and really impolite and rude to their customers. I wouldn't go there if I were you", "author": "Joshua K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-01", "description": "I'm gonna be honest if you asked me to review this a year ago it probably would have been 4 stars. I've been going here for years because the food is really good. Now if you're a foreigner you probably think pizza is pizza and you're there for the Instagram post saying you're there. While it is good, it's not consistent. If you're there on a day when it's not busy you're gonna get a good and thin pie. Which is great and the flavor is good. However, if you're there on a bad day you will get a thin pizza but it won't be their famously very thin pizza. Now it's history time. Grimaldi's isn't the original Grimaldi's. The pizza place called Julianna's, is a few restaurants down on the same block. That's the original Grimaldi's. He had to change the name, it was originally Patsys but Grimaldi's lost in court because a pizza place had the same name and sued. Hence he changed it to Grimaldi's but then bought the bigger place down the block now called Grimaldi's. Changing the small store to Julianna's, which is where the original Grimaldi's fire burning oven is. Long story short go to Julianna's instead of Grimaldi's if you want the true Grimaldi's pizza.", "author": "Alexis C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "The firm yet light crust, the creaminess of the cheese, the taste of the sauce.... \n\nI love this place and will go any time I'm in NY.", "author": "Simu L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "If you're looking for your little slice of NY Pizza Heaven this place is it!! The place is clean and cozy. They don't sell pizza by the slice and they only take cash but it's worth it!!! You can get a whole one topping pizza for 3 people for about $16-$20. Each will have about 3 slices, they also have a larger size which starts at $16, each topping ranges from $2-$5. We had pepperoni, mushroom and sundries tomatoes, the pepperoni was out of this world, like no other pepperoni I've had before!! Definitely would recommend.", "author": "Ashley V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-03", "description": "Amazing. Came from Houston and this was on the top of our to do list. Food was amazing and services as well. However, be prepared to pay cash. Overall this place is awesome a must try if you come to New York.", "author": "Jenae W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-11", "description": "Classic NY pizza landmark. Line wasn't too long for 2 people for Friday lunch (they told everyone in line 20 minutes minimum). We got seated in about 10 minutes. When we got in, the waiter was quick to take our order, but then we waited almost 45 minutes for the pie?!? Considering a brick oven cooks a pizza in 5 minutes max, 45 minutes to put a simple pepperoni/mushroom pie together is a bit excessive. Dough was cooked well and had legit bite and chew I was looking for, but the crust fell a little flat, literally. Missed the airy/puffiness around the edges. Overall, an experience to say you've done it on that Patsy's  Grimaldi's  checklist.", "author": "Rachel W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-03", "description": "I visited this place because one of our friends was very eager to visit this place. There is an incredibly long wait outside and an even longer wait inside. For a place where you wait so long for food, our expectations were so high, but I felt the food was just about okay. I think I have had better pizza in Austin in all honesty. The wait inside was the longest after we had ordered. There were seven of us, and we ordered 2 large pizzas (Cheese \u0026 sausage/ mushroom). This place has no pre-picked menu, meaning you have to choose from a variety of toppings and create your own pizza. \n\nAfter a long wait, we got the pizza and it was good, but definitely not the best I have had. I read some previous reviews, and I hear the place next door is owned by the previous owner of Grimaldi's, so I kind of wish I had visited that one instead (which also had an incredibly long wait). Overall, pizza was good, not too salty or oily, and the crust was chewy, but really was missing that oven pizza after-taste and flavor I was looking for.\n\nThis place is a top tourist attraction, so if you are into that, it is worth trying once, but if you want to try truly good pizza, I think there are some other places to try.", "author": "Julie Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-27", "description": "Very delicious pizza. Not your typical New York slice as it is not oily at all, but it is very cheesy. Pizzas are baked fresh to order in their coal ovens. Very reasonably priced as for $20, tax and tip in, me and my girlfriend ate a regular pizza which was huge and drank a liter of cola. Don't let the line outside scare you, it moves rather quickly.", "author": "Thomas K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}