{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-01", "description": "Had to get a taste of New York style pizza, after all, that's what you're known for right? I was depending on Yelp to steer me to a pizzeria that is rated highly with alot of reviews; boy, I wasn't disappointed... \n\nFirst of all, I EXPECTED A LONG LINE and planned accordingly; besides, it helps if you're flexible and can make it down here at around 500pm before the line gets really long. There were only about 6-10 people in front of us, the two of us were seated after about a 5 minute wait partially because the people in front of us weren't ready because they were expecting the rest of their party. We didn't have a problem with the owner, he was nice to us; of course we weren't irate to begin with because we were waiting for an hour either... \n\nThat said, the place on the inside is very casual, crowded, and even a bit tight. I found out later that the line in back isn't necessarily for take out; it's for the unisex bathroom. The place seems, well, traditional and historic... \n\nWe split a 16\" pizza, a six slicer, with sausage, mushrooms, roasted bell peppers, and garlic. The crust is thin-crust, the mozzarella is fresh, the tomatoes are San Marzano, and the oven is brick lined. The results were excellent but not worthy of \"the best I've ever ate.\" Still, I would have to say that I was happy that we came and checked it out, especially since this is the original, iconic location... \n\nIt's cash only, don't know why it needs to be so hole-in-the-wall like in this regard... \n\nBy the time we were finished and stepped outside, the line had swollen to around 100+ deep. It sucks to be you... \n\nBTW, to the xenophobic locals who don't appreciate it when tourist support the local economy, and to the people who bitch and moan about being slighted while waiting in line, if there wasn't a long line, you probably wouldn't be as interested or give a shit about this place in the first place...", "author": "Lawrence L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-26", "description": "Bring on the hate.... \nIt's not that great. I was more impressed by corner greasy pizza. If you got time and wanna have it like they do in Italy. Fine. \nBut if you're looking for new York pizza. It's not there. \n\n.... Just saying", "author": "Maria Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-25", "description": "If I lived in Brooklyn I would totally get more stuff here. It is such a great place and such a great pizza. \n\ni like a get a whole pie to myself ad then stuffing as much as i can in my mouth. After that I take the rest to stuff in my fridge for break fast. \n\nI am totally into food like this. It is not such a difficult place to get to from jersey.", "author": "Gately K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-27", "description": "I really don't know how this place got only 3.5 stars. Grimaldi's has some amazing pizza. If you love fresh ingredients on a thin crust cooked to perfection, this is the spot. Seriously. Definitely coming back.", "author": "April B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-09", "description": "NOT worth the wait... or the hype. It was the most unremarkable pizza I've had at a pizza place. Edible, but not enjoyable.\n\nService was fine and the prices were not outrageous, so 2 stars.", "author": "Amy X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-25", "description": "Good pizza! The crew that works there are ok. Kind of lazy and not that upbeat and out going. This could be due to the crazy amount of foot traffic they get. \n\nThey don't have a liqueur license so don't expect to wash down that bread with a refreshing soda....brutL.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-05", "description": "too much queue, and they don't serve slices, so if you're alone unless you can eat a whole pie skip it", "author": "Abel G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-21", "description": "Ehhhh\nIdk what happen during my experience but sticking to the Pizza, it was good but nothing to rant and rave about. I read the other reviews and saw pics so i thought 4 sure this would be a no brainer 5 stars. Nope! The pizza was not super hot, the pepperoni they use is a tad bit overly salty and I could barely taste the mushroom. Thank GOD we did not have 2 wait in the heat or in a line. I am willing 2 give them another chance one night when im drunk n craving pizza. \n\nP.S. Everything tastes good when your drunk!\n\nWent again a second time (sober) and the above remain, nothing to rant and rave about", "author": "Mo D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-12", "description": "The pizza is good, but it's too touristy for me and the fact that they have expanded to places such as Las Vegas, Phoenix, LA, Florida etc.,  all but eviscerates its exclusivity and status as a NYC pizza landmark.  If you're going to Brooklyn, definitely check out Lucali's, Giuseppinna's  or another true New York pizza restaurant.", "author": "Randy H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-26", "description": "Pizza is very good. But the fact that it's a cash only restaurant and then they add 20% gratuity regardless of the number of people in the group (we only had 4) is just ridiculous. This is a one time visit and nothing more than a tourist trap. You can get the same quality pizza at other places. Great pizza but not a good experience. One Star!", "author": "Harvey P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-01", "description": "You have to order a whole pie but each pie is made fresh to order.\n\nI get that this place uses fresh ingredients and the pie is cooked in a brick oven but that does not make a pizza taste good.\n\nThe most important part of the pizza is the basic structure which is the sauce, cheese and the crust.  The sauce taste good and there is plenty of it.  However there is not enough cheese.  More than half of the pizza is missing cheese.  I rather them use enough dry mozzarella than not enough fresh mozzarella.  Also the bottom of the pizza is covered with carbon which just means you eating your way towards cancer.\n\nI just like my pizza covered in cheese instead of mostly sauce but most people seem to like the pizza here.", "author": "Charlie Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "The pizza is soOooo good. Long wait time though- even for a to go order. Oh and bring cash! They don't take cards", "author": "Vanessa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "I've had Grimaldi's twice, once take out and once sitting. The more recent time was dining in on a really nice day. We were seated immediately upstairs near the overlooking window of downstairs. This was my first time to the new location a few doors down. I really liked the improvement in space and light.\n\nI like the laidback atmosphere here. You get more of a server than the typical waiter. It's a pizza spot so they serve drinks and pizza mainly. We ordered the white pizza with pepperoni. All the pizzas come with like basil and mozzarella I think. It was really good pizza and a large is a great size for 2-3 people.\n\nThe only reason it is 4 stars and not 5 is 1, they don't take card (they have an ATM inside but with a $4 charge...seriously???) and that it took FOREVER to come out. I am fine with waiting for food especially with good company but it was an extremely long wait for food.", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-01", "description": "This was my FAVORITE pizza in NY....and I ate a lot of pizza that week. The line was superrrrr long - all the way to the next door pizza shop which we seriously contemplated going to, considering it was drizzling on and off. However, I'm really glad we didn't - the line ended up taking around 30 min.\n\nThe pizza was perfectly soft and crispy and flavorful and the service was excellent. The prices are comparable to all the touristy NY pizza spots - about $30/pie. Being from LA, that is kind of a ridiculous amount to pay for a large pizza, but it was totally worth it. AND they have a location here in LA, yay!", "author": "Sally E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-27", "description": "Amazingly the best!!!! Take notes from this place Pizza Hut , dominos, little Ceasar's, and papa johns!!!! This place is Amazing!!!", "author": "Jesus E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-15", "description": "Ba damn!!! The crazy long line. White people and their carb addiction. No racist here. \n\nMy gf and I decided to spend the late afternoon in nyc. It was a cloudy day. We walked the Brooklyn bridge after we parked the car in Chinaland and ordered take-out from here. \n\nWe ordered a large sausage and a bottle of coke. It took 15 mins for our pie to come out. We ate it in the park adjacent park overlooking the bridge. It was great timing. We finished it before it started to lightly rain. We digested by walking back to the car. \n\nIt was a very good pizza. My gf doesn't like cheese but she agrees that it was a tasty pizza.  I will not wait over 30 mins to get a table inside. It's just pizza people.  \n\nThey don't use a traditional cardboard box. The pizza was on top of a big round thin cardbardish plate and stiffed in a white paper bag. I suppose it saves money and is green of them to do. I think they are being hipster.\n\nI'm more impressed with the original al La Lombardi's", "author": "Chris L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-04", "description": "NOT WORTH YOUR TIME- I went here after someone suggested what an amazing pizza they had here. Service sucks. Pizza is regular. not worth the 35 minute wait for pizza. Not one single waiter checked in on us to see if we needed anything else after we placed our drink order. Everyone around me seemed to be waiting a while for their food. Honestly not worth it. The staff seems so rough around the edges, not people persons at all.", "author": "Lola N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-26", "description": "I rarely ever venture to Brooklyn.  Something amazing or spikes my curiosity would warrant a trip over, and all the good things about Grimaldi's were true!  \n\nAlthough the line is discouraging especially in the warmer weather, it's well worth it if it's your first time! After your first time, you should be smarter and go during non-peak hours.  \n\nDelicious old style fashioned thin crust pizza.  I love to add mushrooms, extra cheese \u0026 sausage.  \n\nMy suggestion is to buy it to go and walk down to the water where you can enjoy Manhattan's sky line lit up at night.  There's also the Brooklyn Ice Cream Factory where you can get some nice old fashioned ice cream.", "author": "Stace C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-19", "description": "Been wanting to try this place for a while considering that it's high on all the tourists' list of must eat in nyc. Wasn't exactly planning to eat at Grimaldi's that night but after walking the Brooklyn bridge with D and saw only 2 ppl in line, we thought hey why the hell not? usually the wait is 2 hrs! We ordered a small margarita pizza which came in 6 slices. The pizza was good but definitely had better at lombardi and john's in West village. Would eat the pizza again if there is no wait but would never ever ever stand in line for 2 hrs for this. Average at best.", "author": "Wing C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-30", "description": "Grimaldis is good, but maybe the people standing on the Julianas line made the better choice...  The pizza is good, but is it really worth standing in a line for 30 minutes when the Julianas line is shorter...", "author": "Michael A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}