{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-06", "description": "Tourist trap/long lines at times - but a great thin pie - i order:  extra tomatoes- garlic \u0026 basil pie..", "author": "Alexander M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-16", "description": "Dough made daily, fresh mozzarella, crushed tomatoes, and whole leaves of basil. All these great ingredients, paired with a brick oven make for one delicious pizza!", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-29", "description": "Maybe you have to be a meat-eater to get the full effect of Grimaldi's but I wasn't all that impressed. That said, I do think this is worth going to for novelty's sake. The line isn't as bad as it looks and it's a good start or end to a brooklyn bridge adventure.", "author": "Jackie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-20", "description": "Okay, it took me some time to get over to this place...having lived in Brooklyn for four years but this was a 40 min ride from my house.  After hearing people rave about this place for years, I made it a point to keep it in mind as a place to visit for the longest...well I finally made it.  What  a disappointment.  They call this pizza.  They call that sauce, it was completely watered down.  Was that cheese -- large white chunks sat on top of that red stuff and I was really bummed out that I couldn't sample the pizza with just one slice since they force you to order a pie.  I did give one point for the restaurant and that point is for venue.  The views in that location are breathtaking.  Go for the views not the pizza.", "author": "Cher S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-14", "description": "The pizza here is obviously great. The staff can be a hit-or-miss. It's a fun \"NYC experience\" but skip the line and go to Juliana's for the best pizza.", "author": "Chris G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-12", "description": "My absolute favorite (non-slice) pizza place in NY.  They're consistent across the board, been to the one in Garden City and it was just as good.  Fresh ingredients, a crust that is the perfect consistency of chewy and crispy, and it's huge (I so rarely am able to finish a pie).  The antipasto--UM YUM?!?!?  I took my family here when they were visiting and a friend when she wanted to walk over the Brooklyn bridge, they were all in agreement--best pizza ever.  I keep it simple, just ham and maybe a vegetable or two on there.  My family had different pizzas some complicated and everyone was just in heaven.  Definitely give it a shot.  It's not a slice-type place though but you will not be disappointed.  Trust.", "author": "Kris P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-26", "description": "I'm not going to lie...I heard that Grimaldi's is the best pizza in NY.  Sad to say, I'm a bit disappointed.  Yes, it was good pizza but the best?  I'm not so sure.  Not to say that my friend and I didn't finish the entire pie of Mozzarella and Basil (medium sized), but somehow I was left unsatisfied at the end.  Maybe it was an off-night?  Or maybe my search for the best slice continues.  Either way, if you've never been to Grimaldi's and see no line outside, go and give it a whirl.  Prove me wrong.", "author": "Yosh H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-12", "description": "Second time here, first review. I am hesitant to write a good review because I hate the line so much. Really makes it difficult to show my touristy friends good pizza. Get there early as hell. Know what you want to order and do the damn thing. Delicious pizza, but eat it already so I can get in.", "author": "Scott L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-07", "description": "Pizza!\n\nI've heard the raving about this place, and everyone says it is the BEST pizza in New York.  Being a NYer for all my life, and knowing that 'best' is really a subjective point of view.  I decided to trek here after checking out the NYC Waterfalls display to see if it was really the 'best' pizza in NYC.\n\nSo what's the verdict?  I can't say it's the best pizza in NYC, as I said before, it is subjective to what is the best anyway, but it is really good pizza, if you are looking for coal oven style like Lombardi's.  If you are looking for NY slices, don't come here.  Their topping options are less compared to Lombardi's, but it's all you need anyway, we got sausage, mushrooms and onions.  Price is $12 for a small 16\" pie, and $14 for a large 18\" pie.  Toppings are $2 each.  Drinks are bottle sodas for $2 each, and they have beer and wine.  The crust that holds up the main portion of the pie isn't crisp like Lombardi's, a little soggy, but it is still good.  However, I did like the crust ends.  You can taste more of the mozzerella cheese on the Grimaldi pie vs the Lombardi pie.  I do like their sauce, it's a little sweet.  Unfortunately, they don't have anything else other than antipasto on the menu.  As Lombardi's has some salad options.  But are you coming here for the side orders or for the pizza, right?\n\nSeating is pretty tight, as they really pack you in there.  It is best to go early when they open, because there is not much of a line, but once it hits lunchtime, it's crazy long.  It is worth the trip without waiting on line to get into the restaurant to eat.  I personally would never wait on a long line for ANY food.", "author": "John W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-02", "description": "NO SLICES! So this is the OG one. I hear there is a Hoboken one as well. Came here on Labor Day @ 1pm. Roughly a 40min wait for 2ppl. There were about 50 people ahead of us. A gentleman with white hair takes care of takeout and sit in dining (same line). Water inside an orange Gatorade cooler is provided for customers. Pricing is $12 for a 16\" pie and $14 for an 18\" pie. Toppings are additional. No pictures were allowed in the prep area but I did indeed see coal inside a brick oven. I noticed that they cut the small pies into 6 slices and the large pies into 8 slices. I asked for marinara sauce on the side. They were generous enough to put a lot in a cup and they didn't charge me for it. My only gripe is that sometimes the bottom of the pie gets black and tastes bitter (MINUS ONE STAR). I heard that stuff gives you cancer. You are allowed to doggy bag your leftovers. I definitely have to try DiFara now!\n\nOrdered:\n18\" Large ($14) White (+2) pie [with basil (+2), pepperoni (+2)] - pepperoni was a huge standout, ppl were right about the thick slices, it curled up on the sides and was delish!, basil came out a bit burnt, but am glad I got the white pie (no tomato sauce). We took 2 slices home.\n\nTotal came out to $12.50/pp after everything.\n\npics: http://www.meetup.com/teamfoodie/photos/429319", "author": "Jeff C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-08-19", "description": "What's all the hype about this pizza place being the BEST in Brooklyn or even NY?  Absolutely they are not, I went here yesterday on a beautiful sunny Saturday afternoon and was greeted by the Italian guy with the button down shirt, \"Mr. Grimaldi\" I'll call him.  He made sure that everyone stayed in a nicely formed line and asked for the amount of each party.  So I knew there would be a line, knew I would have to wait, but hey its Pizza and supposed to be the best pizza.  So we waited, funny how the people around us where all from out-of-town.  So that is why this place is rated so highly....it is the \"TOURIST TRAP\" and of course these Mid-Westers would think this is the best Pizza ever, it has no decor, it has attitude and come on it has better pizza then their Pizza places, but for me living in the ultimate Italian area of Brooklyn, \"Dyker Heights\" and have feasted on incredible crispy thin delicious pizza before...Grimaldi's fell short of a true disappointment.\n\nWhen you finally get in, the place is crowded, they jam people in and they do not offer any slices and if you want take-out you would have had to wait in the same line as the one for a table.  We sat down and were greeted by the waiter with the Brooklyn attitude.  We ordered a plain cheese pie, the classic if you will.  It came out, it looked decent but tasting it....NOPE it was no way near the Best.  It wasn't crispy but doughy and chewy.  Also we asked for hot pepper flakes and parm cheese....got more attitude again.  We were surrounded by out-of-towners, talking their smack about NY and probably thinking how cool this place was and how they can't wait to go back to their hometown and write up their review on the NY well-known tourist filled Pizza place with the huge long line and Brooklyn attitude.\n\nSo we ate it, sauce was too sweet and slathered on....we all came to the conclusion....ZAGAT got it wrong....some people on YELP got it wrong and you know what...you want great PIZZA....\"Mona Lisa Cafe or Bella Luna in Dyker Heights.....has the best damn pizza and its right down the street from me.  Grimaldi's has a great business and I\"m sure all the Pizza places wish they had people who would be willing to wait a half hour or more on a long ridiculous line, but you know what I wanted amazing, I wanted jaw dropping Pizza goodness and all I got was pizza that was better than the Mid-West parlors.", "author": "steph d."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-22", "description": "Totally over-rated and NOT worth the wait, the crowd, and the soggy crappy pizza.", "author": "Meg L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-05", "description": "One of the best pizza I've ever had! I definitely going to come back again next summer! The service was good. The place was kind of small but the atmosphere not awkward so i liked that. Anyways, all that matters was what i came for. So delicious!", "author": "Sonnet S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-28", "description": "On a nice summer day, I can think of few other places I'd rather have lunch. I stroll through Brooklyn Heights with my buddies, get on what is always a long, but fun line for conversation and horsing around, take turns playing frisbee as we wait, and once we get in, its satisfying cold beers all around and of course, the best pizza in Brooklyn. I can't describe it as anything other than just a feeling of being at home. You sit down, packed in with all the other customers around you like you're all family, and you just feel comfortable. Comforted by good company and an ice cold, thick Brooklyn lager in one hand, and a perfectly baked brick oven slice with melting cheese and mouth watering toppings in the other. After, drag your satisfied now-fat-ass over to the pier to digest with an ice cream cone and a serene view of the Brooklyn Bridge and Manhattan. Sigh....", "author": "andrew c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-26", "description": "I've been living in the city for over 10 years, and I've tasted A LOT of pizza, and hands down this is the best pizza I've had outside of Napoli.  Thin crust, fresh ingredients, in a  very simple italian dining room bustling with psyched hungry pizza heads.  Service is brisk, but who cares?  You are there for the food!  I haven't eaten much else here besides the pizza. ( I save the italian dishes for when I visit mom ) Its not that hard to find this place...and its in a nice neighborhood (Dumbo/Bklyn Hts area).  Nice view of the Bklyn Bridge too.  If you haven't yet, GO!", "author": "Linda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-24", "description": "if you like Patsy's you'll like it here. the wait was pretty long..almost felt like a bathroom line. still, i walked out with my belly full of pepperoni pizza made from fresh ingredients, and the biggest grin on my face you'd think i just crapped money. (sorry, i dont know how else to describe it)\n\ni wouldn't say large groups a good idea, groups of 2's and 3's get in a lot faster than say...seven..if you don't have the patience to enjoy this historic pizzeria, then scat and give those who do more room to eat! \n\ngreat service, great food, great fun.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-01", "description": "the boyfriend told me he found this place doing a google search for \"best pizza in new york.\"  i was heartened.  disheartening, however, was the LINE. 5'oclock on a Tuesday and we had to wait for 40 minutes?  in the rain? seriously.  \n\nbut, the pie was excellent and huge.  carafe of wine is cheap and decent.  you're squished into a tight table, but it's great for making friends.\n\ni'd definitely go back.", "author": "Mag M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-01", "description": "Garlic pie.  Amazing.  Don't wait in line to sit in, order it to go, get it in ten minutes, and ENJOY!!", "author": "Emily M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-07", "description": "Not as good as everyone is saying..... Good yes, but not WOW, and certainly not worth the wait in line and travel time it took to get there.", "author": "Benjamin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-16", "description": "Took me a while to find this place but it was definitely worth it when I did.  The place had a long line to get in but was very ordely and efficient in the matter that they conducted us in.  The service was very quick and the pizza was absolutely amazing.  The reason this place has such good pizza is that it has a brick oven to cook the pizza.  Most NYC pizza places are not allowed to use this type of oven for health code reasons anymore though some have been grandfathered in (i.e. Lombardi's) but those ovens are the key to making really great pizza since conventional ovens can't heat pizzas the the extreme temperatures needed to give them the crispiness and flavor that so many people rave about.  Just stop reading and check this place out for yourself.  Quick service and great pizza.", "author": "Aaron S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}