{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-06", "description": "Mouth-watering.  Words.  Words are false signifiers. Words serve a false god.   There was eating.  Furious eating.  And then it was over and we remembered our mortality.", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-17", "description": "Grimaldi's pizza is one of my favorite pizzas that I have ever had in New York City as well as in the United States.  My girlfriend and I arrived 15 minutes early as we read many reviews of long lines or long waits to eat here.  After waiting for the door to open, a charter bus pulled up and loads of people rushed into the door as Grimaldi's seated those 70 people first.  Fortunately, we were able to get seated within a few minutes after.  We were sat at a table that was pushed against another table in which two other people were seated next to us.  I am not a big fan of having other people close to me while I dine as I enjoy some privacy but this wasn't too bad as the pizza was very exciting to eat there.  So if you go early enough, there shouldn't be a 2 hour wait.  We also noticed there was no long line behind us or when we left, so maybe it is on a specific day of the week or time of the day in which the long lines occur, probably tourist season.  The cannoli was also big and very good.  Overall, this was a great pizza experience and is definitely worth visiting when you visit New York City.", "author": "Jay G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-04", "description": "Amazing. I consistently eat an entire pizza to myself every time I'm there.", "author": "Brooklyn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-05", "description": "Despite the lines, this is my favorite pizza place. I'm not a big fan of pizza, but I like the texture of the crust. Yesterday they burnt it slightly that even the crust was charred, but I still gave them 5 stars because it was always consistently perfect before then. \n\nI personally like the pepperoni topping and olives. The olives are not canned (they're the Niçoise kind). Lombardi's is close, but Grimaldi's wins. However, if you like mushroom toppings, then I would suggest going to Lombardi's (they use various mushrooms -- i.e. oyster mushrooms).\n\nIt's perfect after a walk over Brooklyn Bridge.\n\nBe careful, CASH only.", "author": "A H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-21", "description": "The pizza is absolutely delicious,  I love the salt water taste of the crust and the delicious cheese and basil of their pizza.\n\nYou have to wait ouside for a table to open up and you better be ready when you are called or you will be skipped.  Once inside you sit next to strangers who are also falling in love with this delicious pizza.\n\nI  know a lot of people don't like that you have to wait outside on the sidewalk for a seat to open up, but it's a true New York experience with all it's harshness, including a shove in the back as you enter the door.  LOL.   \n\nI love this place and make it a point to go everytime i'm in the city.", "author": "Lee C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-17", "description": "Grimaldi's is the Best Pizza I've every had. My wife and I have driven the 3 hour one way trip just to get this Pizza. It's that good !", "author": "Dave C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-04", "description": "The pizza is mediocre and the doorman is a huge douche! He tries to get you out in 45 minutes. This place is all hype, as evidenced by the number of tourists.\n\nCaveat emptor!", "author": "W. L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-25", "description": "The pizza from Grimaldi's is delicious!  On my birthday last year, I got two pies and sat out in Brooklyn Bridge Park with friends on a beautiful summer day.\n\nI was (luckily) able to get through on the phone and order my pizzas.  I waltzed past the entire very long line and picked up my pizzas with no wait.  I would DEFINITELY recommend trying to call your order in before going if you don't want to wait in line.\n\n(And the neighborhood around there is so adorable!)", "author": "liz l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-17", "description": "I read somewhere that this place has good reviews and I walked by it with my husband and decided to drop in.  Being from New York and Italian I have high standards for Italian food.  To make a long story short, this is my new go-to place.", "author": "Ann L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-05", "description": "The pizza was good. Very good. There is a reason they are famous. I have nothing much to add to it. So I'll just say this: minus one star for not pouring me water - trying to MAKE you buy a drink. If you want water, you have to buy bottled water, oh and outside food and drinks not allowed.", "author": "Jane H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-13", "description": "The line was a bit long but it moved pretty fast. It wasn't that hard to get a table because there were only two of us. I thought the \"small\" pizza was HUGE and definitely more than enough for two people! My boyfriend and I overdid it on the toppings but it was still AMAZING. The cheeeeese was my favorite part. Oh man, deliciousness. I definitely recommend this place to try out!", "author": "Hwan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-15", "description": "What can I say?  Best pizza in Brooklyn.  It's Grimaldi's vs. Di Fara's.  Tie for first place.  Native New Yorkers and tourists will agree this may be the best pizza ever made on the planet.  Period. End of story. Nothing else to say.  Oh yeah, be ready to wait on a long line.  The line is out the door and around the corner ALWAYS.  Because yes it is that good.", "author": "Patrick B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-21", "description": "This place came recommended by other friends who have discovered it a few months ago. When we went on a Sunday evening the line was long and we did wait for an hour!\n\nThe 3 stars is because the doorman was grumpy and the staff not 'fantastic' and I did think it unfair that take-away people had to wait in the same line. But the pizza if 5 stars in my book and worth the wait!", "author": "Emma J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-13", "description": "Amazing pizza and calzones. Just make sure to put something in the calzone. Just the cheese is bland. Great overall and good service despite being packed with people. They seemed like they generally cared for you like you were their guests and Grimaldi himself was seating people.", "author": "Cole P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-17", "description": "This was supposed to be \"the best pizza in NYC\" according to about everyone I talked to while I was there. So when my friend suggested we should go, I definitely was down to try it. It's located in Brooklyn and when we got there it was already pretty late, but the line was still ridiculously long. We waited for over an hour to get inside, and when we got there we ordered a pizza to share. They don't sell by the slice, only by whole pies. It was definitely good pizza, but the best? I don't know...", "author": "Jenna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "Great pizza,it never disappoints! But I live in Brooklyn and know when to go and not deal with the long lines... If I was a tourist in NY, where you can find many amazing pizza places, I would not stand in line for an hour for it.", "author": "Katy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-13", "description": "Ok ok, we broke down and did the tourist thing...since our wait was *only* about 20 minutes, I'd say it was totally worth it. Their service is nothing mentionable, but sort of adds to the experience- they know how great the pizza is, so no need to make a big show of hospitality.\n\nWe got a regular cheese pizza with pepperoni, and it was delicious every bite of the way. Great sauce, fresh mozzarella, and just enough burnt spots to be yummy without overpowering the delicate dough flavor.\n\nWhile it may not be life-changing (we still have yet to get over to Lucali, but Lombardis is comparable to this), its a fun time that you need to do at LEAST once. So break down and be a tourist. :)", "author": "Sara O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-09", "description": "Grimaldi's is food porn. \n\nI literally experience a physical reaction when I think about their pizza- sweaty palms, salivating mouth, a flush of warmness throughout the body. \n\nThe cheapest and least self-destructive night of pleasure possible in Brooklyn.", "author": "Pamela W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-28", "description": "My first NYC pizza experience and it did not disappoint.  We waited in line for less than 30 minutes and in addition to amazing pizza the service was also great.  Our waiters were hilarious and old man that I'm guessing is the owner (?) was really friendly and attentive.  It doesn't hurt that we're five girls but still the service was great.\n\nWe had the traditional pizza and a pepperoni and mushroom pizza.  And we ate every last slice.  The other great thing is  the festive, homey and fun atmosphere in the restaurant.  It really makes the experience that much better.  We finished it off with a couple of cannoli's and they were literally the best cannolis any of us had ever had.  The filling was sweater and not creamier and the shell was light and crisp.  Everything was delicious.\n\nThe only weird thing was the couple next to us with the crying guy.  You're at Grimaldi's eating pizza, what's there to cry about?", "author": "Kanishka K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-03", "description": "This place makes me lose my shit.\n\nI haven't been in a few years, but this is the best traditional thin-crust pizza (Cheeseboard in Berkeley might win for best newfangled bourgie-pizza).  Grimaldi's is the pizza against which all other pizzas are measured. *Drool*\n\nPerhaps an anecdote can help show how good I think this pizza is: A few years back I was visiting friends and staying in Harlem.  I caught a nasty case of strep and a double ear infection (yuck!).  I didn't really want to go anywhere or do anything.  But since it was my last night in New York, I dragged myself onto a subway train and wandered the streets of Brooklyn in miserable January weather just to get this pizza.\n\nEven though it killed my swollen tonsils to swallow, it was worth every painful bite.", "author": "Mike H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}