{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-29", "description": "Like an inbred duke reining over an Italian fiefdom of Brooklyn pizza, Grimaldi's has lost its way. Its power will fade and a joint with a much better pie and atmosphere will chop off its ugly head and relegate it to the Frommer's guidebooks of history.\n\nI recall years ago that the pizza was delicious enough to overlook the insipid service by rude Russian waiters. Whether the pie has just decayed in quality that much or the rough Brooklyn goomba quality simply lost any charm in comparison to better pizza at places found around the city, Grimaldi's now officially sucks.", "author": "Peter R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-15", "description": "I'm giving this place three stars because I live in New York and I've tried many pizza places. It was good but not worth standing on a long line for. There's always a line halfway down the block here. Tonight we were lucky there was no wait so we figured we would try it. My boyfriend and I just got the large fresh mozzarella pie. It was nothing to do backflips about. It was very good and affordable. 14 dollars for a large pie is reasonable. I would come back if there is ever a time when there isn't a line. But deff not worth a wait.", "author": "Lucia C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-15", "description": "I drove to the city with a group of friends for a weekend trip. One friend in particular was searching for highest food-rated places every where we went; Grimadi's was one of them. It was a Sunday right before we were headed back home, and we decide to check it out. While driving past, we notice the line is about 2 blocks long.......... at least. I didn't care to go because I was famished but everyone else was all about it, so I stopped anyway. Call me nice or what?!\n\nThere was no parking, some shady guy came up to my car and said he was valet. I asked how much and he told me $15.00. Hesitant, I paid. Luckily I ended up getting my car back - hours later.\n\nWe waited in line for 1.5 hours, timed. And while we were next in line to be served with their heavenly pizza, people behind were going in before us because we had to wait for a table of 5 to open up. \n\nWe walk in, place is completely swarmed with people. Uncomfortable seating. Eventually, get our food.. expecting to taste nothing else like it, and turned out to be the greatest disappointment. Papa John's over Grimaldi's. I'll never go back there again. I guess other people think differently since they're willing to wait in a crazy line.. But, I saw/tasted nothing fantastic.\n\nThe experience wasn't even good, it was warm, you get miserable and impatient. It makes you re-think why the hell you're standing in line? Inside wasn't what I expected it to look like. Noisey and crowded. Next time I wait in a 1.5 hour line for pizza, I expect to be carried to my seat within a private room to enjoy my food peacefully.\n\nAnd FYI, you can't order out (per door sign), you MUST stand in line.", "author": "Nina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-28", "description": "I've luckily never had to stand in line for this place despite tales of the long wait times. Both visits I just walked right in and was immediately seated. \n\nOn my first visit I got a pizza with sundried tomatoes, which was pretty tasty but honestly didn't blow my mind. I decided to go back recently and got a large pizza with pepperoni, sausage and mushroom. \n\nLet's just say I get what all the hype is about now. The pizza is very, very good. Definitely planning on making a third trip sometime soon.", "author": "Tequan W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-08", "description": "I stopped by here yesterday at around 3:40 because my friends and I were hungry and had quite some time to kill.\n\nThe line didn't seem too long when we arrived. There were maybe a good 20 to 30 people in front of us. The line was moving along quickly and every once in a while, a guy would come out and keep a tally of the number of seats needed. Eventually, my friends and I got to the front. We were the second group on the line, hopeful that we were going to be called any minute now, BUT... they started calling two people at a time and people in the back ended up getting a table before us. It was to the point where my friend wanted to ditch us in order to get a table, hahaha.\n\nWe got a table at around 4:40 and we ordered the 16\" pizza with mushrooms and pepperoni. It arrived at around 5:05 and at that point, I was just starving so I digged right in. I must admit--it was a unique experience, but it surely wasn't the best I've had. It was the first time I used a knife to cut my pizza. The crust was giving me a particularly difficult time and it was difficult to chew. I liked the mushroom and pepperoni, but overall I felt like the pizza lacked flavor. It needed a bit more tomato sauce in it.\n\nOverall, I give my experience at Grimaldi's a 3/5.", "author": "Allison N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "For people trying to reconcile the 5 star ratings with the 1/2 stars: I honestly think this is a function of the topping combinations.  After having eaten at Grimaldi's over the past 6 years, I've definitely found some combinations to be vastly superior to others.  Objectively, the dough/cheese/basil/sauce combination makes Grimaldi's special.  From that point on, your mileage may vary depending on topping choice (also of high quality).  Get the oven-roasted sweet peppers, pepperoni, and mushroom and you will NOT be disappointed.", "author": "Dan C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-16", "description": "Grimaldi's is completely and utterly OVERRATED. New Yorkers can get way better pizza, with much better service, and at cheaper prices. Why anyone would subjugate themselves to the torture of waiting on a line - for a ridiculous amount of time - for mediocre pizza (repeatedly) is beyond me. \n\nThis place is overhyped and is more of a touristy spot. They're also conveniently placed in an area that lacks in food choices. Hooray for shake shack opening up! But honestly, it's definitely not worth the money. It also doesn't help when service is rude and  the man curses out your party. Not worth it and completely don't recommend.", "author": "Eri Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-01", "description": "If you make it, they will come! And yes, this place has definitely put themselves on the map and has made it to super stardom when it comes to their infamous pizza. Local and tourists alike all pay their respect by standing on a ridiculously long waiting line just to sample a morsel of their acclaimed pizza. Not only is it affordable, it also delivers when it comes to taste, presentation and most importantly, QUALITY!!!\n\nWhen I finally sink my teeth into Grimaldi's pizza, my first thought was, damn, this is not your typical comer store wanna-be pizza. Instead, it tasted like the real deal. \n\nTo further bring my point across, you know when people ask you how do you know if you're in love and you tell them you just do...well I have something to tell you sweetheart, that this was definitely love at the very first BITE!!!!", "author": "Nga C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-01", "description": "I came here with 2 good friends of mine on  a Thursday cold night. There's no line at all. The place is situated few walks in the park under the Brooklyn Bridge. They make the pizza fresh. It's a great place to be with family and catch up with friends..", "author": "Beatrice P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-25", "description": "Great pizza...\nI love the amount of cheese they use!\nthe line is always long so be prepared to wait!!\nBut I assure you it will be worth the time spent in line!!", "author": "Patrick O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-11", "description": "Met up with a couple friends to stop by Grimaldi's for some of their famous pizza. We lined up before they opened, but still had to wait in line for 45 minutes to get a table. \n\nRight before we were to be seated, we indirectly had an unfortunate experience with one of the servers. While he was impatiently trying to get everyone in line to step off the main steps, he made a callous racial comment to the party in front of us which I personally felt offended by. While I try to base my ratings solely on food and service, this was one detail I couldn't overlook.\n\nAfter being seated, we ordered a sausage and mushroom pizza. While waiting for the food, we walked around the place, partly because the walls had some interesting pictures, partly because it was extremely hot and stuffy at our corner table. About 15 minutes later, our pizza came and we chowed down. My favorite parts of the pizza were definitely the sausage and the cheese. The sausage was very tasty, fresh, and thankfully not too salty. The cheese had the perfect consistency between stringy and hearty. I also appreciated the thin crust, crispy and not too hard.\n\nWe ordered a second pizza once we realized one wasn't enough and decided to go with the sausage again. However, as other reviewers have mentioned, our server didn't stop by our table again without being asked for. I had to ask for my water to be refilled 4 times and we had to try and get the server's attention for almost 5 minutes when ordering the second pie.\n\nOverall, it was a definitely something checked off the tourist list but nothing more. While not as expensive as I expected, the service was awful and the incident on the steps was just not right. While I'm still getting used to the city, I'm positive you'll be able to find a place for pizza with better food and better service.", "author": "Ben W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "Classic although if I have to be honest, I do think this place has gone down a bit.  Still very different than all the chains around the country / they claim it's the water.  Whatever it is it is better.  Just simple pepperoni or margherita is the way to go.", "author": "Eric A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-30", "description": "I went here about 10 years ago and it really was the best slice I've ever had.. just went back again and my wife and I were really dissapointed. I'm not sure if it's the new over (since they moved) but I remember when the cheese and sauce were almost melted together and the sauce was really good. It's just not the same as it used to be, next time we're going next door to Juliana's where it looks like they left the quality..", "author": "Brendan F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-10", "description": "Ordered a large traditional pie ($14) and added fresh garlic ($2). Three of us split the pizza and we certainly could have ordered more! The crust was light, crisp, and super tasty. The sauce was simple San Marzano tomatoes topped with salty and fresh mozzarella and basil. It was heaven.\n\nWe each ordered a bottle of Pellegrino for $3. I was expecting a normal sized bottle for that price, but it was probably half a pint. Disappointed on that one. Also, the liquor license is pending so you can't order beer or wine.\n\nWe were going to a Nets game and wanted to eat dinner beforehand. We showed up at Grimaldi's around 4:30/4:45 pm on a Monday and didn't have to wait at all. Everyone who works there is friendly and was laughing around with us the whole time. I can't wait to go back.", "author": "Rachael F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-19", "description": "A must stop visiting NY.. what could be better than having pizza at Grimaldi's under the Brooklyn Bridge!!", "author": "Rancho T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-09", "description": "Friends and I were visiting Brooklyn for the first time and were suggested to come here. As we walked to the restaurant we headed inside to see about placing our names on list but were rudely yelled at by a strange man by the door asking if we are going to eat. We said yes and he asked us condescendingly \"Can't you see the line?\" We understood that there was a line, but as tourists how were we suppose to know whether that line was intended to put a name on a seating list, to wait for our table, or to get tickets for The Rolling Stones?! Realized that the guy was apparently the door man that worked there and were utterly turned off from the place before we were even ALLOWED to step foot inside. \n\nPeople walked by and told us to just go next door to the other restaurant and so we did, even though the line was just as long, but at least we didn't have to worry about being yelled at for asking for water at the table.", "author": "Chuck M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-15", "description": "People come here thinking they are coming for the best pizza but honestly there  is another pizza shop on the block that is much better and friendly. This place literally has rude customer service and not edible pizza because I found hair in it! After finding the hair they did not compensate me nor give me  a new pie they acted  as if it was normal. THAT IS DISGUSTING. Please do yourself a favor and do not eat here.", "author": "Rokeya B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-15", "description": "For 6 months, before I moved to Brooklyn, I was assured by a friend that this place would blow my mind and was the #1 place I needed to visit in NYC.  So I waited an hour in line to enter this place, when I did arrive, and it was just very mediocre.  My crust was blackened and was so thin the pizza seemed fairly inexistent.  The sauce was good.  The cheese was spare.  Very blah.\n\nI've always been more taken by Artichoke Pizza or Patsy's or Fornino's or Vito's (in Williamsburg, Brooklyn)", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-15", "description": "We came here around 5pm on a Tuesday and were surprised to see that there were no lines.  I had high expectations from Yelp reviews and have to say these were not met.\n\nFood was decent, definitely not bad but not that great either. I like the crust but thought seasoning was lacking and have had better brick oven pizza elsewhere. Was bland overall.\n\nService was horrible. Even though it was not busy (there were empty tables, and we didn't wait to be seated) the servers hardly talked to us and when I asked for something did not even say yes or sure to acknowledge that he had heard me.\n\nAtmosphere was also not very great. It is a family restaurant style decor and the TV was on really loud. I guess it was the world cup so they wanted to watch it. I would skip Grimaldis on your visit to NYC.", "author": "Ali K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-02", "description": "Service:\nCame in to enjoy a meal with a friend. Ordered just a single pie with some toppings. Amazingly we were seated and eating within 10 minutes of entrance. Before the new restaurant, the line used to twist around the block, now its just a few feet next to the old place, which is also a pizzeria. \n\nNo credit cards. ONLY CASH. $4.50 ATM FEE. \nNo beer. \n\nBusy place, wrong orders can occur. \n\nPoor guest appreciation (old place had a brighter attitude), however, if compared to Totonno's, well then G's got best customer service. The servers are very respectful and attentive. \n\n\nFood:\nThe food is good regardless of the customer service. This is why I am giving this place a 4 star rating. This place moves a lot of traffic so the circulation of fresh ingredients is accurate. \n\nSetting:\nAwesome romantic setting, while you sitting next to almost 50 people.  \n\nOld Rating:\n\"One of the coolest and tastiest joints in Brooklyn. Limited seating but its worth the wait. A great place for a first date. I bake pizza and can vouch for their sauce and dough. Sometimes the pizza is slightly burnt but you can always ask to make sure that its not. Service is busy but precise. \"", "author": "Eve K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}