{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-25", "description": "It is a tourist trap. The pizza is just okay, nothing to write home about. Don't believe all the hype. There are so many other pizza places out there that offer better quality/ingredients for much cheaper. Will not be returning.", "author": "Mariya P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-02", "description": "I have to start off by saying the food was amazing and I would have given this place 5 stars if my first experience with Grimaldi's didn't begin with Ralph, the host (I guess). \nWhen we arrived he was on his phone so we didn't know we had to wait outside to be seated. He eventually got off the phone and as we began to walk in the restaurant, he started yelling that \"there is a big sign that says wait to be seated\". We apologized for the oversight, however he went on and on about the sign (ugh). Had my first experience been with a rational employee this review would have been glowing but it wasn't. Ralph was rude, condescending, aggressive, and mean. I would recommend dinning here, just not while Ralph is at the door.", "author": "Maurice M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "I had to stop in and get some NY pizza while I was in Brooklyn and Grimaldi's fit the bill. The white pizza was the perfect blend of garlic and cheese and the crust was cooked perfectly. It was pretty busy around noon on a Monday, but we were seated immediately.", "author": "Jeff K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-11", "description": "We originally planned on having Pizza at Juliana's after our trek across the Brooklyn Bridge.  The line at Grimaldi's was significantly shorter and we were short on time, sooooo we settled. The wait to be seated was fairly short. The bouncer dude at the door kept the one moving and prevented others from trying to sneak in past the line. We were seated upstairs and a server greeted us immediately. The wait for the pizza was longer than anticipated though.\n\nOur pizza was served lukewarm. The flavor was average at best and the toppings slid off the pie. Yes, I'm the type that uses a knife and fork. The sauce, cheese, meatballs, all slid off the dough as I cut. While the bottom of the pie was nice and toasty the rest was pretty soggy. Kind of hard to explain. Not the worst pizza ever, but not the best as I was led to believe.\n\nNote: They do not sell slices. We initially just wanted to try a slice to go, but you don't have that option. Also, they take Cash only.", "author": "Lissete D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-29", "description": "Don't stop here for a couple slices to go, Waste of time.  You Are required to order an entire pie and furthermore you have to pay in cash.  These guys are way too strict about how they want people to consume their pizza.  I'll pass.", "author": "Joe C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-03", "description": "Nothing special. Not that good, not that clean, not that tasty... not sure what is all the hype is all about... Bad service", "author": "Ilona S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-16", "description": "I visited New York and I wanted good pizza. Someone recommended Grimaldi's which I decided to try. I would not go there again. The guy by the door was something which I will not type. I understand Grimaldi's needed someone to usher customers in, but I did not expect a bouncer at a pizza place that did not serve alcohol or accept any thing other than cash. Pizza was good but the experience was not worth it. I wish I knew about Juiliana's ahead of time. I would have gone there.", "author": "Krys J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-15", "description": "The original plan was to go to Juliana's but some locals recommended Grimaldi's so we gave it a shot. Service was good, everyone was friendly. Not the cleanest place but it'll do. The \"small\" pizza was huge and we couldn't finish it. We got pepperoni, mushrooms, and olives. Really liked the pizza. Heads up, it's cash only.", "author": "Karine K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-26", "description": "I have been here twice before. I live in Atlanta Georgia, and visit grandma days when I come to New York.  The pizza is incredible, the atmosphere is unique, it's a beautiful walk across the Brooklyn Bridge. I have been here now for one hour waiting on my food. They no longer sell liquor. They explained they have 47 tables and one oven. The gentleman walking around/AKA manager, did not seem to take our concerns seriously. Unfortunately, will be my last visit.  What a shame that Service has become so poor here.", "author": "Loriann T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-06", "description": "Pizza is ok. If you can withstand eating In 10F temperature. The old guy I assume is the owner won't turn on the heat. It's just as cold inside as it is outside in January Brooklyn weather. It's horrific.", "author": "Emilio D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "The menu is simple and easy to get to the point on how you want your pizza. They simplified the whole dining process - paper plates, plastic forks and knives, plastic cups. Yet you won't mid. WHY? The pizzas are GOOD. When the pizzas are good, you eat with hands. Don't be scared of the long lines in front of their building. Because of the simplified dining experience, you will be seated sooner than you think.", "author": "Doris Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "DELICIOUS! Pizzas are so simple but so good. They don't mess with a good thing. Touristy but for good reason- the food is great! Good prices. Don't be discouraged by the line! The wait is never that long and this pizza is worth it! Try going when the weather is bad to beat the crowd.", "author": "Anna B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-01", "description": "Another sit-down pizzeria in New York aimed at tourists that don't know any better. If you're in the area and craving a sit-down pizza, go to Juliana's next door for better (albeit still not anything special) pizza. \n\nToo much cheese for my taste on this pie. One of my pizza pet peeves is when pizzerias do not layer cheese and sauce and instead put sauce where there is no cheese, and vice versa. They tried to compensate a little by adding some sauce on top of the cheese, but overall, you're going to have to work to get an even bite of sauce and cheese. \n\nFrozen basil. With the turnover of this place, they have no excuse to sacrifice the taste. Dough is very basic, not very crunchy and not very chewy. I did not bother eating the crust because it was extremely bland. And the sauce was lackluster as well. Overall, a very boring pizza that doesn't deserve the extreme hype.", "author": "Olivia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "Top notch pizza for a popular place that still makes quality slices with reasonable prices. The line is a bit long on the weekends and can take like 30-40 minutes depending on when you arrive but still worth it", "author": "Akash V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "Their pizza was definitely something You don't normally find in cali but I think I was expecting a little bit more in taste.\n\nDon't get me wrong it was still delicious but I just had a different expectation.\n\nIt's so popular so lines are out the door and the wait time might be anywhere from 30 minutes to an hour but I think as a tourist, it's definitely a must visit.", "author": "Jasmine O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "We came here on a rainy day on the last leg of our trip.  The wait wasn't terrible because of the poor weather- score!  However, there was a large group waiting outside of the restaurant when we arrived .  We didn't know it was just one big group and stood behind them for about 15-20 minutes.  I finally went in and asked the host if we had to sign in.  They seated us immediately!  After I went in to ask, other people that were waiting went to sign in and was seated shortly after us.  Shame on me for not asking sooner.  Shame on them for not having the courtesy to tell everyone waiting in the rain to sign in!  At least put out a sign or something.  Sheesh. \n\nFor three people, we got a large pizza ($16) with italian sausage ($2).  Lots of toppings to choose from and they range between $2-$5.  It took awhile for the pizza to come out but it was so delicious when it did!  Thinly sliced pizza with lots of ooey gooey mozzarella, delicious \"famous pizza sauce\" and basil!  I wish there was more basil... some pieces were crispy!  I liked how it's not super salty and the crust wasn't too thick/thin.  Amazing prices for the quality!  You can watch them make the pizza at the front of the restaurant.  They use really simple and fresh ingredients.  My favorite pizza joint in NYC at the moment.", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-12", "description": "Stopped in at Grimaldi's while on the Brooklyn Pizza Tour. The thin crust pizza was absolutely delicious. I would say it is my favorite of the pizzas we tasted while on the tour. Be sure to arrive early because a line forms outside. If you take the BPT then you get \"fast passes\" to avoid the line.", "author": "Brandon P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-15", "description": "1.seated quickly and served pretty promptly on a Wednesday night\n2.no nonsense menu, easy to order and go\n3.cash only and no slices, only pies\n4.fresh mozzarella is amazing here, jalapeños are seriously spicy \n5.$3 for a bottle of soda? wtf!\n6. Great pie of pizza, not the best I've ever had but still def top ten\n7. Great location in Brooklyn \n8. First slice was better than the last, eat it while it's fresh and hot that's when it's the best\n\nWhile the pizza was a four star for me what we encountered as we were waiting to be seated deserves a mention as it was a five star humbling occurrence-there was a homeless man in tethered clothing standing right at the entrance while we were waiting there and a worker from Grimaldi came out gave him a free clean t shirt, asked if he needed to use the bathroom and if he wanted a slice on the house...that shows true character.", "author": "Talha A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-10", "description": "I can truthfully say this was the best pizza I have ever had. Walked the Brooklyn bridge in the rain with my wife to get here. We received great service. We had a large Pepperoni and Sausage pizza, I couldn't believe my wife ate half a pizza, she usually has a slice or two, but it wasn't the case this time lol. I loved the way the pizza looked and the basil on top gave it a unique taste. Now that I'm home in Cali I don't want to have any pizza that won't measure up to what I had. My next trip to New York will be ack here for pizza!", "author": "Art S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-06", "description": "My family was in town this past weekend and I wanted to take them for some good ole' fashioned New York style pizza.  I've heard from many that Grimaldi's has the best pizza in the city, so I was excited to try it myself.\n\nAll in all, we had a great experience.  We decided to go the simple route and just get a pepperoni pizza...  it was so, so good.  Have you ever just had a slice of pizza that hits the spot?  The perfect amount of sauce and cheese (and grease lol)!?  Well, that was exactly how we all felt.  I was in pizza heaven AND my family got the NYC pizza experience they've been waiting for. \n\nThe atmosphere is definitely casual.  It's simple and to the point...  No fancy glassware or utensils - paper plates, plastic cups/forks/knives is how they roll.  But to be honest, with pizza that good, you don't need all the fluff anyways.  I actually rather enjoyed the simplicity and authentic feel of the place.\n\nThe onlyyyy downfall is that they DON'T SERVE WINE!!! :(  Wahhhhhh!!  But I read on the menu that their liquor license is pending, so that may resolve itself shortly.  \n\nAnd last but not least, my FAVORITE part is the location...  It's right across the street from the Brooklyn Bridge and Jane's Carousel.  A great place to take a nice walk along the water - the views of Manhattan are breathtaking!  Best I've seen to date.  Truly makes you sit back and have one of those \"this is why I love NY\" moments.", "author": "Christine B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}