{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-12", "description": "Any place that only accepts cash and charges $5 for their ATM fees just straight up sucks. Pizza is fine, not worth a $5 ATM surcharge tho", "author": "P S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "Great pizza! Now I know why people line up to get pizza here! The line moved fast and it was worth the wait!!", "author": "Margaret D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-04", "description": "My mom and I decided to walk the brooklyn bridge to come get some pizza. It was a nice walk and then a great way to finish our walk with some pizza!\n\nGreat pizza. I love that it is a thin crust because you can eat a few slices without getting full off the bread. My mom and I ordered a small with onions, mushrooms, and sausage. A small pizza costs $12 but comes with cheese, garlic, basil, and tomatoes. Additional toppings are $2 each. \n\nGood amount of sauce and topping and good ratio to the bread. The crust has a salty taste, but it was good and not too salty. \n\nProbably can't help it since it's brick oven, but the bottom of our pizza was sort of burnt. That was probably the only downfall of the pizza. But nonetheless, still good!", "author": "Chris K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "Brooklyn pizza, with Brooklyn service.\n\nCame here late Sunday night expecting a line but pleasantly surprised to be immediately seated. Inside what was a bank, this place has character and rich history behind it.\n\nApparently, their liquor license was pending, so I settled for the other beer, as in rootbeer. The 3 of us shared 2 small pizzas. Make your own! \n\nRed pizza had pepperoni, roasted red peppers, and mushrooms. Honestly, an amazing pizza! \n\nWhite pizza had ricotta cheese, basil, and Italian sausage. Good, but I bit dry for my taste.\n\nService was dicey, my buddy wasn't too happy, but keep in mind we're in Brooklyn. I know, no justification, but it almost added to the character. Waiters yelling and slamming on windows, bottles if orange soda and rootbeer strewn about. \n\nI think the novelty of the place awarded it about 1/2 star. So truly, a 3.5 star experience.", "author": "Billy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-31", "description": "It's pizza. And it's really good pizza. I went there once and didn't have to wait THAT long, guess we were lucky. I wouldn't probably go back because there is so much good pizza in NY and I definitely don't wanna wait more than 30 minutes to put it in my mouth. But yeah, go there for the experience, absolutely!", "author": "Diana R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-15", "description": "The line outside was misleading. Paper plates,cups,and silver wear. Second floor does not have conditioning. The waiter came by once to take our drink and pizza order and then once again to leave the drinks. Very busy so the waiter was not attentive and was rude. The pizza is okay but not worth putting up with the staff or wait.", "author": "Alondra G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-19", "description": "had dinner just bcz i was curios since there is always line-up out there.\n\ndelicious dough, perfect burnt smell, tasty fresh topping, amusing busy atmosphere, smiley nice service even its full packed.(and the receptionist did great job to comfort people waiting outside)\n\nThis is very nice restaurant, so it's your choice to stand outside for 30-40min or not. Me, personally, I didn't regret of my waiting and I might go back there again (but when there is no line.)", "author": "Mei Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-05", "description": "Came here early Saturday around opening to avoid lines. \n\nPizza here isn't bad. The 4 of us ordered a large chicken pie and a small garlic, we all agreed the chicken wasn't seasoned\nAnd tasted Bland. \n\nIt's decent pizza all around but for the price and EXTREME hype this location receives, it doesn't impress. I know of a few local pizzarias that are amazing and much more preferred. \n\nThis isn't a place I'm visiting again.", "author": "Patrick G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-16", "description": "I had gone to the original Grimaldi's with the green awning 5 years ago. The pizza was incredible, the atmosphere was antique and original, they made the mozzarella in house, all the ingredients were fresh and the pizzas took 3 minutes to cook. It was the best pizza I'd had in New York and I've tried many.\n\nLast night was different however. The restaurant was new, the atmosphere was tacky, the logo was new and commercial and the pizza was like bland, cold cardboard. I was truly insulted. I felt like I was at an amusement park. Here were the exact problems with the pizza:\n\n1. THE DOUGH was frozen, not fresh, so the crust was comparable to matzah, and not good matzah. Every pizza looked to be the same size. There was no character to it. Also, the new oven needs to be broken in to achieve the proper temperature. This pizza was cooked at too low a temperature. \n\n2.  THE CHEESE used to be fresh made mozzarella. This was bland and commercial. They used to cook pizza at higher temperatures and add mozzarella at the right time/temperature. Because if you overcook the mozzarella, the flavor leaves. They cooked the pizza for longer time at a lower temperature and ended up with undercooked dough and overcooked mozzarella.\n\n3. THE BASIL. There wasn't enough! It was all in the center! Also overcooked.\n\n4. THE SAUCE was bland and I think they used canned sauce or tomatoes. It was cold by the time our pizza arrived at the table because the place was over air conditioned.\n\nDon't go here. I need to find better Brooklyn style pizza. It's a shame this once great establishment abolished tradition and quality for commercial expansion. That's the business of food I guess...", "author": "Roberto C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-26", "description": "Really good pizza! Fresh ingredients and a thin crust. I give a 4 star because the servers never check on you.", "author": "Emilio H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-10", "description": "Solid pizza.  The crust was an A+, but the sauce and the toppings were not.  Just average. And a bit skimpy on the toppings. It was very unique tasting though.\n\nIf you're tired of the regular NYC slices, this is a nice change.  But for an out of towner like me, I liked Pronto's better.", "author": "Scott Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-08", "description": "A half block line took more than an hour.  Food was good but not worth the wait.\nGreat location, right off the Brooklyn Bridge walking path and next to a park on the river so a good spot for kids to hang out and wait.  And wait.", "author": "A M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-09", "description": "How I heard of this place: In February of 2008, on my way to NYC for Fashion Week, someone on the flight from Los Angeles, California mentioned Grimaldi's. He said it's the place to go for pizza in the northeast. It came up again, while looking through a friends pictures (mobile uploads) on Facebook and coming across a steamy, bubbling, thin-crust pizza and learning that it, too, was from Grimaldi's.\n\nType of cuisine: One antipasto, four pizzas (either small or large, regular or white), two calzones (small or large), a limited list of toppings and beverages, including sodas, juice, Snapple, still or sparkling water, beer or wine. And four desserts from which to choose, washing it all down with one of four hot beverages. Simple. Easy. But not mainstream.Ambiance: Their list of don'ts says it all: \"No credit cards. No reservations. No slices. No delivery.\" Apparently less is more at Grimaldi's. Walk through the glass door at the front,only after being invited in by your host, an elderly gentleman wearing a pin-striped, dark grey button-up shirt with charcoal slacks, white suspenders and an almost-black fedora. The doors lead into a small lobby, which immediately opens onto the cramped quarters of what is Grimaldi's Pizzeria under the Brooklyn Bridge. Red- and white-checked tableclothes cover each table, but can hardly be seen among the dozens of patrons, loudly conversing and making ordering decisions. Metallic lamp-shades make their way down, over the tables, from the ceiling, resembling lights you might see in a dark room where mobsters gather to play poker. The white walls are covered in framed photographs of celebrities, politicians and other famous types who have dined at Grimaldi's over the years. Wait staff hustle and bustle through the mini-aisles created between tables and chairs to bring 18-inch pizzas to drooling, hungry patrons. Windows facing street-side at the front of the establishment give way to natural lighting, though the back still feels dimly lit. The wall to your far right and towards the back of the establishment, from where you enter, is full of boxes and supplies on garage-style shelving units. The kitchen, open to the restaurant, is blocked only by a marble-slab counter top and plexiglass, through which one can see the large containers of fresh vegetables, pepperoni and cheese. The coal-fire oven just behind, exude heat and flames, which light up the kitchen, as workers smile and toss pizza dough into the air until it is cardboard-thin. Pizza and calzones are placed on cubed stands  to allow for a bit of dining space, on plates, underneath. Two trays covering the entire table for four.  \n\nWhat I ordered: My husband, good friend from Queens and I decided to meet at Grimaldi's after a weekend in Brooklyn - me, for a conference, my husband, to hang out and take in the street festivals and sites - we could not leave without having finally sampled Grimaldi's pizza. I skipped the afternoon session of my conference to get lost on the subway and wait in a 33-minute line, underneath some construction scaffolding, along Old Fulton, before being called in by the old man wearing a fedora, and pin-striped suit with grey slacks, held together by white suspenders. The simplicity of the menu made it easy to decide: one, large, regular pizza ($14), which comes with fresh mozzarella, crushed tomatoes and basil, and the addition of pepperoni, Italian sausage, sliced onions, mushrooms and fresh garlic (additional $2 each).\n\nWe also had to sample the large (18-inch) calzone ($16) with tomato sauce, fresh mozzarella, ricotta cheese, pepperoni and onions (additional $2 per topping applied here, too). To sip on, we had one Coke ($2) and two Olde Brooklyn Sodas ($2 each) in the Cream variety. When in Brooklyn...Right?\n\nWhat I loved: I loved the thin crust, the huge size of the calzone, the very fresh ingredients - from the soft and stringy mozzarella to the mushrooms and the basil, from the sausage that looked to have been rolled in house, to the crunchy, transparent onion slices...and, of course, the crunch of fresh chopped garlic, heaped to generous proportions on our pizza. \n\nWhy I loved it: I love the simplicity of the menu and the bustling feeling of the space. I love the smallness of the interior and the greatness of the food. I love that there are nearly as many employees - from kitchen-staff to wait-staff as there are customers in the establishment. I love that we were squeezed in, between two other tables, and no one seemed to think anything of it.\n\nCost: Average to high ($12-$16 per pizza with tomato sauce, mozzarella cheese and basil or crushed garlic; additional toppings $2 each)", "author": "Mojdeh S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-26", "description": "Amazing! Amazing! Best pizza that I ever had!!!! I need to pay a visit again! Love it. \nMy boyfriend and I went late at night and there is no wait which it is even better. According to others, normal wait line is an hour.", "author": "Anna D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-24", "description": "Pizza was okay, the service was horrible. The waiters pay no attention to you and don't even bother giving the same kind of service to you as they do to the white folks that eat there. \n\nReally felt awkward when I went there, next time I'd rather take out.", "author": "Stephan R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-13", "description": "Great pizza, good service.  Would recommend Juliana's next door if you only have one chance to get pizza in Brooklyn.", "author": "Lewis F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-22", "description": "It's  good, it's not great.  I've eaten better pizzas in the city.  More photos and details on my blog.  Link in my profile", "author": "Deepika M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-02", "description": "Grimaldi's is just straight forward, decent pizza.\n\nIt is perhaps the only pizza chain that still manages to approach the feel and quality of a local pizzeria. The crust is a bit on the thick side, but not too doughy. The sauce is not too sweet, and neither are they too stingy with toppings.\n\nNot the greatest pizza in the world, but it is decent and consistent.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-10", "description": "I know this place is a bit of a tourist trap, but when I lived nearby I would bring visiting family and friends. The pizza is really fresh and delicious, cooked using a coal-fried brick oven. You can see the chefs making the pizza in the background. \n\nNo reservations. Be prepared for a loooong wait. I once went to the restaurant during a rain storm thinking that nobody in her right mind would wait outside in those conditions. WRONG. In fact, the line was even worse because people weren't leaving. For takeout, you also have to wait in line. There is no getting around it. \n\nThe restaurant itself is tiny and run-down, but it has tons of charm in its history (located next door to the original location).", "author": "Danielle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "Third visit to NYC and this was on top of our list. The pizza was even better than the first time. We added mushrooms and for some reason the taste wasn't tbay great.  Go with the classic.\n\nSide note: takes only cash and serves on paper plates.", "author": "Atifa R."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}