{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-06", "description": "I love pizza. It's at a point where you can say \"pizza\" to me and immediately grab my attention. You can also say \"pizza\" and my mouth will probably start to water. I should be embarrassed by my love for the pizza pie, but screw it. It's too delicious.\n\nIn all my visits to NY, I had yet to cross the bridge to get a meal at Grimaldis, so it was a must-do on my itinerary for my most recent visit.  \n\nThe restaurant itself seats you in (almost) communal style tables.  As soon as a spot opens up, they will seat the next group in line that will fit. So, if you're up front in line but your group is too small/too big, you'll keep waiting until a spot just for you opens up.  If you're there with a large group, be prepared to wait, order take out, or just get lucky. \n\nThe menu is pretty simple - just pick a size pie you want, and then pay additional for whatever toppings you want.  We ended up ordering a small with pepperoni and sausage.\n\nI was pretty hungry by the time we were seated, up to the point where I wanted to grab pizza from the next table.  I'm glad I was able to restrain myself, because the pie came out relatively quick.  \n\nWe ate, and ate, and ate.  There is NOTHING quite like the amazing crust you get from baking a pie in an oven that is probably as hot as.. well.. you know.  Pizza does not need a lot of frills to make it good; it just needs a great crust, a great sauce, and the freshest toppings you can get. Grimaldi's scores on all three counts.", "author": "Janet P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-11", "description": "Ummmm....YUM!!!!!!\n\nAfter traveling from CA to NY, all I wanted was a true NYC pizza experience.  Grimaldi's sure delivered!!  My friend and I shared a pepperoni pizza.  The pepperonis were really yummy and sliced thick, and the mozzarella melted on top was delish.  The pizza was definitely worth waiting in line for.  Kinda bummed out that: a) they did not have any Italian sodas OR regular Dr. Pepper when I visited.  Double whammy b) they are cash only.  Our server wasn't the friendliest, but hey, I didn't go for the great service...I went for the pizza.  \n\nThank you to Travel Channel (or was it Food Network?) for introducing me to this wonderful place.  Next time I'm back east, I'm definitely there!!", "author": "Cheryl R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-07", "description": "This place is on the pizza map around NY. Everyone seems to know this place. I am more of a thick crust guy (Spumoni gardens) but I do enjoy myself some thin crust pizza as well. This was very good thin crust pizza. In fact, it comes second only to this italian restaurant's pizza on Spring street (Mezzogiorno). If parking wasnt to miserable here I would definitely frequent it more often. The hype is justified here and I definitely recommend it!", "author": "Geoff P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-09", "description": "-Waited way too long\n-Service sucked\n-Pizza was good, didn't blow me away\n\nWe waited well over an hour for our pizzas to come AFTER we were seated. Don't even remind me about the wait to GET seated. The pizza was good, it wasn't typical greasy NYC pizza, and the crust was not too crispy and not too chewy and had an amazing subtle smoky flavor. It's a shame the pizza couldn't save this place that extra star. I was surprised by the bill though, less than $100 after tax and tip for 5 pies.", "author": "Andrew O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-23", "description": "I would gladly live underneath the Brooklyn Bridge if it meant that I could eat Grimaldi's everyday. Since I actually have no interest in being homeless, I will have to settle for eating at Grimaldi's during the only time I am ever in that part of Brooklyn: for the free summer movies under the Brooklyn Bridge.\n\nBe warned: Grimaldi's gets incredibly crowded, even if you are only going to pick up a pie. I remember waiting a good 40 minutes outside, just to order the pie, then another 30 minutes for it to be done. That being said, I will gladly wait over an hour and travel to the middle-of-nowhere Brooklyn (at least it feels that way, coming from middle-of-nowhere Queens) to get a Grimaldi's pie. \n\nGrimaldi's pizza + picnic blanket spread out under the bridge + free movie = best date ever.", "author": "Lindsey M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-31", "description": "Why wait in line? Don't be a schnook. Call ahead and pick up a pie, then go eat it at Brooklyn Bridge Park. I think this pizza is usually good, but sometimes it can come out a little dry. So I wouldn't award this the \"best pizza in the world\" as some other misguided individuals might. However - it's usually pretty darn tasty, and the proximity to the park makes it a special event.", "author": "Simon G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-22", "description": "My wife and I went to visit my brother in law for his birthday.  He happens to live near Grimladis. We had heard and read about the great pizza so we decided to take him for his birthday. The wait wasn't long about 15 minutes. The service was very good. But the pizza was not the best I have haf. While it was very good Frank Pepes I  New Haven CT is still the champion. Grimladis pizza was good and had a distinct flavor and taste. I am glad we went....", "author": "Elvin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-15", "description": "If you come to NYC you definitely need to try this pizza! It's #1 and I have to agree!! I love coming here and just diving it to one of there large yummy pies!!!!! It's worth the visit!!!", "author": "Karen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-12", "description": "I came here for lunch on a Monday and ordered a small pepperoni pizza and Coca Cola.  The pizza was excellent.  While the menu says the small serves 1-2 people, it's a very large \"small\".  I could only eat half of it.  The service was good.  Note Grimaldi's is cash only and there is no alcohol.  I will return here again.", "author": "Graham G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-03", "description": "We were told that while vacationing in Manhattan you gotta walk the Brooklyn Bridge then stand in line for Grimaldi's for some awesome pizza.\n\nTwo hours later, I'm standing in an hour long line of crazy tourists just like me, baking in full sun, trying not to think about the blister on my heel and craving some awesome pizza.\n\nSnail's pace.  People coming out aren't smiling and high fiving each other.  Are we making a mistake?  Should we cut and run, and go back to Angelo's?  No!  Awesome pizza, remember...?!\n\nFinally we're in!  Holy poop, it's tight in here.  We're sat at a table that holds 8 (four two tops pressed against each other).  Thank God we're on the aisle (until we're bumped repeatedly, that is), or else I wouldn't have been able to lift my arms.  Seriously, the pizza from the table next to us is sharing our airspace.\n\nGood pizza, not great.  They don't let you do half and half, so we did sausage and Kalamata olives.  Crust was a bit soggy in the middle (the kiss of death for thin crust pizza), and the cheese could have been more flavorful.  Maybe we don't know what real NY pizza is... but we didn't think this held up to the hype.", "author": "Liz R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-02", "description": "4 stars because there's ALWAYS a line :( \n\nShort summary- Best pizza in NYC... great place to go FOR THE EXPERIENCE.  Not your local, daily pizzeria- wait is too long.  \n\nLong summary- Why are you still reading?!  Words can not explain how good it is, the only way to experience this is to actually go.  I've gone quite a few times.  There is never not a line so get used to it if you love their pizza.  You cannot buy slices, only pies! So stock up!", "author": "Timothy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-06", "description": "It's just too bad that there are no Coal Oven Pizza Ovens in Southern California from what I know... but it's a great thing that I can fly to NY and enjoy pizza made this way.\n\nGrimaldi's!\n\nAfter traveling and getting to the store front and waiting in a line, I finally got to see what this place is all about and it's amazing!  Old school italian/new york feel and the pizza is amazing! Made a certain way and there's no way you can get the recipe for their dough nor sauce. Everything else is fresh and easy make out.\n\nWhat's BOMB.com: Large 18\" Pizza with Pepperoni, Sausage, Garlic \u0026 Mushrooms.  Wash down with a Brooklyn Lager and you're set!  And of course get a Large, you've waited long enough!\n\nHOLLA!", "author": "Limzer L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-11", "description": "Once upon a time, this was the best.  Here's the problem:  the crust.  The tourist traffic is so heavy, the pizza is turned out in such volume . . . this is my best guess where the problem is, but the crust is heavy.  When i first ate it, I thought it might be a whole wheat crust . . . not.  So I went and watched it come out of the kitchen to the stretching (yes, its not thrown) table and I immediately noticed that the mounds just aren't risen enough.  Adequate rising time is essential.  I am not sure Grimaldi's provides it anymore.  Its a volume business in Brooklyn.  Think about going to the Hoboken location if you want something closer to the old days.  A light, thin crust.  \n\nThe sauce is excellent, sharp, not sweet, tomatoey with strong basil highlights, but not a garlic lovers brew.  The cheese is just mozzarella.  Good, but bland.  A blend is usually a better flavor, but on a good crust just mozz is forgivable in my book, unfortunately the crust is a failure here, as I mentioned above.\n\n I don't like giving this landmark business a bad review, but it just isn't up to its supposed reputation.  Not worth the often lengthy wait.  Try Totonno's in Coney Island at least the wait there measures up to the pleasure you'll get when you eat the pizza.", "author": "Richard D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-12", "description": "Best brick oven pizza! Usually in the summer there is a huge line for seating but it passes by quickly and is well worth the wait. The pizza's offered are simple but not short of delicious. The service is quick you'll get your food right away It is cash only", "author": "Elina A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-10", "description": "Pizza was pretty damn good but they served us and tables to our right and left then wrong pizza. The line was 30 mins on. Weekday, but i think. They could  make more $ with cheaper style.", "author": "Jim S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-31", "description": "Living in Chicago where we get a ton of tourists, I often make fun of them when I see them waiting in line for silly stuff. When I was New York I found myself waiting in a Six Flags type line under the Brooklyn Bridge for pizza. For shame, I thought. I am one of them! \n\nAfter a half an hour wait, we were finally seating in the cozy coal pizzeria. By cozy, I mean you're making friends with your neighbors because seating is tight, though not uncomfortable. Our neighbors were dudes straight out of a sitcom with the strong Brooklyn accents and all, so we were amused by them and glad they were all in our business.  Rhonda G, my NYC PIC*, and I ordered a small pizza with cheese and mushrooms on one half and pepperoni on the other. The pizza was really good. The mozzarella was fresh and oh so tasty. The pizza was just right and I did not regret waiting in line. Next time I'm in New York, I'll definitely go back. \n\n*PIC = partner in crime, despite a surprising lack of crime committed.", "author": "Dallas F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-14", "description": "Before I begin my review let me announce I am from Hawaii and we are in desperate need for good pizza.  I love pizza and honestly it was hard to believe pizza is better than anywhere else.  This is my third trip to New York but never attempted to take the pizza challenge. (Probably because this was pre-yelp)  Of course I watched food channels and heard about this place and I have my yelp app in my hand I am ready.  The question is where is the best pizza GRIMALDI'S or LOMBARDI'S. Here is my experience at Grimaldis.\n\nWe have already been to Lombardi so Grimalds already had big shoes to compare to.  Arrived around 7 pm on a Sunday Night. Bad mistake the line was long and we waited over an hour. We debated leaving to go to another place to eat. After walking the Brooklyn Bridge we were tired and just wanted to eat so we agreed to wait.\n\nAfter an hour, the wait was over. We were greeted by a young Italian man with his strong Italian New York accent (really cool) who started hitting on one of our friends. Totally hilarious! We sat down and with 5 of us we decided to order 2 large pizzas (8 huge pieces) We ordered a pizza with pepperoni and italian sausage and a white pizza with spinach and garlic. No sides just straight up pizza. If you question if the ingredients are fresh go walk to the bathroom and you can see up close the chefs in action. They don't like it when you take pictures. Trust me the ingredients are fresh and pizzas are made to order.\n\nWhen the pizza came, I knew this was going to be epic!  The pizza was huge and everything looked fresh. One bite and I knew I was in heaven again. \n\nFinal Verdict between the battle of Lombardi and Grimaldis.  I will say the same thing about Lombardi.....NEW YORK be happy you have options of maybe the best pizzas in the world. They are both amazing and a must add to your bucket list if you love pizza. I am forever ruined for future pizza....why are you so far away.\n\nCON: Only con is we waited one hour at Grimaldis and 10 minutes at Lombardis.  If wait wasn't an obstacle then lucky you have both options.", "author": "Cy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-11", "description": "The pizza was good but the wait was brutal.  It was a pretty cold night, the same night that the Festival of Lights, was held and I was outside for about a hour and then waited another 30 minutes for my food.  The pizza was pretty good, we got sausage, basil and mozerella but I dont know if I would be willing to wait in line for that long again.  Also, the place was cash only.", "author": "Jason Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-07", "description": "In our past visit to New York last week, my wife suggested we go to the famous Grimaldi's Pizza. She had been there on a previous visit and wanted me to experience it. \n\nI'm in my 40's and have had a lot of pizza in my life. This wasn't a bad pie but it certainly doesn't win any awards with me. There was a small line and it was just my wife and I (party of 2). The door man/comedian asked us no less than 5 times how many in our party. He even wrote it down on a clipboard but insisted on continuing to ask us how many. After a hot and uncomfortable 45min wait we were finally seated. Then another waiting game for someone to serve us. Oh, and no AC! Awesome! \n\nThis is also when we found out they don't serve beer or wine! We ordered a pepperoni, sausage and ricotta pizza and a couple of sodas. So after another 20mins or so, we get our pizza. I'm a sucker for semi-crispy thin crust you can fold over and eat. I'm glad they gave us a fork and knife because the middle of the pie was doughy and soggy. The bottom was also slightly burned which was palatable but annoying. I had assumed that in an italian pizza joint, the sausage would be italian sausage with a little zest... Nope. regular pork sausage with lots of chewy grizzle!\n\nThis is the last time I'll be heading to Grimaldi's. If you want to experience great pizza head on up to Manhattan to Uncle Mario's Pizza. Now that is pizza!! No line, accepts credit card, draught beer or wine, small wait time for freshly prepped pizza. Oh and it is leaps and bounds better tasting!", "author": "Brad P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-20", "description": "Excellent pizza!\n\nWould've given this place five stars if we didn't have to wait an hour \u0026 ten minutes just to order! Then again, I think our wait would've been shorter if it wasn't for that damn party of 17 in front of us. YES, SEVENTEEN! WTF.\n\nWe took our pizza to-go and ate at the park down the street. It only took them about 15 minutes for them to make our pizza.. fresh out of the oven!\n\nWe got the large regular pizza (regular = mozzarella cheese, tomatoes and basil) and it was delicious! Simple but scrumptious! Something's in that mozzarella cheese.. it was SO good!\n\nI must admit, it's worth the wait. But please don't bring your damn party of SEVENTEEN. Just don't.", "author": "Bin H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}