{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-09", "description": "For all the hype I was expecting better.  \n\nPrices are reasonable.  You get to sit next to other people.  \n\nPersonally if you are not in the area, you can find plenty of better pizza.  \n\nThe pizza got soggy a few minutes in.  I also found the crust didn't have much flavor.  The toppings however were tasty, but not the freshest.\n\nAll in all, it is a destination, good for a one time stop, but i would not repeat.", "author": "Andy X."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-04", "description": "Overrated. Overpriced. Half of my pizza was burnt at the bottom. The other half was delicious.", "author": "James A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-19", "description": "This is the worst example of tourist-driven terrible chain pizza ever experienced.  I would go to no less than five local pizzerias before setting foot in this over-priced lousy joint.   We laugh at the lines of people waiting to get in for their shot at mediocrity.", "author": "Bill R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-24", "description": "waiting in line at 10AM in the 'morning', in december, freezing, hung over, for 45 minutes....\nWorth every minute.\nthin crust, mozza, toppings, and coke.\nyes, im a tourist in NY", "author": "Kazu O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-21", "description": "Went there for a takeout in May. Ordered a large pie with sausage (no meatball), pepperoni, garlic, mushrooms, onion. \n\nPros: The cheese they used were really good, can tell it's special home made. \n\nCons: The other ingredients were just so so. Mushrooms were not even fresh. And looooooooooooooooooong wait for eat-in. I went there around 3:30pm which might be the least busy time for all restaurants. However, there were at least 20 people waiting out of the Grimaldi's door for eat-in. \n\nFor takeout, they don't have a hard board box for you. They simply cover the pizza with a large thin paper bag with a hard board paper on the bottom for you to hold your pizza. When I carried that large pie from Brooklyn back to Manhattan, the board paper on the bottom turned to be so soft that I had to use two arms to hold my pizza.\n\nI would say, for meat animals, that's pizzeria isn't for you since their meat isn't so good and they don't even have meatballs. For people living in Manhattan like me, it is not worth a trip to Brooklyn. I would rather go to Lombardi's.", "author": "Vicki Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-21", "description": "A must have for anyone who loves pizza in New York. The pizza is made with fresh mozzarella in a coal oven. It comes out with a thinner crust and is absolutely fantastic. Just remember no credit cards and no slices.", "author": "Nick V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-19", "description": "I Had the calzone 8 years ago and coming to  NYC 8 years later I had my mind set on that calzone flew 3,000 miles with the thought of having the calzone. I was seated and asked for a calzone they brought me a pizza...told them I didnt order the pizza and that I ordered a calzone the waiter argued with me saying that I did indeed order a pizza and didnt even make the effort to bring me a calzone or say maybe was  a mix up and was sorry he said NO apology thats all I wanted but oh well new yorkers are never wrong I suppose.", "author": "Elijah Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-30", "description": "Great pizza but rude staff and too many tourists.  Totonno's is not close by but better pizza and more friendly staff.", "author": "peter s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "Grimaldi's makes some serious pizza. \nThe pie itself is pretty traditional and devoid of any fuss or flourishes. However, the pizza is so well crafted that it's fairly (but not completely) worth the wait. \nFirst of all, the dough has been let rise for sufficient time, with traditional yeast -not the instant stuff. You can taste the difference in the crust, as it's flavorful, light and chewy like a fresh loaf of bread. Then there is the matter of the ingredients, all of which are quite fresh and of good quality. Lastly, there is the finished product itself. The pie lacks those disgusting puddles of oil that often accompany pizza made with processed cheeses. So all things considered, a very very good pizza. \nSo why only four stars? Well, the 65 minute wait, crumb infested table cloth and having to share a table with four hefty, sweaty men put me slightly on edge. That being said, the pizza is still one of the best I've ever tasted.\nP.S. Cash Only, No Reservations, Take Out still line up with rest, and the line is much shorter weekdays and mornings.", "author": "Panda Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-08", "description": "best pizza EVER!!! outside of italy, of course.\n\ni come here every time i'm in new york, and then dream about it the whole time i'm not there. wish there was one in san francisco. but this is the OG. \n\njust the simple margherita pizza is to die for. *YUM*", "author": "april s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-12", "description": "Wow, am I glad I got this recommendation during our trip to NYC. It was sooo good. We got there around 9pm on a Monday night and there was still a line! Luckily it wasn't too bad, less than 30 minutes. We met a couple of Australians in line and we ended up sharing a table with them. We ordered a pizza with pepperoni, italian sausage, mushrooms, onions, and fresh garlic. Mmmm, so this is what NY pizza is supposed to taste like. My girlfriend and I split a small pizza and it was a good portion. The large is huge! Everything on the pizza tasted so fresh from the sauce to the mozzarella cheese that was so stringy. I'm salivating as I'm typing this review, and now that I think about it, I'm going to change my review to  4 1/2 stars because it was so good.", "author": "Seila K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-17", "description": "So good!  We had to wait outside in the freeeezing cold to get a table, but it was worth it.  \n\nOur server was adorable, picking my friends camera as soon as he came to the table, and started taking pictures of the restaurant as he took our drink order. \n\nThe pizza itself was perfect.  Just the right amount of sauce to cheese to meat...best pizza ever.", "author": "Natalie G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-16", "description": "my family and i went there after hearing so much hype about the place.\nwe ordered a large pizza with olives, sun dried tomatoes, sausage, and mushroom.\n\nit was both terrible and awesome.\n\ni've never had such salty olives before. maybe i'm just not familiar with real italian olives. but that pretty much ruined our pizza. the sun dried tomatoes just tasted like soggy tomatoes and not the bright strong flavors i would usually expect. the sausage was very mediocre as well. but the mushroom tasted like mushrooms so i guess that's good.\n\nbut all the pizza around the toppings was pretty good!\nthe cheese was delicious and the dough was tasty.\n\nbut yeah the sheer amount of crappy toppings could not overcome the delicious crust. maybe you should just get a cheese pizza?\n\nNOTE: there is only one bathroom and it's pretty nasty. so yeah...", "author": "Samuel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-07", "description": "This is the first place that I got NY pizza from, and it was sooooooo delicious!!!  I mean, wow.  The mozzarella was so fresh, and it was just so perfect.  I tried other NY pizza since, and nothing compares.  I think about it often since I live on the other side of the country.  But someday.... someday.... we shall meet again.   \n\nPS. And as a bonus, we sat right next to Geoffrey Rush (although, I didn't know until he left and my bf pointed it out point blank--I'm horrible with recognizing celebrities).", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-12", "description": "Girlfriend and I saw this on one of those food shows. So when we went to NYC we stopped in. Got there around 830-9pm on a Friday. No line. Seated immediately and attended to right away. Atmosphere was very New York. Ordered a pepperoni and sausage. Almost couldn't finish it and I eat like a pig. We gave this four stars only because it wAs a hike to get out to it from manhattan.", "author": "Joe C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-05", "description": "Not bad; it was pretty yummy pizza, but I had much higher expectations based on its reputation.", "author": "Alan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-09", "description": "Two pies is not enough, this is nys best. *****\n\nI, like millions, love the simplicity of pizza. For me pizza has been done for so many years and by many that there is no excuse for a bad pie. Grimaldis is pizza heaven. Other than the wait outside for 30+ MINUTES, its totally worth it. The menu is simple and straight forward. The prices are extremely cheap for its worth, $12 a small pie. The coal oven taste in your mouth with the perfect crust, sauce and cheese. I bring all my friends and relatives when they visit, and they all go back telling, its the best they ever had.", "author": "Paul D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-20", "description": "Eh I don't know what the big deal is. I've been here twice already, and it is just ok. Their pizza smells amazzinggg but tastes just ok. And I've taken some of my friends from out of town to try what is supposedly the \"best\" pizza in NY and they were not in any way impressed. It's over-hyped.", "author": "Holly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-16", "description": "The best pizza in New York so far that I have tasted! I didn't think pizza could taste so excellent until I came here!\nI decided to try this place since I read all the great reviews and saw this place on the food channel. My family and I arrived to a line that was about an hour and a half wait. The man who was letting people in was such a nice man. I am not sure if he was the owner but he let us go in without having to wait since he saw that I had a child and my mom with me.\nThe place inside is small but cozy. At the end of the restaurant you can see the pizza being made. Also the service is excellent and they were so attentive. I asked them what did they recommend and they told me to try the mushroom with sausage pizza. Let me say that the pizza was so delicious. You can taste how fresh the cheese, tomato sauce, and crust is. Omg my mouth is watering just thinking about it. My mom has not wanted to eat pizza since we came back from New York. She says she can not see pizza the same after that, lol!. We all can't wait to go back to New York and have my ultimate favorite pizza. This is my favorite pizza place ever.\nI give this place five stars!", "author": "Meow T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-19", "description": "The experience as a whole was definitely a 5. This is everything that a New York pizzeria should be and worth the wait.  When you step inside you feel like you're in a movie- waiters buzzing around, red checked table cloths, people smiling and a hint of smoke from the coal burning brick ovens.  The pizza is great, everything was fresh, and the staff was speedy and welcoming. We can't wait to go back.", "author": "Batie H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}