{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-04", "description": "I had read various reviews about how great the pizza here was and I was aware of the wait. Nevertheless my fiance and I decided to try this place. We get there and the line is much longer than we expected and we are told by others in the line that is it a 1.5hr wait but worth it. Mind you, I am from SF where we have some of the best, if not the best food in the country, and we DON'T wait 1.5hrs for food anywhere!\n\nWe decide to wait and as we do, the door nazi comes out of the restaurant and tells us to get off his rope (they have the side walk roped off), we think this is funny as the 70 yr old door nazi is teling everyone to get off his rope. He comes up to me and asks me if he had said something funny - yeah dude, I'm from SF and no restaurant operates like this, no matter how good, and yeah you look freakin' funny telling people to get off your rope.\n\nSo 1.5hrs later we get in, order a pizza.........and the verdict, good but definitely not great and definitely not worth the 1.5hrs..........you want good coal fired pizza in NYC with good service, plenty of elbow room and NO WAIT then try Angelo's on 57th street (btwn 6th and 7th). Angelo's has exactly the same tasting pizzaa, in addition they have great pasta, good service and no wait and you don't have to sit in your neighbour's lap. Better still,  want great pizza then try Zahary's in Berkeley, CA....now that is worth the wait and a hell of a lot better than the pizza at Grimalidi.\n\nIn summary NOT WORTH THE WAIT!", "author": "Elzabeth G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-27", "description": "My only complaint: I always get stuck underneath the AC and then my pizza gets cold. Is that a weird complaint?\n\nI love their pizzas, they live up to the hype! Though they don't have an extensive beer and wine list but they have some staple brands (Peroni, Brooklyn Brew, Heineken). \n\nI suggest: capers, ricotta, sweet red peppers, and garlic. Your breath will never be the same...", "author": "Holly T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-12", "description": "Not the best pizza ever, but pretty darn good. The wait is a bit long at times but the pizza is always fresh and most importantly, the crust is thin and crispy. I wish they sold it by the slice because whenever I order a whole pizza, I have no self control and finish the entire pie by myself.", "author": "Esa A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-28", "description": "Duh Best!!! how could you not be when pizza and calzones are the only thing you've been doing for as long as they have.\n\nWait on line, its worth it, a pizza experience you'll never forget. Grimaldis can spoil every other pizza you ever eat again. Grimaldi's cannot be touched, they are the GOD of pizza. lombardi's cant even shake a stick at Grimaldis nor Totonos and Di Fafaras is just worthless now (too bad Mr Dafara didnt teach his son how to make pies).\n\nI cant stop sayin' it: Grimaldis, Grimaldies, Grimaldis. The original Patsys.", "author": "Medwin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-14", "description": "When the American Crossword Puzzle Tournament moved from Stamford to NYC, I was pretty jazzed. All the fun - and now in The City®. What could be better.\n\nWait. They moved it to Brooklyn? Really? Ahhhh! What kind of culinary adventure can I have in Brooklyn?\n\nAll the guide books said Grimaldi's was the best. I rarely believe the guidebooks. I may start believing the guidebooks. \n\nA pretty simple walk to Grimaldi's from the hotel. It starts to rain. It's 6:30 on a Friday. There are only about 20 people inside. I check my map. Is this really THE Grimaldi's?? How could it be? Shouldn't it be mobbed? \n\nI order. The staff is gruff. I decide to get takeout, because, even though I've eaten in many restaurants as a \"table for one\", it doesn't feel like the right place for that. They tell me 40 minutes, it's ready at exactly the time they say. \n\nI walk back to the hotel. Still raining. The takeout packaging is a bag instead of a box for some reason. It's getting soggy, and sopped with the bits of juicy greasiness from the pie.  It's also getting cold, so I wrap my jacket around it.\n\nBy the time I get back to the hotel, it's lukewarm and a bit congealed. But that's my fault, not theirs.\n\nI rip off a slice. I dig in.\n\nDespite all of the preceding, it is - by far - the best pizza I've had in 20 years. I polish off the entire pie. It was worth every calorie, every soggy step in the rain.\n\nNext year, I will make another pilgrimage. Maybe I'll even eat it AT Grimaldi's for the full effect. Only 348 days until the next tournament.", "author": "John B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-09", "description": "WOW! Aside from the LOOONG wait in the hot sun outside the restaurant, the wait was definately worth it!! The restaurant is a little divey with the usual celebrity pictures all over the walls, the Pizza was very very very good!! I would wait in the line again and again!", "author": "Jorge R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-23", "description": "After reading the hype and hearing about Grimaldi's I had to go while I was  NYC .I used a old Chicago trick to avoid the line outside. I went inside acted like I owned the joint and sat at one of the empty seats at the bar. Usually the service is better at the bar in any joint you go into. The bartender was slow and lazy so a guy named Raffi came over and asked if we ordered,etc. After about 15-20 min we finally order. I must say the pizza was delicious.The prices are reasonable for such a famous place.Bottle of wine,antipasto and a extra large pizza came to 60.00. I did notice alot of people waiting a long time  for service and food. My suggestion is don't wait in line more than 15-20 min because it takes awhile to get served inside. I'm sure there are other pizza joints in NYC that are close to being good  as Grimaldi's with no wait.", "author": "Fredo B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-13", "description": "Grimaldi's is new york pizza it its finest.  It is thin crust, with light sauce, and delicious cheese.  There are no frills, and everything is all about the pizza.  If you consider yourself a fan of pizza, you have to try Grimaldi's at least once, just so you know what pizza is supposed to taste like.\n\nWe went here after walking from Manhattan on the Brooklyn Bridge.  Grimaldi's is off the beaten path, but well known by locals.  Out of town guests will appreciate the authenticity, while locals will appreciate the value (3 adults stuffed themselves on a pizza for $25).  Even if you don't think you're a fan of thin crust pizza, Grimaldi's will change your mind.\n\nThe pizza arrived steaming hot less than 5 minutes after ordering, thanks to the coal (not charcoal) fired oven.  Truly a treat and an experience that can't be had often.", "author": "Troy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-03", "description": "I don't know if the coal oven was what did it but this pizza crust is sure tasty. Light and chewy, it's a great base for toppings. I like the fact they use crushed tomatoes and fresh mozzarella. \n\nFortunately, the line wasn't that long when I went so my overall experience was enhanced by the quick delivery of pizza to my mouth. Yummmmmmm.", "author": "Y C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-08", "description": "oh my! the wait felt like forever! we went on a Wednesday night and, of course, like how everyone described it, the line was long. It was also really crowded. I felt like our table was so close to the group next to us. \n\nBut anyway, we ordered a large with sun dried tomatoes, pepperoni, and sausage. And like almost every good place in New York, the wait and the long line was WORTH IT! the mozzarella cheese on the pizza was so warm to the mouth and so good. I've never had mozzarella on my pizza before (i mean, I'm from California and the pizzas here are generally cheddar). But hands down, it was the sun dried tomatoes that really made that pizza so freaken delicious. \n\nGrimaldi's pizzas are definitely a kind of pizza I think will be so hard to find in California :(", "author": "Jennifer Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-22", "description": "The Best Pizza EVER!   Get the sausage and pepperoni, you will die and go str8 to heaven  after you eat it... Just look @ my pic, I freakin live in that place... Thank you Ralph for the great service....", "author": "Vic d."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-02", "description": "Dont believe the hype - just another trap for tourists\n\nAs a newly NYer wanted to try out as I heard great things about the place, much to my disappointment. Got there yesterday (Sunday) night (started to queue at 8:30pm):\n\n- 45 min wait outside. Need to reckon the Gentleman at the door was pretty efficient and helpful despite the massive queue\n- 45 min between the time we seated and we got our Pizza\n- Finally got them, it was good but nothing special justifying the wait nor the price (on average $25 / pizza if you want reasonnable toppings)\n- None of the waiter ever checked on us at anytime\n- THEY DONT HAVE LIQUOR LICENSE, so no wine nor beer if you fancy a glass with your pizza\n- Check came: just a bunch a numbers written by hand on a piece of paper. Discovered they automatically added 17% tips - nothing on the check was mentioning it was the gratuity, and when we asked to double check, the waiter seemed really unpleased we asked. I dont want to read too much into it, but on the spot, my guests and I really felt like another round of tipping on top was expected. Nowhere it read that tip would be automatically added to the bill\n- Cash only place\n- When we left (around 11pm) one member of the staff was counting piles of banknotes on the counter in full view of everyone - never seen so many notes at once in my life. Felt really strange and awkward\n\nDeeply regretted bringing there guests who travelled out from California. NYC has much better places. Never say never, but I am not coming back to this place anytime soon", "author": "Emmanuel G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-15", "description": "The wait is riducously long! I'm alright with waiting if I'm going to be blown away, but after that long the pizza was just alright.  I would still recommend this place, but order ahead of time and take it to go and I think you will enjoy it more.  They are good at turning over the tables quickly to get people in, but it is a bit crowded.  I did like how you can see them making the pizzas and all the ingredients you can choose from, but I think they are a bit stingy on the toppings.", "author": "Mason S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-18", "description": "We thought we should try this place because of the high yelp ratings and we weren't disappointed. The wait wasn't as bad as we feared....only about 10 mins. You don't put your name on a list, you just get in line.  Be sure to check the great views of manhattan and the Brooklyn bridge just a few mins away too.", "author": "opqr s."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-26", "description": "As a New Haven, Ct local, I take pizza very seriously. So when my friend claimed that Brooklyn pizza was better, I had to see what all the fuss was about. Unfortunately, the hype was way overblown.\n    First of all, the pizza was not as good as Pepe's and even if it was the service made me lose my appetite. The owner, Old Man Grimaldi, is obscenely rude. I really do not understand how he does not lose customers with the way customers are treated. Twenty minutes into the meal old man Grimaldi gives us our check. Furthermore, I was holding hands with girl I went with and he creeply tells us that behaviour like that is not allowed at Grimaldi's. I do not know what this guy is thinking but I imagine that old age has done a number on his brain. For all those who want real old world Italian pizza, please do yourself a favor and go to Pepe's or Modern. And yes Old Man Grimaldi you can put clams on pizza.\n  Basically, there are much better resturants in Brooklyn. Please go and eat somewhere else for a better experience free of harassment.", "author": "Chad B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-20", "description": "I really am astounded when people wait in a long line for anything so I decided to try it.  I already been there twice.  It's coal brick stone oven pizza so that makes it unique.  The pizza is fresh and extremely hot.  The tomato sauce is extremely rich and acidic to the taste.  I find that the cheese is cut from those low sodium mozzarella balls.  It took 50 minutes wait to get in last time, and this time my wait was only 30 minutes.  If you order to go, you must wait on the same line--that was troubling to some people.  Sometimes, it does not depend on your place in line, but the number of people in your party and how it fits in their restaurant.  Once you get in, the place is packed, tables were placed anywhere there is room, same goes for the chairs, and there are lines for the bathroom. I found myself being bumped into by the guy sitting directly behind me. There is limited space, so you have to weave among the tables.  A pizza pie is $16, and the toppings are anywhere from 2 to 3 dollars each last time I went.  I believe there are two sizes of pies you can order.  Once you get in, you may have to wait five to ten minutes for someone to come to you and give you menus, and then another ten minutes for them to take the order.  It might be best to give yourself a block of 2.5 hours to eat here and enjoy yourself.  If you are in a rush, this will be stressful if you just want a quick bite.  My friends love it here, but I rather go somewhere local, since I'm not crazy about waiting.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-14", "description": "I could live at this place for the rest of my life and be completely happy! \n\nI love you Gramaldi's! its worth the wait.", "author": "Denise H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-31", "description": "Oh Grimaldis.. I had such high hope and had been told by many people to make sure I stop here, and it didn't live up to the hype. Don't get me wrong this pizza was very good, but not mind blowing. I was sad to have had better pizza in SF (Anthony Mangieri's Una Pizza Napoletana) but if you think about it he was a NYC institution for many years before coming to San Francisco. I wouldn't wait here again for the pizza, but would gladly eat it if someone brought some.", "author": "Mike K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-31", "description": "Food tasted freshly made but.... We went there as part of a way to see Brooklyn as we wanted to have the NY pizza experience.  It was the Sunday night on memorial weekend.  We waited over 90 minutes in line.  I give this place 2 stars because it's overrated.  Pizza was a little burned especially the crust.  They also ran out of ice, so I had warm soda.  Like others have said on previous reviews, it is a tourist trap!", "author": "Nick A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-21", "description": "With an apartment sitting beneath the Manhattan side of the Brooklyn Bridge, it's extremely tempting to walk across the bridge to Grimaldi's every time I get a pizza craving. I have been going to Grimaldi's with my father and sister for years, and never once have I been let down. I am a huge fan of the classic cheese pizza with extra garlic and pepperoni. Although the wait can be a little rough when it is 100 degrees out, I have never once had a bad experience here. By far the best pizza I have ever had!", "author": "Laurel S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}