{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-01", "description": "Delicious pizza and worth a stop when you're in Brooklyn! I've heard such great things about this place that it was at the top of my list of places to eat. They use really good ingredients: fresh mozz cheese, really salty and brimey black olives, basil, good pepperoni - it all adds up to a great pie. Beware, cash only! And I would advise not using the ATM in the restaurant since it charges you a $4.50 service charge, WTF!! No line or wait on a Tuesday afternoon was a bonus too. Just go, you won't be disappointed.", "author": "Kyla C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-07", "description": "Oh my goodness! This is seriously good pizza. Life-changingly good.\n\nWe ate at Grimaldi's in the dead of winter (February) of this year and unlike all the reviews, we got right in and sat down. It's cash only, and we were ready. It was 3 pm and we weren't hungry but had heard so many good things we thought we'd at least have a slice. Pizza is available whole but not as a slice. We decided upon the classic margherita. It came out so piping hot my glasses steamed up. And then, we each took a bite.\n\n((((AMAZING.))))\n\nThere is no pizza like this to be found in Florida, or Jacksonville. Yum! Grimaldi's does New York pizza right. And for two people who weren't hungry, we ate every single slice (3 huge slices -- EACH!) and waddled out, fat and happy.", "author": "Caron S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-19", "description": "PIZZAAA! I love the olives they use for their pizza! It's salty as hell, but delicious! I honestly don't like leaving the city just because it's such a pain, but grimaldi's really isn't that far AND I would definitely make my way there again! Though I jst found out they have a location in manhattan as well, so I guess I won't need to? \n\nMy friend and I ordered a small regular pizza w/ sausage, olives and fresh garlic. OH boy, the fresh garlic made the pizza just THAT much better. Next time though, I'll have to add extra basil!\n\nI have to say this is one of my favorite pizza joints. Try it if you haven't!", "author": "Jeanette Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-20", "description": "This place isn't worth it.  At all.\nNot only did we wait for an hour between 5 and 6pm to be seated, but we thought \"we'll call in a pie to go and get it in half the time\".\nBut guess what? They don't answer their damn phone.\nIt only becomes apparent once you've been allowed to enter that the restaurant is at about half capacity. \nLiterally, there are tons of tables unoccupied.  It's incredible.\nThey have this spiel about \"we refresh the ovens from 5-7pm\" which supposedly slows down the pizza output, but what kind of sense does it make to not seat people, thus making money on alcohol and other beverages while your parties are waiting for their food?\nThe owner wants passers-by to see \"the line\".  He wants to inflate the desirability of this place by leaving about 50 people out in the line at all times.\nWe were seated upstairs where we were under cold blue fluorescent lights and had freezing air conditioning on us the entire time.\nLooking below, the thick layer of dust on the photographs on the wall and above the bar was disturbing to see.\nThe loud James Brown blaring from the speakers was damn annoying.\nWhen we finally got our plain large pie after yet another hour of waiting, we actually enjoyed the first slice...\nThen things started to go downhill.  It became apparent that a good portion of the mozzarella was compromised - as in, it had that essence of mildew that mozzarella has when it's going bad.  I've experienced this at too many pizza joints in my lifetime, but to get it here was seriously pissing me off.\nHalf of the slices weren't cooked evenly so that the middle of the slice was almost raw dough.\nThe burnt basil browned \u0026 crisped in the middle of the pie sucked.\nThe best part of this whole experience? The Olde Brooklyn bottled root beer.\nMan was that delicious.  Seriously - it was the only enjoyable part of the meal.\nOur waiter didn't check on us once the entire time.\nAlso - the bathrooms are disgusting.  Toilet paper not even on the spool, but resting on the back of the toilet or in water on the floor, doors that don't lock, and paper towel rolls that are saturated with water from the sink because they can't bother to put them in the dispenser which undoubtedly doesn't work.  Pathetic.\nDo not - I repeat - do not waste your time or money here.", "author": "Beatrix K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-30", "description": "There's always a crazy long line whenever I come here. I'm pretty torn between Grimaldi's and Lombardi's.   Grimaldi's does some things better than Lombardi's, but the same goes the other way around.   I like that they use fresh ingredients and that they use ground sausage instead of sliced, but I like that Lombardi's chop their basil (it really makes a difference to me, rather than eating whole leaves) and the service better.  It also seems that there are more toppings offered at Grimaldi's which is nice because I think the sausage and mushroom tastes even better with garlic on in.\n\nI also love that it is located in DUMBO.  While in that area you can stroll over to Jacques Torres for dessert after and also enjoy the view.", "author": "Sandy J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-29", "description": "Oh Grimaldi's.... Where do I begin.... Well it was our first time in NYC, and we decided to do the cliché touristy thing and walk across the Brooklyn Bridge to head to Grimaldi's for what everyone touted as the best pizza in NYC. Well coming from Chicago where pizza is king, Grimaldi's had a lot of standards to live up to, and sadly it just didn't.\n\nI didn't mind waiting in the line. In fact, we only waited 20 minutes. But what appalled me was the complete disregard for customer service. I suppose if you're so busy all the time, customer service doesn't matter but this was just ridiculous. After waiting our 20 minutes and being seated, we waited another 15 minutes for someone to acknowledge our existence. Then another 10 minutes for someone to take our drink order. After finishing our pizza, it took our server over 30 minutes to bring us the check--even after we asked. Apparently flirting with another table and watching the Yankees game was more important. \n\nFor a place this busy, I don't expect memorable service, but come on--30 minutes for a check? You would think they would be more efficient. And what's up with the crazy Jersey Shore club music blasting?\n\nOh the pizza...yah it's okay but definitely not worth the hassle.", "author": "Herminia I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-30", "description": "you can really taste the fresh cheese and ingredients on the pizza with every bite. It got cold kinda fast though. However, there were only 2 of us devouring the big pizza. so it took a bit of time.\n\nthere was a tourist who came by himself just to try this place!\n\nWe got seated pretty quickly around 3:30pm since we were a party of 2.  The line was still very long at 3pm on a Sunday afternoon. When we finished and left, the group originally behind us was still in line waiting.\n\nso if you wanna try this place w/o waiting for hours, bring only 1 friend on a non-meal time :) I'll come again if I don't have to wait for hours. However, I don't know if I'm really in love with it so much that I would wake up early enough to beat the tour buses.", "author": "Ai L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-21", "description": "We were visiting from the Bay Area and our tour guide reminded us to visit Grimaldi's. It was totally on our agenda since we first discovered Grimaldi's in Scottsdale. We were a little disappointed by the pizza here though. The one in Scottsdale was so much better. We went on a Tuesday afternoon and it was 30 minute wait at around 3pm. We even heard people leave the restaurant and say \"over-rated\". Once we finally got in, the staff seemed pretty miserable. Our waiter was not friendly at all but the service was ok.  The pizza selection in Scottsdale was so much better.", "author": "T P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-29", "description": "I took a red eye to NY for one damn meeting (my eyes are RED as I type this).  I had very little time and a million things that I wanted to do.  Time was of the essence.  I decided Tri-State thin crust was a must to refresh my taco'd out Californian taste buds (New York, we can out-taco/burrito you with child-like ease *yawn*).  Since I made an explicit point to visit a friend in Brooklyn, I will kindly bow out of the Lombardi/Di Fara war.  Thus, I hopped on the train from West 4th and hopped off at High Street (subway genius, I have no clue if that monstrosity in L.A. works since I live in my car) to be greeted by friend.  Smooth-as-silk lovely.\n\nNow, I have contributed many ridiculous hours of my life to the Grimaldi line when I lived here for work and internships.  Thus, I was shocked--gobsmacked, to be precise.  When we approached the joint, instead of finding a line about 50 people deep, there were only FOUR people.  WTH, I turned and gave my friend a concerned, asking look, \"Has the place gone to bloody hell?\"  She was just as confused as I.\n\nThrilled as I was, I could not help but be, well, a little curious.  Okay, worried.  Bottom line: I was not about to waste my precious red-eye time on a snore-a-licious pizza, thus I conducted some quick reconnaisance on my way to wash my hands.  The enormous brick coal-fired oven was still there.  I could see the angry hot coals on the sidelines.  That oven's intense heat is the key to Grimaldi's consistency and I was relieved to see it piping hot and still popping.\n\nShame on me for doubting.  Our pizza was outstanding!  Just as great as I remember it to be, the pie is standard-bearer thin with a crust that boasts that perfect balance of charred chewy and satisfyingly crunchy.  Toppings are so flavorful--from the buffalo mozzarella to that sausage!  The sausage they use at Grimaldi's is superb--quality Italian sausage of moist, firm consistency, robust of flavor from aromatic fennel.  They drizzle the whole pie with a tomato sauce so tangy good you will be pondering it as you devour like a wolf.\n\nInterior is what I would call confident and sure:  \"We don't care, we have a good thing going here.\"  Nonetheless, as a fan of Ol' Blue Eyes, I can't say it bothers me one bit.  That said, I wanted to eat outside like I used to.  It's the way to go.  With a view of the stunning Brooklyn Bridge and peerless Manhatten skyline, gorging on excellent pizza with a childhood friend, I cannot think of a better way to become a blissfully peaceful balloon.", "author": "Dee C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-15", "description": "Grimaldi's pizza is okay but given the reputation and the fact that people stand on line to go there I was expecting it to be a lot better.", "author": "Rich M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-30", "description": "My favorite pizza place in the country. I live in Boston, and regularly make the 3-4 hour drive to NYC, because I love New York. It is my favorite city in the country. And this is my favorite restaurant in NY. The pizza is phenomenal. Every single time I go to NYC, I make the trek to Grimaldi's, and I am never disappointed. It's usually crowded and packed, but it doesn't matter. I'll always come back here for the delicious food.\n\nFor all the people complaining, you must have gone on an off day. And for people saying \"there's much better pizza elsewhere in NY,\" you should probably name some of these restaurants/pizza places... I'd like to know what they are so I could try them out. I can't imagine pizza being any better than this place, and I've been probably 6-7 times and it's been consistently awesome every time.", "author": "Sam O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-31", "description": "Defiantly one of the best pizza i have ever tasted, but the line was too long.\nI think it is Grimaldi's strategy to make people hungry by waiting in line.", "author": "Robert C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-05-17", "description": "Really good pizza (with cream soda).  Most of the time, Sinatra is playing.\n\nNote: Really long lines (unless you get there before rush hour) and Cash only.", "author": "Caroline N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-20", "description": "The lines are ridiculous. Got there about 5:45pm and it wasn't too bad.\n\nPizza is amazing. People who say it's top 10 or whatnot in New York aren't kidding. Crust is cooked perfectly in their coal fired oven, the sauce is a delicious compliment, and the cheese... is clearly more than a cut above average. We had a large pepperoni and two beers, and the pepperoni had just the right amount of spice and chewiness.\n\nBiggest issues are the lines and that our antipasti never arrived. They noticed this and took it off the bill (and even asked if we wanted it when the pizza came-- we had pizza already, we don't want the appetizer dammit!).\n\nBeing from a state that doesn't have any good pizza at all means my taste buds spent ample time at other NY pizza places on every trip I make to NYC, and Grimaldi's is by far the best I've had. That said I do know I need to hit the other top places in NYC on my next trip...", "author": "Brian W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-20", "description": "Grimaldi's is New York Pizza at it's best, but it's not your typical slice.\nIt's a little confusing to get to if you're an out of towner and don't have a GPS.\nI once called there for directions and was told that they were under the Brooklyn Bridge, just take a train to High Street.\nGreat, maybe I'd be better off finding it if I jumped off the bridge.. it'd be quicker.\n\nOnce I did find it, I'm glad I did and I've been going ever since. This place has gotten so popular that there seems to be a wait all the time.. it's actually not that bad since they have a high turnover of tables, they serve the pizza faster than it took me to write this!\n\nI recommend keeping it simple, too many toppings can spoil a good thing. I usually order without anything.\n\nAssuming you are staying in the city and the weather is nice, head back over the bridge on foot since the stairway to the walkway is nearby on Cadman Plaza and Prospect st, it's very pretty.", "author": "Jeff G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-30", "description": "I'm not an expert on pizza, but I know what I think tastes good, and this pizza satisfied me on  many levels.  Just the right amount of sauce and fresh mozzerella, with basil.  So good!  \n\nWe came right when they opened, so maybe this affected the oven, but I thought the crust was a little overdone and burnt.  Otherwise I would have given five stars.", "author": "Lisa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-11", "description": "Probably don't need to read a review of this place, as it is probably one of the bigger iconic restaurants to visit when in New York.   Bigger style pizza than Luzzo's, and I would still choose the latter any day of the week, but it's still really good.  \n\nThe line is absolutely crazy for this place, especially around lunch.  So be prepared to wait.  You can call in your order and pick it up, but if this is the first time you're visiting...it might be well-worth the wait.  \n\nService is friendly, and they do not except credit cards...you're in luck tho, there's an ATM inside the restaurant.", "author": "Jay B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-24", "description": "The first time I went I thought it was overrated and not worth the wait. We got there when they were resting the coals..so the wait was awful. \nThe second time my friend was visiting wanted to try it my first thought was how I didn't want to wait in the cold when I could walk half a block to Artichoke. This time, I'm not sure what changed, but the wait was shorter and I liked the pizza so much more. They are still stingy with the basil but the pizza is nice and thin, piping hot, and the sausage is the kind that I like. I would only come back when visitors insist but next time I wont grumble. It's nice that its right by the bridge too, for views of the city and Brooklyn ice cream factory.", "author": "Lainy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-04", "description": "It would have been ludicrous for me not to include at least one pizza place on my recent trip to NYC and out of the millions of pizza places I decided to check out Grimaldi's.  \n\nWe waited in line for maybe 20 minutes around lunch time on a Thursday.  The inside of the restaurant squishes as many people as they can into it so you end up sitting next to strangers.  Everyone is so focused on eating their pizzas it doesn't really matter - it's like pizza tunnel vision.\n\nSuper simple menu with a lot of different toppings to choose from.  We ended up getting a large pizza (for guaranteed leftovers) with sausage, pepperoni, and mushroom.  Pizzas come out of the kitchen pretty fast - I'd say within 10-15 minutes. The first bite of pizza had that gooey cheese ooziness that I love and all the ingredients tasted super fresh and flavorful.   I loved the pepperoni and sausage on this pizza.  YUM.\n\nWould definitely recommend.\n\nCash only!", "author": "Kim-van T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-12", "description": "Do not come here for their service.  Come here strictly to get their pizza and don't expect to get more than 1 glass of water for the duration of your entire meal because the only times you have access to your waiter is when you order and when you pay.  \n\nThey use fresh mozzarella on their pies.   There's more oregano in their sauce than what I'm used to but overall, the pizza was good.  Their pizza dough is on the chewy side and seems lighter than regular NYC slices.  I ate 4 slices in one sitting and didn't need to be carried out in a stretcher.  The pizza was either really good or I was just really hungry.  I'm going to say it was a mix of both.  \n\n10pm is when there is no line.  Expect to wait 20m-30m before 10pm.  The wait time seems to have been reduced since they moved to their new location.   If coming in groups (more than 2-3 people), expect longer wait time.", "author": "Christine T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}