{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-03", "description": "Pizza wasn't mind-blowing, but it was pretty good.  The two of us waited about 1 hr in line before we were seated.  The line may look daunting at first, but actually moves faster than expected.  I didn't like our seating arrangement.  We were wedged between two other couples as if we were sitting in a communal table. I thought Brooklyn was supposed to have more space than Manhattan.... There also wasn't much service as the place was intent on having high table turnovers due to the line outside.\n\nAnyway, back to the pizza, we ordered a large (8 slices) with ricotta cheese, sausage, pepperoni, and mushroom.  Too bad the center of the pizza was soggy even when fresh from the oven.  As expected, it tasted very fresh. We each ate 3 slices.  Yay for leftovers!  However, I don't think I'll want to trek all the way to Brooklyn and wait for slightly soggy pizza again.  Go if you must because of the hype.\n\nFYI, it's cash only and they don't sell by the slice.", "author": "Terren J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-06", "description": "Not as great as everyone makes it out to be and not really worth the wait in the freezing cold. It was awesome that is was right under the brooklyn bridge!!! However, the pizza was good but not the best I've ever had. The service was ok considering how busy they are. The owner was walking around being super creepy and yelling at his workers. He watched us as we were leaving the money for the meal and tip which was kind of awkward. I definitely think it's a bit overrated.", "author": "Zohreh A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-25", "description": "Grimaldi's is one of my top three favorite pizza spots in the city.  They use very fresh and delicious ingredients with an authentic thin crust.  The only negative is the fact that I've never been to Grimaldi's without encountering a long line out front (this says a lot about the restaurant).  Walking over the brooklyn bridge, ordering take out at Grimaldi's and enjoying it on the water is a great activity for a sunny day.  This allows for beautiful skyline views of lower Manhattan as well as an authentic and slightly less touristy experience (still touristy, but nothing like midtown).  Grimaldi's in Manhattan or New Jersey might be just as good but with no line - something to consider.\n\n-Rhino", "author": "Ryan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "This is the best pizza I've ever had, each slice tastes so fresh. If your in the Dumbo area its a must!!!!", "author": "Sabrina Diamond J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-18", "description": "Overall unimpressed. Pizza crust edge was slightly burnt. Waited in line over 1 hr. Pizza was ok. I wouldn't recommend - far too many other places to try. Cannoli was very good - not filled all the way thru!", "author": "Mark H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-10", "description": "Get the white pie. Just do it.\n\nWhen I asked my dining partner if he liked white pies and he said no I died a little inside. I'm trying to grow as a person so I didn't whine and moan to get my way as I am wont to do. \"It's his first time after all\" I thought to myself,  \"I could acquiesce this once.\" \n\nWe ordered a small pie with pepperoni and sausage and it was great. Juicy tomato sauce, bite sized pieces of sausage and slightly thicker than normal pepperoni slices. Just like everything else the tomato sauce is fresh and full of flavor but the pie just felt a little bogged down by it. \n\nAt least for me a white pie with extra basil is always the way to go.", "author": "vanessa g."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-08", "description": "This place is WAY OVERHYPED. They just moved a few buildings down. Here's the deal:\n\n- Food is AVERAGE (nothing special)  I've lived in Brooklyn 23+ years and I know a lot of pizzerias that make DELICIOUS pizza.\n- Service SUCKS big time.  The waiter we got was straight up from Italy and barely spoke English and had the attitude like he was doing us a favor by serving us  food/drinks.  The host (owner?) was a miserable old jerk off.  Italians are usually friendly, but not this bunch...NASTY attitudes.\n- Decor at the new place sucks.\n- Included the tip in the final bill, even though it says that only applies to party of 6 or more (there were 4 of us).\n\nAt least there was no line.  I think the only people that go here are tourists.  Locals stay away (I had to go because my out of town friends dragged me here)...\n\nNOT COMING BACK to this AVERAGE place.", "author": "Konstantin K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-18", "description": "I love this place!!  We took 8 friends with us the last time we were in town and it was soooo good.  This is \"THE\" place to get NY style pizza... I can't believe how good a simple pepperoni pizza was... I swear I could eat that all day long... you just won't want to stop.  Go ahead go for that 2nd pizza and just walk the Brooklyn bridge back over to Manhattan.  I will go here whenever I visit NYC.   Fantastic!!!  You won't be disappointed.  \n\nNice Brooklyn Ale's too!", "author": "Julie R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-07", "description": "Long wait outside. Long wait inside. Pizza average. I'm sorry to say, not worth it... \nMeh.", "author": "Ryan F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-25", "description": "This is the kind of pizza that makes me hop on a plane for 6 hours. \n\nYummy pizza. \n\n** The wait is well worth it!", "author": "Vera D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-25", "description": "This is the best pizza I've had in my life! Coal fired pizza is the way to go! The cheese is incredible too and I loved the sausage and pepperoni toppings.\n\nMy group got there at 11:30, 30 minutes before opening and the line was long, but we were part of the first group to sit down.\n\nThe only problem was that the air conditioner was blasting even though it wasn't that warm outside and it cooled off our pizza way too quickly.", "author": "Tomas P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-22", "description": "Damn good pizza but I wouldn't wait more than 30 minutes for a seat. My party of 5 polished off a large and medium. We could have easily eaten 2 large pizzas. They only sell bottled soda, so no refills. Seating is kinda tight, especially if you have a party larger than 2 people. Seating upstairs is close-quartered. Service could have been a little better.", "author": "Ron M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-26", "description": "I can easily say that after our one week trip to New York, this was the best pizza. It wasn't an unbearably hot day when we went, but I would have gladly stayed in line for the 30 minutes that we waited just to get another slice of this pizza.\n\nAfter we got in and ordered a Brooklyn Root Beer, a Large pizza with sun-dried tomatoes, pepperoni, and mushrooms, I headed over to the rest room. Even waiting in that line was awesome. You get to stand near the brick oven where this mario-mustached Italian man masterfully shoves pizzas into the oven while his minions rapidly slap on mozzarella slices and tomato sauces on the pie dough.\n\nOnce I got back to the table, the pizza magically arrived. With the steam rising, we eagerly took our pictures and then grabbed slices. The cheese pulled and oozed only in ways you could dream of. It was damn tasty and worth the awkward train ride out there from Manhattan.\n\nRecommended! Probably should have walked to Brooklyn Bridge to work it off, but eh!\n\n(Cash only, and it's definitely nice that they put a water jug out there for people in line)", "author": "Luân N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-25", "description": "The benefit of being a tourist is that you can go on a random week day right before they open to avoid the long wait. :)\n\nThey have a \"Godfather\" theme going on.  Their interior is small, but pretty clean and comfortable.\n\nTheir location right by the bridge and the whole eating experience gives them the additional 1 star.  Afterwards, we found the perfect scenic spot for photo-ops with the two bridges(Brooklyn/Manhattan) serving as the back drop.  \n\nWe ordered a regular large pizza topped with ham, sausage, and mushrooms.  The white sauce pizza looked quite delicious, but it would've been too much if we ordered two pizzas.  Unfortunately, they don't serve pizza by the slice. Instead, we ordered the antipasto, but it was nothing to rave about.\n\nI prefer NY-style pizza over Chicago-style.  I was hoping that Grimaldi's would be very good despite hearing that Di Fara's is better. Unfortunately, Di Fara's Pizza is further and out of our way.  \n\nIn terms of taste, Grimaldi's pizza was standard.  When you're hungry, it'll probably taste better, but when you're not that hungry, it's just \"okay\".  The crust was thin,  crispy at the outer edge, but disappointingly wet (soggy) on the inner circle.  \n\nIf you want to experience Grimaldi and see the bridge, then it's a good place to visit.  Otherwise, I'm sure you can find other amazing pizza places in NYC/Brooklyn areas.", "author": "Linda H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-24", "description": "I'm glad to say I went here because of all the hype, but I believe that it's a little overblown.  The pizza was really good, but I don't think the wait is usually worth it.  The prices, though, were great.  Overall, if you see that there is no line, or just a short one, then go to Grimaldi's; otherwise go back another time.", "author": "Cameron G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-09", "description": "Took a trek to Brooklyn on my day off to finally try Grimaldi's. I was really excited and  was willing to wait no matter what since last time we visited Brooklyn we ate at Juliana's pizza instead because of the long wait here. Surprisingly on a friday afternoon the line was moving and my boyfriend and I only had to wait for 15 mins to get a table. We ordered a large pie which gives you 8 slices so that we could bring home some leftovers. I love pizza for breakfast!! Small plain pie gives you 6 slices for $12 while large plain pie cost $14. We had toppings of sausage, pepperoni, mushroom, and jalapeños for the additional of $2 for each topping. Because of the name of the establishment, the pizza sells itself so the staff does not have to perform above and beyond for service. Service is quick and curt.  The pie taste good but I had better at Juliana's pizza next door or at Lombardis Pizza. There's too much sauce in the middle of the pie which makes the pie soggy and the crust did not hold the toppings well. They should put more sauce at the edge of the crust instead. With all the hype, I thought we were eating at the original Grimaldi's because of all the great reviews and long line. The real truth is Juliana's pizza next door is the real deal. Patsy Grimaldi sold his business in 1998. After some leasing problem Grimaldi's moved to this location with a new oven. The landlord offered Patsy Grimaldi the original coal oven location at 19 Old Fulton Street back in which he named it Juliana's pizza, a tribute to his late mother.", "author": "Trang T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "Kick ass pizza. The line is long but it moves fast and service is fast as well. I love everything about this place.", "author": "Zack N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "Excellent! HUGE RIDICULOUS LINE outside at sub-zero temperatures, but the 2 hour wait was worth it. Maybe it was because i'm hungry but i'm definitely coming back.", "author": "Eduardo F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-29", "description": "Grimaldi's is a good enough reason to cross over into Brooklynn!\n\nI arrived at Grimaldi's at around lunch time on a sunny Sunday afternoon to find a line of people waiting for a table. Not a surprise. Initially I was overwhelmed with the line and I was hesitant because I was suppose to fly out that Sunday evening.I tend to panic when I'm not at the airport (even if my flight was suppose to depart 5 hours later). With the majority vote we stood in line. To my surprise the line moved rather quickly and next thing I knew I was sitting upstairs with a menu. We were all starving and worked up a huge appetite in line and was ready to pounce. We ordered a large regular pizza with pepperoni and sausage, large white pizza with onion and mushrooms, and a small margarita. My favorite was of course the meaty pizza. The cheese was oozy and the crust crispy. My second favorite was the margarita. On most occasions I would never order a margarita because it's too plain and no meat. Even though there was no meat I really liked the simplicity of the margarita. Since there was no salty meat toppings I was able to truly enjoythe delicious cheese and sweet tomato sauce. I did not like the white pizza. I can do without meat but hell if I have to give up sauce! Love the pizza and I service was to par. I would definitely go back when in town.", "author": "Mimi L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-23", "description": "I'm not gonna lie... I was in more for the hype than anything else. I'm sure the stories of long waits and lines that wrap-around-the block made my desire to have this pizza more insatiable but once I got it and took a bite, it was just another pizza. \n\nIt's definitely more so the idea of 'Grimaldi's Pizza' under the Brooklyn Bridge that's selling the pizza rather than the taste of the pizza itself. \n\nIf you haven't been there at least once, it's worth the first trip :)", "author": "Young P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}