{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-30", "description": "This is some of the best pizza I've eaten in my entire life.\n\nThe crust is nice and thin with that perfect bit of crispiness on the bottom.  The sauce is great, just the right flavor, not too sweet, overall very well balanced.  The toppings are plentiful, especially the cheese which is sliced mozzarella (instead of the shredded cheese that most places use) and ensures thorough coverage of the whole pie.  They also add some shredded basil on the standard cheese and pepperoni which really takes it to a whole new level.\n\nI can't say enough about this place, it's really excellent and it's not hard to get to, just a few blocks off the subway.  We went there on a Sunday afternoon and there was a pretty good line but it was totally worth the wait.\n\nJust a couple of things to keep in mind: it's cash only and they only sell by the pie, not by the slice.  But really, they could have a rule like \"you must sacrifice your first-born child to the almighty Pizza God in order to eat here\" and I gotta say... after tasting this pizza... I'd think about it.  For at least a few seconds ;)", "author": "Cliff M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-18", "description": "Wow I got here pretty close to 11:30 on a monday and the line was already pretty crazy, even for take out.  Waited a good 20 minutes, maybe it was because a huge tour group arrived right before us taking up all the space.\n\nWe ordered the bianca (white pizza), and the regular pizza with pepperoni and mushrooms. \nThe ingredients were fresh and the cheese was delicious.  Coming to new york we just had to get a new york style pizza, and I was not dissapointed by Grimaldi's.\n\nI'm not sure it was the best pizza I ever ate, but it was definitely a good pizza.  If not for the wait i'd probably come here again next time I'm in NY.  I'll probably try other places next time to see what else is out there.", "author": "Alan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-06", "description": "Best pizza! Anchovies or pepperoni are good. The wait sucks, but it's worth it. I actually didn't like it the first time I had it, but went a second time and it\"s definitely good! Just don't let the wait bring you down. Expect it and have something to do, and it won't dampen your meal when you finally get in!", "author": "Diane Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-31", "description": "It's really 3.5 to 3.75 stars.\n\nWe ordered the Margherita pizza.\n\nThis pizza is only good if consumed within the first 5 minutes that it comes to the table.  Once it gets cold, the cheese tastes rubbery and it just doesn't taste right.  I wish I would put more sauce on the pizza for that tomato-ey taste.  The crust is yummy as well.  Again, the pizza slice taste best if consumed asap.  I would never order this pizza as a take out.  I can't imagine reheating this pizza and making the thin crust a little too crispy.  It's perfect the way it comes out the gigantic brick oven.\n\nWould I come back?  No.  The line was 45min to get in.  We must have waiting 15-20min before we got our food.  I'm sure there are other places with great pizza and shorter lines...more non-touristy locations so I can spend more time eating and enjoying nyc rather than standing in long lines.", "author": "Tina D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "It was so worth the hour long wait outside. My friends and I really enjoyed it. They let you pick toppings you want on your pizza. It's $2 for half a pizza and $3 for it on a full pizza...you might as well get it on your entire pizza. It was extremely greasy but that's what made it so good. The cheese is the best part, I think. The staff was pretty cool. Make sure to bring cash. It's CASH ONLY.", "author": "Victoria C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-14", "description": "This is by far my favorite thin crust pizza. I'm from the Chicagoland area and I happened to catch the show \"Pizza Wars\" that discussed the rivalry between deep dish and thin crust. Hearing about Grimaldi's, Ray's, and Lombardi's made me go on a quest to find out if NYC pizza really beats out the cheesy goodness that is deep dish. \n\nThe results: jury is still out. I wasn't able to make it to Ray's, but I found Lombardi's and Motorino's (voted best pizza in the city last year) were decidedly inferior to Giordano's stuffed pizza (only in my opinion). Grimaldi's was a different situation though. \n\nThis is gooooood pizza. It felt like fireworks went off in my head when I put the slice into my mouth. It was beyond delicious. Pretty much all of my senses shut down with the exception of taste- it literally forced my eyes to close. Their sauce is extremely flavorful and they use the most exquisite mozzarella. We got ours with green peppers and onion.\n\nThe price is such a great deal. I paid $15 at Motorino's for a little personal pie that I wouldn't choose to eat if it were free. Here we paid $18 for a large (the only size they have, I think?) and it fed four of us...I actually had to give half of my 2nd slice to someone else (and it pained me to do so, but I was full). What a deal.\n\nThis is another NYC staple that I will return to on every trip to NYC. The fact that it's just beyond the Brooklyn Bridge is just a wonderful treat. We walked the bridge after our meal, but next time I'm going to walk it before eating! There will always be a wait, and guess what, patience is a virtue that is greatly rewarded here. I don't care if you're about to die of starvation, you need to wait. We only waited 20 mins (which is nothing if you're with friends). I'm pretty sure I'd wait for an hour in line if I was in the mood for Grimaldi's though, it's that good. Enjoy!", "author": "Monica R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-01", "description": "I have a few loves in the world...my kids, my wife, my mom, cheeseburgers, pizza...you get it. Junk food is my vice, if I could I would sustain on pizza and cheeseburgers. If Los Angeles is the burger capitol of the world, NY can be the pizza capitol (although Chicago may have something to say about that...). In this giant pizza town, there are ton's of places to chose from some great (Grimaldi's/Lombardi's) and some not so great (Rays).  \n\nGrimaldi's is one of the many spots in NY that you could easily miss while walking by. The benefit they have here is there is always a line out front, tourists, locals and foodies all anxiously waiting for their first pie or the returning clientele waiting to scratch that itch. Grimaldi's is an old school coal brick oven pizzeria made the old fashioned way with clean fresh ingredients.\n\nI had two pies (don't even think about asking for a slice), a white pie and a pepperoni. The white was amazing, full of flavor, the cheeses were perfectly melted and the fresh mozzarella was sill very moist. The pepperoni was great too, fresh mozzarella, and pepperoni's that had great pop. Washed this greatness down with a Peroni and followed that up with some good olde fashioned Brooklyn Soda.\n\nGrimaldi's is very similar to Lombardi's. Both are brick oven pizzerias, both are very very good. The key differences, Grimaldi's is a lot less greasy and Lombardi's was the originator. Grimaldi's has done a great job of taking a great idea and perfecting it. Highly recommended, BIG B APPROVED.", "author": "Bryan E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-29", "description": "Never coming back here again! We went on a Friday afternoon and were seated immediately. The staff was extremely rude. They didn't refill our water until we asked the third time around. They brought the check before they refilled our water. The pizza is mediocre at best. The crust was chewy. My jaw was in pain after eating. I'm not even being dramatic. My friends felt the same way. Overall, terrible food experience.", "author": "Blessen J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-22", "description": "So at one point in the not too recent past, you could just call them and order pick up while downtown, and by the time you had taken the train, walked past the park, in front of all the people with \"I Heart NY\" T-shirts and into the store, your pizza would magically appear the second you walked up to the counter and said \"I have called in a pie for Garrett?\". This no longer happens.\nA friend and I once made our way, slightly intoxicated, down to the water to eat the pizza, and upon leaning on the railing, said friend shorted out the string of lights running the length of the rail and almost caught his cardigan on fire. Funniest moment of the month, that.\n\nHowever, me not being able to call in my order, and having to stand with all the other people in a 2 hour line? Yish. \nWalking over the bridge reelevates this to a 5 star, but it's only really nice to do for a handful of months out of the year, and even then only when it's not raining.", "author": "Garrett P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-29", "description": "I'm that guy that reads reviews..I see people raving about how great the restaurants food is.. and I go in ready to critique the shit out of that spot... but.. I serious enjoyed the lightness of the pizza. The main reason I liked the pizza was because of how thin it was .. meaning I'm getting more sauce.. more toppings.. a better taste for it than the heavy dough. I went here yesterday with my family that came down from Florida.. my cousins husband said.. \"Man.. this shit was ight! Nothing special\" I agree in terms of the size.. and even the flavor... the meal will not blow you away... so.. was it worth the 1 hour wait in the sweltering heat? To me.... YES! because I enjoy light \u0026 somewhat healthier pizza. I loved that the slices weren't too greasy.. there was hardly any grease once I folded that pizza for a better bite.", "author": "Dre D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-21", "description": "Didn't like this pizza very much, but good effort.  Perhaps we just ordered the wrong toppings combination or they were having an off day.\n\nOf course when you're writing a review, you compare the food with other places that are similar.  With that said - I couldn't give this place more than 2 stars.  I've had pizza at a couple of places in NY and this place was definitely on the bottom of my list.   Maybe I'll come back to try it again, but I won't keep my hopes up.", "author": "Grace K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-21", "description": "We waited for the doors to open one Wednesday morning after picking up some kegs in Brooklyn for an upcoming party.  Probably took about 5 minutes before they let us in, then 3 minutes to order, then a little bit longer to get and eat our pizza.  By the time we were done Grimaldi's was starting to fill up but still wasn't full.  \n\nThe pizza lived up to all kinds of hype.  It was all about the crust and the crust was fantastic.   Would I wait an hour in line or it?  No, and you're a jerk for insinuating that I'm that stupid.  It is still just pizza.  Act like a new yorker for once and go when you are randomly in the area at an off time.", "author": "Paul B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-03", "description": "Look.  It's Brick oven pizza.  You cant mess this up.\n\nI read a joke a while ago in a chain email that said something like, \"you know you're a New Yorker if the best pizza place in town is around the corner from your house.\"  I'm guilty of this, because I think that Rosa's Pizza on 69th in Maspeth is the best pizza in the world.\n\nThat said, Grimaldi's is a must-visit, especially is the line is short.  Here's a tip: go when its raining or snowing.  Nobody on line and you'll be in and out in 20 minutes.  \n\nThe ambience of the place is stuffy, kind of dirty and the employees are especially douchey.  My guess is that it's like that on purpose because this is New York and tourists from Europe want to see it that way.  \n\nWhen I walk by (my office is blocks away in DUMBO) and see a line that looks like it's literally 100 deep I have to shake my head.  But I get it...  It's Brick oven pizza", "author": "Roger K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-31", "description": "The pizza was amazing. It was everything I could've wanted.\nHowever, for the length of time I was outside waiting in line, I would've eaten my own arm off my body and it would've been just as delicious.", "author": "Richard S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-25", "description": "We went early on a Thursday, slightly after 5 pm to beat any dinner crowd and it worked. There was no line and we were seated right away. \n\nThe interior of the restaurant had a lot more seating than I had expected. The lighting was fairly bright and it seemed like there were just as many people taking pictures of the pizza as there were people eating it. We were seated at a 2 person table right next to the front door. \n\nWe ordered a large, half with mushroom and half with pepperoni and ricotta. The pizza arrived fairly quick, very hot.\n\nThe taste was good. Not unlike Lombardi's or John's, it had a layer of cheese with sauce on top. It wasn't as thin or crispy as Lombardi's or John's but it was still very good. \n\nPart of our pizza had a pretty big hole in it and also some lumps of raw flour stuck to the bottom, but besides that it was good. A little care in the making of the pizza would've been helpful and to not give us a pie they messed up that badly would've been professional and courteous, but they didn't. \n\nI'm giving it 3 stars because there was no wait, but living in Manhattan, I wouldn't go out of my way to go here for pizza when two superior choices exist in the city. \n\nI also noticed when I was leaving that there were 3 free tables, with a total of 10 free seats. Yet when I walked outside, there was still a line beginning to form. And when people walk by and see a line outside of the pizzeria, they automatically think, it must be the best pizza... Maybe they make people wait just to add to the myth of Grimaldi's pizza... It's certainly working.", "author": "Bobby C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-28", "description": "If I had an option to not rate I would! They have the worst Customer service ever! We came all the way from California \u0026 walked the Brooklyn bridge in the damn rain to get the worst service! My friends and I decided to go next door to Juliana's which is amazing!! The food and service is beyond! Plus it super cute! Drop grimaldis and go to Juliana's", "author": "Beatrice H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-08", "description": "Great place to check out if crossing the Brooklyn Bridge.  I would certainly go back.  Great pizza!", "author": "Sidelaker M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-11", "description": "I struggled with this rating, but in a city of such amazing pizzas, you can't throw around stars lightly! \n\nGrimaldi's serves yummy pizza, but seems to be losing its luster, particularly in comparison to other classics like Lombardi's or even those rare, delicious hole-in-the-walls. The mozzarella tastes fresh, the crust is perfectly crisped, and the white pizza is particularly stellar. But something's amiss in the flavoring, as I watched multiple people add salt to their pies. I even did this myself, and that's a rare necessity with pizza. Everything is baked so fast, that there's just not enough time to allow ideal heating. The pizza gets cold much more quickly than it should, and the temperature's tepid by the time you get to the second slice.\n\nThe place has old school charm, with checkered tablecloths and Olde Brooklyn Soda. The waitstaff, unfortunately doesn't complement the mood, and usually treats customers gruffly. They tell you to \"hurry up\" in one of those joking tones, where you know they're not joking.\n\nStill, the price is right and the pizza is good, maybe even great, so it's worth a visit to this institution. Just keep that line in mind (which knocked my rating down) and bring patience! Or at least some beer.", "author": "Jessica E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-14", "description": "I like this place, but it is hit or miss. The toppings are great thats never bad. The most recent time I went here the middle dough was still gooey. The crust was perfect though. The lines arent as bad as they used to. I would recommend my guests and friends to try it out, but I would never push a group of friends who have already had it to go again.", "author": "KC C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-27", "description": "This place blows.\n\nFirst let's talk about the line and it's truly uninspiring way they deal with it. Why bother having a line if you're just going to pick and choose who gets in from the freaking line! Why bother waiting! Retarded way if dealing with a line\n\nNext let's talk about the service, or lack there  of. We come in and they seat us and we order. We're thinking that it'll be 20 minutes for a pie to come. Let's go 1 hour into pour seating and we find out they're cleaning the fucking oven. Really?? Tell your customers that before sitting them! We would have gone else where for f sake!\n\nI'm surprised they're still in business \n\nIf I could give no stars I would, don't ever come here. Ever", "author": "Johnny T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}