{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-27", "description": "The pizza was just above okay in this place - I'll give it a 3.5 stars however the upstairs doesn't have sufficient ventilation so think twice if you are planning to visit during a hot sunny day! Also it's a bit hard to get the attention of the server as it's quite crowded.", "author": "Koray A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-09", "description": "It was national pizza day so I chose the \"famous\" grimaldi's as the place to pay my respects to the pizza gods. Sadly, the pizza gods did not smile kindly upon me...\nShort story: I've had better pizza (and service) from a $1 pizza store!\nFirstly, although the restaurant was quite empty, the 2 of us were seated at the very back of the restaurant next to a gusty window, back door, store room and ATM machine. This wouldn't have been an issue except all those open doors/windows left our pizza cold within a minute after it arrived on the table.. The winter wind borderline sucked the pizza out the door! \nWe ordered a mushroom pizza with extra mozzarella. Although these toppings themselves aren't particularly strong... Even plain pizzas are supposed to be good here..apparently. \nAnyway...the pizza had no taste whatsoever besides that of bread in my mouth. Also, no goodbye and thank you after our meal from the loitering staff either. \nGrimaldi's...you used to be cool.", "author": "Dot C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-29", "description": "Finally came back to Grimaldi's after a many many years hiatus. I'm sad to say I was quite disappointed. The new location is nicer and roomier but the pizza itself was lackluster. I ordered a large plain pizza. I expected a crunchy thin crust but instead it was doughy and soft. Not the way Brooklyn pizza should be!! Maybe it was a fluke but that pizza was sure not as good as I remember it to be. :/", "author": "Yan N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-20", "description": "I'm not sure if this place is worth the wait in line.  \n\nI like my pizza's packed with flavors.  Granted their thin crust is nice and soft.  As for toppings and flavors.... I just want's too impressed.\n\nStill worth the try.  I would give this place a solid 3.5 / 5.", "author": "George B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-08", "description": "I really enjoyed the Pizza but not the wait. \n\nThe guy letting everyone in would seat couples of two first. as opposed to combing tables and seating four. \n\nIt's almost a punishment to come in a group... \nTHEY ARE CASH ONLY! \n\nI do recommend the pepperoni. \n\nI did not like the sausage, I thought i would be getting Italian sausage....not crumbles.", "author": "Christina M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-18", "description": "So, I'm having trouble giving this place the three-star rating that I am. Based on the hype (and Yelp reviews), Grimaldi's is supposed to be a New York pizza institution (pizzatution?), a mind-blowing cut above the rest. What I tasted here, however, did not impart that gust to my brain. \n\nWent last night at around 7pm, and didn't have to wait in line (score). However, we did have to wait a good amount for the pizza itself, which was slightly irritating, but a good sign that it was made fresh to order. My friend and I just got a plain, regular pizza with red sauce, in the \"small\" size (which is, in fact, more than large enough for two). It was good, and obviously made with quality ingredients, but I think there was something off about the cooking procedure...the crust was too chewy, the basil was burnt, and the cheese was rubbery and stringy. It also got cold pretty quickly, which is likely a factor of it being thin crust, and the cold weather outside. All in all, it could've benefitted from less time in the oven, and probably also less time on the pizza pan (our fault).\n\nBeing as it is very fresh and affordable ($12 for a small and $14 for a large), I'm willing to give Grimaldi's another chance, someday. It might not be for a while, though, as I think there's better pizza to be had in New York City.\n\nPS: CASH ONLY", "author": "Brinda A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-21", "description": "Came here for dinner on a Wednesday night and got a table immediately (guess I was lucky!). The pizza arrived pretty quickly but the taste wasn't as impressive as I thought it would be. I'm a pizza connoisseur and have been to several pizzerias and this one doesn't come close to some of the other places I've been to. The marinara wasn't fresh and the cheese on the pizza wasn't melted properly, nor did it taste like good mozzarella cheese. The jalapeños on the pizza were rather raw, as if the pizza hadn't been baked completely.", "author": "Prashanth V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-13", "description": "We crossed over into Brooklyn and had to give it a try. \n\nPros: tasty pizza, but only if the line is short. \n\nCons: The line is never short. \n\nOverpriced and over-hyped pizza. The place is old and dirty. Antique city sanitation sign in window says \"B\"... more like \"C-minus\". The bathroom (7-11 nasty) is next to the coal-fired oven and a few feet from the pizza prep area. Wood racks with the pizza dough were stacked on the floor next to the bathroom. The food prep room and dish-washing area was scary looking. Pesky flies swarmed. The service was: Bad. Slow. Indifferent. With a steady, persistent line of new customers arriving from far and wide, complaints are meaningless... and Grimadi's knows it. Once you eat, pay, and are gone the greeter simply opens the door (usually with a mouthful of food) and motions another group in. Next!", "author": "Eric C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-17", "description": "It took two NY trips to make it here!  The first time we tried, the line was insanely too long... This time, in the newer location with more seating, there was no line!\n\nSo after a medium long walk across the Brooklyn Bridge, this place seems to be the best meal option.  I'm not gonna over analyze the sauce flavors and crust of these pizza pies like everyone else.  I'll just say the pizzas were good..  so good in fact, we easily demolished 2 large pizzas in about 10 minutes each between 4 people.\n\nThe only downsides to Grimaldi's would be that it's cash only and there aren't many options to choose from. No sides here.. I really wish we had some garlic bread or something.  \n\nBut good straight forward pizza.", "author": "Tim L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-22", "description": "Not sure why this place has so many stars. Ok I'll admit their pizza is alright but it pales in comparison to pizza in Italy. If you want pizza that tastes really good, plan a trip to Italy over wasting your time with this place. The worst part is the \"fake line\". I went there since I wanted to take my mom out for a delayed Mothers Day but it was a complete waste of time. There was plenty of seating inside but they purposefully have you wait in line to \"hype\" up the pizza. Then I tried to place an online order while on the line since I didn't care about eating indoors (it was sunny out too!!!) but the guy that came around to find how many was in our party gave me an attitude when I asked and said all orders were to be in that line. #*$\u0026 that!! I went and cut the line, got to the front and asked to placed a to go order. Got even more attitude from the cashier but was able to place my order. The best part was after I placed my order, someone put up a sign saying \"TO ORDER TAKEOUT SAME LINE\" which I have posted a picture of here. About 40 minutes later I got my order (it was a large chicken pie), and took off. You are better off going to shake shack imo. Don't give these people your money. To top it all off, they only accept cash so you know they are \"cooking the books\" and don't even give a receipt! Yes I am that dissatisfied with their service and I hope this turns away people from spending their $ on these crooks. Go buy your pizza elsewhere!!!", "author": "Dan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-31", "description": "It's good NY pizza.  The hype overstates the reality, unfortunately.  That said, come in with no expectations and you will not be underwhelmed.", "author": "Susan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "We stopped in around noon on a weekday, before the big lunch rush, and were seated upstairs right away. In typical NY pizzeria fashion, this isn't a service oriented place. You order, they bring your food and drinks, and then the check. You will have to flag someone down for a drink refill, and don't expect anyone to ask how your food is.\n\nThat being said, the pizza was some of the best we've had and the prices were more reasonable than other popular pizzerias. For $25 including the tip, we ordered a \"small\" (more than enough for two people) with pepperoni. I love the coal fired, slightly burnt crust taste, while it was a little too dark for my wife. We both agreed that the sauce was some of the best we've had, and they didn't skimp on cheese or other toppings.\n\nMake sure you bring cash or you'll have to pay their hefty ATM fees. Overall I'd say to come early, and come hungry.", "author": "Luke B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-16", "description": "Visiting New York, I wanted to try my fair share of New York style pizza. While this was good, it wasn't among the best I had. It felt a little like they were living off the name as opposed to still trying to create the best pizza.", "author": "Joe Bob S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "I stood on line for only ten minutes!  Yes, that's right.\n\nTheir pizza is thin crust smaller pizza. It's not like New York Pizza. It's very yummy. It's not the best pizza in the world, but it is yummy.\n\nEverything is priced fairly.  \n\nFor as small and busy as the restaurant is, the staff is really nice and courteous. That's a hard thing to accomplish.", "author": "Christina M. R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-29", "description": "I'm a life-long New Yorker and know my pizza. For some reason, I see a lot of whiny out-of-towners bitching and moaning about \"customer service\" and the wait times. Suck it up, buttercup! You're in New York - if you want froo-froo nice, go back to Cali or wherever you came from.\nGrimaldi's is old-school, just the way I like it. Yeah, it's touristy, and yeah, you've got to wait a little, big deal. But the pizza is KILLER! As many times as I've been there, it has never failed to impress me. Love. It. The fresh local mozzarella, the sauce, the crust - awesome. \n\nGo there. Wait in line. Gorge on the pizza and then walk it off on the Brooklyn Bridge back to Manhattan. (Don't forget the ice cream shack below before going back though.)", "author": "Sasha Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-27", "description": "When in Brooklyn I heard this is a must try. Is that why all these people are standing in line outside???? After a 45 minute wait, we were seated upstairs where I could look down to see what others were ordering. We settled on 2 pizzas, a Margarita and a Pepperoni. I'm a big fan of a good Margarita pizza and this was good (read: not great, but good). I would have preferred more fresh basil but the crust and sauce was good. The mozzarella was excellent when hot, but once it cooled it was rather lackluster. I am not usually a fan of Pepperoni pizza but I have to say that this was a very good pizza. The pepperoni didn't seem too greasy and the flavors melded quite nicely.\n\nService was adequate, get them in-get them out. NEXT!!!\n\nPerhaps this is the Brooklyn style of hospitality?", "author": "Suzy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-06", "description": "Well worth the wait, and I didn't even have to wait that long - 30 minutes on a Thursday afternoon. One of the workers was a bit abrupt; I asked how long the wait was and he got really irritated. \"I already told you; half an hour!\" Sheesh!\n\nThe Margherita pizza came out hot and steamy. The crust is thin so you don't feel bad about eating 2-3 slices to finish a regular with friends. \n\nThis a food landmark, and the food is tasty so I'll forgive my fellow Brooklyner for his slight rudeness. Patience is a virtue.\n\n--- \nCame here a second time, and was so glad I only waited 5 minutes for a seat! Pizza is always good. And I think the owner came by to greet everyone. :)", "author": "Caroline K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-11", "description": "At first I thought this was one of the best pizzas I've ever had.  However, i realized that my tastebuds were probably swayed by the 90 minute wait we had to endure.  A fair price for a 6 PM dinner Saturday night.\n\nAs for the food...pizza is pizza; and this is exactly what that is. There's nothing exceptionally special about the pizza.  The crust is nice and thin. The ingredients are fresh. And the service is speedy, which is great if you stayed in line for so long. You can definitely find this type of pizza in other places in New York, sans the wait. The most delicious part of our meal was the special sodas that we ordered. (The cream soda was awesome!)\n\nThe atmosphere is casual and fun, and the wait staff was helpful. I definitely think that everyone should experience Grimaldi's at least once, if only to tell people that you've eaten there.  It's one of those \"experiences\" that you need under your belt.", "author": "Laurie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-08", "description": "Pizza is awesome here!!! Had to wait in line to get in for about 30 minutes but it was worth it. Dessert was delectable also!", "author": "Cassie Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-14", "description": "Im not a crazy fan of Pizza, but this is without a doubt the best pizza I have ever had!\nthe cheese, the dough, the pepperoni, and the sauce were so original. The only little downside was that the crust sometimes gets a little burnt, but it doesnt make it any less delicious.", "author": "Hector F."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}