{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-15", "description": "Service was very good although I will note we ate slightly before 5 because I was starving. The guy running/hosting door was incredibly personable. Crust was a 4/5. Perfectly crispy. I felt the sauce just needed a little something extra but it was a good stop for us.", "author": "Karissa D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "First of all they play really good music ! The pizza was soooooo good !!!!! They take cash only no credit. \nService is okay but when you have pizza this good it doesn't really matter. Walking distance from Brooklyn Bridge Incase you want to walk", "author": "Daisy D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-11", "description": "This pizza is good, but certainly not the best in New York. If you enjoy garlic, the garlic pizza topping is a must. While the crust is perfect (coal fired crust done to perfection), the sauce is lacking in flavor. The cheese/sauce ratio favors sauce, but if you prefer it this way you may enjoy their pizza.", "author": "Mr P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-25", "description": "The gang and I decided to meet up at the infamous Grimaldi's that's actually located inside the Limelight which formerly was a disco/rock club and before that, a church. \n\nSince we were 5 gals, we decided to order upgrade and order 2 large pizzas (only $2 more a pie!) We went with a white pie (garlic sauce) with pesto, bacon and ricotta cheese and another large pepperoni. Probably took 20 minutes to hit the table.\n\nThe pepperoni crust was really crispy, but I felt like pepperoni itself were really thin and salty. The sauce wasn't anything to brag about. However, the white pizza was realllllly good. The only con I thought was the crust was a little soggy probably because of the ricotta cheese. We probably should have went easy on the extra cheese, but it was still really good.\n\nBetween the 5 of us, we were only left with 2 slices. I think we got a lot accomplished. The end results, I'm usually the type to pick a pepperoni over a white pizza, but I really like the taste of the white over the pepperoni. Even though I like the crust on the pepperoni over the white, that garlic sauce was so good that I had to pick it over better the red sauce. I think Jezelle was the only one that actually liked the pepperoni over the white. Overall score, I would give this a solid 5 out of 8 slices.", "author": "Maria E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-05", "description": "My boyfriend and I were trying to walk to the Brooklyn Bridge Park after crossing the bridge. It sounds so stupid to say but we got lost due to the inaccuracy of Google and Apple maps =.= Luckily, while crossing the street, a nice local lady asked if we needed help cause we looked so lost. She helped guide us to the park and on our way there, she suggested Grimaldi's. First off, we had to try NY style pizza while in town and second, she was hyping this place so much that we had to give it a try. \n\nUpon arrival, we waited around 5 minutes in the cold to be seated. Smaller parties get seated quicker. It is a family owned restaurant and they accept cash only. You can customize your pizza with sauces and a variety of toppings. I do have to say, it's a little pricey but you're also paying for the quality and freshness of the ingredients. This place was worth the money and experience. After eating here, I literally can't look at Costco/Round Table pizza the same anymore.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-28", "description": "First up: the pizza was good. Good not great. Good and surely not worth the $$. a small pizza with toppings cost us $37. We came from Seattle and this place came highly recommended from blogs and reviews. The service was weird as well with one server and the hostess being very gracious and another server being indifferent and borderline rude. All in all we got the pizza, a lemonade and a cannoli and it cost us $47", "author": "Varun M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "Excellent pizza - and it hit the spot after a long day of walking the Bridge and beyond.\n\nSeems like there's typically a wait, but we got in after 15 minutes, which wasn't bad at all. No frills decor or seating, and service was polite albeit not overly friendly.\n\nThe pizza, as I said, was great. You can't go wrong here, unless you're in a hurry.", "author": "Steve G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "Great spot to grab a bite after huffing it across the Brooklyn Bridge. It's often very busy, so be prepared for a bit of a wait. Thankfully they have quite a bit of room across a couple different levels and they make very efficient use of the space.\n\nThe main event does not disappoint; soft and chewy crust topped with excellent, fresh toppings. Service is typical New York so I had no issues with that; the only reason they don't get five stars is because they do not take credit cards. In 2018 I don't understand how cash-only is still a thing.\n\nStop at an ATM and buckle in for tasty pizza!", "author": "Warren D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-02", "description": "Housed in an old bank building, the ambiance of the place screams \"We've been here for a while and we know how to do it right\". Old posters, framed pictures, and clippings clutter the walls, capturing the history of the establishment. The pizza itself is fresh-a bit underseasoned for my tastes, but comes out piping hot and satisfyingly crispy. The edges, to my disappointment, were slightly charred on the bottom-more than one would expect from even a brick oven. Its good, but not completely blow your mind; the place is also cash-only.  A line starts forming soon around opening hours, so I would recommend you arrive a little beforehand so you don't need to wait. Overall plusses are a decent pie, and the line is less long than the pizza place around the corner.", "author": "Albert W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-02", "description": "Everyone knows this place is the best. You know. I know. Everyone is America knows. We had an amazing experience here everything was fantastic. If you are wondering if it's really worth it. It is.", "author": "Myleka W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-18", "description": "This was our list to revisit due to the history of the pizzeria. Waited about 20 mins were lucky to get sent to front of line since we were only 2 people. The other folks in line had larger parties.\nOrdered a large cheese and large white Pizza was good not mind blowing a little on the pricey side. There's to many amazing pizzerias in NYC. It's a must visit once at least just for the history of this place it self.", "author": "The Food Boss S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-18", "description": "Brooklyn = Pizza! Hmm not sure why but still. Fun place to visit but seems like they are going through renovation right now - March '19. I liked the old setting though please keep that stair case!!! :)\n\nTaste: Ok - Pizza is pizza. \nPortion: Ok - Small size is great for two ppl  \nService: Ok\nLocation: Great\nPrice: Great", "author": "Brianna K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-12", "description": "After touring all over the Brooklyn Bridge and DUMBO area, we were starving and ready to try out some famous NY pizza. Both my cousin and I had read about this place and where excited to try it out!\nThere was a line here all day but it went super quick and we were seated within 10-15 min. Definitely a tourist trap, but hey who cares we were tourists and loved it! We were seated in the upstairs area that looked out over the entrance and kitchen area, so we could see the zas being made!\nWe ordered a large half cheese, half peperoni pizza, which came out pretty quick. I wasn't quite sure what to expect as this type of pizza is very different from the Chicago Deep Dish I am used to, but I was very impressed. The crust is thin and crispy, cheese delicious, and the mini pepperonis were soo yummy-my fav part. We ate the entire pizza!\nThe staff was wonderful-you could tell most of them had worked there for a long time and were very proud of their restaurant. They even brought us out a huge cannoli to share between the 3 of us and it was heavenly.\nSome tips: They do only take cash, so be prepared for that. Food was priced very reasonably as well. Also, no alcoholic drinks. \nIf you are exploring near the Brooklyn Bridge, definitely check out this awesome pizza place!", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-11", "description": "Pros\nArea, ambiance its right under the bridge its a great date spot\ngreat flavors\nthin crust\nbrick oven pizza\n\n\nCons\nLONG WAIT (dine in or take our doesn't matter you have to wait online to get in the building)\ncash only\nyou can only buy it by the Pie.... super downside", "author": "Keyawnia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "I love Grimaldi's.  It's basic and delicious pizza.  I have eaten here three times (mind you I travel to NYC for business so this is a lot of visits).  It's hand tossed, thin pizza with fresh toppings.  I haven't had to wait more than a minute or two for a table.  It's always recommended by New Yorkers.  For that I give it a 4 star.  \n\n-0.5 Star it's CASH ONLY!  They do have an ATM in the restaurant.  \n\n-0.5 Star no wine or beer served.  For 3 years they have had a sign saying they are in the process of getting a liquor license.  This place has been around forever.  I cannot understand why this hasn't happened in 3 years.  That pizza is so good it needs a glass of red to get the most out of it.", "author": "Kimberly H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-08", "description": "Bald big waiter dude had such a bad attitude we just left the place. No hello or any welcoming, my wife from Argentina said to forget it, who wants to pay for this?.\n\nAvoid", "author": "Brad B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-26", "description": "Warning brutally honest review:\nOver hyped pizza not worth any wait what-so-ever. \nPizza is ok good not great, not worth waiting for not worth going out of your way for. \nLocation is awesome love it. \nStaff is nice. \nPrices are fine no issue. \nJust all hype for pizza that's barely above average ( average pizza is really bad now)\nIts a bit of a tourist trap. \n\nTry it if your in the area and theres like no wait, otherwise don't bother. \n\nNo idea how places like this stay open?", "author": "Jake C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-07", "description": "Came here as soon as it opened at 12 to avoid long lines, best decision since the line gets unbearably long if you wait. Had the large pie with extra sauce, oven roasted sweet red peppers, mushrooms, onions, and pepperoni. I've heard the hype and seen the lines, so my expectations were high. I have to say, Grimaldi's met and exceeded my expectations. It was a wonderful meal with good company and highly recommend!", "author": "Alina J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-26", "description": "I'm not a big fan of Pizza. But I think Grimaldi's is pretty good, but not mind-blowing good. I feel like this is more like a touristy place. \n\nLine always long during the day, I'd recommend coming there before they close. \n\nCause I don't think the pizza worth the wait. It's just okay.", "author": "Magdalena B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-28", "description": "Great pizza. We are from Oklahoma and hoped it wasn't just hype about this pizza place. It was not. The flavor of the pizza crust and sauce was great. Fast and hot once we placed our order. The wait to get in was long but well worth it. Walk across the Brooklyn bridge to get here and with a full belly we are walking back across.", "author": "Debra D."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}