{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-01", "description": "We waited more than 40 minutes. It was very cold outside. Once inside, we were seated towards the back near a side entrance. It was freezing! On top of that we had to sit extremely close to another couple. We ordered a pizza and two na beverages. The pizza was underwhelming. It was way too soggy in the center and the onions were excessive and too big for pizza slices. Definitely had better pizza. Would not recommend this place not only for the mediocre pizza and slow service, but also for the freezing dining space that vibrated with the most god awful pop music.", "author": "Kate P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-22", "description": "The BEST PIZZA seriously no joke I went back in May 2010 and my mom and I walked all the way from the Empire State Building to this Grimaldis and when I got to the brooklyn bridge I thought I was going to die the walk was SOO LONG! but when we finally got here it was so worth it! I would walk two times the distance we walked for this pizza.", "author": "Steven S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-10", "description": "DAMN GOOD\n\nI think the prices are right, and so is the pie. \nIt's not fair to say it's \"the best pizza\" but it's pretty damn good, i'll tell you \nthat. Just go and support a classic Brooklyn sit down pizza joint.", "author": "Reed F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-30", "description": "I've eaten at the old location many times and never had a complaint. After trying the new location at 1 Front St......I won't be back... Waited about an hour in the cold to get in....Usually not a problem except that it was FREEZING inside....Had to wear a jacket eating. Ordered 2 pies, a roni/sausage and a ricotta/olive... pizza was not as good as the old location. I don't know why, maybe the oven?? Not as crisp or flavorful, very sad. The whole experience has changed, ie. new location sucks........ Waiters are the usual rude too busy to help....", "author": "Enrico P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-06", "description": "Ok. The hype is more than its 2 hour wait. I've been there many times when I worked around the Heights. But recently I took some out of town guests to the place because they wanted to go, we waited for 2 hours in the heat to get in. The guy at the door was rude. The seating were crowded as expected. But to be honest, I've had pizza from coal oven just as good in Manhattan. The place may have the hype, but digging in a bit just on the food, it's not worth for the wait!", "author": "Steph Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-19", "description": "I went here with friends last night. It was GREAT PIZZA. The waitstaff was friendly and the atmosphere was great. The new location on front st is beautiful. There was no line and I will deff come back again. The manager Kris is also very nice. Thank you Grimaldi's!!", "author": "Sarah J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-20", "description": "Inspired by the great summer weather, my 3 friends and I decided to meet up at Dumbo after work.  The plan was to have some pizza first at Grimaldi's by Brooklyn Bridge and then walk along the water and  head to Jacques Torres' on Water Street aftewards for dessert.  We decided to meet at Grimaldi's at 6 to ensure that we had time left for Jacques which closes at 8.  Two of us got there at 5:30 hoping to secure a table in advance but were refused to be seated till we were complete.  Ok, standard practice, well understood albeit begrudgingly.\nWe were promptly seated as soon as we were all there.  At 6 the place was not fully packed though I notice that a line was forming outside - perhaps a marketing ploy? We ordered one large pizza with additional pepperoni and basil.  The waiter was incredulous that we were just sharing one pizza (\"That's it????\" - complete with an incredulous look of raised eyebrows). Not sure whether he thought 2 slices each for us was clearly not enough or he wanted to egg us on to generate more income for the restaurant. 30 minutes went by, no sight of the order.  After 15 more minutes, we followed up with another waiter who then explained that the oven was currently being cleaned and hence the delay and that it would take just 5 more minutes (yeah, right!). We were all aghast as this information could have been shared the minute we walked in instead of our feeling trapped having invested too much time as it was waiting.  It took another 15 for the pizza to arrive and was it a big disappointment.  There was no wow factor as we went into our first bite.  It was very apparent that the preparation was rushed as most portions near the edge had no sauce.  Worst, the basil pieces were baked and not placed after the pizza was done as is customary. So not worth the aggravation and we all swore never to return.  We even joke about it now as the one-hour pizza.  I could have given this place 2 stars but deducted 1 star due to the unprofessionalism displayed by management over not divulging ahead of time on the delay that will be caused by that oven cleaning.\n\nOn our way to Jacques Torres', we passed along Ignazio's Pizza Parlor, checked it out and decided that this is where we will go next time we are in the area.", "author": "Nanette G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-07", "description": "So I rated it OK because my frined and I made the wrong choice of toppings. Peopple around us were having a great time but we had an overmuch of sodium, thankfully I dint get hysterical in the head. Never , nver never choose anchovies as toppings on your pizza, dont even know why they have them on their menu. And absolutely forbidden is adding capers with anchovies! So as you can imagine it left a briny distaste. \nIt is best is not be too adventurous after waiting for a table for easily more than half an hour in the ever extending queue!! \nIf you go for the traditional toppings, I am pretty sure you will love it cos I liked the thin crust, the bustling crowd and the smell of fresh pizza.", "author": "Arundhati S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-21", "description": "I'm not sure if I'm just really good at picking times to come to Grimaldi's, but I've never had to wait more than 15-20 min for a table, and it's always been worth it.  One of my favorite places to meet up with my Brooklyn friends to catch up over a couple of pies.", "author": "Pamela M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-16", "description": "Definitely one of the best in NY if not the best  ****BUT**** as a local, it's not worth the long wait... Ignacio's around the corner serves a pizza/pie just as good if not better but is relatively newer, pricier (i think) and I think accounts for the emptiness in there...\n\nThe house red pairs soooo well with their pizza.", "author": "EatOutKid E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-10", "description": "When I lived in Brooklyn Heights, I was fortunate enough to be able to walk to the place.  Unfortunately, it didn't matter how close I was or when I went, there was a line that lasted from open until close, and if you were lucky, the line lasted only 2 hours. Worth the wait?  Meh, especially not while waiting in rain or in a blizzard unless you're beyond wasted, then it may be worth it.  You do have it try it once.  It is some damn good pizza.  After I moved, I was surprised to discover one opened in Manhattan.  So, naturally, I had to visit it.  Conclusion:  Go to Brooklyn.  The New York one is fine, but not the same.  Even worse, they turned my club haunt and my former church to a sad little mall that includes Grimaldi's that still takes only cash.", "author": "Shalen O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-02", "description": "Public Enemy said it best \"Don't Believe The Hype\". haha. A bit overrated for me. Pizza was good, but I've had better. I went here with some peeps and had to wait outside in line 20-25 minutes. Service inside was ok and pizzas came out relatively quick. The place is kind of small for all the people. The pizzas itself though? ehhh...I prefer Pizza Hut Meat lovers and Stuffed Crust better than this place.", "author": "Robert P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-16", "description": "This place isn't just a tourist trap or hype beast spot. Totally legit Brooklyn pizza", "author": "Patty D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-18", "description": "I only read a few reviews, but I absolutely believe Grimaldi's met my expectations of being the best pizza. We only waited 20 minutes, and there was 6 of us. We ordered two pizzas, and we were not dissapointed. We all wanted more! the crust the perfect density, and the tomato and cheese ratio was perfect. The toppings were an added bonus, but I am sure just cheese is delicious too. The service was alright. But I really have no complaints. We came in hungry, and left satisfied after eating amazing pizza. Wish I could get some right now.", "author": "Sandra F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-20", "description": "Walked across the Brooklyn Bridge over the summer and decided to try out Grimaldi's.  Despite the fact that it was drizzling, there was a significantly long line of people waiting to get seats.  (I'm guessing) since it was only my boyfriend and I waiting to go inside, we were able to get seats almost immediately upon joining the line (one of the employees came out and told us to follow him inside).  It was a simple veggies sorta day for us, so we got a pie with just mushrooms.  We were pretty happy with what came out of the oven - a crispy thin crust pizza with melted cheese topped with basil and mushrooms.  While the waiter was friendly, he forgot to get me my root beer and it was super difficult to catch his attention.  When it came time for the bill, however, it seemed as though he saw me signalling for him just fine.  While I enjoyed this experience, I'm not sure if I would go again if I had to wait in line for 30 minutes.  The pizza was good, the atmosphere was nice, but I do believe that there are places elsewhere in NYC that offers pizza that is comparable to Grimaldi's pizza.", "author": "Kristy T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-19", "description": "After entering this restaurant to meet coworkers for lunch, I was approached by a man that I assume to be the manager. He asked if he could help me. I told him that I was waiting on friends to join me for lunch, to which he replies, \"You'll have to wait outside.\" Mind you, it is December. At least 38 degrees outside. There are empty tables, and even if he didn't want to seat me without all my party, there was plenty of standing room in the front and room at the bar. When I asked why I had to wait outside, the man could not give me a reasonable answer. Finally, after a little back and forth, and conceded to let me sit at the empty bar. I was about to walk out all together, but my coworkers showed up. When contemplating the reason behind this man's unwelcoming behavior, I can only think to the fact that I was the only person of color in the entire restaurant. Regardless of the reason, they MUST do better!", "author": "Marcus J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-08", "description": "The wait will be long but it's part of the experience so come with great company! The pizza is worth it. Perfect crust. Ask for pepperoni (it's thick and perfectly salty \"real\" pepperoni). Add garlic and you've got a kick. You'll think you can't finish it, it's so huge but after such a wait you can, trust me. It's popular but the prices are still cheap and the usual you see in any pizza place!", "author": "Christine L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-15", "description": "In short: For tourists, a must go. For everyone else, don't hurry\n\nLet me say right off the start that the pizza is extremely delicious and the coronas are only $4 (reasonable for a tourist spot). The thin crust, cheese, and toppings are all superb. \n\nSo why only 3 stars? Because you're going to have to wait at least 30-45 minutes on a good day just to get into the restaurant because its just one big tourist hot spot. This is New York, people. I'm willing to bet there's a pizza spot that's just as good without the whole waiting around with tourists part. \n\nGo for the experience, not necessarily the food.", "author": "Alexander H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-29", "description": "Ok, so the service is not good, the tables might not be clean, you have to wait along time to get in even at the new location, and then you have to wait along time once you get a table, and this place has the makings of being an over hyped tourist attraction, as you see all the guidebooks firmly in hand by those in line.  However...and I'm the first guy to call overrated on something...this is the best pizza I've ever had in any city anywhere in the world.", "author": "Alf O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-16", "description": "we went around 3:30 on a wednesday with no line and plenty of seating.  got the large pizza with olives, anchovies, mushrooms.  it's a solid pizza.  not the best ever but still good.  skip the anchovies- they're wayyyyy too salty.  next time (if there is a next time) i'd like to try some fresh garlic and mushrooms on it.  \n\nit's a good pizza by itself or when you put the right combination/balance of toppings on it.  \n\nas for the service, the servers are fast and straight-forward.  not the most friendly.  they automatically put 15% tip in the bill for dine-in.", "author": "A B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}