{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "First time I discovered this place was when I had friends visiting from Minneapolis and they couldn't leave without getting a good slice of NYC pizza. While my friends were able to enjoy the experience in the restaurant, I ended up having the leftovers. My hopstop app failed me and gave me directions to take the R from Jay St. to S.Ferry/Whitehall. Realizing I was in Manhattan and over the bridge instead of under I hopped in a cab. Welp that didn't help me either the cabbie claimed to know where the place was. However, after 35 minutes of driving back and forth across the bridge from BK to Manhattan, he finally said he had no clue and said he was now off-duty and I could ride with him to the Bronx. -_-  Um no thanks. I decided to get out of the cab and meet my friends at the next destination. \n\nNonetheless, even the leftover slices were good and still tasted fresh hours later. My pals had ordered the regular with black olives, mushrooms, and extra basil. I've since gone back twice to eat at the restaurant and I've been lucky enough to avoid the long lines. Trick to beating the long lines: Go on a rainy day, I've done it twice and there were no long lines or wait times. \n\nI love how the pizza is made to order and arrives fresh out of the oven. The staff is very friendly. Plus, this $14 bucks for a regular is more than enough for two people to split. Not a bad price at all. A few downfalls, the seating is a bit cramped and they only accept cash. I will warn to bring enough because the ATM in the restaurant has a $4.50 transactions fee! Never seen anything like it lol. Overall, I recommend anyone looking for a good pie to try Grimaldi's.", "author": "Amanda A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-31", "description": "Oh, Grimaldi's you let me down the second time.\n\nThe first visit my out-of-town friend and I LOVED. Delicious sauce, fresh cheese and basil, cooked to perfection. We devoured the entire pie and then walked the Brooklyn bridge to burn it off.\nThe next year we went back. Luckily both times on a Wed. night, with no line at all. We were greatly disappointed. The sauce was not the same, there was less cheese and the crust was burned, wayy overcooked.  It was like a totally different pizza we didn't even want to finish this time. :(\n\nPerhaps they cut back and cheapened their ingredients? Too bad because I won't be returning. If in Brooklyn by the bridge, it is good to try once...Hopefully their better qualitly returns.", "author": "Alexandra C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-16", "description": "This place was AWESOME.\n\nI do believe it is the best pizza I've ever tasted.\n\nMy cousin and I visited this place during our trip to NYC for new years. After a stroll across the Brooklyn Bridge, we stopped by this place around 4 pm and were surprised there was a third floor for people waiting to get in the joint. Very impressive. We only waited 10 minutes or so.\n\nThe place is crowded, but what place in NYC isn't? They served Stewarts cream soda - a delicacy you can only find at select shops. \n\nThe pizza itself was YUM! There was fresh mozzarella bubbling from the pizza when it was served.\n\nI hated that we were going to the Nets game and couldn't bring the last uneaten slice with us - it was a tragedy to leave such good food on the table. Would've made for a great midnight snack.\n\nThis place is well worth a trip to Brooklyn if you have time. And if you don't have time, make time!", "author": "Cory M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "Grimaldis has doled out award winning pizza for decades. No question their secrets are a time-tested procedure and a brick oven. The new location has definitely eliminated a lot of the cons that the old location had--cramped elbow-to-elbow room and dim \u0026 dreary lighting--but it also felt like it lost a piece of who it was: a poorly-light, true Brooklyn Pizzeria. Nonetheless, we can't complain because the pizza is as true as it gets. \nThe prize here is the tomato sauce -- so unbelievable sweet and chunky. If there is anything better than fresh buffalo mozzarella spotted-ly placed atop--it's the tomato sauce. The crust is thin, crunchy and sporadically blackened, there's no question that the ingredients convey the highest of quality at Grimaldi's. I only wish they were a little more free with the basil, as our pizza only had one measly leaf. I recommend ordering extra basil--however I remember the pies I received back then were plentiful with basil--perhaps another inconsistency with this new location. I can't say this is the best pizza in NYC, but Grimaldis has definitely held its own all these years.", "author": "Josephine Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-20", "description": "NEW YORK = PIZZA = GRIMALDI'S\nThin coal fried pizza - delicious sauce, delicious toppings..\nNo wonder they have been around for so long.... \n\nCASH ONLY - \n\nService was ok - waiter did not come by to check if everything was ok - but it was super busy..  I was told we got super lucky to just arrive and be sat.  I could see what my friend was talking about upon our exiting, there was a line forming outside waiting to get in.  \n\nIt was a good meal - we have and other pizza city wide and some were off but others were just as good.  This was different, not so crispy crust (sauce made it actually a bit soggy on some parts, but not bad overall) good taste all around.", "author": "eglys h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "Have not been here in decades. Came back by accident after touring Dumbo and noticed the unusually short line. Caught a break. Still the same great pizza. Too bad they do not serve wine. Service was attentive and friendly. The ambiance and decor make up the charm of this staple. Still worth it.", "author": "Bob S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-02", "description": "Does my review really matter?  Probably not...but I'll write it anyways.\n\nWhile Grimaldi's pizza was good, I wasn't by any means blown away.  I've been to one of the other NYC pizza staples, Lombardi's, and I enjoyed their pizza more than Grimaldi's.  \n\nAt Grimaldi's I would highly recommend getting at least one kind of topping on your pie, as the regular pizza couldn't really stand on its own.  The crust is delicious, thin, and crunchy but I wish they put the sauce up a little higher-there was just way to much crust at the top and that is coming from someone who LOVES crust.\n\nThe upstairs is hot and cramped and the servers were very crabby and unfriendly when we were there on a Monday afternoon.  I'm sure it can get hectic with tourists galore but if you work there I assume you know what you're getting into.  \n\nIf you're looking for the best pizza in NYC, I would recommend making friends with a few locals at a neighborhood bar and get their take on it-I've found that those recommendations are usually the best hidden gems on an island where pizza is not in short supply.  Grimaldi's is good...but in my opinion, not worth the hype.", "author": "Lauren F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-10", "description": "Located under the Brooklyn Bridge and serving the best crisp crusted pizza made on a coal fried brick oven. The Regular Pizza with the Sun Dried Tomatoes,  Basil and Garlic was delicious and so fresh with extra toppings.\n\nCannoli one thing that has be tasted over here. Cash only.\n\nRecommended for Pizza Fans.", "author": "Sharan N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-03", "description": "We got here at 3 and there was a short line outside. We ended up waiting quite a while. It was probably about 20-30 min we had been waiting outside in 90 degree weather with 4 starving people thinking 3PM on a Thursday we would get in right away.  However, what was aggravating was we kept getting skipped over (we were a party of 4 and they took 2 parties of 2 and a party of 7 behind us... Apparently there wasn't a 4 top available... Wtf)   Then once we got inside, we had to wait another 5-10 min on the middle floor where we could clearly see open tables. Also, no beer at this location. Seems pretty disorganized still in the new location, will most likely not come back. With an Italian husband who makes delicious homemade sauce, we can make better pizza at home.", "author": "Julieann M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-02", "description": "Been there twice (just to see if my findings the first time was accurate) and I can honestly say it is not as good a pizza as the hype surrounding it leads it to be. Overall Soggy/Doughy consistency, really burnt crust, tasteless pie (meatball/pepperoni/spinach combo). Its obvious, the one who prepared the pizza does not do it with heart and that he should not even be making pizzas.\n\nThe waiters can be true snobs as they have so much pride in their pizzas. One of them saw me not eating the disgusting/burnt/indigestible crust and said he was disappointed for me not eating something so \"special\" while kissing his clasped fingers. Whereas he should be paid to kiss my ass instead if he wants the tip. The snob tries to cover it up by quickly getting olive oil, tabasco and vinegar.\n\nUnfortunately it's really hard  to fix food that is already dead. Perhaps the only thing that tasted right was the Snapple Iced Tea to remedy the pizza's blandness and then Ginger Ale to remedy my stomach after eating burnt crust with oil, vinegar and tabasco.", "author": "Alex H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-16", "description": "My experience was good. I've been wanting to go to Grimaldi's for a while, but whenever I am in the neighborhood, there seems to be a extremely long line. So my solution...be there when it opens. I came with my gf and got seated immediately. What was weird was that we were sitting right next to another. Some may or may not like the proximity (don't think others coming with a larger party would have the same problem). The food came out quickly, which was a plus, but again, I was there right when it opened. The pizza was good, but I am sure I could find pizza just as good anywhere else for less hype. Then we ordered a cannoli. Ehhhh on the cannoli. Looks good, but not the best tasting. Decent, but don't think it's worth the hype.", "author": "Shirak Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-23", "description": "The holt grail of pizza. Fresh, warm crispy crust. Even tastier mets and cheeses , sauce was perfect. Not too salty and def homemade. I now hold ll other pizzas to this standard sadly bc no one comes relatively close to this level of perfection.", "author": "Amanda J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-02", "description": "Thank God I didn't have to wait too long to get seated here.\nI wasn't that impressed and the pizza was really soggy.\n\nMeh, I'll just stick to a local pizzeria next time.", "author": "Rachel O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-14", "description": "So disappointed.. my expectations was far from the reality we experienced. The long queue was horrible because even if there is a line, it won't guarantee that you'll the next to be served. We were a pack of 6 and already in the first line but the front man kept ignoring us and called other packs of 4 and 2 and 8 which were behind us.. and when we were finally called.. the server wasn't nice.. our pizza was a little bit burned.. then the bill out took so long that they forgot.. such a huge mistake. Should have lined on Juliana's instead.. won't go back to this place ever again", "author": "Jo R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-02", "description": "worth waiting in line.the place is always packed.\nthose mozarella cheese are heaven.the small size pizza was actually pretty big and will be good for 3 or 4 people already.cos we tried to order one small pizza for each person but our server advice us that one small pizza will be enough for us...plus we could order 2 different kinds/with toppings of what we want in one pizza,yey.\nso we ordered the white sauce with garlic and peperoni.then half in pizza sauce with ham,mushroom,onions.\nso basically you make your own pizza...though i feel like their toppings were limited...the taste of your freshly made pizza and that MOZARELLA cheese..its just heaven in your mouth.", "author": "Enah N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-21", "description": "Grimaldi's is a fucking tourist trap!  I spent 3 hrs in line, and another hour after sitting down until I got my pizza.  The waiting room upstairs is so damn depressing and it feels like you're in an apocalypse movie where you're in some waiting area hoping your name gets called to get on the ship out of earth before it implodes.  Oh, and the guy calling names gives NO SHITS and gives about 2 seconds after calling a name before crossing it off the list forever.  It's the 21st century, let's get some electronic queue system so it's all more fair and transparent?\n\nPizza was great, but damn, I want my 5 hrs of life back.  If you really need it, I would go to another \"Grimaldi's\" location in manhattan or hoboken.", "author": "Edmund Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-25", "description": "LOVE ITTTTTT. \n\nThe wait outside was about 40 minutes, and the wait inside was a tad longer, but it was WORTH IT. I love that Grimaldi's uses real mozarella, and all the toppings are delish. At my last visit, we got a small pie with mushroom, sausage, pepperoni and fresh garlic. For two people, a small pie was the perfect size. \n\nThis was my first time at the new location, and it's a tad more spacious than the original, but not by much. The seating is still really cramped. Tourist trap or not, this place has amazing pizza.", "author": "Linh L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-02", "description": "I went here once, several years ago.  There was a long line.  I stood there, thinking: \"no way is this line worth the pizza.\"  The place was so busy, my friend and I ended up splitting a table with a German couple, because a four-person table freed up and we didn't want to wait any longer.  Sum up of the story: I was wrong, the pizza was worth it.\n\nFunny addendum to the story: we were sitting next to Germans on one side, Italians on the other.  And the Germans were sitting next to some French folks.  We all got to talking.  Then the French left.  Then the Germans and the Italians ragged on the French for ten, maybe fifteen minutes, doing funny impressions of them and their snooty opinions of pizza.  It was like walking into a cliché political cartoon.  Hilarious.  \n\nI guess you had to be there.  \n\nAnyway, the pizza's fantastic.", "author": "Daniel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "Yum! So glad, we came right when they opened up because the line was crazy when we left. There were 3 of us and a large pizza was the perfect size. My sister is vegetarian so I loved that we could get half the pizza to accommodate her. Pizza does take a while to cook but the wait is worth it. I love that the crust is thin and you can tell they use quality ingredients. Glad we came here for our NY Pizza experience\n\nFYI-THEY DO NOT HAVE ALCOHOL", "author": "Jami K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-23", "description": "Another great pizza place located under the Brooklyn Bridge. The staff is super friendly and the pizza is absolutley delicious. The line can get pretty long and the worse part is they have you wait outside...so during cold weathers you may not be all too happy especially if you're cold AND hungry...the wait for the pizza is pretty long too. So I'll catch myself staring and drooling over the table next to us. Despite all that waiting, Grimaldi's pizza is a must try!", "author": "Jennifer H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}