{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2007-10-17", "description": "I am reading all these reviews about how incredibly amazing the pizza here is.\n\nAre you freakin' kidding me?\n\nThe 50-minute-wait probably hyped things up too much. In additional to all the sensationalism, there was a nightclub-like system with the line. Every so often, the \"bouncer\" would signal some people to come through the doors (\"This place must be amazing!\" I thought). The place was packed. The tables were so squished together that your butt had to graze over the top of the neighboring table to get into the back seats. And the waiter bumped my friend's chair and gave her attitude about not scooting in enough (while our neighbors had their backpacks spilling into the aisle). Sheesh.\n\nGranted, as I said in my review of Lombardi's (which got five stars from me), I believe that it all comes down to the crust. I am not a fan of soft-crust pizza and prefer to have a bit of crunch-and-crisp to my bite. Our pizza was probably taken out too soon because our crust was slightly doughy. Eeeew. And the sauce/toppings were just so-so. We had to keep piling on the hot pepper flakes (which weren't really spicy) and parmesan cheese just to give it some more flavor. Too bland for me. If the pizza was fantastic to begin with, we wouldn't need to \"pile\" it on.\n\nAlso, because of how thin and flimsy the slices are, Grimaldi's pizza is one of those types that you just gulp down your throat without really chewing. I prefer eating thicker or crunchier pizzas where you can savor the flavor of each bite. If you like folding your thin pizza slices and all that, you might like this place. \n\nI totally agree with Bevy M that all the effort to get to Grimaldi's from Manhattan isn't worth it. The trek, the wait, the mediocre service, the price. I seriously can't fathom why Grimaldi's is getting all these rave reviews. It was NOT spectacular. In fact, it was very forgettable.", "author": "Vanessa S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-13", "description": "Five large pizzas for our party of ten! The beauty of quality thin crust pizza is the amount of pie you can consume--all of that typical thick crust is just a waste of gastro space. \n\nMenu doesn't have \"meat supreme\" or \"veggie\" pizza; ingredients are listed and you build your own.\n\nCool waiter (suspenders, had the Joey Tribbiani accent going, and offered to take our table's picture when he saw us passing the camera around).\n\nMy friend and I went gaga at the kitchen area (neat coal-fired brick oven), and they let me try a hand at tossing the dough!\n\nAll-around friendly staff, but they don't let you take pictures of the kitchen area. Regardless, I was a happy tourist!", "author": "Nisee D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-21", "description": "I read a bunch of reviews about Grimaldi's and finally got the chance to go.\n\nLocated under the Brooklyn Bridge sits the famous pizza place.  This is a pretty awesome site to see and I recommend anyone visiting the are to go here just to be down by the Brooklyn Bridge and see this area.  It is very cool.  Grimaldi's isn't very big, but they have packed a ton of tables into this place so everyone is packed in.\n\nThe pizza was fantastic, it was fresh and had great flavor.  This is some of the best pizza I have had in NYC and it is at the top of a lot of \"top pizza in the country\" lists and such.\n\nThis is a must visit, and I am glad I was able to go to the famous Grimaldi's pizza.", "author": "Joyce D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-16", "description": "Try their white pies, and margarita pies. So delicious. Specially on a freezing winter night.", "author": "W M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "The line to get into this place is crazy long, mainly tourists, but if the weather is nice, the pizza is worth the wait. I always end up getting one white and one regular, and 2 small pies can easily be finished by 2 people. Okay, maybe 3 depending on appetite lol. They don't really have any appetizers though, other then salad. So it really is a very simple pizzeria. If you are looking for a nice place to go on a Spring or Summer night, go to DUMBO and try Grimaldi's.", "author": "Karen R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "Grimaldi's does a solid job of living up to all the hype I've heard over the past couple years.  The dough and ingredients (we had ham, mushrooms, sun dried tomato, and garlic) are exceptionally fresh and I especially liked their use of mozzarella slices rather than shredded pieces.  In terms of flavor though, Cheeseboard back in Berkeley still takes the cake by a considerable margin.", "author": "Eric F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-11", "description": "This was alright. Not thrilled about soda in a bottle and no beer or wine choices. Curious if the place around the corner also founded by Cindy Grimaldi was as good. There wasn't a line, but still a good crowd.", "author": "Erin B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-20", "description": "Ever have a cracker, cheese, or good marinara? That sums up this establishment.\n\nI guess I could see the hype, if I was a tourist, but I don't find too much flavor in the pie here. Sure, there's usually a long wait, and it's glamorized. I just don't feel the glamour in their food. Something lacks essence. \n\nIt's an experience, and you get a gorgeous view of the Watchtower. You know, the home base for the Jehovah's Witness. They have some prime UTB real estate going on.", "author": "Charles K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-25", "description": "For me, this is the pie to rule them all.  Now when I think of TMNT, I know what pizza they were eating.  \n\nA crust that's not too thick, not too thin - a good sauce - minimal toppings (the pepperoni here is unreal) - and my favorite part, the cheese...  It was a baptism of sorts for me, and upon my return to California, pizza has never been the same.", "author": "Peter N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-07", "description": "i visited ny, sweated my body out of all its calories after walkin the brooklyn bridge..wanted to try out grimaldi's cause apparently one of my friends that was a local heard it was really good but never got to try it because the line was always long.  Finally found the joint and to our lovely surprise....there was no line! we were seated right away.  \n\nsurroundings: very small joint, could easily eaves drop into the people sitting next to you's convos and even maybe have to sit so close your touching them.  looked like a pretty old junkie place that is making such good business they dont even care about the way the restaurant looks. haha\n\npizza: eh...to be honest, ive def tasted better pizza. it wasnt terribly bad, but it wasnt like a omg moment.. it was just an oh, this is a bit different   kind of thing but nothing special.  they shouldve added more cheese and basil to our pizza.  Thin crust style was pretty good. but the pricing was a bit pricey for a small.  i think it was about $12 bucks..well actually thinking about it, it was decent pricing. -1 star on being a bit greedy with the cheese and toppings.\n\nthe service was half and half. we tried to flag down the waiter for our check amidst the busy crowd and the waiter was RUDE. when we asked him for our check he didnt even make and gestures or say anything to tell us, \"sure, i'll get you the check\"..instead he looked at us as if we were stupid asian idiots. so we ignore the idiot and asked another waiter who was WAY nicer and had WAY more social skills.  -1 star forsure.\n\nwhen we finished and walked out, the line was LONG! they even had it roped off just for people waiting in line for this pizza joint that when all the way down the block.  Overall, this was a good place to try as a tourist after walkin the brooklyn bridge but i dont think i would come here again.", "author": "Em C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-25", "description": "After walking over the Brooklyn Bridge, we waited over 2 hours in line at Grimaldi's! Truth is.. it was seriously worth it. The best pepperoni pizza I have ever had! I heard many great things about Grimaldi's and it was just as I expected. The environment was friendly.. and as busy as it was, the service was good. If you use the restroom while you're there, you'll pass by the coal brick-oven and the area where they make the pizza. They make it look so easy! Grimaldi's only accepts cash. There's an ATM there in case you need one.", "author": "Jer C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-11", "description": "The best pizza of my life!!! TIP: Skip the long line and check if there's any open seats at the bar.", "author": "Misha K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-11", "description": "Memories came back after eating here the other day. I've been to Grimaldis a few times when I was younger and the pizza lived up to it. People are saying this is a tourist trap. I don't know if they got a bad pie or what but it's definitely worth a try atleast once. Forgetabout the pepperoni it's small and makes the pizza way too greasy. Stick to a simple plain pie or a sausage and peppers pie. (Their crumbled sausage is really good) don't overload these pies with toppings do that when you go to your regular place, too many toppings will make the crust mushy. For instance one pie we got had mushrooms sun dried tomatoes and garlic and it made the crust a little soggy. (Taste was there texture wasn't). I'm not counting service in my review because honestly all of the workers were jerks and were rude. I wasn't surprised though. I came for the pizza not the atmosphere or guidos running the place so the service will slide for this one.", "author": "Genevieve R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-18", "description": "I can no longer eat pizza in SF. Anytime I accidentally do, each bite is a heartbreaking reminder that I'm far away from the joy that is grimaldi's. My thing for pizza is 1) sauce - and grimaldi delivers - the sauce is fresh, flavorful, and plentiful  and 2) crust crispiness - again, grimaldi delivers, and the coal oven gives it a different taste than the wood burning ovens you see out west. im getting hungry, dammit. \n\nI was a bit sad when i realized its a nationwide chain, but its still freakin good (and i ate a TON of pizza in NYC) and theres something cook about the brooklyn location under the bridge with the aging bright green awning and the old school red and white check table clothes. oh and did i mention the pizza is delicious?\n\nA few tips: 1) I think it works better if you choose drier toppings, it keeps the thin crust crispier and 2) try to go in off hours - you wont have to wait as much (or at all as was hte case the first time i went) and they spend a bit more time on the pizza = more deliciousness.", "author": "Geetika A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-02", "description": "This is by FAR the best pizza I have ever had. I always order the pepperoni pie and the pepperonis are so delicious. They also have some other seasonings in addition to the fresh basil that make this pie so excellent. Additionally, you rarely have to wait very long for your food once you are seated. I've ordered the house red wine and it's a great bang for your buck (they always fill the carafes higher than the 750ml mark).\n\nA couple things: yes, you will always have to wait in line. The best idea is to go here with 1 other person because your chances of being seated within 15 minutes go up dramatically. Go with 2 other people, and yes, you'll likely be in line for 45 min to an hour. ***No reservations, cash only*** (they do have an atm inside) and there will always be a line. I've gone here at least 20 times and no matter if it's nice out, raining or snowing, there will always be a wait. \n\nInside is a very traditional Italian pizzeria, complete with red-checkered tablecloths, a loud atmosphere, and lots of old NY pictures (both of people and landmarks) decorating the walls. \n\nTough first date spot I would think because you might end up having to talk to your date for a while w/o the benefit of alcohol (not to mention the subway or train ride over), but once you're inside, there is so much going on that you probably won't talk much anyway. Yes, it is very crowded inside too and they do try to get you in and out because there is a line!\n\nIf it's nice weather, take a walk back to Manhattan over the Brooklyn Bridge. GREAT after dinner walk either with friends or with a date. Oh and always order a large pizza....you won't be able to resist finishing it!", "author": "Jacqueline Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-11", "description": "This was my first red brick oven pizza experience. Coming from Southern California, the only type of pizza I'm use to is Pizza Hut or Dominoes. What we consider good there would be Round table to Papa John's. Nevertheless, the first request that I had when I came to NY was for authentic, delicious pizza. My friend took me to Grimaldi's. As a Californian, the walk across the Brooklyn bridge was amazing (but VERY tiring for a person that's use to driving everywhere). The view was nice, especially when I saw the Statue of Liberty from afar. \n\nOnce we got there, we waited about an hour 45 minutes to get a seat. The atmosphere in the restaurant was nice and the pizza was delicious. The waiter made a mistake with our order, but fixed it promptly. I love the crust, the cheese, and the topping. If anyone makes a trip out to NY, I would definitely recommend this place.", "author": "Steph W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-21", "description": "At last!  Made it across the bridge and tried the yummy pizza here.  Had a short wait of about 10 min cuz only us two people.  Host was middle-aged guy who was very friendly and happy.  Which puts me in a happy mood too!\n\nJust walking into the joint, I was overwhelmed by a heavenly carb/chees aroma.  Felt like doing a Homer Simpson glazed-over-eyes drool.....Also liked the red checkered tables and the metal pizza pan holders on each table.  Ordered half mushroom and pepperoni and half margherita.  I don't like pepperoni and wanted to taste how good Grimaldi's does the basic pizza.  It came after 15 min.  Piping hot and made to order!  \n\nFirst, the crust: very unique coal-oven-flavored crust.  I can't say I've had any other like it yet.  The crust end was very crispy with a soft texture.  The tip of the pizza was not as crisp.  I...liked it.  Cheese was good as well.  Thin slices threwn all over.\n\nAs for the other parts of the pizza...Tomato sauce I liked but prefer that of Isabella's in LES.  The flavor wasn't as balanced at Grimaldi's.  A little tart and over-dried-herbed.  Not much fresh basil.  Had a whole slice that didn't get any.  Plus, the fresh basil was put on before the pizza went in the oven so that it had lost its beautiful green color by the time the pizza reached us.\n\nUltimately, I wouldn't seek out this pizza because I prefer (1) a crispier, thinner crust, (2) a balanced tomato sauce and (3) even distribution of fresh (green) basil over the pie.   But if I was there, I would still enjoy it!", "author": "Tiffany T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-14", "description": "I love Grimalidis.   Sue me.  I'm as typical as I can be.  And while you're trying to argue with it's popularity, I'll be over here in the corner with my carafe of red wine and my pizza with fresh garlic and extra basil.  In heaven.\n\nOne of my favorite \"visitor\" specials is taking the train over to Grimaldi's, enjoying delicious, authentic pizza, and then walking back into Manhattan over the Brooklyn Bridge.\n\nThere is also a popular ice cream place just down the hill from Grimaldi's for those that want a sweet treat on their walk.", "author": "Alexandra W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-07", "description": "OK... not quite the BEST PIZZA EVER, but pretty damn good.  \n\nWe ordered a sausage, mushroom, and goat cheese with garlic sauce... kind of an odd concoction.  It seemed that 30-40% of the people in the restaurant were tourists...\n\nThe seating is cramped... but it was what we had expected.\n\nThe food comes quick... the staff is curmudgeonly... but we expected that as well.  \n\nSo... down to the food... the crust was friggen amazing.  You know how people sometimes toss the crusty end of a pizza?  Not here... it was tasty and PERFECT.  The quality of toppings was at par.... sadly... they could've made the best pizza ever had they used better quality toppings, but as a whole, this was a great meal.  \n\nI'd go back again... but like I said... not the best pizza ever.  They need to bring up their game with the quality of the ingredients... then yes, maybe the best (the stuff in Rome was heavenly)... but we'll have to see next time I visit NYC.", "author": "ZumaJay Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-19", "description": "This is just some damn amazing pizza. It's worth waiting in line for (which i have done a few times). The sauce is delicious, the mozzarella cheese is great, and i've never had a bad pie here. \n\nIt's well worth the trip to Brooklyn (if you live in the city) just to eat here. i love it.", "author": "Matt E."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}