{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-21", "description": "After the line we saw outside this place one evening, I thought it would be pretty amazing. I went for lunch and did not have to wait to be seated which was nice. We got a large cheese pizza for $14. We decided the prices for toppings was not worth it. It fed 3 people and was okay, but nothing impressive. Our waiter was kind of neglectful, which irritated me. I was drinking other peoples water. And they only take cash which is annoying. There was a tiny pizza shop with $1 slices that was better than this place.", "author": "Kelly B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-21", "description": "Came here after walking across the Brooklyn Bridge. Line was SUPER long even on a cold winter night. Not sure what all the hype is about for this place. It wasn't bad, but I didn't think it was worth the long wait.  Good to try it out at least once though.", "author": "Tina W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-10", "description": "A friend from out of town wanted to go to this place because it's apparently a \"must go to\" for tourists.  I was a trooper... we stood in line for 48 minutes... and then waited about half an hour for our pizza.  We shared a small pie (that's enough for 2 people) - half mushrooms (for me) and half pepperoni and mushrooms (for him).  \n\nThe pizza was A-OK.  It's nothing out of this world... this place is so hyped up that you would think the 48 minute wait would be rewarded with some out of this world experience... trust me, don't waste your time.  I've had pizza just like this one (or better) at the pizza joint around the corner from me.\n\nVerdict: Decent pizza but nothing out of this world.  Don't believe the hype.", "author": "MT E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-24", "description": "Grimaldi's gets a huge thumbs up for their crust.  It is crisp without being overcooked or cracker-like; it is flavorful without being overpowering.  I am usually not a fan of margherita-style pizza (maybe I am a provincial guy from the middle of nowhere, but I much prefer the cheese on top of the sauce, as opposed to the whole little-bits-of-cheese-over-sauce thing) but Grimaldi's may be the first step to a full conversion to the joy of the nuances that such a simple dish offers.\n\nI have gone twice so far; the first time was with a friend who is okay eating meat, so we got pepperoni and sausage.  The pepperoni was nothing to write home regarding, but the sausage was superb and worth eating on its own.  The second time was with my parents, who came into Brooklyn from North Carolina that day and wanted to eat at this institution.  They prefer cheese pizza, so we got cheese that time around.  Both are quite good:  this is a pizza that does not depend on the novelty of fancy or exotic toppings to be good.\n\nAs other reviewers are noting, there can be a very long line to get in the door.  I have waited 20 minutes, and I have waited close to two hours.  Depending on the day of the week and time of the day your mileage may vary.  \n\nThis is a good pizza, but not as amazing as the mountain of hype for this place might imagine it to be.  If people were visiting me I'd take them to get a \"slice\" (...it's ironic because they don't serve them... and now the crickets chirp) of old-school Brooklyn.", "author": "Aaron L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-23", "description": "Grimaldi's is oft regarded as \"the pizza mecca\" for New Yorkers.  Why?  I haven't the slightest clue. I just didn't get what all the hype was all about. Don't get me wrong, it was good, but definitely not the best i've had.\n\nWhile I will give them credit for their use of \"just picked off the vine\" fresh ingredients and generous cuts of meat; i thought the flavor was seriously lacking,...dare i say, even bordering blandness. Perhaps, it was our poor choice of toppings that led to such an underwhelming experience (ordered a pepperoni \u0026 mushroom pizza.  1/2 reg. 1/2 white). Or could it have been the fact that I (secretly) refused to give in to the $2 Parmesan Cheese [surcharge].  \n\nWhat a terrible punishment.", "author": "Jenni C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-22", "description": "If you are taking the hike across the Brooklyn Bridge why not make a stop of this iconic restaurant. I consistently had heard it is the second best pizza in the city (after Lombardis) and I have to say I agree with it. I visited around 2pm on a weekday and they were still pretty hopping. Whether the patrons were tourists, locals, or business men everyone seemed to be enjoying the food. The staff was pleasantly grumpy and got the food out very quickly. A hot and fresh pizza was exactly what I needed after a long bus ride up from DC. The sausage and cheese were divine and the crust was perfect!", "author": "Samantha E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "My family and I traveled during the holiday and we yelp best pizzas in Brooklyn and found Grimaldi's.  The reviews were positive and we were excited to try it ourselves.  Upon arriving there were no long lines as mentioned in a few of the reviews.  We were immediately seated to the second level and such an amiable atmosphere.  We ordered two large pizzas, one with pepperoni and the other half pepperoni/mushrooms and the other half cheese.  It was delightful and tasty pizza's.  I was under the weather and feeling stuffy, but I could taste every flavor in the pizza.  We definitely plan on returning and the location of Grimaldi's is just off of the Brooklyn Bridge.  A great place to take pictures of NYC.", "author": "Nya A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-05", "description": "Supposedly the best pizza in NYC, I was HIGHLY disappointed when I tried it. \nLet me start from the beginning. I went here in the summer and had to wait outside for around 90 minutes, give or take, whilst starving. I finally get inside and the pizzeria, from what I saw, was only about half full. I sat down for about thirty minutes before someone came to take my order, which really ticked me off because it's already been two hours. I order one normal sized pizza to share with my cousin and we had to wait another 45 minutes for ONE relatively small pizza, even though other tables were being served before us, even though they came in after. I saw the chefs constantly making pizzas, so I don't understand why I had to wait so long. After receiving the pizza, it looked like there was little to no effort into making it and they skimped out on many of the ingredients (mainly the sauce and cheese). The quality of the meat and cheese were top notch and are the only reason I'm giving this place 2 stars instead of one. I'd give it a 1.5 if I could.\nTL:DR - After a three hour wait, I got a relatively small, overpriced pizza that looked like little to no effort was put into it. It was one of the most disappointing moments of my life, after hearing such great things about this place. Would not recommend unless the service drastically changes.", "author": "Nicholas L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-15", "description": "Ah, that perfect slice of NY pizza - it's something that has eluded me all my life. There was not a shortage of good words for Grimaldi's pizza. After a tedious and tiresome five hour flight, a trip to Grimaldi's was well deserved for our first night in New York. \n\nEven though everyone told me to just try the 'Plain Pie' I couldn't help myself from trying the delicious sounding 'White Pie' listed in their menu. We added sausage and it was delicious! Crispy, slightly chewy, charred thin crusts are my favorite and Grimaldi's has got it down perfectly. Topped with gooey cheese, fresh basil and gorgeous olive oil. It was beyond words...\n\nBut... I don't think anything could top the beauty and perfection that is the 'Plain Pie.' Simply dressed with tomato sauce, mozzarella and basil it was magical. Simple, yet so satisfying. Oh geez, I still dream about it!", "author": "Michelle H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-24", "description": "Really the best tasting pizza with a crispy \u0026 chewy crust. We got sausage, pepperoni, and mushroom as our toppings. They put basil on the pizza and it provides the perfect herb flavoring for the pizza. The sauce was a little watery so the pizza was kind of damp in the middle but it was so good we didn't mind.\n\nAnother big tip is to take home leftover pizza and eat it after it's been refrigerated. I never like cold pizza because it usually doesn't taste good, but I couldn't believe how good Grimaldi's pizza tastes cold. Next time I will buy an extra pizza to take home and stick in my refrigerator. Trust me, it's unbelievable hot AND cold! We ordered a small 12 in. pizza and the two of us couldn't finish it (hence the one slice we took home and refrigerated, thank gosh!)\n\nWe came on a Friday at 11:30am right when the opened based on another reviewer's tip and was seated right away with few others. When we left after 12:30 the restaurant filled up but there wasn't much of a wait. Maybe because it was a Friday during MLK weekend. But it made the experience better to not have to wait in the infamous long lines.", "author": "Sandra V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-08", "description": "Let me start off by saying that grimaldi's has good and delicious pizza but my rating is for the way i felt after i ate it...let me explain. \n\nI was expecting an explosive burst of Italy in my mouth; something way beyond 5 stars. Everybody has hyped Grimaldi's up to be this unbelievabley crazy tasting pizza. The line, The wait...it's like this pizza that's supposed to be so exclusive that you have to wait. Well, I was so Dissapointed in the margherita pizza that me and my bf both finished.   The hype was so not worth even spending the money or wasting the tome.  As I said the pizza tastes good, but I've had far more better.", "author": "Sonny G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-16", "description": "Good pizza!!  \n\nStanding under the Brooklyn Bridge outside of the restaurant forming a line just to get a piece of that Brookly pie while sitting neck to neck to a stranger in the table beside you that is enjoying the same thing as you. \n\nPizza is good and comes out very quick, seems like they just want you to eat and get out so they can keep their line moving outside, but it's understandable because of the high demands people ask for.  \n\nPizza comes to your table, piping hot, slightly crispy and slightly soft, depending on where you bite, but overall very enjoyable.", "author": "Mike U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-14", "description": "Get there early.  Come by yourself or in a pair and you get to skip the line.\n\nEven if you order to go you have to wait in line.  Cash only.  Already a long line before it even opens.  No slices.  A \"small\" pie comes with 6 huge slices.  I added onions, mushrooms, and pepperoni to mine.  It was superb although I felt that the addition of toppings made the middle of the crust a bit soggy.\n\nYes it lives up to the hype!  But I can't give it 5 stars because I have another pizza spot that I hold dear to my heart.  I would definitely come back but NEVER in a large group.", "author": "Justine L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-12", "description": "The white pizza at Grimaldi's satisfied a need we didn't know we had. Wonderful scenic location in DUMBO.", "author": "Michael W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-14", "description": "You know, standing there (I mean sitting in my air conditioned apartment while my roommate stands on line) we weren't sure if Grimaldi's would be worth it.  Honestly - the people aren't that nice* - with that kind of line who has to be? They make you wait in the SAME LINE wether you are waiting for a table or taking out*.  But when the pizza got home - and was reheated, it was oh so tasty.  At first I didn't know, but around bite 5 I was smitten.  I don't think I'd wait in line to bring it up (unless above told roommate told me to) but I'd wait in line to eat it hot and fresh.  And that is how they keep that line long. Forget the bells and whistles - every last one of them. And just deliver good pizza.\n\n*All these details were provided by my loving, darling, and reliable roommate. :)", "author": "Amy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-06", "description": "If you're visiting on your way to the promenade of Brooklyn or just in the area and you're looking for some tasty pizza, check this place out. \n\nInitially we wanted to order for pick-up so we can eat along the promenade and enjoy the Manhattan skyline, but due to how busy it was since it was lunch time, there was we weren't able to order for pick-up without waiting in the line. So we might as well sit in to eat. It was great that we did too, it was more enjoyable.\n\nThe wait was sort of long and in the heat, it felt longer. We had a table of four but larger tables were waiting in front of us, so we didn't have to wait as long. The place is actually pretty large with many tables. I think they may have just been short staff on the day that we went. \n\nTo the pizza, this is what I think of when I think of NY style pizza. We got two small regular pizzas (regular meaning with sauce). One was with mushrooms and sundried tomatoes - it was a great pizza. The sundried tomatoes were large and added a nice touch to the pizza. It went well with the mushrooms too. The second pizza was sausage and pepperoni - the meat was great, it was very flavorful. The crust was done just right \n\n We also sat on the second floor which was nice because it wasn't as loud as it was downstairs which was more enjoyable for us. \n\nTIP: head out to Grimaldi's prior to you being too hungry. Once ordered, it didn't seem too long for the pizza to come, but depending on the time of day, there could/is likely that there may be a wait to be seated.", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-26", "description": "West Virginia says this was the best pizza ever! Only waited 5 minutes too! We loved everything about Brooklyn, and your pizza was the perfect pre-walkjng the bridge meal.", "author": "Susan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-28", "description": "The food is excellent the new place is much bigger and more comfortable. Parking is definitely a big problem be prepared to circle the block a few times. I will definitely eat here again.", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-02", "description": "Great pie! Especially after walking the bridge...  Seriously, this is one of the top 5 pizza places I've ever been to anywhere.", "author": "Ted R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-21", "description": "regular sausage\n\nfresh mozz\nfresh basil\nfresh sauce\n\ntip: 2 tops seat faster.\n\ncash only", "author": "Anna K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}