{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-29", "description": "Really?  This is the best NYC has to offer???  Sbarro is better. Poor service and long wait too.", "author": "David C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "Real ingredients, fun staff, and the best pizza on Earth! Our waiter was funny, he told us to put away our phones, but then took a photo of us with the pizza and surprised us with free dessert, not just any dessert, CANNOLI!!! Stop reading reviews, just go you won't regret it. It is worth the wait, the line is long but the pizza is worth it. I am back in California and my friends thought it would be a good idea to get pizza from a local place, after Grimaldi's no other pizza will ever compare!", "author": "Rose H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-05", "description": "Tourist trap? Yes.\nWorth the wait? No.\n\nThe pizza here is good, but not amazing to justify waiting over an hour. I've been here a couple times and generally, their pizza dough is soft, but also a bit burnt and ashy on the bottom. \n\nTip: If you get too many toppings it will get soggy. Pizza comes out hot and fresh from the oven, so be careful not to burn yourself.\n\nI like to take my tourist friends here for dinner then along the promenade at night to see the Manhattan skyline while enjoying ice cream.", "author": "Katrina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "This is our first stop at New York. Cant go wrong with a brooklyn slice pizza. everything about the pizza is awesome! The toppings was on point, got the regular pepperoni and sausage. The sauce and cheese is what separates this from any other pizza place. The mozzarella is fresh, and stringy. The sauce is simply imported marzilla sauce tomatoes simmered down to a saucy-like consistency. It was a slice of heaven. One of my favorite pizza's in NYC! Jus plain perfect.", "author": "Jesus M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-15", "description": "Came on an early Saturday afternoon and didn't have to wait but was a first seat option at a table with two people we didn't know so we opted for the bar seating. \n\nThe pizza is good as far as this style goes, old school in my opinion, traditional sauce, good amount of toppings and crispy crust. I don't think I'd ever wait in line and hype this up and I'm glad I didn't because I probably might have knocked it to a two star review. \n\nThe service is ok, on the slower side and the \"host\" guy at the front isn't the happiest of people. Yeah i get your dealing with a bunch of clueless tourists most of the time but its expected. \n\nThe small pizza is perfect two, you may even have a leftover slice, although we did see one guy take down a whole small pizza so i guess it varies....\n\nOverall, glad I got a taste, but there are days a good ol' $1 slice could win out here.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-31", "description": "LINES!!!!!!  But, don't be TOO discouraged because it does move rather quick and it's worth the wait!  The pizza is DELICIOUS!\n\nI'm from SF so normally the pizza crust is rather fluffy and very filling.  these pizzas are made with very thin crust so what is one SF pizza slice = 2 NY slices just because you don't have all the bread expanding in your belly.  Don't be intimidated by ordering a LARGE PIZZA.\n\nwe came at 10:15pm and it's hard to believe but there was still a line of people half way down the block.  i was initially put off by the idea of waiting for a pizza but we actually got seated rather quickly since there was only 2 of us.  there's a lot of large groups so the host will walk down the line picking and choosing who is up next to try their savory slices of pizza.\n\nwe were debating between the medium and large and looking around all tables including 2 ordered large so we thought WHY NOT.  let me tell you.... you will be STUFFED but you will enjoy every single bite.  If you're from SF, don't be intimidated!  I have a pretty small stomach and we only had one slice of pizza left.\n\nwe ordered half and half of margarita and sausage mushroom.  the crust is thin, the cheesy is oozing and gooey, the sauce completes the entire meal.  add a drink to your pizza and total out the door for two people is under $30 including tip!  AMAZING!\n\nMy only hesitation going back is those lines.  Not sure about that....", "author": "Sandy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-04", "description": "The white pizza is amazing!! The garlicky flavor of the white pizza is definitely worth the wait...although I did wait about 1.5 hours (Sunday at 6:30pm, seated at 8ish). \n\nThe pizzas don't even really need any toppings though we got one tomato with pepperoni and one white with sausage. \n\nThe line moves fast if you are only a party of 2. We kept seeing people get pulled to the front and get seated. \n\nThe BEST part of this location is the view of the manhattan skyline. It's so beautiful!!  After you stuff your face with pizza, head over to the ice cream factory and enjoy a romantic stroll by the water.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "We took a taxi to Brooklyn on a cold rainy Tuesday night JUST for Grimaldis and our pizza did not disappoint. We got a large pepperoni and the crust was delicious. \n\nLocation: fulfilled my expectations and made my short visit to Brooklyn worth it.  Just under the Brooklyn bridge, we asked to take our pizza to go so we could admire the view while enjoying our food. \n\nService: we were quickly greeted and waited on.  Our pizza was brought out while we were reminiscing about our prior night out.", "author": "Meghan T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-01", "description": "GREAT location, so-so pizza. Sorry, Grimaldi's. I wanted to like you, I really did. It was on my list of places to try on the East Coast and sadly, the experience just didn't measure up. \n\nThe pizza was all right, decent but not memorable in the slightest. Forgot about it as soon as we walked out, in fact. \n\nWaiters + service was great, though. Cute and accommodating, just how I like 'em.", "author": "Zohal S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-02", "description": "We came here hoping to get some awesome pizza at a legendary place, but we was wrong. The staff did not look happy to get customers, and we did not feel welcome.\n\nThey do not have pre-defined pizzas, instead you have to create your own from a list of ingredients. We chose italian sausage, meatballs and jalapenos. All the pizzas come with mozzarella and tomatos as standard. \n\nIn our opinion the pizza was substandard, and too expensive for what you get. They do not sell beer either, so hope you like sodas with your pizza.\n\nLuckily, we did not have to wait in a line to get in.", "author": "Alexander N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-10", "description": "prepare to stand in line, but it is worth it! came here during the lunch rush and we were lucky that we were seated quickly since we were only a party of 2. the small pizza was enough to feed my husband and i, we added pepperoni and fresh garlic! \nthe dough and sauce makes the pizza, it is heaven! i honestly cannot get enough of it! after eating pizza, we walked across the bridge to walk off some calories.. i know crazy analogy!", "author": "Aira T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-09", "description": "Red sauce was definitely better, but we expected so much more. Ask to sit downstairs, it is a bit stuffy upstairs. (That's if you even have a choice since the wait can be long.) The host is wonderful!", "author": "Eunice M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-30", "description": "I love coal oven baked pizza and Grimaldi's does it best. I have visited the original Brooklyn place a couple of times and now also the one located in Fort Myers, FL. \nIts just downright good crispy, flavorful pizza with quality fresh ingredients. The salads are huge and are great to share. I love the simple dressing used for the salad. Nothing too cumbersome or overwhelming. The pizza which I shared with another person was huge and we loved every bite of it. This is PIZZA man.. Not imitation in any way. Great job Grimaldi's but now can you move to my home state of Missouri? Can't wait for my next visit. Luv Yah.", "author": "Denise S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-27", "description": "The line was about a 40 minute wait on a Friday night.\nThis was my first time but I wouldn't come back again. Sure, the pizza was pretty good, the fresh mozzarella and pepperoni were delish but that's because I didn't eat all day.\nThere are a lot more pizza joints in the city that don't require a long wait and are more better.\nI came here because of the \"buzz\" so now I can say I've been here.\nSomething to check off from the list.", "author": "Caroline V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-13", "description": "NO NO NO NO NO NO NO NO NO NO NO.  This was easily the WORST pie I've eaten in NYC in decades.  To begin, the $12 antipasto is 6 slices of cheap\n sandwich salami, 3 olives, 4 pieces of rubbery, tasteless,\"fresh\" mozzarella and a few pieces of cold cooked dough, all served on a paper plate.  The pie wasn't much better.  The crust was flat and hard and tasteless.  The outer 2/3s of the slice were impossible to cut with a knife and fork.  Easily the most souless crust I've ever had. The sauce was average and the cheese tasteless.  All very sad as I remember how delicious the pies were when they were down the street.  Perhaps their new oven doesn't get up to temp and they've obviously skimped on quality, care and soul.\nAlso, I noted they were making people stand in line outside while there were plenty of empty seats inside to make it look like there was some kind of demand.  The faux-hardass bouncer doorman didn't help much either, but perhaps he impresses the tourists?  \nSpeaking of, there were tourists all around me and I truly felt sorry that they were wasting a meal here and thinking this was one of NY's best.  Sad!  \nAVOID AVOID AVOID.  I've had dollar slices that were 100x better.  I've had pizza in the midwest that was 1000x better.  This is NOT NYC pizza.", "author": "D R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-07", "description": "A staple in NYC (Brooklyn).  The freshest ingredients on a pizza that is perfectly cooked.  \n\nIt sounds cliche, but this could be New York's best pizza.  The charred crust and perfect sauce make any pizza from this place a winner.  \n\nThe only issue is the wait.  You may have to wait an hour or more just to order so be prepared.  It is worth it though.  \n\nTo be honest I haven't had a pizza from there in a while and now I want one.  \n\nThanks", "author": "Joe C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-02", "description": "Good pizza, but unprofessional environment...employees were yelling and throwing punches at each other - startling the entire restaurant filled with families. I expect better, this was ridiculous. Get your act together.", "author": "Virginie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "I've been here a few times when people from out town come visit me in BK. it's close to great views of Manhattan, the Brooklyn and the manhattan bridge. \nEvery time I bring people here, they love it. Last time I was there though, I was brining my family (tourists) and I quickly noticed that they had plastic plates and plastic utensils. I felt bad I had brought my family because that really made the restaurant look cheap. Other than that I always get the pepperoni and sausage regular pizza and it's a great combination and it never disappoints.", "author": "Patricia Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-28", "description": "I've been here many times in the past. Honestly nothing great about it except the brick oven and location. There are several more copy cats on the same block. Four of us ordered two large pies. One plain and one with jalapeño. Each were $18 and the came to be $47. Why taxes 20% and tip 25%. I was upset about that even though I gave $50. There is a spot in midtown called Bella located on 58 street between 7th and 8th Ave. better pizza, service and you won't get jacked.", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "On my TOP 5 NYC pizza joints. \nThe wait is atrocious, so be prepared. They don't do delivery or take-away orders. DINE IN ONLY", "author": "T. C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}