{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-01", "description": "Hands down the best pizza I had while in New York. The ingredients were all fresh (you can see them making the pizzas when you walk into the restaurant) and the pizzas are huge. I would definitely revisit Grimaldi's next time I am in New York.", "author": "Louise P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "This place is well worth waiting in the extremely long line to get in.  Just don't even try if you're being spontaneous and pushed for time...seriously, you're going to be standing outside for a long time.  I've always been greeted by a rather friendly Italian-American and promptly shown to our table -- which is often with other people.  I actually like that -- I really do like sitting at a long table with other guests, it feels more social -- like you're at a big family gathering, but I can understand why other people would find that rather uncomfortable.  What I say to that is -- go with it and say \"hi\" to the folk next to you when you're sitting down and hope that they're social (more often than not they are, in my experience).\n\nAs for the pizza itself...it is certainly the best I've ever had.", "author": "Ewen Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-18", "description": "I finally decided to come here and see what they hype was all about. Got here early before they opened, maybe 10 minutes prior and no issue with a line. I'm by myself so I end up sitting at the bar.\n\nWhen the bartender comes, I tell him, \"I'm from f-ing New York and I'm not like all these other tourists.\" He laughed when I said that. Nk, besides the table of cops that was behind me, every other table were tourists. Even the other people who joined me at the bar were tourists. \n\nPlace is CASH only, so make sure you bring enough cash. It's a thin crust pizza, not NYC style at all also. So while I liked the pizza, don't think this is an example of NYC pizza because it's absolutely not. \n\nI ordered the 12\" and got a half and half. Got anchovies on one side and pepperoni and olives on the other. Yeah, my pizza turned out kinda salty but it was all good. I ate the whole thing by myself and it's really good. A really solid pizza. There's only one big complaint and I've found. The pizza cools down after 5-10 minutes and the cheese on it congeals. The taste of the pizza becomes very mediocre. at this point. So the lesson is to eat as much as possible when they bring it out to you pipping hot.\n\nSo a funny story. The couple next to me didn't finish their 12\" and left 2 slices. The guy asked if they wanted him to pack it but they told him to throw it out as they couldn't bring it with them. Out of habit, I immediately told them not to throw the food out and I'd take it! Terrible. I suddenly realized what I had done and laughed at myself a little embarrassed but everyone there took in great stride. The couple especially. I told them I was from a third world country and just couldn't see food being thrown out. The couple was again, totally cool and very happy to give me their last two slices. Those slices btw, didn't taste no where as good when I took them back and reheated them. So another lesson, don't do take-out here. Eat the pizza here.\n\nOh, I do want to say one last thing. As much as I liked the pizza, there's no way I would wait 2 hours in line for the pizza. I don't think I'd wait 1 hour for the pizza. Maybe 15 minutes.", "author": "Dang N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "The cheese on the pizza is incredible. No alcohol is served, so was disappointed you can't buy a beer with pizza. Cash only, whole pies.", "author": "Christopher L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-20", "description": "A coal fired oven in Brooklyn? Grimaldi's uses 100 lbs of coal per day!!!\n\nThis is how they get the thin crust crispy with a unique smokey flavour. Less is more here as there is just the right amount of ground tomatoes, mozzarella and basil in their FAMOUS Margherita Pizza. \n\nP.S. We didn't have a lot of time in NYC but wanted to hit Grimaldi's and L\u0026B's for pizza. We booked the \"Slice of Brooklyn\" bus tour and didn't have to stand in line. It was smoking hot the day we went and we just walked in from an air conditioned bus!  Our guide Paula did all the ordering etc. it was awesome!", "author": "Lorraine B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-14", "description": "While in New York everyone advised that Grimaldi's was a must, specifically this location. So, my brother and I set out on a little adventure to Brooklyn. We arrived a little before six and we were able to be seated right away. Lucky us! We really wanted a beer with our pizza, but they hadn't yet got their license back. No biggie. We ordered a small with mushrooms and sausage. It took a little while for the pizza to come, but we stayed occupied watching the waitstaff hustle and I was completely entertained by their accents. I wanted to strike up conversation just to hear them speak. Our pizza finally arrived and it looked delicious. Nice thin crust that you can easily fold and devour. The ingredients all tasted extremely fresh and you don't get that super acidic overpowering taste you get from canned tomato sauce. We polished the entire pizza off within minutes. I was expecting a little more flavor from the sausage, though. Our experience at Grimaldi's was great, however, I can't say it's the best pizza I have ever had. I feel the jury is still out on that one.", "author": "Sara S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-21", "description": "Just like everyone else, I waited over an hour in the freezing cold just for some of this pizza and I must say, it is by far the best I have ever had. If you're the type that likes a light pizza like me, you will love this place. The crust is thin and every topping they throw on is just the right amount in my opinion. Also, I can't get over how beautiful the cheese was. The best. If you're the type that likes the deep dish, heavy on the cheese, you might not like this place as much. Inexpensive, delicious, It is definitely worth the hype all around and I would love to come back but only if the line is short...which is probably never.", "author": "Ai-Mei Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-04", "description": "Don't know how good the pizza here truly is because the service was so bad that we didn't get our order until it was almost cold. \nWe placed a pizza order to go \u0026 planned to walk down to the Brooklyn Bridge park,  but they apparently forgot about us \u0026 by the time we went to check on our pizza it was barely \"still hot\" (as the lady put it). In just the 5 minutes it took to walk to the park, the pizza was cold.  I will try it again one day maybe, but for now, they get a 3 for terrible service.", "author": "Ms U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-08", "description": "Iconically situated under the beautiful Brooklyn Bridge,this treasure is a must when visiting New York City.I had the large regular pizza which I shared ,and it was still a huge serving !I have to add that it was definitely one of the tastiest pizzas I have ever had .I went in November 2015 when it was very cold so fortunately there was no queue ,though I have heard that it gets really busy.Service was good and pizza was served really fast", "author": "Nicole Stepping O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-14", "description": "Pizza was good.  Atmosphere was lacking and you eat on paper plates with plastic forks and knives so not sure what kind of vibe they are going for - kids bday party?  Also no wine or beer- this place has been around for too long to not have a liquor license.  Luckily there was no wait, but definitely not worth waiting an hour.", "author": "Fiona A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-31", "description": "Grimaldi's was another overhyped pizza house. Now hear me out before y'all from Brooklyn try to murder me out here. It was no doubt one of the most unique pizzas I have ever placed in my mouth and it should be famous for that alone. \nThe cheese was a very interesting texture that I couldn't quite put a finger on. Slightly gooey feeling but at the same time stiff in some ways. The cheese was not evenly spread across the pie and there were just parts with just tomato sauce. \nThe toppings were fresh and very nice but this uniqueness didn't sit well with me. It just didn't taste like pizza to me, and left me a bit unsatisfied. I do however compliment them on their legitimate dough crusts that were thin and crunchy. \nI like how the store has an old school feel and that its on the way to the ocean where Manhattan/the bridges can be observed. Let's say 3.5 rounded down.", "author": "Dan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-05", "description": "We went here on the Slice of Brooklyn Pizza Tour and were seated and fed right away.  No lines for us!  The pizza was probably the best I've ever had, crust, cheese sauce and basil all fresh and delicious.  Cooked on a 900° coal fired oven.  The pie cooks in three minutes.  I can't comment on the lines or service or payment methods but the pizza was incredible.", "author": "Scott M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-23", "description": "The pizza here deserves all five stars, but I deducted one because of their service or lack of. I dined here the week before Christmas of 2012 and there was absolutely no line or wait to be seated. It's a bit cramped though - the chairs are small and so are the tables.\n\nSide note: I found out about this place from a colleague. Funny thing is that I work for a Canadian airline (I'm American and live in Chicago) and one of the pilots, who is Canadian and resides in Toronto, told me about this place. He's never been before, but I will talk him into it when I get a chance.\n\nSo anyway, the pizza was great and the price was reasonable. Best thing was there was absolutely no line! The place was hoppin' though. I love thin crust even though I grew up in Chicago, which is known for deep dish pizza.\n\nThe service could have been better. It was probably lousy because they know their pizza is amazing and you're there to have their pizza, good service or not, which is very unfortunate for us.\n\nTip: Since the service isn't all that great, I would order the pizza to go. That way, you avoid the long line if there is one.", "author": "Pearl H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-23", "description": "Grimaldi's... one of the few on my short list of places to go for pizza.  However, before you read too much into it, it is not the best pizza.  That acclaim can only be given to Di Fara.  People rave and rave about it as the best... i can not disagree more.  My reasoning isnt superficial... nor does it all come down to the pizza itself.  It's everything.\n\nWhen I brought my play date here for some good eats, we noticed the seating was tight and packed together in arms with our neighbors.  So much for atmosphere.  That went out the door, especially with the crazy line waits... is it really worth the wait?  The answer is a resounding no.  Our pizza came out somewhat doughy and crispy at the same time... an odd combination of undercooked-ness.  We also felt like we were being rushed- in and out.  Is the food good, that much I might agree to if I was hungry, which I was.  We'll see if I return... I shall have an update for you.", "author": "Ron L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-15", "description": "This review is about 7 months late lol\n\nBeing a tourist, Grimaldi's was one of the spots we just HAD to hit up.  Damn.\n\nNot only was it 92 degrees out but we waited in line for 60 minutes -_- ...and I'm already tan as it is but my shit was burnt after that haha\n\nThe location of the restaurant is right underneath the BK Bridge which is pretty cool though :)\n\nAnyways... I didn't really know what to expect with \"authentic new york\" style pizza...I've had versions of it in Seattle, but I was excited to finally try the real thing!  We ended up ordering a sausage \u0026 pepperoni and tasted pretty good!  You can tell they used fresh ingredients and the brick oven makes it taste cleaner! lol\n\nI won't front...after waiting that long and hearing all the hype about this place I expected the pizza to blow me away...but it was just OK to me...comparable to places in seattle like tutta bella and piecoras....\n\nAll in all, it was an experience to wait that long but it's cool to be able to say I've ate at a famous place like this.  Will I ever go again?  Probably not. lol", "author": "Charlene J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "Oh pizza lord in the sky.  You have definitely sent an angel to touch upon the borough of Brooklyn.  Blessed art thou pieces of mozarella cheese, and large leaves of basil.  Blessed is your thin dough, crisp crust.  Let all thy ingredients enter my stomach again and again.\n\nSo Grimaldi's is right by the Brooklyn Bridge and expect a long wait if you get there at peak dining hours.  I was lucky to be there around 5pm and there was no line.  I did take out and took my pizza to the riverside.  I enjoyed my pizza and the spectacular view of Manhattan.\n\nThere is something that detracts from the experience is that there is a buddy-buddy relationship between the regulars and the owners.  It runs like a close family operation and the service is curt otherwise.  Not unfriendly but just short.", "author": "John H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-02", "description": "I was not a pizza fan until I met my man. We moved here from California therefore we didn't get much exposure of the \"New York Pizza.\" I brought him to Grimaldi's as our first pizza date. We enjoyed it despite the long lines. Upon our turn, we were seated upstairs and greeted with smile. We feel like home. We ordered a sausage-pepperoni pie and we call it a day. Everything was perfect! We would definitely come back for more. I'm looking forward to try their new Manhattan location too!", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-22", "description": "Best NY style pizza? I don't know, after waiting about 2 hours for this pizza I really don't think it's really worth all that waiting. We ordered a pizza with just sausage on top of their traditional pizza-they have a white pizza option as well but we went with the more traditional kind. \n\nThe mozzarella was fresh, and you could taste the difference and the basil also was fresh and pungent but there wasn't a lot of it and it was focused on the center of the pizza. The sausage was just all right, I thought it would be a spicy Italian sausage but it didn't really carry too much flavor on its own. \n\nThe pizza though was pretty good, but the overall experience was just okay.", "author": "Ted C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-24", "description": "I'm craving this pizza big time and it's been months since I've consumed it! I wish either one of two sci-fi-esque scenarios could happen right now: 1) for the photo of the pizza I ate to materialize into the real thing, or 2) to be teleported to Brooklyn! \n\nGrimaldi's was definitely, without hesitation, worth waiting in line for.", "author": "K. A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "A lovely atmosphere, friendly staff, good service, and the best pizza I've ever had. Get their original margherita pizza and don't mess with additions or adjustments, because they proportion everything perfectly - the cheese, the sauce, the basil, all of it! Also, the biggest surprise was how delicious and large the cannoli was; it's a must-have when you visit this historic pizzeria under the Brooklyn Bridge.", "author": "Alex B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}