{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "Ahhhh....\nAlthough the recent fire incident has had in impact on this fine establishment Im delighted to report the Pizza is still the same old greatness it always was. \n\nI love this place!!!\n\nIf only they delivered to New Zealand!?!", "author": "Paul M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-17", "description": "Oh how I love Grimaldi's!! I've been here twice now and just cannot get enough of their amazing pizzas.  The wait is long, but very much worth it, and their pizzas aren't even as pricey as I expected! Satisfied customer definitely coming back multiple more times :)", "author": "Batul A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-07", "description": "Grimaldi's has been mentioned as best pizza in New York, thus we had to give it a try. Obviously, this kind of publicity makes it a bit of a tourist trap, and it shows. I am rating it at one star because of the service received. \n\nDue to a lengthy wait we decided to order take out instead of eating in. The problem arises when you're waiting, first for the 20 minutes that you were advised it would take, and then for another twenty minutes. My wife went inside to ask for the status of our order three times after the initial 20 minutes and was told to go away, someone would come outside once the food would be ready. \nOf course that never happened, and when I went to check in one more time our food was ready, wrapped up and just waiting for pick up. \n\nMy complaint was met with 'no one came to look for this! It is still warm, and won't get better if you stand here shouting at me!' (those who know me know that I am far from shouting, ever). \n\nWell, so we took our like warm pizza. \n\nIn terms of the food: Yes, the pizza is okay, but unless all you've had in your life is Domino's, then it's also nothing special. Any pizza in Europe that comes from a proper oven has this beat, and there's also nothing new to it in terms of concept (such as for example Chicago's deep dish pizza, which is original). \n\nOverall, pass this place.", "author": "Oliver S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-29", "description": "By far my favorite place to eat for pizza in all of NYC. It's always fresh and the staff is always phenomenal! You know you're gonna have a great pizza if you see Grimaldis! It doesn't leave you feeling like you've just eaten too much either. It's a very light pizza. Keep it up!!", "author": "Jonathan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-14", "description": "We came a long way to get here.  Visiting mid-town  NY family, we were down at the Trade Center memorial in the sub-freezing temps when I decided I wanted to try historic Neapolitan pizza ( real Italian style).\nMy family obliged and we all took the Metro (little ones and all) down to DUMBO to Grimaldi.  \n\nMy sister knew that lines form outside so when we approached and there was one person outside she was worried it was closed. Thank God the cold kept the huge crowds away.  The guy at the door took us in right away.  One thing, the stroller would have to stay out in the freezing cold.  We did a quick job or taking valuables out of the stroller but had to leave it out there near the door guy.\n\nServers were nice.  No frills place settings, paper plates and such.  That was fine.  We got three large pies for a group of 6 adults and two kids.  It was just enough for hungry appetites.  The pepperoni was best.  Good combo of spice in meat and mildness of the mozzarella hunks.  The olives were very briny which my sister liked.  I thought they were a little more briny than I prefer.  My least fav was the cheese, only because I felt like there was a scarcity of cheese hunks.  Order extra cheese. The dough made a great cracker thin crust with coal fire flavor.  It was my favorite part of the pizza. \nI would like to try Julianas next door next time to compare these two long standing institutions.  Thanks to my fam for bringing us here.", "author": "Anita T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-07", "description": "I knew I had to try New York Pizza and from the amount of reviews and ratings this place has, I figured I'd give it a try at least as a base.\n\nWAIT: You have to wait in line and then they call you up when your table becomes available.  For a weeknight at 8pm we only waited like 15 minutes.\n\nATMOSPHERE: A basic pizza parlor place, nothing fancy.  I could tell it's probably been around for a while the way it looked and there's an upstairs.\n\nFOOD: We got the red sauce pizza and the white pizza.  On the red sauce we put sausage and mushroom.  The crust wasn't soggy and it held it's own, crusty, crispy and thin.  It was pretty dang good.  \n\nThe white pizza had pepperoni and onion.  Also very good, lots of garlic so I was a fan.  Some people might not like the fact that it doesn't have tomato sauce, but I liked that.\n\nThis is definitely a traditional pizza place.  They don't have those \"premium\" toppings such as prosciutto or asparagus, goat cheese or pear etc.  So you have to make do with what they give you.\n\nTo be honest though, the thin crust pizza we have here is pretty comparable.  Again, maybe I didn't try the \"best pizza in NY\" but Bottega Louie and Pizza Mozza were pretty good too.\n\nOverall, good for a chain.", "author": "Brittany T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "The Brooklyn Bridge is an iconic landmark in New York. Nestled beneath this popular locale, Grimaldi's Pizza is an iconic landmark in itself. For decades, the Grimaldi family has been making pizzas that stand up to the best pizza in New York and Italy. Baked in a hand-crafted coal-fired brick oven, the pizza at Grimaldi's has a unique flavor, perfectly crisp crust, and outstanding flavor. If you want a New York style pizza with an Italian twist, check out Grimaldi's. They've made their mark in the pizza industry. It's your turn to make your mark on one of their signature pizzas.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-08", "description": "By far the best pizza in New York City! Beware: cash only and you have to order a whole pizza. We were hungry and the two of us finished a small pepperoni pizza and each a soda for $25. The crust was coal fired and delicious and the ingredients were clearly fresh. We walked right in and sat at the bar. It took about half hour round trip to order, eat, and leave.", "author": "Molly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-04", "description": "My friends came to visit from Spain wanting to eat the best pizza in NYC ! Best experience I ever had! The staff was very friendly service was fast and to the point.", "author": "Gloria P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-25", "description": "I'm so sad I wasn't starving when I came here. The pizza is delicious. Got the white pizza with sausage. Mozzarella is my weakness. The pizzas are larger than I expected. Its definitely not a personal pizza size! And it is cheap!\n\nService was meh. Although there are a lot of waiters around, my friend and several people around us kept having to ask for more water. \n\nCan't give this place the 4 star I want to due to the service.", "author": "Anthea W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "This place is delicious. The small calzone was HUGE and overflowing with cheese!\n\nWe ordered two large pizzas. One with cheese and pepperoni, the other with meatball and mushrooms. Thin pizzas cooked to perfection!\n\nIt was really cold today, so there was no line. On a normal day, plan on waiting. It's worth it!!", "author": "Sandie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "So , lets start off with yes, I know it's a touristy thing to do, and I am sure there is more amazing pizza to be found in Brooklyn off the beaten path. But, for a quick day trip to NYC from Jersey, this was perfect! The pizza was delicious and very reasonably priced. Luckily there was no line and we were seated right away. Service was friendly. Cute , older building , sat upstairs on second floor.  Located up the street from the pier , we followed up pizza with ice cream under the bridge at the Brooklyn Ice Cream Factory.  It was a fun afternoon and would definitely recommend to anyone wanting a good Brooklyn pizza!  Only reason I am giving 4 stars instead of 5 is because they don't serve fountain drinks, only bottled soda and Snapple, I spent more $ on 6 drinks than I did on the pizza.", "author": "Dawn G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "I love how this pizza place is ran. You come in, eat fresh stone oven pizza of your choice and you leave completely satisfied. May I add the pizza chefs are professionals they know exactlu what they are doing.", "author": "Jeanette M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-24", "description": "Pizza was noting special as people make it out to be overrated at its best ... Line was to long anyways ... And price $$$ ... Better luck next time if i ever have a next time", "author": "Issac L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Best pizza I've had in my life. Period. Well worth the wait. I had this pizza right before I left for italy, expecting to go on a whirlwind of delicious pizzas throughout my trip. I was shocked (and dissapointed) to find that this pizza was my favorite...even over the ones I had in Italy.", "author": "Martin R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-06", "description": "This is a 2.5 to 3 star place because of their lack of consistency and tourist style service. \n\nHOWEVER! This is a must visit for everyone and mandates at least 4 stars because of their history. Also, the pizza is great if you get lucky. Too bad they moved locations. The place next door serves the consistent version of this, and from the original location. \n\nActually, as I write this, i think i would recommend the place next door because its truly the original girmaldis oven and still family run. Maybe I will downgrade to 3 stars later.", "author": "B C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-17", "description": "Best pizza in New York! \n*Got half plain and half pepperoni as recommended by Mr. Jimmy. \n*Delicious and fresh pizza \n*Amazing and friendly staff \n\n*****Highly recommended*****", "author": "Carolina H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-11", "description": "So it's one of those obligatory, bucket list-y types of things to do. You go to Grimaldi's for some pizza, then you walk back across the Brooklyn Bridge into Manhattan. After about 50 trips to New York, I finally got around to making this pizza pilgrimage. And I wasn't disappointed, but it wasn't really revelatory either. The restaurant is right on a corner just a couple of minute's walk from the bridge. We got there about ten minutes before noon on an Friday, which was a stroke of luck, because 15 minutes later there was a line outside waiting for a table, whereas we had walked right in. You can pick your own seat in this case. We got the small (which, trust me, isn't small--more than enough for two people) and added grilled chicken, onion, and sweet peppers. It came out a little lightish on the chicken and heavyish on the peppers, I thought. It was pretty tasty, with some nice char on the bottom of the crust, but the peppers were chopped too big and tended to overwhelm it. I pulled a few off and that helped. As for the service, it's what you'd expect--they take your order, they bring you your food, they collect the money (cash only). And don't even think about ordering a slice--full pies only, which I can't blame them for. Keeps the stock fresher. \n\nOne major plus is the proximity to the pedestrian entrance to the bridge. That's a really spectacular walk and it only took us about 25 minutes. It's just minimal exertion and well worth the effort.", "author": "Adam B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "If I could give this restaurant more stars, I definitely would. I would give it 100 stars, but Yelp limits me. I know that some people may disagree with me but this pizza is the best pizza I have ever had in my life. Not to expensive, very kid- friendly, owner is very funny and nice, and the place is very cozy.", "author": "Amy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "Great pizza \u0026 good customer service. Only issue is that it's cash only but overall great experience. Go for the white pizza!", "author": "Tinu K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}