{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-30", "description": "It's in Brooklyn. You have to cross the bridge. That is usually the clincher for me...\nI love Pizza, I mean love it. Fresh crisp crust, fresh sauce, great toppings. I love the fresh Mozz, But, IMHO, not as good as John's. The sauce does not match up. The crust is good, salty, but good, but I have to say one more time - John's brick oven is the BOMB! Try it.", "author": "Rob H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-23", "description": "I did thoroughly enjoy my lunch here.  Now I know why i had to wait in line for over 30 mins at 2:30 pm on a weekday because the pizza was delicious.  The fresh ingredients \u0026 the thin crust just did it for me.\nThe prices were reasonable and the service was quick.  This is a pizza joint after all so I expected a no frills experience and it was pretty much so.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-24", "description": "My wife and I recently stopped here as part of the \"A Slice of Brooklyn Pizza Tour\" (highly recommend!) and really enjoyed the pizza.  This is one of the best slices of margherita pizza (neopolitan style) we've ever had, for sure!  The sauce is plain (just San Marzano tomatoes) but paired with the wonderful fresh mozzarella and basil, it was simple and delicious!  And the crust is absolutely outstanding!  Crisp and thin!  We ate at the \"Under the Brooklyn Bridge\" location which has the bonus of being located in a historic building and also within a block of a wonderful view of the Brooklyn Bridge and Manhattan skyline.\nPositives: Excellent crust, delicious enough to stand on its own (tomatoes, cheese, basil...that's all you need), historic building and great view of Manhattan and Brooklyn Bridge just oustide the door.\nNegatives: Depending on the day/time, you may have to wait in line for a while.  Luckily we had no wait due to the tour we were on which had exclusive access to bypass the line.", "author": "Jeffrey T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-28", "description": "So you stand in the line and think, \"How could this possibly be worth it?\" \n\nYou enter and think, \"Yeah, so it smells good in here, so what?\"\n\nYou watch the men expertly making your pizza tossing dough to one another and think, \"Impressive...\"\n\nThe pizza arrives at your table and you think, \"Oh yeeeeeeeah......\"\n\nThen you have a bite and you realize you probably never need to have a relationship with another human again. The pizza at Grimaldi's is enough. \n\nGo. Just go. \n\n\n(and bring sunscreen for when you have to stand in line)", "author": "Holly N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-24", "description": "Really great pizza! But there is always a line to get in. It's a go to place to take friends or family visiting New York.\nTry it out if you're in the area.", "author": "Garrett J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-26", "description": "Pizzas was ( I remember it being better years ago)ok. There is no atmosphere . You fell like your in a run down building .", "author": "Dan B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-03", "description": "This review is soley on the service of this location on 6/2/14 at 9:30pm\n\nI'm a manager at a hotel in Soho and I have over 6 years of experience in the hospitality industry and I have to say the service I received at this location was terrible. Its unfortunate because I always recommend this location to guest at the hotel because of the great view of the bridge and Manhattan sky line. My friend works at Brooklyn Bridge Garden and we decided to visit the infamous Grimaldis that is located near her job. All together we were a party of 5 ready to enjoy a great pizza. \n\nWhen we arrived we noticed there wasn't a line (Score!) and we walked right in. We waited patiently to be seated and received no eye contact or even a greeting. Oddly enough it didn't look super busy at all. We finally got the attention of someone and were seated.  We were seated near the steps and our table was pretty small and only seated 4 people comfortably .We decided it was best to take our pizza to go. We went to the front counter were there were quite a few people behind prepping pizza and a lady with blond hair on the phone. We were deciding on our toppings before we even attempted to place our order. \n\nMy friend then politely excused herself , then asked if she can place her order and she was then told to hold on one moment, which was fine. Then this man with a slight accent seemed like the manager walked over and said \" you have to wait for your pizza outside when your order\" which i found a little rude because we could've of easily sat at the bar and purchased a drink while we wait ( loss of revenue). Even then we didn't really care because the weather was great out.\nThe best part was when the manager then said \" She gets very overwhelmed with people so stand outside\". He was referring to lady with the blond hair. That was ridiculous. Why would you employ someone who  is easily \" overwhelmed\" in a heavy traffic restaurant. Obviously not the job for her if that is the case. She even had a smirk on her face when he said it. Customer service is major and i was very unsatisfied with the service and lack of professionalism. As a customer I don't need to know that your staff is overwhelmed. We left and do not plan on returning or recommending this place to anyone.", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-20", "description": "A bit overrated but it was a decent pie. I wouldn't wait the 45-60 minutes outside on the streets again though.", "author": "Diya L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-07", "description": "What we learned by going to this place? To eat before going there because u will starve and starve really badly...a strategy? \n\nWe stood in line for 2 hours to go get into this place!! The whole time I prayed that this place was worth it because my friends would definitely strangle me. \nWe walked upto the second floor and what do I see. There are not one, two or three but six tables empty!! just on the 2nd flr! WTH?\nthis place takes no reservations or makes deliveries!\n\nWe waited 15 mins for the waiter to finally notice us and had to wait 30 mins. for our simple large pizza with mushrooms, cheese etc. to come. Interestingly enough people who arrived after us got their pizza already. \nJust when we were ready to eat our tissue papers it arrived. \nAfter inhaling 2 slices I stopped and started to savor the third one and it was good but good enough for all that hassle. No!\nThen we had to wait 15 mins for our check. I was ready to leave if that would have brought the check faster.\n\nThis place really needs to come up with a faster service strategy, a numbering system or something like in Olive gardens. \nI am not going back to this location", "author": "Mehwish K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-26", "description": "Rude old man in the front. Pizza was good and  waiting on line was no problem. But next one in line and he took the people behind us because my sister needed to use the ladies room so he would not sit me down. Makes no sense. Customer service sucks!!!", "author": "Donna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-04", "description": "Pizza set to Sinatra's music with the Brooklyn Bridge looming.  Can't beat that!!\n\nIt's overwhelming.. but remember, you are here for one thing. To taste something special... Pizza from Brooklyn cooked only one way it should be..  in a coal brick oven! \n\nWe visited this place in January.. it was a cold day. Waiting outside was not fun. So when the main dude called out and asked who wants to sit at the bar, we jumped at the chance... anything to get inside. Warning, if you sit at the bar, everytime the door opens, you will catch a draft.  But hey... you're inside, you can order... get some wine and relax. \n\nIf it's your first time. Make it simple. Order a pizza with basil, garlic and mozzarella. You can ask to add the basil in after it's cooked, it will be fresher that way. Anyway, this pizza is classic and it's simply perfect. It's not just the pizza, it's the atmosphere. Soak it all in. This place is an institution. Check out the walls. \n\nIf you have doubts on what to order, the staff is great. Tell them it's your first time and they'll school you on what to get.\n\nI said it once, and I'll say it again: Pizza set to Sinatra's music with the Brooklyn Bridge looming.  Can't beat that!!", "author": "Francis A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-12", "description": "Grimaldi's was just regular pizza. Maybe even worse because I would actually eat regular pizza. I mean, it is brick oven pizza but there was nothing special. \n\nThere was not much sauce on our pizza and it ended up to be a little dry.\nThing is, it was so dry that I felt the need to put on some peppers and garlic and even that didn't help. Some of my acquaintances who came with me said \"good pizza doesn't need condiments.\" This pizza couldn't even be saved with condiments. \nThey all \"ate it with orgasmic pleasure,\" but I came here with my best friend and he said it was terrible too. So I don't know if the rest put on a facade or they actually enjoy eating pita bread with cheese and sausage on it.", "author": "Edward M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-27", "description": "Cash only! but that means lower prices. \n\nThis is a wonderful treat at the end of the Brooklyn Bridge. I went for lunch at Grimaldi's at around 3pm, but still the wait for my simple pepperoni pizza took quite some time. But the environment of the place is like what pizza huts aspire to be like. \n\nTheir pizza is TRULY like no other. They don't overdo the cheese at all (i think they use mozerella?), in fact, it's not completely covering the pie because it doesn't need to! The sauce does the same, it shows up where it needs to, and doesn't apologize! My pepperoni was perfectly crispy and salty, and the crust when warm is HEAVENLY. \n\nMy friend and I had 12 slices to devour by ourselves, and we did so without a problem! \nIt is quite a trip down to brooklyn, but Grimaldi's is a pizzeria to remember.", "author": "Claire Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-27", "description": "The freshest ingredients which I found out are actually imported from Naples, Italy complete this delicious and freshest by I've eaten in the city. \nevery new yorker needs to have a slice.", "author": "Sarah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-10", "description": "I've been to Grimaldi's many times but never wrote a review.  So here you go! \n\nWent there with my girlfriend yesterday after a nice walk from the promenade and admiring the beautiful view of the city and brooklyn bridge!  \n\nI actually didn't know that they moved next door to the corner until we got there.  This is great because the old location had limited seating.  Now, they have two floors, but there's still a line!!!  We only had to stay online for about 20 mins (FYI, take out line is the same line!).  We decided to do take out and enjoy our small regular pizza  (6 slices) to eat it on the benches along the water - had to enjoy the beautiful weather outside!  \n\nI love the pizza at Grimaldi's..it's not as oily... i love their cheese, crust, and of course BASIL!  I didn't feel any regret to eat 3 slices on my own (neither my friend who was heading to the gym to workout LOL).", "author": "Pao L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-21", "description": "I've been to Grimaldi's so many times I assumed I already wrote a review for them, I guess not. Grimaldi's' background is a historic one though they've only been around since 1990. They're still one of the most well known Pizza places in New York and being below the Brooklyn bridge the experience is a magical one. They only do whole pizzas and they don't do slices. They also don't do delivery and don't take reservations. The owner is extremely friendly and usually thanks everyone with a smile when you're leaving and it's really a friendly place. The interior is packed full of tables and chairs, old NY nostalgia along the walls with usually Sinatra over the speakers. \n\nThey've got a whole list of toppings you can get here but if you've never been you should really start with their signature, the Margherita pizza. Grimaldi's isn't my favorite pizza in NYC but it's absolutely in the top 10 (maybe even the top 5). \n\nThe only real negative of Grimaldi's is that Grimaldi's has become more of a tourist spot then a place for locals and because of that 75% of the time they're open there's a line out the door and down the block of people waiting for a table (think Shake Shack). But if you can go during a not so common time and hit that 25% of the time were you don't need to wait it's definitely worth it. \n\nAnd for those who are interested, the history of NY Pizza:\n\nGennaro Lombardi an Italian immigrant moved to NYC and opened a small grocery store in Little Italy around 1897. One of his employee's Antonio Totonno Pero started making pizzas which became the staple of Lombardi's so they officially opened America's first pizzeria in 1905. Pasquale \"Patsy\" Lancieri and John Sasso were two of the select to train under Lombardi and opened their own pizzerias (Patsy's in East Harlem around 1931 and Johns Pizza in Soho in 1929). A little earlier Antonio Totonno Pero left Lombardi's about a quarter century after he had started with Lombardi and opened up \"Totonno's Pizza\" in Coney Island in 1924. In the 1940's Patsy Grimaldi (Lancieri's nephew) trained under his uncle and learned Lombardi's secrets and eventually opened Grimaldi's under the Brooklyn Bridge in Brooklyn around 1990.\n\n(Michelle Obama and the kids were there 3/24/10 which goes to tell you, you never know who you'll see at this historic pizza spot)", "author": "Matt E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-14", "description": "Grimaldi's was, like many restaurants I've encountered here in New York, smaller than I expected. But the size of the place (and the fact that the floor is way dirty) doesn't deter from the fact that it makes damned good pizza. We had a pie with mushrooms, onions, and Italian sausage. I wish they'd make the whole pizza a little more crunchy instead of leaving it just at the crust (which was burnt in some parts), but it was tasty and not all that greasy. It was kinda pricey, but that wasn't too bad. I say they should've made it harder because towards the end of the meal, the last remaining slices were being finished so that we didn't have to box them and carry them around with us and the slice I ate became cold and soggy. I mean, I guess that was expected, but it'd be nice if the pizza was a bit firmer.\n\nBonus of not having to wait too long for a table given the conditions outside. I've heard of the legendary lines that go around the block. The place was still packed even for dinner at 5:30. Impressive.", "author": "Henry T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-29", "description": "Decided to come today since there wasn't a long line like there usually is. My review is based solely on the fact that their ATM charges $4.50 to take out cash. That's strip club prices. No thanks. I'd rather go to Juliana's", "author": "Torrie R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-19", "description": "I don't get it. With hundreds of reviews saying this pizza is the greatest thing ever, clearly I'm in the minority.\n\nWe order this pizza at the office a lot. It's seen as a \"reward\" for a hard week's work. The other worker bees clamor for a place in line to grab a slice, and I groan inwardly as I join them (bad pizza or not, I'm not going to pass up free lunch).\n\nI'm from Chicago and I know that the Chicago/New York pizza rivalry is similar to that between Tupac and Biggie. Pizza pride runs deep.\n\nBut Grimaldi's is just bad. The crust is thin but not crispy. The cheese tastes like plastic (I peel it off as plastic is indigestible). The sauce is tasteless. It reminds me of the pizza they had in my dorm cafeteria in college. Yuck-o.\n\nI get that Grimaldi's is some kind of institution. Everyone else seems to think it's great. Caveat emptor.", "author": "Helena S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-24", "description": "I don't know what all the hype is on this place, it's just average pizza.\nYou select your own toppings, they don't have any special pizza's that they've created that'll blow your mind, you just pick your own toppings and order.\nNo appetizers, only a bowl of olives or something like that.\nI've experience way better.\n\nAlso one time I went and we walked into the store to get a table since there was no line outside and this old guy, maybe the owner?, literally shoved us out...like put his hand on my shoulder and pushed me and told us to wait outside.  We were out there like a minute and he brought us in....really?  Was that really neccessary??\n\nThey serve their sodas out of bottles, not even the full size bottles, they're a little shorter.  They're also not very good with their water refills.", "author": "Sheila C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}