{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-23", "description": "I've lived in NYC all my life, and it wasn't until I started working in DUMBO this past year that I tried this place. And meh... It's pizza that people from out of state will love because they are told it's the best, and haven't tried many others. A tourists' pizza. I wasn't impressed at all. It was bland and lacked flavor. Maybe if I didn't hear for years how amazing this pizza is, I would have rated it a little better but I was expecting a mouthgasm and...nope. Not even close.", "author": "Daniela A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-19", "description": "Take this with a grain of salt, because I am a borderline alcoholic that has never met a piece of pizza he didn't like (except at LaGuardia...but that's airport food).\n\nGrimaldi's was awesome, and I had no expectations going in. I knew that there was a famous pizza place near the Brooklyn Bridge but other than that I was flying blind. But when we got off the subway we gravitated towards it before we did the touristy trek across the bridge, and I'm glad we did. We waited about 20 minutes outside at around 4:00pm, which wasn't so bad, but I can see why people would get pissed about that.\n\nWe were crammed into a table in the front right corner, furthest from the action but also away from foot traffic so we didn't get bumped or anything. Four of us split a large pie with sausage, pepperoni and...something else, God knows what, and a bottle of red. The pizza was unreal and the wine was just enough to get us warm for the windy walk across the bridge. I probably wouldn't wait two hours for it, but we lucked out and I'm glad we did.", "author": "Adrian C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "Wow, there are some weak-ass one-star reviews for this place. Giving it 1 star because you live near it and don't want to have to walk through the crowd? C'mon... or giving it 1 star because of the fact that it's in Brooklyn and then saying \"See my review of another place\"? WEAK!\n\nBottom line: This place serves great pizza. \"It's just pizza!\" you say? Well, isn't that what we're reviewing here? A pizza joint? Yeah, I think we are. I'm pretty sure we are. Hold on, maybe I'm not so sure, let me check....\n\nOh yeah, we are. Definitely. It's definitely a pizza place. So if you went there for filet mignon, you're an idiot.\n\nBack to my review:\nI've been to Grimaldi's many times and it's consistently excellent. I've intentionally only visited when I knew I would not have to stand in line, so I assure you that my experiences were with a clear head.\n\nIt's a simple place and a simple pizza, but done to perfection. The staff take your order quickly, and you get served quickly. The crust has the right amount of crispy, slightly-burned edges. The sauce and cheese, the perfect compliment. Add a few basil leaves, and there you go: it's all you need. Of course, you could get a topping or two, and that would be fine. If you want a reasonably-priced Brooklyn Lager or glass of red wine, you can get either.\n\nSo if you want to take a nice stroll over the Brooklyn Bridge, swing by here for a meal. Come early, of course.\n\nIf you've been to Brooklyn to bitch and moan about it, don't come back. We don't want you here anyway.", "author": "Denis H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-27", "description": "***250th Review!***\n\nThere are days in our life that seem like any other day, but they are borne of events that end up making them extraordinary.  On Saturday I spent the entire day in Brooklyn and was exposed to every great thing about that borough.  I never appreciated all that I was missing until that day.  But one thing clearly stood out, Grimaldi's Pizza.  I am almost embarrassed to say it.  I mean, if I see a line of tourists, I immediately look for another place to go.  I am not even all that crazy about pizza -- I usually don't even eat the crust.  Everything about this place just seems wrong for me.  As a couple we would never make it.  My friends would whisper in my ear, telling me that this Grimaldi girl is bad news.  But I have to throw away everything I think I know about food, or at least pizza, because this is the best damn pizza I ever had in my life!  How do I know?  I ATE THE ENTIRE PIZZA BY MYSELF!!!\n\nYes, you read that correctly.  I am a fairly thin guy who is never yielded to gluttony.  And somehow, miraculously, I summoned a ravenous appetite that could not be assuaged.  On my pizza, I had the pepperoni and the garlic.  Sweet, spicy, delicious pepperoni.  Rustically cut, thick, and robust in flavor.  I slavered for this.  But then there was the garlic.   I do not recall ever seeing garlic as an option for a pizza, but it was a brilliant stroke.  Warm roasted fresh garlic made this pizza sing, \"That's Amore\"!  The marriage of such hedonistic tastes was further enhanced by the gentle call of that decadent marinara.  Like a siren leading me not into ruin, but into unabated temptation.  I was more than pleased.  Everything was just right about this pizza.  Even the crust.  The crust!  So light and puffy.  As I was just savoring this experience, they played \"New York, New York\" in the restaurant.  Indeed, I was just having one of those incredible New York days.\n\nNow I am in a terrible predicament.  I have found the best pizza in the world, but it will only see me in Brooklyn, and even then only after I wait an hour in line.  Like glimpsing David for the first time, you are awestruck, but you can never have it to yourself.  You must suffer for the great things in life.  So, only in an effort to make the lines a little bit smaller.  Stay away from this place.  The pizza is terrible here.  Leave me alone to eat all of it by myself!", "author": "Jim U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-07", "description": "I was in New York with a group of friends from Portland , OR. My boyfriend and I made the trip from Manhatten to Brookyn on the Subway, and it was really worth the trip for great pizza.\nWe got the an hour before they opened, and we had to wait . I really thought it was so nice of the owner to come outside and offer a chair to my boyfriend so he could sit. I really think that was a kind gesture and thoughtful.  Everyone was nice in the restaurant. \nMost importantly, the pizza was great. I am glad I had some great pizza before leaving New York.", "author": "Wes K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-05", "description": "Worth the wait, the price, the everything lol. We were tourists that had to have this pizza. We went the day after Christmas and there were no lines. There was a few ppl ahead of us and we were told to wait outside. It was extremely cold with rain and flurries and I had a baby in a stroller. The manager (I think he was) brought us in and took us upstairs out of the cold to wait. I was treated very nicely and the managers were extremely nice and conversed with us a lot. I didn't care that it took one hour to get our pizza because it was soooooooooooo gooooood. Cooked to perfection!!! The pizzas are well done so if u like that---you will love it. Just make sure you have cash!", "author": "Arezo T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-05", "description": "Good god, you thought to yourself. 439 other people have already written about Grimaldi's, what in God's green earth could you possibly add? Sweat starts to drip down your forehead. You start to get a lump in your throat and drink a glass of water. Your brain starts to go into hyper-drive. \n\nYou start to remember that you and T came on a very sunny, Monday afternoon. You both thank god that your friend's apartment, where T was staying, is only three blocks away. When you arrive at Grimaldi's, both of you are a little perplexed because there are only three people standing outside. This couldn't possibly be, could it? No line for Grimaldi's? No, there was no line. And within two minutes, you are already sitting at a table.\n\nYou recall ordering an extra cheese and mushroom pie. As you're looking around, seeing all the Frank Sinatra memorabilia, you start to wonder if maybe Grimaldi's is a front for the Mob. HA HA HA HA - of course it isn't (and if anyone from the Gambino family is reading, you have absolutely nothing against them. They are strictly businessmen). \n\nWhen the pie comes, you both start to eat a bit of the fresh basil. And then you both start eating the slices. And you both think to yourselves, \"yes, we believe that we have now found the best pizza in New York.\"  Even the tourists from California who are sitting next to you agree with you. You all laugh when the woman from California explains that she's originally from Brooklyn and that California wishes they had pizza as good as this. And you all laugh, at California's lack of good pizza. \n\nWalking out, stomachs about to burst, you and T just look at each other, in utter amazement that you both finished the pie. Yes, a walk across the Brooklyn Bridge was most needed right about then. \n\n\"Wait,\" T yelled out, \"isn't there a place called Jacques Torres around the corner?\" Intrigued, your eyebrow goes up, a la The Rock, because you know what The Jacques is cooking.", "author": "roderick A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-29", "description": "This is just one of those New York things you have to do.  Walking the Brooklyn Bridge, getting lost once you go over the bridge (or maybe that was just us?), and then waiting in line forever to get pizza.  It's kind of fun when you're in line with tourists and everyone is a Grimaldi's virgin, having no idea what to expect and just really hungry and excited to get inside.  JR, Christina, and I did this last summer - Christina with a busted knee hobbled across the bridge for pizza.  And she felt it was worth it, so that should be inspiring.\n\nBut go once and leave it at that.  \n\nGo knowing that it's going to be an \"event\" that's great to bring tourists along for.  They won't mind the crowds as much as you will, and they'll be so excited to try \"the best pizza.\"  Don't even try to make cute conversation with the waiter...because I think he kind of wanted to kill me when I asked about what he would recommend.  \"Lady, what do you want?  You guys ready yet?\"  Well, now that I'm officially scared, okay...sinks into the seat.\n\nThe pizza was delicious.  Coal fired...thin, amazing.  Charred crust isn't always the tastiest, though.  And if you want my honest opinion? Better quality of coal fired pizza and same idea at Luzzos or Una Pizza in the East Village.  Grimaldi's is delicious, but come prepared for the experience most of all.  It left our dude saying \"What's with all the hype?  Luzzo's is better.'", "author": "Nic B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-17", "description": "Not that this place needs another positive review, but it was the best pizza I had in NY. Simply, AMAZING.", "author": "Mar S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-20", "description": "This will be short and simple.\n\nThe long wait for a table is totally worth it. Grimaldi's knows what pizza is all about.", "author": "Nico A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-21", "description": "Oh Mah Gawd. \nYesssssssss!\nMMMMMMMMM.\nOoOoOoO YES.\n\nit's like i had an orgasm in my mouf. \nit was a hot \u0026 humid night... but miraculously, the wind started to blow harder and cooled things down. my partners in crime decide on a whim to walk over to the Brooklyn Bridge and feast on this pizza we've heard so much about. we were able to get seats immediately. it was crowded, but no crazy line because it was near closing time. \n\ni'm usually not a fan of thin pizza- mind you, i've grown up in the 'burbs eating Domino's, Round Table, Godfather's and Pizza Hut. i like it heavy and with a lot of dough involved. not in this case, my friends... not in this case. \n\nwe ordered a standard peperoni and sausage pizza w/ fresh mozzarella. the red checkered table cloth was making my head spin- but the decadent smell wafting from the ovens put me in a better mood. as soon as the pie came... all of our Asian eyes (Maria M. included! heheh) opened up wide and drool became to form in our mouths. we went to town on the pie and with sighs of orgasms and pleasure was coming from our table. the other patrons would sneak a look at us to see if we'd lit a cigarette or something (the cig after sex thing). \n\nthe combination of the sauce, crust and overall quality of the ingredients impressed me undoubtedly. i'm no pizza aficionado, but that was the best pizza i've ever had. \n\ntourist trap or not... this is a MUST if you live and/or visit NY. walk over the Brooklyn Bridge, stop at Grimaldi's and take some amazing photos of Manhattan and the Bridge after wards. it's an astronomical experience. i have been living here all these years and never once checked it out. i'm happy i finally had the chance to with my best friends Julie K. \u0026 Maria M.", "author": "Joolie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-28", "description": "This place is awesome.  The pizza is amazing and tasteful.  I was lucky since this place wasn't too packed and I was seated within 10 mins. The service was great and this place is worth the visit.  My friends and I ordered 2 pizzas, which were huge and we left stuffed! Overall a good experience, but in my personal opinion Lombardi's is better!  I'll let you be the judge of that.....", "author": "Andy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-28", "description": "nah, fuck it. im giving it 3 stars. I love pizza as much as anyone. I understand artisan ways, Brooklyn and NYC styles, the best fresh ingredients, coal burned ovens, and Grimaldis - and I am not convinced.\n\nIf you are used to Sbarros, Marios, or other mall pizza, you may have found the greatest pizza on earth. But if you are constantly exploring and searching for the actual greatest pizza on earth, if you are willing to travel to other countries to try that elusive slice, then I am sure you can find better. Find better.\n\nI prefer to keep tourists confined to limited spaces, so if you are visiting with a fanny pack, I strongly encourage you to continue visiting the statue of liberty, the MoMA, Times Square, see a Broadway show, and also to wait in line at Grimaldi's.", "author": "Jeff O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-02", "description": "I want to give them 5 stars, but it's not like their pizza is the best in the world. Its good. But I think going here is more about the experience and that makes it worthwhile. I would say their service is friendly and efficient too.", "author": "Laurie S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-01", "description": "Please everyone, stop going to Grimaldi's.  Seriously, stop it.  It's pizza.  \n\nI'd like to be able to get to my apartment without navigating a sea of crazy people clogging the sidewalk and blocking my front door.  Crazy because they're willing to wait 2 hrs in line for pizza!  And I think if we're being honest here, only decent pizza at that.  Fresh ingredients and thin crust, yes, but still... just pizza.  Why then, you're asking yourself, do so many people think it's the greatest thing on earth?   Here's why--because they've been waiting in line for 2 hrs and they're STARVING!!", "author": "Becca S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-09", "description": "At least once a week, somewhere between my apartment and the Promenade, a tourist stops me to ask for directions to That Famous Pizza Place. \"Just down the street, make a left at the corner,\" I tell them, stifling the urge to continue \"...and onto the A train, straight to West 4th in Manhattan, which brings you right to Joe's Pizza.\"\n\nLook, I know that it's one of those places you HAVE to try, just because of the hype. But the fact is, Grimaldi's just isn't all that. The owner and waiters are absolutely wretched (but hey, you're not there for the service) and there's nothing special about the decor (but hey, you're not here for the atmosphere). The real issue is that the pizza, which you're waiting on line for 45 minutes to try, is mediocre. You'll see that soon enough. And while you're waiting for your average pie, you can watch the tour buses go by with scorn, congratulating yourself on not being THAT guy...", "author": "Michele W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-01", "description": "Having a pizza at this institution is great excuse for walking over the brooklyn bridge.  We were lucky to get a table straight away. It was a cold day at around midday but the place was already pumping.\n\nWe had a half pepperoni and half Italian sausage small pizza. The small was massive and is easily enough for two people.  They played old sinatra classics as we munched down on this superb pizza. \n\nService was quick. By the time we left there was a line of people on the sidewalk waiting to get in.  This is perfect pizza with fresh ingredients and a great base - so it's well worth a wait in the cold.", "author": "Craig D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-25", "description": "This was my second visit to Grimaldi's under the Brooklyn Bridge, and it was just as good the second time around.  The wait was longer this visit, even though they have recently relocated to a larger space.  This pizza is so great because of that crust.  Thin, tasty, slightly charred on the bottom, but so chewy.  Toppings were fresh and good.  My only disappointment was that they don't include jalapenos as a topping, and they don't sell beer by the pitcher.  Oh, and they only take cash.", "author": "Liz G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-24", "description": "I used to love Grimaldis.  My family would go there often.  Sadly, since they have moved to their new larger space they have gone down hill.  The pizza is now served cold after a very long wait by a rude and uncaring waitstaff.  We complained to the owner on the way out and he shrugged us off.  When we were done complaining someone else was complaining about rudeness from their waiter and he could not be bothered to listen to her either.  As we walked out we realized that there was a whole block of tourists outside waiting for a table, so I guess he figured he didnt have to pay attention to us because there were so many other customers waiting.  I would not recommend them or return because I dont want to be a customer in an establishment where people dont value my business.  I will not pay for subpar food or service.", "author": "Pamela B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-17", "description": "Grimaldi's ruined my sex life. \n\nI waited for about twenty minutes outside, was seated in the window and feasted on a garlic, mushroom and fresh basil pie.  My only complaint was the kitchen was nuts on the garlic and every bite was crunching with chopped pieces that clung to my teeth.  Delicious, but now my boyfriend won't kiss me.\n\nI don't care, Grimaldi's is just that good.", "author": "Lindsay K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}