{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-06", "description": "The pizza is as good as everyone says and is worth the trip over the bridge... and the line outside!!! The owner still graciously greets guests. I am already looking forward to my next pie.", "author": "Ava B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-17", "description": "Grimaldi's is fine! I liked it! \n\nAll in all, I felt that I couldn't judge much from my experience. It's taken me years to actually go, as I always assumed it was a multi-hour wait, but I went in for dinner on a Wednesday night and there were plenty of tables open. I got a sausage and mushroom pie - a small is definitely enough for 2 people. \n\nThe part I loved the most was the cheese. There is no substitute for high-quality mozzarella. Beyond that, I found it to be more or less in the above-average category of pizza, not quite in the elite category that I'd expected by the hype. I will say that the underside of the pizza got soggy fairly quickly, so my slices after the first were somewhat floppy and cold. This can happen to the best of pizzas, though I felt it happened faster here than other places. The price is moderate which is great, and since I didn't have to wait at all I felt the overall experience was well worth it. Not sure that I'd make it a frequent stop - I wouldn't say I was wowed, but I wouldn't say it was massively overrated either, and now having had it, I would not invest the time if there was more than a 15 minute line.", "author": "Luke Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-07", "description": "Having taken friends and family out for \"NY Pizza\" for years, this place is one of the best, and it has a great location for that extra New York-iness. The new location is much larger so the line moves faster, making the experience a bit better - if you dislike lines, and I hate lines and refuse to wait in them unless I have to take friends out for a visit.\n\nBut wait, I'm getting ahead of myself. For starters, if you're looking for Pizza, Grimaldi's is one of the best in any of the 5 boroughs. It's a slice of Brooklyn, or a slice of NY, whatever you wanna call it... except it's not really a slice because you can only get a whole pie at a time, and that's good because you'll finish it.\n\nStop by and enjoy, because it's NY friggen' pizza the way it was meant to be, this is the only place you out-of-towners should be going.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "There's a reason you hear about his place. Thin crust pizza that has the right amount of white sauce and cheese, cooked so it only appears a little burnt on the surface but is actually just deceivingly perfect.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-16", "description": "I was told by a very trusted friend that this is THE place for pizza in New York and a must visit for my first time in the Big Apple. It seems I was very fortunate to have missed the long lines others have reviewed about as the place was only about half full when I arrived so grabbing a seat at the bar was super easy. They did fill up during the time I was there which was mid afternoon and it seemed like mostly people from out of town so yeah, definitely glad I stopped in when I did.\n\nThis place is about as close to what I was expecting a New York pizza place to be with ambiance, history, and character for days. The staff was mostly on top of things although not 100% attentive at all times. I could have used one more water refill but no big deal.\n\nFor my late lunch, I ordered a small pizza with pepperoni and sausage and I am glad to have come in very hungry because the pie was very big. Even the couple next to me, who also ordered a small, struggled to finish theirs. I did my best but unfortunately had to leave it unfinished for fear of gorging myself into oblivion although I suppose that would have been a nice way to go because the pizza was just that good. Seriously, this must be what people are talking about when they say you can't get the same New York pizza anywhere else. The other places I visited during my trip were pretty standard slices that you might find anywhere but Grimaldi's is definitely in a class all its own.", "author": "Marc M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-20", "description": "Yes, the pizza is delicious (and priced well), but do yourself a favor and get TAKE-OUT. This is a glorified cafeteria. My rating is mostly due to the service and ambiance versus the actual quality of the pizza.\n\nEvery time I eat here, I remember why I shouldn't bother. I go about once a year, so my memory betrays me until I sit down and am full of regret. This place is really strange, like it may be a clandestine operation masked by a hopping pizza joint. \n\nThe service is awful. There's usually a ton of staff (probably family) either running around or congregating by the front door with a \"can't be bothered\" attitude. There is no attention to detail, so you're sitting with paper plates, plastic utensils and if you get a drink it's in a plastic bottle, no fountain, in your cheap little dixie cups. Last time we went the manager was really rude to me and we had about three different waiters \"helping\" us, but really ignoring us. Also, I always forget-- there is NO liquor license. Nor will there ever be. And, CASH only. \n\nEither get take-out or go next door to Juliana Grimaldi's if you want to be treated with some decency.", "author": "Stephanie F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-10", "description": "The service is beyond terrible!! Been waiting for 20mins after we got seated. No one came to take our order and not even our drink order. Kid you not, we got up and just left. Saw there was a line forming outside the restaurant and I had to warn them. Very unprofessional. To top it all off, even a bus boy asked if anything was wrong and we told him we were waiting for a waiter. This place doesn't deserve any star ratings at all!!", "author": "Mark E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-14", "description": "If you don't mind waiting in line for a while, Grimaldi's is a great place for good pizza. I won't say I was mind blown but it's very decent pizza. I ordered a large pizza with added mushrooms, onions, olives, basil and sun-dried tomatoes. The olives and tomatoes were a bit overpowering and gave it too much of a tangy taste so I ended up removing them which was a wasted $4-5. I also asked for extra fresh basil. Fresh basil gives pizza a much fresher Italian like taste then baked basil in ny opinion. It taste best when it's fresh out the oven as the mozzarella starts to thicken up.", "author": "Bahiyyah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "This was a last minute decision and we loved it. the large regular pizza was perfect the crust was on the thinner side and the mozzarella  was fresh. Another pepperoni pizza had great tasting pepperoni (not large and oily like so often).  Despite a line outside we were not rushed in any way. Wait staff was pleasant and helpful. Definitely recommend", "author": "Kathleen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-11", "description": "My friend Richie took me to this place.  \n\nWhat a real treat.  Pizza made with a great crust, fresh ingredients and cooked on a Coal-fired pizza oven.  What a great pizza!  \nAnd, if you have room, try the cannoli.  Heavenly\n\nIt's worth the wait but bring cash; the only plastic allowed at this place is the utensils.", "author": "Steve F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "A M A Z I N G pizza! \nBy far the best pizza I had while in New York! WHAT A GEM of a restaurant!\nIt has a second floor for seating. \nBefore leaving NY to make my way home I wanted to make sure I came here for my last meal! I got an original pepperoni pizza and a hot chocolate I know weird combination but I needed it for that weather. \nThe pizza did not take long at all, the server was very friendly. \nThis place is a must if you want New York style pizza. \nI came in on a Tuesday evening and I didn't have to wait at all.", "author": "Paulina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-29", "description": "I've tried a few different pizza places in the city but I always find myself coming back to Grimaldi's. Usually in the evening and weekends there is a huge line outside (wait time around 30-40mins) but if you go during the day they'll sit you down right away. I always get a Large Pizza and like to experiment with different toppings. Surprisingly the pizzas are pretty affordable (in comparison to Lombardis $40+ for a large). If you're wanting to try something else the calzones are delicious, however I will warn you that they are HUGE, it can definitely feed 2 maybe even 3 people.", "author": "Wendoline V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "When going to NY we drive up the Garden State Parkway and get off exit 131 if your going north.  Go to Metro Park.  If you go on weekends parking is really inexpensive and the train station is right there.  Trains run into NYC about every 20-30 min. Never been crowded (ON WEEKENDS) but I would check for special events like the time Philadelphia Phillies were playing in NY and the train was full of phillies fans.  Good natured and part of the adventure.  Assume busy any other sporting events like Eagles and Giants.  \n\nTakes about 20 minutes to get into NY from the station.  Drops you off in NYC Penn Station.  Easy to get around from there.  So what does all this have to do with Grimaldi's?   Well waiting for the train we talked to a young couple familiar with NYC and they said they were going for the pizza.  OK I like Pizza so I made a note of it.\n\nEnjoyed our morning in NYC and decided to walk the Brooklyn Bridge and guess who happens to be within walking distance of the Brooklyn side of the Bridge.  Yep Grimaldi's.  Had heard about the long lines for lunch, but we were just early enough to have less than a 5 minute wait.\n\nI'm not going to call this place a tourist trap, but it wa my first impression.  Long tables pushed very close together.  Waitresses who were pros and moving table in and out like I remember in the chow hall during basic training.  Ordered our pizza and drinks and they were very efficient in serving the pie along with a stack of paper plates.  If you don't have everything, cheese, salt, pepper, oregano, garlic salt or any other topping and she gets away you might as well kiss it goodbye.  Look, the pizza is very good, and I'll give it big plus for not being a rip-off on quality or... pricing, and I'll give it another plus for being part of the experience of New York.  There are a lot of downsides if you want to get picky, but the main ones are atmosphere and having people so close together.  Waiting in long lines for anything is not something I will do, however if you into lines you will have more of the Grimaldi's experience that I did.  Hope you enjoy.\n\nIt gets a higher rating from me because of it's history and being the \"place to go\" for pizza.  I'd give it another shot if we ever walk the Bridge again and get there early enough to beat the lines.  When we finished we were greeted by a very long line of people waiting as we exited the restaurant.", "author": "Rick W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-06", "description": "Pizza is brick oven style and extremely tasty.    Tasted especially good after walking over the Brooklyn Bridge... With that aside, no beer or wine is available, plates / silverware is plastic (disposable style), service is brusque (I was bumped into by various waiters several times), pizza only (no salad or other dishes) and they only accept cash.\n\nGood for what it is - brick oven pizza only... especially good if you're hungry.", "author": "Paul M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-28", "description": "Terrible customer service from start to finish. Rude hostess calling us idiots at the door. The waiters blatantly ignore customers and don't offer refills. 20% automatic gratuity tip for horrible customer service. Be sure to carry cash because they don't accept cards. The food was mediocre at best", "author": "John M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-02", "description": "I've been here about four or five times in the past four years.  Three years ago I would have said this place is excellent.  Their pizza, white and red, was top notch and the toppings were classic added great flavor.  However, I do not know what happened the last time I went.  It was undercooked, doughy, and relatively flavorless.  Was really a meh experience.\n\nSecondly, they got a B on their health score from the city.  Seriously?  If the local bodega can get an A, any serious restaurant should.", "author": "Sam A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-28", "description": "The pizza is pretty good, but everything else about this place just doesn't live up to the original location. Frank is a really nice guy but his system of how people are seated is extremely outdated and dishonest people can easily cut the line and he doesn't seem to mind. Also, no real appetizers and the liquor license is pending. Hurts the overall dining experience. Really wish this place would Embrace technology and come up with a better queue system than Frank calling whoever he recalls being there first from the large room on the third floor. I would highly recommend that they invest in a dumbwaiter and turn the third floor into additional seating space.", "author": "Mark D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "Nice pizza, crust, sauce and cheese. Thin crust and well done. We ordered ours with italian sausage.  Good size and portion for the price. We went after 1:30pm, so there was no line.\n\nNote it's cash only, so credit card users beware!", "author": "J S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-07", "description": "Located just at the end of the Brooklyn Bridge, this was perfect after a stroll across the bridge.  We came here at about 7pm (dinner time) and the wait was over an hour.  We decided to order a pizza to-go while we waited in line for Juliana's.  The pizza was ready in less than 20 minutes and we scarfed this down in less than 10. \n\nThis was the most memorable pizza I had while visiting New York.  I tried both Grimaldi's and Juliana's (next door) but what here's what stood out to me for GRIMALDI's:\n\n+  Thin, but chewy/soft pizza dough\n+  Fresh tasting tomato sauce, and the perfect ratio to cheese and crust\n+  Fresh and delicious pieces of chopped garlic\n\nThe ratio of all the ingredients were perfect!  We ordered a tomato sauce, sausage, and garlic pizza and I could immediately say that this is one of the best pizzas I've ever had!  \n\nSo yeah... the HYPE is REAL!", "author": "Stacey K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-23", "description": "This place was worth the wait. We were seated upstairs and loved how you can see them make the pizza downstairs in front of your eyes. I like how their menu doesn't have a variety of items and they only serve pizza and calzones. Our waiter was super friendly and the staff showed that they wanted you to leave their building with satisfaction. Great food, great service.", "author": "Arlene I."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}