{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-26", "description": "The new location is doing a disservice to the pizza pilgrims. When they cross that bridge give them an authentic experience!  The pie is pretty good, but I feel like Im at the Coolest teen center in Downtown Birmingham, not Brooklyn. \n\nThe place, the spot, the smell the sounds? Cmon guys- the crooning of R Kelly and the sweet melodies of Hermanita's Aventura makes me coo indeed, just not while im eating pizza, please (even if its upstairs in an industrial mezzanine).\n\nAND there is nothing left in here that feels Italian.", "author": "Andrzrej K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-04", "description": "I have heard so much about this place, i finally decided to try it out. I liked it, but the flavors didn't really stand out. They put cheese on before the sauce and the cheese is sparing. So some bites had cheese (cheese bread) and some bites had sauce only. I prefer my pizza to taste all flavors in every bite. I might go here again, but won't go out of my way to recommend it", "author": "Johnny V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-14", "description": "The pizza is very good. The building is attractive. The line is absolutely outrageous. We got there maybe 30 minutes before they opened and the line was two blocks long! When they did open the doors, we almost made it in, but were the 2nd group when they closed the doors once the restaurant had filled. So incredibly tragic!! It was hot (there's no shade when you are that close to the door) and I was so hungry. They eventually offered bar seats instead of a table which we, of course, took. \n\nThe pizza was delicious (4 stars), but was it worth the line?? 3 stars for the experience, but it's not one I would wish to repeat.", "author": "Caitlin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-03", "description": "The pizza was amazing. Being a native New Yorker, I think this is the best pizza spot in BK. \n\nThe service on the other hand was shitty. Rude servers.\n\nEither way, I would still recommend going here. I don't think it's a \"tourist trap\" - it's genuinely amazing pizza.", "author": "R H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-29", "description": "After touring the Statue of Liberty on the Staten Island Ferry. My boyfriend and I accepted a quest to find the infamous Grimladi's. It took us probably an hour to get there through subway, and walking. But it was WELL WORTH IT. \n\nLuckily, we got there around 5PM, and there was not a wait. When we left around 6PM, there was a line wrapped around the building. \n\nThe pizza is indescribably delicious. It cannot be put into words, just do yourself a favor and just experience the authenticity of this place. It's not the best pizza in the world, but it's good to the point where you are left completely satisfied.\n\nVery attentive staff, the owner always walks around eying the place to make sure everything is in order. And you can see them make the pizza. You really can't go wrong here. \n\nGo early, or else you'll have to wait a long time. \n\nDon't think, just do.", "author": "Angel N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-15", "description": "Ahhh! The epic battle over which NY pizza is best -- and the winner is: Grimaldi's! Hands down each and every time. BAMMM! Just like that.\n\nHate lines? order to go....\n\nCome here for the experience of it all and enjoy it; breathe it in. What's the rush anyway? \n\nI have been here winter, spring, summer, and fall. I have waited for a long time, I have not waited at all, and I have been here at that awkward time when the stoves have to be reset or whatever the hell it is they do to it. It's empty and you get seated right away during that weird time but since the ovens get shut off to be reset you can't get any food. I guess it's better to be seated and waiting sipping on some vino than to be out there on line. \n\nI order the pepperoni with the fresh basil. I can eat an entire pie by myself and most of the time I do, only here. It's just good. The crust is great, the pepperoni is great, the fresh basil is great, and the pizza in it's entirety is simply unmatched. \n\nYou may find good pizza elsewhere with a hell of a lot less wait times, but never better than this. NEVER. \n\nP.S. place is cash only and the only ATM in the area never works. BRING CASH.", "author": "Cyrus P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-14", "description": "I went to check out Grimaldi's in Dumbo for the first time. When I went in I asked for 3 slices , they said no slices. So what did I do Yea!  I ordered A Pie. It was awesome. I was able to woof down 7 of the 8 slices. Next time ill be smart and order a 7 slice pie so I don't waste any haha.!  Grimaldi's rocks. I absolutely recommend this place. Warning, cash only!", "author": "Andrew G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "Grimaldi's pizzeria is the best pizza I had ever had. The ingredients were fresh, the dough was just different. I have never eaten pizza like this ever before. Amazing. The service wasn't all that great but the pizza made up for the waiter with the crappy attitude. I highly recommend this place.", "author": "Sara M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-12", "description": "So apparently this was the place to go for pizza.  I mean, I'm in New York City... Ever since the first Ninja Turtles movie, New York City has made pizza famous and as been famous for it's pizza pies.  It's a shame I couldn't try more pizza places, but I guess I have to try one of the best there is in the city.\n\nGrimaldi's is located directly under the Brooklyn Bridge.  it's actually kinda cool because it has a pretty nice view of it from the front of the restaurant.  And since there's always a line in front, you'll sure have an opportunity to look at the bridge while you wait.  I went at around 8:30 PM and the line was about 10 people deep.  However, the \"door person\" (seriously, he was dressed up like the Don from godfather) asked for anyone with a party of 3/4 so we got to skip the line.  \n\nGuess this is a tip for anyone that wants to get in a little quicker.  They have communal seating in the middle of the restaurant (kinda like german abbey style), but on the sides they have tables of 4.  Guess this is why they want to fill those up first.\n\nLooking at the menu, it's drop dead simple.  Pizza, with what toppings... that's it.  The pizzas are hand made in a brick coal burning oven in the back with multiple people making the pizzas.  I also noticed that there isn't a single woman that worked there... interesting... \n\nWe ordered a pizza with italian sausage, sweet peppers, and garlic.  It came out in about 5 minutes after we ordered it.  The pizza was about 1/3 of the size of the table.  The crust was thin all around, and topped nicely.  The pizza didn't really hold it's pie shape when you ate it though, it was really soft in the middle (not sure if it was supposed to be like that) but eating the pizza with a knife and fork was definately a necessity (unless you really want to wear the pizza).  \n\nThe pizza was definately the best I've had in a while.  I'd even go as far to say that it was one of the best pizzas I've ever had.  If you're in New York, you definately have to come to Grimaldi's and have the \"Don\" makea you a pizza you can't refuse.\n\nBTW, I had dominos the day after having this pizza at work in toronto... BRUTAL!", "author": "Joe H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-01", "description": "GREAT TASTING PIZZA. FAIRLY PRICED. WOULD EAT AGAIN.\n\nThis pizza does live up to its reputation. I was really surprised that it was only $14 for a large pie considering this is hailed to be the best. Extra toppings are 3 bucks extra. The tomato sauce was fantastic and the cheese was put on in a very old fashioned way. It wasn't covering the whole pizza so you'd have spots where it was just tomato sauce but it honestly was a perfect cheese/sauce ratio. My only complaint is the crust. Although it was tasty it was a bit tough. I had to put in a good amount of elbow grease to cleanly cut pieces to eat, and their knives are serrated. I asked for a coke to be brought out with the pizza, our server, who looked like a very tall stoner did not remember to bring it. Not great service but who cares it's pizza. Tip is included on the bill! This should avoid head scratching for those of you who like to check charges.", "author": "Jack P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-07", "description": "The legendary pizza was amazing, a must stop for tourists or locals, I would go back in a heart beat. 4 stars instead of 5 because the service was mediocre.", "author": "Rileigh N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-13", "description": "Definitely an experience.  After you have made the trek across the bridge from Manhattan you can expect to wait in a line outside the place for up to an hour.  Is it that good?  Yeah, it is pretty damn good.  The simplicity of their toppings and the perfect crispiness of the sauce are spot on in my opinion.\n\nThe freshness of the ingredients and the way the pizzas are prepared are worth the wait - at least once.  I would suggest ordering the smallest number of toppings possible to enjoy what makes their pizza great - the crust and sauce.  Sausage and Fresh Mozz is my favorite.  Once you get it in it is a loud mad house of servers, pizzas flying from table to table and watching the back of the house do its magic.\n\nYou may get lucky and get a table, or have to eat cafeteria style with others, elbow to elbow .  The smaller your party the faster you'll get in so plan ahead.  I work really hard to avoid the \"tourist traps\" when I travel, but it is worth the wait and crowds - at least once.  \n\nWould highly recommend trying to find an \"off peak\" time to go down there.  You'll enjoy the experience a lot more.  Waiting 1.5-2.0 hrs for a pizza is crazy and you will not doubt remember that first about your visit.  If you go at 2pm in the afternoon or 8pm at night the waits will be significantly less (30-45 min).  And if you don't show up with a big group you'll be pulled up with to the front of the line faster to fill holes.", "author": "Mark G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-17", "description": "Finally the line was short enough for me to try Grimaldi's. Not worth the hype, there is waaay better pizza in Brooklyn. The service was super slow, the restaurant wasn't too inviting and not particularly clean, and the paper plates were a turnoff", "author": "Lama B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-20", "description": "My friends and I ordered two large pizzas (one pepperoni, one cheese) to share. I tried one of each, and thought the pepperoni was definitely better than the just plain cheese. With that said, I don't know what's the huge hype about this place. Yes, it was very good, but it definitely wasn't the best pizza I've had in the city.", "author": "Lesley C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-27", "description": "Wanted to go to Spumoni Gardens for pizza, but discovered it was kind of far from our other Brooklyn activities, so we decided to try Grimaldi's since it was also on our list.  Got there around 3, and I figured the line wouldn't be super bad because it was an off time, but not so much, we probably waited about an hour. \n\nUpon entering, we were blasted with cold air, and I agree with others that it makes the food get too cold, really fast.  We just went with the cheese pizza in order to try the classic.  I was really impressed with the quality of the cheese, it had a lot of flavor.  I did think there was a lack of basil though, and parts of the crust were a little too burnt.  \n\nI don't know if I would wait in that line again, but I'm glad I tried it.", "author": "Christine B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-29", "description": "Is it worth the wait?  I don't think so.  So much better, yes its under the Brooklyn bridge and all but so is the Calexico Taco truck -- save your time and go to \"Its NOT Rays\" much better.\n\nSorry but true.", "author": "G R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-05", "description": "Delicious and authentic. Had the white pizza and pizza with sausage- both were great!!! They exceeded my expectations about the hype. The pizza with sausage was great for what it was, but no exciting flavors. Don't get me wrong- it was done very well and I'd eat 3 pies of it for dinner if I could, but nothing unique. \n\nThe white pizza was the star for me. I am not a fan of pizza without red sauce, but this made me a believer!!! I never liked white pizza before coming to this place, but it seriously changed my life for the 10 minutes I was eating it. There's some sort of garlic oil or something they put under the ricotta because I was in heaven. The ricotta was creamy and the little bit of basil made everything taste fresh. Give it a shot! I'm glad I did!", "author": "Rachel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-09", "description": "Grimaldi's was great, but I would definitely check out other pizzerias first before coming back here and braving the line.  We arrived around 11:15, and were seated around 11:45 (after a large bus full of tourists came in at 11:30a and got seated before us all waiting in line!!).  Maybe we should've grabbed a small snack to eat first though, as we were ravenous the 15 mins it took for our pizza to arrive after ordering.\n\nWe got a half white pizza and half red sauce pizza with sausage.  And boy was it gooooddd--thin crust, nice and crunchy, non-greasy, and chewy.  The amount of sauce the added on was perfect and I loved how the mozzarella was full slices.  The pizza was still good 3 hours later when I ate my leftovers.  My only complaint is that the pizza is a TAD bit chewy for my taste...when it started getting cold my jaw hurt eating it.", "author": "Kathleen V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-23", "description": "Despite a change in ownership and a new location (just down the block from the original), Grimaldi's continues to deliver a pretty solid pie. Their biggest problem is that Patsy Grimaldi (the original owner) has set up shop in the original Grimaldi's location next door and is delivering a better product in a more welcoming atmosphere.\n\nBut, let's not dwell too long on the competitor next door. Instead, if you feel you must go to Grimaldi's, you aren't likely to be disappointed. This place still turns out a more than respectable pizza. The biggest problem with Grimaldi's continues to be the line. There's some variance in length of wait but if you go at a prime time on a warm day, you should easily expect to stand outside for an hour or more. In my book, there simply doesn't exist a pizza that's worth this wait but clearly there are plenty of people that disagree with that sentiment.\n\nOnce you do make it into Grimaldi's, you should expect a high volume, no frills experience. These guys have a boatload of people coming through the doors every day so the goal is to move bodies in and out and the service reflects that. It's not that the service is bad, but don't expect any sort of personal touch, it's all very matter-of-fact and, given the crowds, that's probably the right approach.\n\nOverall, Grimaldi's is probably a 4 star place if it weren't for their neighbor. But, given the close proximity of these two joints, the comparison is inevitable and Juliana's just wins out on quality and overall experience for me.", "author": "John H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "Made from fresh ingredients, it's one of the best pizzas I have ever eaten! The crust, cheese, basil, everything was perfect. A must visit if you are in the area.", "author": "Annshu S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}