{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-10", "description": "Went there last night with a few friends from California who wanted to try some famous Brooklyn pizza. Originally they wanted to go to Di Fara's, but it is closed on Monday so we went to Grimaldi's as a consolation prize. Pizza was served in a timely manner. We ordered a pepperoni, onion and mushroom pizza with extra crushed tomatoes. It was decent, but nothing notable from the local pizzerias near Cobble Hill. Thankfully, there was no line last night which make it much better!", "author": "Chris H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-23", "description": "I went on Thursday night so the wait wasn't bad, got seated in maybe 10-15 minutes. The pizza is good, the wine is cheap, it's really close to excellent views so you can take a nice stroll to work off all the wine and carbs. It's extremely tight quarters so be prepared to get friendly with your neighbors. The wait staff is there to get things done, not wait on you hand and foot. The food comes out fast and everything was fresh and tasty. Not the best pizza I've ever had but i'm feeling generous so I'll round up to a 4.", "author": "Jan K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-08", "description": "PIZZA IS AMAZNG.  With that said, the service and line sucked.  They basically know people will wait, so they can care less if they treat you well.  Yes, there probably will be an hour wait if you go during lunch or dinner time... we waited an hour during Sunday lunch.  This is place you would only go once and never go back because there are other pizza places just as good through the city.  For some odd reason, if you want something TOGO, they make you wait in the same line as everyone else... which makes no sense and they should fire the idiot who thought of that.", "author": "John A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-05", "description": "the line that forms here is no joke. we got here 30 minutes before opening and there already was a line. nestled right next to the brooklyn bridge and a famous homemade ice cream place... this place is definitely a tourist trap. but who cares!... the pizza here is freakin' good. \n\nthey don't serve by the slice but by the pie. we ordered one with pepperoni, sausage, and onions... and the other just plain. i thoroughly enjoyed the pepperoni, sausage and onions pie. the mozzarella was fresh... crust was perfect... and toppings were delicious. as for the plain... it was good but not great. \n\ni am totally craving pizza right now.", "author": "John L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-29", "description": "I was skeptical about waiting in line 45 minutes for pizza, but wow the pizza is really good.  The restaurant is a crowded, but the pizza is worth it!", "author": "Vicki S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-10", "description": "It is great pizza, but I don't know if it is worth waking up early on a Saturday or Sunday and taking the subway from Manhattan to wait in line (in the snow/cold if it's winter) to finally sit down at a table so close to your neighbor, you might as well sit on his/her lap.  If you live in Manhattan and want pizza, I recommend Patsy's on the upper east side or Lombardi's.  If you live in Brooklyn, then it is a definite go-to.", "author": "Marla L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-24", "description": "best pizza i've had ever! and u get a beautiful view on the nyc skyline!\n\ni can't seem to eat pizza in cali because it's just not the same as eating a slice of pie over in nyc! tho i did find a hidden gem in cali BUT it will never compare to eating a pie here! that's for sure!", "author": "Rachele B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-05", "description": "The pizza is like a big round flat piece of crack. Yummy, addicting, and perfectly cooked. I had 6 or 7 slices, which was borderline overdose...but well worth it. I walked out feeling like i was carrying triplets in my tummy.", "author": "drew s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-25", "description": "Flat out best pizza you will ever have!!  Expect to wait in line and be happy you did after you bite into the first slice. Reasonably priced as well.  Advice: less toppings = better pizza.  The crust and cheese are so good you don't need mush else, we ordered pepperoni and cheese; it was perfect.", "author": "Jason P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-30", "description": "Didn't have to wait too long since we went before the lunch crowd. The pizza was delicious that I wouldn't mind waiting in line for 2 hours for it. The crust wad good. The pizza had the right amount of ingredients. Not too saucy, greasy, or salty. Seems like everyone walked the Brooklyn Bridge before they ate. I had to walk it after and that was kinda of hell since the humidity was bad.", "author": "Evelyn L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-22", "description": "Meh, it's good but there are definitely better places in NYC (John's, Motorino, South Brooklyn, Lombardi's, Via Tribunali to name a few). Worth a visit though if you're in the area, both times I've been I've called ahead to order take-out then picked it up and eaten by the river in the nice new park there. Don't think it's worth the wait to eat in.", "author": "Adam W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-27", "description": "This is pretty much the best pizza I've had outside New Haven, CT (and you'd be hard pressed to find a better pizza place than NH's Frank Pepe Pizzeria in ITALY). You may be asking yourself, \"How do they do it?\" Well I would like to announce that I have once and for all unlocked the secret to awesome pizza such as that found at Grimaldi's. The first trick is to get good ingredients (bread, cheese, sauce, toppings, etc). The second trick is to get an oven that's hotter than two rats f*\u0026!ing in a wool sock in Cairo. I am told that Grimaldi's keeps theirs at 700-800 degrees (legal disclaimer: the author of this review is not legally liable if that figure or any other presented herein turns out to be inaccurate). You just can't make a good pizza in a 350 degree oven. Get that weak stuff out of here, I've been in saunas hotter than that. Also, you may want to throw in some extras such as olive oil or basil. That's it, and BINGO, you've got a killer pizza. \n\nNow I'm not saying you can duplicate Grimaldi's with those tricks, but you should at least be able to set up a respectable joint that scores a 22-23 in the Zagat survey (compared to 26 for Grimaldi's and 27 for Frank Pepe's). But here's the problem that prevents Grimaldi's from achieving that coveted 5-star rating from the esteemed author of this review: the line is outrageous. I'm talking a 30 minute wait at 3:30pm. Nobody eats at 3:30 (But then again, everyone probably said \"Nobody eats at 3:30,\" then chose to eat at 3:30 to avoid the crowds, causing a huge line at 3:30. I bet the place was empty at a normal lunch/dinner time because nobody went at that time for fear of the crowds.) People these days, eh? Anyway, Grimaldi's should buy out the dilapidated sh*%house next door. More profit for them, shorter lines for us, everyone wins. Come on, guy!", "author": "Nick D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-06", "description": "The best pizza in the history of the world.  'Nuff said.", "author": "Justin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-20", "description": "Was in a debate w/ some friends as to what made the penultimate pizzas and think I wound up watching a program somewhere that its the older grandfathered locations with the coal burning ovens which gave the toasted thin slices the \"smoked\" taste.  Fantastic, though guess in the interest of maintaining the environment, glad these spots are rare.", "author": "M T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-20", "description": "I wanted to check out Grimaldi because Im a huge fan of pizza. I live in NY so I been raised and exposed to excellent pizza places my whole life. I heard forever that this place is the best pizza in NY. I recently tried 3 other famous pizza places in NYC itself. You have to wait outside before being able to eat at this restaurant which was fine because it was a nice day. However, if the elements suck which often they do in NY having to wait outside must suck. My friend and I had to share a table next to a couple that apparently was on a date which made for our table experience to be a little bit weird.  I had to wait a few minutes before being served. The menu selection is limited and its cash only business btw. My plate was dirty and I had to ask for a new one. The service was nothing to write home about. The bathroom was dirty which doesnt say much for how clean the rest of the place is. The pizza wasnt anything special or anything to write home about. I will not be making a return visit to this place. Thankfully, living in NY there are millions of much better choices to eat pizza at throughout the city. BTW if you want to eat similar style and much better pizza go to Lombardi or John's of Bleecker St. in NYC.", "author": "Bailey A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-04", "description": "Your walk from Manhattan over the Brooklyn Bridge will be rewarded with the best pizza you've ever tasted.", "author": "Blake R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-09", "description": "After years of talking about coming here, I finally made it to Grimaldi's and it was worth all the talk and wait.  We popped on by to Grimaldi's on Labor Day for lunch and after a nice walk across the Brooklyn Bridge (which everyone should experience atleast some point in their lives) and an hour or so of baking in the sun, we finally made it in.  The place is tiny and people are packed in their like sardines.  Between the four of us, we shared a bottle of chianti, a large pizza with sausage/olive on one side and anchovies on the other side, and a small pizza with mushrooms (Yes!  We were hungry!).  It was all excellent and if it weren't for the 12-person party that went in before us, I think our food would have come out a lost faster.  After stuffing our faces silly, we walked outside with happy grins on our faces just to see the dinner line forming.", "author": "Irene W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-11", "description": "It is some delicious pizza and very reasonably priced.  However i do not think it is worth the trek to come out here for the pizza.  I like Lombardi's a bit more and it was in the city.", "author": "Tim L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-12", "description": "We trekked to Brooklyn on our last day in town just to come here, and the chocolatier around the corner. Next time out I definitely want to spend more time in this neighborhood, and Grimaldi's will absolutely be on the list! I think I just drooled on my keyboard a little.", "author": "Jen B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-09", "description": "Not worth the wait.  Arrived at 500pm on Friday night - no one on line but we were kept waiting outside for one hour while they cleaned (?) and did something to the coal oven.  After being admitted we were taken upstairs where we waited for 45 minutes for our pizza to arrive.   Waiter was surly, the table was in an area that was warm - no fans or AC.   The pizza was good but what's the pleasure of eating it when you are experiencing restaurant abuse.   Have been going to Grimaldis for years with out-of-town visitors and it's always been inconvenient to park and the waits have always been long.  Now,  I'm happy to say I have a reason to boycott them.", "author": "Zorina G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}