{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-11", "description": "Ok, why we waited over an hr to eat this pizza is still a mystery to us. We live 2 blocks from one of the best pizzerias, but I guess we just wanted to see if this place deserves all the hype. \n\nFirst off, it's too crowded for my liking. If you like rubbing elbows with your neighbor and being rushed so that the next person in line can enjoy their meal, you're in the right place. \n\nWe ordered a pie with half garlic, half sausage.  They charged us for 2 toppings, even though it was technically one.  They waiter said it doesn't matter if it's only on half; you're paying for the entire thing.  Which wouldn't be so bad, but they over charge for toppings. At $2 a pop, I would expect a lot more than a couple of drops of garlic.  This is the typical thin crust style pizza.  It's not a bad pie, just not worth the wait in line. There are plenty of great pizza places in the NYC area, so don't think you need to wait in line. \n\nBottom line, is it good?  Sure. Is it worth the wait? Absolutely not.", "author": "Maggie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-28", "description": "The pizza itself deserves a 4 out of 5, but the fact that it is overrated and has gotten way too touristy makes it lose a star.  Seriously, if you want awesome pizza and are willing to wait for it, just go to Difara's.", "author": "Taylor W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-30", "description": "Waited 40 minutes in the cold to be seated. Seating is very tight, but it lends to the vibe of the place. We ordered a plain cheese as well as a meat pie. The plain cheese pizza was outstanding. The crust was perfect in crispness and texture, sauce was balanced and the mozzarella was nice and stringy when you pulled a slice. The other pie had sausage, peperoni and roasted pepper. The meat pie had a soggy crust (due to the roasted pepper?), but it was still very good. The peperoni was flavorful, had that nice crust and cupped shape. If I went back, I would definitely keep my next order simple, and not load up on ingredients. The beauty is in the simplicity.", "author": "Ray R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-10", "description": "hyped place. personally if you dont like bread and their derivatives, you wudn't like this place. my gf and friend though liked this place. \nif you go there for dinner, get ready to stand for and hour minimum. \ngo there only for pizza no calzone please.", "author": "carlson j."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-20", "description": "Very very good thin crust pizza!  We came here on a very cold Saturday around 3:00 and still had to stand outside for at least a half hour.  But, it was worth it!  The pizza was great and I loved the full leaves of basil they threw on top!  Delicious!", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-30", "description": "I can stand on Old Fulton street under the Brooklyn bridge with my icecream from on the waterfront and see the line.  But, It's your standard, brooklyn-style thin crust pizza. Deliciously topped with fresh mozzarella, pepperoni, fresh basil, tomato sauce is like a party in your mouth.\n\nThis is an old building with tiny tables and yes you have to wait forever outside. If you're not used to Brooklyn life, I guarantee that you'll complain about feeling cramped between tables and people and walls.  Then, after that, you'll be so turned off that you'll hate the pizza without giving it a chance.\n\nWhen you go in and act like you know what you're doing and not complaining about the style of theirs, beware. If you're moping around and complaining about how small the tables are or how long you had to wait, be sure you'll get looks.\n\nif you don't want it and truly appreciate it, go somewhere else like Applebees and get fast food and don't make me wait in line any longer if you're in front of me.", "author": "Thea T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-02", "description": "This is a beautiful pizza experience, though after the long wait and the crowded setting you may be a bit annoyed.", "author": "Christiaan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-17", "description": "We ate here last Thursday and waited in line for almost an hour with my husband, 7 1/2 year old son, 3 year old daughter, and husband's work colleague.  The gentleman at the door was very friendly and joked with us while we waited.  When we got in, we were seated quickly and our order was taken within 5 minutes.  Our waiter was also friendly and joked around with us.  We received our drinks quickly and did not have much longer to wait for our pizzas.  I got a large cheese pizza for the kids and myself and my husband and his colleague got a large pizza with pepperoni, onions, and other toppings.  The crust was perfectly thin and crispy - just the way I like it and fresh mozzarella slices were used.  My husband, his colleague, my daughter and I loved the pizza, but my son is used to processed mozzarella cheese and thought the fresh cheese was strange.  We ordered cannolis for dessert and they were delicious.  The only drawbacks were the long line to get into the restaurant and then the 15 - 20 minute line to get into the sole bathroom in the restaurant.  If you are in NYC, the pizza is definitely worth the trip.  The pizza is consistently good - we were here about 4 years ago and the pizza was just as delicious then...  I would recommend going for an early dinner - around 4 or 5 - if you are able, to avoid the long lines...", "author": "Danielle L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-26", "description": "Did it once.  The pizza is definitely good.  The line is an abomination.  All told, we waited over 2 hours from gettting in line to getting our pizza.\n\nI will not do this again.  I will, however, stop at the Brooklyn Ice Cream Factory next time I cross the bridge.", "author": "Nick J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-28", "description": "omg...the line to get in... was turning me off to wanting to go and check out the place. i told the group i was with to just to walk around and grab ice cream. we HADD to go because every time we looked at the pizzeria, the line was just always long...\nthankfully, one couple decided to wait in line, and when we got there, it wasnt too bad. After about waiting for about 15 minutes, and we were only about in the middle of the line, so with may b 15 people ahead of us. The Concierge, who was an old gentleman in a suit, which kinda reminded me of the Godfather, (LOL) came out and said, \"anyone for a group of 4\"??? then i shouted, \"YES! US!\" then we were able to cut ALL 15 people ahead of us and were able to get in!!!!!!\nThe pizza there were super fresh!!!!! LOVE, LOVE the fresh mozzarella cheese they put.\nI would have stayed there to have like 4 pies ( we only ordered 2 small pies for four, which is 6 slices per pie), IF it were a bit more saltier. I thought the pizza was a bit bland. I DO NOT LIKE THINGS that are salty but boy, was the pizza a bit too bland!\nBUT I did not complain because other fresh ingredients really substituted for its blandness(?) \nPark at the nearest Garage, get the stamp from the pizzeria, then u only pay $12 (max stay is 3hours) and we ended up saving $10 because without the Validation for parking, we would have paid $22 for staying for 2 hours!\nGot their Signature T-shirts for $15! the service was excellent, the environment was VERY, VERY cozy!!!!!", "author": "Hallie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-12", "description": "For me any five star pizza has to include artichoke hearts.  Maybe even some broccoli.  The toppings here are limited which is a definite minus in my book.  The actual pizza pie was good.  We beat the rush as the line started to extend outside as we were leaving.  All in all, the service is quick.", "author": "Jonny G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-14", "description": "Quite possibly one of the best brick oven pizzzas the world over. with the finest cheese and sauce ingredients. but perhaps the ridicoulous long wait just to get in helps build the anticipation and flowers your judgement when the pizza comes to your table. and don't try to game the line by ordering take out, you have to wait in line like everyon else.", "author": "Ron N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-29", "description": "Definitely the best pizza outside if Italy! Try and get there 10 minutes before opening to beat the queues to grab a seat.", "author": "EmJames"}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-12", "description": "I'm very late in writing this review. I ate here during summer of '08 and ever since then I regularly dream about their margherita pizza. It was simply the best pizza I ever had.", "author": "Megan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-09", "description": "good tasting pizza.. go on a non weekend night so u dont have to wait.. also kinda tight inside but def tasty", "author": "Dima L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-19", "description": "We went there on 9/13, Friday night around 6pm, waited in line for about 30 minutes. When we finally got in, sat down, we were ordering drinks and our waiter informed us that their alcohol license expired and they got a new one, but something happened to it and we can't order beer or wine. Fine, we ordered water and apple juice, got our drinks and were ready to order pizzas. Our waiter again started explaining how the oven is not hot enough and we would have to wait about a half an hour to get our pizzas. After pressing him for a couple minutes he admitted that the half an hour would be more like 45 minutes and then we would have to wait for all the other people to get their pizzas (at this point he pointed at the yellow slips in the kitchen, there were about 20 of them), we also noticed how one of the guys in the kitchen was just shoveling coal into the oven. Needless to say, we left. And all this happened, after we called and asked how long is the wait for pizza and they said: 'no wait at all, two minutes for pizza' and the old grey-haired guy coming out and checking on the line outside every five minutes really just forgot to mention all the problems inside.", "author": "Viktori P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-24", "description": "good, but not the best. spotty service that's not worth the quality of food. go to totonno's for the best pizza in new york.", "author": "Lena A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-29", "description": "This is what new york pizza is all about.  I can not say enough about how good the grub is here def worth the trip to dumbo.", "author": "Frank K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-02", "description": "Skip all the Ray's \"original\" pizzerias in Time Square, Little Italy, or even Lombardi's... this is THE BEST pizza in New York City. Even my vegan sister couldn't resist without indulging in the cheesy sin. Order the margarita pizza and some red wine and then take a walk to the edge of the East River to admire the gorgeous Manhattan skyline or venture to DUMBO or Williamsburg's Bedford Street for some Brooklyn fun.", "author": "Taryn B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-26", "description": "This is the best pizza in New York. I have only been here once considering I am not from New York, and I have only been once. The pizza is amazing, I actually went here while on a pizza our of brooklyn. The pizza is unlike any other due to the brick oven, which is illegal in california. Except for the long wait, this pizzeria is muy fantastico!", "author": "Lauren H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}