{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-06", "description": "We came on a dreary, rainy weekday!  And nope, no line! Ahh...thank goodness! I've read the horror stories regarding the disneyland-esque line for this restaurant and was so glad to not have to stand in it just to eat pizza!\n\nThere were only three of us, so we opted for a large pizza with mushrooms and pepperoni.  Okay, I had two slices but I could have eaten more! It was thin crust, the mozzarella tasted fresh, and the tomato sauce wasn't overpowering! \n\nIf I had to choose between Grimaldi's or Lombardi's though, I think I'd go back to Lombardi's. =/", "author": "Theresa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-28", "description": "Pizza was excellent... Exceptionally quick service..\n\nnice location where you can take a short stroll after dinner to the river.", "author": "J D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-17", "description": "I am always skeptical of any place that declares they are \"the best\" at something, but dammit, the Grimaldi people are the best at making pizza.  \n\nIt's a cute little place with simple red checkered tables squashed every which way to accomodate the endless stream of customers that come pouring in each day.  Lucky for me, I work in DUMBO and can have it delivered.  I'm partial to their plain cheese pie - because I can never decide on a topping!\n\nCrisp, fresh and never, ever greasy, somehow you don't feel guilty after stuffing your face.", "author": "Ruthy E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-28", "description": "Great thin crust pizza made fresh and hot in the brick oven.\nGet there early to avoid the long line that forms outside!", "author": "Kimberli M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-13", "description": "Really tasty pizza.  There's nothing that I can say that the other reviews haven't.  It's very, very good pizza. \n\nThe only negative is if you don't eat your whole pizza, it doesn't do that well as leftovers (the thin crust gets a little too soggy.)", "author": "Jason C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-04", "description": "OK, so the wait was unbearable (45 minutes out in the scorching sun!).  The pizza we'd ordered came to us very late - later than people that came after us.  When it finally came, the pizza was.... good - but not the best.  \n\nMy friend and I decided to take it out and enjoy it at the park nearby with a view of the city skyline.  If it weren't for the lovely summer day and my good company, I don't think the pizza would've been anything too special to remember...", "author": "Claire Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-18", "description": "By far the BEST pizza in ANY New York borough.  They create these fine pizza's in their hand shoveled, coal oven.  They use FRESH mozzarella, wonderfully spiced and fresh tomato sauce, and the crust is thin and a bit smokey -- even the pepperoni is the most tasty I have had (and a bit spicy-er than most.)\n\nIf you are looking for this place, cross the Brooklyn Bridge into Brooklyn, walk beneath the bridge and look for a line which stretches from its door all the way back to the corner . . . these are the faithful followers of this wonderful delicacy -- and it is worth the wait.\n\nDon't expect to come here for the atmosphere, wide ranging menu or the shoulder room -- none of that exists here -- but be prepared to give your taste-buds a treat.  Their antipasto is a nice treat while waiting for your pie -- it has a nice selection of olives, fresh mozzarella, salami, and fire roasted red peppers.\n\nAND be sure to bring cash as they don't accept plastic here (except at the ATM at the front door -- but of course you will pay a surcharge for the privilege.)\n\nIf you are looking for better atmosphere, a wider ranging menu, a place that accepts plastic, or alcohol -- or don't want to have to wait outside in bad weather -- and still have this wonderful pizza, then definitely visit Grimaldi's Garden City (Long Island), location.  It is just as good in Garden City.\n\nIf you are in Brooklyn for this treat, don't forget to enjoy desert at the Brooklyn Ice Cream Factory down at the promenade -- it's the best ice cream in the area.", "author": "Jeffrey K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-04", "description": "I've had some legendary pizza in my day, but Grimaldi's is the measuring stick. It is without a doubt the best I've ever had, hands down.\n\nWhen I daydream about New York pizza, I usually gravitate towards those little hole-in-the-wall joints where fat greasy dudes in stained white tees throw a slice on a paper plate \u0026 slide it over a smeared countertop to you. Yeah, that's the authentic NY pizza experience right there. The good thing about these daydreams is that I can be in almost any major metropolitan area \u0026 find a joint or two that can pull this off fairly well. Maybe it won't be quite as good, but it's close enough, \u0026 close enough is good enough for me.\n\nThis is why I need to push Grimaldi's out of my heart \u0026 throw away the key. Grimaldi's is the one that got away. It's the best there is. There aren't a whole lot of places out there remotely capable of doing it like Grimaldi's (though I've found Gialina in San Francisco to be a pretty nice consolation prize). \n\nThat's why I cut Grimaldi's out of all our pictures together, \u0026 buried all the things it gave me. I'm just trying to save myself the heartache. You understand.", "author": "Pete J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2006-12-10", "description": "Flavor was OK, but for the price I'd expect either something really unique,  some amazing service, or maybe just a well conceived pizza. This place seems to have bought its own hype just a bit much. For $2.00 you can afford to actually COVER the thing in pepperoni, basil, mushrooms, or the like. \n\nService is a part of having patrons. I just can't figure out why they still have so many.\n\nGet with it, Patsy.", "author": "Dan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-22", "description": "like a pot of gold waiting at the Brooklyn Bridge's end.\n\nBest pizza in NY, no joke. Lots of yummy toppings to choose from, the possibilities of pizza combos are very promising and tasty. Grimaldi's does brick oven pizza justice. If wine's your thing, order a carafe/bottle to complement the flavor. \n\nUnless you go early afternoon on a weekday, expect lines. I say: wait on. It's well worth it.", "author": "Geralyn Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-12", "description": "When thinking of what to write in my review of Grimaldi's the term \"tourist trap\" comes to mind!\n\nI had better pizza the week before that my Italian boyfriend gently crafted by hand in our teeny little kitchen in a teeny little Brooklyn apt...maybe we can start something, but I digress.\n\nThe pizza at Grimaldi's was so-so...the sauce definitely needed a kick, it wasn't tangy enough to cut through the cheese or any of the other toppings.  The cheese was distributed nicely and the basil was a nice addition although I had to pay something like $2.50 extra for that (when I could've gone to DiFara's and had fresh, in house grown basil lovingly clipped to adorn my hot-from-the-oven pizza).  I must say that I don't usually get pepperoni but the stuff at Grimaldi's was quite good.  Either way, all of the parts did not add up to the perfect whole!\n\nI went in kind of biased too after reading a review on another cite in which a diner watched a family of five roll-up in a limo, pay off the host and walk right in, completely by-passing the intensely long line that was already formed. And that's another reason why we should all realized that Grimaldi's doesn't seem like they care for the locals anymore...and that makes a huge difference, at least in my book.\n\nBottom line...it's not worth they hype or the long wait!", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-12-10", "description": "This place is for Tourists!!!\n\nGrowing up and eating pizza at the REAL Mariello's in the Village (RIP) as a kid in the 80s, I heard all the hype about this place and man was I sorely disappointed. The sauce was runny, whats up with the droopy chewy crust?  \nThe good thing I have to say was that the pepperoni was almost chorizo-like, which i give props to for its uniqueness, and the homemade mozzarella was creamy. I think its appeal here is the handmade thin crust, what I would expect real pizza to taste like in Italy. But it is truly over-hyped in terms of cost and I would never wait on line for this place again, especially if you are bringing friends living in Manhattan. Signs of a touristy spot: the service is pretty cold, seat your party down and rush you out the door afterwards...", "author": "Agatha A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-28", "description": "I will not come back to Grimaldi's again. This was my first and last time. Yet another case of mediocrity with hype from people who have not had good pizza. This is clearly a place you take a tourist to see pictures of how old New York used to be and to walk around in the DUMBO area. Once they're starving, anything tastes a lot (maybe a ton in some cases) better.\n\nThe red and white checkered plastic table cloths gross me out. How the heck are you supposed to disinfect these things? Elbows catching on semi-sticky plastic is not an appetizing asset.\n\nAnyway, onto the pizza. The toppings were good, but our server put olives and onions on our pizza after we had only specially ordered mushroom and sausage. How hard can it be to screw up toppings and they usually taste about the same across the board unless if they're rotten (they weren't here).\n\nSoda comes in a plastic bottle (so not old-fashioned). There was no wait on a Friday night a month ago, but we left half a pizza and did not bother to take it home since it was that bad. The sauce was skimpy and the crust flavorless. \n\nI think people go here for the location since it has breathtaking views of the Brooklyn Bridge. Too bad Grimaldi's doesn't face it from inside because then there would be a positive of coming here. \n\nMy quest continues for above average pizza in NYC...", "author": "clb k."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-31", "description": "Every time I eat here it's a life-altering mind-blowing experience. Each bite sets off sparks in your head, as you try to eat it before it gets cold (or your friends eat all of it).\n\nThere's always a line but it moves quickly. They don't really pay attention to you and it's very crowded inside, but you're so focused on the pizza, who cares?\n\nthey have \"brooklyn root beer\", but it's made with corn syrup. i've never tried the desserts, but the pizza is so wonderful you'll remember it for months.", "author": "Ryan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-27", "description": "You probably won't have to wait as long if you're just a couple people; it's easier for them to squeeze you in somewhere. \nPizza is marvelous. Sauce was a little runny, but tasted great.", "author": "Lin H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-10", "description": "Easily best pizza in the city. However with the long line (hour and a half wait for us) and awkward seating (they cram you in), I doubt I'll be back too often. Would rather have a slice that's not quite as good but with better atmosphere and no wait.", "author": "Reid G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-21", "description": "The line of tourist that circles the block to get in should say it all. If you pick the right time to go when there is no line I can assure you that this is one of the BEST pizza spots in the five boroughs and the price for a pie stayed true.", "author": "Augie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-30", "description": "Great pizza, even thoug sometimes I feel it is overated to wait that much. its part of the charm speciallyt he BK one!", "author": "Robert F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-19", "description": "Been living in NY all my life, and I can easily say that GRIMALDI'S IS ONE OF THE BEST PIZZERIAS EVER!!!", "author": "Wally S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-01-04", "description": "The hardest thing about grimaldi's is trying to decide what topping to pick.  The pepperoni is thick cut and perfect, the olives are devine and the garlic comes out perfectly roasted.\n\nJust remember to bring cash because they don't take credit.", "author": "James B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}