{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-20", "description": "There's good news and then there's just the way it is... this pizza is phenomenal. Hands down most delicious pizza I have ever had. The spot? It's got its churn out style in a slew of observed tiny details.\nWhy not 5 stars? Ok so... \non the level of cleanliness observation, it definitely is missing a few beats. The bathroom was aged and wet - cheap paper towels soaking up puddles of excess water from patrons and workers alike I'm sure. Chinet plates and plastic cutlery were kindly assembled on our - quite filthy - checkered table cloth - clearly from a long busy day of ...well, pizza.\nOnce the pie arrived I forgot everything I ever cared to worry about regarding the cheap choices in plating and restroom ambiance because the money made clearly goes back into the makings of a fantastic eat. The freshness overloads your senses and any topping choice will flatter a typical cheese slice. The dough is soft and charred, the tomato well balanced, and the cheese doesn't delivery an ounce of unwarranted grease. Truly enjoyable.\nSo is it worth the wait? My answer is that depends on your current status. If the only cure for your sickness is delicious pizza without a bougie upsell than yes, you'll find Grimaldi's quite the anecdote.", "author": "Laura C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-30", "description": "Good thing i know a guy who knows a guy who dated a girl who knew a guy because we got seated as soon as we walked in !! ..... ok i actually dont know anyone but we got lucky lmao .\n\nIt doesn't get any better than Grimaldi's pizza , the fresh pizza , fresh toppings my oh my i can't get enough of it !! \n\nWhen in brooklyn you have to come and experience pizza heaven here , just make sure you come hungry because the small was more tham enough for 3 of us.\n\nOnly problem is after eating pizza here you'll never enjoy pizza anywhere else so be prepared to say good bye to all the other pizzerias. \n\nThe location- beautiful with an amzing view of the city (Manhattan) and the Hudson river and Brooklyn Bridge. \n\nThe staff- Aces , the waiter took the time to tell us what his favorite topping combo amd the crowd favorites were and checked on us often to see if we were pleased and or wanted anything else.\n\nThe price - very inexpensive when you consider the quality,  quantity and location of where you're eating. \n\nHands down the best pizza !!", "author": "Vinny U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-27", "description": "Worst customer service ever. The door staff was extremely rude and a disgrace. It's not worth hearing insults and being humiliated for their basic NY style pizza which you can find anywhere. Can't see what the appeal of this place is. Stay away.", "author": "Zack I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-03", "description": "Very unimpressed by this joint. \n\nCame here for my friend's birthday on a Friday night. Luckily, we had missed the lines that formed as soon as we got in. Restaurant is huge; we got seated in the back. The waiter forgot to come by our table to get food/drink order for a long time. We had to hail a waiter to come and get us water. The menu is simple, which I appreciate. \n\nWe ordered a large pizza and it was awful. The crust was not crisp - it was on the verge of soggy and the sauce did not taste fresh. This restaurant is popular for a reason but I would definitely not go here again.", "author": "Jieun L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-22", "description": "I would bathe in the red sauce! Get extra sauce or a cup on the side to dip the crust in. Long wait, but absolutely worth it. Service was average. Wish they served wine and beer!", "author": "Kala B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-14", "description": "Take-out orders need to stand in line as well. No a/c on the first floor by the window (I went inside around 9pm and it was hot). \nI ordered a large (regular and white) half and half and it came with 8 pieces. Without any topping. Still pizza was good. Italian!\n\nThey charged us a soda which we did not order. It was frustrating to figure out what went wrong since I get to see only the handwritten order form as my check. Well when I told the server that  I was charged a drink that I didn't order he just crossed out it from the order form and walked away. Oh no...say sorry when you make a mistake. Simple. I bet this happens quite a lot in this place so make sure your order is taken correctly.", "author": "Soyoung M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-23", "description": "Service was on point for a Friday night. Food came out quick and HOT!. If you're ever coming into Nyc this is the place to come get pizza.", "author": "Sheldon W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-29", "description": "Missioned here, and waited over an hour in the cold to get in the restaurant. \n\nSure the ingredients are fresh and its cooked in a coal brick oven, but which pizza is not cooked in a brick oven these days? \n\nWe didn't feel like we received much personal attention from the servers. The place was a frenzy, and not my kind of dining atmosphere. \n\nOverall verdict: Yet another tourist trap.", "author": "Amelia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "BROKE. THE. SCALE. I wish I could give them 10 stars, it was SO GOOD. And SO DELICIOUS. Let me tell you something, I am severely lactose intolerant, and when I say severely I mean I can barely have cheese, but believe me when I confess to you, I'd sacrifice my stomach everyday for the rest of my life if I could just have this pizza forever... when we got to the door, we were greeted with a nice warm smile, and pleasant conversation, and you instantly feel at home. The restaurant is fairly small in Brooklyn, but it just contributes to the coziness and comfort of it all. It isn't too loud, but we weren't here at a very busy time, and only waited 10 minutes tops. I hear it can be extremely busy though! So be prepared. We had two large pizzas for the five of us, one regular, one with pepperoni, and we ate every bite... Were from Alabama, and were told that there is one in Mobile, so it looks like we're moving to Mobile! Haha. Seriously though, this place is a MUST when visiting Brooklyn. Until next time Grimaldi's. Until next time.", "author": "Sara N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-26", "description": "It was on a my bucket list to come here, and it didn't disappoint. I actually wanted to go to Juliana's but it was closed during the snow day. I was surprised to see Grimaldi's was open and got seated without waiting in any line! I've heard mixed reviews, but I thought the pizza was fresh and delicious. The amaretto ice cream was amazing! The food was great. Nothing special about the decor. Service was ok. I think the staff appeared unhappy to work on a snow day- don't blame them. Great pizza, but I wouldn't wait an hour + in line for it. Worth it to stop by if you're in the Dumbo area. Cash only.", "author": "Anna N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-08", "description": "To quote Kevin Sorbo.... DISAPPOINTED!\nI was told by more than one source that Grimaldi's was the best, if not among the best, pizza spots in NY. I made the trip to Dumbo just to try what turned out to be a very hyped up couple slices of pizza. I waited a long time in line for it too.\n\nThat's not to say it was \"bad\" in any respect, just very very very normal. And in a city where pizza reigns supreme you have no stomach space to waste on average pizza. I'd give a 2.5/5 because it was straight up mediocre. Had worse, had better. You can skip Grimaldi's.", "author": "Stephen C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-27", "description": "Honestly, the dough is too tough and chewy to eat. Very underwhelming for the price. Disappointing to say the least.", "author": "Rebecca B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-20", "description": "No doubt the pizza is amazing! However, the customer service is bad. The lady at the counter who takes the take out order is rude, impatient and dont have the courtesy to talk to people politely. I understand her job might be tough and she might have to face a lot of people daily but that doesn't excuses her for her rude attitude.\n\nIn short bad experience ruined a great food!", "author": "Tashi G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-23", "description": "Not worth the hype. Came here expecting rave worthy pizza but was disappointed with probably the worst pizza I've ever tasted in my life. When coming here you have to know a couple of things: no cash, no concept of taking food home, and the pizzas are pretty large - even for a small that is good enough for two people, as it says on the menu. So I ate a small pizza with mushroom topping, $14 pizza and the mushrooms cost $2 extra. The wait time wasn't bad at all but the actual pizza itself was extremely disappointing.\n\nMore sauce than cheese and the crust was burnt. I knew the crust was going to be thin, something that I don't really like in pizza but having it burnt AND soggy from the amount of sauce was just unappetizing. I feel like a pizza with out a decent amount of cheese shouldn't be called a pizza itself either, but I guess that's just me. Had to eat all of it though because of their no take home policy, but all I know is that I will not be back again. I don't know what's the hype about.", "author": "Fariha K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-31", "description": "Yes, I was one of those tourist that came all the way to Brooklyn for potential hipster sightings and Grimaldi's. Arriving around 2:30pm, we missed the lunch crowds and just walked right in to order our medium sausage and pepperoni. Within minutes the piping hot pie came out and like a real New Yorker I folded my pizza in half and devoured my first slice of Grimaldi's. The crust was light and chewy, but my favorite was the quality cheese.\n\nI highly recommend going for \"lunner\" to avoid crowds. Don't forget it's cash only and if you need change, tell them! My date was expecting around $0.70 in change, but they never brought it back. I'm guessing they thought it was tip?", "author": "Lauren T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "Thin crust pizza at its best.  We ordered one margherita and one white cheese pizza.  You could def taste how fresh everything was.  Aside from the obvious fact that you can see them making pizzas and piling on (fresh) ingredients, you can taste it in the way the cheese pulled with every bite.  The white cheese was a tad bland, would recommend adding some toppings.\n\nThere was no wait when we came here 20 min before closing on a Friday night.\n\nHere's the Grimaldi Etiquette 101:\n\n*Cash only\n*They don't sell by the slice\n*Extra charge for each additional toppings\n*No beer/alcohol (yet)\n*A Small \u0026 Large are literally like the same thing - HUGE\n*Fairly large (and old) establishment\n*(Mildly) clean restrooms available\n\nTotal NY experience - Check.", "author": "Cynthia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-18", "description": "When the moon hits your eye , like a big pizza pie...that's Amore. \n\nNo wonder Grimaldi's is a world renowned pizzeria \u0026 in business for over 100 years- the pizza is AMAZING!! Thin crust dough topped with fresh mozzarella and plum tomatoes cooked in an old brick oven pizza...one delicious pizza.  It's so light \u0026 airy...it's dangerous because you lose count of how many slices you've had. Goes down so easily!!! Incredible crispy crust with  those beautiful tomatoes ...FAGETABOTIT.   \n\nWhen they say \"there's a line\", that's no joke! I pulled up at 11:20...(they open at 11:30) and there was already a line down the block. I didn't mind because I knew I wanted this delicious delight.  \n\nEven though I took my pizza pie to go, I saw plenty of tables to dine-in \u0026 even a bar. Yes , it's very old skool \u0026 they mean business here. It's all about what kind of pizza you want \u0026 get out. It's not you fancy schmancy spot to sit an hand out for a few hours. \n\nLocated right underneath the Brooklyn Bridge \u0026 Parking the car can be a little tough , but you'll manage.  Circle the block a few times because I it's well worth it.", "author": "Jason C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-27", "description": "Wow Grimaldi's is definitely hyped up, but in my honest opinion, I don't believe in the hype.\n\nPizza is huge in New York but I think I'll be a much happier guy just eating $1 pizza than eating at a pretty pricy pizza restaurant like Grimaldi's. Don't get me wrong, the pizza tasted really good but I don't believe it taste any better than the $1 pizza I've had in New York. My friends and I ordered two pizza pans (chicken with white sauce and ham with tomato sauce) and we were all still pretty hungry (we eat a lot). I thought it lacked some sauce because I could barely taste it near the end. It was definitely a good experience, but I believe Grimaldi's is one of those places to have once and you're good.\n\nThe service here was wonderful and our server was funny with a great attitude. This place is cash only so be prepared.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-08", "description": "Overpriced, overcrowded and overestimated... New York is bustling with amazing pizza, no need to wait for an hour and a half  for pizzathat is just ok. Head to Cappezi in midtown!", "author": "David S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-03", "description": "5pm on a Saturday, 15min wait. Service was modest, Italian sausage and mushroom small pizza for two adequate.", "author": "C C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}