{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-31", "description": "Okay, let me tell you, I stood in line for 1 hour, in the hot, humid weather of Brooklyn, listening to my husband complain about waiting and was the wait worth it?  YES!!!!  After we got in we were greeted by our waiter who got us our drinks right away (by the way, Grimaldi's does have water for the guests waiting in line).  We cooled off and relaxed as we decided which pizzas to order.  We had a pepperoni and a vegetarian.  Both were FABULOUS!!  The owner was there that day and walked around apologizing for the wait and making sure everyone was being taking care of.  We even got a photo of him serving us a slice of our pizza.  We are so happy we chose to wait because the experience was wonderful.  P.S. Make sure you go to the Brooklyn Ice Cream Factory.  We sat outside, in the shade by the water.  The ice cream is tasty and very creamy and the view is fantastic.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-19", "description": "The pizza doesn't live up to the hype or the line you'll find outside of this place; that's not to say it's bad, but it just ain't that good.\n\nIf you've got the time, wait in line; it actually does move pretty quickly. When you walk in, you'll notice pictures of all the celebrities who ate there that didn't have to wait in line and probably thought the pizza was just ok as well.\n\nI have to agree with another reviewer who said that the pizza gets cold really fast, so be sure to eat up as soon as it hits the table. The crust is somewhat crisp, somewhat doughy/chewy - there was definitely some char on it; the sauce was nice too as it wasn't too sweet. The cheese was flavorful and seemed to be of good quality (nice and white instead of yellow/oily).\n\nOverall, if you really are dying to eat here, you may be disappointed after you brave the line.", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-06", "description": "Lets keep it real.  I live 2 minutes from this place and i can see it from my window.  The guy at the door is an A Hole.  The guy by the register has gotten better but is still an a hole.  Everyone else in here is nice enough.  But the pizza is as good as it gets.  Dont put all that crap on your pizza and do as we in the BK do order the regular pie.  Recommendation:  If your a tourist, call when you're on the bridge, pick up the pie and some drinks and walk over to the parks by the water.  I prefer the park by the river cafe, yes its open to the public and its beautiful.  5 STARS for a few a-holes, crappy decor , and awesome pizza.  Oh i forgot  they recently added a take out fee of 2 bucks per pie.  What the F is that about. Man people really do love pizza", "author": "M D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-16", "description": "long ass lines?  fugghedabboutit!!!!  pie that will make youz guys cream your jeans?  Oy Vey!  Baddabing, just do it already paisano!", "author": "Terence D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-31", "description": "I've been here twice, and would probably go back if I were in the mood for the \"Grimaldi Experience\" I guess you could call it... The first time was on a weekday for lunch. There was pretty much no wait (which I know is unusual), and we had a large group. The pizza was awesome, and it was just a good time for everyone. The second time I took my visiting family and we waited for almost an hour. I have the kind of family that gets super grumpy when hungry, so the wait was not great, and I don't think my parents thought it was worth it. They thought it was very good pizza, but you can find very good pizza elsewhere and not have to wait an hour for it. Still, I think it's kind of fun and chaotic! (But I am also a very patient and tolerant person so... :P)", "author": "Elisabeth A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-12", "description": "Best Pizza in NYC !   Yes, there's a waiting line if you go at peak times but it's sooo worth it.   Also, after dinner stroll down the street for amazing views of Downtown Manhattan.", "author": "Calimero R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-31", "description": "I grew up in San Diego and have never been to New York.  I used to get irritated when I hear New Yorkers bad mouth the pizza out in the west.  I mean, how different can the pizza be between east coast and west coast.  I never even believed all the specials on The Travel Channel.  I've even tried NYPD Pizza, Bronx Pizza and Pizza Luigi's.  I wasn't impressed by them, though I would pick Luigi's out of the three.  I couldn't find much of a difference from any of the pizza joints we have in Southern California.  Well, I'm man enough to admit that I was wrong.  New York is definitely where the pizza's are born and reside.\n\nAfter hearing that Grimaldi's was started by the chef who \nade the pizza at Lombardi's, I had to hunt down the restaurant during my trip to NY.  Upon arriving at Grimaldi's Pizza from the #4 train, I saw a line has formed outside.  I was told not to be discouraged by the line.  The pizza is well worth it.  I was glad I listened.  The line was about 10 people deep, but it moved rather quickly.  Each pie takes only 2 mins. to bake so they can move people in and out pretty quickly.  The guys are pretty quick to get your orders out to you as well.  The price was pretty reasonable too.\n\nNow, enough of the blabbing and talk about what's important, the pie.  The crust, it's nice and crunchy on the outside from the high heat of the coal oven.  The inside is still moist.  I do not like the thin crust on the west coast, but I definitely like the thin crust in NY.  The toppings are fresh and they aren't cheap on them.  There's abundant of cheese to fill up the pie as well.  One thing I do like about NY pies is that the cheese aren't shredded like out here.  The cheese are large slices of mozarella.\n\nI definitely recommend Grimaldi's for a great pie.  You can even walk it off afterward by walking back to Manhattan on the Brooklyn Bridge.", "author": "Hoa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-12", "description": "Probably my favorite pizza in NYC.  Glorious thin crust, toppings that are not things like \"drizzle infused sun dried antelope meat\" just yer basics.   Only drawback I can think of is that eating there makes one appear to be a bit of a hoss.  Since the slices are thin, it is very easy to find yourself eating about 5 slices.  Not so cute on a date but amazing with an understanding friend that turns a blind eye to gluttony at it's finest.", "author": "Katie Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-25", "description": "The ridiculous wait pushed this place down to 2 stars for me.  It's not like any of the pizzas tasted bad, but it was nothing special, nothing memorable (except the wait).  Are New Yorkers just seriously deprived or something?  You guys need to come to California.", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-15", "description": "best pizza in nyc. I know that everyone else votes for Lombardi's, but they are wrong. They can have Lombardi's. It just leaves more Grimaldi's for me.", "author": "kirsten s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-19", "description": "This is my second favorite pizza (next to Totonno's).  Coal oven, fresh mozzerella, tastes great.  One thing that Grimaldi's has Totonno's beat on is their pepperoni.  It's kinda thick and gets crispy.  I love that.  They also give you an entire 20 oz. bottle of soda, which I like.  There is almost always a line, so expect to wait.  Also expect to sit on top of someone you don't know and not be able to have a conversation.  It's really tight and noisy.  But, you go there for the pizza, not the ambience.  Go, eat, and save the talking for outside under the Brooklyn Bridge.  It's nice.", "author": "J K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-01", "description": "I'm not sure that standing in the line is worth it. While tasty, the pizza was too busy and overloaded and also on the soggy side.", "author": "Jen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-13", "description": "THE BEST PIZZA! Take it from a pizza lover this place is pizza heaven! It's made fresh and the ingredients are very tasty.  Yes, it does take about 30-40 min waiting in a line outside to grab a seat in the house (even in freezing weather) but it's worth the wait. When in NYC be careful to fall into the \"ALL PIZZA in NY is good\" type of thought because NOT all Pizza is good in NY. You have to choose carefully and wisely. This place has been around for years and after my first visit 5yrs ago in the city nothing has changed about their service and quality of food. I absolutely recommend it and its a MUST for a first visit to NYC.", "author": "Sunie Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-07", "description": "Coming from a vegan, this is the best pizza I've ever had! No, they don't have any vegan cheeses or meats. But they can make a vegan cheeseless pie that will blow your mind. Make sure to add black olives on your pizza. You really should. Oh, and expect to wait outside on line for an hour (maybe two).", "author": "Philip R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-27", "description": "The food:  Solid pizza for a good price.  I can't complain here, but at the same time, neither was I blown away.  If I wasn't from New York, I may be inclined to give it higher marks, but given its competition, simply having a really well-done crust isn't enough anymore.  The toppings simply didn't have any depth of flavor to them, so when you compare it to someplace like Paulie Gee's in Greenpoint - a bit more expensive, I'll admit - the pizza falls to \"good, but not awesome.\"\n\nThe Restaurant:  Nice and low-key.  4$ beers, comfortable, good mix of people and in an interesting part of town.  I got there early - 5:30 or so on a Wednesday - so there wasn't a line.  One quickly formed, though, and I think that the incredibly slow waiters are as much to blame for this as the popularity.  I'll wait as long as it takes for my pizza to cook fresh, but I shouldn't have to hunt around for someone to take a check when there are 5+ guys covering the small space.\n\nVerdict?  A good stop if you're with your family hiking over the bridge or going to the new park.  However, if you're on the hunt for the best pizza in town, look elsewhere.", "author": "grizzzly b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-06", "description": "Even half star would be too much for this place. The pizza (how do they dare call what they serve a pizza) at Grimaldi's is absolute  c r a p. Maybe the fact I am italian and therefore I have tasted the real thing for most of my life, makes me a bit more judgmental about pizza in general, but this place should really not been allowed to be in the business of serving food.", "author": "G. P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-22", "description": "Ok, here's what I think:  The last time I was in Manhattan, took the train to Brooklyn twice to eat at Grimaldi's.  It's that good.  Maybe at the times that I went, there were no lines, or hardly a wait, and the pizza was phenomenal.  Keep it simple:  plain cheese; pepperoni with mushrooms; sausage, peppers and onions.  You will not be disappointed.  Staff was fine:  prompt and courteous.  Typical Brooklyners.  Going to NYC next month again, and guess what???  Going to Grimaldi's!  Can hardly wait.  A must try for any foodie or someone who wants to try some of the best pizza in the country.", "author": "Tony N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-08", "description": "Well worth the wait! This is one of the best pies I've had in NYC.", "author": "John C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-20", "description": "Worth the wait, but also worth eating a little early so you don't have to stand in line.  Fast, thin crust, fantastic toppings and good beer.  Can't ask for much more.  Well it was a little charred from the coal oven, but it was still mighty tasty and I was super glad that we got on the wrong train and ended up in Brooklyn.", "author": "Emily I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-24", "description": "Memorable pizza.  Best?  Not for me.  It was definitely good.  Is there anyone who didn't have to wait?  We end up ordering take out and ate the pie on the dock by the bridge.  Very romantic considering the view.  But it was also only 40 degree with wind.  Pizza turned cold after my second slice.  I can tell you from first hand experience, Grimaldi's pizza is also good eaten cold.", "author": "Morgan C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}