{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-07", "description": "I always pass by Grimaldi's everytime I am around the neighborhood, but I never had the urge to stand in the long line for pizza. One lucky day (it was raining), there was a short line (6 people only) at Grimaldi's so I took that opportunity to line up. And, in less than 10 minutes my sister and I got a table. \n\nWe ordered a medium pizza that had pepperoni, mushroom and extra cheese. The pizza smelled wonderful, and looked really tasty. I picked up a slice of pizza, and to my surprise the crust was soggy! I have never encountered or eaten a pizza that had a soggy crust before so I was really disappointed with Grimaldi's (as this was a place that was highly praised). Another disappointment was that the pizzas were not made by the owners of the pizzeria, but by people they hired (whom they probably pay low wages to while they themselves keep a large chunk of the profits). My favorite pizzeria is still Di Fara's; it may be overpriced but he makes his own pizzas and the crust is not soggy at all!\n\nI think Grimaldi's is overrated, and definitely not worth the hours of wait.", "author": "Sandra S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-24", "description": "Was seated right away\nNo line on a Thursday afternoon...awesome\nPizza is good, a cool option if youre in the area, but not worth the lines that I usually see outside this place.", "author": "Ashley G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-10", "description": "This is a famous pizza place in New York so definitely stopped by this place for their pizza. I love pizza!! \nThe reasons why I gave this place three stars include many different factors. First of all, this is a very popular place so the wait time is absolutely long. We waited in the very cold weather for 1 hour before we were able to sit in the restaurant. Therefore, I had my expectation high when I walked in. Secondly, the menu was very simple which had one appetizer, drinks, and many pizza toppings to choose. The ordering process was rather simple because there were not many items to pick. We ordered the appetizer and a medium size pizza with mushroom, onion, and Italian sausage. I like how it was very easy to order and straightforward. The pizza came out and looked pretty good. However, it was a bit cold. I was expecting fresh out of oven hot so that kinda lost few points there. After we tried the pizza, the flavor was a bit too weak for our taste buds. All the toppings were high quality but they did not go very well together on the pizza. I loved their mozzarella cheese!!! I loved how light the pizza was with their fresh ingredients, compared to American pizza. But the flavor was really not as strong as I was expected. Overall, the pizza did not \"WOW\" me with their flavor. However, the freshness and quality of their toppings were perfect for their pizza. If we would order different toppings for our pizza, the pizza might taste complete different and could over turn my ratings. For this particular visit, I would give a 3 stars; however, I could see how other people rate it higher.\nI did like their pizza even though it was not like what I was expected. I appreciate that they kept the traditional method of baking the pizza and the old school restaurant style. However, the wait for 1 hour in the cold weather did affect my rating and experience in the restaurant. I would still recommend visitors and tourists to try this place; however, be prepare for the wait and be open minded to try a different style of pizza.", "author": "Wanting H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-03", "description": "Old school pizza at it's finest.  I've had the pleasure of having gone on somewhat of a Brooklyn pizza tour recently (Saraghina, Totonno's, L\u0026B Spumoni Gardens \u0026 now Grimaldi's), and without question this plce stacks up right along side the best in the city.  I haven't been in over 10 years \u0026 the product is consistent...even in the new location. \n\nBefore you stand in line, pop inside to see if there are any spots @ the bar.  I did that recently \u0026 my wife \u0026 I avoided the long line of tourists outside :)", "author": "Douglas D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-13", "description": "I mean, it's just pizza. Okay, don't yell at me! \n\nI took the long walk from Manhattan to Grimaldi's because I had a friend in town and we needed a place to eat....we also really wanted to walk in the rain (yeah, no). We ended up at Grimaldi's because a) I've never been, b) we were in Brooklyn, and c) nothing else was open on a Monday. \n\nThe line was nonexistent and the place was definitely filled with tourists - the group who was next to us, tipped zero dollars (the waitstaff was less than thrilled). We ordered a small mushroom and pepper pizza, which was actually quite large! Honestly, I would recommend it if there is no chance you'll have to wait in any kind of line, but otherwise, you can get the same kind of pizza in Manhattan, or a place with no line. And the ambiance is quite blah.", "author": "Sara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-29", "description": "NOM!\n\nI'm from the West Coast, so I'm not going to pretend like I know anything about pizza, let alone New York style. But Grimaldi's is artfully crafted, made with fresh and ultra high quality ingredients, and just plain tastes delicious without being heavy or greasy! Our party of 4 split 2 pizzas, a large and a medium, and we had a few leftover slices to take home. I ate 2 large and 2 medium slices (no shame no regrets). However, everyone else in my party maxed out by slice #3 and so probably will you -- I'm just a total fatass.\n\nMy biggest regret was ordering olives as a topping on one of the pies -- they're served whole, black, and pit-in, so I found them to be overwhelmingly salty and rather incongruous atop an otherwise sweet, tender, and earthy bite of pizza. Next time, I'm going straight sausage and mushroom FTW!", "author": "Cam Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "Great pizza. Great location, right under the Brooklyn bridge. I shared a pizza and a cannoli and can't complain about either one. The crust was so soft and you could really take the smokiness from the oven. It was great. We got there late almost to closing and they still sat us. The service was a little slow but the food was timely and that's the most important part, right? Very affordable and hey, it's Grimaldi's. All in all, great experience. Definitely going back.", "author": "Farah T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-01", "description": "This was the best tasting pizza I had while in New York.  It's exactly what I pictured for a New York City Neighborhood Pizza Joint.  It's loved by locals and tourists.  The atmosphere is simple but cozy.  The tables are all crammed inside and the wait is usually long.  You share big tables with strangers but that is part of the appeal.  \n\nIt's cool to see the Pizza Oven right behind the counter while they make your pie.  They won't let you take a picture of the oven for some reason.    Another fun part was walking the Brooklyn Bridge there and back.", "author": "Chuck S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-14", "description": "As I speak, there is a couple trying to eat their pizza with fork and knife... it's actually entertaining.  \n\nIf you don't want to look like a tourist and actually eat the pizza rather than fidget with it, pick it up with your hands... fold it in half (like a funnel) and put in mouth.\n\nAnyway, this is arguably the best pizza in the world... some of the earliest as we know it... and easily the best in the city.\n\nBtw, I live in Brooklyn and I've never waited to eat here.... says something about the type of people that come here all at once on only two days out of the week.... and create a massive line.", "author": "Adam D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-13", "description": "I finally had a chance to check out Grimaldi's.  By far one of the best pizzas I ever had.  I would go back in an instant if I was in New York City.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-28", "description": "Juliana's is my go-to place in the area, but I arrived too late and there was a line, so decided to try Grimaldi's. I had heard the quality had deteriorated after Grimaldi sold it, but figured it would still be a far cry better than most pizza you can find in the area.\n\nI was underwhelmed: while not bad, the pizza was just average and the service left much to be desired. The people working here are very curt, and it took a very long time for the check to come, or for the servers at this all-cash establishment to make change.\n\nAdditionally, there was a dead bug on my menu when they handed it to me (I think it was a carpet beetle, but a bedbug is not out of the question).\n\nIf you're looking for good pizza, go next door.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-18", "description": "I hate to do it, but I have to give it a 5\nBack in the day this was the first brick oven pizza I have ever tried, and essentially set the standard for all brick oven pizza's I have tried since.\n\nNever wanted to review because of all the reviews already up here, but I took a few year hiatus from Grimaldi's because of all the tourists,  but finally made my way here at night when the line was none existent and took the pie to go.\n\nAll I can say is that there pie is still one of the best", "author": "Leo K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-28", "description": "I love the Pizza here but the wait is really long.  last time my friends and I waited about an hr before we got our pizza to go.  The people who were on line to dine in before us was able to sit and eat before we got our pizza.  Shame they couldn't be more efficient with the process.", "author": "Sabrina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-15", "description": "The first time I ate at Grimaldi's was about 12 (or so) years ago. The second was this past Friday.  When we arrived, I was a bit confused...I initially walked to the wrong place and in my memory, it was a smaller place.  So, a little reseach and I learned they had moved to the new location (just next door to the old) a few years ago.\n\nAt least the pizza fit my memory perfectly!  It was amazing.  The table beside us recieved their pizza just as we sat down.  The guy said to the waiter \"wait....we ordered a small...this can't be a small.\"  The waiter turned and said \"yep...everything's bigger in New York!\".  It was a good chuckle.\n\nWe ordered the pepporoni and mushroom pizza (small, of course), and couldn't finish it all.  It was amazing though.  The fresh basil was a nice touch.\n\nYes, it's cash only, but worth it!", "author": "Bryan B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-13", "description": "This pizza is WAY over raated.  The doughy pizza arrived 48 minutes after we had been seated and we waited in line for over a half hour.  This is a no frills, no service pizza joint.  Sauce is pretty good, the sausage non descript as were the meatballs.  The server wqs enjoying his lunch while we waited for his service.  The seating host is obnoxious, but I expected that.  What I didn't expect was a lousy pizza.  There was not qne iota of char anywhere on the pizza, cheese was really spotty, basil was burned.  For $22 i can do much better.  If you are reading this, please don't believe all the NYers that luv this place.  It's a non friendly venue with some pretty bland pizza.  You can do better...................elsewhere.  Best coal fire pizza is at Boca Lupo in Port Charlotte FL and .Boca Lupo could give these Brooklynites some lessons on pizza.\nDianne\nps - see review by Brandon V", "author": "Dianne D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-08", "description": "Over priced, over hyped and over salted!!!!\n\nI noticed they abandoned their original location and the brick oven that made it special in favor if this larger location where they can stuff tourist pie holes at a faster clip. \n\nBut this is New York. As P.T. Barnum said, there's a sucker born every minute.", "author": "Joseph E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Was visiting the Brooklyn Bridge and decided to try this place out. It's right on the corner near the pier. Nice area. Wasn't busy when we first arrived but then it was packed by the time we left. The pizza was awesome. Love how brick oven crust tastes!! Service was fast \u0026 friendly. We felt very welcomed. Will definitely stop by again the next time I visit NYC.", "author": "Nikki J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-13", "description": "Solid pizza, such fresh toppings!\n\nI came here by myself and realized I have to order a whole pizza...which I did. Mushrooms, pepperoni and sausage. The pepperoni and sausage are freshly cut, big thick chunks of pepperoni (instead of those thing slices) and savory sausage. Mushrooms are of good quality and don't just taste like bland fungi.\n\nThe creme soda was also really good.\nThe service was just alright, nothing spectacular but nothing really bad neither.", "author": "Wilson T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-17", "description": "Yeah the pizza is good. But when the guy outside running the line says it'll be \"15-30 minutes\" and it takes well over an hour just to get a seat it can be beyond frustrating. Not to mention the pizza taking nearly 40 minutes once ordered. Next time I come here I'll make sure my entire day's schedule is clear because who really knows how long it will take. Kind of ridiculous. I don't care how good your pizza is if you can't handle the crowd in an honest and quick manner. Try it once then go somewhere else. The margin of quality is debatable compared to the time it takes to make it all happen. You would think for a business that has been around for so long would be a little more dialed in. Never again would I come here even if you paid me. No pie in the world is worth that wait. WHAT A JOKE. If I could give you zero stars I would.", "author": "Chase C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-30", "description": "Grimaldi's - great location and food.\n\nI dont usually eat pizza, but when I do, I would have a bite on a pepperoni pizza. The pepperoni pizza here in Grimaldi's is good. The topping has good slice, so delicious. The cheese that will melt on your mouth. \n\nOne of the best pizza place in the area.", "author": "Gary S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}