{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-21", "description": "This was pretty damn good pizza. I was told I had to try this place, and it didn't disappoint...\n\nDownsides - \n\n1) Would've been nice if I could just have bought a slice or two rather than a whole pie.\n\n2) Who does cash only?!? Annoying.", "author": "Bryan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-29", "description": "The line was shorter than expected-- about an hour at noon on a Sunday. We ordered a large pie with ham, mushrooms, onions, and extra tomatoes. The sauce was ok, and I like thin crust pizza, but this one was soggy. When I got to the non-soggy crust at the end, I found the crust to be pretty good, but it was overly burnt. I'm glad the wait wasn't longer, because once I tried the pizza, I realized that this place was more about the experience than the pizza. I prefer Pizza Moto.\n\nhttp://www.yelp.com/biz_photos/2ggi1luerd3Mf_C82JvCYg?select=gi4KV5Nvh3nYePNke6QPtw\n\nhttp://www.yelp.com/biz_photos/2ggi1luerd3Mf_C82JvCYg?select=LBk0xaMfjJV0qilmoMJiMA", "author": "Sallina Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-01", "description": "Very good pizza. It comes in a very close second to Lombardi's. The texture of the dough and taste of the tomato sauce is what I like a little bit better at Lombardi's. But still very good here at Grimaldi's. \n\nThe crust comes out with some brunt blistered sections that add a great toasty crunch and flavor. It's then softened with the fresh melted mozzarella, tangy tomato sauce, and fresh basil. The large is about $14 and each topping if I remember correctly was $1.50. I only had pepperoni which was great. \n\nThere was a group of about 15 Korean young men and women at a table. The nice Italian owner asked them what were they doing in NYC. They told him they are a choir from Korea doing some concerts around NYC. The owner asked for a quick song; they sang a 10 second song. They sounded great. About 10 minutes later, the owner asked them for another song. So the group stood around the restaurant and sang a Korean choir song that lasted about two minutes. Wow did they sound great! I didn't think this place had good acoustics. \n\nIf anybody speaks Korean, can you please tell me what does the name of this song mean. It sounded like: au-dee-do. \n\nA good late lunch and a short concert, all under the Brooklyn Bridge. It was cool as hell. The owner gave them all free canolli for their performance. \n\nIf Yelp would allow video I would upload it. If anyone knows how, please let me know. \n\nEven with this large group the restaurant was half full, thus we didn't have to wait in any line. But I would not wait over 45 minutes in the 29º weather for this pizza. That is just too brutal. \n\nTip: If you walk across the Brooklyn Bridge; you don't have to walk all the way to Tillary St. There is an stairway exit on the left as soon as you pass the second tower of the bridge. It leads you to Cadman Plaza E. Then make a right at the end of the stairway, it'll leave you in the neighborhood.", "author": "Juan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-03", "description": "Pizzza Pizzaa!! Expect a super long line if you are going on a weekend", "author": "Abhishek P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-30", "description": "This place always has a line of poor gypsies outside waiting to eat here. Tonight i decided to be a gypsy and finally try it. \n\nWhat a load of garbage. I mean cold, not fully cooked pizza. No joke, elliots frozen pizza is ten times better. \n\nMay i also point out, if you like thin crust, proportioned amounts of cheese and tomato and bread, you will have a better time at 2 Bros Pizza. \n\nJust the fact that it was uncooked is disgusting. This place es una porqueria, y puedem meter la pizza en mi culo.", "author": "Piccolo F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-08", "description": "The line is crazy and the hype around this place is bananas. It was ok....I mean we waited in the hot sun for about 30 minutes. Once we sat down service was average and I wasn't that impressed with the pizza. Also, they only take cash and they don't even serve beer. Beer and Pizza go together like peanut butter and jelly!  And after standing in that sun-- this girl could have used a nice beer!", "author": "Susan D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-03", "description": "There has been a lot of hype surrounding Grimaldi's for as long as I can remember. I never ended up coming though, mainly because of the long lines comprised of tourists and the fact that the other awesome joints that have popped up in Brooklyn are keeping my pizza tooth happy. But we finally ventured out on a recent Saturday night with a few friends and sampled some of the famous NY-style pizza.\n\nI have to say, I guess I am biased and really tend to prefer Italian-style pizza because while our pizza was tasty, I wasn't in love the way I have been with other spots. It is good, don't get me wrong, but it wasn't mouth-watering-kick-ass awesome. I couldn't even really eat the crust (not a good sign). On top of that, it was incredibly hot in the restaurant (on a night that wasn't) and the service wasn't great. The waiters seemed very rushed and didn't have time to even bring us water refills for a while.\n\nI'm glad I went for the Grimaldi's experience, but probably won't be rushing back anytime soon.", "author": "Sara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-01", "description": "I would give Grimaldis 5 stars, but because their service wasn't up to par with their amazing pizzas, I had to give them 4 stars. \nCash only, can't order by slice. However, still amazing pizza!", "author": "Colleen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-28", "description": "Crap. I forgot to take a picture to post because i ate the food too fast! \n\nMy second visit didn't quite top the first visit but it was totally worth it :) I went with a larger group so the wait was little longer. Despite the wait under the scorching sun, it was totally worth it! \n\nDid i mention their pepperonis and mozzarella cheese are the best toppings? I sure think so! nom nom nom", "author": "Jen Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-30", "description": "Sad to say, I was expecting so much more. Grimaldi's is a chain and because of that will go into the chain category of mediocre food that was once good but is sub par at best. The dough is too chewy even though it's thin crust, the basil isn't fresh and used sparingly and the cheese is so damn heavy even though it's fresh.\n\nThere's no way I'd wait in line again to eat here. I'd rather grab street pizza in the city. Also, it's cash only. Really? I've been to hole in the wall pizzerias that accepted cc.\n\nDon't believe the hype. If you want real pizza, go to Lucali.", "author": "Jen R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "The pizza really is one of the best.  Really special. Definitely worth the line. Service was meh and the restaurant operation seemed disorganized and chaotic.  As we waited in line, some locals pointed out that the place next door with the shorter line was opened by a family member when the owning family split, and that the neighboring place was at least as good--and had a liquor license.  Next time we will try there.", "author": "Valerie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-04", "description": "OVER RATED.\n\nCrust = Great\nCheese = Great\nPrice= Egregious\nOlives = Insanely Salty\nWaiters = Awful\n\nIts not bad pizza but for what you pay? Its a joke. Its a tourist trap, its not worth the wait there is better pizza in DUMBO. I mean that as honest as I can say. I suggest looking elsewhere.", "author": "Tushar N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-05", "description": "Their pizzas is good but it's not that good and certainly not worth the wait especially since most of it is the tourist crowd. Skip the wait and head to many many other fine pizza establishments all over the city.", "author": "J L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-27", "description": "To many New Yorkers, especially Brooklyn residents, Grimaldi's in Dumbo has been an institution, but our last visit was a major disappointment.\n\nWe came for lunch on a very cold, weekday, last week (no wait, no line), ordered a pizza with 2 toppings and basil (which should have been included in the basic pie, btw).  The pizza came out with one wrong topping, mushroom instead of anchovies that my out-of-town guest wanted to try.  When we brought it up, our server offered to bring us anchovies on the side.  We declined and preferred to have a new replacement.  The server removed the wrong pizza and we waited.\n\nOur new pizza came out supper dry and chewy with hardly any basil.  On top of that, our bill was over charged, plus a $4.50 tip added automatically, and the bill was unreadable with just numbers and no description.  \n\nFor a $12 pizza, $3/topping, one $3 soda and water.  A $20 lunch for 2 was billed $32.  On any other day, for most people, we would add another 20% tip, which would make it a $40 lunch.  The total seemed alarming, but our server disappeared somewhere.  So we called another server over who explained the bill to us and took off the obvious extra soda that we did not order.\n\nThe bill was adjusted to $29.20.  We gave the server $40.  He brought back $10 without the change.  Aside from the over-charge (on the basil as we got just about 4 burnt leaves which should not be considered a topping), our server forced a tip of $5.30.  \n\nI did not want to nickel and dime further, just paid and got out of there, as the experience has been unpleasant enough for my guest\n\nI can't help but wonder if this has become a systemic cheating scheme.  As I see long lines around the block in warmer weather, let the tourists beware!", "author": "Kat T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-21", "description": "Yikes this place gets worse year after year.  It used to be a place to take out-of-towners to for real New York pizza, now you have a better shot with the corner pizzeria.", "author": "Lori M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-29", "description": "Really delicious, fresh tasting pizza. It's not often you can taste the fresh tomatoes in the tomato sauce. Just really solid overall.\n\nI think the taste of the pizza is largely due to the fact that it's baked in a brick oven, and the technique has been perfected over the decades.\n\nYou can customize your pizza and even split it half half into various types.\n\nThe line was pretty long but moved quickly.  \n\nI also liked that they offered local Brooklyn brews and sodas.", "author": "Andrew N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-26", "description": "I wish they had one of these in Denver, this pizza is amazing!!!  The crust was as thin and crispy as I think is humanly possible.  I love that they put a shaker of garlic powder out on the table - I will have to start doing that at my house now, too.  So good, you won't be disappointed!", "author": "Mia C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-08", "description": "Over rated!!! Flies everywhere, poor service, we order olives, mushrooms and half anchovies, our pizza arrived without anchovies and we were told \"sorry we ran out of anchovies\", how about telling the customer hey we don't have anchovies before making the pizza so we could have the option to add another topping. Oh yeah there need to be warning about the over the top salty olives!!!", "author": "Atif B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-09", "description": "A pizza to remember for years. Distinctive. Spare some time in NY City visit to Brooklyn side and eat pizza here. You won't regret it.", "author": "Nihat Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-14", "description": "Pizza was great. But service could be better. While our server was great, guy watching the line was worse than a mall cop on a power trip. Wait for a pizza was very long. And \"cash only\" policy was very annoying.", "author": "Yuriy U."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}