{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-28", "description": "Pizza is good but be prepared to wait. Check out the East River Ferry while you are down in the DUMBO. The dock is right there and you can take it up to Greenpoint and williamsburg.", "author": "Pickle P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-19", "description": "My boyfriend and I waited for 45 minutes to be seated, and uh ya it was worth it.\n\nThe pizza is delicious. I am not sure it is the *best* because I was raised on great pizza, growing up between Philly and NYC . Also, I appreciate the rubbery-ness of the pizza, and I especially like the bumps. You know, the little knots and bumps in the dough that catch the sauce? Hmm, maybe you don't know...but for the record this place was still delicious sans bumps. \n\nAlthough we waited for awhile, the staff (especially the gentleman with white hair) was friendly and accommodating. My Chicagoan boyfriend loved it so much that he ordered a small pie...to go! Uh yea..he froze it, wax papered it, foiled it, airport security (ed) it and delivered it to his Brooklyn native papa 12 hours later...without a complaint!  I think that  this action alone is indicative of all that is Grimaldi's wonderful :-)", "author": "Jackie N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-06", "description": "Grimaldi's needs no more reviews praising it's pizza so I'll keep this short.\n\nIt's good pizza, it really is, but waiting 30 to 60 minutes isn't worth it.\n\nGranted, there are people that like waiting in lines and hanging out with their friends so if you're bored on a random day then hang out and wait in line for some good pizza.", "author": "Danny N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-30", "description": "I tried several places for pizza during my late June2010 vacation and this place has the whole package. AND I'm from Chicago, pizza town. Grimaldi's is the best. Location, environment, staff. So perfect!\n\nGo here. Oh, and we went around 5pm on a Monday. So NO line at all. Walked right in, no problem. Then when we left, the line outside had 8 people. Nice. \n\nOverall, 5.", "author": "Joel W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-06", "description": "This place deserves at lest 15 stars because I can guarantee that it's thrice as good as any other pizza place reviewed on here. It's a short walk from my place so I go often, but if you are heading here as a destination trip, be forewarned - other people have your sweet idea too and there is often a long line to get in. But, if this is the case, place a to go order and carry a couple of pies down to the DUMBO park.\n\nThe room is not large, and the all male and mainly eastern euro waitstaff make very quick work of it - they are only as courteous as they need to be - economy of service and table turning is on masterful display here. You'll only have a few moments to check out the pics of the many celebrities, or the painting of Brando in Godfather regalia proclaiming \"I'm gonna make you a pizza you can't refuse\", or ogle the many sexy people that eat here (good pizza attracts hotties - who knew?), before your pie hits the table. \n\nAnd when your pie hits your table, you my friend, will be f'in stoked. It's thin crust, brick oven made pie, topped with delicious fresh crushed tomatoes, real mozz, heaps of fresh basil \u0026 yumilicious toppings (their sausage is particularly gourmet \u0026 real good). It's so good that I tend to stuff myself to a near-vomiting point most every time I go. But I love it anyways. Go.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-29", "description": "Waited in line for a half an hour. \n\nThe owner came out to entertain us.... by cat-callin' on the ladies. It made time pass by faster for sure.\n\nThis would be a great trick--- to get guests hungry enough so that anything tastes good. My date was a VEGETARIAN--- NOOOOOOOOOO!!!!! This means I missed out on those delicious, crispy, almost blackened, pepperonis that endured so much heat that they came out looking like little suction cups. \n\nAnother dude at the table who was not a vegetarian ordered the pepperoni and I was offered a slice. I nearly cried in gratitude. It was so, so, good and crispy at the bottom. So much bite and chewiness to the middle, and a touch soft on top--- with bits of super savory, ultra crunchy, salty, flavorful, yum yum.\n\nCome. I think somebody ordered a salad and it wasn't that bad. But don't waste your money like that! Save it for the Brooklyn Ice Cream Factory.  Just eat pizza... and for the sake of heyzeus get the pepperoniiiiii!", "author": "Lisa Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-18", "description": "One review said \"Hands down the best pizza in NYC\".   My response:\n\nHa hahah aha haha ha haha haha ahahahaha ha aha ha hahahahaha  Hooo hoo haaa  haaww  haww hawh ahahahahahahaha!!!!!\n\nIt's NOWHERE NEAR the best pizza in NYC.  In fact, if they were to win an award, it would be the most overhyped pizza in NYC.\n\nYes, Grimaldi's pizza is good.  Like Washington, I won't tell a lie.  However, its level of good does NOT make up for:\n\n* the unbelievable lines you need to wait on\n* the famously very rude service\n* the cash only business model (wake up, IRS!)\n* the claustrophobia you'll feel sitting practically in your neighbor's lap\n\nIf you wait on line and suffer their waiters, and pay cash for this pizza, then you are a fool and a dolt.  If I walked by Grimaldi's and saw there was no line, and had some extra cash in my pocket, I'd go in.  Otherwise, I'd walk elsewhere.\n\nThis is a list of who should go to Grimaldi's:\n\n1) Tourists wanting to experience a NYC institution.\n2) New Yorkers who have never eaten at Grimaldi's before, because ya gotta eat there once to make up your own mind.\n\nPersonally, Di Fara's, John's, Totonno all kick the butt of Grimaldi's.  If you're after good pizza and not just the Grimaldi's institution, then go to one of these places.  You'll be much happier before, during, and after you've eaten your pizza!\n\nOne more thing: don't go here on a date.  The table you'll be sitting at is way long compared to the distance from your neighbors.  You'll be sitting half a foot away from the two strangers to your left and right, and over 3 feet away from your date.  The ambient noise in this place can be more than just a little loud.  You and your date will have to shout to hear each other.  In the meanwhile, the couples who are 6 inches to your left and right also have to shout at each other to hear themselves.  So now you have 6 people shouting across the table to hear each other over the ambient noise.  While this can be fun with friends, it is very uncomfortable (at least for me) on a date.", "author": "Peter S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-10", "description": "This pizza is legit and that's coming from a Chicago-style deep dish fan. I typically don't like the thin crust but Grimaldi's was a nice surprise. The sauce was tangy and cheese was just gewy enough. \n\nThe line seemed endless even a half hour before opening. So we called and ordered ours to pick up. 40 minutes later we were eating a great pie in the park with an amazing view on a beautiful day.", "author": "Matt B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-24", "description": "I am officially addicted to Grimaldi's pizza!  If anyone even mentions the name of this restaurant, my mouth begins to water.  My boyfriend and I always order a large pie to split...and we never have any leftovers.  I recommend going right when they open, especially during the summer, because it gets crowded quickly and you will have to wait in line outside.  You can also order take-out...another great possibility (especially if you are already in DUMBO).  Just a note: they only accept CASH!", "author": "Krista J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-08", "description": "Hubby and I decided to go on an expedition to Brooklyn today.  Now becoming seasoned veterans at queuing for popular food places in NYC, we decided to leave and aim to be there 10 minutes before opening time.  We got a little lost navigating the subway system so arrived 5 minutes after opening time - those 15 minutes make all the difference! Luckily, we only waited 30 minutes in the queue.  \n\nThe pizza comes in two sizes - small (16 inches, yes 16!) or large (18 inches).  We opted for small (and still doggy-bagged a slice!).  We had pepperoni and mushrooms - the pizza is very good here, maybe a tad too wet/soggy.  And you have to eat quick, before the cheese gets too chewy and the crust goes hard.  But if you've waited in line for 1.5 hours, like I suspect many people had to, today, then you're probably going to be hungry enough to eat it quickly! \n\nIt's a really great place to eat, like stepping back in time - the pictures on the walls are really interesting and you can watch the chefs make your pizza.  Good fun afternoon out!", "author": "Sami C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-10", "description": "Half a large pizza sits in my gut as I write this review.  I regret nothing.  I came here with a friend to give this quintessential New York dive a try.  There were a couple of things that struck me about Grimaldi's.  1) As you enter, you walk smack into a wall of aroma.  The smell of the pizza emanating from the oven is amazing.  2) Once the pizza arrived on our table it was literally smoking, like a bowl of hot soup.\n\nAnd yes, the crust was a bit moist.  There's something about the crunch of a thin crust pizza that I really enjoy.  Grimaldi's stripped me of that joy.  I also think the pizza could have used a bit more cheese; what little that was on there tasted fresh, but there simply wasn't enough of it.  These minor points keep me from dishing Grimaldi's a 5 star review.  The pizza was great, but it just didn't sing to me.\n\nAfter pizza, we stopped by the Brooklyn Ice Cream Factory.  Unfortunately it was closed.  But the Brooklyn Bridge was open, and we took an easy stroll across the bridge to soak in the New York City skyline at night, a few snapshots, and a nice conversation between friends.  I'm glad I got to try Grimaldi's before leaving New York.\n\nWith four traditional New York pizzerias under my belt, Totonos, Patsy's, Lombardi's, and now Grimaldi's, I can't say that I know where to get the best slice.  Each pizzeria has their own pros and cons.  I can, however, say that I know what real New York pizza tastes like.", "author": "Tony L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-12", "description": "I can't believe I use to think Il Fornaio had the best brick-oven pizza. Apparently, I haven't seen or tasted the world yet. For now, Grimalidi's, holds the title of best brick-oven pizza. That is, until I travel to Italy, of course. \n\nI enjoyed every bite of their stringy cheese, melt in my mouth, loads of sausage, thin crust goodness served family-style in the cramped dining area filled with tourists. Note: I for one was not a tourist (that's such a bad word that denotes cheesy people with fanny packs). I was a VISITOR. \n\nOh, minus a 1/2 star for their seats--the spring was left open on my seat and it took a bite out of me....\n\nOh, and a shout out and big THANKS to my NY Yelpers who highly recommended this tourist (delete) VISITOR'S joint to me :)", "author": "Sue L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-02", "description": "I am one of \"those\" who waited AN HOUR in line after walking across the 'brooklyn bridge for a few of their 'famous' Pies.\n\nGreat Pizza, definitely enjoyed the Canolis : )\nBut sadly, NOT the best pizza in the NYC. Competition is STIFF!\n\nIf you've never been to Grimaldi's before, grab some friends, prepare for the wait and Indulge, at Least Once-", "author": "Raven M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-11", "description": "If left on a desert island for the rest of my life with nothing but a beach ball for company and only 3 foods that I could take with me to eat for all eternity, Grimaldi's pizza would be one of them.\n\nI used to eat here with an obsession that bordered on fanatical.  One ex-boyfriend even decided to start fining me $.10 for each time I brought up the word \"Grimaldi's\" in conversation.  I think we got up to $1.75 or something like that before he gave it up (don't ask where the $.05 came from).  \n\nGreat pizza, great ambiance, great neighborhood--I always bring people from out of town here for a real NY pizza experience and they are always indebted to me for the rest of their lives afterwards.  It's that wonderful.\n\nCheck out the sunset off the dock down the block before or after your meal.", "author": "M V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-09", "description": "After walking a trek from Chinatown/CityHall in Manhattan over the Brooklyn Bridge (which is awesome) We trekked down into DUMBO (?) and towards the pier for some Grimaldi's.  The line was literally down the block and starting to tip around the corner.  I think we maybe waited about 1.5 hours.... but it was nice out, and while we were waiting we had some Brooklyn Ice Cream Factory ice cream sundaes to hold us over :)\n\nFinally we get to the door, and find out you have to order a pie, and they weren't really clear on where to order your take out.  I was a bit annoyed cause it's your first time there how the H.E. Double HOCKEY STICK are you going to know what their protocol is.  And the waiter/host dude was TOTALLY not having my questions. You would've thunk I was speaking Chinese or something!\n\nFinally decided to take the pizza to the park around the corner, and although it was a nice day, and I was with nice company, the real question is \"was it worth the wait? \" ehhh..... not really.  I'm sorry there wasn't anything particularly spectacular about it.  I think it tasted like every other thinly sliced, meagerly topped NYStyle pizza I've had. It was good, not great, and certainly NOT worth more than a 20 min wait.\n\nBut alas, it's as our lemming culture promotes, you have to at least try it once to say you did.\n\nEnjoy! (hopefully you won't have to wait too long and the weather is nice while you are) btw: tip- go get some ice cream first if you have to wait in line :)", "author": "Pearl H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-07", "description": "For some reason this place tasted better than all the other brick oven places in Jersey, Manhattan, and Brooklyn.  Maybe it's because once you're in their (although cramped), you feel the energy, the joy that you finally made it, or it could just be that it's just damn good!  Place is run down but I think that's the way it's supposed to be and will be forever.  Only negative is the line and don't walk the bridge in the heat...Fair warning!  And if you're not used to NYC service at a pizza place, than you better get used to it!  Most of the time they're not rude, it's just that they're pressured to get it out and get you out!  It's just the name of the game.", "author": "Food L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-18", "description": "Fantastic pizza - thin crust, fresh ingredients, can't find this any where else, but possibly south philly.  Pizza rules the east coast.\nYummy Pizza", "author": "Pug P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "You must try Grimaldi's Pizza at least once in your lifetime. My dining companion threatened to bolt after the doorman screamed at one too many tourists for a number of infractions, but after bribing her with a visit to the Brooklyn Ice Cream Factory afterward, she was game. We shared a sausage and pepperoni pizza, and were pleasantly surprised with how yummy it was. The tables are cramped, you'll listen to many a conversation that you wish you didn't have to, but the pizza is worth it. The lines are out the door for a reason, you're getting a top quality meal for peanuts. Highly recommended.", "author": "Simba J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-17", "description": "In the minds of many exists this quest for the superior pizza.  In a city saturated with pizzerias, the task is daunting, and will ultimately be fruitless. One will come across a wide range of quality, some that impresses and some that depresses.  The often cited Grimadli's borders between okay and good. \n\nIts determination to serve a traditional, New York style margarita might be noble, but it is also lucrative. You get yours as a pie. The restaurant is packed with wide eyed, hungry folk  on hajj to one of the many holy sites of pizza. What they get is a pie with all the right ingredients - but something is lacking. Perhaps not enough crispness in the crust? Too much bend? The tomato sauce was very good. Something about the mozzarella was a bit off, perhaps the milk content was off. I won't pretend to know, and I won't continue to speculate. But it wasn't fantastic. \n\nNo idolatry here. And eff what you heard, I don't care how gourmet, how old school, how museum a place tries to be. The utilitarian nature of pizza requires the ability to buy by the slice.", "author": "Alexandros O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-20", "description": "You gotta be kidding me.....I mean the pizza wasn't bad but what's the hype about? Location? Networking? Customer service? Happy ending? I just don't know\n\nI can't believe I stood in line for that tourist trap. The people inside were nice but it was highly uncomfortable eating in that tiny ass spot. You'll definitely spark conversation here since you eat closely to complete strangers. No credit cards accepted here so bring cash and an extra set of patience.", "author": "Chris A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}