{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-29", "description": "We were seated after waiting for about 15 or so minutes.  We began chatting with our neighbors as they had their dessert, offered to help one of them with her apartment search.  We got our server's attention to order our pizza based on a tip from the neighbor that food is great but the service is not.  The service was not bad but you do need to get the servers attention from time to time to get water refilled.  The pizza arrived as our neighbor's left.  We began enjoying the pizza and stopped chatting.  Our new neighbors arrived but we weren't' interested in chatting.  The pizza had our full attention.  It was obvious why people wait in line for hours for the pizza.  It was delicious--the crust, the sauce and the cheese, all played together in a balanced harmony, simply yummingly yum.", "author": "Lara C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-28", "description": "I've lived in Dumbo for a while, but the lines here and the flocks of tourists always threw me off. It wasn't until a rainy week-day afternoon when I finally went to Grimaldi's with a friend from out of town.\n\nGrimaldi's certainly isn't bad, but it's nothing exceptional by any means. The crust on our pizza was a bit too burnt, and the skimpy extra toppings were barely worth paying for. The flavor was fine, but mediocre. I just don't understand what all the fuss is about.\n\nThe service was also pretty poor, and the silver wear a bit dirty.\n\nWatching two South Korean tourists down a pizza in less than five minutes next to us was pretty amazing, though.", "author": "Emily C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "So apparently you're not supposed to order white pizza in New York...\n\nGreat pizza! If you're one of those people that needs to have that slice of New York pizza, this is the place to go. It's definitely in my top 5, but not my number 1. It was very tasty, sauce was delicious, and all the toppings tasted fresh. It definitely stands towards the top of all the pizza places in New York, but it's not the BEST. \n\nDefinitely a nice ambiance, the building has great architecture.\n\nBOTTOM LINE:\nIf you're looking for New York pizza, give this place a try!", "author": "Stephen C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-09", "description": "Service was unfriendly, pizza was okay,slightly overrated..place was very cramped, not an inch distance between tables\nNot worth traveling to Bklyn but if you happen around the area it's worth the try.", "author": "Mr F G And Mrs M S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-10", "description": "Though there may be better pizza in this borough, Grimaldi's pizza and its location in DUMBO is pretty classic. \n\nDO's: \n- Get extra basil. It normally only comes with about one leaf per slice.\n- Bring cash. (It's not expensive, though-- $14 for an 8-slice large)\n- Be patient in line. Send friends over to get ice cream from the Brooklyn Ice Cream Factory, perhaps?\n\nDON'Ts: \n- Don't get the olives. They are strangely sweet and tangy and look like tiny, dried prunes.", "author": "Saori E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-02", "description": "AWESOME pizza, went early-ish (4-5pm) on a Friday and with their new place there's TONS of seating. Maybe waited 15 mins. Easier to get in if you have two people in my opinion. Pizza is very affordable and the location is nice you can walk the promenade afterwards. Combined pricing, atmosphere, and most of all TASTE makes this the best pizza I've had. Will definitely go a couple more times this summer!", "author": "Annie Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-01", "description": "Pizza is good but not worth the wait. I think pizza in general is hit or miss depending on your taste.", "author": "Zakie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-23", "description": "Delicious pizza!!! \n\nThey were so accomodating to us - as my mate wanted a white pizza and I wanted a normal - so they were able to do half and half.\n\nI loved how proper thin the crust was. \n\nMy only change would be that I like my sauce to have a bit more flavour to it - not just pure tomato.\n\nIt was kind of fun being able to stan din the back and watch them make the pizza.. and it was nice and warm over there, too :)\n\n\nNote: Bring a book or something. You can mooch from the neighbour's WiFi for a while, which is good. We were 66 in the queue - but they were rather speedy. We waited ~40 minutes.", "author": "Kristin Leigh M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-29", "description": "I grew up in NYC but have resided in Chicago for the past 12 years.  When I heard that Grimaldi's has the \"best\" pizza in NYC, I knew we had to make the trek.  On our recent visit, our girls and I crossed the Brooklyn Bridge during a hot June day. It was absolutely worth the trek! We got there at 11:15 AM so we were the first in line. The doors were actually shut closed and I was afraid that they weren't open for lunch.  Luckily, a sweet employee named Ralph reassured us that they open at 11:30 AM. By11:20 AM a line had started to form.  I think as long as you get there before Noon for lunch, there will only be a minimal wait. Now for the PIZZA...\n\nLet me start by saying I am NOT a sentimental person but I actually shed a TEAR when I bit into our sausage pizza.  My girls said I \"cried a river\" but it was just 2-3 tears of sheer joy.  It's simply pizza perfection - crust is nicely charred (not burnt) and has the perfect chew to it.  The cheese is fresh mozzarella and the ratio to cheese:sauce:crust - again, perfection! Service was OK and No credit cards. We had a large 18\" pizza (8 slices) and 3 sodas for $24.  I think it's a bargain for such amazing pizza. Finally, if you have kids with you, you can bribe them with the promise of ice cream from the nearby Brooklyn Ice Cream Factory.  Not nearly as memorable as the pizza but it will keep them from whining about the walk.", "author": "Kim K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-25", "description": "The pizza is decent despite what toppings you get.\n\n I feel like for such a famous place they should upgrade on their facility and allow patrons more privacy. I literary had guests at other tables taking pictures of my pizzas :( I felt so uncomfortable. I don't even know if the wait is worth the pizza.\n\nThe skinhead taking our order was not the friendliest and I wondered why anyone serving such a diverse group of staff would hire him!\n\nIn summation the whole experience is unpleasant from the other people waiting on line to the service. There are other brick oven joints in NY forreal!", "author": "Allison D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-17", "description": "No question, the best pizzeria in the five boroughs. When my wife and I lived in Manhattan, this was always our go-to pizza place. Prepare for long lines to get in and remember it's a cash-only place, but it's the best pizza I've ever tasted. The ambiance of being beneath the Brooklyn bridge is fantastic. Try their white pizza!", "author": "David S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-06", "description": "Not worth the 45 minute wait outside and the additional 45 min wait once seated.  Thankfully it was nice and comfortable day out so at least the weather was on our side.  Once inside, we witnessed a family of 5 leave after they got seated when they were told that it would be \"no more than 45 minutes wait\" for their pizza.  If we weren't so hungry and hadn't already waited close to an hour outside, we would have left, too!  \nService was nice enough, but seemed stressed and just ready to get you out of there once you were done eating type service.  We didn''t mind feeling rushed though.  After our last slice, you couldn't get us out of there fast enough!\nWe chose to come here because a friend told me it was the best pizza in New York and that we should definitely give it a try during our trip.  She warned us about the wait, but she also said it would be worth it.  Well...it was not.  The pizza is good - don't get me wrong.  It's thin, cooked in a brick oven and tastes fresh, but just not the wow factor that we were expecting.  So yes, this is just another tourist trap (located \"under the Brooklyn Bridge\") that we didn't manage to avoid.", "author": "Irene G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-01", "description": "My son took me here for some \"new York\" pizza... Great location! Beautiful building! Pizza was only ok. It had basil on it... very nice. Otherwise it wasn't that good. Some of the staff just had bad attitudes... but I guess it's ok cause we are in Brooklyn. Met the boos (Ralphie??) super nice.\nI won't be back...", "author": "Billy And Annie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-05", "description": "ABSOLUTELY worth the wait! It's a necessary place to try while in the Brooklyn, NYC areas. You won't be disappointed.", "author": "Dmitry R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-26", "description": "Great New York style pizza in Brooklyn, worth the trip.  Son and I ate a large pepperoni and it was delicious.", "author": "Steven S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-15", "description": "Unfortunately I think the quality of Grimaldi's is slowly going down as the customer base continues to increase, lines remain long and the pressure to turn out pizzas quickly becomes an issue. Our pizza hadn't been baked well, the vegetables were still raw and it was lukewarm. We waited so long in line and were starving by then so ended up eating it. Ordered the cheese with mushrooms and onions. The topping combination was good but it could have been baked more thoroughly. Also lacked salt. Once we added enough oregano and spicy red flakes, it was easier to eat.", "author": "Samantha G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-13", "description": "Calzone had no taste. I asked for tomato sauce and they poured some cold canned sauce into a cup and served it to us. They tried to sell me a cold pizza in the package for 15 bucks when I said I'd like a regular cheese to go (to give it a second chance). This girl I brought from bangladesh (which is a third world country) told me I needed to try the pizza there. So embarassing. Also since we had two slices on the spot, the rest was placed in individual slices and stacked in a paper bag like garbage instead of a box. It was befitting at least. Also the \"regular cheese pizza\" had spinich leaves in it. The  Never again. Pure tourist trap.", "author": "P M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-10", "description": "Yes its touristy as heck and yes its busy always, but its THAT DAMN GOOD! Honestly, the best Pizza I have ever had. Service is great, they must have to try hard since its packed all the time but they do a great job. No slices and cash only, there is an ATM upstairs so don't stress it. Great quality, fair pricing and amazing flavors!!", "author": "TC R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-27", "description": "If you want doughy average pizza and want to wait for 2 hours, then be seated elbow to elbow, go here. If you want much better pizza, go to Lombardis in SoHo. Been there twice. First time by choice, second time with guests who insisted..never going to be a third time.\n\nOther pizza places (conveniently located in Manhattan and worth trying)\nEataly and Motorino. Pizza at whole foods is better than the stuff they sell you here. If you want the best pizza in NYC, go deep into Brooklyn for DiFaras or Lucali", "author": "Rahul J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-30", "description": "Holy smokes a 1 hour wait?! The take out and dine in line are the same. Kind of odd but that's how they do it here. \n\nStraight to the point. My comrades and I were seated upstairs and handed some menus. The place was packed! I guess there was a bit of confusion who are server was because it took roughly 20-25 min until I had to get up and ask who our server was. One must try is their Brooklyn sodas. I had the root beer and sure enough it was def a root beer I haven't tasted before. Between 4 people we ordered a sausage, pep, mushroom pie. You can't order slices here. But the large pizza was perfect for each of us to have 2 slices. \n\nThe cheese is super cheesy and fresh. I loved the basil aroma. The pizza itself and crust is super thin. I like thin crust pizza but I wish it were more crisp with a crunch. \n\nI gotta admit, it was certainly an experience coming to Brooklyn for some pizza but I can't say it was the best I've ever had. I guess my heart lies with Cali for Pizza My Heart which by the way sells pizza by the slice.", "author": "Angeline H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}