{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-26", "description": "Lived in Brooklyn my whole life but have never been here before, as such I put this place on my bucket list. Finally got a chance to come down here and try their famous pizza.\n\nCame here with  my family around 11 p.m., the line was looongg. I considered leaving because I just hate waiting in lines, but was persuaded to wait it out and glad I did. After you take one bite it is clear why there's a wait. I don't think I have ever had better pizza, anywhere! \n\nSurprisingly, the service was exceptional at the place. Usually when you are at a high volume place like this and the place is known for the quality of the food, the service is not of top priority. But I must say I was pleasantly surprised by the service. We ordered 2 cheese, 2 sausage, ans 2 pepperoni and I expected to wait an hour because there wasn't an empty seat in the house. Our food was served hot and delicious in about 20 minutes. I absolutely loved this place, and glad I finally tried it out. Will definitely be back here again, and again, and again.....you get the point.", "author": "Blake B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-09", "description": "This was my first \"real NYC pizza\" experience, a few years ago, and I've inevitably wound up here time and time again when showing out of town friends around.\n\nI like to walk my friends across the Brooklyn Bridge, usually either after a meal in Manhattan or before a meal in Brooklyn, it's good to either build up an appetite or to help digest a meal. Also it's beautiful. Also it's free.\n\nLocation, location, location -- that's why Grimaldi's is always packed. And it's because of it's geographic convenience that they've earned such substantial profits over the years that has enabled them to move from their old location to their current fortress.\n\nOther than \"convenience,\" and having a \"memorable NYC experience,\" I cannot recommend the pizza at Grimaldi's -- it's just not very good, it's okay, it's fine, but there's so much better to be had elsewhere, all over the place, literally everywhere.\n\nI understand that a lot of people come through these doors, and the waitstaff are probably perpetually exhausted, but on a recent visit (this weekend) I came here with three friends, and the things which came out of our waiter's mouth were not just extremely unwelcome, but also incredibly offensive. Which is really unappetizing.", "author": "David L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-07", "description": "Grimaldi's in DUMBO always have long lines in the summer. I have watched them move from the tiny brick place they used to be and moved two doors down to the corner of the street into a bigger place. The pizzas are made fresh in their coal fire ovens even in the 98*F temperatures on a hot New York summer day. They don't have slices for sale, only a whole entire pie! Their mozzarella cheese is fresh and delicious on their pizza with like a basil/bay leaf on every slice! It hits just the right spot!\n\nI came here again on a cold and rainy march day and there were no lines! The pizza is just as good and melts in your mouth cheesiness! Amazing! We ordered a large pizza between the three of us with pepperoni and Italian sausage. The pepperoni were delight compliment to the fresh mozzarella cheese!", "author": "Sandra C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-28", "description": "Recommended by friend as the best in Brooklyn and waited in line for 1 hour. However, all that anticipation was let down when even listed in menu, they said not available for beer or wine, no personal pizza, and no pesto. The pizza was oookay.", "author": "Uday S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-16", "description": "I am so glad that this was delicious pizza...I was truly thinking it was just going to be another tourist attraction. I was wrong. At least on this day the food was great and service was attentive. The overall ambiance would make me come back. \n\nWe ordered a large pizza with fresh garlic, onion, mushrooms and black olives. It came out in a timely fashion and was piping hot. The sauce was yum...not too sweet or tangy. The crust was golden brown and mostly crispy. Also, the pizza was not overly cheesy and heavy with oil. They use fresh mozzarella which is not oily at all so the pizza seems less heavy. \n\nWe were seated upstairs by the window that overlooks the making of the pizzas. We were able to watch them prepare everything. It was a fun experience. The staff were nice, competent and quick. Everyone was smiling and helpful. \n\nWe will be going back and also trying and comparing other locations :)", "author": "Dina S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-18", "description": "The pizza is definitely good. You won't be disappointed in that it is tasty, delicious and satisfying after the four hours you just spent waiting on line for it. The wait, however, is ridiculous and unnecessary. \n\nIf you want a good slice of pizza in NYC, just walk to your local pizza joint and order one. While the pizza was tasty, it's not worth the time standing in line due to an abundance of very good pizzerias all over Brooklyn (and NYC in general).", "author": "Maya T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-27", "description": "Huge name when it comes to New York pizza so had to visit. The pizza was well priced and amazing taste ! I was not entirely blown away but definitely the best pizza on my trip. \nIt's a fun place , can see the the pizza getting cooked right in front and the location is close to Brooklyn park which is an amazing walk !", "author": "Adhirath S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Best pizza in New York. Lombardi's is pretty good, but doesn't stand up to Grimaldi's.", "author": "Chris A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-14", "description": "The pizza is good but definitely not the best in NY. \nThe service is subpar. Waiters gravitate to whomever they want and will overlook you if they deem you not worthy. That is not cool after you've spent an hour on line outside. \nThe owner however is very friendly and it was nice to talk to him.", "author": "Q H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-23", "description": "I tried both Grimaldi's and Lombardi's and by far Grimaldi's DESTROYS Lombardi's. Best pizza I had in New York City. \n\nCash Only.\n\nThis is perfectly brick oven cooked think crust New York style pizza...but it's still slightly doughy to where you can fold it in half! We got pepperoni and sausage...BOMB. Nothing really more to say here. Try it with a Brooklyn Lager. \n\nA must see when you visit New York.", "author": "Greg D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-01", "description": "This place had a 45 minute wait, which would have been ok if the owner had not been rude to us when we got to the door. He took several larger parties in ahead of us, without a word or explanation to us. Servers were also rather short with us and unfriendly. \n\nThe food however was delicious. Great pizza and AMAZING canoli.", "author": "Leah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "Judging by the other posts, if you don't get there at the right time you'll have a long wait. Fortunately for us we walked in \u0026 were seated right away. Pizza was great, cannoli \u0026 espresso were awesome. My only complaint is they only have bottles sodas. Didn't really matter to us though because we had water. Highly recommend. Take the subway to Brooklyn, eat at Grimaldi's \u0026 walk back across the Brooklyn Bridge.", "author": "Joey H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-14", "description": "Positives\nGreat location near the Brooklyn Bridge, and inside a refurbished warehouse.  The interior and exterior have a classic Brooklyn \"vibe.\"  We ordered two pizzas, one with sun dried tomato and basil, and the other with sausage and pepperoni.  The crust has a nice char from the genuine brick oven.  \n\nNegatives\nWhile the food is good, it doesn't justify an almost hour wait in the cold.  One server ushered us inside, then reseated us because he had to seat a large party.  We waited another 15 minutes in the interior stairway.  While I understand they were doing their best to accommodate the large crowd, I wouldn't wait for the pizza again.\n\nOverall\nGood food, but overrated if you have better options.", "author": "Shirley F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-19", "description": "I always take my friends and family who're visiting New York City across the Brooklyn Bridge, and we stop by the pizzeria since it's \"famous\". However, I don't understand what the hype is all about. Maybe I'm biased, but I've had better pizza in Staten Island without the wait outside...", "author": "Christina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-31", "description": "I love everything about Grimaldi's, on the reals.\n\nAtmosphere:  We were there on a Monday night around 9pm and there was still a line outside, but we waited about two minutes before the owner took us in and seated us. Tight space with tables close together. I'm usually prone to eating in intimate settings but I've never been so happy to carry on conversation with other strangers visiting New York. \n\nFood: I've always been a fan of the simple pizzas, and Grimaldi's is just that. With special dough and cheeses from a billion degrees-heated oven, these pizzas are a taste bud's calling. I was with a group of four including myself and we shared a small White Pizza (no sauce) and a small Regular Pizza (with sauce). Each were six slices, so we each had three slices and were satisfied (and we were all hungry as well). The pizza comes out fast too. And no worries, if you like toppings you can add stuff as well. The price is also wonderful when split. Definitely worth every penny, folks.\n\nService: The people here talk to you like they see you all the time. They like to carry conversation and it works well with the atmosphere so I didn't mind it at all. I only wish I lived in New York so the workers could ACTUALLY know me.\n\nGranted, I didn't get to venture to the other well-known pizza places, but alls I know is Grimaldi's was nothing short of amazing.", "author": "Tiffany O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-04", "description": "We came around 1 pm on a Saturday and we were seated right away. Our food came to us quickly and it was fresh and so delicious--the pizza crust was chewy and flavorful and had the best crunch. A small was more than enough for my husband and I. We will definitely be coming back!", "author": "Katie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-17", "description": "The day I discovered Grimaldi's was the day when my world of New York City Eating was expanded.  I couldn't imagine as a kid growing up in Brooklyn that a simple slice of Pizza could be taken to this level of expansive rapture.\n\nWe've come back since a few times and it's always been amazing.  The sauce is always fresh made with a burst of tomato taste and the fresh scent of basil leaf, the cheese isn't some store bought straws but slices of fresh mozzarella that melts on the surface and gives it a nice thick chewy texture, the pizza is made in a wood burning stone oven and taste like nothing the industrial pizza oven.\n\nThe only time that I've ever had a slice that wasn't perfection was when we sat too close to the AC and the pizza got cold, otherwise it's always been great.\n\nI highly recommend coming to Grimaldi's to experience the grand tradition of the pizza here, you'll be glad you did.", "author": "Kwai L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-28", "description": "Came here late afternoon on a Saturday and saw a line, maybe 20 deep. Friends and I hummed and hawed over waiting it out, or checking out the fairly busy Julianna's next door. I'm glad we did wait because the line was moving briskly, and we were seated after 30 minutes (a short nothing since it was a weekend and Grimaldi's for Pete's sake!). Inside, the pizzeria is brightly lit and toasty, with red checkered tablecloths and polished wood. \n\nThe three of us shared a large pie with mushrooms, onions, olives, Italian sausage and ricotta cheese. Though the pizza was slightly soggy from tip to a third of a slice in--maybe due to the ricotta?--GOD! That stuff was doing all sorts of good things in my mouth. Loved the slightly salty and chewy dough, all the way up to the crunchyness of the crust. Get the ricotta and olives! I am not a huge fan of olives, but the olive toppings here are slightly chunky and briny, and complimented the pie so well. Kinda went crazy over it. Minus one star because of the price. \n\nDue to a slightly large brunch at Alice's Tea Cup earlier, I was pretty weak-sauce and only managed a slice and a half, but I'm sure I want a whole pie all to my greedy little self the next time I'm up for a trip to dumbo.", "author": "Jasmine J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "If you want to eat here, you better prepare to stand in a long queue. Always packed with people, this has a huge waiting line not only to get in, but also once u order ur pizza. The basic pizza comes in two sizes small or large with tomatoes, Mozarella and Basil. The rest u can add in from of toppings for anywhere between 2$-4$ toppings. We had olives, mushrooms n onions added onto our pizza. The pizza came hot and bubbling with fresh Mozzarella. The sauce was fresh and tangy. The olives were a bit salty!", "author": "Neha S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-15", "description": "This was the first Grimaldi in NYC. My husband's co workers recommended us to this place to try out their pizza and so we did. We arrived 20 minutes after they  opened on a Friday..and there was a line. We didn't have to wait too long since it was just the two of us and we were okay sitting at the bar. The downside of us sitting at the bar was it took forever for the waiters to come get our order. We sat for about 10 minutes before we even got our menu. No one came by to check up on us..it was only until another waiter walked by and asked if we got a menu  yet and we told him no then another waiter gave us a menu that was taken from another table. It took several more minutes for them to take our order. The pizza came out pretty quickly though. It's a simple menu..you order the type of pizza and the toppings you want. Cash only and no slices. We had the single regular pizza with 3 toppings.. The toppings are what drove the price up. We had it with italian sausage, onions, and mushrooms. Both my husband and I thought the pizza was okay. It wasn't spectacular. They also have no A/C so we were sweating inside. It took awhile for them to give us our check...in the end we just left our money on the bar and left. \n\nService was a bit lacking, pizza was okay... will try Lombardi's the next time we're in town.", "author": "Susie C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}