{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-11", "description": "Over hyped pizza. The crust was not particularly good and the salsa not even, so we had Alice's without any.", "author": "Jaime S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-22", "description": "Ok, so I didn't conduct my full due diligence on this place. I skimmed a couple of my yelp family reviews and obviously didn't see that the line for Grimaldi's starts OUTSIDE....down the SIDEWALK, and curves the CORNER. I didn't mind since we had a great view of the Brooklyn Bridge and all the passerbys. However, you definitely need a snack for your wait...which I had time to go to the ATM (they only take cash), purchase us some waters and something to smack on until we were seated. I had that much time. The line moved pretty quickly though. \n\nThe menu is pretty simple - small and large, cheese and add your toppings (ranging from $2-$4.50 per topping). The wait was well worth it, minus the black olives. They were sweet and salty olives which I just couldn't get with. Other than that, the pizza was really good. Waiting is the theme of this spot...Be warned... after a long wait outside, a couple of bottles of water, there is only one bathroom in the joint, which was actually pretty clean, my OCD self was impressed.", "author": "Jill S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-12", "description": "I have to say I think that Grimaldi's is a bit over rated. The pizza is good, but I don't think it is worth the long lines and tight seating. It also tends to be a bit on the touristy side.  I have eaten there a few times and each time the food was very enjoyable, but unless you are a group of two the wait is really not worth it.\n\nI pass by Grimaldi's every Sunday on my way home and there is always a line down the block.  So, they are doing something right.  I would not disuade anyone from eating there, just be prepared. Also, they are a cash only business, so make sure you bring some... if you don't they do have an ATM in the doorway, so at least bring your bank card.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-01", "description": "The summer before I turned 21 I took a trip to New Jersey/New York when my sister was still living there and she took me to all these food places in NYC. One of my cousins also happens to live in Brooklyn, so when we went up to visit her and check out her new apartment we also decided to go eat at Grimaldi's. When we got there the line out the door and wrapping around the sidewalks. Obviously I've had pizza before, so my initial thought was that this must be some really good pizza if out of all the places to eat in Brooklyn, this seems to be the go-to spot. I had no prior knowledge of Grimaldi's, so really I had no expectations going into this \"food-venture\" with my sister and cousin. \n\nBeing the tourists that we are, of course we had to take pictures to document the line and standing in front of the Grimaldi's sign. The staff was friendly and one of the guys saw what we were doing and completely photobombed a picture of my sister. An hour or so later, we were finally seated. It is small and cramped and you do feel like you're touching elbows with the people at the next table. It wasn't something I was entirely used to, coming from Texas where everything is always bigger, but honestly I didn't care because I was starving at that point.  We let my cousin order the pizza or the \"pie\" as they call it and she decided on a large margherita pie with extra basil and garlic. Even though it felt like forever, our order came out fairly quickly despite how busy they were. That first bite? Let me tell you about that first bite. Well, I don't know if I can even give that first bite an accurate description to justify how good it was. So many different flavors all at once, the mozzarella cheese, basil, tomato sauce and garlic made for a great combination. The basil gave the pie a refreshing taste, something I'd describe as waking up almost every sense in your body. There is something about their garlic that is absolutely addicting. So addicting that we had an additional 2 large pies of the same kind. Did I mention that it was just my sister, cousin and I? It wasn't even a matter of being past the point of starvation and having to stand in that long line. I know you'll eat anything when you're starving and I probably would have, but it's even better that the food was definitely worth all that waiting. \n\nI haven't tasted or had pizza the same since then. Oven-bricked pizzas are the best and every city should invest in that ASAP. When Grimaldi's came to Texas, it wasn't quite the same. But nothing is ever as good as the original. Still, I do go to my local Grimaldi's from time to time and pretend I'm really in New York with the bridge just right down the street.", "author": "Chelsea S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-05", "description": "walk the brooklyn bridge and wait 50 minutes* to eat at grimaldis pizza: check\n\ni love when out of town friends visit me; thank you, jstar - you r0x0rz!  because of you, i got to cross one more thing off my list of touristy things to do in nyc.\n\nthe line moves quicker than youd think it would**, given how far down the block it reached.  and surprisingly, the service inside is quick though not rushed.  and the pizza pretty tasty too, even with all the hype it got before we got there.  though ill prob not visit again.  well, until other (or the same) out of town friends come to visit. \n\n*we tried to be slick and decided to order take out.  until we saw the big sign on the door that read, \"take out orders must wait in the same line.\"  fail.  \n**hope you dont mind being seated with strangers at the same table, cause that's how they keep the line moving.", "author": "Pearl O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-10", "description": "Grimaldi's: A Cautionary Tale/Review\n\nYou have been warned in advance- there's a buffer zone of about 10 minutes when the pizza at is mindblowingly delicious.  And I mean that in the dirtiest way possible.  After the first bite, all of the pleasure centers within my brain were sent into overdrive by the smooth stings of mozarrella, crispy woodfired crust, and naughty garlic kick.\n\nMy date: So how do you like the pizza?\nMe (trembling): I... I need a few minutes alone with... yeah...\n\nHe seemed amused, as a native of Brooklyn who had frequented Grimaldi's enough times to eat their pizza and be a coherent human being.  Lucky bastard.  \n\nI, on the other hand, grew up in the suburbs of Maryland on Papa John's pizza.  I had NO IDEA how to form words with my mouth when there was a sexy sauce-y party going on inside. So I resorted to the old standby of Smiling And Nodding to my dinner partner while I scarfed down the first two slices.  Unfortunately, the uber-thin crust pizza was getting cold at an alarming rate.  I made the mistake of taking a few seconds to laugh and was punished with a horrifying bite of congealed mozzarella.\n\nMe: NOOOOOOOOOOOO!\n\nIt's an intense race against the clock at Grimaldi's.  Next time, I'll come with a stopwatch and a 3rd person to pick up the pleasantries as I chew.", "author": "Lynn F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-02", "description": "Let's do a little opportunity cost analysis:\n\n- flights for 2 from SFO-JFK = $350 x 2 = $700 (good deal)\n- hotel = $250 x 4 nights\n- towncar two ways from JFK = $100\n\ntotal: $1800 for basically 84 hours in New York.  That puts the value\nof your time at $34/waking hr.\n\nSo the cost of two people waiting in line at Grimaldi's for three\nhours?  Over $100.  Wouldn't you feel stupid basically paying $120 for\na large pizza at this place?  Well, that's what you're doing...", "author": "Gabriel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-22", "description": "Yeah, it damn well better be five stars. We waited for a YEAR to eat here. We had to order two drinks apiece... one to chug, one to sip, just to get over the waiting (in 45-degree weather) part. \n\nSeriously, though, by \"year\" I really mean \"about an hour, give or take\" and it was well worth it. Don't go to Grimaldi's if you're claustrophobic, because you're going to be shoved into a booth next to someone you've never seen before in your life, and your butt will actually touch them when you're squeezing in and out of your seat. \n\nIt's also important to know that this place is CASH ONLY (read: shady). Unfortunately, we didn't realize this until we'd already waited through about 80% of the line. Thankfully, our hostess had some cash with her. None of us really did. And honestly, by the end of that wait, I'd have just gone ahead and eaten anyway and worried about settling up with them later. A girl doesn't wait for an hour + for nothing.\n\nGrimaldi's is charming. It's nestled underneath the Brooklyn Bridge, just a block or so from Fulton Ferry Landing (wonderful views of the Manhattan skyline from here) and a stones-throw from a lovely little ice cream shop. We ordered a pie with mushrooms, olives, basil, and garlic. It was heavenly. I would do this again in warmer weather.", "author": "Julie U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-07", "description": "My suggestion? Hit this place up during the off hours. Unless you are willing to wait on a line that reaches down the block, I would say avoid going there on the weekends! I've tried one weekend to show up an hour before but there was already a line forming! \n\nThere are small and large pies and a variety of toppings to choose from. They typical pepperoni, sausages, mushrooms or ones like capers, anchovies, onions, and extra cheese/tomato/basil. As many or whatever your heart desires. \n\nAfterwards, its suggested that it would be nice to roam the area for a post-meal walk with your company.", "author": "Helen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-07", "description": "I tried a regular margherita pizza, and it was soggy.  I don't really get the hype.  Maybe I got a bad pie?  Bad pies happen.  It came out fast, and I didn't have to wait in line because I came at 9, so it wasn't an all-bad experience.  I'll come again to give it another shot.\n\n-Edit: so I came here again because a visiting friend wanted to try this place.  It was a lot better this time!  We came around normal lunch time during a weekday, so there was no wait.  I hate that they only take cash.", "author": "Sammy B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-13", "description": "I've been on the hunt for NYC's best pizza lately and since today was a nice day, I made the trek out to Old Fulton Street to experience Grimaldi's for the very first time. \n\nThe line was about 30-40 people strong but moved relatively quickly. Once inside, we were seated in very tight quarters. The people sitting on the left were German tourists and the people to the right were debating last night's poker game moves. THAT closely seated. \n\nReactions once pizza came:\nMom: \"It tastes like Matzah.\"\nBrother: \"It only tastes good because I've been standing an hour to try it.\"\n\nI happen to agree with them. If you're looking for delicious pizza, you're better off going to Di'Fara's in Brooklyn or Joe's in the city. \n\nP.S. The ice cream shop on the waterfront where many patrons go for dessert is closed on Mondays, plan accordingly.", "author": "Jane D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-17", "description": "By far the best fresh tasting pizza Ive had. It is a very long wait, we waited close to an hour but let me tell you the wait was nothing compare to this amazing pizza. The servers were very attentive, very helpful and friendly. I live in Florida and I will be surely to come back..", "author": "Paola H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-05", "description": "I met up with a old friend and came here after we walked on the Brooklyn  Bridge.  Came here around 5pm on a Wed and no lines, got seats right away.  The pizza was good kind of soft in the middle.  I was expecting more of a crisper crust.  It tasted fresh though, definitely different from the pizza chains.  The prices were great $16 for a large and $2 for each topping.", "author": "Kazuo O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-05", "description": "The line was really long, even at 9 pm.\nGranted, that was because I had a party of 10.\nI was starving after my trek across the BK Bridge but Mr. Grimaldi certainly knew how to whip his patrons into order. \nOur lines were straight and the wait long but efficient.\nOne thing was, he wasn't able to seat all of us together but then a table of ten opened up right after we sat down at separate tables. \nOh well. Shit happens.\n\nThe pies were homemade and delicious. \nI love thin, crispy crust and bubbly cheese.\nThey had a lot of topping options and everything is made to order.\nThe toppings were fresh (we got a meat one and a plain cheese one) and the it was a nice ratio of toppings to crust. \nNothing in the world satisfies me more than a great slice of pizza and a nice diet coke. \n\nI sound like a man.\nMinus the \"diet\" in coke.", "author": "Lianne Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-03", "description": "I've been to Grimaldi's many times before and had always enjoyed the experience.  So when I tried to take a friend there the other day, I was surprised at how rude the elderly man out front was to me.  Seriously, I'm a nice midwestern girl and I hadn't even started our interaction - he saw me standing around, looking at a sign saying that the take out line was the same as the regular line, and trying to figure out if I should wait or not, and he asked if I needed help.  When I reiterated the take out policy and just asked him to confirm that it was true, our conversation devolved into him asking a series of pointless questions meant to make me feel stupid - \"What does that sign say?\"  \"What don't you understand about it?\"  \"Oh yeah? How does it work at other pizzerias?\"  \"Have you ever had a pizza here?\"  \"What do you think people come for?\"\n\nThere were plenty of opportunities for him to chill the fuck out and just say, sorry we don't do take out because of xyz reasons.  And that would have been awesome.  But belittling your customers is out of the question.  Maybe it was a bad day for him, I noticed him barking at other people while we were standing in line.  But I have a feeling that he's just a crusty old asshole who doesn't give a shit about what people think, because he'll always have a long line outside his pizzeria.  Considering Lombardi's is just as good, I'll be taking my business there from now on.", "author": "Cristina F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-19", "description": "You haven't tasted pizza until you had grimaldis. Some friends, some pizza, some wine, with a lover the best time u can have!", "author": "David D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-30", "description": "I'm giving this place two stars because I don't like sitting elbow to elbow with strangers. There is NO space between tables. Some people don't mind that, I guess. I do. \nIt was 1pm, we waited for about 40 minutes for a table. It took the waiters an additional 20 minutes to come and take our order. People who arrived ten minutes after us got their pizza before we did. \nThe people who sat next to us (more accurately inside us) got a charred pizza. It was black and smelled burnt. I have no idea why they didn't complain. \nThe atmosphere was so loud, busy and tense, it almost seemed appropriate if a waiter would pass and slap people on the back of their neck every once in a while. \n\nThe pizza was good, but it wasn't the best we've ever had. I wanted to like this place, but I definitely wouldn't recommend it.", "author": "Daf M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-02", "description": "Would I wait for one hour to eat this pizza again? Maybe. Yes it is better than most pizza places I have been in. The waiting is not what bothers me, what bothers me is how they decide to seat people. He skips around and he was seating groups of people based on the nummber of people in their party. I was with a friend, but somehow 8 other groups of 3 or more who were all behind us in line were seated before us.\n\nIt is a testament to the pizza they serve that despite the wait, and the weird door man, that I actually consider coming back to this place. What makes their pizza special? It's the crust. It had a distinct flavor that  I can only attribute to their oven. The toppings or the sauce were not especially memorable, but the crust is sublime. \n\nOne tip, do not put roasted peppers, somehow their roasted peppers were too watery and it made the pizza soggy. Oh another tip, bring your cutest girl friend to come along, and ask her to wear next to nothing, that seemed to help shorten the wait for a table.", "author": "Karyl S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-30", "description": "Meh....not impressed.\n\nWe trekked all the way to Brooklyn to wait in line for an hour to be crammed like sardines inbetween 2 couples, clearly on dates, to eat pizza...and it wasn't even spectacular pizza.\n\nI expected more from you, yelp. Usually, you will demystify those places that have been features on Travel Channel/Food Network shows and develop some kind of notoriety. But not this time, yelp, not this time.\n\nThe crust was good, the cheese was ok, but the sauce was BLEH. Just a watery mixture of crushed tomatoes and a little basil and that was it. I actually had to add garlic powder, salt, and red pepper flakes to give my pizza some flavor! Not the sign of a \"fantastic\" pizza joint. My brother really liked it but I was more than disappointed. Even though the same people are associated with Patsy's...I prefer Patsy's.\n\n$14 for  a large, and $2 for every topping you add on to it. Cash only, folks.\n\nGreat view of the water, bridge, and skyline from here though. 2 thumbs up.", "author": "Laura B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-18", "description": "New York Staple! Other then the line to wait,  I can't think of any other negatives!", "author": "Gabrielle L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}