{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-25", "description": "Definitely worth the trip.\n\nVery down to earth.  Serves great chewy pizza with just the right amount of everything.", "author": "Li M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-01-29", "description": "I hiked across the Brooklyn bridge for this place. Waited in line for about 15 minutes. Sat in a sardine can while trying not to elbow other customers. If you like cramped, crowded, and unsafe eating establishments come to Grimaldi's on a weekend around the usual dining hour. \n\nThe pizza was not amazing in my opinion. The ingredients are fresh and well cooked. I enjoyed the pizza, but the atmosphere really killed it for me. Since the pizza didn't body slam me with a plethora of goodness, I couldn't enjoy the entire experience. The mozzarella and dough were really good. The staff was obviously overwhelmed and there faces showed it. I had a hard time eating with my elbows tucked in and the fear of dipping my forehead into my pizza pie. \n\nHere's how my gf and I tackled Grimaldi's:\n\n12\" small pizza\nadded mushrooms\nadded sausage", "author": "Wil M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-16", "description": "Other than a few years off for college, and the two years before my parents arrived in America, I'm a lifelong New Yorker.  But I very rarely do the \"the city used to be so much better\" thing that so many people do.  New York and everything in it is changing all the time.  And I'm changing with it.  \n\nGrimaldi's is the one exception to my lack of complaining about change.  It used to be best pizza around, with the most delicious sauce and cheese and a perfect balance of everything.  It was worth the wait, but there rarely was one.  Now it's an assembly line of pizza making and it's not even close to how it used to be.", "author": "Karol S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-25", "description": "Grimaldi's had five-star pizza back when they were Patsy's, ten or twelve years ago.  (I was lucky enough to grow up across the street.)  It's still far above average, of course, but it's just not my favorite any more.\n\nGo a little deeper into Brooklyn and eat at Di Fara instead.", "author": "Jena B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-29", "description": "I know my reviews tend to skew towards higher ratings, but that's because I like to write about the restaurants I enjoy, and not so much about the restaurants that I don't.  I mean, if I didn't enjoy the food, why would I want to take the time to write about it and remind myself WHY I didn't like it?  There are plenty of other yelpers who are more than happy to warn of bad food.\n\nAnyways, onto Grimaldi's.  Long before I ever came to NYC, I've heard of this place.  Always mentioned in the same breath as Lombardi's, I've heard it 5 different ways how Grimaldi's is better than Lombardi's, and vice versa.  To be honest, I was fully anticipating being dissappointed.  Why?  My expectations were pretty damn high.  Especially after having to wait in the 40 degree weather for over an hour just to get into the place.\n\nSo my fiance and I ordered a large with pepperoni, sausage and mushroom.  After having John's (which, I'm sorry to say, was pretty disappointing) we've learned that a proper pie shouldn't have more than 3 toppings.  Pizza arrives just shy of 15 minutes later and... well... wow.  That...first...bite.  Best pizza ever?  Without question.  Just thin enough not to be impossible to fold (as one really should, please, stop with the forks and knives!).  The cheese, perfectly chewy, the tomato sauce, perfectly seasoned, the fresh basil spread about the pizza was the perfect touch.  After having chicago deep dish this year also for the first time, I'm thinking every pizza shop should put the tomato sauce OVER the cheese.  I don't know why it should make a difference, but I'm thinking it does.  \n\nWe devoured the pie in just about 10 minutes.  Yea. It was good. And yea, we were pretty damn hungry.  We finished it off with a canoli.  Best I've ever had? absolutely.  but then again, I've only had it twice before, and in Los Angeles.  So take that with a grain of salt.  \n\nSo yea.  Eat a giant pizza and walk the Brooklyn Bridge right after.  You won't be disappointed.", "author": "Charlie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-09", "description": "Little did we know how cold it really was. 37 degrees? Nah, that's nothing, we assumed. Try walking across the Brooklyn Bridge on a cold winter's night with NO hat and NO gloves. Actually don't -- P and I DO NOT recommend it. \n\nBut alas, the things we do to get to Grimaldi's in Brooklyn for a little taste of their infamous NY pizza.\n\nVerdict:\n\nGood deal \u0026 good pizza... I really liked the fresh mozzarella cheese and basil they used! Their house wine was super cheap too! See that pizza in my profile picture? Grimaldi's! We got there early for dinner (6pm?) so we didn't have to wait. We were lucky indeed because right after, people were piling in! My friend, who recommended this place, had to wait an HOUR + to eat here. \n\nI must confess: I only ate 1.5 slices because I was SUPER full from the late lunch I had earlier. Don't shoot me! But P made up for it -- he pretty much inhaled the whole pizza, with the exception of two slices (which we saved for our late night snack later ;)).\n\nOnly grief -- one cook almost killed P when he was in the back getting out of the bathroom. They almost hit him with a shovel....and then another cook yelled at him for taking pictures of the pizza dough. We told the nice owner and he said \"I know\" as if it was something that was normal and unchangeable. Oh dear!\n\nSO EAT AT YOUR OWN RISK. Ok, just kidding... Well this was one item to check off our list... Go here for a taste of NY pizza!!", "author": "J T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-16", "description": "What can I say that hasn't been said in the other 557 reviews?\n\nWell the pizza is good, no doubt about it.  But, if we're talking worthy of 557 reviews and a solid 4 star review, I'm not so sure this place is the holy grail of pizzeria's.\n\nI'll go 4 stars on this one, but No. 28 was in my opinion a bit better and a bit more authentic as so far as thin crust Italian style pizza.  The service at Grimaldi's was pretty awful.  They took about 10 minutes before they acknowledged our presence and then another 10 minutes before they waited on us.\n\nIn closing, \"good\" pizza, but the service was awful.", "author": "spencer d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-24", "description": "Went to Grimaldi's for the fourth time ever, my first time being 5 years ago. Over the years, I find myself comparing other pizza to Grimaldi's and 5 years later, I must admit that Grimaldi's is STILL the standard for me.\n\nI was lucky in that #1) I found parking in front of the place (my friends swear that I have Positive Parking Karma) and #2) I didn't have to wait on line! So already, my Grimaldi's experience was set up to be a great one.\n\nFor the pizza, we ordered a large pie with sausage, ricotta, and garlic. I've really experimented with different combination of toppings, and with much trial and error I found that the sausage, ricotta, and garlic combo is just perfect. For one, the sausage brings a texture and added taste to the slice, the ricotta accentuates the cheese and compliments the sausage well, while the minced garlic really adds a burst of flavor while acting as a catalyst in bringing together the sausage, ricotta, mozzarella, basil, tomato sauce, and crust into savory bites!\n\nThe crust was great! So crispy and filled with a smoky flavor - it's a tribute to their classic coal-brick oven that has a higher baking temperature than gas or electric ovens.\n\nOverall, I was very happy with my latest Grimaldi's trip. Pizza tasted great! As expected, the decor or service is not the greatest in the world, but let's be honest, you're not there for the ambiance, you're there for some of the best pizza NYC has to offer! However, once you're done eating pizza, make sure to go to the pier and witness some of the best views of Manhattan. If you're curious, for a large pie and the 3 toppings, it came out to $21.50.\n\nIt's missing a 5th star only to distinguish it from Di Fara Pizzeria, which in my opinion is the best pizza in NYC. That said, if I could, I'd give Grimaldi's 4 and a half stars.\n\n*side story*\n\nSo I decided to bring an extra pie home (home being an hour drive north of Brooklyn) to share with my best friend and his parents. His parents are old-school, Bronx-loving pizza goer's who frequented pizzeria's on Arthur Ave since the 70's. They now live in the suburbs. That said, I was a bit nervous to see whether or not his parents would approve.\n\nI got to his house around 9pm, my boy helped himself to two slices, really enjoyed it. His dad was going to have a slice for tomorrow, but by 9:30pm he had a sudden change of heart and reheated the slice in the oven. I went to the bathroom real quick, and when I came back to the kitchen where my best friend and his parents were sitting, Mrs. S said to me \"Gary, looks like my husband is in heaven!\" Haha, I was so happy to see him smiling and say \"I haven't had classic New York pizza like this in so long! Great pizza Gar! Thanks!\"\n\nWhew... what a relief lol. Enjoy!", "author": "Gary R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-25", "description": "I LOVE GRIMALDI'S.  I went to New York last weekend and made an effort to stop by this place.  I was online searching for the best pizza places and the most popular places seemed to be Grimaldi's and Di Fara.  My first stop after checking into the hotel was Grimaldi's.  I took the short subway trip across the channel to Brooklyn and got to it.\n\nFortunately for me they just opened so I didn't experience any line at all.  By the time I left a line started to form.  These guys only take cash so it must be legit right? haha  Anyhow, we got in and found a table right away.  We weren't sure what to order exactly so I went with my favorites.  I ordered a pepperoni, sausage, and ricotta cheese pie.  It didn't take too long to get but wow.  It came out, thin crust and all, steaming hot.  First bite.  EXTRAORDINARY.  I could probably say it was the best pizza that I had tried thus far.  The crust has an exceptional chew to it.  The toppings are made fresh which excentuate the taste.  The thing that probably makes it taste better is the oven that they use.  \n\nOverall, I would definitely come here again.  I tried to go to Di Fara's the day that I left NY on a Monday but unfortunately they're closed on Mondays.  Just my luck.  I'll be sure to try that next time and do a comparison.  Grimaldi's though is great in my book.", "author": "Christian M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-02", "description": "was it really worth it to wait almost two hours in line for grimaldi's pizza, when we already had spent 20 minutes on the subway to get there?  Yes, Yes, and YES!!\n\nThis place is an institution and I can understand why.  We initially only ordered one large, half plain with extra garlic and the other side dotted with ricotta, mushrooms and sausage.  While both were piping hot and delicious, we all favored the simplicity of the plain pizza.  Each bite was slightly different given the generous tracks of tomato sauce atop the mozzarella and uneven sprinkling of basil leaves.  It was so tasty, we committed the heinous faux pas of ordering another pizza when we were almost done!  Our server was gracious in taking the order but instructed us that their normal policy required all orders be surrendered at the beginning of the meal.  Knowing we had gotten a break, we ate our second pie with even more gusto, leaving only two slices left for our friend's sister.\n\nFull and satiated, we walked back over the Brooklyn Bridge admiring the Manhattan skyline as the lights twinkled overhead and all around.  Spending the better part of a nice Saturday afternoon in Brooklyn outside of, then inside Grimaldi's paid off and was well worth all the effort.", "author": "Janet L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-05", "description": "A must visit in Brooklyn!  We waited outside in the cold in a line for 30+ minutes!  But once inside, it was WORTH IT.  Yes, the setting is small and crowded, but the WELCOMING SERVICE and FRESHLY COOKED THIN PIZZAS are worth the visit.  From what I remember the pizzas were cooked in one of those brick clay ovens.  My friend and I devoured a medium pizza easily.  YUM-YUM!  I'll be back and this time we're ordering a large!  It was just too good!  \n\nPerfetto!!  Cinque!!", "author": "romeo b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-07", "description": "Simply put, World Class. Having loved pizza my entire life and loving it, this place takes the prize. Only Patsy's in Manhattan ties it for me as the best in the world. \nI came here on vacation after hearing this place being mentioned by everybody under the sun through numerous sites (zagat, aol city search, city search). Surpisingly, hadn't found yelp yet. \nPlace had a line going down the street. Forget out the door, down the street! lol. \nEverybody waiting for a taste. I couldn't wait. I walked to the front and the guy asked if I wanted a \"full pie\". I said, If it cuts me in line, go for it. Sure enough, I bought a large (about $20) and was inside paying past all the pissed off slicers minutes later. About 10 minutes after I had my meal. All the pizza had was slices of fresh mozerella and basil (I think, or some herb leave). That's all it needed. Kills anything Ive ever had. \n\nFunny thing is that I finished the entire pizza by myself. I walked my but down to the water, enjoyed the view, and the heavely moment with my pizza. Will always come back here if Im in NYC.", "author": "Charles O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-24", "description": "A nice spontaneous ride on the (A) train and a hop, skip, and jump later we were at Grimaldi's pizzeria. \n\nQuite honestly, I did not mind the 45 mins line outside on a cold winters day.  Nor did  I mind the close quarters of each table and how I had to get up multiple times to let other people get into their tables. All these things just added to the experience of the hustle for grimaldi's  \"famous\" pizza. \n\nThe service was fast and no sooner did I ask for a soda did a large pizza arrive piping hot. The pizza was topped with fresh mozzo, zesty tomato sauce and fresh basil leaves. We added additional toppings which included sausage, garlic, and onion on one half and anchovies on the other.  There were 8 generous slices ready to be devoured. This was a decently made pizza with all fresh ingredients. The pizza was definitely good, but as far as best goes...I would hesitate to jump to that conclusion. \n\nMy only complaint is the similarities of this pizza and the pizza at Patsy's on 11th and university. I swore I could have saved myself a few frost bitten toes  by just walking a block over and ordering the same thing at Patsy's.  From the thin brick oven crust to the fresh ingredients including the basil leaves these pizzas were identical.\n\nOverall the experience was fun, but If you want to save yourself the trip and the wait time just go to Patsy's. I even saw on Grimaldi's wall of pictures a man (I assume the owner) wearing the signature green Patsy's logo on a shirt  .....go figure!", "author": "Catherine H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-15", "description": "I have never waited for more than 15 minutes to get in here, but then again I live in BK and I guess if I ever saw the 2 hour line I would come back another day. \n\nAbout the food: Fabulous. I traveled Italy for a few weeks and haven't had better pizza. Honest it is delicious and flavorful. Absolutely a perfect treat.", "author": "Carissa E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-12", "description": "A really busy place, not quite the right place for a romantic dinner. But we liked the athmosphere. The food was decent - Antipasti is really simple, just a few slices of Salami and Mozarella with some Pepper and 4 Olives. Not worth the money. The Pizza was very good, but so salty that I had trouble rehydrating myself the entire night after. The table wine wasn't very good, but what can you expect if you pay 12 dollars for half a liter... Overall, the setting was better than the culinary experience and the service. I wouldn't go there specifically for the food, but will likely check in again when I'm in the area.", "author": "Till M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-15", "description": "delicious pizza noms!!! we waited maybe 30 minutes after getting there around noon, so i guess it wasn't too bad.  i'm unsure how i feel about having to order an entire pizza instead of slices, but honestly, would you really mind if you have 4 extra slices of amazing pizza in your fridge? nope!\n\ni got a chance to watch them make some pizza while in line for the bathroom and it's really amazing...a lot of cheese, not that much sauce, but super duper fast.  i can't really pinpoint what it is about the pizza that makes it so great, but i'm pretty sure it's that cheese.\n\nif you're in brooklyn, head over and find this place for some great pizza. and after eating my last slices at the airport the next day, it was just as good. a little piece of brooklyn in the chicago midway airport :)", "author": "Melissa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-05", "description": "Best Pizza in Brooklyn???? Yes! You have not had pizza until you had it from here! I been to Spumoni Gardens, Lavilla and Difarra and this place is different. The lines are always long and its for good reason. They only sell whole pies and boy oh boy you will eat it all up!! Can't wait to go back!", "author": "hertz p."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-05", "description": "We've been going to Patsy's (as we still call it) for years and were surprised to find they have moved next door to a cavernous corner building that has killed many a restaurant in the last 20 years. We were a little worried but the same old guy was greeting people at the door, the same waiters were hustling around (now with stairs to run up and down) the same odd mix of music, Rat Pack and Journey, was blasting out of the jukebox -- and the same delicious pies were on our table in about 15 minutes. I don't know who waits hours -- call ahead, people, they will tell you if there's a line. But be patient. It's worth it.", "author": "Sean E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-10", "description": "after $30 dollars for a pie and 2 drinks,  I wish I would have gone to my regular pizzeria. The service was great, the place was immaculately clean, but the pizza was not worth it at all.", "author": "Josie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-06", "description": "I may have an unpopular opinion but I felt the pizza at Grimaldi's was ok. I don't think i'd ever wait in line for 45 minutes to an hour again. Once i was inside the restaurant, the place was pretty calm, not as chaotic and busy as I would anticipate considering there was about a quarter of a mile of a line outside waiting to get in. I don't appreciate places that don't take credit cards, especially since this place wasn't THAT cheap. I tried the Marguerite pizza. It was delicious, the crust was amazing, but i felt that it was a bit lacking, not sure if the sauce needed more flavor? Also - our service wasn't too good. We didn't get our wine until after our pizza because the waiter forgot. If you don't like sharing a table, don't come here. I personally don't mind, but our neighbors seemed very bothered by the fact that we sat at the table connected to theirs. I think everyone should try this pizza if in Brooklyn just because it has so much hype and history. If you want really good pizza - i would recommend Nick's in Manhattan in the upper east side.", "author": "Jenn C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}