{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-06", "description": "Overrated. Taste like regular good pizza to me . Really a line hanging around the corner. Lol ok", "author": "Joi A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-29", "description": "I came here with a couple of friends on a weekday afternoon. There was no wait. We ordered a large mushroom and pepperoni pizza, per the waitor's suggestion, and a couple of old-fashioned root beers. The pizza was delicious, but the reputation has been definitely over-hyped. \n\nThis is New York City, the land of pizza, so it's not something I'd go out of my way to eat. This is definitely a great place to bring your friends from out of town, as it is also down the street from the Brooklyn Ice Cream Factory and the Brooklyn Bridge.", "author": "James W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-25", "description": "Was visiting from California looking around Brooklyn for a good pizza place.  Discovered Grimaldi's and saw some good reviews on Yelp so we took a chance.  This was a simple pizza with pepperoni, sausage, mushrooms, and jalepenos that they turns into something so delicious I can hardly describe it.  The pepperoni is nothing like what you find in California pizzas.  The circles are smaller, cut thicker, and have the most amazing peppery flavor to them.  They start the pizza with sliced mozzerella, then a layer of toppings, and finally the sauce.  Maybe that is the clue to a better pizza. Or, more likely it's the sauce... it was delicious with pieces of basil which added so much extra flavor.  If we ever return to NY, we're definitely returning to Grimaldi's.", "author": "Tammy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "I have been coming to Grimaldi's since I was a little girl and it has been stellar every time. This past year I have been there countless times and I'm about to debunk the bad reviews written about them. I've made friends with the staff (their service is impeccable btw) and asked many questions pertaining to the bad reviews. So here it goes...\n\nLack of liquor license: expect that to be back by this summer and drink as you please\n\nPlastic utensils and plates: there was a fire in the kitchen so now they're remodeling and doing the best they can do\n\nThe mysterious 3rd floor: yes there's a third floor but it's not being used because it would be too much. There's already a lot of seating with just the two floors and the stair cases are narrow. If they extended to the 3rd floor, there would be a lot of congestion and service would be slower.\n\nLastly, Juliana's next door: I was hesitant to ask but here's the real story. The place next door is not owned by Mr. Grimadli himself, it is only endorsed by him. Grimaldi's and Juliana's actually entered a law suit in which Grimaldi's won $10 million. As for the quality of the pizza, it is quite literally the same stuff. I asked why the pizza's look the same and it's because the people who make it at Julianna's used to work at Grimaldi's and the cooks at both locations are cousins.\n\nIf you ask me, I will always choose Grimaldi's. Why go next door and pay $20/$23 when I can get the same thing for $16 at Grimaldi's?\n\n(Shoutout to the cute guy with the tattoos and nice hair for answering all my questions and being the best waiter ever.)", "author": "Victoria M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-01", "description": "Do yourself a favor and read about this place and Juliana's right next door. Juliana's is run by the Grimaldi family. Grimaldi's was actually sold and no longer run by the family. Pizza is OK at best, very sloppy and soggy in the middle. When leaving we walked by Juliana's and saw the line was longer than Grimaldis. Then I realized everyone knew something I didn't. Woops. The pizza here really is not that good. Lot's of better options - Motorino, Johns on Bleeker, etc.", "author": "Bob A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-04", "description": "Came over holiday long weekend. Waited in queue for over 35 mins as this was supposed to be an old place with its history, etc. Definitely do not recommend this place for a vegetarian pizza. The base was uninspiring and the pizza tasted awful. Go to somewhere else. Definitely, never coming back", "author": "Rahul A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-21", "description": "We came here about a year ago after walking over the bridge, and we were ready to chow. Unforts it's not exactly as easy to find as one would think. We had about given up when we finally spotted it, it was kind of hidden by some construction at the time. Once inside, you are shuffled in and out like cattle. Packed into a table side by side, like sardines. It ended up being fun though because we met a father/son team from London and talked with them the whole time.\n\nThere surprisingly weren't too many pizza options, so we opted for the margaurita and a glass of wine. I love all the debates on here about what is or isn't the best pizza ever and how authentic you are based on what pizza you define is \"the best\". Let me just say we loved it, albeit we were STARVING, but we didn't experience some major life epiphany that led to the epitome of pizza. It was wood-fired pizza in an underwhelming environment with mediocre to poor service. The pizza was probably the best we had on all our trips to New York put together but please don't go out of your way too much to experience Grimaldi's. You're going to wonder what all the fuss was about.\n\nThere's something kind of arrogant, though, about a place that doesn't value service and strictly states on their website: no credit cards, no reservations, no slices, no delivery. Shmucks.", "author": "Meredith V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-05", "description": "What I went through to get here was crazy, based on the fabulous review from a hop on/hop off tour guide. I read they only take cash and the host told me the nearest bank was 3 blocks away. Well after walking way out of the way and returning, I returned to the host laughing and announcing to others in the restaurant where he had sent me. What a friggin jerk. There are no personal pizzas or slices, so I ordered a small pizza. It comes stripped, so adding items is way expensive. The best thing about the pizza was the pepperoni. Total of pizza and a soda was $26. Crazy! And it didn't help while I was eating, the staff was talking about how angry they were with the health dept.!!! Also it took quite awhile to even order( I sat at the bar.) I just kept being ignored. For the life of me, why is this place so popular.? The pizza at Empire Pizza, sold by the slice, near Times Square was much better.", "author": "Diane M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-16", "description": "Before my first Grimaldi's, I hated New York pizzas. The thin, soggy crust would tear to pieces. If not, the cheese and tomato sauce would drip down and fall apart the second I pick up a slice. \n\nBut then.. Grimaldi's completely blew my mind. I was speechless after my first bite. The crust was thin--firm at the bottom, and chewy in the main body. The fresh mozzarella paired phenomenally with the tomato and basil. And nothing dripped or fell apart! I was amazed!! It was a piece of art. \n\nThe only thing I disliked was the unfriendly staff. The restaurant wasn't busy when we walked in, but the host would keep forgetting that we had to be seated. When we were seated, they gave us a corner table too small to fit all of us. We had to keep calling for a waiter to take our order or bring us the check. And they didn't refill our water once. \n\nStill, I came for the food, which made up for everything. Good thing I don't live in Brooklyn, I'd spend all my money there.", "author": "Kathy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-13", "description": "I first heard of this spot when I read a story about Supreme Justice Sonia Sotomayer and this being her favorite pizza spot.  There are so many places to eat pizza in New York, but I will say this is the best I've had on my many trips to the city.\n\nOn my most recent visit (March 2013), I walked across the Brooklyn Bridge in the rain (long story), and upon reaching the restaurant, I realized they moved up the street a bit. Wasn't really busy, but I had to wait a few before someone came and took my order. I had a simple cheese and basil pizza with half pepperoni. Delicious! The sauce is light, the crust is the right thinness and crispness.  Mozzarella cheese tastes homemade and the pepperoni was a nice addition.\n\nI also enjoyed a Stewart's soda (black cherry). I wish I would have ordered one to go.\n\nOverall, I really like their pizza and walking across the Brooklyn Bridge in the rain was well worth it!", "author": "Denice R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-02", "description": "I loved the place - crust came out just perfect. Reasonably priced. Ample toppings. Was in the area on a business trip and ate here almost daily. Only problem is can get a bit of a line sometimes, but what can you do... its in a prime location.", "author": "Jeff S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-28", "description": "I've been coming here for years, when it was in it's original Old Fulton Street location and the line for pizza swung all the way down the block. The pizza is still just as good and with it's bigger digs, there are no lines [though that was part of it's nostalgic appeal]. \n\nYou can only order pies [$14 for the large, $12 for the small, either to stay or to go] and I recommend sharing with a friend. I can easily chow down on 4 slices [a big pie] and that's with toppings. The slices are thin and the charcoal flavor from the oven is intoxicating.\n\nThe last time I was here, about a week and a half ago, we shared a large pie with Italian Sausage. They don't skimp on the toppings, which are generally $2 each. The waiters know their stuff and trust them when they tell you that you don't need 2 pies [oops...].\n\nCome hungry and leave extremely full but not broke [$26 for a large pie w/ one topping and a soda].\n\nP.S. I do wish they had their liquor license.", "author": "Felisa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "As a non-pizza lover, Grimaldi's ROCKS!\n\nWe walked across the Brooklyn Bridge to enjoy NY style pizza and I was very excited to try a must-stop restaurant all my friends have raved about. Lo and behold, there was an hour wait as soon as we got there (I'm starting to think that it's a common theme in NYC), but got in line to try this. Waited an hour and a half and as soon as we got a table, it was a time to break the oven. Like....W.T.F. \n\nAfter a total of a little two hours wait, we finally ordered and I can say that the pizza is definitely worth the wait. Between the four of us, we had the white pizza, pepperoni, and sausage and mushroom. Why yes, that's quite a lot for three people, but do remember that they are thin-crust so it doesn't quite pack a punch as normal pizza.\n\nThe crust was amazing - not too doughy with a slight crunch to it. Additionally, the thing I enjoyed the most was the wood scent that came from being cooked in an over brick. Amazing sauce, both red and white, with plenty of toppings on our pizzas. I am so happy we stopped by and recommend Grimaldi's to all - it definitely lives up to the hype!\n\nOur server was very nice and patient with us newbies (he most likely gets new people every other table) and gave recommendations. He was the one who suggested we go for another pizza and am sure glad we listened to him! The next time I'm in NY, I will be back! :)", "author": "Navi R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-03", "description": "Sauce was great and so was the entire pie, but plastic plates, knives, forks, cups, and dirty table cloth with stains?  I think this business could lower the price of the pie if they want to pull that off.  I been here a dozen times over 10 years. I'm surprised at the product decline, but I would come back in another 10 years to see the changes for better or worse.\n\nIt's OK, but will not go out of my way.", "author": "M N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-11", "description": "Yes I am a fan!! The line was wrapped around the building. Luckliy I was staying at a friends who lived in the building above the place so we were able to call it in and walk down a grab it. I see why people are always in line waiting for what is said to be the best pizza in town. The flavors were so good, the sauce was amazing and they were not greedy with the toppings. If I lived in town I would frequent this place often, even if that means waiting in line!", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-15", "description": "There was a long wait for a table, so my friends and I got a pizza to go, and we walked to a park around the corner.  The pizza was delicious and it was made better by the waterfront view we had of downtown Manhattan.  Definitely one of the highlights of the trip.", "author": "Katie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-27", "description": "12 years since my first visit to New York and 12 years since my first visit to Grimaldi's. The pizza has not changed, and that is a great thing. Bring cash and your appetite. The dough has great taste and the ingredients taste just as fresh. \n\nThe only down side is I have wait longer than I did 12 years ago.", "author": "Walter L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-10", "description": "Came here for a Tuesday night dinner at 6:30 pm and I surprised that there was no line.  It's been a while, so I didn't know they moved buildings.  \n\nWe ordered a plain pie and a pie with sausage and pepperoni.  Plain pie was delicious but toppings on other pie were just okay.  The service and interior decor were okay.  Don't expect much, its a pizzeria.  \n\nI would recommend coming here and then spending some time enjoying the views at the pier at Brooklyn bridge which is right down the street.  The two pies were $40 which included tax and tip.", "author": "Douglas K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-27", "description": "Grimaldi's..........................  I don't have much to say about this place at all. \n\nI've lived and worked in NYC for years, tried them a couple times. My experience was horrible every...single...time.\n\nFirst off, the pizza is horrible.  I'm sorry, but thin...burnt pizza.  I don't care what type of oven its made in.  When you BURN crust, all you can taste is BURNT CRUST.  The rest of the pizza is irrelevant.  I don't care what topping or varient you get, this pizza sucks.  \n\nSecondly, the staff is horrible.  They are rude, bottom line.  I purchased a few pies for out of town guests, when they arrived to me in PAPER BAGS I said \"really, no boxes\".  They told me if I didn't like it I could leave.  \n\nDo yourself a favor, go ANYWHERE else in NYC for pizza, it will be a better experience.  I feel bad for those who think this is NYC pizza.", "author": "Jason M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-01", "description": "Very good pizza, I have to say, not the best NYC pizza I've had. The jury's still out on if the 1 hour wait was worth it. This area of Brooklyn is so fun though definitely spend some time by the water!", "author": "Amanda L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}