{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-16", "description": "So, I finally made my way to Grimaldi's. Right up front, let me answer one question: yes, it's worth the wait.\n\nI waited with 3 friends for about 25 minutes in the chilled air and rain. Once we got called in, we all sat at this small table by the window. The place has an old charm about it. That might have been helped along by the fact that The Power by Snap was playing when we were first seated. \n\nI usually like to get a plain pie at places like this; I feel like if the pizza can stand on its own without toppings, then it's a quality pie. However, I didn't get to make that test today. We got a pie with pepperoni and sun-dried tomatoes. It did not disappoint: the sauce was fresh, the cheese was gooey, the pepperoni was fresh and curled from being baked. Lastly (but most importantly), the crust was just the right kind of chewy. I LOVE when a pizza has a good balance between crunch, snap, and chewy. It's probably going to be more moist/soggy than you're used to at your neighborhood pizzeria, but I like it.\n\nI had a cream soda along with my slices. Overall, it's nice to come to a place where the hype can be supported by actual quality. If you don't want a crazy wait, do like we did and go on a rainy day!", "author": "DeShaun C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-28", "description": "I visited Grimaldi's (under the bridge) last night to get take out.  After spending an hour looking for parking I was finally able to get out of the car and into the restaurant. The line outside the place was two blocks long and I remember feeling grateful that I could simply order takeout. Anyway, I digress, I walk in to the restaurant and was greeted by a someone snide, somewhat indifferent,  wiry, brown haired check out girl. She was counting money and appeared to be totally uninterested in my visit. As I approached her she begins the interaction with \"Yes\" to which I reply \"I'd like to order take out\" then she asks \"did you wait on the line outside?\" I explained that I had not. I asked, to confirm, if waiting on that line was necessary even for takeout.  She of course said \"yeah you gotta wait on the line\".   \nThis seem to be just a little ridiculous.  If someone is getting take out why would Grimaldi's make them wait on a line with people who are hoping to get a table?  Needless to say I did not wait.   I have been coming to Gramaldi's for years and have found it to be an enjoyable experience 90% of the time.  But they seem to be trying to find ways to make the customer unhappy.   The customer service is horrible and the lines are reminiscent of amusement parks.  I will not return to Grimaldi's. I am sure they have lost a lot of business because of this.  But I am doubly sure that they are satisfied with the tourist dollars they generate and hardly care about the folks that have made them who they are (Brooklynites).", "author": "Leroy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-31", "description": "Had to visit the original. The mecca. The pizza that's so good you'd stupidly wait in line for hours to get it. Or like the girl seated next to us, you'd travel all the way across the globe for it (she was reading a Korean tour guide book so that's the story I devised for her).\n\nLuckily we went early-ish (5 after a long walk over the Brooklyn Bridge) and were seated fairly quickly. The pizza did not disappoint. There definitely is something special about their pie. The crust is still thin and crispy/chewy, but somehow it's spongier. Is it really the water? Their cheese is also fresher than any other pizza cheese. Not salty and super stringy.\n\nIt was still good cold straight from the fridge the next day. Yum.", "author": "Torie Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-13", "description": "Oh Grimaldi's...I'll give you one thing.  You do act like you should be great.  You pack people in like sardines.  You have an annoying old door man who bothers you if you lean your stuff on another chair.  You scorn modern comforts like air conditioning.  You only have one bathroom for which there is a perpetual line.  Your servers are slow and miserable.  There must be something sustaining you, beneath all these negative things.  You'd think its great, or at least solid pizza.  No.  Maybe once upon a time this was one of the pinnacles of NYC pizza.  That notion died circa 2001.  Now there's nothing but hype left.\n\nSimply put, this pizza didn't taste like anything.  Nope, it didn't taste bad necessary.  The sauce and the cheese were completely devoid of flavor.  While lower quality fresh mozzarella can have that problem and still be alright on a textural level, this didn't even have that.  Even worse was that the sauce here was a joke.  I don't have a problem with putting a cooked sauce on pizza like some purists, but this was watered down crap.  The only flavors present were the small clusters of oregano and pecorino romano placed on the pie, which completely dominated those small spots and left the rest of the pie without the help it needed.  The crust was crisp and dense without much rise on the outer rim, and the interior had no crispness with only a small bit of char.  I wouldn't say it was undercooked so much as it was just limp and the watery sauce just made things worse.  The whole product was nothing short of a failure, and it substantiates the following claims made by several friends of mine and other people whose opinions I trust:\n\n1.) Grimaldi's is a tourist trap\n2.) The owners clearly don't care about the product they're putting out\n3.) The place flat out sucks\n4.) Its all hype now\n\nNow drama aside, I pray that this isn't the average of what they serve on a regular basis.  If so, I applaude their talent for keeping up this farce as long as they have.  There's no point in dwelling on the service or space as thats not what mattters.  However, what I was served wouldn't have been acceptable even at an average slice shop--thats what matters.  As much as I hate tourists, I'm actually embarassed if this is what they're eating as a representation of NYC pizza.  Heres my new rule: \"if you think Grimaldi's is awesome pizza, then your opinion officially means SHIT\".", "author": "Justin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-02", "description": "Waited almost 2 hours here on Saturday at 6:30 but you can't be mad when u get inside. They are NOT just holding the line.  The line LEGITIMATELY represents the demand, and inside is a team of EXTREMELY efficient workers.  \n\nAfter waiting 2 hours in line, I had to go bathroom ASAP for which there was yet ANNNNOTHER line.  1 filthy unisex bathroom.  The only good thing about it is that it is right near the open kitchen where you can watch them make each pizza to order...I like that you can watch what goes on...everything is sanitary out there (unlike the bathroom), fresh, and the pizzamen (is that what you call them?) are skilled in their craft.\n\nSo why the 5 stars?  It's all about the PIZZA BABY.  I had Lombardi's for lunch just to compare.  Grimaldi's has more flavor and is a little richer but is still clean and non-oily. I prefer Grimaldi's crust which is softer and more bready (but still thin crust), and the sauce + herbs/basil add a little extra somethin' somethin'.  We got pepperoni and sausage, both of which were delicious toppings.  Out of 4 of us, 3 preferred Grimaldi's, and my mom preferred Lombardi's.  \n\nThe damage to feed my family of 4?\n1 Large Pizza w 2 toppings + 2 drinks=$24\n\nSo this place is also cheaper than Lombardi's.  (CASH ONLY)\n\nAll in all, just make sure you don't come here hungry..because you will absolutely be a broken soul after waiting for 2 hours in starvation mode.  If you have the mental strength to make it, I would highly recommend Grimaldi's Pizza.  It is truly delicious.", "author": "Joyce K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-14", "description": "I've been eating pizza 20 years and this is up there. I'm teetering between an 8.5-9 on the pizza because of a soggy middle, but I know that happens sometimes even at the best places.\n\nThey serve only napoletana margherita, in all its glory with rich varied flavors that come together for the meal. In the city known particularly for the best pizza, the quality here is unmatched anywhere else.\n\nIt's not that crowded, just a traditional family atmosphere. The owner has an interesting demeanor: he's a true New Yorker, and isn't mean to those who are. Yet ironically given the location in Brooklyn he comes off a little hostile to hipsters.\n\nThe wait time varies widely, from 20 min to 2 hours. Ours was 45 minutes on a Tuesday night. After the meal, we agreed it was very much worth it.", "author": "Rod B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-01", "description": "Pizza was good but I have no idea what the rave is about. Born and raised in NYC and haven't been to Grimaldi's until recently. I was not impressed by my experience to the place. With lines out the door, I'm assuming they make money there. Please invest in some new seats on the inside. Different color fake leather seats that are ripped and patched over. The Pandora isn't even the subscription Pandora. You guys can pay $4.95 a month for commercial free music. If you want good pizza, there are hundreds of places to go to in Brooklyn. Grimaldi's is good for a one time try just to say you went to the 'World' famous place, but nothing special beyond that. Try Di Fara as well.", "author": "Izzy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-09", "description": "This was the first stop on our Pizza Tour of Brooklyn this weekend. \n\nGrimaldi's is often dismissed by pizza purists for being a tourist trap, but I thought it absolutely lived up to the hype. The pizza here was excellent, and while maybe not quite as good as Di Fara or Totonno's, it's certainly in the same league, and for many, much easier to get to. We got 3 pizzas: 1 plain cheese, 1 with garlic and 1 with half pepperoni, half mushroom. I only had the latter two, but both were top notch. The cheese was very high quality and the crust was some of the best I've had. The pepperoni wasn't the best, but the mushrooms were delicious. It was vastly superior to any pizza I can get in DC, that's for sure.\n\nThe one obvious knock on Grimaldi's is the wait. You have to wait outside in line before you can order, regardless of whether you want to eat in or carry out. Our wait wasn't horrendous, but it was about 30 minutes, and in 95+ degree weather, it was a little taxing. The line got noticeably longer an hour later too. After waiting in line you still need to wait another 20-30 minutes for your pizza to be ready, and there's nowhere inside to wait, so back outside into the heat we went. \n\nI'd say Grimaldi's is absolutely worth going to, but like Di Fara, not an every day kind of place because of the long wait. The best time to go would be on a nice Saturday afternoon when you don't need to worry about time. The pizza is great and well worth it if you've got some extra time on your hands.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-02", "description": "Prepare to wait! Buttt the wait is definitely worth it. My friends and I waited FOREVER! I was starving. I was hoping it would only take at most an hour. Little did we know, it took us over 2 hours! I was scared that the kitchen would close on us and that they would not able to serve us. We got seated around 10:40ish. They close at 11PM. Luckily we made it in time. We ordered right away hoping the food would come asap. They make the pizzas after you order them. The pizzas are super fresh.\n\nWe ordered 2 large pizzas both the same for a party of 4. We had sausage, extra basil, mushroom, and sun dried tomatoes. The pizza was steaming when we got it. The pizza was very clean and delicious. The crust is nice and thin. It was not overly cheesy, and the condiments are simple. \n\nI normally never eat pizza. However, I did eat more than usual here. That must mean something! We literally scarfed down our first slice. The pizza was amazing. Maybe the pizza was super good because we were so hungry? I don't know... Whatever the reason was, the pizza was probably one of the best I've had. I definitely will come back!", "author": "Amy T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-22", "description": "Ok, let's be clear.  The pizza here is good.  Maybe even very good.  But for all the hype that I've heard over the years and the waiting in the hot-ass sun that I had to do before getting a table in this restaurant that seems to be without decent air-conditioning I have to say that I was pretty disappointed.  \n\nThe pizza doesn't really stand out to me in any significant way.  Brick oven pizza is always nice and they do make a decent crust here but I've had better pizza at Geppetto's in Providence, RI and I'm pretty sure you can get a brick oven pie that's just as good at other places in the city.  Even the service is \"meh\".  I just don't see what all the fuss is about.", "author": "Patricia C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-05", "description": "good pizza, but service was no good. You can get a decent slice at many other pizza places with better service.", "author": "Sara L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-08", "description": "So there's this pizzeria in an unassuming building nestled under the Brooklyn Bridge, yep that's Grimaldi's.  I heard a lot of hype about this place before and after arriving in New York, when I got there it was a lot more quaint that I had expected. Even the pizzas look modest, they're beautiful yet modest looking. Once you sink your teeth in it's everything that you expect it to be, amazing,  just in case you needed help with that one. We had a pizza with pepperoni, extra basil, mushrooms, and ricotta...just thinking about it gets my heart pounding lol. The pizza was great, the service was below basic-basic, my philosophy on service: if not at all destructive then it's a wash, judge only the food I'm not one to yearn for constant pampering, just eat the damn food. I'll come back to you Brooklyn location *extends right arm towards the east whilst opening hand*.", "author": "J A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-03", "description": "First time in NYC... i have to try the New York pizza...\nI ve heard about this place so much... let s try!\ni arrived there at 11.45am knowing that the place open at noon and the line might be huge. Actually it was ok, i have been waiting maybe 30 to 40 min but still a long time to get a pizza especially in the city of the pizza!\nThe design of the place very simple, but it smells so good in there... i can tell the pizza are in the brick oven! \nOrdered a mozzarella, tomato, basil pizza large size for 2, it took a little while to get it, but when it arrived, it was just a great moment of pleasure! it was just one of the best pizza i ve ever had. \nSo i highly recommend this place.", "author": "Lucile L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-08", "description": "Waited well over an hour for 4 pies. i understand that Grimaldi's is famous and busy, but waiting over an hour for food, and lack of simple service is ridiculous. I wanted to be blown away and amazed at the pizza, but I really wasn't.\n\nIt was good, especially the fresh mozzarella and tomatoes, but I thought it was subpar. Maybe I just haven't had enough good and/or bad pizza to figure out the best and the worst, but I will come back to try again.\n\nI do love that it cost less than $100 for 5 pies and 12 people(tips\u0026tax included) :)\n\nThey have a great music playing. It was allll 80's and 90's greatest hits. Michael Jackson songs, Bon Jovi, Pat Benetar, Journey, and Queen played for the 3 hours we spent there. Freaking. Awesome.", "author": "Angel H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-05", "description": "Finally got to try Grimaldi's! We got there about 7:40 and were promptly seated. Within 5 minutes, people started to pour in and before you knew it there was a line waiting at the door. The smell of pizza hits you as soon as you enter. We opted for a pepperoni and mushroom pie. It couldn't come out fast enough the more pizzas we saw pass us by the hungrier we got. At last our pizza arrived (it really wasn't very long)! What a great looking pizza, toppings were put in all the right places and it looked like just the right amount. This pizza is pretty awesome! The crust is like nothing I have seen here, only in Italy (made by my fiance's aunt). The crust was thin and airy at the same time. You can tell that the ingredients are high quality and fresh. Everything almost melted in mu mouth. It was quite delicious. \n\nAs for the space itself I would give it a 4, only because it is super loud and a bit crowded. I'm guessing it looks exactly the same as it did when it first opened its doors. I'm not saying that's a bad thing, it adds to the charm, but don't go expecting a nice quiet dinner.\n\nDefinitely worth a trip to Brooklyn and a big plus is you get to walk over to the water (right across the street) and enjoy a view of the city and the Brooklyn bridge.", "author": "Krista M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-03", "description": "Pizza mediocre service sucks, they just don't care ...not worth it", "author": "Hovik B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-02", "description": "After hearing all the fuss about this place, we had to go there while in NY. There was no line last night (Wednesday night), so I guess we were lucky. The space was cramped, greasy, had lots of flies buzzing around, and we were seated on top of the ATM, which was frequented by other guests because yeah, they don't accept credit cards. The pizza was meh at best. Crust was  thin, but undercooked and burnt at the same time. Toppings were bland.\n\nWent here because of the hype, but will not contribute to it and we won't recommend this place to anyone.", "author": "Stine N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-14", "description": "I know it's blasphemy for a Philly kid to say this, but I LOVE Brooklyn-style pizza. Thin crust, sweet sauce ... Mmmm. There's always a wait and it's cash only, which hurts. This place is worth a go if you can, though.", "author": "Alex T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-01", "description": "Don't understand the fuss. Apart from buffalo mozzarella, the overpriced pizza was average at best. Processed ham, barely no mushrooms or olives, both tasted shit anyway. Disgrace to Italians. Learn how to make a pizza with fresh ingredients", "author": "Chris F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-11", "description": "We were underwhelmed by all the food - antipasto, pizza and calzone - after hearing about how great it was for years. And who severs cold sauce with hot calzone? Who? But worst of all, Yelp says they sell wine and alcohol, but when we arrived we were told they did not have a liquor license! It was my birthday, I was sober and pisses off!", "author": "Maureen D."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}