{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-13", "description": "This was the 2nd time I've been to Grimaldi's and the 2nd time wasn't as great as the first.  This time I came and didn't want to wait to be seated in the restaurant, so we ordered togo.  The pizzas came out fast and tasted great, but the service sucked ass.  Don't get me wrong, the pizzas and the toppings are good, but the food did not out shine the poor service this time.", "author": "Sam T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-12", "description": "pizza is great but not worth the prime time wait.  Try to go off hours like 3-4 pm you won't be disappointed or crammed in!!!!", "author": "Lily W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-11", "description": "We arrived around 10 on a Saturday night. I expected to have to wait. Instead the 4 of us were seated immediately. It was the night before Easter, maybe that's why?\n\nThe pizza was great. What was most impressive to me, however, was that when our friends ordered a cheeseless pizza, the waiter didn't bat an eye. And they enjoyed it. The dough and sauce were special enough to make them very happy. So vegans need not shy away from this place. Also,a  pizza is very reasonable when two are sharing.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-15", "description": "Well worth the long wait to get a table. I love New York Pizza and this is the best. Fresh Basil and Fresh Mozzarella make one tasty pie.", "author": "Kyle K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-30", "description": "I have heard of Grimaldi's for quite some time and never did venture there until I became a New Yorker. I dragged my friends there for some pizza and I loved it!! The whole pie( sauce, crust, toppings) was so good we ordered another pie just to take home for lunch the next day. I would have given the place 5 stars but there is no excuse for rude servers.", "author": "Tom B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-12", "description": "don't over think the pizza. stick to 2-3 ingredients or you'll get a soggy mess.\n - pepperoni's here are good. a bit of spice to them\n - mozz is cheezy\n - basil on everything\n\nso what to order? a large with pepperoni, ex basil, and maybe garlic or onions....something that won't water it down. our second pizza had sausage, mushrooms, and garlic and i think the mushrooms watered it down.\n\noh, get here when they open or suffer a line. we got there 15 minutes prior to opening and were 5th in line for a party of four. the place was packed within 30 minutes over opening.", "author": "Trogdor B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-04", "description": "Amazing Pizza!! I went here on a Saturday around 1pm and there was a short line and we had to wait about 20min to be seated and about 20 to get our pizza. Wasn't as bad as i have heard it to be. I was with my boyfriend so we got a small pizza to share have plain half pepperoni. Arrived hot and looked fantastic, it was great! I really didn't like the pepperoni so I stuck to the plain, we were about to almost finish it and left as stuffed as can be. I'm so glad I finally got to try this place. I would deff go back.", "author": "Iris M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-01", "description": "Some of the best pizza I have every had!  Grimaldi's serves a simple pizza with great ingredients prepared perfectly with a coal-fire baked crust in a great atmosphere under the Brooklyn Bridge.  I only have 2 issues that prevented Grimaldi's from receiving 5 stars.  The prices are a little stiff after you add a few toppings to your pizza and the service leaves something to be desired.....but that is probably just part of the Brooklyn ambiance.", "author": "Jason G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-07", "description": "The pizza is divine, but the service is horrendous, the waiters are outright rude with vengeance. I've always had bad service at the place, but last night tops it all:\n\nI was sitting with my friend, I asked the waiter for a cup of water he didn't look at me nor did he confirm in any visible/audible way, I asked again, same thing happened, no confirmation. I asked the third time, and the waiter SNAPs and yells at me loudly in the middle of the restaurant, using slurs and insults. I made him understand that his lack of confirmation is why I asked many times, but he just went on to service other tables.\n\nI asked another waiter who witnessed the scene whether this is acceptable behavior for a waiter in this restaurant, and he basically said its my fault since I asked three times for the same thing. I said thats ridiculous, and that I'm leaving, the waiter extended his hand showing me the door.\n\nThis is New York, and I don't usually expect the best manners and politeness from waiters around here, but this went over the top. Grimaldi will not have my business again.", "author": "Deaf P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-05", "description": "Highlights: \n\nCoal Oven, Fresh Mozzarella Cheese, Thick sliced Pepperonis, Good crispy pizza, they put olive oil on every single pies just like Di Faras.\n\nI like it. Old school NY.", "author": "Todd M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-17", "description": "this place is closed :( I walked over the bridge and was looking so forward to trying it out only to find the awning and a bunch of kitchen items laying in the space next to the restaurant.", "author": "Becky D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-02-10", "description": "Take the appearance of Brad Pitt, the voice of Bono, the humor of The Onion, and the patience of the Dalai Lama and you might have perfection.  Or at least the person I wish I was.  My point? THIS is pizza perfection. Treat yourself to any of their magnificent pies and you'll personally wanna go shutter up every Famous Ray's and Sbarros in sight.", "author": "andrew r."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-10", "description": "Grimaldi's makes great pizza, simple as that. Thus the line down the block. Personally, I'm not sure I'd be so eager to wait in this line (sometimes over an hour wait!) again, but it is a fun place to take visitors from out of town, as this place is certainly a local legend. You can watch the chefs in action as they flatten (and toss) the dough, casually paint it with sauce, and sprinkle on the selected toppings before tossing it into the wood fire oven. A few minutes later, out comes the toasty goodness, ready to be delivered to your table. (It was also nice to see they use FRESH mushrooms, not the canned stuff I've found on a lot of pizzas in NY. That's just gross.) The service was quick and efficient, and we had a great time.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-18", "description": "The best pizzeria in NY for sure.  It beats out Lombardi's watery pizza any day.  Downside is the long line, but in my opinion, the pizza is worth it.  Great views of the city skyline/brooklyn bridge nearby.  Very reasonably priced.", "author": "Maria C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-10", "description": "My first time at the restaurant, my friend said we got lucky, because there is USUALLY a hugeeee line to get in on the sidewalk!....However, even if it happened to be one of those nights, it would have been well worth it!!...the pizza was GREATTT!!......such fresh ingredients!!....The owner even came and spoke with us for awhile until our pizza came because one of my friends was soooo grumpy because she was hungry!LOL....he ended up throwing in 4 free cannolis because he liked her!LOL....but its seriously a great spot!....they dont have much to choose from dessert wise....but hey look on the bright side, your in dumbo, blocks away from THE BEST ice cream everrrrrrrrr!!...PERFECT NIGHT IN BROOKLYN!", "author": "Rachel D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-12", "description": "I have only this to say:  I hate eating pizza the next day.  But, Grimaldi's made an exception for me.", "author": "Mimi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-18", "description": "Finally managed a visit for NYC Food Film Festival's pizza night, and let me tell you, the pizza was well worth the 2 hr commute + wait in line. It's the kind of pizza you can only get with a wood-fired oven. The space is tight and service can be snippy, but it's all for the sake of efficiency. A group of 8 of us shared 3 large pizzas (1 sausage and mushroom, 1 ricotta and sun-dried tomato, 1 roasted red pepper), and we demolished all three pies. Followed by a visit to the Brooklyn Ice Cream Factory, it was a perfect way to spend a lazy summer evening.", "author": "Minji K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-02", "description": "A trip to New York is not complete without getting pizza so we made the treck out to Brooklyn to find Grimaldi's. We came around 3:30 so there wasn't too many people and the wait was short. As you walk in you can hit in the face with freshly baked pizza. It's good pizza, perfect crust, thin and crispy, and great toppings. The only reason why I didn't give it a 5 star rating is becuase i've had way better, yes I'm comparing New York style pizza to California style, but I can do what I want I'm giving them a 4.", "author": "edrick w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-30", "description": "Really good Pizza.  Don't think it's the best but it's really, really good.  Definitely better after shaking some garlic powder on top.  Pepperoni was really delicious.  Service and arrival of pizza was fast fast fast.  Nice experience overall.", "author": "Rachel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-29", "description": "I heart Grimaldi's. One of my favorite pizza spots in the city. it is fresh, tasty, fun atmosphere. the wait is a pain and you have to know when it's worth waiting and when it's just too long of a line, but otherwise it is a stop one *must* make when crossing over the Brooklyn Bridge!", "author": "Cristina b."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}