{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-03", "description": "Read all the reviews online and decided to try it for myself.  Great pizza and worth the wait.  Constantly a line outside for people to get theirs and that is amazing considering they were from all around the world.", "author": "Talitha H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-04", "description": "I'm a New Yorker. Naturally, we know our pizzas just as well as we know our bagels.  This is the real deal.  \n\nI found out with pizza as fresh and as delicious as theirs, it's better to order less toppings to taste the classic ingredients (bc they are THAT good) and too much ingredients might weigh down the thin crust and mask the simple goodness of  tomato sauce, mozz, and basil.  I get extra cheese, my bf gets sun-dried tomatoes. But that's it, no more extras.  I did try the pepperoni once and its good, but I prefer margherita.\n\nI don't indulge too often on fast food, but when I do, I make sure I take a trip to Grimaldis if it is pizza I am craving because polishing off half a large pie is worth the expanded waistline and the wait.  However, I skipped the wait when they opened up one in Queens.", "author": "Jamlen F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-24", "description": "Yesh, you have to wait in line sometimes for an hour or more\nYesh, its touristy sometimes\nYesh, its the best pizza in NYC", "author": "Sumit D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-21", "description": "Went last night with friends and waited on line for 1hr 10mins..finally got in and got a large pie, half pepperoni and half mushroom with sausage. When it came i realized how thin it was..im a fan of both thick and thin pizza's but this was just ridiculous. It was paper thin and the crust was totally burnt because of how thin it was. The cheese and toppings just felt apart when we picked it up because the slice was so god dam thin..some parts were crispy like a thin cracker when you bite into it. And that's something i don't want in a pizza.\n\nDon't get me wrong, it wasn't too bad taste-wise, but it was just way way way..too thin. The sausage especially was really good, but i didn't taste much of the mushrooms. Since it's paper thin, each person would probably have to eat 4 slices AT LEAST to actually be full. All and all, its ok, give it a try..but i don't think its worth the 1hr 10min+ wait. If you pass by and there's a short line or no line then ok give it a try. Other than that it's not worth waiting almost 2hrs for. Just imagine a piece of paper with toppings thrown unevenly on top and as you pick it up / fold it, everything just falls out.", "author": "Carol R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-07", "description": "Well its an OK pizza not worth my two hours I tell you...TWO FREAKING HOURS IN LINE!!!!! no way I'm glad we went to get it out of our systems. Service is fast and pizzas don't take long at all. Thin crust oven brick cooked pizza had Margarita, pepperoni and white pizza with sun dried tomatoes. Best one Margarita pizza tomato sauce has a good flavor. Why three stars, because if i had to go to this place without the f....ing line might have been three and a half. But for white pizza Pizza CS in Maryland wins it all for me. Sorry but it didn't wow me at all :(", "author": "Liza A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-30", "description": "Tourist spot or not...... This place has some delicious pizza!  The only reason I don't give it 5 stars is because theirs often a loooong wait for a table.\nThe owner is a patient at my dental office and he's a sweetheart!  He treats us to dinners here often and I'm very eager to accept!  Why not!? It's the famous Grimaldis afterall and my belly is always so happy to accept!  If your in Brooklyn and have some time........ Go in!  You won't be disappointed!  Pinky promise!", "author": "Marty D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-31", "description": "O the wait is worth it! After standing on line 20 min and waiting a hour after paying for my order, I was in Thin crust pizza heaven!  NYC old fashion Pizza, taste greats and made fresh. Go dress comfortable the long line and cramped seating", "author": "Shaq D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-07", "description": "YUMMY.  They say less is more on their pizzas.  I've gotten a red-sauce pizza both times I've gone since they import their tomatoes from Italy, and I wanted to have a authentic pizza experience.  I got mushroom as a topping, which I wouldn't recommend it made the pizza extra soggy from the water in the mushrooms, and the mushrooms are in more of a raw state then a good browned baked state.  Environment is cool.  Get there early before the main meal times cause lines get long.  They are pretty quick if it's just two people.  Two people can easily eat a small pizza which consists of 6 Huge slices.  Don't take leftovers they'll just get soggy, but its good enough to eat it all there and be a little extra full.", "author": "Laura B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-29", "description": "Thumbs way up! This place is not famous without reason- great pizza, fresh toppings, (super lethal spicy jalapeños ) and vintage feel. I also really like their ricotta cheese, and fresh basil. If you're ever strolling over the Brooklyn bridge, definitely make this part of the trip!", "author": "Karin D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-03", "description": "okay so i decided to come all the way out here because i REALLY wanted to get dessert at the brooklyn ice cream factory....BUT THEYRE CLOSED FOR RENOVATIONS! so sad. \n\nanyway, now that that's aside, i can get to the pie. surprisingly short wait on a saturday night (might've been because it was cold and snowy outside). nonetheless, we were seated promptly and ordered the large regular with extra cheese. they actually put the cheese down first and THEN the sauce, so it looks like there isn't a lot of cheese, but there actually isn't a whole lot of sauce. either way, it tastes delicious, but YOU HAVE TO EAT IT RIGHT WHEN IT COMES OUT OF THE OVEN! it cools own within minutes, so the real fun is when its pipping hot. \n\nmy bro and i killed the large - all this plus drinks was just under $25!", "author": "Asmita J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "The pizza here was amazing. We were staying in Brooklyn and knew we had to check this place out, it was well worth the wait and the hype!!", "author": "Ryan E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "Food was terrific! Ordered 2 large pizzas and the size of the pizza definitely complimented the price. Ordered one pizza with Italian sausage and onion and the other with pepperoni, mushrooms, and pepper and completely satisfied with both. Would definitely recommend this spot to everyone who is touring New York!", "author": "Sam C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-12", "description": "Either quality has changed or it's just overrated.  Waited in line for 40 minutes, which isn't bad given how long folks usually wait.  We ordered Mozzarella, Onion, and Sausage, and it was really just...meh.  I mean, really.  The pizza was mostly soggy, and what best metric for a good pizza aside for the crust?!!!  If you want to take me up on it, try Tappo's by Eataly.  Perfect thin, crispy crust, and just overall delic.", "author": "Tina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-30", "description": "Celebrated are 1st year anniversary as husband and wife here last Dec.. I've heard about the long line and the waiting game here before you finally be able to get your table and luckly we try this during winter and we avoided the long line. Service is fast.. Pizza are delicioso! and they serve my favorite Stewart Rootbeer which is seldom sell in any local grocery store in New York. So I guess if you want to avoid the hassle of falling in line better try this pizzeria on winter.", "author": "Marielle O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "Definitely delish but I don't like to deal with the crowd unless I'm entertaining out of town visitors.", "author": "Nicole N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-05", "description": "(3.5) good overall ~ While the crust is very good, the cheese \u0026 sauce was just ok.  Our search for the Best NY Style Pizza continues...\n\nNOTES:\n* Walk across the Brooklyn Bridge from City Hall Park on the Manhattan side.  Once across take the first exit on the Left.  Once you get to the bottom of the stairs, make (2) lefts and then (1) Right on Old Fulton Street.  Grimaldi's is about 500 yards down Old Fulton St. on the Right.\n\n* Be prepared to WAIT about (1) hour in line on the weekends!!!  \n\n* Cash ONLY!!!", "author": "Craig D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-05", "description": "If getting treated like garbage and being talked like your beneath them is worth getting a good slice of pizza then this place is good for you.", "author": "Ellen L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-19", "description": "I don't get the hype with this pizza joint, being from Brooklyn, it's hard to a bad pizza, but with all the raves about this place I decided to go. I did not check Yelp first, so I was not expecting the huge line! Ok , it must be damn good then right? WRONG. It's just decent. Mediocre pizza. Not worth waiting twenty minutes for that is for sure and what place doesn't take credit cards in this day and age unless they are lying on their taxes????? Grab a friend and Pizza hop all over Brooklyn, skip this spot unless you just want to say you ate there.", "author": "Kim O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-19", "description": "Basically:\n\nPros:\nGood pizza\nBrooklyn Brewery beers\n\nCons:\nLong lines\nClean the ovens between 5-7pm\nNot so great service\nDirty table\n\nI had high expectations, will probably stick with Patsy's from now on.", "author": "Lori M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-20", "description": "Pizza is great. Service is horrendous. i would say the pizza is absolutely worth the wait. \n\nI went here on a saturday night around 8-8:30. we waited about 15 minutes, and the owner told us there was a table available upstairs for us. so we walk up the stairs and see two empty tables and sit in the first one we see. we literally waited about 10 minutes before we were able to get some ones attention that we didnt have a sever. the kid told us your server would be right with you. at this point, im getting annoyed, is this what the whole night will be like? im pregnant, i need to eat now!\n\nWe finally get a server, and we order the antipasto salad, a pizza with sausage, extra cheese, capers, and two sodas. and now we wait. and wait. and wait. and wait some more. we ask the waiter where our antipasto is because its a salad it shouldnt take more then 3 minutes to make. Well, no one put our salad in, our pizza comes out, im annoyed because i wanted my salad. we cancel the salad, eat the pizza and leave.\n\nhopefully if i ever go back, i wont be forgotten about. \n\nand FYI, cash only, no delivery, no slices.", "author": "Danielle S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}