{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-27", "description": "Visiting NYC and as a pizza fan I do my to do list of iconic pizza.  Grimaldis, Julianna and Patsy stories are long novel, complicated and intense from a legal view. Do you  research and read the details.  This time a decided Grimaldis (under the bridge)\nThe missed a star because is cash only (this is not a good service from my perspective) not acceptable in 2017 where they are multiple  payment methods from the simple credit card to more recent such as mobile pay (I phone, Android, paypal).  \nMissed 2 star in decoration and general atmohsphere.  Is obvious that side they are a famous place and depends of tourist they paid no attention to the decoration and atmosphere of the place.    At least the counter bar and the whole first floor is needing a fresh paint and a complete refresh.   We are talking of uneven tables, behind countertop is not organized, etc....\nPizza 5 *     I we order the following topping added to ours; ricotta, pepperoni and sausage\nJust crispy, correct amount of cheese in a simple sauce.  Great\n\nNote.   Cash only is a bad customer service, bad employer practice and a bad general practice. You put at risk your clients, your employees and is a open window for others practice not recommended ad a stakeholder within the city. \nLast suggestion, this will ask be for Julianne next doors, today exist many others place where good pizza is serve.   Pleas provide some good servo e in the person outside in line.  Example offer glass of water, offer seat to elderly and physical limited, offer  accommodation to others handicapped or limited persons (autism for example)", "author": "Al V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "Visiting Brooklyn from Oregon, this was on my list of places to try. Super easy to find once we got off the ferry at DUMBO. There was a line but I was only standing out there for maybe 15-20 mins. The guy came out and got the # in our party. To me he had the typical approach as many of the Italian New Yorkers i know here. It didn't scare me off as some people have posted here. If you're in line and he's yelling \"I need a 2!\" And you're too busy talking then I'd get frustrated too. He was quick at getting people in and out of there. As a customer I appreciate that when  standing there hungry!\n\nThe pizza was very delicious and fresh! I like the added basil. The mozzarella cheese was amazing! Thin crust and the toppings added delicious flavor. We would visit here again if we ever come back.\n\nI do find it odd that instead of fountain drinks they serve all beverage in cans and bottles. We sat on the 2nd floor in A/C and the music was fitting.", "author": "Amber L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "Big fan of the pizza. Have been going there for almost 20 years. My issue is that it had become a tourist attraction and had lost a lot of the luster that it had for me. Plastic cups and plastic utensils make it feel very different than what I remember it as a kid. \n\nThat's the nature of the new NYC so I can't knock them too much.", "author": "Christian A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-19", "description": "This place is overrated and overpriced. There are plenty of other places with better pizza out there. \n\nAlso the service is a turnoff, the staff acts like they did you a favor by letting you dine here. Being this famous in the 21st century, they have the audacity to still be cash only. And you can tell by the notices on their menu, they think they are the best and deserve to dictate their terms.", "author": "Farhan Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-13", "description": "I laugh at all these clown followers standing around the corner on a 2 hour line waiting to get in to eat their trendy pizza cause they want to feel COOL.\n\nThis place is not all that the pizza was cold, burnt and small qualities of toppings. \n\nJust a name and more media press to follow.\n\nCommon folks show some independence not following like hipsters....\n\nThere are better places around for your buck.", "author": "Anthony A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-29", "description": "I waited in a line here for about 45 minutes.  Everyone said it's worth the wait.  They were right... it's definitely the type of pizza you'll only have here.  Very thin, lots of cheese... it tasted great.  \n\nBut if you are like me-- and enjoy crispy crust-- so crispy you can hold it up by the larger end and it sits straight horizontal- then go elsewhere up the block on Henry.", "author": "Johnny A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-21", "description": "Okay. We stayed in a local hotel last weekend and decided to ask the concierge \"What are the must do's in the area?\"  The response was a map with pin points and the \" Must Do\" was this pizza place that is located just under the Brooklyn Bridge.\n\n When we arrived there was a line, which was a good sign that we were about to embark on some good eats!  As patrons were leaving, they would say things like...loved it!...great food!  I can tell you that I actually got excited to taste this famous brick oven pizza.\n\nWe waited in line about 15 minutes and then were taken upstairs to our table.  Our waiter appeared as if he could care less if we were there or not.  There was no warm greeting or explanation of anything on the menu.  It was as if he expected us to just know.  We ordered an antipasto salad and a small pie. Thankfully, we ordered that salad, because it took a very long time for our pizza to arrive.\n\nThe pizza was so chewy, my jaw started to hurt.  The ingredients were clearly fresh, but we couldn't get past how tough the dough was.  Not to mention our waiter never came back to check on us.  We ultimately had to get another waiter to give us our final bill.\n\nIf your in Brooklyn and are trying to find a good place to eat pizza...DONT GO HERE!!!", "author": "Ralphie F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-07", "description": "Some of the worst pizza I have ever had.  I live in NYC and will never go back again, so evident only tourist visit this place by the great reviews.  WAY, WAY better places in NYC that serve pizza that doesn't come from an assembly line.\n\nI have walked by the ridiculous line telling people to go somewhere else.  It is not worth the wait at all.", "author": "J B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-20", "description": "Its hard to miss this place at the corner with lots of people gathered around. I went here on a Wednesday night around 7pm by myself and there was barely any wait. Even for 2 people you would get seated quickly. \n\nThe menu is very simple: there are four types of pizzas you can order (no slices just pies) of two different sizes. Then you choose additional toppings. I chose a small mozzarella pizza with basil, pepperoni, and sun dried tomatoes. I should've chosen a basil pizza instead. \n\nThe price here is not worth it and the pizza was moderately okay. I think I would prefer dollar slices over this. Its only known for being a brick oven pizza place. The staff here do not seem friendly but the location is conveniently close to the Brooklyn Heights Promenade park.", "author": "Wilson A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-18", "description": "Worth waiting in the line. Pizzas are amazing! And the small size (for 2 people, as menu says) is way more than enough for 3 people starving to death :)", "author": "Yulia C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-21", "description": "The service was awful, the wannabe owner/bouncer was ridiculous.  I was repulsed by the lack of respect when it came to the horrid redesign of what is a gorgeous building, the inside made me want to throw up in my mouth.   The pizza was soggy and oily, I should have ordered well done. However, my family thought the pizza was excellent.   I would definetly not go back.  But, I will try Julianna's.", "author": "Danielle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-07", "description": "My bf and I were brought here by his sister and her husband when I first came to visit NY. It was so talked about it even became a number one place to stop by even before the statue of liberty. I never eat pizza because I'm health conscious but when your on vacation its game over!\n\nIt almost seemed like a cute whole in the wall place. My first impression was WOW that's a long line. I was expecting a LOT because of what people told me and seeing the line I thought this must be the BEST pizza. After about 25 min of waiting we were finally seated and I was so excited my smile looked like the joker. \n\nWe ordered 2 different types with sausages, mozzarella, basil and other toppings. OMG when I saw it, my impression was that is a huge pizza. It's the pizza on my profile picture, and yes it's bigger than my face. First bite was amazing, warm, hint of spice, just perfect. Not too cheesy or greasy. But I must say I think I was a tad disappointed because It was so hyped up that when I ate it, it just tasted like great pizza but nothing I would wait in line for no more than 15 min. And I like my pizza thin crusted (Venice, Italy style) so I was not a big fan of huge thick crust. But Overall it was a great experience and still very tasty.", "author": "Vanessa M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-29", "description": "O.g this place was burning up. We were on the second floor we were sweating it was so muggy... the pizza was ok  I give it 3 stars. But the service would be 5 Stars.. my daughter dropped her soda at the resturaunt  and I was going to clean it up and the waiter told me don't worry about it,  relax well clean it up when  u leave. He then gave us another soda on the house..", "author": "jennifer v."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "Shoutout to Mimi for his great service. We were originally planning on going to Julianne's down the street but we realized that they only serve foo foo pizza. Grimaldis was a real pizza joint. Would definitely come back.", "author": "Darius A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-04", "description": "I had a great experience at Grimaldis! Went on a Monday around 1:00 and the place was only half full. I know it's rare to not have a wait, but even if there was, the pizza is still so worth it! The menu is really straight forward: small or large pizza, and you can choose from regular or white. No slices. Toppings are around $2-$4 extra, regardless of you get them on half the pie or the whole pie. An additional important fact is that they take cash only.\n\nI was with a friend so we ordered a small regular pizza with meatballs, mushrooms, and salt cured olives. Basil, mozzarella, and sauce included. \n\nIt took all of 10 minutes to make and when it arrived it was INCREDIBLE. I have never had pizza that good before and I am drooling at the memory.\n\nThe whole bill came out to $20 and you just can't beat that for amazing pizza. Have never been to Lombardis so I can't make the comparison but I can't imagine it's better than this.", "author": "Kessley C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-31", "description": "Quintessential NYC foodie experience! I've been there more than twice and I love me some pizza. We usually come at a time to avoid the long line (weekdays, early afternoons, rainy days).  The simple decor just adds to the places identity and prob serves as a reminder that nothing's going to change. Once you're in and seated, quick service. \n\nSlices were a not too thin but also not too thick, crispy crust, slightly burned at the edges (which I don't mind). Sauce with great composition, not too overwhelming., sweet and  tangy....(mouth waters). Plain pie is delicious, so is the basil. One pie is large enough to satisfy 2 hungry people. Cheap prices. Cash only. \n\nIt's great pizza, it's also all about that experience of BK: the bridge, the promenade and ice cream factory.", "author": "Annie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "Good things come to those who wait, and for those who wait in line at Grimaldi's, you can expect that your pizza will be just like the service, GREAT! Freshly prepared pies are baked right in front of you. You can even see the guys tossing the dough in the air as you walk in. Now that's how you make a pizza!", "author": "Rita H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-16", "description": "I've eaten at other locations and so far this was the worst. I only tried it because of the history but the pizza tasted dry, rushed and slapped together. As much business as they receive you would think they would do some upgrades. Upstairs was extremely hot and stuffy with a small fan blowing directly on my table.", "author": "Porchia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "Cash only...that's my only real complaint. Sat upstairs,Saturday lunch, great looking classic NY Italian pizza shop (including the red/white checkered table cloths-music was too modern for me-I'm in the .05% that would rather listen to old school crooners or a nice waltz...ok maybe .001%...moving on). We ordered a small half cheese,half pepperoni. I've had mediocre pizza around NYC before, but this was not one of them. I generally don't eat pepperoni pizza often, but really enjoyed their take with the thicker/smaller diameter slices. Solid place, would go back.", "author": "Mike R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-26", "description": "So we heard about this place and decided to go because the rumor is that it's the best pizza in New York. We had to wait in line for 45 mins to be seated, which wasn't too cool \u0026 it was super hot outside. Then our fork was pretty dirty so we had to wash it our selfs with a cup of water. The pizza was amazing!!!! Not greasy at all. The cheese was soooo fresh but I wouldn't go there again.", "author": "Ambar T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}