{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-29", "description": "About half way through my 2 week New York visit and Grimaldi's has now jumped to the top of the pizza list. That oven throws out a lot of heat, the pizza arrived steaming and the tomato sauce bubbling. I added just sausage which had the distinctive aniseed flavour that some lack. The basics are all there, good crispy base, intense sauce spread in good proportion and mozzarella that retains it's flavour. Just don't try getting a photo of that famous oven, they really don't like it. Unlike Lombardi's where I was invited behind the counter to get a closer snap.", "author": "Scott L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-22", "description": "I guess nation-wide chains can be excellent, too.\n\nFantastic pizza.\n\nI went with my uncle, who said there wouldn't be a wait on a beautiful Saturday night, and I was really skeptical. It was the longest wait for a restaurant I've ever seen in my life.\n\nSo we just ordered a pizza to go and sat on the water. The pizza took about 5-10 minutes to come out. Perfect. We would have waited an hour otherwise.\n\nAgain, fantastic pizza. Don't miss this one if you can help it.", "author": "R E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-11", "description": "The line might seem frightening, but it really does move. We got a party of twelve in without too much trouble at all.\n\nPizza damn good. Chewy, thin crust just the way I like it. And the toppings stay put on it unlike other places I've been.\n\nCustomer service is a bit brisk, but it's a mad house in there so I can't really blame the staff. Don't expect a nice relaxing meal, only really tasty pizza.", "author": "Liz M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "Yessssss. Choppin' basil like a boss over my pizza and then drizzlin' olive oil all over those pies. Delicious grease (the good kind) and peppers and juiciness and a perfect thin crust. Best.", "author": "Mari N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-01", "description": "I've longed to try their pizzas for a while considering the unending lines people wait on to get in. It's kind of inconvenient for there to be one line only, for take outs and dining in.  After waiting 20 minutes, the line was still hardly moving, my boyfriend and I decided to return on a weekday instead. We came back for his birthday on a Wednesday afternoon and there was no line at all! We ordered a small 16'' pie with mushrooms and sausage and it was more than enough for two people. Their ingredients are fresh, thin crust, but our pie got a little watery from the mushrooms? Maybe next time we'll try mixing different toppings. I'm not sure if I would have left satisfied if we had to wait more than an hour for their pizza. Overall, I do look forward in going back to try different toppings and enjoying the view under the Brooklyn bridge.", "author": "Wen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-29", "description": "Waited for an hour and halfI am not a pizza person but this is very nice. Smells so good.", "author": "WW T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-30", "description": "If you've never been to New York or Grimaldi's it's worth going once.  However after that one experience you may or may not want to go back.  I am part of the latter group.\n\nI've eaten pizza at many places in NYC, and though I agree that the pizza is really good, I just felt uncomfortable there.  Therefore, the 3 star rating is all based on my opinion.\n\nFirst off, the location is nice, just walk towards the river and you get a nice view of the downtown area + brooklyn bridge at night.  It's also close to the subway, so somewhat easy access.\n\nThe gripe I have with grimaldi's is the overall experience.  The wait is long, and when you finally get a table, you're sitting in the middle of a long table shared with 2-3 other parties.  The decor is bleh (though I understand it's not trying to be fancy).  I think it has to be nice or a straight up hole in the wall... anything in between has no personality.\n\nThere is practically no interaction with the servers who seem lifeless and bored.  The menu is simple however, and it is cheaper than Lombardi's or DiFara's.\n\nIf I'm with friends who want to go to Grimaldi's then I'd gladly tag along, but if I'm the one making the decisions then I'd probably choose somewhere else.", "author": "Derrick D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-28", "description": "Ok pizza, but totally overrated. Do not stand in line for it, you can find 10 better places in little Italy.", "author": "C U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-03", "description": "So this pie maker was trained by Lombardi? I had to try it, especially with all the hype it gets. I had eaten at Lombardi's not too long ago, so I think this is a pretty fair comparison. Me, Jon, Peter and Bob went on a Sunday night (1/31/10). We were seated right away. \n\nThe pie we got was sausage and mushrooms. The crust here is definitely better than Lombardi's. I can't explain why, but it was a noticeable difference.The cheese and sauce were comparable between the two restaurants. Both were definitely a notch above your avg pizza joint. The sausage here had a questionable seasoning to it. I first thought the sauce tasted weird but after a quick round-table discussion, we all agreed the sausage was to blame. It wasn't spoiled or anything, but it definitely had a different taste than what I was normally used to. For some reason there were a few basil leaves on our pizza??? I didn't care for it at all, and it left a \"basil like\" taste in my mouth. Yuck. \n\nIMHO, this pizza is better than Lombardi's. I'm a crust kind of guy, and this place won out. The only reason I will probably stick to Lombardi's is because this place is a huge hassle to get to and the tables are really close together (really uncomfy if it's crowded). TYRA BANKS did come in and eat while my crew was there. ~*swoon*~ If it's good enough for her, it's good enough for me.", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-03", "description": "Best pizza I've ever had hands down.  And I've eaten ALOT of pizza in my day.  Even went to Naples to try a few pies and they come close but Grimaldi's takes the prize.  \n\nThere's usually a line but I think it's worth it.", "author": "Byron W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-27", "description": "Pizza is delicious. Their jalepeno peppers are really spicy but good! The wait to get in was a long line but moved very quickly. One thing I have to say is the service can work on their attitude. They are always in a rush to get people out. I understand that they have people waiting and are very busy. But the service here is the type that relies on their \"great pizzas\" for their tips. I'd recommend them to pay a little more attention to their tables. My server didn't ask us once how our pizza is or if we need anything. He dropped the check before asking if we want dessert or anything else.", "author": "Tina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-02", "description": "I am a pizza fiend and I have eaten slices all up and down the west coast, on the east coast from NYC to south beach and everywhere in between. I have been to the Grimaldi's on Front street in Brooklyn and the location in Phoenix Arizona. It is absolutely just the best pizza I have ever eaten. From cheese to toppings to crust everything comes together really well and I've finished their pizzas feeling full, satisfied, and wanting more. Yes the line when we walked up was a good 30 people deep but we simply placed an order over the phone, walked in 15 minutes later, picked up the pizza and walked a block down to a small park and we ate the whole pie on a bench looking at the Brooklyn Bridge. My girlfriend, my sister and I loved the pizza and the whole scene is something I'll always remember.", "author": "Conan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-25", "description": "We ordered the margherita pizza with sundried tomatoes on top. The toppings and mozzarella cheese was very FRESH! and the dough was crunchy but still soft in between, but the sauce didn't do it for me. It was a little sour, but not much flavor. If only the sauce tasted better then i would have definitely enjoyed the pizza.", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-29", "description": "This place is so overrated. The line is ridiculously long and even once you get seated you will wait ages for sub-par food. This is super thin-crust pizza, which I know some people like, but the toppings and sauce are watery so it all just ends up a soggy mess. Not cool. The only excuse to come here is if you're a tourist looking for the \"experience\" before or after walking the Brooklyn Bridge.", "author": "Riona Faith O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-11", "description": "My wife and I and 5 of our friends walked the Brooklyn Bridge and were looking forward to having pizza at Grimaldi's.  The line wasn't bad and we were able to get in on the first seating.  We sat upstairs and our server was terrible and the pizza was worse.  The server had an attitude and the pizza was black on the bottom and I don't mean a little black... I mean totally black.  What a waste of time and money.  It's amazing how  a good reputation can live on for years when clearly Grimaldi's has outlived it.  We were out of town guests who will never go back!!  Just so you know... I have never written a review of anything in my life... usually very easy going.", "author": "John D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-28", "description": "Wow, I am a believer, my brother always raved about how awesome Grimaldi's was and yes he has turned me into a Grimaldi's lover.  Yes i know people on chowhound laud thish palce and say its a tourist trap but damn that pizza was good.  We just finished up some porterhouses at Peter Luger's and decided to polish it off with some pizza.  Ordered a margherita to go since the lineup to eat in was bout 15 deep.  Wow just wow, tasted awesome, crust was good, sauce was delicious and the cheese was perfect.  I regret not going here earlier!, This was the best pizza out of my NY trip, beat out arturo's, lombardi's, john's, patsy's and umberto's on LI", "author": "J F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-30", "description": "This is the apex,\nthe best pizza in New York.\nIt's worth any wait.", "author": "Tim G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-20", "description": "Great location but pizza is mediocre at best. Granted I've only been once and it could've been a off day but not likely.", "author": "Kedar K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-16", "description": "My favorite Pizza place, I get it with sausage, peperoni and mushrooms. YUMMMY!! The first slice is always the best, as it's hot and your starving after waiting for 45 min to be seated in the summer. What I really like about the pizza is that it's not greasy compared to the ones up the block. Best times to go is the winter time where there is rarely any lines but the food is still the same.. I love going here an then head to the BK park and then have some ice cream or so...", "author": "Serena L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-02", "description": "I waited in line for 45 mins to have pizza that was just ok. They only take cash and the price seemed a bit pricey for what we got. The place was packed and super hot and super loud. The service was bad and it seemed like we were being rushed the whole time there. I understand it is a landmark and what not. I've been now and really feel no need to go back.", "author": "Nicole S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}