{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-05", "description": "Another over-hyped restaurant. We waited for about an hour and half in freezing cold and ended up leaving half of our pizza untouched. We were visiting from Atlanta and were sooooooo looking forward to some authentic New York pizza but were completely let down. The pizza lacked any sort of robust flavor and the ingredients were less than amazing. Compared to Antico's, my favorite pizza joint in Atlanta which imports all their ingredients straight from Napoli, Grimaldi's deserves 2 stars at most. \n\nVery disappointed!!", "author": "Yichen K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-04", "description": "Best bang for the buck. Pizza is pizza but at Grimaldi's, it's darn good. I've been here twice and it never disappoints.\n\nTIP: Order to go and get the anchovies topping. Then take a stroll at the waterfront right after.", "author": "Thigh C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "Loved the huge pepperoni pizza my family and I ordered to share! I must admit, I have had better pizza in the Little Italy area of Manhattan, but nonetheless, this place is an experience of its own!", "author": "Sunshyne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-01", "description": "WOW!  An hour wait to get in.  They don't even allow call in \"to go\" orders.  But OMG!  What a pizza!  The oldest pizza place in the nation, with a grandfathered in coal oven.\n\nCrisp and chewy crust (yep!  I am a crust girl), great tomatoes, thinly sliced fresh mozzarella cheese and other fresh ingredients make this pizza soooooo worth the wait!\n\nThey couldnt pack in another table if they tried.  The place is always so full that the dishwasher on a break was sitting eating his pizza on a chest freezer.  Autographed pictures of Frank Sinatra line one wall and along the other long wall are photos of all the famous people who have also stood on line to partake of the Grimaldi's experience!\n\nHey, I am a professional chef and a farmer's market addict!  I know good food and if you ever find yourself with an hour to kill in Brooklyn, I suggest you make a bee line for Grimaldi's!", "author": "M'Lisa K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-24", "description": "By far the best pizza i have ever had. THIN CRUST was crunchy to the very last bite. \n I waited in line for 1.5 hours and it was totally worthid.\nservice was good, toppings was fresh, environment was perfect.\nif you head towards the bathroom you can see the coal brick oven and the workers freshly making the doe. \nBEST PIZZA SO FAR!", "author": "Patrick L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-08", "description": "I've been to Naples...I've had the pizza.\nI'm being honest here, Grimaldi's is JUST AS GOOD as the pizza in Naples. \nIt truly was a party in my mouth. \nAll I kept thinking was \"this is what makes life worth living\".", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-08", "description": "I think Lombardi has a slight edge over Grimaldi but I'm not taking away anything from this place. It's still one of the best pizzas I've had... Just wished the place didnt have a take and go kind of feel to it", "author": "Josey V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-30", "description": "First time here since 2009 and probably will be the last time.\nMy girl friend and I split a large pizza.  Half with pepperoni and half with peppers and mushrooms.\nLets say we are both now at my apartment sick.\nCould it have been the hair on my plate?  The fly in my soda? or just a bad pizza?\n\nHorrible.  Go somewhere else and save yourself the walk.  This place is done.", "author": "Barney S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-30", "description": "This pizza is ok, I got the large original pie with a friend. We could have easily have gotten a small and been fine, I don't know if its worth the wait, I have had similar brick oven pizza at other places, with all the things to do in New York, I would rather spend my time somewhere else. \n\nThe pizza wasn't bad it just wasn't worth the wait.", "author": "Anish G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-07", "description": "Extremely underwhelming. I guess when people just line up for hours they have to make themselves feel better by telling themselves the food was good. The pizza is always amazing in Brooklyn which is another reason why this place sucks so bad. It is also not really that cheap not to mention they sell whole pies only LOL. This place is the worst. There are other places nearby that are way better but I guess if you're in NYC, try this one???? Meh I will def NOT be back.", "author": "Saad M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-15", "description": "I brought some family members here from out of town recently and was frankly disappointed with the quality of pizza. The pizza use to be so much better here as I remember. By the time the pies made it to our table it was cold, tough and rubbery. The dough had no crunch to it and it was dry. There however still is a line out the door and around the block, probably because tourists only know of this place and Lombardi's when it comes to pizza.. But in my opinion there are better pies and slices to be had in the city.\nSorry Grimaldi's but you've been downgraded!", "author": "Mehreen W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-09", "description": "Good pizza. Our first New York pizza. Service lacked and seating was crowded, but the food was good. Certainly would recommend it.", "author": "Karen D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-01", "description": "Bland! This pizza place would be amazing if you lived outside New York metro area. Big disappointment for the 45 wait.", "author": "Justin Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-30", "description": "Take a walk across the Brooklyn Bridge and treat yourself to Grimaldi's afterwards. Great New York thin crust pizza in a larger space than before. There's still a line but at least it moves faster!", "author": "Kat T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "Ah, my first NYC pizza. I've always been a fan of just regular 'ol pizza, loaded with toppings so to simplify it made me raise my eyebrow a bit. Well, Grimaldi's was a good first experience because I can honestly say I am now open to thin crusts (if they're made the Grimaldi's way hehe). We saw the line at 11 AM and thought we'd have to wait at least an hour. Luckily, the pizza gods were with us and decided to have the large corner table open to accommodate our group of seven right away (I tried to avoid eye contact with the people who were waiting in line ahead of us). I heard italian being spoken and a bunch of guys that looked like they knew pizza. Very fast paced with oldies music playing. \n\nWe ordered a regular pizza and a white pizza. I will always love a white pizza over a regular one with tomato sauce in any circumstance. Maybe because I'm a fatty and just love cheese and cream sauce, but I just love the richness of it all. The crust was very good, thin yet kind of buttery and a good consistency. Sauce was over the cheese on the regular one, and you can tell that it was fresh tomato, the freshest tomato sauce I've ever had. The white pizza was chock full of garlic but I looove garlic so I just about wanted to eat the whole pie myself. Eat fast though, because once it cools down the cheese got pretty rubbery.\n\nI stowed all of this carefully in my mind as I was determined to try Lombardi's later on during my trip, but Grimaldi's got a running start.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-17", "description": "One of the best pizza places in the city. The pie is so tasty and the prices are good too", "author": "Rudy D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-07", "description": "I was expecting at least a 45 minute wait. Possibly even prepared to stand there for two hours to try the famed Grimaldi's. \n\nWell ... I gotta say ... and I hardly ever swear, but ...\n\nNO WAIT, B*TCHES!!!! \n\n:-) \n\nScalding hot out of the oven, the pizza's crust has a tasty hint of charcoal, but because the fresh tomato sauce is so hot, the crust got soggy really fast. The best part was definitely the globs of cheese and the thick coins of pepperoni (we ordered half pepperoni \u0026 mushroom, half sausage \u0026 mushroom).\n\nEven though the pizza was very, very good, it wasn't the best I've ever had. *squeaks* It wasn't even the best pie I had that trip (you guys gotta try Zuppardi's in Connecticut). \n\nGrimaldi's is definitely an institution and not just all hype. I would definitely try it. When you're done, take a walk across the Brooklyn Bridge and be glad you're in New York.", "author": "Christine N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-13", "description": "I recently visited the new location, having been a fan when they were right next door. The line for waiting still remains, but, sadly, the old charm and fun is gone.  The new location is drab and the pizza was not as flavorful.", "author": "J K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-12", "description": "Good pizza but not worth the 45 minute line or the additional 45 minute wait to get our pizza served. However, the pepperoni is amazing and so is the cheese and the crust", "author": "Adonis M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-14", "description": "This place is pretty good. I liked it a little more just b/c when I got here there was no lines. I actually liked this place a lot more than Lombardi's. But prior to this I wasn't really a pizza fan, but this made me like pizza a little more.\n\nAlso it's right next to the Brooklyn Bridge, so it's a nice walk to walk off all that carb.", "author": "Victoria C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}