{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-18", "description": "Where pizza is concerned, there is nothing finer I've tasted. It seems wintry Monday nights are the time to go, as there was zero line-up (despite being relatively jammed indoors). We went pepperoni, mushroom and extra sauce, and the lattermost is highly recommended, as they seem to prefer a dryer pie than we do. I can't recommend Grimaldi's highly enough. Ensure you order a beer as chaser. Moretti haters like me will be cheered to see crisp Peroni available.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-03", "description": "We all have our favorites and while this is great pizza- I'll always put Lombardi's first! But Grimaldi's does have the Brooklyn Bridge \u0026 you just can't beat that. A visit here is a must for any out of towner! Walk them over on the bridge \u0026 then take the subway home while you're in a food coma. You have to go at some point \u0026 I'm sure that you won't be disappointed.", "author": "Sheena B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-02", "description": "It took the thin crust pizzas of Grimaldi's to have my party of Californians to swear off chain store pizza.  Worth a million stars for that and for the kick-ass setting underneath the Brooklyn Bridge and by the Brooklyn Heights hood.  I'm only giving four since Grimaldi's is ...[drumroll] ... a national pizza chain with branches in Hoboken, Nevada, and Arizona.  Also, the place is packed with tourists.", "author": "Jalop N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-24", "description": "Live in the hood and have gone here for years and years. But not too long ago they moved next door and the original grimaldis owners moved into the old spot. The new place is awful. Line literally 60 people deep sometimes, but Julianna's next door is 100 times better and they actually treat you well.  Go there. Don't wait on the Grimaldis line. They don't care about their customers and the food has gone down hill. Also no wine of beer!", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-31", "description": "This place is awesome. The only downside is the loooooong wait, but that's usually what you get with a place like this. The service was great, and the pizza was even better. Dont go unless you have your friends, you cant buy  by the slice. All in all, the place is great. And there's an ice cream factory down the block! Gotta love Brooklyn", "author": "Karen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-11", "description": "we got in line about 30 minutes early and a long ass line soon followed behind us. they opened about 30 minutes late AND a pizza tour bus came in before the rest of us, which was kind of annoying. luckily, the restaurant is big and we came early enough that we managed to snag a table once it had opened.\n\nthe service is quick, very polite, very young, and very good looking boys (two big thumbs up for that). our pizza came to our table and into our stomachs in no time.\n\nthis is the best pizza you'll ever have in brooklyn. maybe better than little italy in manhattan! the crust is thin, the mozzarella is fresh, the ingredient list is vast. we got pepperoni, mushrooms, sausage and sun dried tomatoes on our pie. the sun dried tomatoes really were the perfect touch. the mushrooms, however, didn't seem fresh to me so i'd skip on that one.\n\ni can see why people get in line for these pies, they're mighty delicious. in my opinion, i'd rather hold off my pizza craving til i'm back in new haven. but if i'm having too much of a pregnant moment, i'll be sure to come back here.", "author": "krys s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-27", "description": "Well worth the wait.  Freshest and tastiest pizza I have ever had.", "author": "Jason K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-29", "description": "BEST pizza in the city!  There's always a huge line, so call ahead if you don't want to wait.  The service is terrible, but the pies are seroiusly NO JOKE.  If you don't have time to go all the way to Brooklyn, Grimaldi's sister, Pasty, will suffice.", "author": "Vince A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-05", "description": "The best quality of pizza I have had so far was from Grimaldi's. We ordered a small pepperoni and it came out nice and steamy from it's famous brick oven. Overall it was well worth my 15 minute wait outside in the freezing cold.\n\nYou will also appreciate the homestyle atmosphere inside. I can't say anymore for this place except that its good. Enjoy!", "author": "Ed W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-26", "description": "OH WOW... I may have just found a new addiction... Grimaldi's pizza.  This lived up to the hype (despite my high expectations).  And amazingly, it was worth the 40-minute wait in the hot \u0026 humid weather on a late August summer evening amidst a line of hungry, hot, and sweaty tourists.  I'd do it again... and again... since this was probably the best pizza ever (still debating with a few other famous pizzerias but I think Grimaldi's will win me over).    \n\nThe place is old school Italian pizzeria vibe... energetic, red checkered table cloths on tables squeezed together tightly, pictures and the music of Frank Sinatra in the background, and service that is gruff but fun.  As you can tell from all the Yelp reviews here, it is a major tourist destination... as well it should be b/c this is what NY pizza is all about!  Do as the tourists do and make it a trip... ice cream at the Brooklyn Ice Cream Factory right down the block and check out the beautiful Manhattan skyline with the amazingly gorgeous Brooklyn Bridge (photo worthy... wish I had brought a real camera).  BUT do NOT do as the tourists do and go there at peak lunch or dinner hours, unless you don't mind waiting in line for over an hour.  Go during an off time and when you're feeling guilty about how much pizza you stuffed in your tummy, get over it by taking a nice stroll over the bridge to Manhattan.... perfect way to cap the meal / excursion.\n\nThe pizza is perfection... every component - the crust, tomato sauce, fresh mozzarella, the perfectly crispy and spicy pepperoni - was done just right.  I've never had such great pizza dough... chewy but still light / crispy taste, esp those first several bites after the pie has come fresh out of the brick oven.  My friend and I split a large (splurge for the large since it's only $2 more than the medium) and got half the pie Margherita style and the other half with pepperoni, sausage, and basil.  Both sides were delicious but I think the meat side won out... mainly due to the pepperoni, which I normally don't like that much but these were damn good.  Because the dough, cheese, and sauce is so good... you really can't go wrong with your choice of toppings here... probably just stick to a few though since too many toppings will mask the great essence of the pizza.\n\nAs we polished off the entire pie, I wished Grimaldi's was closer to me or they delivered.  But you know what... the experience would not be the same if it came that easily.  Also, I'd probably quickly gain 10 lbs if it were any closer.  Wherever I have my next slice will be tough... I just can't imagine anything better than this.  Let's just make sure I'm not subjected to Domino's or Papa John or any crap like that.", "author": "camilla c."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-04", "description": "We were excited to try out their pizza since we've heard so many good things about it. However, we were pretty disappointed. The sauce was too skimpy, and slightly too sweet. Not cheesy enough and didn't have enough flavor. It was decent but not great. Lombardi's pizza is so much better.", "author": "Cameron T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-25", "description": "Best pizza on this side of the pond. Nuff said.", "author": "Elisabeth S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-04", "description": "Grimaldi's pizza is awesome. Really delicious, and the ambiance of the place is certainly a Brooklyn experience. However, waiting in line for 1-2 hours? I don't think so. It's not worth the wait. I'll just keep to my memories of Grimaldi's (when it was named Patsy's) before it became a tourist trap.", "author": "Jacinda S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-29", "description": "My family came in from California and they heard we had to try the pizza at Grimaldi's.  We got there with a line outside and it went pretty quick which was good.  Once we where seated we ordered two pies and sodas.  We got our pizza and that was the last time we saw our waiter.  Needless to say the pizza was mediocre at best.  We ordered tartufo for dessert which was very good.  Being that we went there for the pizza though which wasn't good and the service was terrible I will not be going back nor recommending this place to anyone.  If you want good pizza in Brooklyn go over to L\u0026B spumoni garden.  It's not a thin crust pizza more of a deep dish square slice but delicious. The food there is also great.", "author": "Michele S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-06-21", "description": "GIVE ME YOUR TIRED, HUNGRY MASSES and grimaldi's will make them wait two hours for some pizza.  can't really hate on the product, it is top notch.  crispy bottom and fluffy inside with generous toppings.  the only time i didn't have to wait was when i went at about 4:00pm so if you can pretend you are 75 and that you have to eat dinner before most people get off work, that's one option.  another option served me well recently - after my cab driver and i drove all over park slope because he didn't know where the brooklyn bridge was and i didn't speak senegalese, i arrived to find the standard line of about 100 people.  no problem, dropped an order via the cellphone(be patient, call back, took me 4 trys), wandered down to the fulton ferry landing and my pie was ready 25 minutes later.  i strolled through the front doors past a sea of puppy-dog eyes and carted my pie right back out and two blocks away to empire-fulton ferry state park.  awesome views of the city skyline and benches to set up and and get my feed on.  if only the state park would let me drink...\n\nJCTSFR: 7.85", "author": "W G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-16", "description": "OMFG. Hands down the best pizza place in NY.   I've heard all the hype- two boots, lombardi's, EFF that.  Grimaldi's by far has the freshest best tasting dough out there.  They make the crust fresh and they don't use the shredded mozzarella cheese like most places.  Instead they use real blocks of cheese and place those liberally throughout the pizza.  Surprisingly enough they don't even use that much tomato sauce, while most people think that's how pizza should be made, i think that's part of the Grimaldi secret- less sauce, more real mozzarella.  who knows, they probably lace their dough with crack.  Either way, the shit's bananas.", "author": "Michael H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-09", "description": "Great pizza but horrible atmosphere. The place is dilapidated and suffers from Manhattan-style rush hour sidewalk crowding of tables. If you are in Garden CIty on Long Island, there is a excellent, CLEAN, and really popular Grimaldi's restaurant. The garden city location is what the brooklyn Grimaldi's should strive for by investing in their store. They make WAY too much profit to neglect their signature location!", "author": "Seren C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-19", "description": "For the price and taste this place can't be beat the value is exceptional for a New York pizzeria also the smokey flavor imbues the pizza with an amazing flavor.  The line is a give so be prepared to wait also this is a cash only establishment.   Go hear you won't be disappointed", "author": "Jeff G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-17", "description": "This place is not worth the hype / line.. The service sucks and the pizza isn't \"amazing,\" it's just normal. Ehhhhhh", "author": "Oyku S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-24", "description": "Oh my god, the best PIZZA I've ever had in my life.\n\nThe wait is going to be long. Really long. But still wait.\n\nThis is one of the very few places that I've been to where I understood what the \"fuss\" was all about.\n\nThe service is only mediocre because the old grandpa that walks around (I'm assuming is the owner or the manager...or Mr. Grimaldi??) makes you feel rushed. But I can understand when there is a long line outside that goes down the street.\n\nIf you're visiting Manhattan, you must go to Grimaldi's. Besides the awesome pizza, you get to check out the beautiful Brooklyn Bridge from below, the creepy Watch Tower and maybe will bump into a Jehovah's Witness or two.", "author": "Kelly G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}