{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-26", "description": "This place is BUSY! and you will probably wait a while but the pizza is absolutely amazing!\n\nThe line outside was pretty long! The guy who owns the place was coming out and calling people in by numbers depending on how many seats were available. Luckily I was by myself and a seat at the bar opened up pretty quickly.\n\nThe guy who served me was attentive and took the time to talk to the customers at the bar, even though he was clearly busy.\n\nYou can see the chefs behind the counter preparing all the freshly made pizzas to order.\n\nAll the ingredients in the pizza where so fresh, the mozzeralla, the sauce and the crust, all cooked in a coal brick oven. There wasn't really one thing that stood out more than the other, it was all thouroughly enjoyable.\n\n100% coming back here the next time I visit Brooklyn.", "author": "Dean B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-28", "description": "Worth the wait.\n\nAfter waiting for Grimaldi's for about 40 minutes in the cold New York air, we finally got a cozy table right by the window.  We already knew what we wanted.  A Large Regular Pizza.  It is pretty much a Pizza Margherita which is definitely my favorite kind of pizza!  It came out within 15 minutes.  Thin crust, melted fresh mozzarella, basil, crushed tomatoes, garlic, olive oil and parmesan cheese.  It was amazing and one of the best things I had in NYC!  After we polished off the thing, we ordered a small pizza with garlic, shrooms and onions.  It was also delicious but if I had to choose one, it would be the first pizza we had.\n\nGrimaldi's is located under the Brooklyn Bridge which is a nice reward after walking over it.  The best part?  Located just steps away is The Brooklyn Ice Cream Factory!  Pizza at Grimaldi's is a must if you are a pizza fan like me.", "author": "Ali C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-24", "description": "Went here for the first time after my gf hyped it up for weeks on end. Stopped by on a saturday around 5pm.\n\nUpon arriving, it took 45 minutes to get into the door (understandable given the fame). After ordering though, one of the waiters got upset over something w/ the other waiters and started shouting and slamming counter tops. This went on for a good 3-4 minutes and other patrons looked bewildered which made for awkward tension. \n\nAfter 30 minutes, the pizza came out lukewarm. It wasn't even hot. I asked for sausages and no lie, it looks like the chef had dropped little specks of sausages on by mistake; there were hardly any on. And the pizza was mediocre at best. The crust however was pretty good.\n\nAltogether, it was $20. Although it's not expensive, you could go out to a better local spot, save yourself an hour and 15 minutes, spend 1/4 of that and have a better time.\n\nI'm going to assume my experience is rare (e.g. the waiter outburst) and usually not the case. My gf agreed that this time around wasn't good for her either.", "author": "Sam T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-24", "description": "This place is definitely not worth it. The pizza is average and the service is horrible.  We walked up to the restaurant and encountered a huge line. You know how when you go to a club and they make people wait outside to make it look 'cool'? Yah, that's exactly what the vibe was.\n\nWe finally got a table but it took forever for them to take our order. Then it took nearly an hour for our pizza to arrive. No apologies. They should probably mention that there is only 1 oven and it will take about an hour to get your pizza. They responded to our complaints only with justification for their horrible service and said they would do something about the bill. They didn't do anything.\n\nThe manager came around and asked, 'how is everything?' and when we gave him an earful, he walked away. \n\nSeriously, not worth it. Don't waste your time.", "author": "April A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-18", "description": "Even after getting lost in Brooklyn for more than an hour in the freezing cold, I was still more than ecstatic to try Grimaldi's. Upon arriving, we couldn't get seated right away because half of our party wasn't there yet (they had trouble getting a cab). We waited outside in the cold staring at the yummy pizza and cozy customers inside. After 20 minutes of waiting in the cold, this jolly Italian man entering the restaurant asks us if we wanted pizza. We were kinda used to strangers at this point and said heck yes! He signaled us to come in and told the host to seat us even our whole party wasn't there. \"Get these ladies some pizza, it's cold outside!\"\n\nOnce our party arrived, we ordered two pizzas. One with olives and sausages. The other with sundried tomatoes, garlic, and mushrooms. The latter was seriously THE BEST PIZZA I'VE EVER HAD! HANDS DOWN. The price was also amazing. The six of us paid a little over $10 (even with a few orders of drinks). I will definitely come back next time I'm in the area.\n\nWe found out the jolly Italian man was the owner himself. He came by during our meal to see how we were doing. Such a nice and friendly man!", "author": "Pathu S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-15", "description": "I came here while visiting NY with some friends -- one of them said we absolutely had to try Grimaldi's. And we did. We stood in line for almost two hours. Was it worth it? Yes. Would I do it again? Probably not.\n\nI'd easily wait half an hour for these pizzas though -- delicious thin crust pizzas with chewy flavorful dough. The toppings are pretty expensive, but you really don't need them, what makes Grimaldi's shine is the dough and it's delicate ratio between cheese and sauce.\n\nTip: Get one of your friends to stand in line, walk around the corner to Jacque Torres and eat some salted caramel ice cream while you wait in line. (Bring your friend some too.)", "author": "Katherine L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-11", "description": "Don't get me wrong, the pizza was delicious.  However, it wasn't worth the hour wait to get it.  There is way better pizza in New York and you don't even have to go all the way to Brooklyn to get it. \n\nGlad I went so I can say that I've been there, but I wouldn't go again.", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-07", "description": "its a very solid pizza and a staple in NYC.  With that said its not nearly as good now that they have changed location and lost the original oven.  It as grandfathered into the last place they had but when they moved down the street they had to leave the oven because of the new laws.  Neverthe less if you have never had it, it is worth the trip to brooklyn.", "author": "Zach C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-19", "description": "We got VIP status since we were a party of five so luckily our wait in line was minimal - woo!  Bring your friends/fam with you so you can bypass all of the parties of two jockeying for the same 8 tables....you're welcome.\n\nhe pizza was delish and had a good ratio of cheese, basil and tomatoes/sauce. I liked the prep and cooking area so the germaphobe in me could watch our pizza from start to finish.\n\nCash money only too", "author": "Emily W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "Hype. This place has plenty of it. When I travel, food is a big thing for me, and so my expectations are set high. A friend of mine recommended this place, and this place did not disappoint. Set under the Brooklyn Bridge, Grimaldi's is known to be one of the places to go have a New York pizza. The wait time can be crazy ridiculous at times, and the way they handle the line, is a little bit on the old school side, but it works. Grimaldi's has been around for a while, and whatever isn't broken doesn't need to be fixed.\n\nThe wait is long. The service is par, but you have to understand that each server is handling a whole lot of things at once. This place is NOT for the impatient. Patience is rewarded with a one of a kind type of pie. The pizza is easily one of the best ones I have ever had. It actually changed how I see pizza as I know it. This is one of two places in New York that I feel define what New York pizza is. Mind you, I am a Californian that hasn't tried ALL of what New York has to offer. Anybody visiting New York must stop here for a bite.", "author": "Simon K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-26", "description": "6.01.08 In ordered to ever have authentic pizza it is to get it from a fired brick oven. That's mainly the whole reason why people love this place so much. \n\nI would say I like it but not love it. Would I come here to wait again? Nope.\nWould I actually come here again? Not really\nWas the pizza that good? It was good, but not the greatest.\nWhat I liked about it? The kind of cheese they put in it\nWhat I didn't like about it? The wait, the thin crust, pizza turned cold quick, it was really oily, the pizza itself seemed too soft and of course the fact that this is a tourist place. \n\nSo why the four stars? Its only because I couldn't give it a 3.5.", "author": "Mia L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-25", "description": "Long lines...expect a wait! Great pizza, but the older gentlemen tending the line outside is loud and rude. The pizza is great, but I have ate at other NYC establishments with just as good of a pizza, and with better service. An establishment should be thankful for their customers and not treating them as if they are an inconvenience.", "author": "Misty P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-11", "description": "The pizza is fantastic. There is a reason it is so famous!\n The prices are very reasonable too, and the staff is friendly. \nWe  usually over order ( 1 lg pie per person) and they always give us the same warning \" they're big\", I love it!   We always take some home and the next day it still tastes great. \nThere is usually a line outside the door, but it is worth the wait!", "author": "Rez H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-30", "description": "We got there on a Friday night around 6pm.  Although the wait wasn't too long (about 30min for 2ppl) we were getting irritated because the groups that came after us were being seated before us.  After we got in, we realized that their seating method was just a strategic way for them to cram as many people into their tiny tables.  While it's a smart way for them to maximize their profit, it's not a great way of customer service.\n\nOn to the pizza:  We ordered a Large Pizza with sausage, pepperoni and mushrooms.  When it came, it was huge! When we took our first bite it was delicious!  Loved the thin crust! The pizza wasn't overly cheesy and oily, the both of us were surprisingly able to finish the whole pizza! I will be back the next time we're in town.", "author": "Veronica N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "The BEST pizza! Came here a while ago on vacation, asked where to get the best pizza and someone said Grimaldis unders the brooklyn bridge. Really good! I'm looking forward to when I will be back in NYC to go again.", "author": "Meg J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-26", "description": "Never thought I would say a place is better than Lombardi's in Manhattan, but I have to say this pizza has more flavor.   The crust is a bit chewy for my taste, but the sauce and crust have fantastic flavor.  Well worth the trek out to DUMBO and the pizza can stand on its own without any additional toppings.", "author": "Peter S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-09", "description": "There is much better pizza in Brooklyn but if all the tourists want to wait in line and leave the other places free then I'm fine with that :)", "author": "Rachel G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-31", "description": "This pizza is fine, but this is New York, there's lots of good pizza. It makes absolutely no sense to wait in line for Grimaldi's, unless you want to spend your time with grumpy tourists getting in line because they were told to by their guidebooks.", "author": "Ian W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-31", "description": "Best pizza in town!  I have eaten here twice on my visits to New York City. Highly recommended!", "author": "Steve V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-13", "description": "So I came here from New Jersey since I've heard so much about this place. I got mozzarella and basil with chicken. I found the pizza very dry and with out flavor. There are better pizza spots in the city.", "author": "abby t."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}