{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-22", "description": "There was a very long line when we got here at 5pm on a Saturday (St. Patrick's Day), but we decided we might as well wait to see what the hype is all about. So we waited... and waited... for two minutes! We didn't change our mind, nope nope nope. We didn't sneak in. We got seated because the owner came out two minutes after we got in line, shouting he needed a party of five and we were the only group in line that had five people!\n\nWe got seated immediately in the first floor and were excited to eat after walking across the Manhattan bridge and Brooklyn bridge park. I observed the place to be very small and cramped. There were waiters rushing about to and fro the front counter where the pizza was made and the customers were trying to dodge them to get to their table or the bathroom. The pizza counter was just busy and they were working non-stop. The table we were in was tiny but we managed. We were just very close to the adjacent tables and were in the walkway to and from the bathrooms and the back kitchen.\n\nAn older gentleman, probably the father of the owner, asked if we ordered yet after a few minutes of waiting; and when we told him no, he summoned one of the waiters. We ordered three small pizzas at $12/each plus .50 cent for each topping: Pepperoni, margherita, and mushroom.\n\nWe waited for approximately ten minutes for our food and could tell that the other customers had been waiting longer because they were there before we were seated and still hadn't gotten their food.\n\nAfter a few more minutes, we finally got our pepperoni pizza and it smelled really good. The pizza was pre-sliced and each of the slices (5) were huge. The small is comparable to a medium sized pizza here in southern California. The generous amount of mozzarella cheese was melted everywhere on the pizza and some of it even got on the crust. The small round pieces of pepperoni was sufficient, but I could've had more of it. Each of the pizzas also had a distinct taste of their herb seasoning and the basil leaves from it were still intact on the center of the pie. The pizza was not thick at all and didn't have the usual thick bread (the filler type) because the toppings dominated the whole thing. The mushroom and margherita pizza came just as we were finishing the pepperoni. The margherita was more subtle and contained enough cheese, sauce, and the herbs. The yummy tomato sauce with the sun dried tomatoes stood out more with this pizza. I was really hungry at the time and kind of wanted more of the pepperoni goodness. But we still ate all but two slices of the margherita pizza. The mushroom pizza was okay. My other family members are mushroom lovers and they liked it a lot. I had the smallest slice of it and it didn't really stand out to me. Overall, the pizzas were decent. They weren't oily or too bready and the ingredient that stood out was the generous amount of cheese. The sauce on each of them was rich tomato and not the Ragu tasting stuff some pizzas have. I really liked the pepperoni because the small slices were thick and it was just enough to make the pizza meaty and be the classic pizza topping it's supposed to be.\n\nFuture patrons should be prepared for the loooooong line that could be an hour wait. The service was curt and the waiters do not do anything else but take your order, bring it, and re-fill your water. It's a busy place and the pizza could be well worth it, but if you're really hungry and need to eat within the hour, I'm pretty sure there are other pizza joints that could be better or similar quality pizzas without the wait. The pizza is pretty good and the pepperoni is probably the best one I've had. Next time, though, I'll ask for extra pepperoni.", "author": "Katherine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-18", "description": "A friend and I came here around 2pm on a Thursday afternoon. We waited in line for about 15 minutes before being seated, which was pretty good. The line moves pretty quickly, especially for parties of 2.\n\nWe ordered a large pie with sun-dried tomatoes. Oh. My. God. It was some of the best pizza I've ever had. The crust was crispy on the outside, but chewy and soft on the inside, and perfectly charred by the coal-fire brick oven. The sauce was sweet and very flavorful. I love that they put basil on the plain pies. You don't even need toppings with the basil on there, but the sun-dried tomatoes were a good choice.\n\nThe service was great, too. The waiters were attentive and helpful. I recommend going back to the bathroom and talking to the kitchen staff while you wait in line. They're really nice and taught me about the oven.\n\nYes, it's touristy, but it's popular because it's amazing. I can't wait to come back.", "author": "Molly L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-28", "description": "There is just something so Lady and the Tramp Romantique about sitting across a tiny table (covered with a red and white checkered table cloth) from the guy you are crazy about in an Italian restaurant. Can this review be trusted, written as it were, by a girl who shared the experience with the very boy with whom she is smitten? \n\nAlthough I've heard about Grimaldi's for years, I never went there. My boy was in town visiting NYC for the first time, and it seemed like the perfect thing to do in the late afternoon on a blustery fall Friday. \n\nWe were fortunate to only wait 10 minutes, tops, before we were ushered in in by the charming and friendly host. The place was packed--we were seated at the end of a long table, next to two older British tourists who were obviously so enamoured by the pizza, that they weren't speaking to each other. And they maybe uttered only two words in the pizza afterglow before paying the bill and politely asking us to get up so that they could walk past (if you are easily bothered by such things, you may just want to do take out here, as no matter what, you're going to have to get up at least twice to let people by you). \n\nWe ordered a small pie with fresh tomatoes and olives and it came out hot, bubbling and perfect, reminding me of the best pizza I ever had which was at the oldest pizzeria in Naples, and a glass of perfect Chianti. Although the place was loud, packed and BRIGHT, even, usually the biggest no-nos as far as ambiance is concerned, I realized that there was no other place in the world I would have rather been than right there in that instant.", "author": "Joi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-26", "description": "Walking across the Brooklyn Bridge is a must on a trip to New York. So when you get to the Brooklyn side you have to eat at Grimaldi's located almost underneath the bridge. Inside there's a big open pizza oven and you can see the pizzas being made.\n\nIt was at Grimaldi's we discovered the joys New Yorkers have known so long of folding the slice while you eat it. Unfortunately, first we stood in a 45 minute line for a table, but it was worth it. Definitely.\n\nEvery trip to New York should involve a trip to Grimaldi's and Lombardi's. It's anybody's guess as to whose pizza is better.", "author": "Kathleen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-28", "description": "I know I'm the millionth reviewer for this place but.. OH MA GAWDNESS! Grimaldi's makes any other pizza place hang their head in shame! Yes, it's worth the walk to get to this little hidden restaurant nearby the Brooklyn Bridge. Yes, it's worth the wait in line.\n\nIf your food is good, you don't need a fancy complicated menu. They offer custom-order pizzas and calzones. All baked in a coal oven versus the traditional brick ones. That's all you want, trust me. \n\nMy b/f and I shared a small pizza (16\") with sausages, garlic and sun-dried tomatoes with basil leaves. I don't normally have more than two slices of pizza but this time I ate half the pie. The dough was flavorful and chewy. The tomato sauce and cheese, the foundation of a good pizza was perfect!\n\nI left the place feeling sad because I won't have it again for a very long time. (Hmm.. how much for delivery from NYC to LA?)", "author": "Linny H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-21", "description": "Seriously, what is everyone's deal with this place? Holy fricken f$\u0026@, we spent an hour walking across the Brooklyn Bridge, through the dark streets of Dumbo to front street only to end up in a line, waiting for cash only pizza. I gotta be honest, I was excited, ready to taste yummy goodness, but-uh, no! Instead I got pizza unevenly cooked (some burnt, some doughy), with little to non-existent sauce or cheese!  we got a large pizza (8 slices), with tomatoes, ham, sausage, mushrooms and jalapeños...and paid $50 plus dollars! Next time I'm hitting Chinatown to get $5 dumplings!", "author": "Nicole L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-09", "description": "One of the best, fresh tasting pizzas I've had so far (I welcome other best pizzas, please suggest :) thanks)! The hour and up long wait in a monstrous line is well worth it. This is a cute little place, perfected with your NY Italianos. They have huuge thin pizzas. Everything you get is margherita style and $2 for addition of meats, veggies, and extra cheeses. Not at all super greasy unlike most chain restaurants and will definitely get you full after a slice or two. The waiters were all nice and cool to hear their accents (I couldn't distinguish between NY or Italian accent haha). The price is pretty decent too and worth it. Don't get intimidated by the long line as it tends to go fast. The guy that manages the line (is he the owner?) is good at keeping track of how many people per party and who he lets in next. WAIT AND SEE, you'll love this pizza\n\nOh and if you want to do take out, you still have to wait in line.", "author": "Faye F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-05", "description": "YES, it was worth the line. Even the New Yorker was willing to wait cuz the pizza is BOMB. \n\nTip, minimal topping is better like mushroom and sausage, cuz the tomato sauce and cheese is perfeeeect \n\nEven if you get \"take out\" you still have to wait in line, so just eat your pizza indoors with all the friendly servers!\n\nI love black olives, but it is WAY too overpowering on this pizza.", "author": "Janelle S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-11", "description": "Not good. Don't waste your time coming here and the service is not good at all. 1st they told us to wait in line when there was no line what so ever then we sat down and they had no beer 3rd they took forever to take our order 4th the pizza gets cold fast. So I don't recommend this place to anyone", "author": "Stephanie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-30", "description": "I've seen Grimaldi's on the plasma screen countless times--Samantha Brown, Travel Channel, Food Network, movies, etc--and the restaurant always seemed like the most incredible place in a really cool location.  While the notoriety and long lines speak volumes to the type of pizza this place serves, that's actually not what drew me here.\n\nOn my most recent trip to NYC, I decided to be a quintessential tourist and take a double decker bus tour.  I am so glad I did!  After discovering so many cool places (e.g., West Village, Fulton Market, Pier 17, DUMBO), I no longer have to be a carbon copy of my friends and frequent all of their haunts that don't necessarily suit my taste and interest.  \n\nAfter seeing Grimaldi's on the bus tour of downtown Brooklyn, I totally canned my friend's recommendations for dinner at some fancy spot in Greenwich Village and headed to Grimaldi's with my traveling buddy.  We got mixed up walking from the subway, but arrived just before closing.  There was no line and we had to order the pizza to go.  Not bad.  We headed down to the water front, ate on a park bench, and had one of the most memorable dining experiences I've had in all of NYC with Manhattan's skyline in the backdrop.\n\nGrimaldi's, thanks for an excellent white pizza!", "author": "Quinney H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-22", "description": "This is very good pizza, but not really the best ever in my opinion. I think I read to much hype here on Yelp and other places, and the infamous long lines outside the pizzeria make you think there is great pizza worth waiting for.   We only had to wait about 45 minutes to be seated on a Sunday evening, not terrible really, and the weather was nice. \n\nPizza is pretty basic, but  fresh and delicious, I loved the crust the best. We ordered one white pizza and one of the regulars (cheese/tomato/basil)  just to try both. They are a little skimpy on toppings, as my extra basil turned out to be maybe one more leaf of basil? \n\nHave to demote a star for service as the waiters are pretty all over the place, it took us ages to get the attention of our server and have him box up the pizza to go and get the bill. You would think that a place with such long lines would keep the tables moving, but they had us lingering there for a while when we were finished and ready to go. \n\nCASH ONLY.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-20", "description": "There is no better pizza than this. Just the best consistency and taste and the location is great because you can grab your pie and go right down to the park and chill with friends and family on a nice day or night. It's just so damn good. You will never taste a better pizza in your lifetime.", "author": "Stevie R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-16", "description": "Not my style. \n\nI wasn't disappointed, but I definitely expected some orgasmic action. Meh. And I definitely wouldn't wait in the ridiculously long lines that form here. \n\nLuckily, I timed it perfectly and did not have to wait at all. But I think the party I was with made the experience fun.", "author": "Shannon A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-16", "description": "I wish I could give six! Best pizza we have had in NYC! The crust sunk this basket crisp, thin but chewy and fresh! Red sauce , fresh mozzarella and we opted for olives (the black salty kind) with Italian sausage. An antipasto app and two sodas...38$!", "author": "Marcy Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-19", "description": "Have had and loved brick oven pizza, in other places, knowing all the while Grimaldi's was the highest bar, from what I have heard. But I figured how great can it be.\n\nand it was AmazinG. You must go. Now. I will be craving this pizza forever.", "author": "sam i."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-11", "description": "A great restaurant that lives up to its reputation. Staff is very friendly and accommodating. The giant cannoli is a great way to finish off dinner!", "author": "Basil D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-16", "description": "Classic NY pizza, one of the best in the city (therefore the world). THAT'S RIGHT I SAID IT.\n\nTakes a while to get in (plan at least 45 minutes to be safe), but once inside, you will be captivated by the ambience. From the dough flying in the air, the red and white checkered tables, the accents of the staff (and non-tourists), and ol' Blue Eyes' pictures on the wall, you will realize you have gotten yourself not a meal ahead of you, but an experience.\n\nThe pizza is outstanding. Thin crust, plenty of toppings. Do yourself a favor and go nuts. Extra mozzarella, pepperoni, sausage, mushroom, whatevers. Get two mediums. You found the place. You waited in line. You earned it.\n\nWaiting outside (T_T)\nWaiting inside (^_^)\nLooking at food (^_^)\nEating the food (^_^)\nPaying for food (^_^)\n\nGlad I came, and if it weren't for the line, I'd be back more often.\n\nPRODEBATE:\nMy take on this place vs. Lombardi's: tough one. Grimaldi's has better toppings (and they put more on), but Lombardi's has better sauce. And whenever I've been to Lombardis, the wait has not been nearly as long. They are both must-trys, but taking those factors into account, I'll choose Lombardi's.", "author": "Timothy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-18", "description": "Very very good pizza...but wont wait on line for more than 10 minutes...not worth waiting an hour for pizza. good fun  atmosphere inside, great vibe. fun historic place to experience delicious brick oven pizza. attentive staff. Mozzarella cheese pizzas! delicious.", "author": "Julia M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-11", "description": "in line for 10 minutes, waited one hour for our damn pizza. what the fuck.  it only takes 15 mins for a pizza to bake.", "author": "Mi V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-08", "description": "good pizza!  very fresh ingredients.  Friendly service.  If you drag the wait, call ahead, pick up the pizza, walk to the pier and eat it there!  I wish the crust was a bit crispier.  Other than that, every-time i decide to cross the Brooklyn bridge, i'd definitely eat here.\n\nThey moved one building over!  It's roomier and is able to accommodate more people!", "author": "Truc N."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}