{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-22", "description": "Hands down, one of the best pizza I've ever had (if not the best).  The crust was just so yummy, and perfectly thin and crisp, with a bit of char in the edges (gotta love that coal oven).  The sauce had the right proportion of tomato flavor and sweetness, and they don't put too much of it.  The mozzarella was fresh and melted perfectly.  Probably the only thing I would change would be a put in a bit more basil, but that's a matter of personal preference really (I looove basil), so I would just order a double portion of it if I ever come back.\n\nHubby got sausage and mushroom again on his half of the pizza, which was still pretty good, but IMO not as good as the original one, since the sausage flavor overpowers the rest of the ingredients, and makes it more greasy.\n\nSince it was a weekday, the line didn't seem to bad...it took us around half an hour before we got in, and around 15-20 min after to get our pizza.  There was this old Italian guy who seemed to be the \"expediter\" and got people in from the line fairly efficiently so the tables were pretty much filled at all times.\n\nI gotta say though, the pizza was totally worth the wait, and going all the way to Brooklyn.  I would go back to this place in a heartbeat if I'm ever back in NY.  This place puts Amici's to shame.  Dammit, why can't we get pizza like this in California?  Must really be that NY water...", "author": "Arlene M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-04", "description": "Yummm...!!! My NY friends took us here saying it was the best, and it did not disappoint. Apparently, there's usually a long line to get in, but we were there late on a Sunday and it only took 10 minutes to sit us. \n\nTip: Don't bring your shopping bags with you if you had a shopaholic day. The tables are tight and you'll practically have to sit ON them to keep 'em out of the way.", "author": "Shirley Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-09", "description": "Overpriced, over rated.  check out the Totono's in Coney Island - the original and the best.", "author": "Scott C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-07", "description": "Pizza wasn't bad, but it didn't live up to the hype.", "author": "Lillian C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-06", "description": "It seems redundant to review this place, but I feel a moral obligation to raise Grimaldi's averages to counterbalance the other reviewers who gave this place less than five stars.\n\nThis pizza is a serious contender for my last meal on earth. Absolutely the best pizza. We tested a plain cheese pizza, which is the pizza litmus test.  They have the whole formula down to a science. Fresh mozzerella.  Not \"fresh\" but actually fresh, as in the soft stuff you marinate in olive olive oil. Fresh basil leaves. A drizzle of extra virgin olive oil. A sprinkle of freshly ground black pepper. Lucious sauce. All atop a super thin crust and put into a blazingly hot coal-fired oven. Oh so amazing.  We had the secret coffee soda too which was so yummy I almost asked for another while waiting for our pie, but didn't because it was so busy. I am glad I didn't get another because it's a super sugared turbo charged caffeine rush which had me buzzing after just one.\n\nIt's worth the wait, the special trip to Brooklyn, enduring the snooty natives who sat next to us continually carping about mysterious breaches of ettiquette we tourists were making, and said natives wouldn't get up to let an old person to their seat, etc., etc.", "author": "Cynthia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-12", "description": "Oh my god, I have been craving Grimaldi's since I visited. I haven't found anything like it in Philly.\n\nThis is exactly the way I like my pizza - fresh mozzarella, fresh basil, not too much sauce, and thin crust that is very slightly singed. Next time I'll get extra basil.\n\nService is surly, but astonishingly fast. They don't like their patrons to linger very long after the food is gone. The space is tiny, so be prepared to become friendly with your neighbors at the next table.", "author": "Meg C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-26", "description": "The first restaurant I visited on my trip to New York.  Grimaldi's is considered one of the top 3 pizza places in New York; and I was fully prepared for a 2 hour wait which can be quite common.\n\nFortunately, we only had to wait five minutes to get a table; which was excellent.\n\nThe interior looked like any classic pizza parlor; with red checker cloth table covers, etc.  Seats were jammed very close together; resulting in sitting elbow to elbow with other patrons.\n\nAlthough we were seated quickly, it prob. took 15 minutes for someone to come by and take our order.\n\n20 minutes later, the large Pepperoni arrived.  A sparse covering of cheese, sauce and small pep slices along with a single leaf of basil.\n\nThe result... Pretty good pizza, but nothing to die for.  Not as flavorful as other NY style pizzas I have had in my life.  Overall, solid, but not memorable in any way.\n\nSome of the slices I grabbed from random places over the next few days were just as good.\n\nIf you want the classic pizza experience, visit Grimaldi's in Brooklyn.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "Always a long line but we didn't have to wait long since we were willing to sit at the bar. We got a small pepperoni and sausage pizza. It was good. They use fresh mozzarella and basil. I was hoping the pepperoni would be a little spicier but it was good. People friendly took a little bit to gt served though.", "author": "Pete W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-10", "description": "We walked right up to the door and realized that there was a line by the curb where you have to wait to get in. So, we got in line and asked what the deal was. Apparently the pizza is so good here people are willing to line up for a slice.\n\nWe got a seat by the window and took in the atmosphere. This is a prefect nyc place to experience what this city is all about. Good food, hometown pride, and local nyc history. Oh, and it is smack under the Brooklyn Bridge.\n\nYou have your choice of a regular pie, or large pie- No slices here. And the wines are cheap- $4 by the glass (hellz yea). So... this was hands down the best pizza I have ever had. It tastes a little different then traditional NY pizza, but so much better. The pizza was not over-cheesy or saucy; and the crust was super light.\n\nThis has been wrtiten up numerous times as the best pizza in NY- I agree :-)", "author": "Layne B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-22", "description": "Grimaldi's only has 248 reviews so I feel the urgent need to get the word out about this undiscovered little gem.\nSo undiscovered that there is a giant 45 min line wait outside, day or night, rain or shine.\nSo undiscovered that they will wedge you into a table with a bunch of other strangers so please do not take an awkward date here or everyone will get to hear your hilariously awkward conversation! I've always dreamt of being lucky enough to sit next to an awkward date in Grimaldi's, but it hasn't happened yet.\nSo undiscovered that by the time you order and get your pizza, you'd better have ordered a large even if you're only with one other person, because you will be STARVING.\nThe pizza will be amazing!\nOh - to be sure though, the wine here tastes like grape juice mixed with rubbing alcohol. Do not, under any circumstances, order it. Get a nice bottle of Brooklyn Lager instead! Or two...", "author": "Tina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-23", "description": "Favorite pizza joint in NY so far, hands down! Love this place. Who knows if this is the best technically executed pizza I've had, or if the 45 minute standing wait and surrounding hype help to soften any unflattering angles if there were any, but I never fail to swoon as soon as the tangy mozzarella splotched, perfectly crispy bed of juicy tomato sauce and co. Hits my tongue. The sauce and cheese both have a great depth of flavor, and the crust is perfect. Worth the wait, this is the pizza I dream about.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-15", "description": "In all fairness, the pizza is good.  But is it worth the wait?  No.  Juliana's down the street is the same pizza without the wait, and if you are willing to venture a little farther into Brooklyn, places like Lucali and Giuseppina's are even better.  However, if you have friends who come into town and they are desperate to go to Grimaldi's, you will not leave hungry.", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-26", "description": "In fairness, I haven't been in a bit, and at one time this was THE place to get NYC's best pizza, but while it's still very good it isn't quite on the same level as it used to be. I think a significant factor behind this has to do with consistency and how difficult that is to maintain as a place gets as popular as Grimaldi's has become.\n\nThe line to get in can often be ridiculously long during busy hours and that also takes away from the experience for those that like to go consistently. It's fine for going your first time as I'd think the rating one might give might be higher in this case, but if you want to go to a place consistently not having to wait on line for 30 minutes becomes more important to consider.\n\nA really good place for pizza to go to, also for its location, but if you don't want to wait forever to eat there are other options equally as good or better now-a-days.", "author": "Isaac B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-02", "description": "My friend will kill me, but I'm sorry to say - the sauce killed it. Good crust. Good mozzarella. Bad sauce. Definitely not worth the wait and way overrated. \n\nSorry, friend.", "author": "Ellen M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-23", "description": "A colleague of mine in San Jose, CA was going to a conference in Brooklyn Heights, and asked for some restaurant recommendations for him and his co-workers. I told him that if he wanted to get on the good graces of his co-workers, he should take them to Grimaldi's b/c it's hands down the best pizza in NYC. \n\nThat was six months ago.\n\nHis colleagues are still talking about Grimaldi's and how he has such great taste in food. His boss has also mentioned that he should be put in charge of scouting food places on all trips. \n\nNeedless to say, I told him that I get at least a 25% cut of whatever bonus he gets at the end of the year.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-27", "description": "It's literally under the Brooklyn Bridge...cool!!!  There is always a long line, but it's worth the wait.  \nI'm a thin-crust pizza fan...and their pizza is paper-thin and GOOD.  I got a large Garlic and Onion with Crushed Tomatoes.  The bottled root beer was unusually bland.  But the post-meal cappuccino was great!\nThe room is tiny (maybe 50 people max-cap)...always crowded...great service (someone's always watching for you to flag them down).  Beware!!!..CASH ONLY  \u0026  CLOSED BY 10:30 P.M.\nI'm going back!\n\nP.S.  ...upon exiting...turn right towards the water for a breath-taking view of the Manhattan skyline!", "author": "Ronnie V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-22", "description": "Grimaldi's is famous for something, because the line was a bit long. \n\nThe pizza was good. I've had equally good at Joe's Pizza on 6th Avenue and Bleecker Street. \n\nHaving said that, I think the Pizza is definitely worth checking out. My friends and I had 2 large cheese pizzas + sodas. It came out to $11 each. \n\nI don't think they accept credit cards.", "author": "Arshbir W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-29", "description": "So I went to the infamous Grimaldi's. Thanks to Yelp, I felt the need to go there. And since my friend who works in downtown Brooklyn got out of work much earlier than me, I forced him to go early and start waiting in line. \n\nWait time: I went late afternoon/ early evening on a weekday, right after work. The wait was only 15- 20 minutes long. It really wasn't that bad. However, when my friends and I left, there was a long line building up. I guess everyone was getting ready for dinner?\n\nService: Everyone looked so miserable. They weren't exactly rude to me, but they didn't seem to make much of an effort to come outside and tell us there were open tables or spend too much time helping each customer. \n\nPizza: Three other people and I shared a garlic all over, half pepperoni and half mushroom large pizza.  Price came out to be like $7-8 per person. It was very flavorful and filling, and I would say better than another brick oven place (john's?) I went to in Manhattan that had a long line. However, my Michigan friend who has had Chicago-style pizza said it was not bad...\"but it's not amazing.\" It's also suggested that if you go here, don't go for just plain cheese pizza.  And it should always be savored when it is still hot.  \n\nAlso, beautiful view nearby. I will definitely go again.", "author": "Lily N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-07", "description": "I know this is very subjective but I find this pizza to be consistently good. I have been going there for over 20 years and it's always just right!! Believe me, it's WAAAAYYYYY better than Di fara's, and you don't have to wait 2 hours for a pizza like you do at Di faras.", "author": "derrick c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-28", "description": "One of the Best pizza joints in NY and Brooklyn.. For thies looking for a unique experience its s must...", "author": "Kj N."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}