{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "Grimaldi's serves up tasty coal-fired pizza, but I'll be honest, I don't think it's worth the hype.  And the service definitely needs improving.\n\nWe originally set out with alternate lunch plans, but came down to Grimaldi's when they didn't pan out as intended.  The line wasn't too bad - just to the end of the building - which by the way, has relocated to the corner storefront.\n\nAfter about a 25 minute wait, we were seated in the far corner of the upstairs dining room.  It took forever to be acknowledged by a server (after several parties seated after us had already placed their orders and received their drinks), but we were ready with our order when he finally came over.  \n\nWe opted for a large \"regular\" pie with pepperoni and fresh garlic.  The \"regular\" only means that your pie is made with tomato sauce, rather than a white pizza (sans sauce).  Our drinks were essentially slammed on the table in front of us, which I didn't really understand, and it was definitely a challenge to order a second round.\n\nThe pie didn't take too long to make it to our table.  The crust was perfect - not too crispy, but not too chewy.  The toppings were relatively well-placed, and the flavor was great.  The large pie was the exact right amount of pizza for our hungry group of 3 (including one bird-like eater).  For larger groups and/or heartier eaters, a second pie is a necessity.\n\nThe pizza itself is the only reason Grimaldi's gets 4 stars from me.  The service makes me want to give 2.5-stars, max.  I understand the place is busy, but Grimaldi's is making money hand-over-fist (and all cash, at that!), so hire a couple more servers (or give them some customer-service training) so your patrons can have a pleasant dining experience, and be eager to return!  Our server's slamming the drinks on our table without any regard to who ordered what really bothered me, as did the fact that quite a few other tables in our general vicinity were treated with a helluva lot more courtesy.", "author": "Eve C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-28", "description": "Was very disappointed with the pizza. It was cold and was bland.. I waited 2 hours  outside just to be seated.  The prices were reasonable and so was the canoli. Would not be going back ever again", "author": "Jeanette V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-12", "description": "More of a review for the arsehole guy at the door, but hey, they put him there. Doing the tourist thing (while waiting for table at Juliana's) went to just look in doorway - grimaldi's hosthole says \"hey you can't do that we're way too busy\" - looking in doorway is going to effect that how?", "author": "Jim G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-18", "description": "I have been trying all of the local pizza places in the NYC area and we decided to come to the original grimaldi's in brooklyn.  We came on a friday night around 7 pm after walking around the brooklyn promenade and walked right into the restaurant without a wait.  Was pleasantly surprised there was no wait.\n\nHad a white pizza and it was pretty good.  The oven seemed a little uneven because half of the pizza was somewhat burnt.  Overall, the pizza was pretty good, very thin crust and tasty.", "author": "Steve E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-21", "description": "For context, I love this style of pizza so its hard to disappoint me.  This place has a lot of hype and the lines that come with it but we were seated within 10 minutes on Sunday around 2pm.  \n\nIt's clearly a pizza production and I felt our pie was inconsistent in dough thickness and charred vs uncharred areas but that's probably to be expected with turning pizzas at such a high pace. Like I said, I like this style pizza so no harm by me. \n\nI would definitely put it above DiFara's.. maybe tied with Frank Pepe.\n\nPS - why can't i have a beer with my pizza here though?!", "author": "Cailin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-31", "description": "I think I've figured out their business model: make everyone wait outside in line for two hours, have them starve to death, then serve them pizza and they will automatically say it's good.\n\nThe pizza really is THAT good, but I really can't tell if that's the hunger or taste buds talking. \n\nNonetheless, you have been warned. People say go late on a Sunday night, but we still waited two hours. \n\nLesson learned: bring some snacks and a chair.", "author": "Alice T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-24", "description": "had to wait in line for pizza but it was okay. the wait wasn't terribly long. However, once inside, I felt like the wait for someone to get our order and give us our food was kind of long. The pizza was yummy but I think pizza, is pizza. Maybe if I ordered the other things, it may be different. I may/may not be back depending on if I am going to go for a walk in the park. Overall, I liked it.", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "The Short: So far one of my top pies in NY.  Great location near the piers.  Reasonably priced around $14 depending on toppings for a large.  Crust is thin, but thick enough to keep its shape and prevent flopping. \n\nThe Long:\nI came here with a couple friends after first going to Lombardi's to compare the two of the best acclaimed pizzas in New York.  I have to say that Grimaldi's won the competition.  We got there around 6 on a saturday and there actually was no line.  We were told to go upstairs and see Frank.  Sure enough Frank was waiting and got us seated.  We ordered a large sausage pizza and it took a little while for it to come out so know that you might have to wait a little bit.  The crust was delicious.  It was a good thin crust, but it didn't fall apart (like Lombardi's did).  The sausage, cheese, and sauce were really good quality and quite tasty and there was a good balance of topping to cheese and sauce.  Overall a great experience and a must try if you're in Brooklyn.  It's easy on the budget too. The only thing Lombardi's has over Grimaldi's is that their sauce is a little more flavorful and sweeter.  Other than that my vote goes to Grimaldi's!", "author": "Greg M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-07", "description": "Had friends visit from out of town, and there is not better NY experience than NY pizza so we decided to do our one touristy thing for the weekend and do Brooklyn bridge and Grimaldis.\nWe arrived at 11:35 (opens at noon) and we were at the front of the line, probably within the first 15 people so when it opened at noon we were seated right away. Ordered all white pie, and regular with mushroom and onion. We all liked the all white the best, so maybe worth giving it a whirl! \nCash only, so prepare yourself for that.\nOverall it was good for a touristy thing to do, we all liked it and had a great time. The service was mediocre, but they know they can get away with it because they are a tourist hot spot, nothing you can do about that....", "author": "Kari g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-08", "description": "Talk about visiting NY and I'm pretty sure you can't avoid Grimaldi's being brought up.  Umm the only thing that they never bring up is that it's CASH ONLY! My friends and I made the trek here from Manhattan to try this glorious pizza place out.\n\nWe got here around 5, and there was a short but not terrible line. We got SUPER lucky though because they were looking for a 3 party group to seat, so we only waited in line for about 5-8 minutes! Sat down and we already knew what we wanted, large pizza w/ mushrooms, sun dried tomatoes, italian sausage and pepperoni. It took about half an hour to come out, and it seemed even longer becuase we were all hungry.\n\nFinally the pizza came out and it looked gooooooooooood. I had to warn my friends not to not to dig in until I managed to snap a picture! The pizza was good, but to be honest I wasn't blown away...  the crust wasn't crispy or crunchy, I'm not sure if it's a NY thing, but I had expected more texture and less.. mushy. BUT, besides that the pizza was good. It came out piping hot, there was a bunch of delicious fresh mozzerella, the tomatoes were good and overall very enjoyable! It just wasn't life changing, I guess I hyped it up for myself. Something good to keep in mind when trying out this place.\n\nOverall not a bad experience, but I'm not sure it would be worth the long wait (that I didn't have to endure). The price was good, it came out to about $10 per person and that's with tip! I recommend going over at off hours so the line isn't as long. We left there around 7 and the line tripled!", "author": "Teresa N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-23", "description": "Yum, do it at least once, here's why:\n\n\nThe BRICK OVEN PIZZA is yummmmmmy, especially because you'll wait a long time while smelling the aroma of fresh dough and cheese.  The crust is crispy aka perfect\n\nLONG WAIT, only because everyone knows it's there.\n\nDIVE \u0026 FAMILY SPOT means you get some nice service and it's got that old, homey feeling\n\nIt's just a fun place to go after the Brooklyn Bridge walk\n\n\n\n**Pizza rating: 8/10 - brick oven, saucy, thin crust", "author": "Clementine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-05", "description": "Delicious, authentic pizza! I loved the Margarita pizza the best.\n\nIf they've got em, order the brownie cookies for dessert (you better save room, they are worth it).", "author": "Laura B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-20", "description": "I don't know why everyone thinks this place is so good.  I went there in the afternoon and was faced with the typical long line (quoted 40 min. wait).  Since I was by myself they took me in right away and sat me at the counter, which I thought was great.  However, I sat there for 10-15 minutes without anyone acknowledging me even though a number of different servers walked behind the counter in front of me.  I finally said something and someone came over to take my order.  The service was subpar to say the least.  My interaction with my server totaled about one minute for my entire meal. It seems like they are so used to being extremely busy, and dealing with a lot of tourists, that they just don't care. Maybe I caught them at a bad time.  I hope it's not that bad all of the time.\n\nAs far as the pizza goes, I thought it was just average. I ordered a Regular (tomato sauce, cheese and basil). I know the coal oven is supposed to be special but I really didn't think it was worth all the hype or for a long wait.  I've had a lot of wood fire pizzas and various artisinal pizzas that I thought were much, much better.\n\nIf you're in the area and have time to kill, go for it.  If not, don't bother.", "author": "Michi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-21", "description": "It's a great little place that apparently everyone knows about. This was the first time my brother and I were in New York and we decided on my friend's suggestion to go and eat some Grimaldi's. We were in line for about 15 minutes before being seated. We waited for another 15 to get our food, but it was well worth it. The pizza was really big so neither of us could finish it, but we brought it back with us. \n\nGreat pizza Grimaldi's. Definitely on the list of places to go if you've never been to New York, but with the wait time, it's just a bit too long for people living there I think,", "author": "Nina Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-19", "description": "If there is no line, fine, go for the experience.\n\nIf there is a line, don't go and don't feel defeated...the pizza really is nothing great!!!\n\nThe servers were semi-snobby....and the food...mediocre!!!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-01", "description": "This is a must try place whether you're a local or a tourist. \n\nAfter a nice walk on the Brooklyn Bridge a good pie is the best reward. We ordered a small mushroom, pepperoni and sausage pizza. All of the ingredients were fresh. The crust was perfectly cooked, just the right amount of crunch. The sauce was tangy and flavorful. . Very good pie! They also have a good selection of beers, wines and other beverages. I ordered the Black Cherry soda and my husband had a Peroni.\n\nI do recommend you go early. We went on a Monday at a little past noon and did not have to wait to be seated. When we left there was already a line. I will definitely be back.", "author": "Belen R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-13", "description": "Let's get something straight Patsy Grimaldi, sold the name of his pizza in 1998. So excuse me, if it irks me as a native Brooklynite, to see a sign in front of Grimaldis claiming to be the real Grimaldis. The real Grimaldi's is right next door at Juliana's and on many a night you can walk in and see Patsy there to greet you. Juliana's is by far the best pizza not only on Brooklyn, but in all of New York. Shame on you Grimaldi's for trying to lure customers in with such a bold face lie.", "author": "Harriet L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-14", "description": "Great crust, fresh sauce (crushed San Marzanos) and baked in coal fired oven with just enough charred bits to give it that artisanal taste but still remained chewy and soft.\n\nWell done fellows you have lived up to your reputation.\n\nThe atmosphere of the place is nothing remarkable but the food is surely worth going for.", "author": "Todd Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-28", "description": "This is my first time here and I was excited to try this famous pizza spot I ordered a large pie with onions pepperoni and extra sauce the pizza got to the table and it was kind of soggy which I wasn't crazy about and the onions weren't chopped properly they were way too thick I had to remove a lot of them. I did enjoy the pepperonis they tasted really authentic and the service was really fast.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-27", "description": "Grimaldi's pizza is pretty good.  \n\nThe debate for Grimaldi's vs Lombardi's reminds me of the debate between Pat's or Geno's Cheesesteaks in Philly.\nJust pick one.  They're both pretty good.\n\nThe seats are cramped and crowded.  I love the fresh sliced mozzarella.  The crust was pretty nice and there was a very small bit of char on it. \n\nI had both the white pizza and traditional red pizza.  \nIt's a really good pizza as long as you don't overload it and go crazy with topping-you'll end up with a soggy crust. \n\nCome here during the week in the early afternoon so you don't have to suffer an intolerable wait.", "author": "Richard D."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}