{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "Ugh this is without a doubt the best pizza I have ever tasted, and it saddens me that I have to live in Glasgow where this pizza is not at all accessible. You'll probably have to wait in a queue no matter what time you turn up, and you'll wonder if this pizza is worth queuing over, but let me tell you yes, yes it is. \n\nMy friend Maria and I went here for lunch last week and queued outside for about a half hour. It was really hot and there was a pizza place next door with no queue. We thought about heading there but we decided to wait it out and I'm so glad we did. \n\nOnce inside we got our table and our order was taken so quickly. We ordered a small ham, mushroom and garlic pizza, and trust me a small is by far enough for 2 people. It came within about 15 minutes and we literally devoured it. \n\nThe staff in here were really efficient, the drinks and the food came so quickly, and the prices are great considering how much food you actually get. I would come back here every single time I wanted pizza if I could. \n\nThe restaurant doesn't do slices, only whole pizzas, and don't do delivery, but do do takeaway!", "author": "Martyn M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-13", "description": "This is supposed to be one of the best pizza places in New York, but I didn't think so. The pizza was bland and boring. The host was rude. I was waiting in line with my dog while my fiance went to the atm. The host said \"I can't seat you. You have dog\". I said i understand and was just here to pick up. He rudely asked \"whose gonna put in ur order?\" Which btw i had already told him my fiance would, once he gets back. He said \"you don't need to be here, he can come in, put the order and we can bring it out.\" It may just have been a language gap, but I thought he was a rude old man, and I am never eating there again, even if they do indeed live up to their reputation. There are hundreds of good pizza places with half pleasant hosts I can go to in this city.", "author": "Shalini I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-23", "description": "Mediocre, overpriced pizza. Would've been nice to have more notices of the whole \"cash only\" thing before the check arrived. It's really inconvenient and embarrassing to have to leave the restaurant to hit an ATM, tends to spoil the meal.", "author": "Sampo H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-22", "description": "Pro tip. Go when it is raining or during midweek. I have never waited for a table in my life. \n\nMy neighbor told me once I had to get a peperoni and garlic, I am now hooked. It kind of suck to have to order two pizzas every time I guy but what can you do. \n\nNote they also have a new location in Kips Bay which also doesnt seem to have a line.", "author": "Christoff F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-23", "description": "Here you have to come just to eat and go: No wifi, no credit cards, no beer(or anything alcoholic), no variety, only Pizza or Calzone.\nOtherwise that, the pizza is not the best, but it's good enough to go. \nI think they are overrated,  because they call themselves the \"best New York Pizza\". \nAnd there are two better places to go in the some corner, with everything that's not offered here and better service and flavor!", "author": "Alexandre M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-12", "description": "Grimaldi's is high quality, very old school pizza that New Yorkers themselves are not afraid to patronize. The shop recently moved across the street as the complicated result of a health violation. They're doing well in the new joint and while service is a bit slow, they are trying hard and there is no bad attitude except maybe while you're on line waiting for a table - the old man is definitely not a people person and probably a bit cranky after 20 years of doing the same thing.\n\nDon't be afraid to get toppings. This isn't your typical street slice where there's no point getting anything other than cheese. We enjoyed sausages, onions, extra cheese, and pepperoni, with a side of anchovies. Their house wine is pretty decent too and doesn't break the bank.\n\nDefinitely not something you should do every week -- but not something you avoid merely because 'everyone does it.' It's good stuff, people.", "author": "Josh K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-08", "description": "Being the Italian girl I am...perfecto!! Get there before the doors open cuz there will be a line down the street.", "author": "Tracy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-23", "description": "The best tip I can give you for going to Grimaldi's is: Go in a party of 2! \n\nOr be willing to split up in a party of 2 at least. The two of us got on that infamous line that seemed like it would not budge. We went there knowing that and told ourselves to be patient. What we didn't know was they periodically call out looking to fill small tables for 2 and we surprisingly managed to cut ahead of about 40 people. What luck! We waited a while to be served. The pizza took a while to produce but came nice and piping hot. Their tomato sauce was on the sweeter side. We took about an hour to eat, get our check, and head out. And on the way out we spotted the party that was right ahead of us in the line. Yes, they were still waiting in the line. I kid you not. So, if you don't want to be like them, leave the baby home, folks. \n\nThey say \"Hunger is the best spice\" but I'd rather just have good old pepperoni on my pizzas.", "author": "Yad L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-21", "description": "Coal brick oven fired pizza?! Tell me more! My fiancée and I had just finished a morning run across the Brooklyn Bridge and had planned to go to Grimaldi's on her suggestion. We got there about 15 minutes before they opened and there was already a big line outside waiting to get in. Fortunately, we made the first wave of customers and didn't have to wait!\n\nFrom our upstairs table we were able to watch as our pizza was made. I kept thinking they weren't putting nearly enough sauce on it, but when the pizza came I was pleasantly surprised, and would be quite content if there was less sauce on my pizzas from other places now.\n\nA big plus upstairs, there were electric outlets by a number of the tables, so we could charge our phones if needed. My only gripe is that there was no bacon on the menu to add to the pizza!", "author": "Greg W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-19", "description": "The pizza is ok. The service is nonexistent and the restaurant experience was nothing special. We waited in line outside for an hour (if you wanna get inside quick then you should go in large groups since they seat the big groups first no matter how long you've waited in line) and got seated finally only to wait another 30 mins for our food. We got our pizza and to my surprise it felt like I was eating pizza from any of the pizza places in New York. It was ok. Had I known I would've just ran into a small shop and grabbed a slice and went on my way. Sadly it's one of those restaurants that you only try once. Too bad Grimaldis.", "author": "A J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-09", "description": "Meh.\n\nOn a late summer *ahem - it was HOT* Saturday afternoon, waited over 45 minutes just to get in the door \u0026 get a table.  Our table was upstairs.  The a/c was broken.  *cries*\n\nWe also were let in about halfway through that evening hour where they refresh the oven.  So we were starving before we ever arrived \u0026 lost about 2 pounds each as our stomachs cannabalized themselves.\n\nWe ordered our pizza (pepperoni \u0026 sausage) when the oven was ready (the waiter would not take orders before it was).  We probably waited another 30mins for the pizza.  (Pizzas are sold whole only, btw; NO  individual slices are sold.)\n\nAt this point it's been, like, 2 hours since we were hungry.  By the time the pizza came, we were on the other side of STARVING.  STARVING!!!!  Oh my goodness!\n\nThe pizzas arrived upstairs piping h-o-double-t.  I was ready.  I was fully prepared to slide off of my chair from the deliciousness.  I was poised to faint from the sheer delectability that had been placed in front of me.  I'd read the reviews, I'd heard the chatter of the folks in line, I'd seen the satisfied faces of those who left.  I WAS READY!\n\nBite 1.  *no angels singing*\n\nBite 2.  *no seven swams a swimming*\n\nBites 3-6.  *NOOOO GOLDEN RINGS*\n\nI'd been misled.  I'd been lied to.  I had been knocked unconscious and hypnotized awake to believe that Grimaldi's was the best pizza Brooklyn - NY, even - had to offer.\n\nI was mad and I want everybody to know it!\n\nAll that hype.  All that time on my poor aching feet after a walk through the city and across the bridge.  For this.  For Grimaldi's.\n\nThe cheese was chewy, not stringy, not melty.  The sauce was the best thing on the pizza.  Not too sweet, bursting with tomato flavor.  The pepperoni was oily - oil was flying everywhere.  The sausage is placed raw on the pizza and then \"cooked\" on the pizza in the oven (but some of my pieces were still raw).  Where the heck was the crispness to my mothereffing crust?!\n\nTwo hours of hunger.  Review after review after review of hype.  Step after step after step on the Brooklyn Bridge, many of the last hundred taken with surety that I was about to indulge in some of the best pizza around.\n\nAll for nothing.\n\nThanks, Grimaldi's.  Thanks for nothing.\n\n2 stars for ambience, excitement, being able to watch the pizzas being made \u0026 the comraderie with other tourists.", "author": "Amber L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-25", "description": "Hey Paisan! ...Grimaldi's has been one of my longest-running \"To Try\" bookmarks, but it's been kinda tough since I live in San Francisco. However, I take periodic trips to New York just to eat and see shows and eat and take in the culture and eat. You get the drift. \n\nWell, the inevitable lines had daunted me before, so this time, my friend Carlos and I decided to go there at 10PM on a weeknight since they close at 11. If you can hold out that long, that's the key since the place is fairly empty at that hour on a Wednesday. In fact, we got the table next to the window, so we were quite happy and had moved from peckish to bulimic with our respective appetites. \n\nThere was no doubt we were going for the 18-inch Large for $14. We asked for mushrooms and black olives, as well as sausage on half of it. Each extra ingredient costs an additional $2. It already comes with melted slices of fresh mozzarella, tomato, basil, and their freshly made dough. Our order came out in no time, and the result was sheer heaven (see my photo). Dare I repeat the obvious...it's the best New York-style pizza I've had since my first slice of Original Ray's during the early Reagan years. \n\nThe secret is their coal-fired brick oven where in a flash, the pizza picks up a smokiness and the crust becomes light and crisp. We devoured it in twenty minutes...tops (see sad result in my photo). We even got a free dessert since the waiter forgot to get us our post-pizza cappuccinos. It was their Tartufo, a frozen ice cream concoction shaped like a chocolate-covered apple with a jammy center (see my photo). That was gone in about five minutes. \n\nService was terrifically friendly. The Italiano waiter told us the daily special was pizza. While I love a walk on the Brooklyn Bridge as much as anyone else, it becomes less appealing at night with the temperature dipping below thirty. We took the A-train to High Street where the stroll down to Old Fulton Street was a breeze. Try it for yourself...now that's New York. \n\nFOOD - 5 stars...pizza my heart \nAMBIANCE - 4 stars...checkered tablecloths, old photos of Sinatra...get the picture, paisan? (see my photo)\nSERVICE - 4.5 stars...friendly like you're a real goombah \nTOTAL - 5 stars...let's face it, it's the must-go pizza stop in NYC", "author": "Ed U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-05", "description": "No Credit Cards.\nNo Reservations.\nNo Slices.\nNo Delivery.\nNo Stripping.\n\n\nJust kidding about the last one... but really, Grimaldi's has a lot more \"No\" than it does \"Yes!\" for me at the moment.\n\nI'll admit it's been a while since I've been to Grimaldi's (as in I went when they were at the small location located 2 stores down from their current one) so perhaps I should go back before I write a review? Still, I have to comment on the whole Grimaldi's experience.\n\nAfter all is said and done, I didn't find the pizza to be super memorable nor worthy of the normal one hour wait. Where's my crispy crust? Where's my sauce? Wah. Thank goodness I did not have to wait in line that long or otherwise I would have been annoyed. This was the result of playing hooky from work on a Thursday in the summer. \n\nService was a little pushy too. I get that you have a long wait outside, but this is a sit-down restaurant so don't give me an attitude or rush me through my meal. \n\nMaybe things are different at the new location (which used to be a gay night spot by the way!) with it's white walls and huge windows but I'm in no hurry to visit anytime soon.", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-20", "description": "We headed there mid-week at around 12.30pm and got seated straight away. We were lucky!\n\nThe pizza was just delicious. Fresh ingredients and expertly prepared - you can see the chefs making the pizzas. The base was crisp, the crust was delicious and not greasy, and the toppings were just perfect. We got a small cheese and tomato, which was just enough for both of us. We still had room for dessert afterwards so shared a cannoli - really crunchy and fresh, with a lovely cream filling. \n\nOne star off because our waiter just wasn't attentive enough. We kept having to ask another waiter or waitress to get him for us.", "author": "Stephanie O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-12", "description": "2.5 stars\nI hope it was either because Grimaldi's was way hyped up for me and my expectations were unable to be exceeded or it was our poor choices for toppings.. because frankly, I was not the least bit impressed.\n\nWe ordered a large with 5 toppings - sausage, peppers, olives, onions and mushrooms. Don't get me wrong, the ingredients and toppings were tasty and fresh.. but it looked and was a little too wet and soggy for my liking. All the toppings were constantly falling off the slice as if it was only meant to be eaten with a knife and fork. Also, please take note that the olives here are definitely more potent than the ones normally served at pizzerias. In my personal opinion, I would choose Lombardi's over Grimaldis. I especially enjoyed Lombardi's spinach topping and draft beer availability.\n\nOn the bright side, I'm extremely relieved that there was no wait on a Wednesday night.. or else it wouldn't added to my first mediocre dining experience at Grimaldi's.", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-29", "description": "3.5 stars.\n\nWe got there just before it opened at 11:30am on a Friday, and there were already several groups in line before us.  However, we got seated in the first round of people (whew!).  Otherwise, the wait can be pretty long.\n\nThe pizza here is fine, but I don't think it's so special that I'd wait in line for it.  I guess it's one of those places that you just have to try once if you're a tourist.  \n\nWe got a small pizza (has 6 slices) with sausage - this was a good size for 2 moderate-appetite people to share. Another table's pizza was pretty black and burnt on the bottom, but thankfully ours wasn't charred like that.\n\nIf you're visiting NYC/Brooklyn, note that Grimaldi's is a 5-10 min walk to the Brooklyn Bridge - You could eat at Grimaldi's \u0026 then walk across the bridge to Manhattan afterwards.", "author": "Grace C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-20", "description": "Came to NY for vacation and based on reviews decided to give Grimaldis a try. The wait to be seated was okay. The food was pretty good but nothing special. The service was horrible. We waited more than 10 min to have our order taken. We waited more than 30 min for the food. And we asked 3-4 different waiters for the check and that took more than 20 minutes. The worst part was that they overcharged us and when we brought it up to them the lady at the cashier gave us attitude and randomly wrote numbers on the check for tax and tip. How dishonest and lame can they be?", "author": "Vivian J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-28", "description": "There is a reason why Grimaldi's always have a line of people waiting in the long line wrapped around corner just for pizza. This place is practically famous. And it deserves to be. Their pizza is delicious!! Freshly made with (I'm assuming) fresh ingredients. Along with the pizza, you have the beautiful NY skyline. The reason for the 3 stars instead of 5 is because of cleanliness. The cups they pour my friends and mine water into were so dirty and kind of disguisting. I was afraid to drink the water.\nQuick Tip: You can't buy pizza by the slice. And it's cash only. Hit the ATM before going.", "author": "Constance A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-21", "description": "Yummy classic New York style pizza near the Brooklyn Promenade and literally under the Brooklyn bridge.  \n\nThis is usually worth the wait if you're nearby, and it's a go-to I take visiting friends to.  :)", "author": "Betsy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-08", "description": "Danny loves pizza. He eats, lives and breath pizza - he wouldn't probably even marry it if he could so this place was on out \"must go to\" list when in New York after reading about it on yelp!\n\nPros:\n- cooked in coal brick oven \n- pepperoni, sausage and jalapeno  \n- flavorful - each bit was so amazing\n- great crust\n\nCons:\n- Cash only\n- gets really cold if you are sitting downstairs near a window \n- poor service\n- no beer! \n\nHelpful:\n- small regular pizza (feeds 1-2 people) $12\n- large regular pizza (feed 3-4) $14\n- toppings: $3 each\n\nOverall:\n4 stars. It wouldn't have been a New York trip if we missed out on Grimaldi. After walking in the snow in 20 degree weather, I was ecstatic to see the Brooklynn Bridge. I was even more ecstatic when I saw Grimaldi right underneath (how convenient!) When we got there there was like 3 parties right at the door. It was very confusing because i had no idea whether I was suppose to go inside to put my name down or what. I then walked instead and the guy (I am assuming the manager) starts yelling for us to stand outside. I told him that we are here for two and just confirming on the process. He responded by saying \"yeah, i know two. now stand outside\" That kind of caught me off guard a bit but didn't stop me! Got in line and thank goodness was only in it for no longer than 10 minutes. We got seated by a window table in the far back. When we were waiting for our food, our area got extremely cold (maybe around 30 degrees) which kind of made it difficult to eat/wait. The couple next to us complained, but the manager said it was \"just them\" and moved them elsewhere. As we were waiting, the line outside grew and grew. If I was waiting more than an hour outside, and got seated instead (in the cold) i wouldn't have been happy. Anyhoo, we ordered a large pepperoni, sausage and jalapeno between two people and devoured every last bite. I asked Danny if this was his favorite, and he stated that he has had better but it was still really good and tasteful. I guess it really depends on what type of pizza mood you are in! Overall, great experience, glad we tried it and would go back again if we were in New York.", "author": "Thu H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}