{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-09", "description": "A must stop on a pizzaquest. yes, yes, i have a policy about not waiting in line for food due to (as they say in corporate america) setting unreasonable expectations, but a nyc pizzaquest must include a stop at grimaldis. \n\nlater lunchtime seems the time to go, you can avoid waiting too long (seriously, all these \"cheap but amazinging, what a find!\" places that you still need to visit are best viewed b/w 3 and 5:30 pm). and it's yummy, quintessential brooklyn pizza, and a shit ton of famous people have chewed on it over the years. and it is also yummy to boot (hello TUMS!). \n\nbut can it hold a candle to the memory of New Haven? no, but it's been like six years since i've been to those places and i'm going to drop by for the first time tomorrow night with work colleagues none the less. how weird is that? I'll let you know.", "author": "Scott P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-20", "description": "I walked across the Brooklyn Bridge and asked several people for directions before getting to Grimaldi's.  I waited in line for about 10 min. before the guy seated me.  It was so crowded and I had to sit right next to some stranger.  I opened the menu then realized you had to order a whole pizza!  It was just me and I wanted one or two slices so I kindly tucked the chair in behind me and left.  As I was leaving, the guy who sat me asked what the problem was.  I explained to him that there was no way I could eat a whole small pizza and that most of it would go to waste!  He said wait a minute.  He went back to see if there were any extra pizza's back there he could get me.  To make the story short, he was the owner and I ended up getting two free slices of pizza!  \n\nI never went back with friends since it is a bit out of my way.  But the long lines should tell you that this pizza is worth waiting for.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-13", "description": "We waited 30 minutes outside in the freezing cold.  \nThis place is a fire hazard with all the people it packs in.  \nAnd the owner is a nazi.  \n\nBut sweet jesus, you do it for the pizza.", "author": "Killa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-06", "description": "As you can see from the hundred of review, Grimaldi's is truely one of the best Pizzeria in NY.  Love the thin crust, sweet bell pepper, and garlic on the pizza.  Not much for service.  They also have one of the best Canoli's that I've ever had.  The tortoni is also quite yummy.  I will definitely come back when in NY.  \n\nIf it's not freezing cold, you can even walk the Brooklyn bridge and stop by here for pizza.\n\nWho knows...you might even run into a movie star here.", "author": "Suzn L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-25", "description": "There really isn't much more to say about this place. It's amazing. The wait outside is half the experience, and gives all your Glazer friends from Manhattan a chance to get there. \n\nWe went once with a group of eight, sat at a table for six, and everyone got their own pie. After embarrassing ourselves in an extreme fashion, we hobbled over for ice cream and Jarritos. On our next visit, we placed a similar order only to find our request denied by the owner himself. He \"politely\" suggested we order in waves, to which we agreed, so long as our overall health suffered just the same as before. \n\nSo really, this review is more of a tribute to the poor waiter who was most likely fired for letting us do that in the first place. You are a true unsung hero, a Captain Sully for pizza. God speed.", "author": "Kyle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "Grimaldi's is hand's down the best pizzeria in NYC!!...I don't mind standing on the long lines because I know that the wait is worth it!!..\nTheir oven-baked, thin crust pizza (pepperoni, sausage \u0026 mushroom topping is my favorite), their wine selection \u0026 dessert (I luv the spumoni with a cappuccino to finish are my fav selections!!). I especially luv visiting Grimaldi's during the summer and then stopping by either Ice Cream Factory and the docks taking in the Manhattan skyline...:)", "author": "Dominique P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-27", "description": "after walking across the Brooklyn Bridge (and running into The Way of the Cross with 3,000 people), we jumped in line to try the pizza at Grimaldi's Pizzeria who has a coal-fired brick oven. Once again you can not order pizza by the slice but it is well worth the pie. Their pizzas are made with fresh mozzarella, tomato, basil, and dough made daily. The coal brick oven gives the crust a crispiness and smokiness. I couldn't' pick between here or John's- I loved them both equally. One this that made Grimaldi's a tiny bit better was the whole basil leaves they cook on top! As soon as you took a bite the basil flooded your mouth- Yummmmm", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-10", "description": "Yesterday was my first visit, luckily since I only went with 1 person, we got seats pretty quickly. The place is rather cramped and they don't fill out your water until you ask them to. \n\nHowever, I LOVE their pizza. We ordered a small pie with garlic topping, it was SO good, LOVE the pie (crusty, and made you want to consume it nonstop), the mozarella cheese (I thought there would be chunks of garlic on top of the pie, THANK GOD it didn't. For the record, it was my friend who insisted in having the garlic topping instead of pepperoni perhaps?).", "author": "Rita K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-15", "description": "It is really good pizza! Yes, there are many places in the city where you can get pretty amazing thin crust pizza but this is truly one of them. The other great tip: you can order a pizza and just go pick it up so that you don't have to stand in the crazy, long line.", "author": "M J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-03", "description": "After taking a stroll across the gorgeous Brooklyn bridge, my friends and I arrived at Grimaldi's. There was already a 15-20 person line outside. We waited about 30 min-1 hour in the cold outside, freezing our butts off. Then we were lucky enough to have the guy at the door call for a table of 6. Since there were 6 of us, we ordered two small pizzas, one mushroom, the other sausage. Both were good but somewhat soggy. I like my pizza crispy and easy to hold. These slices were ready to fall apart so be ready to use a knife and fork. We were still somewhat hungry and didn't plan to come back anytime soon, so we went for it and ordered a third small pizza--plain cheese. This one was my favorite. It was simple enough that you could taste the fresh basil and delicious cheese and was not weighed down by extra toppings. Total: $8 each person for 3 slices, not bad! I love thin crust pizzas and Grimaldi's plain cheese is definitely in my top 5 but I don't think it's worth the trek to Brooklyn and hour long wait outside. However, I've been curious about Grimaldi's for a long time and was happy to finally go there. But I'll stick to my pizza soulmate, Bleecker Street Pizza.", "author": "Melissa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-30", "description": "Really delicious authentic NYC pizza thin crust not too much sauce it was just perfect!! Only downside is the long lines... Definitely a must when visiting NYC!!!", "author": "Enid O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-15", "description": "typically awesome, sometimes insane.... \ni never wait on lines, including this one. \n\nbest times to go are around 11am, late at night and if its rainy out...\nbring your pie to the new brooklyn bridge park (pier1) and chase with an ice cream cone. :)", "author": "Kimberly K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-09", "description": "Highly overrated!!! This place is mediocre at best. I don't know why people wait 45mins to an hr for Grimaldi's pizza - it is totally not worth the long wait. I've had much better pizza in NY.\n\nWe got our table (group of 4) after over an hrs wait! They place inside is crammed, the service is not great and the pizza is mediocre. The pizza came out pretty fast and became cold even faster! It was cold and tasteless by the time we finished the first slice (and we finished that rather quickly since we were starving after the long wait).\nA complete waste of time!! Will never go back there again.", "author": "S N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-05", "description": "I was disappointed in the pizza after hearing all the great reviews on Yelp and from friends who swore on Grimaldi's za. The sauce was rather bland and the mozzarella was average. Great crust, though.  Once you get in--don't be surprised if you wait at least an hour--service is prompt, friendly, and unrushed.  They have a good selection of sodas and beer, and their Cannolis are quite tasty.", "author": "Ai F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-04", "description": "This pizza is awesome.  Some of the best in the 5 boroughs, there is no doubt about it.  \nDon't expect luxury, use your eyes, and look at the place when you walk up.  Expect great food.\nI took my gf and my mother here.  Waited outside for about 45 mins on a beautiful Saturday afternoon, so it was ok.  The hosts were snarky but cool, friendly guys who truly appreciated the business and shook our hands on the way out. \nServer was friendly, food was phenomenal.  Antipasti app was above average with tons of fresh mozzarella, roasted peppers, tomatoes and olives with toasted Italian bread.  Pizza was almost unholy it was so good.  It does cool quick with the thin crust but that wasn't much of an issue with how fast we ate it.  Love it.  Beats Lombardi's, but both are good.", "author": "J K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-03", "description": "First trip to NY and got a collection of recommendations to get \"representative NY food\" from a bunch of different NY expats.  All of them said to hit Grimaldis.  \n\nNO SH_T SHERLOCK!!!  One of the greatest pies I've had to date.  the crust was thin and it had like \"islands\" of stuff on it rather than a homogeneous mixture of toppings.  I don't know how to describe it other than that.  I've had the best from Chicago (Lou Malanatis, Unos/Due's, etc) and although I think I still prefer the deep dish, this is an entirely different animal - clearly the best food I had in NY and I would return on any given day.\n\nNOTE:  hit this place BEFORE it opens.  We went by on a Monday night about 7 and the line to get into this place was 3/4 down the block (no exaggerating there, I swear!).  We skipped it that night and hit the place for lunch on Tuesday 1/2 hour before they opened and we got right in when they opened their door.  Pizzas were out in like 10-15 minutes", "author": "Todd M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-03", "description": "Everyone has different expectations of what pizza should be.  I enjoyed a well made pie, fast efficient service, and friendly atmosphere.  Well done!", "author": "Rob W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-02", "description": "It's a great pizza place!! Went there few times and its not that close to my house, so if I took my time to travel for pizza trust me its good. The lines to get in are usually lengthy.", "author": "Igor K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-28", "description": "So over rated!!!!!!  Brooklyn's best pizza, Puh-lease!!!!! Polly-O ricotta cheese, packaged pepperoni, and boxed white mushrooms!!  Is there anything fresh in this place?? Wish they gave out free bite size pieces while on line to make the hour and an half wait worth it, probably would have walked off line if they did anyway.  It was just OK! The sauce was tasteless and the sausage was forgettable.  The dough was so chewy I could not eat the crust (mark of really good pizza).  It's one thing to make your own pizza using ingredients you can get from Pathmark, its quite the other to stand on line for an hour and a half to watch a guy make pizza for you using the same ingredients!!!!!!!  Want great pizza, go to Di Fara's!", "author": "wilson h."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-24", "description": "I was so excited to try this place out...so excited that it took me an hour to get there...and it was FREEZING because it was mid January. Anyhow..I heard so much about this place so it was a must on my NY to do list. Pizza was good..but not GREAT. I was a tad disappointed. We ordered the mushroom pizza. The crust was not the best and the cheese wasn't the best. Anyhow...would I go back here? Hmmm.....maybe.", "author": "Sanaz M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}