{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-16", "description": "Service 3/5\nFood 3/5\nI was really looking forward to New York pizza, and this was my first experience. It was rather disappointing. I'm not sure what I expected, but this pizza didn't, \"wow,\" me. Also, service was a bit poor--our server wasn't very present, and was noticeably flirting with another table. It definitely wasn't bad pizza, but I wouldn't come back again.", "author": "Natalie P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-07", "description": "I haven't been here since they moved to this location and Giulianna's opened up. I would give this spot 2 stars, but since there's an even better option next door, I would never come here again.\n\nDo you like seeing your breath inside the restaurant because there's no heat? Definitely sit on the first floor! Enjoy eating off paper plates and plastic cutlery, look no further. Love eating grocery store level mozzarella and some lunch meat as an antipasto plate for $12? This is your restaurant.\n\nThe pizza? not terrible. The toppings are limited to choose from, but the pizza is good. above average but not great. You can get great pizza in so many spots in nyc now. Especially the place next door to Grimaldi's. Do yourself a favor, skip any line here and go next door. Better decor, better service and better pizza by far.", "author": "Ray C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-18", "description": "This pizza was perfect. \nWe ordered a red sauce one and a white sauce. \nI'm picky about my red sauce, a lot of places put too much for my taste, although Grimaldi´s added just the right amount of marinara I liked the white sauce pizza more. The service was friendly and fast and best of all we didnt have to wait to be seated. I hear this place gets PACKED. \n\nThe view was spectacular I loved everything about this experience.", "author": "Susely B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-01", "description": "To start, expect to wait about 35-60min in line to get seated because there aren't many tables available. Although the wait is long and there's always a line, once you're seated you're not rushed to finish which makes the experience enjoyable. Due to the large mass of people, it seems as if they bring the pizza out too fast to get customers eating quickly. Pizza was more doughy than expected. Being the area is full of tourists it's always crowded. If able to go to the location in Douglaston, Queens id recommend that because the restaurant is much larger, comfortable, less of a wait \u0026 has the same quality pizza. If a tourist, I would recommend waiting because it is definitely one of a kind pizza!", "author": "Lauren V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-10", "description": "As a visitor to the area several locals told us we had to try this pizza. When we looked up on Yelp we were surprised to see it only had 3 1/2 stars. Oh well, we were going to listen to the locals and go try it. We got there around 1030 on a Saturday night. There was a large party waiting outside, but as a party of 2 we got right in. It is hot in there, no A/C I feel bad for the people working next to the ovens! We ordered a smaller size garlic with half pepperoni, it was plenty for the two of us. The pizza was delicious, has that char that you expect, thin, great sauce and cheese. Our server Kris was hilarious and personable, we got to meet the cashier, Vanessa and had lovely interactions with all the staff.\n\nI want to make a note to the people leaving less than stellar reviews: this place has a line from open to close every single day, with tourists and people coming from all over the world. The workers have to deal with that, plus no a/c on a hot day. Cut them some slack, and don't post a one star review based on if you didn't like the staff. When I go on to Yelp I want to know about the FOOD. Stop being pretentious a-holes!!", "author": "D I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "OK seriously best pizza I've ever had!!\n\nAfter waiting outside in 15 degree weather for more than an hour I was worried it wouldn't be worth it... but it so was! We ordered the regular red pizza with added mushrooms and a white pizza with added ricotta. The pizza had a nice crispy crust with deliciously fresh toppings. My favorite was the white pizza which had fresh garlic. \n\nYou have to try this place. Get the white pizza!!! You won't regret it.", "author": "Aminah K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-26", "description": "Came here a ways back because I was told it was the best in Brooklyn.\n\nPlace is small and crowded. The pizza is good but I think it's over-hyped.", "author": "Vishal P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-13", "description": "As a New York native Grimaldi's has been my favorite place for coal oven pizza the prices can be  a little high.i highly recommend the meat lovers pizza.", "author": "Billy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-21", "description": "After a walk on the Brooklyn bridge, we got on line for Grimaldi's. The line was a little long (20-30 minutes) but the food and the atmosphere was very good and welcoming. The pizza was soft, the dough was super chewy and I liked the texture. Tried the mushroom and sausage pizza. For 3 people we ordered the large pizza pie.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-26", "description": "This is the second time I've eaten at a Grimaldi's. The first one was much better. I find that they supposedly offer a better product than other non-franchised cheap pizza places. Sadly while the makings were good the execution of their product wasn't. The pie was overcooked. Burnt in some places. Their toppings are stingy. \n\nWe got a medium pizza with 2.5 toppings along with one side salad and water. The cost before tip was $30. \n\nSo, I will not be going back. I can get as good a pie elsewhere for a lot less. \n\nBTW, the server was good and nice. It's truly sad that they can take good ingredients and ruin them. :(", "author": "Tim B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-12", "description": "I was just down the street at a client and they referred me to Grimaldi's.  As I approached the corner I saw a huge line not knowing it was the hot spot for pizza here.  They had not opened yet.  When the door opened it was like a human vaccuum cleaner was turned on and within 10 seconds all the tables were filled on the bottom floor (they have an upstairs too).\n\nI was greeted and sat at the counter.  The menu is a simple as it can be:\n\nAntipasto\nLarge or Small Pizza, Red or White\n20 toppings to choose from\nLarge/Small Calzone.\n\nFresh homemade dough, freah mozarella slices, freshly crushed tomato sauce and a 1000 degree coal brick oven cooks the pizzas quick.  \n\nMy favorite part of looking around was the notice:\nNO SLICES, NO RESERVATIONS, NO DELIVERY, NO CREDIT CARDS.  So bring at least 25 bucks if you are a single person as that's what a small two topping pizza and a Seltzer water costs. \n\nThe pizza was thin and  crisp as expected and the freshness of the toppings were great. The mozzarella slices really balanced out the sauce as it was not salty but rather each items flavor rang out so you could identify and taste every part of the pizza. After sitting for 45 minutes the crust was still nice and firm, not soggy and not a single drop of grease since mozzarella is used.\n\nA continual stream of people were coming in when I left at 12:30pm.  They are open until 11pm so come early or you may have to wait a little bit but not much.\n\nYou can pick up a Grimaldi's shirt if you want a souvenir.\n\nGlad I made it here!\n\n5 stars.", "author": "Jay G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-30", "description": "The pizza is delicious, worth the hour long wait.  I think it's the cheese that made the pizza so tasty, 5/5.  Reason for 4 stars is due to service.  The staff is actually friendly, but take their time service you.  Even though there are empty chairs in the restaurant, they take there time letting in people waiting in line, out in the cold.  It seems they purposely want to maintain the line to give off the feel that the place is exclusive and in high demand.", "author": "Jin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-19", "description": "The line isn't always worth the pizza. Family from out of town always wants to try this historic tourist trap but being in the next town from the Garden City sight, having to come into Brooklyn and stand in line for an endless time makes the pizza taste less appetizing.", "author": "Wendy Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-04", "description": "A must stop spot for delicious pizza after your visit to the Brooklyn bridge. One of the best pizzas I have ever tasted .... the tomatoe sauce and the freshness of the mozzarella cheese are out of this world. Be prepared to wait because there is always a line but it moves rather quickly. No glitz and glam... just delicious pizza!", "author": "Virginia A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-07", "description": "Came here curious. Left with mixed feelings.\n\nAs an Italian, I obviously stopped expecting the unexpected from pizza places in the US. But given the reputation of this place, I walked all the way from Downtown to this place to try their famous coral brick oven pizzeria.\nWe tried two large pizzas: one with anchovies, capers and sundried tomatoes, the other one with sausage, jalapeños, onions and salami. Both the pizzas were very good. The dough had a soft texture with robust taste and was not too salty. The tomato sauce was very tasty and the mozzarella was a-ok. Overall all the ingredients tasted fresh. What I did not like is that outside the temperature was about 15 degrees and inside it was not much warmer than that! People were eating wearing coats, and this should not happen in a place with such a reputation. Moreover, the service was nothing special and plates and cutlery are paper and plastic, respectively.", "author": "Tommaso M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "I was really looking forward to try out this place since there's always a line out the door. This is supposedly one of the better must-try places in the city and I saw that the hype was real. I met up with a friend here for lunch and we both shared a pie of 6 slices with mushrooms, meatballs and pepperonis. \n\nA pie of 6 slices is the ideal amount for 2 people sharing. If you're hungrier and looking for something bigger, do order their larger pie. I'd say the pizza here at Grimaldi's is comparable to Prince Street Pizza if you've ever had that. The dough has a slightly sweet aftertaste, the pepperoni is shaped like little cups that hold in the good pizza grease. The pizza that they serve at both location is especially delectable when served extra crunchy. \n\nThe venue is pretty big with 2 levels. The line outside may seem a bit intimidating at first, but moves relatively quickly. The staff were courteous and catered to our needs. Pricing is pretty fair for a pie of 6 slices for about $15 each for 2 people including tip and tax.", "author": "Henry T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-10", "description": "Amazing pizza that's well worth three hours on the treadmill. Taking one star off because of the one hour wait in a cold winter day.", "author": "Lydia C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-25", "description": "Boy, I don't know if it possible to disappointed so hard.\nThis place was hyped so much in all the tourist guides, we thought it's going to be great. They have paper plates and plastic forks. The restroom was worse than any other place we visited in NYC. Seats are so close. No ambiance whatsoever. And the pizza sucked big time. We had a much better pizza at Roberta's. Not worth it guys.", "author": "Abhishek J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-25", "description": "Yes, it's not as good as Juliana's. Yes, you should read about the whole Juliana's vs Grimaldi's history - it's juicy.\n\nThe pizza was pretty good but fairly standard and boring. Again, Juliana's is better. But let's take a second and talk about how great the spumoni is. Screw all the people telling you to go to BK Ice Cream Factory and wait in the long line - get the spumoni at Grimaldi's!", "author": "Judy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "Walk the Brooklyn Bridge. Eat at Grimaldi's. Perfect mid-day activity. We visited in the dead of winter, so we walked right in at lunch time and got a table. Score! But I've also been here int he spring when the line wraps around the building. So be prepared to wait. A while.\n\nPizza is tasty! What you expect pizza to taste like! Crust is pretty much perfect. Love the decor and how it feels old and like a part of history. \n\nGreat Service. Cash only.", "author": "Elise H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}