{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-14", "description": "We ordered a small pizza with two toppings. It mostly $20 Plus tip and tax. This store doesn't sell slice, only sell pie. So if you're one person, better find another with you. The pizza taste very good and the topping didn't fall when we peel the pizza. Better to eat it fresh because the skin of pizza is very crispy. We have some leftover and bring back home and did oven it. It didn't taste as good as in store.", "author": "J X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "this was my second time here, and I absolutely enjoyed it as much as the first time. \n\nwe walked across the Brooklyn bridge and then walked over here, very simple to find.\n\nthere was a line outside as I had expected but it didn't take long to seat us as everyone in front of us was a group of two, and we had 3. I'd say we waiting maybe 10 minutes at the most. \n\nwe ordered a vegetarian pizza with extra cheese, mushrooms and onions and had no problem finishing the large among the 3 of us. the fresh cheese definitely added extra flavour to the pizza. \n\nthe pizza is worth the wait!", "author": "Hetal M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-09", "description": "Quick review: the actual place was really good. The pizza  tasted good but the crust was burnt. It is a usual coal brick oven pizza place. Nothing that special but it's nice.", "author": "Mark H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-26", "description": "This has been the single worst New York restaurant experience I have had hands down. I have been coming to Grimaldi's for years, starting in 07/08 when it was in the building down the street. What a horrific disaster it has become. Please save your time and your money and run far, far away from this has been disaster. These days, grimaldis has lost its liquor license so you can't even have a cheap beer or glass of wine while you eat your pizza BUT WAIT, it doesn't really matter because it will be about 3 hours after your order your pizza before you get it, regardless of what it is you order. When you do get that pizza if you are one of the brave souls that can wait that out, it will be sub par and mostly favor less. Save your trouble and go anywhere in the entire state of New York as long as it's not Grimaldi's. Also please note the wait staff are complete incompetent a***oles who truly don't realize their sh** stinks so don't expect any help there. If there is someone who forces you to go to this god forsaken he** hole, I pray for you and your sanity. Just try it leave as fast as you can if you have such an unfortunate experience.", "author": "Amber B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-14", "description": "Grimaldi's is a Brooklyn staple. The place itself is nothing special. In fact it's dusty and looks somewhat run down (...and this is the new location). However the food is why people swarm here and not the decor. \n\nThe pizza is good, almost legendary. But IMO the calzones are the show stoppers. The pizzas are light and tasty but the calzones are incredible. Seasoned deliciously and cooked to perfection. If you order the large calzone you better be hungry, because it's ginormous!! \n\nOthers have lamented about the cash only policy and the lack of alcohol so be warned.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-15", "description": "Grimaldis is pretty good for oven roasted pizza, however I wouldn't say it's anything special. compared to other pizza joints, it's a lot better then dominos, but I definitely prefer small pizza joints where slices are $1.", "author": "Karen K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-20", "description": "***SEE MY REVIEW OF JULIANA'S FOR THE COMPARISON***\n\nTL;DR - the pizza here is average or below average and I will NEVER come back here, especially when Juliana's is right next door. \n\nOrdered a large margherita pizza with pepperoni. Pizza came to me right when it was done being prepared, but it cooled quickly. The cheese hardened before I could finish eating my first slice. The pizza was too thick...wasn't thin and crispy. The bottom of the pizza was not crisp either! It was kind of soggy. The crust was so dry. I honestly didn't even want to eat a second slice. Too soggy, not a crisp enough bottom, dry crust. Didn't want to eat it. Sauce was kind of watery and tasteless to be honest. Didn't seem to be seasoned at all. There were very dry basil pieces on the pizza, but it didn't blend well with the sauce and cheese. Just really not a good pizza. I would take anywhere else over this. And the margherita pizza next door at Juliana's is the best pizza I've ever tasted, so it's a no brainer. Grimaldi's large pizza seemed larger than Juliana's. \n\nMan outside monitoring the line: \"I don't understand what's so difficult. Move to the side.\" Kind of rude. Just ask people to move aside. No need to be condescending. \n\nAlthough he didn't forget about me, as someone who was dining alone, so I appreciated that. As in, he didn't keep seating the parties of 2 over me. \n\nThis place has TVs, which is nice if you want to watch sports, but no beer or wine!\n\nPlastic utensils, paper plates. Red and white checkered tablecloths. Definitely doesn't feel like sitting down for a nice meal, like it does at Juliana's. They sat me at a table of 4 that was already occupied by 2. A little weird. Expected to be at the counter. \n\nThey did voluntarily offer to rinse out my Nutribullet cup, which had the remnants of a green smoothie from earlier in the day. I thought that was pretty nice. And they did so thoroughly. He even explained that he didn't have detergent, so just rinsed it. Very nice. Didn't have to do that. The one star goes to my waiter, because he was great, but the pizza sucked. \n\nSeriously this pizza sucked. Tasteless sauce, hardened cheese, soggy, dry crust, not seasoned well. No beer or wine, cash only, cheaper prices than Juliana's (but not at all worth the money saved).\n\n***SEE MY REVIEW OF JULIANA'S FOR THE COMPARISON***", "author": "Jane D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-10", "description": "Grimaldi's , famous place, decent pizza.\nThe line for sitting inside is very long and to prevent overflow inside they require you to wait outside. Makes sense. However, if you are like my family that was just ordering take out they still require you to wait outside. Now, my mother is older, but even still they asked her to wait outside.\nWhen to check in on the pizza, and similar to a bouncer confronting a drunk man trying to get back in a club, was told \"whoa whoa can I help you?\" With outstretched hand to my face. \n\nGot the pizza. Pretty tasty, the crust was nice but I personally could use more crunch in my crust.\nNot very saucy if you into a saucy slice. The ingredients were fresh which did create a non soggy pizza that made for a pleasant, flavorful bite. \n\nThis place will never be short of business for name sake, but know what you are getting into. Come early, BRING CASH, and expect to be treated as just a number. #PizzaisLife", "author": "Evan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-09", "description": "came here after touring the Brooklyn bridge with family. the wait was long but so worth it. awesome pizza", "author": "Fariha H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-23", "description": "Walking into Grimaldi's can be overwhelming. Especially if there are tons of people waiting to be seated. I guess I must've looked lost because a man came out of the middle of nowhere asking how many we were. Man, he's good! We were sent to wait on the third floor (I honestly thought they'd forget about us). Every 5 minutes or so the same guy would come up to see if we were okay and let us know we would be seated soon. I love that even though no matter how packed they are they still take time to check up on you! \n\nWe decided to order a large pie with pepperoni and sausage, as did many other tables surrounding us. The pizza took about 10 minutes before it was out and I was ready to dig in, I was ready to burn my tongue if necessary. Surprisingly, the pizza was not too hot ! It was the right temperature..devoured the whole pie in about five minutes (just me and my boo). This had to be THE best pizza I've had in my life! Perfect proportion of sauce to cheese, and the crust was just right...crunchy soft (is that a word?)\n\nThe manager or someone else was passing by each table asking how the pizza was and even shook our hand as we walked out and thanked us for coming out in the cold weather. I can't wait for my next trip, definitely going back to Grimaldi's!! Great service and to die for pizza!!", "author": "Kathy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-22", "description": "I am already craving the goodness that is Grimaldi's. We arrived around 3pm on a Tuesday afternoon- St. Patrick's Day actually, and there was no line. We were immediately seated. We ordered the small pizza (6 large slices) with the toppings that it automatically comes with- mozzarella, basil, tomato sauce, plus pepperoni. The pizza was sooo delicious. Savory and thin, just perfect. The two of us devoured the whole thing. \n\nThe sodas come in bottles, so no free refills. And it's cash only! (I believe there was an ATM inside...) No pizza by the slice, but one won't be enough anyway! Can't wait to return!", "author": "Laura H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "Long lines, lots of hype, pizza is ok. Pizza came quick and wasn't as crispy of a crust as I was expecting. Toppings weren't anything special either. Cash only. No signs indicating so. They probably make a killing in ATM fees. No alcohol or BYO license either.", "author": "Alex A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-08", "description": "Let me start by saying, Dumbo Brooklyn is a very quaint place to visit especially when its with my daughter.  Now for the pizza.  Get ready to wait on line outside.  I have been here before and there is always a line.  Once we were inside we were taken to the second floor to share a table with another family.  We decided to wait longer to have our own table.  So the wait was about an hour. Finally got a table in a very cramped area.  We a ordered the anti pasta, one large regular pie and one large mushroom and sausage.  Both pies where good but were lacking salt.  Very bland on seasonings.  The anti pasta was small but ok.", "author": "Dulce L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-23", "description": "Don't get all the fuss. I would never stand on line for this place. We've gone twice - once it was raining at probably 1 hour before closing. No line and my boyfriend was new to the city at that point so he wanted to sample the 'best pizza in new york'. \n\nThe pizza that night was slightly undercooked and nothing to write home about.\n\nAnother time we went for pizza but ordered ahead for take out. This enables you to skip the line because you're not eating in.  Again, undercooked (as though they are so busy trying to kick out pizzas that they don't allow the food to cook properly) and just meh. Hardly worthy of the BEST PIZZA IN NYC title or the billion bucks required to buy one of these things.", "author": "Camille H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-09", "description": "This used to be my favorite pizza place of all time! The Brock oven pizza, the nice area, you get the idea. Today, my sister and I and our 2 kids went in for lunch after skating nearby. The waiter came and took our order. He brought out drinks. A different gentleman brought our pizza. The original waiter never came to check on us to see how we were doing or if we needed anything. We get the check...and HE ADDED A $7 TIP! We ordered 2 pies...and 3 drinks...that came to $40 and $3.50 for tax. HE HAD THE NERVE TO ADD A $7 Tip! I called him over to explain the bill...and he proudly indicated that gratuity was included. I was highly annoyed! I understand the waiters want to get tipped appropriately. However, maybe  the issue is the service of the staff and not the patrons of the restaurant. Not sure if I will be attending this restaurant again.", "author": "C W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-21", "description": "I love that the mozzarella and ingredients are fresh and tasty but only complains is that I feel the pizza needed more sauce.. And a lil bit more flavor .. Over all great experience laid back not pocket breaking and definetly filling ... Will I ever order from dominoes or papa johns again? Lol", "author": "Raisa V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-04", "description": "Another tourist review:\nIt's good pizza, don't get me wrong...but it was just good pizza.  For all that NYC pizza hype, it was disappointing. I can find pizza just as good here in Toronto, even better maybe.", "author": "Cathy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-11", "description": "No NYC trip would be complete without a delicious slice of pizza. We got lucky and ran into this spot in between lunch and dinner so there was no wait. The pizza was gigantic and full of flavor. I am a sauce person so I loved all the sauce. The way they cook the cheese on the pizza too was so delicious. Not something you see here on the West Coast. I am typically a deep dish kinda gal, but I really enjoyed the thin crust pizza that New York in famous for.", "author": "Heather O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-09", "description": "This is the best pizza I've ever had!!!  \n\nCrust - Crispy but yet gummy and chewy below the surface.\nSauce - Vibrant and herby but yet subtle enough to play well with the other flavors.\nCheese - Every bite is a commercial to be shot...stringy and lovely creamy texture with nice flavor.\n\nYes I put half pepperoni on it too which blew my mind...it added a salty and meaty kick that I just think a pizza needs.  some people just like cheese and yeah whatever this is my pizza.\n\nsuch a simple but complex delivery makes this pizza my new #1!!!", "author": "Matthew M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-31", "description": "Grimaldi's has a variety of pizza that range from Thin-Crust to Thick, Chicago-New York, Brooklyn as well as Neapolitan Style Pizza's. All pies are baked in a brick style coal burning oven, Only Fresh Ingredients with preparation techniques that root back to over 100 yrs. (Under the the Brooklyn Bridge) (Cash Only) (Gratuity is Included) Maybe the best pizza in the world!!!", "author": "Aaron M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}