{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-16", "description": "Here we go with one of those, \"you HAVE to try this place when you're here.\" Grimaldi's has this curse. If you're patient, then sure, try this place out.\n\nAfter about an hour and a half of STANDING in line, we were finally sat at the bar. Pizzas are made fresh, so be ready to wait a little longer. In short, the pizza was good. Not amazing. And definitely not worth a 2 hour wait time. \n\nCome here if you want to say you've been. But otherwise, a waste of time.", "author": "Jon C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-28", "description": "1 hr wait, take out, lined up at 4:30\n\nThis is one of my favorite pizza places on the east coast right off of the Brooklyn bridge. The wait is long, but well worth it. One of the oldest in the area, I am a big fan of brick oven pizza. Especially if the ingrediants are fresh and the crust is crisp on the outside with the right amount of chew on the inside. My mouth is watering just thinking about it. \n\nIt must be in the water, East coast pizza's have a unique taste in their dough and the style of pizza is simple yet delicious. I definitely recommend walking over the Brooklyn bridge before or after to walk off all the pizza you are going to eat.\n\nDon't forget to check out the river view at the end of the street and try some \"Ice Cream Factory\"", "author": "Darren Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-10", "description": "The service was bad and the decor/ambience is worse. Plastic forks/knives and paper plates? Are you kidding me? The plastic knife literally melted down when I was cutting the pizza for my kids. To top it off, I had waited in line for 45 min only to find out inside that they had no liquor license and did not serve beer. How convenient of them to leave that little detail out when your customers are burning in the summer heat waiting to get in. Pizza was fine but it took way longer to come out than at I usually experienced at Juliana's. You can get the same thing next door at Juliana's with a nicer decor with real utensils and without the attitude and arrogance. It's cash only, they tip themselves, also added a service charge, and the manager looking old man was visibly annoyed at everything for some reason. This place really doesn't deserve all the business they get.", "author": "Hyun A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-07", "description": "The pizza's definitely different.\n\nCame here for the first time on Thursday lunch!  The place wasn't at all hard to find because you could see the line from down the street.  Since we were only two, the wait to get seated was only ~20-30 minutes. \n\nDecor - The place is actually 3 stories! (damn, Grimaldi's)  And tables are spaced out enough so that we didn't get jolted as we were eating. \n\nFood - price is about $14 base +$2 for toppings which I think is totally reasonable given the size.  We ordered a large pizza with pepperoni, sausage, olives, and extra cheese along with a beer each to wash everything down.   Now I think that this pizza (especially with so many toppings) is meant to be eating with a fork.  The dough part is thin (as according to NY style) and gets soggy.  I mostly ended up eating the toppings first, scooping the dough into my mouth, and munching on the crust.  Didn't mind though - it was pretty good!\n\nWill come back when there's time.  A 30 minute wait with good company is reasonable, but probably not worth more than an hour's wait when hungry. (hilariously, a pizza place opened next to Grimaldi's to take advantage of this drawback.)", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-13", "description": "If I could afford to fly to NYC just for pizza, I would do it for Grimaldi's. For the price of a plane ticket, it is sky-high worth the beautiful and gloriously delicious simplicity of their thin crust, mozzarella and basil. \n\nThe lines are long, one and the same for eat-in and take-out. Finish it all off with some ice cream down the street and views of downtown NYC.", "author": "Jean L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-02", "description": "Omg I am missing NY pizza as I am typing this but once again, its pizza does not disappoint, especially Grimaldi's. I love their regular pizza with no other toppings on it. I absolutely love the basil, which gives it this spicy tangy taste. Might I add, tastes superb sprinkled with roasted peppers or garlic.\n\nThe wait isn't that bad, and moves at a steady pace. However, once inside, the service was considerably slow, as it took like 15 minutes just to be attended to when it takes at most like 5 minutes to know what you want to order. Just remember, cash only and they do not do orders by the slice!!", "author": "Lucy X."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-08", "description": "Pathetic! Why is this so famous? Hardly any sauce on the pizza, hardly any basil. Why do ppl still come here? Another thing service is nothing to write home about and they charged gratuity for 2 people! Seriously?!", "author": "Rohan K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-03", "description": "Been to Grimaldi's few years back-  This is a tourist trap in my opinion.  The qualify of pizza does not justify the wait time.  \n\nIf anything, I'd much prefer Lombardi's pizza in Little Italy.", "author": "Wing K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-27", "description": "I've been to Grimaldi's in Brooklyn many times on trips to New York and always enjoyed it. This time, however, I had a very different experience. First, no wine or beer--apparently lost liquor license. Then paper plates and plastic silverware. Then the pizza came. You could hardly find the sausage and very little cheese. Oh--the usual surly waiters. I also noticed a \"B\" rating on the door. What a disappointment.", "author": "Judy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-22", "description": "omG! I never reviewed this place? probably because it has way too many reviews already.  Yeah my fav New York Pizza place! =) If you're a tourist, you'll love this place compare to the other overrated places.\n\nI'm not sure if this place could be too overrated? Its like the chicken and rice cart... consistently good, and worth the wait but theres also a threshold in waiting in line.\n\nService is good. Its a little joint so I would suggest going one hour before it opens to wait in line.  Walk to the Brookyln Bridge scenic area after too.\n\nFood: AWESOME!!!", "author": "Diana W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-07", "description": "I think the place was just too overhyped for me. I have also been hearing whispers along the streets of New York that Rays in Manhattan is the new reigning champ of New York Pizza. But, with all of that said, this place is way better than your standard go-to pizza joints. \n\nThere is no pizza like a thin-crust pizza. I must preface by saying that I am a huge huge huge fan of Thin crust and have done a lot to go out of my way for this type of pizza. I wouldn't say it rivals some of the best I've had, but it's definitely upper echelon. \n\nMy favorite thing about this place is probably going to be the dough. Although on the saltier side, when adding pizza sauce to your pizza, it creates a nice balance with their signature sauce. \n\nAlso... Let's all agree that an open-fire pizza oven is always... ALWAYS going to taste better than your standard oven / heated up / whatever other device you might concoct to use to make pizza. \n\nI'm not sure that I'd be willing to wait the line... but seeing as they do take-out... count me in as a repeat customer!", "author": "Jacob O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-20", "description": "This is where it all started from what I am told.  We decided to do a tourist thing and walk across the Brooklyn Bridge.  After checking out some of the neighborhoods, we got hungry and decided to give the orignal Grimaldi's a try.  So glad we did - oneof the best pies I've ever had.  The line was rather long so we called in an order and it was ready in about 15 minutes.  Half veggie and half Italian sausage, we ate the whole thing.  These are big pizzas people!  In nice weather, you can find tables outside the restaurant areas to savor every bite.", "author": "Brenda D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-04", "description": "Was very excited to try this place out as I heard it was another 1 of those staples in NY claimed to be the best pizza in the whole city.\n\nThe pizza was good but not something I'dreally recommend.. Maybe I'm saying that cuz I'm disappointed from all the hype and the fact that there's a huge line at all times.  (We ordered ahead and picked up which is a way to save some time if u ever want to try this place out but not wait an hour to get in).  I'm thinking if I never heard all the buzz and saw the huge line of people waiting outside, I'd appreciate a bit more.\n\nThe crust was burnt, I'm not talking the little splotches of black underneath typical of brick oven and wood fire type pies, I mean black to the point where it was a bit overwhelming.. tasted more burnt dough than I could toppings.  Maybe that would actually help explain why I thought the toppings were a bit mild, especially the sauce and cheese.\n\nMight be that we just got a bad pie.. maybe will try it out again at some point", "author": "Ajay B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-04", "description": "I live across the street from Grimaldi's, which is dangerous/amazing! Yes, I truly truly believe if you can only have one pizza while you're in New York, this should be it.\n\nNow, onto the real reason for my posting a review. I have a secret to tell all of you tourists who are lining up for an hour (or more) to get in to have some of this delicious pizza. If you CALL them on the phone...you will have your pizza in 5-10 minutes. No joke. You just have to take your pizza and go sit on a bench by the river overlooking the Brooklyn Bridge and the skyline of Manhattan (which is a tad more scenic than the inside of the newly renovated Grimaldi's any day). \n\nThat's it. Save yourself the time. Call ahead, get the pizza within minutes, and have more time to explore NYC.", "author": "Jason R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-13", "description": "The pizza dough is delicious but the service is HORRIBLE. They never came to ask us how anything was. We had to ask for refills on water every time. They are so disorganized that we ordered a tartufo and never got charged for it. Rightfully so we should have gotten free dessert with the level of service. They also do not serve Ricotta on their White Pizza....whats that about?", "author": "Marisa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "I had such a great experience coming to dine here with 4 other people. The wait time for a Monday evening was about 10 mins which shocked me because every time I'm in DUMBO the line is ridiculous. Nonetheless I was really excited to finally try this infamous pizza shop. The waiter was great and extremely attentive, we ordered 2 large pizzas, classic Margherita and a pepperoni. It took about 15 mins to come out and boy was that \"wait\" worth it! Both pies looked amazing, not too greasy but with the perfect amount of cheese, tomato sauce and basil. It was definitely not thin, not obnoxiously thick, but a perfect crust. Will always come back here, just on a weekday.", "author": "Joann R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-21", "description": "In the previous addresses it was great. Now in the new address on the corner, in the white building, it's now horrible. I'll never go back. I'll be quick; it's cash only (I knew that going in, but it's not worth the cash and hassle any more). Long line to get in (also knew that going in, but it's not worth the wait any more). No air conditioning, hot and stuffy new location...  No alcohol, they don't have a license yet, imaging that.  And my biggest issue, getting a B-rating from the NYC department of health; they have to display the grade on the front window, so they hid the rating on the opposite side of where people would line up to get in (I didn't notice it until a month after I ate there with my wife and kids). To get an A-rating from the department of health is status-quo, any thing less that an A-rating it's never good.  Seeing that B-rating is what prompted me to write this review...  Beware!", "author": "Harry A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-11", "description": "I came here to celebrate my husband's Naturalization Oath Ceremony. Yay, America! Perhaps it was the stars aligning, but there was no line. And, of course, the pizza was delicious. And when we left, we caught a taxi right away that had no problem driving us to Coney Island. \n\nA good day indeed. For that, five stars!", "author": "Melissa A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-04", "description": "I finally tried Grimaldi's after reading about their pizza from the Rockstar Diaries, who rave about it. Their  coal brick oven pizza was definitely good, but I wouldn't say it was the best I've ever had. The crust was ok to me, but it was the mozzarella that I thought really stood out. There was something about the flavor that was incredible. \n\nEven though the pizza  didn't live up to my expectations, I don't regret waiting in line for an hour. It was definitely worth it, if just for the experience.  I was never in the old location, but the new one is really nice and we didn't feel rushed even with the long line waiting outside.\n\nIf you've really got your heart set on going here, I say try it once and then you can decide whether you'd go back.  My decision -  I came, I tried, It was good, but Grimaldi's will only be a one hit wonder for me.", "author": "Christina G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-02", "description": "I am not sure how many stars to give this place... let me tell you about my experience.\n\nAfter walking across Brooklyn bridge we decided to reward ourselves with the \"best pizza in NY\".\n\nWaiting line 1.5 hour, however we were chatting with people in line with us and were making fun of the double decker tour buses which would bring tourists to this place so they can see most ridiculous line for pizza ever.\n\nInside it was quite small but very busy restaurant. I was looking everywhere to find the Health Department score but couldn't\nt find it... the reason why - because dining room looks very unclean. Very! Hopefully kitchen is clean...\n\nPizza came right away! we ordered large pizza with half white pizza with mushroom and sausage and another half with pepperoni and basil. I loved the pepperoni side! Really tasty and garlicky. If I  would ever come back I would get pepperoni only! Mozzarella cheese was delicious. However I couldn't taste mushrooms on the other side of pizza. And sausage was blend.\n\nWe got two bottles of Brooklyn Pilsner and with tax and tip we paid $41. Quite steep for the pizza.\n\nI would say I still love Little Star pizza for the better ambiance and wonderful pizza combinations instead of just selection of toppings - as Grimaldi offers.", "author": "Anelya S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}