{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "one of my FAVORITE parts of our visit to NY! We got off the ferry in Brooklyn from our  tour of the Statue of Liberty, and got really excited to finally try Grimaldi's.  There was a long line outside, but it actually went by pretty fast. We ordered a pepperoni and sausage pizza.  The pizza took a while to come out (they were super packed) but oh man was it worth every second of waiting.  The crust was thin and crispy, the mozzarella cheese was so fresh, and the sauce was not overpowering, the pepperoni was so authentic. They even had garlic salt shakers (major plus).  I loved everything about it.  Don't forget to try their cannoli's, even if you're full, trust me you won't regret it, it was heaven!! \n\nJust when I thought pizza would never be the same again for me, we were told there's a Grimaldi's in CA! We have yet to try it, but we are crossing our fingers its just as good!", "author": "Tanya D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-02", "description": "Walked across the Brooklyn Bridge to get here. \nThere was a line out the door. Although there was no sign-in system, we were unsure of how the seating worked. Waited in line and a man came up and asked how many people were in our group. He never asked for our name so we were still unsure how the seating worked. Finally he came out and asked everyone for a group of (2) people. We raised our hand and since there was nobody with a group of (2) before us, we figured it was us. Waited about 30 min on Saturday lunch time. \n\nWe ordered a small chicken \u0026 sun dried tomatoes pizza and it came with (6) big slices. It was plenty for a couple to share. The food was really good. Everything tasted fresh and I especially loved the mozzarella cheese. \n \nWe wanted to grab a beer but unfortunately their liquor license is pending. So we just got water. \n\nPricing wasn't too bad. About $25 for what we ordered. Cash only! So don't forget to bring cash. They do have an ATM machine  \n\nBathrooms were really cramped but it is an older building so I wasn't surprised. \n\nOverall I give this place a 5 star because pizza was bomb.", "author": "Lyka C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-30", "description": "Terrible seat organization. Old man let my family be waiting at upstair for a long time even though there were bunch of available seats at 1st floor. Also service was horrible. Old man yelled at my family to wait upstair and never tried to listen. Never visit this place ever again. In a nutshell, if you want warm? You have to pay your time!!!! Nobody will care you at all!!!", "author": "Shawn L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-28", "description": "Major tourist trap. Food was actually good but horrible service. Server never came to fill our water or check in on us. And on top of that he added 18% gratuity on our party of 5 when the policy is that they only add for parties of 6 or more. Luckily we checked the bill and we didn't end up tipping again. I am sure they are used to ripping off unsuspecting tourists like this.", "author": "V G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "Having only eaten at a handful of NYC pizza joints, I'm not sure if this is the best but it is pretty flipping good.  Delicious crust with a bit of salt, tasty sauce and just enough, a little \"wet\" neo style, and a great variety of toppings.\n\nA medium is PLENTY for 2 - six oversized slices.  They are pretty quick but I heard that at peak hours there can be a line and wait (we were there at 2).\n\nStroll across the Brooklyn Bridge and then a little backtrack or take the blue train from downtown Manhattan.\n\nThey do not serve alcohol, and they are cash only.", "author": "Shawn S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-27", "description": "So after coming to Dumbo, BK and always seeing huge long split lines between Juliana's and Grimaldi's, I knew I had to some day eventually try both and compare. I'm sure they both get this all the time. I went to Juliana's last time and it was pretty darn good. Today at Grimaldi's, we ordered a large red pie for $16 with toppings of sausage and pepperoni ($3 each) and onions and mushrooms ($2 each). We also ordered a white pie for $18 with ham ($3) and tomato ($2). The pizzas are made to order and there's no preset types if you are looking for that. You build everything yourself. Some people might like this freedom, but sometimes I prefer an experienced pizza maker to create something unique and tasty for me. The crusts at Grimaldi's wasn't good, tasted like burnt bread. Usually my husband will eat all his crusts and even he didn't eat them today. The red pizza was also way too soggy even though their pizzas are brick oven. It was almost impossible to hold up to eat. I had to eat it with a fork and knife and I hate doing that with pizzas. I mean, the pizza was okay, but I wouldn't stand in line for this place and I'm not sure if I would actually come back. I felt a little cheated after and deep inside I think I secretly wished I had gone next door to Juliana's instead. I feel bad for saying this on review, but got to be a honest Yelper right? Touristy pizza place, ATM machine upstairs because cash only.", "author": "Priscilla C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-24", "description": "Pizza is ok but real dirty and trashy inside. Plastic utensils. Wait is a mess. One guy sits whoever he wants. After 45 min you get in and at least 20-30 empty seats. They try to give the impression that they are the real deal but i think next door is the real deal.", "author": "Burak A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-27", "description": "Not #blownaway. I liked the old place a lot better. Pizza still good although undercooked. Tell them u want it cooked well. Ingredients very good-only redeeming factor.  Bathroom messy which sullied my taste for the pizza. Also it's not well ventilated so it smells a bit cafeteria-ish.\n\nLook in a Sea of phenomenal Pizza it's hard to be best in class-but this used to be the best pizza around and I'm afraid to say I think it's middling....", "author": "Laurie J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-18", "description": "In a vacuum, it's decent pizza, nothing special by NYC standards. But the service is poor, borderline hostile, and it's clear they view it as a gouging operation for tourists. My wife was just there to pick up a pie and it wasn't ready yet - the young lady running customer 'service' at the front was busy stuffing her face full of pizza (seriously?) and rudely told her it wasn't there, no effort to inquire when it might be.\n\nJust go next door to Juliana's - better pizza but SIGNIFICANTLY better service. Never going to Grimaldi's again - just making their money off past glory.", "author": "A H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-27", "description": "Over the weekend, out of boredom and the desire to get out and enjoy the beautiful Fall weather, I decided to act like a tourist and enjoy a day trying out this popular place with a willing friend. After reading the yelp reviews, I was prepped for a long wait. And sure enough on arrival, there was a sufficient line of about 20-25 people. The sign out front was prominent, stating, \"Please wait to be seated. And dining and take out is the same line, ok thanks\"\nWell much to our surprise, the line moved quickly. And being only two people, we got shuffled in within 15 minutes! So that's a nifty thing to keep in mind. ;)\n\nGrimaldis is your typical fast paced pizza place with a simple menu of only a few pizza topping choices and two sizes. But then again, you come for the pizza. And not much else. Why complicate a solid formula that has worked for years?!\n\nWe were seated in the second level which had a view down below of the pizzas being made. And like a factory, your order is taken, pizza is created and boom, you eat. \n\nThe pizza was good. The crust was just ok in my opinion and parts were a bit blackened and burned but that added some flavor. The toppings were good, we has sausage and cheese but the pie itself was a bit soft and required a fork and knife till you'd eaten the triangle tip. So initially folding it the classic NY way isn't happening. But flavor wise? Sauce was good. We still devoured our 6 slice small pie between the two of us. Was the perfect size for hearty eaters!\n\nService was fast, attentive and prices are good. Overall, Grimaldis is a great NY experience and one I'd share with anyone not from the area. \n\nThis iconic NY pizza joint does not disappoint", "author": "Linda B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-26", "description": "Last time I was here was almost 3 years ago, and unfortunately the pizza is a no! You'd think it would improve, but its a no go. What was once a thin crust, crispy pizza with hearty toppings, is a somewhat soggy crust with far less than stellar tastint toppings. I asked for mushrooms, and jalapeños on my half and received jalapeños that didnt even make me tear up. I dont know what variation of jalapeños was used but it needs to be retired. Grimaldis pizza is lack luster, and overrated. Not worth the hype. This is more a tourist attraction than a place for the native New Yorkers who know good pizza.", "author": "Jei C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-23", "description": "4th time in NYC and finally made it to Grimaldi's. Located under the Brooklyn Bridge, it's not hard to find. I came with Ken L. during the week for lunch. We arrived right when they opened, around 11:30 a.m., and was able to beat the lunch crowd. We were seated right away. We ordered a small pizza ($12) with red sauce, sun-dried tomatoes ($4), mushrooms ($2), and sausages ($2). The pizza had 6 slices and is recommended for 2-3 people. \n\nThis was my first real experience of real New York pizza. I was initially undecided about whether to try Grimaldi's or Lombardi's but after going through many yelp reviews, I decided to put Grimaldi's on my food itinerary. I loved the think crust and fresh flavors of the ingredients. I will definitely be back during my next visit. \n\nNote: Cash only. Can't buy by the slice and need to order a whole pizza.", "author": "Steph F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "Came in at a good time, it wasn't very busy, we were sat immediately and pizza came out super fast! Kept the pizza simple with just pepperoni and it was delicious! I guess we were lucky since it was raining out so there was no line. Apparently this place gets really busy.", "author": "David F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-20", "description": "I'm a fan of Grimaldi's - the pizza was delicious.  I'm from Los Angeles, so everyone clowns on us for not having good pizza so every time i come to NYC i try to eat a different one of the \"good ones.\"  I had Lombardi's last year and I've also had artichoke.  My favorite so far has been Lombardi's.  The pizza here at Grimaldi's is a little bit softer than Lombardi's and this place doesnt offer the white sauce pizza.\n\nMaybe I'm missing something and the crust here should be a little softer but i did prefer the one from Lombardi.  That being said, you have to eat here.  The pizza is really delicious and the place is an institution.  Cash only so bring cash and be prepared to wait in a line.  We came here on a Monday like at 1pm and waited about 30 mins.", "author": "Eri A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "A wonderful first experience with New York pizza...yum!  Reasonable prices, fast service despite the line to get in.  Definitely worth the wait.", "author": "Kim L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-08", "description": "Shocked and disappointed, maybe I built it up too far, but I had big expectations for the pizza here. Those lofty expectations were not to be met.  \n\nI'm a huge pizza fan, and occasionally make the trip to the city specifically to taste some of the very best.  Lombardi's, Totonno's, John's, DiFara's... This pizza does not belong in the same sentence.  \n\nThe crust, nicely crisp and had great flavor and a nice touch of char, but had lost its supple spring and texture. I found the sauce too mild, both in spice level and acidity, soft and lifeless.  On a second pie I ordered, I found the cheese sparse as well. \n\nIt wasn't a bad pizza, but it wasn't the chart topping moment I was hoping for either. Glad I didn't have to wait in line too long, got very lucky I guess.\n\nB-", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-01", "description": "Don't do it! The line and wait are not worth it. Here visiting from LA and we've got over priced average pizza like this back home. \nThe restrooms were filthy and the service was just OK. The host did have us move the line upstairs because of the rain. $25 for a small pizza just not worth it for above average pizza.", "author": "Mike R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-03", "description": "After a long stroll around the city, my boyfriend and I decided to stop in here and end the day the right way with some good old fashioned NYC pizza.\n\nSince it was just the two of us, we were seated relatively quickly despite the long line. Unfortunately, it was literally right next to another couple at what was essentially the same table. Needless to say, any possibility for romantic vibes went right out the window! We had a nice chat with the other patrons though, so it ended up being only semi-awkward by the end.\n\nYou can't order by the slice here, so we opted for the classic white pie. It was definitely phenomenal pizza--gooey and authentic mozzarella cheese just cannot be beat. It was too easy to polish the whole thing off in one sitting.\n\nAll in all, I'm not sure if I'd come back here. The pizza was to die for, but I'd prefer to go without the gruff service and bizarre seating. With so many great options in Brooklyn, I think I'll take my business elsewhere next time!", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-09", "description": "My friend and I came here yesterday afternoon. Our experience was wonderful! Although there was a line, we waited no more than 20 minutes than the usual hour.\nI believe the head manager it owner was very nice. He ensured we were comfortable and even placed my friend's jacket on her chair :) he was very sweet. We were seated at the second floor. They had outlets which was convenient as my phone had died. \n\nWe ordered the small basic pie, which took about 20 minutes as well. I would say the wait time was a little long for us. When we asked our waiter,\"will it take ten more minutes?\" He had replied, \"probably\". He could've answered more professionally, but none-the-less, our pizza arrived a few moments later.\n\nThe first bite was like a party in my mouth! The crust was just the right amount if crispyness and the pizza itself smelled divine! You can truly taste the fresh ingredients and coal fired crust. Absolutely delicious! \n\nI'd say the biggest plus was the amount we spent! Under $20! Our small pie was $12 ($2 a slice) and we decided to get drinks as well. \n\nNot too bad! The only downside would be that \n1. You can only order by the pie, NOT slice.\n2. It is cash only (unfortunately) \n\nBUT...\n\nIf you are looking for a great pizzeria with polite yet efficient service and at an affordable price ( bargain!), I highly recommend Grimaldi's in Brooklyn! :)", "author": "Christine A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-08", "description": "Yes! it is true what they say about this place. I tried this place with a friend on a saturday evening and waited on line for about 30 minutes. This pizza was some of the best that I have had in a long time but I'm not sure that I'd be willing to wait on that line again for another taste. \nAfter dining here my friend and I noted that while many seats were empty on the inside they still kept people waiting on line outside for an extended amount of time. It appeared to us that they want to maintain the \"busy\" look.\nAs far as the food itself, in my opinion, some of the pizzas that I saw come out were very burnt and I was greatful that mine wasnt one of them but the cheesiness was always just right. We tried a small pie with sausage topping but next time I would probably just do plain.", "author": "Celeste B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}