{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-08", "description": "Tasteless horrible pizza no salt v little cheese\nEven the sausage had no flavor\nGo eat a $1 pizza it's better", "author": "Bina G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-22", "description": "Honestly unimpressed with the service. Half of the items listed on the menu weren't available.", "author": "Erin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "The pizza was yummy but the weird seating was off putting.  We had to wait outside, as there was a line but when it was our turn to be seated they told us to follow the group in front of us to the 2nd floor.  When we got up there no one was there to greet us and lead us to a seat.  We just sat at a 2 seater and were eventually greeted by our server who seem rushed (probably due being busy).  However, we had to flag the server to get refills and our bill.\n\nThe reason this restaurant gets 4 stars is due to how delicious the pizza was.  It was soooooooooo fresh!!! Loved every bite and continued to over eat!  Plus they offer root beer, cream soda and orange cream soda.  It is my personal food heaven!", "author": "Michelle H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-13", "description": "Worth the trek and broken iphone (while i was taking pizza pics).  beautifully cooked crust. subtle ingredients. everything shines", "author": "Tony H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-20", "description": "I've had it once. Luckily it wasn't a weekend and we didn't have to wait long at all to be seated. Ordered half cheese and half pepperoni. Piping hot, thin crispy crust with melty cheese and sauce... it was good because we were famished. I thought they kinda skimped on the cheese. After 2 slices when the heat had died down and belly about full, the cooled off pizza was distinctly different than what it had been, just 10 minutes ago!\n\nDoesn't hold up.. not any different than Joes or Rays. Maybe less. Definitely not worth waiting for. Go to Luzzo's or Lombardi's (I've only had their white clam tho) and you'll see what I mean.", "author": "Elisa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-01", "description": "Even though my last experience with Grimaldis was not as pleasant as usual, I still want to give 5 stars. One time I saw a review \"to order extra cheese and it's going to change your life\". Now I can't imagine my life without extra cheese and extra basil on my pizza.", "author": "Adiya A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-03", "description": "Pizza is OKAY. I have tried much better pizza in other locations and even better brick oven pizza in the brooklyn area.\n\nThe wait is really not worth it. This is the so called original Girmaldi's location, however the ownership has changed. Pat Grimaldi owns the pizza next door, Juliana's. The doorman made a BS story how the chefs next door stole their recipe, only to find out the original Pat Grimaldi owns the pizza shop next door and had to give up his name when he sold the business to someone else. The doorman misled us with the information hence why I am putting it here\n\nService- Extremely slow. It was three of us and we ordered one pie which took over 30 minutes to come out. I would rate the serve as 2 out of 10. And the pizza as 3 out of 10.", "author": "Honest C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-16", "description": "When in NY, you eat pizza and Grimaldi's is a great place to do this. We came across Grimaldi's during a recent visit to Brooklyn. It was a toss up between Grimaldi's and Juliana's. We ended up trying both but Grimaldi's was the first choice since they were open a bit later on the night we stopped in. \n\nWe were seated after a brief wait in an upstairs dining area that overlooked the downstairs dining area. The building itself was historic in nature and the interior was neat, but old. Nonetheless, we were there for the pizza. We were served promptly and decided to order a Margherita pizza with added ricotta and olives. There was not an option to order by the slice, so be prepared to have leftovers unless you have a group of people. \n\nThe service was average and friendly enough, but not overwhelmingly so. Our pizza came out in about 20 minutes and it was quite delish. The crust was a tad bit crispier than I like and the olives were salty, but overall the pizza was way better than any I have had in my hometown of ATL. Not too much sauce, not too much cheese- just right! I would definitely recommend Grimaldi's but I have to admit that I prefer Juliana's if I have to make a claim. The great debate between the two neighboring spots made me curious enough to try both and if you try both, you must chose. It's only fair.\n\nThe atmosphere at Grimaldi's is not as great as it is at Juliana's and they do not serve alcohol here. Also, they are a cash only location which is a bit inconvenient if you aren't a cash carrier. There is an ATM inside the establishment but there is also a fee to withdraw so plan ahead for that.\n\nOverall, a great place to grab a pizza but I am still searching for THE perfect NY pizza. I know it's out there.", "author": "Lindsey E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-10", "description": "Hard to rate a pizza place that doesn't answer the phone during business hours. It could be great? You need to answer the phone. Period. End of story.", "author": "Roger Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-20", "description": "We got 2 large, One cheese and one mushroom. There are 4 of us. Myself, adult female, and 3 teenagers. Both pizzas were excellent. Parmesan is not on the table but if you ask they will supply it. It's a tight fit and the line can get long so arrive early.", "author": "Jessica V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-30", "description": "Take a walk across Brooklyn Bridge. Wait about an hour to be seated. Listen to those around you babble about how Grimaldi's is the, \"best pizza ever.\" Great pizza, whatever service. Welcome to Grimaldi's. \n\nFun Fact: Grimaldi's true owner was never able to buy back Grimaldi's so they opened up a shop next door. ;) \n\nAs soon as you're seated, a server walks by with cups of ice and menus. I'm laughing now but I was surely unimpressed with how MISERABLE these servers looked to work there. I mean, LET ME TELL YOU THEY LOOK LIKE THEY'RE DONE. And it doesn't matter what time of day you arrive, they always have this, customers suck expression plastered on their face. There is never a, \"Welcome to Grimaldi's\" or \"What can I get for you today?\" \n\nBesides the service, food here is pretty good. A solid 4/5 in my book. Thin crust, hot out of the oven and nothing is ever burnt here.", "author": "Emily J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-30", "description": "I came with my family for famous pizza . After an hour waiting , we waited inside for an extra half an hour . \nPizza was just ok , nothing special . \nAt the end they brought the bill with big tip included , when ask what is , lady with unhappy face said its a tip do you have a problem with that??? \nTotally not worth it \nNot coming back   !!!! Overrated not recommended", "author": "Cathy B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-15", "description": "A shame that it's no longer owned by the original owner. Affected the customer service. The new owner is overly confident by showing you that he doesn't care if you leave. He believes the old reputation of the place will keep it running, and for those who don't know the story, they do help keep this place open.  But if you want the original spirit and flavor of Grimaldi's, just walk two doors down to Juliana's.  That's where the original owner has opened up.", "author": "Joan D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-15", "description": "Little disappointed. We decided to eat here and also taste test verses Juliana's. Absolutely no customer service from the waiter.  The guy at the door was really nice though must be the manager. But I found that now that it's a chain restaurant the quality of pizza has declined. It actually taste better in other areas of the United States but when you compare it to Julianas there's no comparison", "author": "Andrano C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-14", "description": "Risking public backlash, I'm going on record and saying grimaldis is all hype. I've gone quite a few times and I'm just about always unsatisfied. First impressions with the line will probably boost your anticipation, however the service is less than admirable and the pizza the same. Yea it's crispy but not consistent. It's a dry pie, thin crust as they want it, but not fresh tasting at all. While I say these harsh things I feel there are some redeeming qualities but I simply cannot think of any; you'll find multiple locations, all serving their pies in a bag, all with the grimaldis name, and all with the same boring flavor profiles. To me, it's an overwhelming \"eh.\" Too much hype, not enough love. I came fro Di Faras as well which is by far a better pizza so the comparison is a bit unbalanced. As well, I went to Ignazio's around the corner from grimaldis after (took the gf on a pizza tour that day, good sport) and despite their multitude of biased reviews due to grimaldis loyalists, they had a good pie as well and a lot less of a line; a bit friendlier and tastier hands down.\n\nPlaces like this always get business, and the hype always continues because of that mob mentality or something, it's sort of rubbish if you ask me.", "author": "Doug W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "Ok now I know what the fuss is all about. Really great pizza!  Lifelong New Yorker here, and it took me 33 years to get here.  I had the regular, and the ingredients tasted super fresh and the crust was terrific.  We also had a special with roasted peppers, sausage and mushrooms - it was top heavy and a soggy from the veggies.  I'd recommend the regular.  \n\nI went on a random Wednesday night at 4:00pm with a wind chill of like 30 degrees.  So, no wait!  I think I'd be less rosy if I had to wait 1-2 hours for a slice.", "author": "Doris D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-25", "description": "Walked the Brooklyn Bridge, thought I'd grab some pizza on the other side. I read the Yelp reviews for both Grimaldi's and Julianna's and figured Julianna's was top dog. I stood in line there for about 10 minutes, but the Grimaldi's line was actually moving, so I came over to this side instead. That probably was a mistake.\n\nAfter 5 minutes in line, we were seated upstairs in Grimaldi's. We ordered a small pizza with two toppings for the two of us. Pizza took 45 minutes which was a total buzz kill. Pizza was cooked okay, but was very salty. A beer would have been nice. Keep that in mind when ordering, the more toppings you put on, the more salt you are putting on your pizza, and the less edible it becomes.\n\nFor all the little rules here, this really wasn't impressive. No alcohol (menu still says pending license, but that must have been for years judging by other reviews), no slices, cash-only. Paper plates and plastic forks. And a 45 minute wait for a salty pizza. I'll take my chances at Julianna's next time.", "author": "Warren C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-27", "description": "An embarrassment to both New York and pizza. This place is a complete tourist trap: no liquor license, paper plates and plastic silverware, an hour wait from the line to being served, and they don't accept credit cards. All of this might be acceptable IF they were able to deliver an order correctly, but their waiters are mysteriously drunk and can hardly remember the requested toppings. You'll be doomed to wait another twenty minutes. Lactose intolerants, or those with any allergies, beware. They truly only care about getting as many people as possible in the door, fed with decent pizza, and then paying their ATM fee.\n\nPatsy Grimaldi left retirement to open Julianna's next door, in the original building where the true Grimaldi's was once operating. Please, for the love of god, spend your time and money there. At the present Grimaldi's, you'll find only find people who don't care about their customers.", "author": "Matthew C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-30", "description": "Terrible experience here, got take out, waited for close to an hour, then got told they gave the pizza to the wrong person. We literally walked out the door with our takeout pizza in hand after people we waited in line with finished their SIT DOWN meal. \n\nWhen it finally got to the pizza itself, the peperroni was minimal and they decided to go nuts with the onion to compensate. Poor quality product, delivered in an unacceptable time frame. Will be the last time.", "author": "Shaun S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-05", "description": "Oh my, this place lost their Mojo! Even though I am not 100% it ever had it!\n\nNot sure if it's because of the over-hype or else but it certainly is one of those sad stories where an ok pizza place in Brooklyn slowly but surely slid toward mediocrity and can now proudly harbor its label of \"tourist trap\" pizza. So sorry to have witnessed this but in a sense, glad that Broolynites are able to keep their secret best places to themselves (I have been spoiled with excellent pizza in my own neighborhood).\n\nLooks like, as soon as a place gains a certain international hype, it's ruined by tourism or rather a poor management that will favor quantity vs. quality. They keep a line of people queueing even though they are tons of seats available upstairs. Beware, there is no AC inside so if it's super hot outside and you're trying to escape the heat with a nice meal under AC, you'll be disappointed here, but you can get lucky and sit near a fanned area. Staff is ok though. Just skip.", "author": "Eleonora B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}