{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-21", "description": "This place is all that.. Located right across the Brooklyn Bridge, most people arrive here hungry after having crossed the bridge. Everything about this place is great, from the Italian American guy standing outside taking you to your seats, with an Italian attitude, to the authenticity of this place. I really like that the oven and the chefs are placed right at the entry so you see everything upon coming in. We were seated upstairs, and the crew is all guys the tables are in the smaller side and seating snug. We ordered the pizza as depicted below it took about a half an hour to come out but it was definitely worth waiting for. It was one of the most authentic and perfected pizzas I have ever had. Everything about it was great; toppings fresh, cheese stringy and the bread freshly made. A medium as plenty for two. Great pizza in a place with much history and authenticity! Must go!", "author": "Farbod F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-02", "description": "Who stops in Brooklyn and goes there just for the pizza? WE DO! Grimaldi's is known for the best pizza ever! Located right under the Brooklyn bridge in a white building, you can't miss it. You will see long lines but it's totally worth the wait! There's a pizza shop right next to it that gets nearly no business because Grimaldi's pizza is really that great! \n\nThey serve water outside when it's hot and humid, so keep cool with the water and keep yourself entertained while you're waiting in line. Also make sure you have cash, they do not accept credit cards! \n\nStop by the booth and see how they make their pizzas, too cool!\n\nWe got a large pizza with pepperoni, it was to die for! Loved the basil that topped it. We finished our meal with a cannoli, so glad we got just one to share because I wouldn't have been able to finish one to myself.", "author": "Cindy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-19", "description": "Pretty awesome pizza! \n\nI loved how their ingredients were super fresh. The crush was chewy the way I like it. And the cheese. OMG the cheese as so good! I really enjoyed the pizza here.\n\nOnly downside was that the wait was close to an hour around lunch time. We were waiting in line to get seated. \n\nWould I go back? I definitely would if the wait was more reasonable. I don't think I would go out of my way to eat here again when I revisit New York though. I would rather try somewhere new! But definitely worth giving it a shot!", "author": "Stella M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-13", "description": "Walked right in on a Monday night. Yes I consider myself lucky. \n\nI felt like no's were being shouted at me left and right. NO credit cards. NO reservations. NO slices. NO delivery. In other words, wait in line, whole pie it is, and pay with cash.\n\nWe were seated and ready to order in no time. Then we waited. And waited and waited. Finally after a good 10 minutes someone that worked there made their way to the back to take our order. We ordered drinks and our pie all at once. Our pie came out rather quickly. It was quite the sight although for me, it didn't deliver on the taste. Enjoyed the crisp thin crust but it seems like NYC always delivers a solid crust. Loved the small circle curled up edges of the pepperoni although I did feel they were shisty on the amount of them they gave. Was not a fan of the nearly burnt basil leaves. The tomato sauce was flavorless. Cheese was good. \n\nI was seduced last night by a fantastic slice of pie so Grimaldi's didn't come close to impressing me. Service was painful so really once was enough for me. I'm just happy I didn't wait in line for it. \n\nPlease don't scorn me for 2 starring Grimaldi's. Just think of it as one less person who will be waiting in line so that should shave probably 30 minutes off your wait time.", "author": "Ciara G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-04", "description": "Fun atmosphere with all the history behind this pizza joint.  Wished the olives on our pizza hadn't been so super salty.  Would come again though.  The desserts were delicious.", "author": "Purvi P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-06", "description": "A genuine New Yorker took me here for what he called the best pizza in NY. It took quite a walk from taking the ferry into NYC, over the Brooklyn Bridge, but it was worth it.  Such yummy rust \u0026 all fresh ingredients. Not greasy.  Really was great.  Wish they had beer or wine but go next door for that.", "author": "Susanne M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "I've always passed this place and wanted to go in but the lines were crazy ridiculous. I've heard so many great things about it that I finally decided to bite the bullet and make the line. I got there with a friend at 7pm and we were sat down by 7:20.\n\nWe had the large pepperoni pie. Took about 10-15 minutes to arrive at the table.\n\nNeedless to say it was delicious!!!! \n\nHighly recommend and will visit again (hopefully when the line is not so long)", "author": "Laura E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-19", "description": "I'm from SF and was visiting the east coast for the weekend.\nHave family from the area although they have never eaten here before.\n\nThere were 6 of us and we ordered 2 large pizzas - \none was a white pizza (ingredients: mushrooms, pepperoni) and \none was a red pizza (ingredient: meatballs)\n\nBoth were fabulous although the white pizza was amazzzzing (yes, that many Zs!)\nThere was a really long line and it was a very chilly day but it was worth the wait and the several tissues i went through as I blew my nose in line. Again, it was a cold day!\n\nThe servers were great as well.\nI would definately go back here as it is a gem in DUMBO and worth the chilly wait outside. Love delicious food!", "author": "Cicely T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-31", "description": "There is always a wait here. I hate waiting an hour foe food unless its worth it. \n\nThe thin crust pizza is good. Not amazing but it is good.", "author": "Nam V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-14", "description": "Here's your best bet on getting a table at Grimaldi's: Come on a rainy Monday for lunch.\n\nThat's exactly what my friends and I did and we waited no more than 2 minutes for the host to seat us. We sat at a tiny table that had barely been cleared off, but that's part of the charm, right? Right.\n\nThis is definitely a no-nonsense kind of place, you got your pies, sodas and a few desserts. Waiters are nice and quick. Cash only for you credit card lovers!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-21", "description": "I don't like Brooklyn-style pizza. There I said it. My favorite pizza is Costco pizza.\n\nThat being said, I got the classic and the white pizza. I heard that Juliana's next door is run by the actual Grimaldi family. I should've tried that place but I wanted to go to the more popular location.", "author": "Cynthia J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-28", "description": "This place is famous, usually has a long line, and the pizza is cooked in a coal burning oven.  Some NYC food websites list this place as a good place for NYC pizza.  It seemed like it had locals and tourists.  It is an older place and has character which I like.  It was very chaotic inside but we were so hungry it didn't matter.  The pizza had a crispier crust, was thinner and tasted decent.  But it didn't stand out.  Many pizza places in other states are better in my opinion, not sure how it ranks against all NYC pizza places.  \n\nProbably worth a try but would compare against others locally.  If you really want pizza and are planning some time in DUMBO and have the time to wait/come at off time, this place will work.", "author": "Pat W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "The legendary Grimaldi's!  Although it has finally found its way over to LA and Vegas, I never got the chance to try it, so as part of our fun filled day in Brooklyn, it was a must.  Plus, you can burn off some calories by walking across the Brooklyn Bridge. \n\nThere was no wait time so we got seated right away... awesome!  It was unclear who our waiter was because I think anyone available handled our section, but it didn't matter because everyone was nice.  We sat upstairs and it was nice and quiet.  Very cool, fun, family feeling atmosphere.\n\nWe ordered half tomato based with mushroom, sausage, jalapeno and half white sauce with chicken.  The tomato side was a lot better, and we ended the meal with a delicious cannoli.  \n\nBetween Grimaldi's and Lombardi's, I liked Lombardi's better...but honestly at both these pizza joints, you can't go wrong and shouldn't turn down any opportunity to go here.  \n\nEnjoy and remember, CASH ONLY!", "author": "Lyn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-29", "description": "There is always a line at Grimaldis so one day when my friend was visiting from across the country, we decided to brave it and try Grimaldi's. The line actually moved pretty quickly and we were soon seated. There was nothing special about the seating area but it did \"feel like a very New York pizzeria\" according to my friend from Cali. We ordered a Large pizza with pepperroni, mushrooms, and olives. It took a litle while to get the pizza, but they made it fresh from scratch. The pizza was pretty good, I liked the taste of olive oil and it wasn't as crispy as I would like it to be but still delicious as the ingredients were really fresh and tasted of quality. I would come back again to try the white pizza.", "author": "Arthur V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "The first time I went to Grimaldis was last Sunday, and I must say it was worth the wait. Yes, you must wait on line to be seated. I was lucky enough to arrive at Grimalids when the line was very short and only had to wait 15 minutes. As I was told, the line gets too long and the wait ridiculous. \nTrust me the wait is worth it. You can choose a small (16\") or large (18\") pizza with any topic you desire. It's brick oven made, making the pizza's crust very soft and making thin slices of pizza. \nI advice anyone to go but try to keep a small party so you can be seated faster. \n\nEnjoy!!", "author": "Justin N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-28", "description": "I came here last night with my husband and two toddlers. We had such a great experience. Manager saw that we had two little ones and told us not to wait on line outside that it was too cold. We waited about 15min inside and then we were seated. We ordered a large pie with cheese, sauce \u0026 basil. Its was amazing we had to order another pie because we finished it so fast. A large pie is $16!! Which is excellent!! I had four slices and my husband had six! Lol. And after my husband had a cappuccino that was delish and they gave the kids a dessert on the house. It was the best pizza i honestly ever had. I cant wait to go back for some pizza!! If you are a pizza lover this is for sure the place to go!! Two thumbs up!!", "author": "Leila S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-13", "description": "I'm happy I got to try the pizza here, though it didn't live up to expectations. The pizza was decently good, but didn't stand out. We got half white pizza and half with tomato sauce. \n\nI actually preferred the white pizza - the mozzarella went well with the thin pizza crust. The sweet red peppers complemented the pizza really well.\n\nI think Lombardi's actually has the better pizza pie (though it's been quite awhile since I've been there.)\n\nThe comments about Grimaldi's being over-hyped are in line.", "author": "Nikki L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "Environmental: nice, clean, you can see how they make your pizza, high ceiling , old fashion style which is my style. And outside~ good building and crazy long line about 45mins wait at least.\nOnly one thing you will see the back of bar counter ,there has so many thing not relay to food and store stuffs. Something like hoodie ,motorcycle helmet and male. Mannequin body and lots of t shirt .......etc.\n\nFood: delicious, yummy, you can only get a pie ,not slice.\nThin cross and choose your own topping.\n\nFirst  we thought we can't finish even small size, then we finish whole large pizza . It's good but not hot at all. Warm pizza and long waiting, it kill ppl's appetite ^^\n\nServices: PPl are nice~ but It doesn't like table service....it likes you order and do lots of things by yourself. They won't come for asking\" anything good?!\" They just give you what you order. And..........food need wait pretty long~ so if you are really hungry you better get a snacks with you so you can calm lol.\n\nOverall I like it. Once After I try top 1-5 pizza store . I may come back again^^", "author": "Josephine B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-14", "description": "3 1/2 stars - crust is good but very dense, sauce is nice but could have more depth to it, meaning it's not very complex. Fresh moz and basil was a plus! Had mushrooms as a topping and it seemed like they were just haphazardly thrown on and had little taste. Plastic plates and curt service, but that adds to the no-nonsense charm. A little over-hyped but definitely glad I tried it!", "author": "Caroline D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-18", "description": "Awfull experience, the guy on the front door was barking like a dog : stay on the line.... then the pizza is really bad... and pricey for what it is... run away from this place !!!", "author": "Skander C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}