{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-03", "description": "First off the customer service was disappointing. Ashley was taking orders and I thought she was rude, impatient, uncaring (seeing how she never looked at me as I ordered) and snappy. When I received my pizza I didn't understand what this \"perfect crust\" hype was about. Mine was completely soggy. The spices were good and unique but the cheese wasn't. It was like someone baked it in the oven, put it in the freezer, then reheated it in the microwave and let it sit out for too long. It wasn't fresh and the consistency wasn't appealing. I literally considered tossing my leftovers but I couldn't bring myself to throwing away an entire pizza. They should really sell by the slice instead of forcing you to buy an entire pie. I wanted to sell my leftovers to the line but I thought I'd spare them my poorly prepared pizza and hoped that theirs was better. Never again.\n\nExtra note: They only accept cash and their atm fee is $4.50. If you go down the street there's another atm that is cheaper", "author": "Kristy F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "Simply delicious!! Rub your nose on the computer screen, maybe you can get a whiff of it. :)", "author": "Sharna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-23", "description": "Was just happy to be in such an iconic place. The cheese was a bit chewy  felt, but the tomato  pizza sauce was DIVINE! Made all the difference. \n\nI know this is authentic and only pizza, but would love to see more things on the menu in the future! Could use a spiffy menu revamp. Lovely location, and average service.", "author": "Priyanka P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-05", "description": "Grimaldi's... The pizza is pretty good, I have to say, but probably not worth justifying the 1.5 hour (gasp) wait. At least they let us into a bar on the top floor such that we only waited outside in the cold (this was during the Winter months) for about 20 minutes. The reason we had such a long wait time was most likely due to our party of 6. Plenty of people with smaller parties who came later than us got seated sooner.\n\nAll in all, the pizza quality was no different here than at the Manhattan location, where I had absolutely no wait. So if I had a choice, I would just go to the Manhattan one...", "author": "Alan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "Very delicious pizza!! The atmosphere is unique too. I would recommend and eat here again on another visit! I would caution when ordering the olives.. They're extremely salty and not to my liking.", "author": "R R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-31", "description": "The pizza was great but served on plastic dishes (Cutlery, plates, cups) - really!?! It's the 21st century. It felt so cheap and it's a deal breaker for me since I care about the waste created.", "author": "Jana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-16", "description": "I've been to the one near Brooklyn Bridge once and it was sublime.  I've been to the one in Coney Island twice and it was pretty good.  Apparently, the pizza maker at the Brooklyn Bridge location must have more craft or something.  \n\nI need to go back to the Brooklyn Bridge location and see if lightning can strike twice.  Also, it's a friendlier location because more people talk with their neighbors at this location (or at least they did at the original location before moving 1 building over).", "author": "Danielle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-03", "description": "GRIMALDI'S CHANGED MY LIFE!\n\nWe got the small pizza with nothing but basil, tomato sauce, and fresh mozzerellea (their standard pizza). It seriously CHANGED MY LIFE! I can't eat pizza the same anymore! Okay, all I can say is the pizza is really AMAZINGGGGGGGGGGGGGGG!!!! I dream about it sometimes, SERIOUSLY, NO JOKE! I stare at pictures that I took of the pizza...I'd also like to point out at this point that I'm not crazy, thank you. :)\n\nWe had the most interesting time here, besides the pizza being wonderful, we sat next to what I think was a newly wed couple, literally it looked like they had just said their vows like an hour ago, now get this, the couple looked like they were 17 years old! They were there with 2 friends (obviously friends of the bride) and parents from both sides. The sad part, the groom looked so, incredibly, sad. He just sat there, didn't say a word and the bride did all the talking, ordering, just everything. Me and my friend couldn't help but try to figure out the background of that situation. LOL. To the couple that was there that day, best of luck to you and your new marriage...cause that boy did NOT look happy! \n\nBut yes, PIZZA here is A+++++++++!", "author": "Hannah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-29", "description": "Money! Best crust hands down the meatballs (topping) were fantastic will always stop here", "author": "Matthew M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-26", "description": "Overrated tourist trap?\n\nThe pizza here wasn't that great. The toppings were good, I'll give them that.. but the center of my pizza was literally soggy and kind of even cold. The crust did't have that \"thin-but-fluffy' texture that the better (in my opinion) pizza places had in NYC.\n\nI tried 4 different pizza places during my vacation.. but this definitely has to be last place, for sure!", "author": "Kazu O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-25", "description": "3.5 down to a 3\n\nShort \u0026 sweet: \n\nService: 3.5\nFood: 3.5\nWait time: +30 minutes outside\nPrice: 4\nCleanliness of bathroom: n/a\n\n\nI was a walkin' around Brooklyn and I thought, hey! I should walk across Brooklyn Bridge! And then I remembered a yelp review where the person regretted not having gotten Grimaldi's pizza and eating it at Brooklyn Bridge Park. I thought, hey! I'll do that! \n\nStanding in line for the pizza took 30-40 minutes. Luckily, I chatted with a Bonny and John from Wisconsin. Nice people, they were. And then I got to go to the front of the line because I had a take-out order. \n\nSo. You're not allowed to order just ONE slice of pizza. I didn't find out until I was 25 minutes into my wait, by which point, I just told myself I'd just have to eat the entire small pizza (6 slices, so what?). This is what I get for not having a smart phone and making spontaneous decisions. \n\nI got the small regular. \n\nIt was good, but maybe it's that I'm not used to coal brick oven pizzas, but I was expecting there to be more... of ... well, just more. More basil? More sauce? More...deliciousness? \n\nI went to a nearby park, enjoyed the beautiful weather as I munched on my pizza (succeeded in finishing off 3 slices), carried the other half as I walked across the bridge and gave it to the nice Pedestrian Guard who in return, took a picture of me on the bridge. \n\nSplendido!", "author": "Alice K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Don't see what the fuss is all about. Good pizza. Can't get a slice without waiting in line for a pie. Its ok but not as crazy as everyone says it is.", "author": "Giovanni R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-27", "description": "It was my first time there with my family, and we ordered a pepperoni pizza, and a veggie pizza that had olives, sun-dried tomatoes, and some other stuff. Let me say, the margarita pizza looked delicious, yet we didn't order it. The pepperoni \u0026 sausage was first. It was a yummy, authentic brick-oven pizza.The thick layer of mozzarella was scrumptious. On the other hand, the veggie pizza was blehh. it had an acquired weird taste, never again shall I order that.", "author": "Maria L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-09", "description": "3.5 Stars.\nI think because of the history and yelp reviews of this place my expectations were a bit too high for it. But I didn't want that to spoil my visit so I tried to brainwash myself into thinking that its just pizza prior to heading in. \nWe waited in line for about a hour? we figured since it was raining there wouldn't be SUCH a huge line but. boy was I wrong. Fortunately, we got there around 6:30 and the line was only up to the entrance of Julianna's. Which isn't that bad--i've heard of worse. \n\nOnce we got seated we order just the basic margarita pizza since we wanted to try the basic flavors of the pie. The ingredients were fresh, the dough was FANTASTIC (i think that is what I kept raving about when I took every single bite). The tomato sauce wasn't out of this world and just tasted like any other tomato sauce; so I was very disappointed with that. Price wise, the pizza was great! But for the actual wait time and all the hype... I would go else where.\n\nBeing a native New Yorker I can finallly say I've been to Grimaldi's. woohoo!", "author": "Christie Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-08", "description": "Ambiance:\n*Awesome location with a great view of the Brooklyn Bridge and Manhattan.\n*Big seating area downstairs and upstairs.\n*No view from within the restaurant, but it's right outside.\n\nFood:\n*Great New York style thin crust pizza. \n*Fresh ingredients.\n*Small pies are about $12-18 depending on your toppings.\n*Just the right amount of cheese and sauce.\n*Great crispiness and crust.", "author": "Bing H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-11", "description": "This line is def worth waiting in. Once you get that slice and sink your teeth in, you will be very pleased as I was :-) Sooooo GOOD!\n\nOh, I love you New York!", "author": "Enjoying Each Momen T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-12", "description": "Brought my bf here for the first time last week. It was a chilly Monday night do there were no lines! This was also my first time visiting Grimaldis since they moved down the block to Toro's old spot.\n\nThey cram small little tables and small little chairs into their gigantic space to seat as many people as they can. They have the oven right at the front, so you can see them pumping out all the pizzas. The wait staff are okay - their thinly veiled hatred for their job is only apparent when you talk to them. They kept our water glasses full and didn't really rush us (again- slow Monday night) so I guess points for that?\n\nFood wise - as good as ever! The best part of Grimaldis would be the ingredients they use. They're fresh and delicious. Grimaldi's is definitely leaps and bounds ahead of Lombardis. I brought a few slices of leftovers for my dad (which he ate cold) and he said it was much better than L\u0026B's! Which kinda surprised me because my dad looooves L\u0026Bs. \n\nOverall - good food, still good even when it's cold, meh wait staff.", "author": "Stephanie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-14", "description": "VENUE:\nThe first thing you'll notice coming in here is just how space efficient it is. Every corner of space is well used to ensure maximum seating capacity. And even then, there was a huge line up outside!\n\nMENU:\nThe menu here is quite simplistic, so the three of us had no problems deciding exactly what to have. We quickly put in our pizza order, and then watch from afar as the one wooden brick oven churns out the hand-tossed pizzas one by one.\n\nFOOD:\nLarge Pizza (18\") with italian sausage, pepperoni, and mushrooms ($22) - The pizza comes piping hot from the oven, straight to our table. We marveled at just how large this pie was, before digging right in. We were starved from the line up!\n\nWhat I loved about this pizza is how well everything worked together. The pizza crust was nice and crispy on the edges, but malleable near the center where the heapings of sauce and cheese were craddled.\n\nThe pizza was just enough to feed three hungry mouths; we ate every single bit and were left feeling happy and full. I think Grimaldi's definitely lived up to all the hype, if you don't mind the line up, and the cramp seating that is!", "author": "Mary C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-14", "description": "My friend from California wanted a NY experience and part of that was having some NY pizza. I took her here to Grimaldi's because it's an institution. \n\nKnowing about the long lines and having witnessed them myself, I had my friend hop out of the car to wait in line while I went to go park the car. I circled around for 15 minutes and finally lucked out when I saw someone who was about to leave. I dashed over just as the host asked my friend how many guests. Perfect timing!\n\nI've been to the Hoboken location several times. The same great pizza, but the Brooklyn location has the history and the architectural charm. We were seated upstairs by the glass windows where we could look down at the pizza makers and the entrance.\n\nDelicious thin crispy and yet chewy NY pizza. My friend left NY happy and full.", "author": "Elle P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-09", "description": "Yelp keeps telling me that my next review awaits. Why Yelp is so insistent that I review Grimaldi's, I have no idea. Have I been? Yes, Yelp, at least a few dozen times. Have I been recently? No, Yelp, not really.\n\nFor me, there's no reason to go back. The owner's a shyster and quality has slipped every year. The old Italian crank at the front of the house who struts around like a bantam hen is very unpleasant. So, sometimes, are the guys who collect your money in the back when you go to pick up. (And why would you do anything else? Is there any food on earth worth waiting on this sort of line for?)\n\nMore important, the pizza really isn't that great any more. Not only are there dozens of places around NYC that make pizza this good these days, but the Grimaldi's folks seem pretty actively disinterested in quality maintenance. Even worse for Grimaldi's, the real Grimaldi (Patsy) has taken back his spot and is crushing. Grimaldi's has had to decamp down the block into a location that's been a revolving door of restaurant failure.\n\nBut don't worry. If this Grimaldi's closes, you won't miss the inconsistent crust (sometimes charred, sometimes mushy). Or the above average sauce. And even if you do, you'll still be able to get your Grimaldi's fix in Douglaston, Manhattan, Coney Island, Hoboken, Hoboken, Garden City, Chandler, Chandler, Gilbert, North Scottsdale, Scottsdale, Scottsdale, Peoria, Tucson, Fort Myers, Tampa, Tampa, West Palm Beach, Clearwater, Palm Beach Gardens, Las Vegas, Las Vegas, Las Vegas, Las Vegas, Las Vegas, Sparks, Mt. Pleasant, Allen, Grapevine, Katy, Dallas, Dallas, Sugarland, The Woodlands, San Antonio, San Antonio, or Corpus Christi.\n\nYeah, it's really not the same these days. Hope you're glad I did this, Yelp. Because Grimaldi's is fine. But I'd just as soon the guide book crowd keep crowding this joint and leaving a table open at Juliana's for me.", "author": "John B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}