{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-20", "description": "Okay the line for this place was longer than that of a club.\n\nGrimaldi's had a relocation to a bigger venue, but just next door to its old space. The line is always VERY long so don't go here starving. My friends did and almost passed out by the time the pizza came (not exaggerating!). Around 4, the line was significantly shorter. Was it just that day? Or does this happen everyday? No idea. But worth a try!\n\nAnyways, so after you exit the long line outside, you are escorted to a waiting room where you can sit and order drinks. We fooled ourselves into thinking that we were actually getting seated but nahhhhh. So by this point, none of us were talking because all of my friends were SO stricken by hunger that they didn't even have the energy to lift their heads. \n\n30 minutes went by and we FINALLY got seated. We dragged ourselves to the seating area and ordered ASAP. Pizza came within 10 minutes. We took pictures. We devoured it in 10 minutes. We were talking again. ALL IS WELL!\n\nSomething about the brooklyn water makes this pizza different. They're opening one in LA next to my work and they're bringing in a chemist to replicate that water. We'll see if that compares!", "author": "Lisa T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-07", "description": "Way over rated. Terrible pizza and lost liquor license. We live in the area. Tourists come here without knowing anything. Front door people are so rude. The original guys are next door. Way friendlier and better pizza. Wouldn't ever step in grimaldi again. Julianas is way better.", "author": "Sunny M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-24", "description": "This place gets 5 stars, and here's why. I'm a pizza freak, so when my buddy Steve took me here when I was visiting, I was excited. It has almost 1,000 reviews at the time. Needless to say, probably the best pizza I have ever had. Rumor has it, they do something to the water. The dough is so crispy and thin, but not burnt in any way. The pepperoni was curled over and cooked perfectly (thanks to that oven), so it took on a bacon flavor. The mushrooms weren't too thick, the sauce was bold and clearly house made, and the cheese. Oh, the cheese. That is hands down homemade motz. Sooo stringy and delicious, and it stays that was for a while. I normally hate NY pizza mainly because buffalo motz is oily and gross. This was creamy and rich. A+ guys, this is my pepperoni and mushroom hot spot on the East coast for life!", "author": "Adam N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-02", "description": "Came here yesterday (New Year's Day) for lunch with a friend. We waited in line for about 30 minutes before getting called in. The wait is shorter for smaller tables (i.e. 2 people).  We got a small pizza, no additional toppings. It was very good but I wouldn't want to wait more than 40 minutes to get in. Sauce is sweeter than other pizzas. Cash only, no slices (only pies) and the host can be pretty rude to people in line.", "author": "Dani S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-05", "description": "I did not eat there food but I have to say the person i spoke to on the phone was so rude and unpleasant i will defiantly not ever eat at there restaurants.", "author": "Keith Alexander S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "This is the best pizza you have ever eaten.\n\nYou're not going to agree with me.\n\nWe all have very strong opinions about pizza. Many scholars have posited that this is the true origin of the conflict in the Balkans. More than one history doctorate has been minted based on the analysis of pizza reviews as the start of the first world war.\n\nThat being said, the only reason you disagree with me about Grimaldi's being the best pizza is because you haven't eaten it yet. Once you do eat it, you will realize that history is on my side.\n\nMy hope is that this review will not spark controversy.", "author": "Jack R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-10", "description": "Yeah....not so worth the line.  It was ok. Nothing special, really.  The line was about an hour at 2pm on a Friday.  Go in pairs - it takes forever to seat a large table but pairs get called in first.  The bathroom was disgusting.  I know, you don't go for the bathroom, but the toilet seat was cracked and it was dirty...yuck.  it doesn't  take much. I would go for Lombardi's before I waited in that line again. I did like the local Brooklyn sodas with real sugar.  Also, the line is the same whether you eat in or take out.", "author": "Mandi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-08", "description": "I worked near here awhile and kept seeing crazy lines, figured i should give it a try. It's not half bad but it's no L\u0026B. Don't go at exactly dinner time try when its a little slower but sometimes even lunch seems pretty busy. prices food and service are all pretty good but not nearly good enough for some of the lines ive seen.", "author": "Mike R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-13", "description": "I'd give it a 3.5 if I could.\n\nIt's very good pizza. I think we all know that. Whether it's the best ever or not, who knows? But it's good. Chances are you'll like it.\n\nCouple gripes. First, I don't think it's worth waiting as long as some people do. Thankfully, we were only in line 20 or 30 minutes and got to jump to the front because we were the first party of 2 in line. Bonus. Had I waited for an hour or more, I don't think I would have been very happy. I had Yelp open on my phone looking for another option when we were called.\n\nSecond, the servers here are clearly overworked. One guy in line lied about how many people he had in his group to get a table and forced the staff to accommodate the two extra people he had by having them moving people already eating to different tables. Really? Just kick him out. You don't need the business - you have another 50 people waiting outside. I was impressed they did it, but they were clearly annoyed and talking under their breath about the guy behind his back.\n\nAlso, our server took our order and we never spoke to him again. So drink your drink slowly, because you won't get another one. Hope you're not thirsty.\n\nIf you can get in without waiting too long, it's worth trying the pizza if only to say you've tried it.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-04", "description": "pretty good pizza, but not quite sure how it became the best pizza Mrs. Obama's ever eaten??? Nonetheless, quality for the cost.", "author": "Shree M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-24", "description": "Worth the trip to Brooklyn. Some of the best pizza I've ever had. \n\nThin crust, amazing sauce and covered with mozzarella. Definitely lives up to the hype.\n\nAdvice: If you can, get there early. We were there at 11:30 when the doors opened and didn't wait at all.", "author": "Trey K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-14", "description": "This pizzeria had a long line and was crowded.\nThey make it fresh when ordered, so it takes time.\nThe pizza with fresh cheese and tomato sauce is basically good .\n\nAfter enjoying this pizza, we went to see and walk along the Brooklyn bridge and had ice cream from Brooklyn Ice-cream Factory. \n\nThe good weather and beautiful scenery made me happy!\n\nIf you want to read Korean review, click here...\nhttp://blog.naver.com/yesican1/120051297053", "author": "MJ H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-19", "description": "Best said by Public Enemy... Don't believe the hype! Its good pizza but there are better $1 slices out there", "author": "Mathew H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-09", "description": "Stopped by this place after crossing the Brooklyn Bridge.\n\nAfter a long hot walk in the summer, ended up waiting in a long hot line for a pie that... well, wasn't too particularly special.  It was filling, certainly, but I think they had to cook it a little too fast and the crust wasn't as crisp as I'd expect.  Okay amount of toppings and the sauce was a little light.\n\nI've had better.", "author": "Hank C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-05", "description": "Delicious thin crust pizza.  It is not worth the wait though.  On a nice day, I would wait on the to-go line and bring it to the brooklyn bridge park to enjoy on the grass or bench.", "author": "Linda L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-27", "description": "I don't understand why people wait outside for this place.  There are dozens of places just as good and a whole lotta that are much better.", "author": "Nathan Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-25", "description": "Being from Arizona I had never experienced New York pizza before.. my friend had been here several times and told me we ABSOLUTELY had to have Grumaldi's ... so I certainly didn't want to pass up the offer,\n\nAs I waited in line I chatted with the woman in front of us. SHe recounted her story of how she found the place; google searched \"Best pizza in new york\" ... so I was pretty confident this was going to be some goooood pizza.\n\nWe waited an hour to get in, and anyone planning on going here should know that 1) you will have about an hour wait and 2) your wait is worth it\n\nIt took quite a while to get our pizza, but the environment was very pleasing. Everyone was in a good mood and the red checkered tables made me quite nostalgic.\n\nWhen the pizza arrived, I was blown away. The fresh mozarella mixed with basil was such a treat. It wasnt the standard greazy, cheesy pizza you find everywhere, it was litereally like fresh mozarella, tomatoe and basil on a warm crisp pizza crust. AMAZING!!!!'\n\nIt's not cheap, it's not quick, but it is fresh and delicious and worth the wait, in my opinion.", "author": "AMber W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-01", "description": "It is hard not to leave Grimaldi's disappointed these days. It takes over 30 mins for the pies to get to you after ordering, the new location lacks charm and is in need of a renovation, the oven is inferior and too hot, leading to invariably burnt crust and obliterated basil, and all the while you wish you had just gone to Juliana's. Grimaldi's is at a crossroads. It can either go back to the basics, perfect pizzas in a smaller location, or continue its decline and hope for a future in fast food franchising while its name is still synonymous with pizza. With every passing day as an inferior pizza joint guidebooks are changing their reviews and less locals are  willing to give Grimaldi's a second chance.", "author": "Josh K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-01", "description": "Good pizza. Crust was perfect. They won't sit you until all of the party is present. Service is lackluster so skip it and order take away. Definitely worth eating at least once.", "author": "Jason H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-19", "description": "This place has a good pizza recipe. Waited 20 minutes on line until we were seated. Definitely worth it. Peperoni and mushroom topic was delicious. Will come back again.", "author": "Jen D."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}