{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-24", "description": "Best pizza in Brooklyn. Always make an effort to get to Grimaldi's, either location. Pie is always perfect, toppings are superb. You're missing out if you haven't been to Grimaldi's.", "author": "Frankie A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-21", "description": "Worst antipasto ever -- a few measly slices of salami and cheese with some very sad olives.  Nothing green on the menu.  Would it kill them to offer salads?  Our pizza was all right, if a bit wet.  Negligent service.  No wine or beer, and they only take cash.  There would be fewer people on line if there were more food offerings in the neighborhood.  For the price I do not expect to eat with plastic utensils and plates.", "author": "Ann S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-11", "description": "I had tried at least 3 times on my other trips to NY to eat here. The line was always blocks long - even to get to-go is the same line. It really looked like they have one coal burning oven with limited capacity to make pizzas. They also recently moved and changed owners which might explain the other location that popped up in Manhattan. I never had a chance to try the old place but the pizza here is pretty darn good. Anyways we came about a half an hour before opening and were first in line. Waiting before is way better than waiting in that long line. Anyways they took their sweet time opening up their doors and setting up the line poles. Didn't open till 5 minutes past. Then they have one guy bring in each party one at a time. We somehow got seated in the back and had the hardest time flagging a waiter down when we were ready. We were seated first so shouldn't we be able to be one the first ones to order. I saw at least 7 tickets in the window before we got our order up there. If there's anything that's a pet peeve of mine at restaurants, it's slow and inefficient service. \n\nSo anyways we ordered 2 smalls - one with pepperoni and one with olive and sausage. Each small comes with 6 huge slices so 12 slices for 4 people is a lot. Especially when three out of the four are girls. I think we should've gotten a large (which is 8 slices) and called it a day. The crust is very thin and can be burnt at some places but it's fast to cook and the food came out relatively quick for pizza. I definitely think I'm more of a thin crust fan than a thick crust and this place makes thin crust like the best of them. Quality ingredients too. Pepperoni is small and kinda sparse on the pizza but thickly sliced and so good. Love their sauce and mozzarella cheese. I think I liked their sausage more but the olives were your typical canned olives and these were way to salty to me so it kinda threw off the balance of the pizza. Their sodas and beers are bottles btw. The busboy kept up with clearing the tables quickly but we had to ask for refills on water. And I asked him for the check (only because we didn't spot a waiter for like 15 minutes) twice to no avail. So annoyed that I just ended up walking up to the counter to pay. Should've stiffed them on their tip but whatever. Great, almost perfect pizza but dang their service and long lines prevents them from from getting so many stars.", "author": "Alison W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-19", "description": "The first time I went because it is so highly praised from everyone in the city.  I was less than impressed on my first visit because they definitely do not pride themselves on service.  Talk about being parched and unable to get a refill on my water.\n\nSecondly, when I received my pizza it was not piping hot, yet they pizza supposedly comes straight from the oven that you see as you enter.  \n\nMy second go around, I enjoyed my pizza much more because it was piping hot! The pizza is good, but I wouldn't say that it is \"omg amazing\" or anything.  I definitely will go again when friends are visiting from out of town.  \n\nThe ingredients are fresh, but I don't think I will wait in the long line that you often find unless a friend is dying to have it.  I will say that the long line does move very quickly which is a plus!", "author": "Erica C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-09", "description": "Stopped in here with my mom and my aunt after walking across the Brooklyn Bridge. I had heard about long lines, but the line was short was when got there and it moved fast, we were seated in less than 5 minutes. We were seated upstairs, the tables were tight together and it seemed like most of the people around us were European. \n\nService was friendly and efficient and in a short time we had a lovely Margarita pizza and some root beer to wash it down. Was it the best pizza ever? No. Was it really good pizza? Yes! I love me a good crust and this pizza had it. \n\nThe ambiance is what really makes the place here. Our entire meal came to under $30 dollars and was probably the steal of our vacation. \n\nI would definitely visit again.", "author": "Vanessa J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-13", "description": "Okay, so we've all heard how fantastic the pizza is here... Its story time kids!\n\nWe arrive around 1pm on a sunny Friday afternoon and wait in line for the obligatory one hour or so before ordering 5 large pizzas, probably enough to feed two decent-sized families.  Since it was the first time visiting this glorious place for a few of us, we got to sample an assortment of toppings, including the delicious margherita.\n\nWe decide to park ourselves on the benches with the panoramic views of the New York City skyline across the Hudson, and you just couldn't ask for a better day to do this.\n\nNow, laying out 5 large pizzas on a bench within viewing distance of the ginormous line outside of Grimaldi's is not exactly the ideal position to be in as the caretaker of those pizzas.  Yes, you can definitely see the hunger and anticipation in those eyes; its almost a little frightening.\n\nIt wasn't long before we were approached by a group of girls looking for a slice and my buddy (who was unanimously elected as pizza caretaker by the way - democracy is a beautiful thing) was then put in the position to figure out exactly how many slices and for how much we would be willing to give them up for.\n\nWhile he was busy making the necessary calculations, I was busy coming up with a real business plan of setting up a booth and doing this for real, reselling Grimaldi's, down the block, by the slice.\n\nIt probably wouldn't work, but good pizza and good times anyway!", "author": "Tony L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-26", "description": "The pizza is good. Of course it's good. \n\nThere's no way that masses of people would wait for hours on end, outside a place that is merely OK, just because of a great deal of hype...right? \n\nThat never happens in NYC.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-21", "description": "A pizza is bread and cheese.  \nMost people will like a pizza whoever makes it.\n\nGrimaldi's pizza is good. It has  special flavor to it.\nYou need to be in long line, it moves fast but still can be in a hour.\n\nWill one go again ? Sure. \nWill one go again soon? maybe not\n\nGood place to take visitors. And try it once in your life.", "author": "Amit K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-08", "description": "Awesome enough said", "author": "Anthony A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-30", "description": "To the Greek Chorus I add: eh. I mean, I think I know a good coal-fired pizza. I certainly know the different genus and species of kinds of pizza, and how to appreciate and understand each kind. I'm sure it's been said before but: sharing tables=awkward. Pizza=oddly bland. \n\nI don't get it! But the Brooklyn Heights Promenade a block away is delightful.", "author": "Melissa G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-19", "description": "Long wait, poor service, mediocre pizza. Waited 45 minutes to get in and another 45 to get our food. At no time did the waiters came to refill my wife's water. You get plastic plates, cups, and utensils. There are definitely better pizza to be had all over NY than here without the wait.  This is a tourist trap. I will not be back.", "author": "Chyi W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "This pizzeria has been standing under the Brooklyn bridge and serving NYC's \"must have\" pizza for years. Yes, the line was humongous. Yes, it was worth it. Yes, the dough was spectacular (and perhaps it was Brooklyn's \"water\" after all). But would I do it again? Not unless I was taking a friend for the first time. Or unless the weather was slightly more forgiving. We ordered: a large regular pizza with chicken, jalapeños, and mushrooms.", "author": "Shem H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "1st experience with a NY pizzeria \u0026 it did not disappoint. Pizza was excellent. Would have preferred more sauce but it was still good nonetheless. Pepperoni was flavorful and Italian sausage had the right amount of spice without the need to drink water. Highly recommend if in Brooklyn. However, they are cash only so be prepared.", "author": "Nick M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-26", "description": "You have less than 10 minutes to eat this pizza!\n\nI've often wondered why I start out loving Grimaldi's pizza but as time goes on, I am less than thrilled. I would speculate that this is so because the outlet vents of the air conditioning are located only a few feet over the seating area, and as air contacts the thin crust pizza (with minimal olive oil), it diminishes the enjoyment dramatically. (This explains why my family thought I had a brilliant career ahead of me in science, AND why I chose instead to become a banker :D)\n\nEvery tourist to NYC, and indeed his/her unborn child, knows about Grimaldi's for the line of waiting customers extends almost to Times Square. You can come in at any time of the day, and have to wait for half an hour to an hour. Now, I am not one of those who complain about the line, because barring the odd exception ALL great pizzerias in the city suffer from this inevitability. So, all you fine reviewers who trash it by giving it one star on account of wait time, what might the option be, instead? Famous Pizza or Pizza Palace or HooRays Pizza? Please, do go ahead and indulge your senses there.\n\nOnce you are inside, the wait staff will ensure that you get served within 10-15 minutes. Do NOT attempt to make small talk with the waiters. That's not how they rolled behind the Iron Curtain! There's only one consideration here: operational efficiency. \n\nThe pizza is excellent. The coal oven that prompted the Brooklyn location (prohibitions on any new coal oven in Manhattan) chars the thin crust well without burning it. The crust is chewy and smoky while the edges are slightly burnt. The mozzarella to sauce ratio is perhaps the best of all pizzerias in the city, though at times the sauce can be a bit much - with some friends finding it \"soupy\" on their visit. I do prefer the sweeter, herb infused sauce to the competition. However, the wilted basil leaves added little to the taste the few times I've been there. \n\nDo not bring an awkward date here, for the seating is such that you can hear all the conversations around you. In my recent trip, I was seated next to an extremely pompous arse with an even bigger attitude. My heart went out to his sweet natured girlfriend who has to hear the 'shite' continuously. \"I am very difficult to please, but, I like this place. I would change nothing about it. The décor may be shitty and the place may be a dump, but it works. I would change nothing. I am surprised I that I like it.\" He babbled on and on and on in a strong European accent. As I instinctively turned in his direction, the girlfriend looked apologetically at me. To spare her the embarrassment, I glanced over her head and pretended to look at the Frank Sinatra memorabilia on the wall. \n\nMy eyes stopped at a particularly poignant photograph of Ol' Blue Eyes: \"Divorce your loved one with dignity.\" http://www.flickr.com/photos/buhny/15110489/in/photostream/\n\nIs it just me or do you learn something new from Sinatra every single time?\n\nAmazing as Grimaldi's is, the lasting impression would have to be of the Brooklyn Bridge and the view of the Manhattan skyline across the river. Or, for chocoholics like me, Jacques Torres nearby. Wait, did I just hear Hot Chocolate?", "author": "Atif I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-16", "description": "I hate to be a harsh critic but I honestly do know see what all the hype is about. I expected greatness from Grimaldi's and it certainly under delivered. I've honestly had better frozen pizza. Different strokes for different folks I guess. Cash only. I do not recommend going during lunch time during touristy months because the line is out the door and around the corner.", "author": "Terance T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-30", "description": "There will be a line and you will wonder, \"Is it worth the wait?\"\n\nLast night, I hopped on an A train from West 4th and hopped off at High Street. I passed a lacrosse game in progress and watched cars exiting the Brooklyn Bridge. The heat was present but entirely manageable. I met up with a friend who guided me to Grimaldi's. As we queued for our pizza with a line that extended down the block we caught up on his first year of law school, my move from DC to New York and every exciting thing we'd read about food in the past month or so (this passed a lot of time.)\n\nThe grumpy fellow who makes sure you stay in line pulled us out at some point because we were taking our pizza with us. My soon to be 2L pal went inside to order and I waited out on the sidewalk. \n\nAfter queuing for 30 or so minutes and another half hour for the pizza, our number was called. By then I was reaching the end of my rope. Would this pizza be worth the wait? We took our white paper wrapped dinner down to Fulton Landing, which has a spectacular view of the Brooklyn Bridge and the Manhattan skyline. My mate poured us both a glass of wine from his backpack while I ripped open the package and dug out a slice. \n\nThe pizza, the wine, the view: perfect!\n\nYes, Grimaldi's is indeed worth the wait, but don't bother queuing for a table inside. Get your pie to go and take it down to Fulton Landing to eat. \n\nThis experience will stir up an immeasurable amount of local love in your heart. For despite its difficult, surly ways, New York is one of the most spectacular cities on the planet. Pizza at Grimaldi's will remind you of that in a wonderfully sensory way.", "author": "Miriam W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-18", "description": "Delicious pizza, though not the best ever. Worth the wait? Perhaps not.  \n\nThe waiter was a bit short with us while ordering, and rarely stopped by to refill water or grab another beverage.", "author": "Clint S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-22", "description": "You can learn a lot about how to make a great pizza while standing in line for the restroom at Grimaldi's. \n\nThe first thing you'll notice is the enormous brick, coal-fired oven. The oven door opens every 30 seconds or so, revealing a huge pile of fiery coals off to the side and the pizza in the back. The temperatures are so hot in this oven that it only takes a few minutes to cook the pizza (reflect on that next time your pie takes 20 minutes or more at most pizza joints).\n\nAs you watch the employees assemble the pies, you might be struck by the fact that the pizzas aren't overloaded with sauce or toppings (a la Round Table). They simply tear off pieces of mozzarella and place them around the pizza, sometimes as much as an inch a part. They do the same with the pepperoni, sausage or other choice toppings and then they simply drizzle (yes..that's drizzle, not pour) the tomato sauce on top of the top of the pie and then finish it with a drizzle of olive oil. \n\nThe pie make look sparse as it goes in the oven, but I think the oven's intense heat breaks everything down quickly, and the cheese, sauce and oil meld together while the pizza cooks. When you get the the finished pizza, there's good sauce and cheese and topping coverage throughout the pie.\n\nWe ordered a large pepperoni and sausage pie (our control when we order pizza) and it was great. The thin crust had a nice crispy char on the bottom toward the outside of the pizza, but was a little softer in the middle, which was nice, and it had a good \"bite\" to it. I liked the bits of sausage a lot and the pepperoni was the smaller, quarter-sized slices that I prefer. But I think the best component of the pie is the sauce. It had a really nice tang to it that went nicely with the cheese and toppings.\n\nWe got there fairly early (before noon), so the line wasn't very long and waited about 10 minutes. Once you sit down and order, the pizzas arrive really quickly. The large pie (18-inch) was the perfect size for splitting with three people, and we took a stroll back to Manhattan on the Brooklyn Bridge to walk off the meal.", "author": "Arnold G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-17", "description": "Great pizza!!!\nworth waiting.\nBut I would not stay there, service not as good as pizza.", "author": "Katie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-11", "description": "We trekked over the Brooklyn Bridge to finally eat at Grimaldi's. Sure we got lost and it took us an extra 15 minutes to find the place, but upon arriving 30 minutes after opening, we were surprised that there was no wait. WOO!! \n\n$14.00 for a small\n$16.00 for a large\nTo me, they looked the same size, go for the small and save the $2 for more toppings. Each additional topping is $2.00.\n\nOur sausage, pepperoni, mushroom coal baked oven pizza turned out to be quite delicious! The crust had a good chew to it, the mozzarella on it was fresh, and the toppings definitely hit the spot. I was surprised our pizza came out in less than 10 minutes. I guess they had everything prepared and the coal oven was heated enough to bake the pizza at supersonic speeds! Go Grimaldi's. \n\nI'm taking off a star for a toilet that doesn't flush, somewhat rude servers, and a restaurant that smells mildly of toilet. Hehe. All in all, Grimaldi's serves up a pretty mean coal baked oven pizza (a kind of pizza that I've never had before).\n\nWe walked out about 40 minutes later only to find a line that stretched half way down the block. HAHA SUCKERS. \n\nHelpful hints:\n1) Get there before noon to avoid the long lines\n2) Walk the Brooklyn Bridge to stirr up an appetite\n3) Bring cash b/c it's CASH ONLY.", "author": "Heidi C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}