{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "Pizza is light, crispy, and tasty. Try to come at odd hours such as 2:30 or 4:30 when nobody is there. We did this and didn't have to wait for a table. As we were leaving, we saw at least 15 people waiting outside (it was close to 6pm). Service is so-so. The tables were relatively dirty, our waiter kept forgetting to refill our water glasses, and the A/C didn't seem to be working because it was scorching hot in there. Not pleasant when it's already muggy and humid outside.\n\nI would definitely return if I was in the neighborhood, but this pizza isn't good enough that I would wait in line for any more than 10 minutes. Skip and go to Juliana's next door if the lines here are long - the pizza at Juliana's is just as good if not better.", "author": "Nina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-12", "description": "This is some pretty good pizza. The ingredients can't get any fresher. The only complaint I have with this place is the excessive wait. I believe our group had to wait in line for close to 2 hours for this pizza. The place is very small. It's also a huge attraction for tourists just like Lombardi's so be prepared. I want to say it is also cash only but I'm not certain. In any case, if you like neopolitan style pizza, you can't really go wrong with this place or Lombardi's.\n\nP.S. Another small gripe I remember having with this place was that the pizza crust was somewhat burnt. Some people like that I guess?", "author": "Peter K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-29", "description": "Again, be prepared to wait for great pizza with fresh ingredients. Once you have a coal fired pizza you will understand the difference.", "author": "Leonard W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-09", "description": "Major tourist trap.  Juliana's next door is the winner and authentic. \n\nDon't be fooled.  All the locals know the real pizza story/history is at 19 Old Fulton St, - - -  JULIANAS. \n\n*** You can see Patsy Grimaldi himself seating people at night next door @ Juliana's!!  ***\n\nPizza here is subpar,  service is down right rude and they need to take a class on basic human mannerisms.  Grimaldi's thinks they have a clientele due to the naive tourism,  but truth will spread quickly. \n\n\nDon't waste your time here.  Go next door.", "author": "Leila G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-29", "description": "The plan for the day was to walk the Brooklyn Bridge. So all of my friends that have been before suggested to walk from the Brooklyn side back to the city because the view would be better. Thank goodness we did because we decided to eat at this pizza spot first. \n\nWe arrived around 11 am and a line had already formed to eat this famous pizza, but the line moved pretty quickly and our party of nine didn't have to wait longer than 20 minutes. The cool thing is that this restaurant has two floors for seating. \n\nThe pizzas were a good size, we ordered three large pies. 1) The classic Margherita 2) White pizza (no tomato sauce) with garlic and mushrooms 3) Tomato sauce based pizza with Italian sausage, pepperoni, and olives\n\nAll pizzas were good, with a thin crust and not too soggy. My personal favorite was the white pizza. So simple yet very flavorful! I wouldn't say this is the best pizza I have ever had but it's definitely something you should try because it's part of NYC history.\n\nExpect your experience to be quick, we ordered the pizzas and were in and out in less than an hour. You'd have to expect a quick dining experience especially if a line is waiting outside.\n\nI would definitely plan to do the same thing when coming back to NYC. Eat at Grimaldi's, walk through Dumbo, then walk the Brooklyn bridge from the Brooklyn side back to the city.\n\nRestrooms: Separate restrooms for men and women.", "author": "Aimee R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-23", "description": "Great pizza and probably worth the wait. Not thrilled that they don't give you water and use disposable plates and utensils. Pro tip, the cannoli is excellent. Just the right level of creamy and sweet.", "author": "Daniel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-14", "description": "Expect to wait on line for about 30 - 45 minutes AT LEAST.  \n\nPizza made to order, fresh, the hype is confirmed, one of the best slices you can from the 5 boros.\n\nWhatever toppings you like, they cant really mess up.  As long as the pizza is cooked, thin and layered with sauce and cheese, it's good no matter what toppings you put on it.  But personal fav is the sausages, peppers and mushrooms.\n\nIf you're going to order to go, they put the pizza on a sheet of cardboard, inside a big paper bag.  They don't provide the generic Pizza boxes, so becareful when you're delivering and on the go.   At least this is sorta going green..using less cardboard.  But this in no way affect the taste of the pizza of course.\n\nBrooklyn promenade and park is near, so order out and enjoy the weather if it's nice.  If you're sitting at the tables..you're wait is going to be much longer.", "author": "Steven L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "When in the mood for really good pizza this is a top choice.  There are lots of good pizza places around but Grimaldi's is in the best of best.  came during a hectic time of the year but it was worth it as always.", "author": "Vic G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-20", "description": "Waiting in long line for mediocre pizza? Grimaldi's must be one of the most over-rated things in NYC. I'm a DUMBO resident who laughs every time I see tourists queuing up.", "author": "Bridget R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-06", "description": "I pass this place all the time when I'm by the Brooklyn bridge pier and there's always a line outside but honestly I don't know why. The food is okay, nothing special. The pepperoni pizza I had was good but quite salty. They charge you for every single topping. The thing that bothered me was all the utensils had lots of wear and tear which makes it look unsanitary. Also they only take cash which is the blow. Other than that it was okay but I  think this place is hyped up way too much.", "author": "Abigail R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-09", "description": "My favorite pizza place! This place is cash only \u0026 they don't sell pizza by the slice. Even a small pie of pizza is probably too big for one person to finish. This is the only pizza place that makes me want to eat more than 2 slices (i have eaten 5 slices of a large pie here!) I've heard of there being ridiculous lines but the past few timea I've been here, I had almost no wait. The longest I've had to wait was probably 15-20 minutes for a group of 6. Even if this place is not the best, its worth a try!", "author": "Emily S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-11", "description": "The thin crust pizza was good but the place is overhyped. I rated this place 3 stars as I think the service can be better. We were a large group with one small child. We were told to leave our stroller outside and after walking in we saw that another patron was allowed to bring theirs in. While waiting outside all patrons were rudely asked to wait in a straight line.Had it not been for few in our group who were dying to eat the pizza, I would have headed over next door to Juliannas.", "author": "E G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-31", "description": "Stay away! My family friends took me here for some good NYC pizza. I noticed that they received a \"B\" rating, which should have told me to leave right away. We walked in and were seated at a table within 5 minutes. I noticed that the air conditioner was not working, and it was less than pleasant being in the hot restaurant on a summer evening. Our waiter was rude and it was obvious that he could care less about serving us. The pizza was good, which is the only reason I would give this place two stars. Our waiter never came by once after we ordered to check on us, see if we needed anything or refill our drinks. It took over 20 minutes to find someone once we were done eating to get the checks, and when I asked for more water they never brought me any. Also if your restaurant is going to be cash only, which is ridiculous in today's world, then you need to advertise that when your customers walk in. If you want real NYC pizza definitely go elsewhere--like Manhattan. If you enjoy horrible service, no air conditioning, no refills and having to pay in cash when not told, then this is the place for you! I would stay far away from this so called good restaurant.", "author": "Stefen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-13", "description": "I came here for the pizza only. The service is the worst....the workers are rude and really don't give a shit....but I still love the pizza. Not much to say. I wish the workers actually try to give good service instead of being such douches.", "author": "Janille R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-18", "description": "It's good.  I don't know, it's just not the holy great some people say it is.  So, yes, go if you're near, but I came as almost like a pilgrimage, based on some opinions, and for me it wasn't all that.  It didn't all come together into perfection.  But good ingredients I think, which matters.", "author": "Ben L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-29", "description": "I wound up here after walking over the BK Bridge.  My friend suggested I stop by.  Luckily I came 15 minutes before it was to open (11:45am on the Saturday of Memorial Day Weekend).  The best time to come is at least a half hour before it opens to avoid the longest lines.  When I arrived I couldn't believe there was a line for a pizza shop!  As I was waiting I went onto Yelp on my phone to take a look at the reviews to see if it warranted my waiting on line, lol.  Everything looked good so I stayed on line and it \"only\" took an hour to be seated which is great considering the wait times I have heard.\n\nIt's a nice sized place.  I guess the line IS warranted considering all the people they have to shuttle in and out (and they don't rush you which is nice).  My server was nice, cute and attentive considering all the tables he had.  They only take cash and they don't serve individual slices so I wound up leaving with the rest of my 4 out of 6 slice (small) pie to take home.  By the way, even if you want take out, you STILL have to wait on that line.  \n\nThe pizza was good and reminded me of the pizza I had as a child at local pizza shops (before I got into Dominoes and Papa Johns!)  My favorite part was the mozzarella!  It was gooey-fantasticness!  (And the pizza tastes great the next day - 4 out of 5 stars for the line).  But this all was a one time deal for me.  I don't do lines like that.  I'm not the one you'll see on a city street camped out waiting to see a celebrity perform!  Next time I want Grimaldi's I will surely be going to the one in LI or Chelsea.", "author": "Jenteel P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-20", "description": "Had a great time walking over Brooklyn bridge. That all stopped when my family \u0026 I entered Grimaldi's after hour wait. Flies every where, no AC .  Wanted a cold beer after long walk, NO LIQUOR LICENSE. (I GUESS THEIR AIR CONDITIONER LICENSE IS STILL PENDING AS WELL). Didn't surprise me, from the type of service received, I'm sure owner has a criminal record.\n  Only saw waiter once, had to ask him to bring us water with ice, first ones had no ice, (straight from the Hudson River I'm sure), Horrible water. Waiter took order for table next to us. Instead of saying pardon me, he hovered over me, touching my head. Had to ask him to give me space. He didn't like that one bit, even though I was polite about it. Absolutely the worst service I have ever received In New York (Just unheard of).\n  \n   Pizza finally came out after 45 minute wait. Regardless of the horrible service, this food was not worth the wait or horrible service. Pizza crust was black \u0026 burnt, middle of pizza was soggy \u0026 watery. Only flavor or character this pizza had was from the STORE BOUGHT SUN DRIED TOMATOES. Next time I'll take my family next door to eat after Awesome walk, crossing the Brooklyn Bridge.\n  Regardless of the most horrific service I have ever received from any city ( that's including Me living in Chicago \u0026 Hollywood CA where restaurant owners know how to treat patrons), Veloce pizza on the east side makes Grimaldi's look like Domino's pizza (which I would say Dominos has better customer service than Grimaldi's). \n  I would not recommend this place. After walking over Brooklyn Bridge, I would suggest eating next door to Grimaldi's rather than subject you \u0026 your family to this low class service that Grimaldi's gives you.", "author": "Frank C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "Really good thin crust pizza, like some of the best Ive had, and a good place to rest tired feet after a long walk. Was kind of disappointed by the lack of air conditioning on such a hot humid summer's day-and the flies which worried me a bit. Nevertheless, the food was great and will definitely return. Ive read that there is usually a long line, but we were seated immediately, maybe because of the broken ac.", "author": "Joel D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-05", "description": "Been here twice and do not plan on coming back! Unless someone drags me and pays for my meal... \n\nJust like many, I do not understand why there are always such long lines. For what?! Nothing special about the pizza. Especially when you have to wait 30 minutes after being seated for a small pie.", "author": "Crystal C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-14", "description": "Uncomfortable atmosphere.  Immediately upon walking in, an aggressive host/manager/owner, not really sure...he was lounging at the non-alcoholic bar, just pointed at two chairs at a table, 'or just sit at the bar'.  We chose the bar.  Apparently, they do not have a liquor license, not a huge deal.  They use the bar area to store clothing, helmet's, stuff that could be stored elsewhere.  Not a big menu, which I don't mind...i like to keep it simple.  We chose to eat here because we love going to Patsy's and Juliana's, and thought it would be a disservice to avoid Grimaldi's.  The pizza did not taste good.  Bottom line.  It could possibly have been a mistake pizza, but when you add the aggressive workers, the lack of a bar, the clutter thrown around behind the bar, and bad pizza....I would not recommend this place to anyone I know.  If you do go....remember, cash only.", "author": "Jimmy W."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}