{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "The pizza is just amazing!!!\nThin and crisp that you won't find anywhere else.\nHighly recommend for place to hang out. Cash only", "author": "Widjaja P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-31", "description": "The pizza is good, in my opinion not worth the 1 hour wait in line. \n\nI say walk the bridge, go get pizza, do it at least once in life and you can say you got the experience. \n\nThe staff wasn't the nicest, we were very rushed and felt like we couldn't really enjoy our food. \n\nGood pizza but eh wouldn't come here again.", "author": "Rebeca V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "Terrible!!! No sauce, no flavor, poor service, plastic cutlery, added gratuity, hour wait. Definitely did not live up to the hype. After eating here I felt hustled. This place sucks. Save your money and your dignity, go eat better pizza elsewhere and be treated like a human being. Try Prince street pizza instead..... 10x better!!!!", "author": "Thomas B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-06", "description": "Yes there was a line but it was so worth the wait !!! The pizza came quickly and the service was great", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "This was the prefect place to wrap up our weekend in New York. We decided to make our way across the Brooklyn bridge and we're hungry for something good. We were originally going to check out Juliana's, but the wait was ridiculous. We walked right into Grimaldi's and we're seated immediately. The pizza here is so delicious! From the crust, to the cheese, just sheer perfection. The service was also great too. It is is cash only but I think saw an atm in the restaurant.", "author": "Michelle F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-27", "description": "Wait : 1.5 hours for Tuesday night at 6:30 pm. It's better to go with a big group coz the waiting time will be significantly shorter \nCash only!!!! They have ATM inside \nService : So so, you have to grab them otherwise, they will ignore you \nFood : delicious pizza, crispy side. I love the tomato. Black olive is a little salty side \nOverall : should try for an experience but won't come back again. It's not worth the wait.", "author": "Yu H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-02", "description": "I'm not a pizza person but I loved their pizza and the cannoli was huge! I wish they would accept cards as a method of payment. It's cash only.", "author": "Shaowni M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-16", "description": "CASH ONLY\n\nFirst time at the Original Grimaldi's \n\nCame here for dinner on a Wednesday night. Was assuming there would be a long line after readings reviews but for some reason there was none. We were seated quickly and it was moderately busy.\n\nPizza:\nOrdered a LARGE : about 8 slices (shared between 3 people)\ntoppings: pepperoni and mushrooms\n\nPizza came out within 10mins (pretty quick). Presentation was very scrumptious. Lots of pepperoni and mushrooms on the pizza. Notice there was a couple basil leaves on the pizza. Crust was perfect.  \n\nQuality was very good. The melted mozzarella(high quality) cheese was perfect. Each bite had pepperoni and mushroom. My pet-peeve was I had to fold the pizza up since the toppings and cheese would slide off and the dough was kind soggy under the sauce/ cheese/ toppings. I think if left in a few more minutes it would have been perfect. \n\nLarge pizza was perfect for 3 people got about 2 big slices each and had to take the other 2 home.\n\nService:\nFriendly. Quick. Good.\n\nOverall:\nWould like to give 5 stars but cash only and kinda soggy under the sauce/ cheese/ topping hard to eat with hands. Other than that still a good pie.", "author": "Samuel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-20", "description": "It has been about 8 years since I went to Grimaldi's and it is still delicious. \n\nWe got a sausage and mushroom pizza and it did not disappoint. \n\nMy wife and I walked across the Brooklyn Bridge and as a treat we treated ourselves to some amazing pizza. \n\nCooked to perfection in the OG brick coal oven.", "author": "Brian A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-18", "description": "Great pizza fast and typical New York.  \n\nTook a bunch of us here for a quick dinner after shooting the cityscape.  The owner was very gracious and got us a seat together. We were large party of eight. \n\nAgain the pizza was really good... The waiter was absolutely nonexistent didn't care and had to be called to our table 3 times.\n\nHe handed me a scratched piece of paper for the bill and I asked him to explain it to me and he got upset.  \n\nThank God the pizza was really good!!", "author": "O W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "The pizza prices were really reasonable and for $2 more ($18) you can get a large pizza. Pizza itself was delicious, I got the anchovies, pepperoni, onion and chicken as toppings on 2 separate pies. Unless you really like seafood and you like your food to be really salty, I would not recommend the anchovies - it was a too salty. Other than that, the other pizza toppings tasted really good.   \n\n\nAlso they have outlets to charge your phone for those who find yourself with phones that are low in battery.", "author": "Andy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-27", "description": "Awesome pizza! I love the location and the venue. The staff was friendly and the pizza blew me away. I love NY pizza.", "author": "Brittany A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-13", "description": "No slices. And no humor.\nWas alone, and wanted only 2 slices for myself. Said he can't do it (but said it rudely). Anyway, I went somewhere else, but the attitude was problematic.", "author": "Yoni B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-07", "description": "Came to NY to visit, kept hearing this was the best pizza spot and yes they were right !!!! And great customer service!!! Very friendly and attentive! Only reason I'm giving 4 stars is because they don't sell beer", "author": "Matt C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-16", "description": "Being a New Yorker, I'm sadden Saturday was my first time here ! Where has this place been all my life?! My family and I enjoyed every bite ! The wait was well worth it and sitting upstairs is cooler than downstairs. But we didn't care, I love the home feel and old school look this place has. We will be back !", "author": "Betty S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-08", "description": "We came here two days ago and loved the pizza. The wait was well worth it. Then yesterday, we decided we just couldn't leave NYC without one more pizza. And this is what we found.  so, if you are heading here this week, you may be disappointed.", "author": "Hannah S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "Healthier than your typical American styled pizza so I can eat a lot more without feeling as full. Price is about standard, but it's very touristy so I would recommend buying a pie for take out and sit by the water, plus you don't have to tip if you take out. I think if you are from out of town, definitely try this but obviously it won't be as good as pizza from italy.", "author": "Jenn Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-19", "description": "I seen lines heading out the door down the block sometimes. Decided to give this COAL FIRED PIZZA a try. This place uses: great quality ingredients, cooks perfectly, taste awesome, and it's fresh out the brick coal oven to your table. The pizza is a thin crust but made awesome. I gave this place four stars just short of 5 stars because the plastic forks and knives don't cut through the pizza and the tables and chairs are wobbling. You literally have to eat while doing a balancing act. Smh ...", "author": "Eusebio A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-06", "description": "Came over because I was in the neighborhood walking the bridge ... forgot how shitty the service is. Once again people buying an already successful concept and taking it for granted that people will return ... I should have gone to Ignacio's around the corner. \n\nI do have to say that the pizza is dam good and the staff is nice they just don't get it though. Waiters who have clearly never been a waiter before and an incredible space and concept that isn't being shown the proper love. \n\nThey have an opportunity for repeat business besides tourists and it must fall by the wayside at some point when the cold comes and the tourists leave", "author": "Leandra J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-13", "description": "I like the pizza and the service here. Placed a phone order for sausage and mushroom. Late Pizza was $23. Super affordable. And it was ready within 10 minutes. But compared to Lombardi's the taste of Lombardi's is just better to me. Grimaldi's is good and for price; definite value. I do love how their crust is thin, flaky, and airy. Nice crunch when you bite down on it. Ingredients are fresh too. Overall I'd grade them B+ on food.", "author": "Alex D."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}