{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-22", "description": "Exactly what you'd expect- good solid NY style pizza. My group of 5 was able to eat off one large pizza even though it says that only feeds 4.\nPortions are huge, and they only take cash. Be prepared to wait a few minutes outside if there's a wait- there's little to no wait space indoors.", "author": "Sarah T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-06", "description": "I don't really understand the hype of this place.  I went here on Saturday around 6pm, just before the lines got super crazy.\n\nThe pizza (3/5):  My friend and I ordered a large pie with sun-dried tomatoes and Italian sausage.  I don't like a lot of sauce on my pizza, but the sauce on this pizza was not only lacking, it didn't have much flavor.  Thank goodness we got it with the sun-dried tomatoes because they really made up for the lack of flavor.  The pizza felt like it was a lot of crust though (not always a bad thing if the toppings make up for it...which in this case it didn't.)  On the other hand, everything did seem very fresh.  Fresh ingredients and nicely crisped crust.  Just wish it went all the way to flavor town.\n\nIn terms of prices, it's not horrible, but drinks are $3 (really? A bottle of soda or Snapple is $3?)  Pizzas are about $12, toppings are $2-$3 each (doesn't matter if it's half or whole pizza.  Still the same price).  They only have one appetizer which is the antipasto ($12), which I didn't want to try.  Everything but the pizza seemed like a rip-off so stick with just the pizza, imo. \n\n\nService + Ambiance (1/5):  First of all, they don't change the table cloth on the tables.  I noticed busboys just flicking off a few crumbs with the menu before seating another group of people.  Everything felt DIRTY.  You could see stains and feel leftover crumbs on the table cloth (obviously because they don't change them).  It made me wonder when the last time they cleaned the tables was.  \n\nOur waiter was a jerk.  When we asked for refills of water, he brought over a pitcher and from a height (taller than my seated self), he poured the water into the cups.  Not only did he splash it on the table, my napkin and utensils, he did it to my friend as well.  My friend asked if he could pour the water closer to the cup to which he replied, \"Why?\"  My friend said that he didn't want it splashing over the place to which the waiter replied jokingly, \"Sorry, no can do.\" and continued to pour from a height.\n\n\nWait time (1/5):  I was lucky that it was just me and my friend, but if you're in a group of 3, good luck.  I saw the guy in the front asking for a group of four many times and passing by groups of three.  If you have a group larger than 4...you might as well go somewhere else.  Saw a group of 6 waiting at the front of line when I got on it (all the way in the back) and still waiting by the time my friend and I got in (an hour later).\n\n\nOverall: If you're in town and you want a good slice of pizza, this is certainly not the place.  You would think that this was some upscale place with the reviews and the long wait line, but it's not.  You can find plenty of other pizza places serving up better tasting NY pizza with less headache.  Would I come back?  No.  Not worth it.", "author": "Gloria L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-16", "description": "This place is good and friendly and down home.\n\nMy suggestion is to hit up the ATM and come when it just opens.  We did that and did not have to wait for a table for 6, but as soon as we finished, there was a line around the corner.\n\nWe made our own pizza, one with white sauce, one with red and they were both GREAT.\n\nAmazing ingredients and friendly service!", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-07", "description": "Bomb pizza.  Definitely worth the wait!  Got small white cheese pizza and shared it with my hubby.  I should have added fresh mozzarella but didn't; though it was still good.  The small one is definitely good enough for 2 people.", "author": "Meghann P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-16", "description": "Hubs and I came here back in May on our NY trip. Hailed a cab and he dropped us off at 2PM only to be faced with a 1.5 hour wait before we got seated. The pizza was delicious! Perfectly crusty and chewy. The cheese was amazing and the tomato sauce added the perfect amount of tang. \n\nI dreamed of Grimaldi's... I took my familiy to the franchised location in Vegas over the summer. It came close... but didn't compare but my mother loved it. A few months go by, and she's still raving about the Vegas location so I suggested that we fly to NYC so she can eat at the original location. A redeye flight and a subway ride, we found ourselves here. Ordered a small; half white, half red. Delicious!! The white side seemed a tad bit greasier since it had a lot more cheese on it. Both were amazing but I think I'm still a purist in wanting the red pizza with no additional toppings. MMMMmmmm....", "author": "Vicky L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-01", "description": "Not that I intend to create a dent on the 3000+ reviews, but as it turns out with many famed places, it's just the brand name that makes a place popular. We had a half-half white and regular pizzas which were good, nothing to rave about. We had to wait in a queue at around 9-10 pm on a Saturday, but it moved at a decent pace and didn't see one when we were done. It took some time to place our order, and the place doesn't offer liquor which was a bit of a downer for us.", "author": "Sid W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-30", "description": "This was our second time here.  We are from California and have yet to find a pizza as good as Grimaldis. If you looking for thin crust pizza with fresh ingredients...this is the place.  Don't let the line outside the door scare you away.. They seat you quickly and well worth the wait. You won't be disappointed.", "author": "E V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-22", "description": "*3.5 STARS*\nLong weekend in Toronto, fellow Yelper, Jason C., and I ended up here on the Saturday. We expected a long line-up, but c'mon! We were waiting there almost an hour in the cold. We found out later that it was because they were changing the coal. Fine, but c'monnnn. We're freezing!\n\nI get in, and we were quickly seated with this couple. I looked around, and it seemed like there were MANY seats unfilled yet (and still unfilled near the end), which made me REALLY suspicious. Like... REALLY REALLY suspicious. Rumour has it that they make people wait outside for a while to build up the hype. But c'mon, we already know that they have crazy hype, don't make us wait outside for so long. :(\n\nThe food, was good - no complaints there. The pizza was really good, but I wonder if the cold wait was really worth it.", "author": "Joanne W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-30", "description": "white pizza was soooo good! the bouncer at the door is a bit gruff but reasonable after you find some courage to talk to him. we called ahead, managed to get a live person on the phone and put in an advance order for pick up to skip the line. classic new york style pizza for the win!", "author": "RT N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-09", "description": "The pie is definitely fresh, I wont argue about that. Nothing special about the taste though... But once we're seated, all I see are dirty splotches all over the tablecloth along with crumbs and flies flying everywhere. At least the waiter was very nice.", "author": "Hana K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-05", "description": "No slices! No reservations! No delivery! No credit card! No Joke... that's what's written on their menu!! (On the bottom)\n\nFood: Yum! It's more of a chewy thin crust pizza, and it was delicious! If you decide to do half side of toppings you're charged a full price $2-$3 depending on your topping choice. I was disappointed that the toppings on the pizza are limited. We had a mushroom and sausage pizza and I had half a mushroom on one slice... hmm... If you want toppings better ask for extra! \n\nDécor: A two story restaurant... that on a warm Spring day... can be kinda warm and stuffy... but it was a nice rustic building with red and white checkered table cloths. \n\nService: Super disappointed... I've never been to a restaurant where if the line was long... and you want to order to go... you have to stand in line... when I asked the owner/ manager \"don't you take orders over the phone?\" His response was \"good luck getting through\". Uh... ok...? Otherwise the wait staff were chill and helpful. \n\nCost: The pie was about $16 (marina pie) and $18 (white sauce pie) and just add the price of $2-$3 for toppings.\n\nOverall: If the pizza was tasty... I would probably not wait an hour or more for it. It would be ideal to order it over the phone... if the owner or manager weren't rude... If you have time on your hands... this would be a great place to go... otherwise... I don't see myself returning anytime soon. There are so many delicious pizza places in the City that appreciate your patronage.", "author": "Sarah Kouoon Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-18", "description": "After walking across the Brooklyn Bridge during a hot summer day and then trekking to Grimaldi's, I was mind-blown to see a line already formed at 11:30AM, which is opening time.  Taking it in, I patiently waited for a seat.  Service was fast and pretty darn good. Waiters were dancing to the old 70's songs in front of the manager.  Cute.\n\nNear the front door, I watched my pizza pie's birth as a guy generously put on all the toppings I ordered.  Within 10 minutes, that pie is on my table.  In another 3 minutes, that pie is in my stomach.  \n\nThe inevitable comparison to Lombardi's or any other famous pizzeria has to be made now.  I truly enjoyed Grimald's better.  Lombardi's toppings fell right off the pizza before it could enter my mouth. The crust was not chewy.  My experience at Grimald's far trumps Lombardi's.\n\nHighly recommended for any tourist that wants to spend an hour crossing the Brooklyn Bridge and enjoy a famous pizza pie. Cash Only.", "author": "Frank S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-06", "description": "Loved the neighborhood.  Went on a Wednesday evening and had no wait at all.  We were seated upstairs and it was a little warm up there.  Their pops are served in bottles and I think were three bucks.  We had five people (two teen boys in this group) and we devoured two large pizzas.  We got one large pepperoni and one large white pizza.  We used the garlic salt to give the white pizza a little more flavor.  It could have used a little more garlic in my opinion.  Loved the place...would go again.  Nice area to go down and check out the bridge and the water with a view of the statue of liberty.  Had some interesting desserts, but we didn't try them.  They don't have extras such as salads and breadsticks that I seen.", "author": "Maggie S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-24", "description": "So this got voted best pizza in NYC  NOT! The best pizza and I'm a pizza lover... Goes to Nicks Pizza in Forest Hills  \n\nThis place left me a little disappointed. All the rave and no party in my mouth. Slice is thin ( that I like ) but wimpy and sauce is just OK  cheeses was nothing to brag about\n\nWould I go back, yes if I'm hungry and want to wait on a long line. Next time I try the pizza place next door lol", "author": "Darlene R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-02", "description": "Great pizza! I am craving it again a week later haha. \n\nWe went on a Friday night around 7:30. It wasn't too busy, but it started getting busier around 8:00. I don't think you can make reservations, so prepare to wait if you go later in the night or if you are a bigger party.\n\nCASH ONLY!", "author": "Cyn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "Best bang for your buck when it comes to highest quality ingredients for pizza. Definitely worth the trip to DUMBO. Sooo goood.", "author": "Kenny Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-02", "description": "One of the best !  The line was about 30 mins long when we went but it's totally worth it.  TIPS : go to the Brooklyn ice cream factory after pizza :)", "author": "Ms J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-06", "description": "Not sure what there is to say.  This was the best of the 2 pizza places I ate while in NYC.  the other was Lombardi's which was good but Grimaldi's was less expensive for us and better.\n\nNot sure what to say.  This is a great Pie, but if you have to wait an hour then maybe go somewhere with less of a wait.  It was really good and I wouldn't hesitate to go there again.", "author": "Geoff T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-19", "description": "So Hubbs and I decided to finally wait on line and see what the hype was about. Line wasn't long, the waiters were very nice. It was a little hot on the second floor which was the area that we got our table. But once you sit down and drink some cold beverage, your fine. It was four of us so we ordered a large pie, half plain and half with sausage \u0026 onions. Pizza looks amazing, but it lacked taste. They don't put that much sauce on the pizza, but they do put big pieces of mozzarella. The sauce it self was not a big hit, it didn't have a lot of flavor or lacked flavor. The mozzarella didn't taste that great either. I can say now I been there done that with Grimaldi's. I doubt we will come back again. I did give it 3 stars for the service and how the pizza looked. Lol", "author": "Maria M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-19", "description": "Great atmosphere! Feels like a movie set. We did carryout and they had it in 20 minutes. Five toppings was a really rich way to add to the saucy cheese thin crust pizza. Loved the addition of the large jalapeño slices!\nVery good pizza with good service....would have to try the other dishes for better rating.\nHighly recommended for pizza.", "author": "paul h."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}