{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-31", "description": "Waited for over an hour for our food. I understand that the restaurant is popular, but if you can seat this many people you should be able to feed them in a reasonable amount of time.\n\nLiterally I typed that ^ as I was waiting but then when I got my food I had to change it. Best pizza I have had aside from pizza in Naples, Italy. Outstanding!", "author": "Dallin R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-18", "description": "Came here during odd hours (2:30pm) and glad I went late. There was NOOO line. FYI, if you come in a group, make sure your whole group is there, or else they will not seat you. \n\nI came here because everyone claims this pizzeria is great! But my experience definitely did not reach my hype.", "author": "Y. H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-27", "description": "My favorite place for a round pie. Delicious crust and sauce, nice restaurant setting that is reminiscent of Sunday dinners with the family as everyone chats about their week while going to town on a few slices. You won't be disappointed with this authentic Brooklyn pizza experience.", "author": "James S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-03", "description": "Finally, i took the pilgrimage to Grimaldi's after many tries. The line was expected so i didn't fault them for it. Plus taking a trip down to the dock and getting ice cream made the wait seem shorter. And once we finally reached the entrance, the hostess was extremely nice and apologized many, many times for the inconvenience. \n\nFor new york coal pizza, i always compare it to my favorite, Lombardi's. And no doubt, it is up to par with the fresh mozzarella and basil. The peperoni was good but unlike Lombardi's, the experience was forgettable. The place was dirty and our table was not wiped down from the previous patrons. The prices were extremely fair ($6 less than Lombardis) but the menu only contains pizza or antipasto, nothing else food wise. The pizza came out within 5 minutes but half the slices' crust came out burnt. The unburnt slices were great and were not greasy. Some members of our party had committed blasphemy and stated that they liked Grimald's better than Lombardis. I respect their opinion and could see why they would, but Lombardis adds so much to the experience including salad on their menu. \n\nGrimaldi's is a place to definitely try because you might think this is your favorite pizzeria in NYC, and i hate when people say Grimald's is hands down the best pizza or Johns or Lombardi's or Joe's because they are all great and comparable to one another, there is no clear favorite, just a slight preference. My recommendation to grimaldis is to increase the price of the pizza by a dollar and save that money to renovate and buy the unnecessary store next to you to expand", "author": "Matt M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-07", "description": "Everyone loved Grimaldi's. If you search for the \"best pizza in NYC,\" this place is bound to come up. I've had their margherita pizza and it's delicious. Not too greasy, filling, the sauce is perfect. It gets packed so I usually call and order ahead of time and then pick it up and go eat under the bridge in DUMBO. The only reason why I give it 4 stars is because I wouldn't call this the quintessential New York pizza. If you want that then go get a $1-$2 greasy delicious slice! That being said this pizza is very good and the location is great if you're exploring New York. I recommend going to the Brooklyn Ice Cream Factory afterwards.", "author": "Alejandra F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-21", "description": "Server served party that arrived AFTER us before us. (Take ONE star for that technical foul) \n\nWas greeted by a very kind man who coerced us onto the second level of the pizzeria.\n\nThe smell upon arrival is INTOXICATING, in a good way of course.\n\nFresh pizza, crust/dough is deliciously charred; thin but just enough to hold up to the toppings.\n\nPizza sauce wasn't that good... I expected delicious slowly simmered and perfectly seasoned sauce but instead got freshly crushed tomatoes... Not much substance.\n\nDoesn't live up to its expectations based on Yelp reviews.\n\nHunt for \"authentic\" NY pizza continues...", "author": "Marley D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-27", "description": "Why am I waiting here on this long line? Feet hurt, getting dark and cold out, looking like a fool tourist. Real New Yorkers don't wait on line for touristy things - its embarrassing! Persevere I must to experience this mecca of mozzerella. \n\nNow, I know full well that there is always a line here, but since we just walked across the Brooklyn Bridge it was a must destination stop. Sucked it up and got on line. The manager would come out every few minutes to get a head count and keep the line moving. It is kind of funny how we all secretly count everyone walking out and wish they would move their asses and hurry up in there! Sit down, eat your pizza, get up, go!\n\nInside the place is small and has many pictures of Sinatra and other celebrities on the walls. Tables cramped together with red checkered table clothes on them, each one with a pizza tray holder. We finally got in and were placed in a prime position on the aisle right in the middle of the place. Every table was packed with fello pizza lovers. It was a euphoria of cheese and sauce and everyone was in orgasmic bliss! Had a great view of the pizzas being made. A view of the alter so to speak. Ordered a regular large pie, Pelligrino water, and a Brooklyn lager. Just going basic for this first time.\n\nThe pizza here is the real deal. Freshly made in a charcoal oven, thin crust, burnt edges, gooey cheese, almost no grease, tasty tomato sauce, cooked just right. After waiting on line for so long I wanted to take my time and savor each delectable slice. And so I did. Slice by slice. Bite by bite. Yes, it was just as good as you heard about. I wanted to order another pie but figured I will wait until next time and get some different toppings to try, as the pepperoni and sausage pie next to us was calling me ever so softly.\n\nService here is minimal, but gets the job done as that is fine by me. Polite and attentive when needed. Just get me a beer and a pizza and leave me alone to enjoy. No slices, cash only, and take out line is same as line to be seated so be forewarned. Manager was nice enough to come by and ask if we enjoyed our meal, so that is a plus in my book. \n\nWas this the greatest pizza I ever had? No, it was not, but is close to being one of the best. It was very good. I also think it is better then Lombardi's which I feel is way over rated. Totonno's, Nicks, Patsy's and Grimaldi's are in my top tier. \n   \n\nTip - they clean the ovens and resupply coal between 5-7 so wait time can be longer during these hours.", "author": "Phil H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-06", "description": "This place is as great as they say. First off, the look; it is amazing. It is strategically placed not too far from Dumbo park and under the Brooklyn Bridge. I love the brick layout on the walls,  which gives me a sense that the pizza is, indeed, brick oven made. The customer service team is so welcoming and accommodating. I was extremely late and their rule is they only sit complete parties.While I was on my way,  they sat my friends down and took their orders. When I came they got a chair from elsewhere and quickly attended to me. This is important because inside was crowded and there was a line outside. We got the large pie and some sodas. The sauce on the pizza wasn't to heavy and the crust was thinking  (I'm a thick crust girl lol). All in all, the pizza was good and it tasted freshly made. You don't get this everywhere you go. I enjoyed myself.\n\nLocation - 5\nService - 5\nFood - 4.5 (the pizza was a bit burnt on one section)\nAmbience - 5", "author": "Gawjous O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-09", "description": "Waited outside over an hour on a Sunday after around 7pm. It was a good thing I ordered my half with pepperoni and ham because the side without tasted bland. I was actually happy with the pizza, not the best I had, but what ruined the entire experience was the lack of service. \n\nThe waiter who took our order completely disappeared after. It was a table of two and all we were given was two napkins. I looked everywhere for him because my left hand was drenched in oil and I also needed a little more water to finish my pizza, but as I said..nowhere to be found. There was this one guy who after ignoring my wave several times, I asked if we could have some napkins and a little more water. He brought the water and no napkins. As he poured I asked if we could please have some napkins and he never brought them. We were sitting right in front of the counter the waiters come in and out of and he avoided eye contact in every way possible. It was disgusting. We finally asked a passing kitchen worker and he gave it to us. Upon leaving, our waiter happened to reappear. This wasn't one of the top pizzas for sure, but for all the waiting time outside they should be a little more friendly and not depend on pure popularity.", "author": "Mariel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-05", "description": "Delicious!! Thin crunchy crust, light on sauce and super cheesy....just my style!\nService was fast too =)", "author": "Pris C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-27", "description": "Not sure why this place is touted as the best pizza in NY and why tourists stay in line for hours. It's not bad but it's not the best. It's regular pizza. The crust is regular, the sauce is regular and the cheese is regular. Regular, I say.\n\nYes this place is not known for the service, you order, get your food and then the check. Don't expect to get your water refilled on its own. Don't expect a smile. \n\nCash only the nearest bank is Chase a good 10 minute walk by Jay Street and Front Street.", "author": "Tyrone A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-05", "description": "We saw, we stood on line and we finally ate our pizza. We waited about 30 minutes and thank goodness it was a beautiful day outside. The restaurant is a decent size but they pack those tables so close to each other its like everyone is eating together. My friend and I ordered our pizza and a drink and waited another 20 minutes before our food came. The pizza was really good and a lot better than I expected. Staff were okay but very busy. I definitely would try this spot again just not during the summer when I know its jam packed. I will try the Grimaldi's near my home in Queens where hopefully the pizza is just as good.", "author": "Teresa S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-25", "description": "Waiter looks like he hates his job haha. Other than that pizza is mediocre. Was expecting a decent amount of tomato sauce on the pizza but all I tasted was cheese. I guess customer service was lacking cause we came as a big Asian family", "author": "David C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-14", "description": "Glad that it was raining on the day of our visit for celebrating a coworker's last day at work. We called one hour prior to our arrival for two large pies. We didn't have wait for too long in the restaurant. The two pies that we had were pepperoni and pepper, sausages and mushroom. They were both thin crusted and very yummy. Must go back again.", "author": "Wei V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-21", "description": "DELICIOUS!! A must try for New York pizza! One of the best I've had in the city (so far)!\n\nYou can tell the place is family-owned and operated - with the head of the family there to greet you at the door. The place itself is pretty big with two floors of seating, but it gets packed pretty fast! If you get there right when they open at noon, there's no line. \n\nThe place is cash only and they don't serve by the slice (pies only). Decent price for what you get!\n\nBottom line: If you just walked across the Brooklyn Bridge or are wandering around DUMBO looking for something to eat, give it a try!", "author": "Trisa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-07", "description": "A typical day plan for when people come visit from out of town is to walk the Brooklyn Bridge, have Grimaldi's on the other side, and walk back. View is gorgeous and the pizza is worth it. With its thin slice and delicious cheese and sauce, all I can say it yummmmmm. I miss the old store though :( and the new place is still cramped! So I don't see where the improvement is haha. But I do like Grimaldi's and the experience they offer. \n\nMake sure to bring cash, wear comfortable shoes because the line can take 45min-1hr (yes, for real), and fyi you can't make reservations or get delivery. The dock is nearby and it is awesome to get a pie to go and eat it there. Oh, and you can't get separate slices! So go with people so you can all get a pie!", "author": "Darya S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-28", "description": "I was a great place, but now it has plastic plates and cups. Nit is not gonna be for famous place like this.", "author": "Liubov D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "Top notch pizza. \n\nMy husband and I have a debate over who has the best pizza in New York. He chooses Grimaldis. \n\nI have to admit, the pizza here is delicious. The special pizza ovens they have are hard at work making pizzas for the many patrons that frequent here. \n\nWe came to eat here after a long walk across the Brooklyn bridge. A warm meal was much needed when we came in from the cold. \n\nWe were welcomed by a young man who seemed like he grew up in the restaurant. He knew everything pizza. \n\nYou can't go wrong with topping choice. Just remember, they're CASH ONLY. If you don't have cash on you, they'll point you to a place with an ATM right next door. And don't go there expecting to just buy a slice! The good places in New York won't sell by the slice, only a whole pie.", "author": "Angela N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-27", "description": "A Tourist Trap near the Brooklyn Bridge.  Like some NYC restaurants, the chairs are small and so are the tables.  Is that the nature of NYC tourist traps or restaurants in general?  Real estate in Manhattan is prime so it is probably the latter--although, we are in Brooklyn...\n\nWe ordered a basic pizza--half pepperoni with the other half pepperoni \u0026 mushrooms.  I wanted it basic so that I could taste the essence of a NY pizza without having the flavors of the toppings confuse me.  Our table thought the pizza was bland.  \n\nI arrived in NY for the first time under the impression that NY makes great pizza.  That is proving to be a misconception on my part.  NY pizza is a different style of pizza, but not necessarily a better pizza.  I'd take JJ Dolan's or Cosmo's Secret Pizza.\n\nI have to recognize the staff as being very friendly and catering.  This goes for owner/manager, our waiter, and all other servers...\n\nOur very friendly and engaging waiter who hails from Rome talked us into splitting a connoli for dessert.  I found the connoli a lot more satisfying than the pizza.\n\n\nOn future trips to NYC, I doubt I will return.  Instead, I will try other pizzerias in search of pizzas that will WoW me...!", "author": "Mark H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-20", "description": "Of course I give it 5 stars, its Grimaldi's. Worth the subway ride over AND the at least 30 minute wait in line out front. Lucky for us it's not too cold yet. Old school building and the owner is pretty OG. Not a super customer servicey guy but he knows what he's doing and keeos the line moving.\n\nGetting to the pizza.. from the crust to the toppings, all beat my expectations. Crust is soft, yet somehow crispy? However they do it, they do it right. The  sauce has unbelievable flavor and compliments the cheeses perfectly.  We had just a margherita pizza that so simple yet delicious. Our second large was with pepperoni, italian sausage and sweet peppers, all perfectly prepared. \n\nAll in all, best pizza ive had in NY, chicago at home and possibly ever. If you ever find youreself under the brooklyn bridge, stop in for a pie. You wont regret it!", "author": "Eric T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}