{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-08", "description": "BEST PIZZA IN THE UNIVERSAL! A must have if you are 3000miles within Grimaldi's. I'm from Boston and I kneel in respect to this NYC Pizza place. Truly a mecca for pizza. Just be prepared to wait in that line. bring lots of friends and nibs to pass the time.", "author": "Carl I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "The pizza is incredible, but the service is hit or miss. I've been twice - one time my table was treated like royalty but the other we were barely noticed and only taken care of while ordering and paying the check. There is always a wait outside so be prepared, but after a nice walk from Manhattan across the Brooklyn Bridge you won't mind a few more minutes outside.", "author": "Geoffrey M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-29", "description": "Amazing Pizza, but Amazingly LONG waits! If you are willing to wait over an hour in line, outside in the freezing cold, then go for it. You won't be disappointed. But I can't say I will do it again!", "author": "Cessie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-18", "description": "This place needs to expand.  I was there once on a Friday afternoon and no waiting.  Fresh everything.  I mean the pizza is still a pizza, but when all the ingredients are fresh, including the tomato sauce and the cheese, it taste refreshing, not to mention very thin crust.  \nThe table is super small and extremely close to others.  You'll feel like you're going to start a conversation with the stanger sitting next to you.  And the waiters are not shy to give you the bill as soon as you're more than half way though the pizza, so they can seat other customers. \nI've try to get in on the weekend, it's mission impossible when you look at the line.  No matter what time of the day, if it's the weekend, stand in line.", "author": "Wing L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-24", "description": "Great New York pizza! \n\nThis is the stuff you think about when someone says New York style pizza. \n\nHowever, the line line is long, so please, please expect over an hour wait. It will be worth the wait, so make an afternoon adventure out of it.", "author": "Sneakie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "The pizza here is great! Coal oven pizza with fresh ingredients. The atmosphere is pretty cool as well. The service is OK, don't have anything good or bad to say there. The wait takes forever - we arrived at 8 and I think that was peak dinner time. Definitely call ahead if you are planning to eat here. Next time I would order ahead and take the pizza to go to watch the sunset in Brooklyn Bridge Park!", "author": "Meredith S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-04", "description": "Had the regular pizza and it was delicious. Not sure if I'd wait 3 hours. My friend and I got there at 5:30 so we were seated right away.", "author": "Michelle T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "This is one of my favorite pies in the city.  The thin crispy crust is as good as it gets.  Very comfortable place, wish I lived closer!", "author": "Jim M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-02", "description": "Eh ..... Not bad... doesnt deserve the lines, dont see the uniqness.", "author": "Nicholas T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-22", "description": "For all its hype, Grimaldi's looks like a quaint hole-in-the wall restaurant.  Despite the 45 minutes wait to be seated, my first bite into the large pizza removed any grudges I had when I was standing starving in line. I ordered a large pizza  topped with Italian sausage, mushroom and onion.\nRather than reinventing classic dishes which seem to be all the rage, Grimaldi strives to perfect it and compared to the pizzas I have at home I would say it nearly does.  \nWhile I am a fan of the stone ovens, the one problem I did find with this manner of baking was that certain parts of the pizza--notably the ends of the crust-- were charred. Besides that, I still consider it the best pizza I've ever had.  Afterwards, I recommend a visit to the nearby ice cream factory.", "author": "Katrina O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-01", "description": "Even though the pizza is good here, it wasn't anything special. This place is way overrated. Not worth the wait for a pizza you can get anywhere in NYC. Another downer is you can't order just 1 slice. Only whole pies.", "author": "Stacey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "Great New York style thin crust pizza.  I can appreciate fresh basil and mozzarella.   I really can do without the long wait, though.....", "author": "Su S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-29", "description": "Before going to New York in October 2009, I did a little research and Grimaldi's was listed on Yahoo! Travel as one of the top places to visit in NY so obviously we had to try it.  Located near the Brooklyn Bridge, this little pizzeria was just a short subway ride from NYC and a 5min walk from the subway station.\n\nWe got there around 1:30pm and was seated right away.  I thought to myself \"this doesn't look as busy as the reviews said it would be\" -- little did I know that we arrived just in time before the rush.  When we left, there was a long line down the block!  As luck would have it, we didn't have to wait.  We ordered the large pepperoni pizza.  I was expecting a regular pepperoni pizza, but what came out was a delicious thin crust pizza with fresh mozzarella, large pepperoni pieces, and BASIL leaves!  It was the most delicious pizza I've ever had.  I think the fresh mozzarella and basil leaves made a huge difference in the taste of the pizza.  I'm still craving for it and will come here again the next time I'm back in NY.", "author": "Tieu-Y N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-17", "description": "This place is entirely overrated. This pizza came highly recommended and I had always wanted to try a real Brooklyn slice. I'm from Pittsburgh, a city not known for pizza at all, and I've had better. It wasn't bad, just nothing to write home about. The reason I gave one star was because of the service. AWFUL. Hopefully it was just our particular waiter. He took our drink order and then did not return to take our food order for another 25-30 minutes later, and that's only because we asked the manager multiple times to find our waiter. Finally got our order placed and another 45 minutes passed before we got our pizza. We watched larger tables who sat down after us get their food first, it was only myself and one other person! We were actually about to walk out when our food finally came. Also, they currently don't serve any alcohol and after waiting in the long line you definitely want a cold beer- but you can't get one here. Yes I am a tourist, so I only have this one experience to go off of, but it was not a pleasant one. If you're feeling lucky and you think it will be worth the wait- go for it! But I'd tread cautiously.", "author": "Lauren L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-11", "description": "I came here with my boyfriend on a Monday afternoon (around 1:30pm) and we were seated right away. The place was a lot smaller than I expected it to be so be prepared to sit very close to the party next to you. The guys making the pizza are at the back of the restaurant and you can actually watch them work with the dough, toppings, and the coal oven which is pretty nice.\n\nPRICE - pretty decent for a whole pie, we ordered a small with two toppings and a soda for under $20 \n\nPIZZA - I must say that I first experienced the thin crust, authentic pizza at Lombardi's in lower manhattan and expected much more from Grimaldi's. Reading the raging reviews, I thought Grimaldi's might take the lead as my favorite pizza joint but it didn't cut it. The crust was good but the bottom wasn't as crispy as the ones from Lombardi's and the selection of toppings was definitely not up to par with the selection Lombardi's provides. Nonetheless, it was definitely enjoyable on a cold winter day and it was definitely better than a regular pizzeria.\n\nGrimaldi's is a very casual and laid-back restaurant and the staff is friendly. All NYC natives should stop by at least once and you can tell that many tourists make an effort to make a trip here as well. However, as we were leaving the restaurant, a short line as already formed outside so I guess we lucked out with the waiting in the cold!", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-26", "description": "Oh man, this is straight up the best pizza I've ever eaten in my life. This place alone is almost enough of reasons to make me regret that I don't live in NY.\n\nI was recommended to try Grimaldi's by friends back home. I'm normally not a big pizza fan, but would like to try it anyway. We came at an off time of 5:00pm for a late lunch/early dinner ish meal. The place was nearly full at the time and we were lucky to be seated right away -- because I later found out that even at 5:45 (when we finished) there was already a line starting to form outside!\n\nIt's NYC pizza and it's just about the best there is. What else can I say?", "author": "Bigi L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-25", "description": "The pizza margarita is very good!\nI don't think I would wait in line to get a slice but if there was no line it would be okay.  They just opened a Grimaldi's in Reno so it will be interesting to see the reaction to the new place there. \nThe local beer selection is very good too but they're known also for the flavored sodas.", "author": "Lisa N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-16", "description": "Many many better pizza joints in NYC. But glad this is here to keep the tourists away.", "author": "Jesse W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-15", "description": "I only give Grimaldi's 4 stars because of the line outside situation. They need to figure out a better system, other than trying to kick out people that just finished eating :).\nAnyway, the pizza is as good as advertised. The flavor is amazing, and the crust is just perfectly crusty. As far as comparing to other pizzas in town I would say that it is way up there along with Patsy's, one of my other favorite pizza places.", "author": "Boris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-08", "description": "It's Great Pizza here in New York, but it's not the BEST. For anyone whos been to Naples and had pizza from Da Michele knows, THAT is the best pizza you will ever have. but Grimaldi comes close to it. the main reason is the ingredients are fresh, the sause is sweeter, not too sour like many pizzas are, and the dough is pretty nice.\n\nyes you have to wait a long time, but i think it's more of a one time thing. i may go there on a week day at a random time to have it again to avoid the line thou.", "author": "Ren X."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}