{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-12", "description": "I think it's so funny how Grimaldi's is in Brooklyn and not Manhattan. It's almost a testament saying \"New York is too expensive for New York's greatest pizza\". Well, they still live in one of the five boroughs so I guess that counts. \n\nI really had a good time at Grimaldi's. The food was excellent, although I think I ate like 2 pizzas by myself. The ambiance is good, feels very movie style Italian. I walked across the Brooklyn bridge afterwards and wasn't hungry so that's good. However, I did have to eat 2.\n\nI like the pizza because it really brings out the flavors in the toppings versus dousing you with a sauce and bready explosion like Gino's East in Chicago. \n\nBeing from San Francisco, I get to say both are my favorite. But Grimaldi's is definitely a spot any tourist must visit.", "author": "Alexander L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-09", "description": "My first New York Pizza experience so I cannot compare it to the other local pizzerias as I have not tried them yet.\n I walked up to Grimaldi's from the York St. subway station and, given the previous reviews of the 1 hour wait times, was pleasantly surprised when I walked in the door and was immediately seated... in between two complete strangers. The place was almost packed but I was not about to let that drive me away from a supposedly great pizza. Awkwardness aside, I placed my order and waited patiently (15 minutes)  for my pizza to arrive. Wow! was all I could say when the pie was placed before me. I ordered a small (6 slices) Margherita w/ half pepperoni and it seemed enough to feed maybe even 3 people. The crust was great- thin and crispy on the outside. The mozzarella/basil/sauce combination was awesome and not too many nor too few pepperoni on the pie.  The service was good, the waiters pretty friendly, and my water was refilled without having to ask. My leftovers were even wrapped securely in butcher paper/cardboard. I will be paying Grimaldi's another visit soon!", "author": "Candice B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-28", "description": "The best New York pizza I've ever had! Being a California girl, I've still managed to make my way to Grimaldi's twice this year and even waited in the 45 minute long line to get into the door. The wait was definitely worth the fresh, doughy, thin crusted pizza with an array of toppings to delight your taste buds. I think the first time I went, we ordered mushrooms, sun dried tomatoes, and ricotta on our pizza. The second time we ordered basil, sun dried tomatoes, and sausage. Both times the pizza wasn't too oily or too cheesy, and the chewy sun dried tomatoes gave the texture an extra kick. And despite my friends and I eating the entire large pizza, we still walked out without the bloated, heavy feeling. Excellent.\n\nMy mouth is watering from just writing this review.", "author": "Lily A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-02", "description": "All I can say is OMG! I visited my cousins in the city and they said that if I wanted good pizza, I needed to check this place out. We got there before the restaurant opened and the line was already pretty long.  We broke out our umbrellas like little old ladies to keep the hot sun off  of us. I was laughing at my cousin for bringing it when we left the house, but now I  had to bite my tongue and thanked her for her planning. Luckily, we had a seat when the restaurant finally opened, so there was no additional waiting. The AC was a welcome change when we walked in, but quickly became a bit too cold for my liking. The atmosphere was great, the smells were wonderful, and the loud converstions mixed with music told me that everyone was having a great time although it made it difficult to hear our own conversations.\n\nThen the pizza came out. WOW. These were no ordinary pizzas. First off, they are cooked in a brick oven which gave it a crispy, yet perfectly charred crust. The ingredients were all fresh. Whole basil leaves, fresh mozzarella, thick slices of peperoni and sausage. I had to cram down  two extra slices after I was already full. I may not be Italian, but I find it hard for anyone not to give this place 5 stars.", "author": "Jone H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-29", "description": "one of the worst pizzas ive had in nyc.  the dough was really flat and boring, similar texture to pita bread from the grocery store. there were no air bubbles or layers of texture.  they say the oven cooks at 1000 degrees buy it was suprising how the bottom of the pizza had no char or crispness.  they were also playing some horrible music when we arrived, some emo pussy rock that i might of liked in 8th grade which killed the old school dumbo vibe.  its an old school italian joint, just play sinatra or something a little classier.", "author": "B C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-10", "description": "What should've been a 5 minute walk from the subway to Grimaldi's turned into 20 minutes of being lost... in the cold 20 degrees weather!  But the daunting weather seemed to work in our favor.  It was probably too cold for people to be out that day--mind you, it was a Saturday--so there was hardly a line.  Our wait was probably a little over five minutes!  Heck yeeeah!  \nSo... three girls tackling  two pies--a large and a small.  For the small pie, we got extra mozzarella and mushroom.  For the large, we got sausage, extra shredded cheese and garlic.  Boy, that extra garlic gave that pizza that extra kick!   We killed 'em both!  The thin crust was deceiving enough.  It makes you think you could eat five slices of pizza when your tummy only has room for three.  Or you could do like what my buddy Lor (who's a fellow Yelper) does... don't eat the crust so you could eat more!   \nDefinitely a place to try when you're in Jay-Z's 'hood!\nP.S. You could always walk the Brooklyn Bridge if you feel like a glutton after!", "author": "MJ S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-07", "description": "Checked this place out several years ago after hanging out at the park. The food was ok but not worth the wait and the hype. I guess it's good for the guidebooks.", "author": "Irwin M. F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-26", "description": "This is the most overrated pizza in all of the world!\n\nIf u are from Ohio, kansas, and any other midwest state then u will love this because you don;t know any better.  This pizza is bland and the only take cash.  So yeah any real New yorker knows that this place is for suckers.  I said it!!  Take it", "author": "ross c."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-31", "description": "I was there on Sunday afternoon, the wait was not bad like what I expected but I had to wait to be seated for half an hour in a very cold weather which is very inconvenient. I was not really impressed with the foods though. I orders the large regular with 5- 6 extra toppings. I was expecting that the pizza here will wow me but it turned out like I can get this kind of pizza in any pizzeria. The service was good and remember its a cash only restaurant!!", "author": "Ben C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-09", "description": "A wise man once said pizza is a lot like sex. When it's good, it's really good. When it's bad, it's still pretty good. Well this pizza is really good. Can I say it's the best ever? No, but oh man is it good. Certainly falls into the top 5.\n\nNow the details, the pizza here falls in between what most refer to as NY style pizza and what would be a classic thin crust Italian. It is a very light pizza; it is not greasy at all and has a great fresh vibrant taste. You can tell that the ingredients going into and on this pizza are of great quality. This truly is a great pizza. One other big plus is as long as you don't overdo it with the toppings the prices are great for a pizza of this quality. So why not five stars? Mostly because some of the slices I had were soggy which is defiantly not acceptable for pizza, I also felt that the pizza could have benefited by a few more minutes in the oven to really crisp up the outside of the crust. \n\nSo some suggestions: First, off come here for the pizza, don't expect five start dining. Second, you cannot order slices. Third, don't put to many toppings on this pizza; keep it simple stupid. Forth, bring cash they don't take plastic. And finally just dig in and enjoy.", "author": "Neil V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-07", "description": "The wait is shorter and the pizzas come out faster during the daytime on weekdays.\nMy favorite is the white pizza but they have plenty of toppings to choose from. \nBeers: Brooklyn Lager/Pilsner, Heineken, etc. \nThey take cash only but there's an ATM machine inside. Don't do what I did the first time (I walked all the way to the deli at Henry and Pineapple.)", "author": "Natalie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-24", "description": "Yes, there is a g-d!!! and he/she makes pizza in DUMBO! \n\neat it while it's hot though, kind of loses a bit of its sex appeal once its cooled down.", "author": "Lena N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-19", "description": "Born, raised and currently here in Brooklyn and this past weekend was the first time I tried Grimaldi's (I'm 27).  Every other time I wanted to go, no one wanted to go ..they all said \"it's not worth the 2 hour wait\".. \"there's better pizza just a couple of blocks a way\", but still I had to try it. Finally, I was able to find a friend to drag here and to wait the line with me. \n\nWe got to the line at 4:30pm on a Sunday, the wait wasn't too long - just 20 minutes.. but i've passed by when the line was much longer.   we got seated at the end of the row..but so close the people one table over, that I had to get up every time someone wanted to pass through. The waiter took our order right away and brought the pizza rather quickly. \n\nThe pizza was decent.. Good but not great. and definitely not the best in Brooklyn.. or NYC in its entirety. .I wouldn't even consider it NYC pizza.  sure it was thin crust ( a little too thin even), but there are other factors that make a pizza \"NYC Pizza\", and this didn't cut it.  a bit pricey too, $14 for a Small, $16 a large and $2.00 per topping.  once we finished, they brought the check right away and before we could get up to leave, the table was already set for the next set of people.", "author": "sara n."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-03", "description": "Quite simply, the world's best pizza.  \n\nAlways a stop when friends are visiting from out of town, and no matter how much I try to overhype the place, I'm just not able to.  \n\nMmmm its in the cheese.", "author": "Gregory L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-28", "description": "Got here 40 minutes before opening on a Saturday and were the second ones in line.  Not bad, considering there is a wait no matter when you go.  Right when they opened, they let a tour bus group in before those in line, and people were outraged.  Luckily we still made the cut into the restaurant, so everything was ok.  \n\nRestaurant itself is packed.  Be prepared to eat next to strangers.\n\nPizza was really good though.  The pepperonis were especially tasty.  \n\nI'm glad I can say I have been here, but given the trek to Brooklyn, the long waiting time, and the close seating to strangers, not sure I would do it again.", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-20", "description": "Sweet lovely jesus!\n\nSo I went off of Yelpers for good New York pizza while I was visiting early September 2007. Y'all were raving about this Grimaldi's place. We decided to give it a go. The first time that we tried to go (walking over the Brooklyn Bridge beforehand), the line was awful long. We said to ourselves, \"seriously? It cannot be that good.\" We didn't have enough time to stand in line but were mesmerized with the size of it.\n\nSo, we tried again. We got to Grimaldi's about 30-ish minutes before they opened. There were a few people in line. We decided to take a walk near the water. When we came back, twice as many people in line. We hopped in line and waited. \n\nIt was worth the wait. They ran that place like a factory. You go in, get what you want, pay and leave. It was worth every penny if not more. The pizza was incredibly delicious. Watching them making the pizza while waiting for use of the bathroom was also an unexpected perk. They are masters of what they do. \n\nPlease go, you won't be disappointed.", "author": "Alex M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-30", "description": "I was on a one-day trip to NYC and had decided that I was going to go to this crazy \"Grilled Cheese America\" restaurant when I found out that there was a gas leak nearby, so I decided to wander through Chinatown and walk over the Brooklyn Bridge.\n\nI'd had Lombardi's the previous night, but decided, \"What the heck?\" and ordered another pie at this place.\n\nFirst off -- it's in this totally bitchin' section of Brooklyn, right under/near the bridge.  And it's really typically Italian on the inside.\n\nPlus it's really good pizza, so even with the crowds, it's totally worth it.\n\nI can't wait to go back!", "author": "Joel F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-12", "description": "Not even close to being the best pizza in this neighborhood.  Save yourself the wait and go next door to either Juliana's or Ignazios!", "author": "Christina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-30", "description": "Grimaldi's if my all time favorite place so I was excited to be able stop in on a rare trip to NY.  Maybe its been 10 years since the last time I have eaten here, and I gotta admit I was a tad bit disapointed this time.  The pizza still tasted great, nice salty crust with a nice amount of oil, but the char on the crust that I've loved so much was not there on our pie, the next table over there was way to much char and at the opposite table it was just right, it was very inconsistant  and I don't remember that before.  Also we had a large pie with pepperoni on half and on the side with no pepperoni where they swirled the sauce around the pizza there was a space in the middle about an inch thick or more where there was no sauce at all just crust .....why ???   The place was packed but it always is and always has been, so why the inconsistancy with the pizza today ?  It was still pretty tasty but there is no way I can give it a 5 star this time.  You already have to wait over an hour to get your pizza at Grimaldi's cause the lines are so long to get in.....make us wait another 5 min and make the pizza a little more consistant oi.", "author": "Eric T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-10", "description": "Wait wasn't very long, 5 minutes, but to long for the quality of pizza. Wouldn't come here again. Sat upstairs which was crazy crowded. The service was painful to deal with. Save your money to eat at Papa John's or frozen pizza.", "author": "Joshua T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}