{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-21", "description": "Best Pizza in NY!!  Sis and I grabbed our last meal for the road before heading out of the big apple....divine!!  A few things to note: call in advance so you dont have to wait in line, cash only, pie only...yes, no slices! After one slice, you will want the whole pie anyway ;) I'm not even a huge pizza lover..probably because there aren't too many authentic, fresh pies out there but this is one place you want to check out if you do or don't love pizza! It's a must!", "author": "Patty L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-01", "description": "I love the margherita pizza here.. but only when it is piping hot.  As soon as it starts to cool off it loses it's appeal.  The line is always long but it is worth those first few bites of hot, fresh pizza.", "author": "Nina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-31", "description": "Cash only. The line out the door on a Saturday afternoon is over an hour wait. But alas to watch up close and personal as these impeccably hand made pies are strategically fired into the coal fired oven is well worth these inconveniences. An absolute perfect balance amongst all toppings with a scrumptious tomato sauce on a fresh crust, this pizza delivers! Calzone has incredibly light and airy ricotta filling. Cold cold beers and serious barely-English-speaking wait staff make the wait after placing the order pleasant. Buy a t-shirt and advertise your fan-hood. But avoid the unisex one-stall restroom any cost and walk the 200 yards into the park to use the public trailers -- you will thank me.", "author": "Event L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-19", "description": "I was excited to try the famous Grimaldi's in Brooklyn, however, I was kind of disappointed. It was just ok in my opinion. Ingredients were fresh and mozzarella was great. I think they burn their crust a bit too much. Gives it a bitter taste. Also, needs more sauce. I think this place is hyped up a bit.", "author": "Anthony M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-18", "description": "Consistently voted one fo the best places for pizza i New York there was a dutiful line of tourists outside waiting to get in. Once inside the service was very friendly and the pizza didn't disappoint. We ordered a pepperoni pizza and it was perfect. Thin crust, nice melted mozzarella and quality meat. No complaints at all!", "author": "Jose D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-02", "description": "I watched this show on Food Network that tested if one's environment has an effect on how food tastes.  It proved to be true...food can taste better or worse depending on factors that have nothing to do with the quality of the meal itself.  Perhaps that is what happened with this particular experience?  \n\nSince all of our party wasn't there, we ordered it to go.  We walked a bit down to this area where you can get a great view of the cityscape, but we sort of had to eat it on a bench and the pizza had cooled some.  It was alright.  It was similar in style to Lombardi's, except the bread is much softer.  Lombardi's is kind of crispy.  We got the pepperoni and mushroom.  \n\nHonestly, I think it's good but not mind-blowing.  Maybe it's because I had to squat while eating it in the dark.  I dunno.  Either way, I would go to Lombardi's over Grimaldis ANY DAY.  Lombardi's - we didn't have to wait to be seated.  Grimaldis - 1.5 hour wait.\n\nOH.  I would suggest eating here first and then walking the Brooklyn Bridge.  The view is much more beautiful since you're walking towards the city, not away from it.  Also you can sort of walk off what you ate.  But it's been 4 hours and I'm still not digested.  I did stuff my face I won't lie.", "author": "Jane P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-29", "description": "Loved the old grimaldi's. We're eating at the new location up the street right now and it's a big disappointment. Longer line than ever, terrible service and we're still waiting for our second pie after more than an hour at the table. The new digs aren't helping- bad ambiance and a music selection that's even worse.  Pizza is still good so they get two stars but the experience has been awful.", "author": "Brian C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-23", "description": "Although I was here well over two years ago, from what I can remember this pizza  was off the hook (and I haven't used this expression since high school). Yes, the wait  can be long, yes the space is somewhat small (I'm talking about sharing a long medieval style table with complete strangers) but the pie is worth it.", "author": "Diana K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-04", "description": "Atmosphere is fun..service was really nice..but the pizza..eh- pretty mediocre. Maybe because of all the hype I had expected something amazing and mind-blowing, what I experienced was decent pizza but nothing I would go out of my way to ever eat again.", "author": "Tracy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-01", "description": "because in my world di fara's won over grimaldi's... but good pizza always gets 4 stars. that's how this cookie crumbles.", "author": "Sasha N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-25", "description": "Just plain disgusting! The pizza was cold and hard and definitely not worth the wait. The owner (man standing outside) is extremely psychotic and moody. Horrible service, horrible atmosphere. THe place is so small and crowded we could smell each other's armpits as we were eating the pizzas which is extremely disgusting. Never go to a place where u have to wait on line for 2 hours and then get to eat in a little pothole full of tourists with body odor. Just plain disgusting. Oh and also don't forget those little visitors (cockroaches) underneath the tables and also in one of the drinks. Yuck! Never going back especially on that ridiculous line.", "author": "Natalie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-09", "description": "There's a reason why there is always such a long line at this Grimaldi's location in Brooklyn.  Aside from the great view of lower Manhattan, it's one of the best place to try authentic New York style pizza.  There are only a few pizza joints that I would give a 5 rating too and this is one of them.  It's definitely worth the try if you don't mind the wait.  Quick tip: if you sign up for the Slice of Brooklyn Pizza tour, this is one of the first stops and best of all you don't have to wait in line...you just go right in.  Be sure to bring cash as they don't accept credit cards and make sure you come hungry because you can't get pizza by the slice.", "author": "Eric V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-29", "description": "The pizza is actually fairly good- its definitely better than the typical pizza slices in NYC, but not definitely worth the hype. Probably a 3 to 4 stars based on just the food. What was the defining experience was the service, which was absolutely horrible. Sparing the entire story, after witnessing an incredibly RACIST AND RUDE service by the servers to the patrons during seating and ordering, we were really turned off regardless of how the food could have been. Sticking with the $1 slices in Manhattan instead.", "author": "Hoang L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-23", "description": "Outstanding pizza, well worth the wait in spring and fall. Exceptional brick oven taste and everything always really fresh. Very authentic and traditional-a real slice of Brooklyn.", "author": "Jo M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-11", "description": "I LOVE Grimaldi's!  I went here for my birthday, which was a Friday evening.  Had to wait on line for an hour.  For me it was worth it.  The pizza is absolutely delicious.  I wouldn't love it so much if not for the beautiful location.  It's part of its charm.  If you go here you have to expect a long wait.  And don't go here with a large party.  It's best to just go as a party of two, or else you might be waiting longer.", "author": "Sonia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "If not for the very looong line I would've given them 5 stars. But that doesn't take away from one of the best Pizza's ever . It's definitely worth the wait. My boyfriend is the pizza monster!", "author": "Vivian S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-04", "description": "This is a neat little place. The pizza was pretty good - I don't know if it's necessarily the BEST pizza ever, but it was very decent. \n\nBiggest downside? The place is small so if you don't luck out you'll have to stand on line for a while. Also, the service is ALL business here. We had to even grab our own menus from a bin thing. But the good pizza makes it worth it - I think. \n\nUpside? I shared a pizza with 3 others and each of us paid between $10-15.", "author": "Navneet S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-06", "description": "The wait for a pie was over 1.5 hours... but it was worth it. I tried Lombardi's a few days before trying Grimaldi's and all I can say is that Grimaldi's is a better pizza.", "author": "Rosa P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-22", "description": "The new location is not the same:( We were very disappointed with the pizza, the taste does not compare to the old Grimaldi's. Definitely no longer worth the wait.", "author": "Ascena S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-23", "description": "On vacation from the Left Coast, our friend suggested that we go have Pizza at Grimaldi's.   After our leisurely stroll across the Brooklyn Bridge, and curving down around and back towards the water, we came upon the little pizzeria.  All I can say, is WOW......i wish we had pizza like this in CA.\nWe hit the place just before their dinner rush, so we lucked out and didnt have to stand outside in the blistering summer heat.  Bring cash, they dont take credit cards (although there is an ATM just inside the door)", "author": "Allen M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}