{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-27", "description": "Loved it! We had two pizzas, one with mushroom and pepperoni and the other just plain (or \"Boring Pie\" as the server called it). Both were wonderful. The mushrooms were so fresh and the pepperoni so juicy and flavorful. The plain pizza let the quality of the ingredients shine in all their simplistic glory. Everything, from the crust to the sauce, the cheese to the olive oil, was perfect.\n\nThe line was actually good because I wasn't all that hungry when we showed up but I was by the time we got inside. At one point we were the second of three two-tops in line, and the guy came out and called for a group of 3 or 4. A truly brilliant woman behind us suggested we combine forces and take that four-top! It probably only saved us about ten minutes of waiting, but those ten minutes would have felt like an hour.", "author": "Renita K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-08", "description": "I enjoyed the sausage pizza we got. It was really thin. I am not giving it a five star because I don't think it is worth the long line to get in. I have had better NYC pizza but this is very good. I'm just glad we didn't have to wait over 20 minutes to be seated.", "author": "Laura H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-09", "description": "The second time we came here, we were a group of 12 and arrived just after it opened.  The restaurant was already full and there was four people before us in the line.  We got lucky though and a large pizza tasting tour that was in there before us left pretty quickly and we were seated about a half hour in line.  With a view by the window, we quickly saw the line grow... and grow... and grow.\n\nThe pizza - simply amazing!  Love the thin crust, the cheesiness and the simple delicious pizza aroma.  I was standing in line for their single stall washroom which is right behind the open kitchen and coal fired oven and witnessed a dizzying number of pizzas being made.  They do it so fast!  Because of the cramped space, the unflattened pizza dough is placed by the wall next to the bathroom line and I saw a fly crawl over some uncovered dough.  I ate the pizza afterward anyway and the image of the fly didn't come back to bother my mind's eye.   \n\nThe take out line is the same as their dine-in line, so if you're going to be taking out, phone in and order ahead of time.", "author": "Karen S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-11", "description": "I purposely ate at Grimaldi's on one of the coldest evenings on a weeknight this frigid winter, to avoid a wait in line.  The pizza wasn't bad, but nothing to write home about nor is it worth the usual wait in line.  I also wasn't impressed with the service, which also gets three stars.  \n\nGrimaldi's is another one of those places that is famous among tourists, but doesn't necessarily live up to expectations - for me it did not.  For the real deal, head next door to Juliana's.  A less well known favorite of mine is Knapp Pizza II near Coney Island.", "author": "Anthony R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-03", "description": "Best pizza deal on earth. their biggest pizza is, what, $16? Light, chewy fresh slices of heaven I tell you. This is different from your typical corner pizza. Every time i talk about pizza, I put this one in a different category just because of its dough. \n\nI like my pizzas virgin. especially if you're in it for your first time. that intimate moment of your first bite with the basic regular pizza. oh my!\n\nI did try the white pizza. Its a little heavy in my opinion. With the regular, I think I can actually finish the whole pie. While, the white pizza, maybe 2 slices. \n\nLines are a bitch. I once went there at the time it just opened. and I had to wait for an hour. Though there was a magical moment back in winter, when my school canceled all classes. it was a snow storm in the morning that calmed down in the afternoon. I went to this place and it was dead empty. No lines. Most tables beckoned attention and butt warmth. And we came hithering to it. \n\nSo my friends, the lesson here is, go during a snow storm. You'll do them good filling up those tables\n\nfor dessert, skip brooklyn ice cream factory. for light dessert, go to almondine. for decadence, go to jacque torres. you're welcome.", "author": "Candice A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-09", "description": "So got lost trying to visit Brooklyn Bridge and instead of going over the bridge through the subway, we ended up walking across the bridge. By the time we got here, we were exhausted and hungry. It was around 3:30ish and I didn't expect the long line outside and it reallly pissed me off to stand there but what can I do? \n\nWe waited for about 35-40 minutes and was seated upstairs-which btw is very hot. We ordered the small white pizza with onions and pepperoni to split between the two of us. We just had Lombardi's couple days before and decided that this pizza place tastes much better than Lombardis. The pizza is thin and dough is chewy and soft all the way to the crust. Very consistent and I loved the cheesiness of it. \nSmall pizza have 6 slices and we had 2 slices left over to take home. The total came out to about 18$ and its cash only. \n\nIm not sure if I would want to go and wait for the pizza but I came out energized and ready to make the trek back to Manhattan.", "author": "Angela L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-03", "description": "Love the Pizza!  I've decided that every person who visits me will experience my tourist dynamic combo - Walk across the Brooklyn Bridge and eat the ultimate reward, Grimaldi's Pizza.  I've been twice and have loved it both times.  Fresh veggie ingredients (yummy mushrooms), fresh mozzarella, perfectly balanced sauce, and a tasty crust - Can't go wrong.  The staff are really friendly and made us feel like we were eating in their homes (if that makes sense).  \n\nWe waited 30 minutes to get in, but found the service was fast, efficient, and friendly once seated.  Also, they maximize their space - so you are eating cafeteria style - which is fine with me, as I tend to make friends with those around me (met some really awesome Australian girls).", "author": "Aarti G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-03", "description": "A NY friend recommended this place and I've also seen it on Food Network so naturally we had to try it. Plus, there's a feud of which has the better pizza, Grimaldi's or Lombardi's. \n\nGrimaldi's gets a 3.5 stars in my book. Not as good as Lombardi's but still pretty good.\n\nThe wait, sucked sucked sucked. About 45-60 min wait in hot hot Brooklyn during Memorial day weekend.....the line moved soooo slow, and of course, the inside seats only like 60 people.\n\nThe pizza sauce was not as fresh tasting. Though you can see them make the pizza right before your eyes, the sauce and the basil did not excited. There was wayyy too much cheese and NOT ENOUGH SAUCE!! The ratio was all off!! \n\nAs a comparison to Lombardi's, we got pepperoni and sausage. The pepperoni is thicker here and the sausage was still very tasty. \n\nThe pizza though did get worst as it cooled down. We tried to eat it quickly but as it got cold, the cheese got hard and the crust was crunchy....\n\nPretty good pizza overall but not really worth the line or wait.", "author": "Leona S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-28", "description": "Trust me, I wanted to love you Grimaldi's. I read all the reviews, people recommended me to you, but you disappointed me.\n\nThe first day that we came, my gf's and I didn't know that there was a 30 person wait- we left\n\nThe next day, we waited in the scorching hot sun for 45 mins and I would say that it was not worth the wait. \n\nCons of our visit:\n-It must have been a fire regulation to cram 5 girls into a small table. there was hardly any elbow room. \n-Waiter was not too attentive. His dry personality seemed like he was doing us a favor by waiting on us. \n-Avoid the sun dried tomatoes and olives- they are too salty!\n-CASH ONLY. Boo.. please join the rest of us in the 21st century and accept plastic!\n-Warm beer- disgusting!\n\nHopefully next time that I will be in NY, I'll be visiting the famous DiFara's.", "author": "Tam D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-03", "description": "When you click 5 stars, this says \"woohoo! as good as it gets!\" and for pizza, Grimaldi's is as good as it gets. I'm not sure other people who reviewed Grimaldi's were prepared for the experience that they were about to have....\n\nfirst, we're going to talk about the pizza. it is AMAZING. I'm usually not a crust person (sometimes I don't even eat it) but their dough is ridiculous. It's like having your first french baguette in Paris after eating white wonder bread all your life. is this pizza dough!? how!? and the pepperoni! real Italian meat market pepperoni, which makes your pizza that much better. \nIn full.... I got pepperoni, sausage, and ricotta. It did end up a little soggy ... i think it was too much for the pizza to take - the ricotta probably added some water. (will that sogginess deter me from coming back in the future? absolutely not!) in the future, i would get a pie with just pepperoni. and go with the LARGE. you're already there, you have no hope to resist, so you might as well indulge!\n\nas for the atmosphere, I LOVED IT. It's a two story building on the corner and the wait outside is part of your experience .... i showed up on a warm Friday night at 10 pm with a cup of coffee in hand. Once they got a big group in, the line moved pretty fast. I was seated upstairs and they have joint tables where you sit right next to your neighbor (as if you were being seated at a big picnic table with moving chairs). It's alive and bubbly feeling with the energy of NYC, the city that never sleeps.\n\nMy only tip is this.....wear layers you can remove. Inside, I felt like I was sitting on top of the brick oven directly. They have a fan going, but that is a minor help. Luckily, I had a sweater I could take off. Be smart and do the same!", "author": "Lauren V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-04", "description": "Greatest pizza I have ever had.  I tried every brick oven pizza in NY, all the famous deep dishes in Chicago, the award winning places in AZ \u0026 Portland, and none of them compare.\n\nLarge Pie with pepperoni for breakfast, lunch and dinner.", "author": "Angelo M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-31", "description": "Pizza was okish. The kind of customer service received was a disappointment. It reeked of arrogance and rudeness which soured the entire experience. I will recommend going to Juliana's instead which has better pizza and where customers are treated better.", "author": "Brinkal J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-25", "description": "Hands down the best pizzeria in that part of Brooklyn. The only downside to this place is that if you go around lunch or dinner time it's really busy. When I say busy I mean so busy that there are people lined up from the door to the end of the street! But the pizza is good, so I think it's worth the wait. Keep in mind that they do not sell slices - pies only.", "author": "Julie N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-16", "description": "Anyone Brooklynite who thinks this place is better than DiFara's is simply insane. L\u0026B's Spumoni Gardens is also better than this place. Heck, brick oven pizza from L'asso in the LES is better than this place. I have no idea what the hype is about - but Grimaldi's owes a lot to Food Network and the like for bringing them all this business.\n\nFirst things first - if your staff is rude and your establishment dirty, you definitely should have the food to back it up. Grimaldi's most definitely does not. You have to wait behind rope when you get there and they have all these rude, stupid signs taped to the windows about things you can't do. You go in and its just a tourist trap. This place is so clearly tourist central. There didn't seem to be any locals in there on a random Monday night. Only tourists, tourists, tourists. The only reason we were there, BTW, was because DiFara's was closed and our friends from Texas wanted pizza. L\u0026B's would be too far for them as they were staying in Queens. So, we decided to meet halfway try Grimaldi's.\n\nWe got one small and one large - both with pepperoni, one with mushrooms added. The ingredients were okay, but I agree with other reviewers that the pizza is soggy and bland. Their pizza isn't special at all. \n\nAnyway, the only reason the rude, inattentive staff and dirty environment was tolerable was because we were in fine company. I would never, ever recommend this place to friends or take them here. It was embarrassing, quite frankly.", "author": "Carol F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-29", "description": "The pizza is good, its convenient for tourists to locate (stone's throw from the city), and is in a great location to sight see...No wonder Grimaldi's has long lines and is world famous...But for amazing pizza, Difaras (which is not a stones throw but also has ridiculously long lines not because it gets swarmed with city tourists looking for Zagats restaurant but because of its amazing pizza)", "author": "Vincent R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-30", "description": "Loved the pizza even though you pay per topping, limits the possibilities.  \nA male friend and I shared the smallest pizza with pepperoni as our topping and even had leftovers.\n\nOur waiter was very inattentive, never got our water filled, he never came to the table and it wasn't even a packed house. The buster however gave us Togo boxes and brought the check.\n\nI don't even remember how long we waited but it felt no more than 10 mins later and the line was huge.\n\nAlso cash only? Really?", "author": "Alizabeth I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-22", "description": "Don't ask me why, but I didn't love this pizza. I liked it but  something about the sauce just didn't do it for me.  I think the Grimaldi lovers will kill me for this: but this place is a tourist trap. \n\nOr maybe it was the company I was with and I should give it another try.", "author": "Rose C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "One of my favorite places to go for pizza. I love that the slices are so thin. I usually get their regular pizza with an extra order of basil. I just don't like their long lines, but I guess that's cause they are so famous.", "author": "Su L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-26", "description": "Since the line here is always ridiculous, I ordered my pizza over the phone.  It took about 45 minutes of hang ups and busy dial tones, but someone finally took my order.  I picked up my pizza 20 minutes later, and took it over to the park for a picnic.  The atmosphere inside the restaurant was chaotic and the \"B\" health inspection grade turned me off a little.  \nI'm a big pizza fanatic, especially when it comes down to brick oven pizza.  This pizza was good, but it's not as good as people say. I was happy with the quality of the ingredients.  My pizza had extra mozzarella, pepperoni, and mushrooms.  I like the bit of basil that they throw on top of the pizza.  I was disappointed in how soggy the middle of my  pie was.   Next time I'll ask for extra well done.\nOverall, I don't think this pizza is worth waiting in that crazy long line for.", "author": "Amanda M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-03", "description": "Most over rated restaurant ever. If anybody knows good pizza, they'll know this this is the opposite. Cheap ingredients - why would they scrimp on good ingredients when they have such a famous reputation??", "author": "Nick M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}