{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-14", "description": "They don't sell slices, but the pizza is crispy and delicious. The crowd seems a bit uptight, but the Polish dude who handles the FOH keeps it light in the dining room. The menu doesn't have a lot going on, and the have some good sodas from a local vendor. The mozzarella is buffalo and melted the way it should, not shredded cheese covering the whole pie but spotty with sauce. Don't go there looking for a hyped waiter who is telling the day's specials. Go there knowing what you like and order it and it comes out fast.", "author": "Raymund S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-25", "description": "Really awesome pizza!\n\nWent around noon on a Monday and there was line but we only waited about 10 min before being sent upstairs to be seated.  The server upstairs (bald headed gentleman) was really rude but what do you expect? I'm sure he deals with tourists all day long and that may be why he was PMS-ing.  \n\nWe ordered the pie 1/2 sausage and 1/2 margarita.  \nThe dough is very good but the only complaint I had was that there wasn't enough sauce with every bite but I guess that's how Grimaldi's makes their pizza. \n\nCash only and be ready for the pizza nazi upstairs!!", "author": "Amy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-28", "description": "Pretty amazing.\n\nThe wait is insane... they could probably open up locations all over the city and do very well. The place has a real authentic feel to it... but being PACKED with tourists and a line stretching blocks down the road kind of puts a damper on the experience. I had seen the place on the food network (which I didn't even remember until we were waiting in line and I saw the \"under the brooklyn bridge\" sign out front.\n\nThe pizza is delicious. I'd say it's definitely in the top 3 slices I've ever had... I'm more of a chicago style fan so I can't claim that it's the BEST. But it is definitely worth the wait and is deserving of the hype.\n\nThe best part is the owners/operators... if you aren't from new york, they are quite entertaining... if you are from new york, you're probably used to it.", "author": "Michael V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-11", "description": "Been here a couple of times and never disappointed!! Of course, you have to wait in line outside for a table but the line moves quickly and once your seated you'll be served right away. The pizza is delicious!!! We ordered the pepperoni and sausage pizza along with a  plain cheese pizza and both were excellent!! The only compliant is that the place is a bit tight and cramp but as along as your with friends, family and good food, you'll be fine! ;)", "author": "Selena N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-01", "description": "I didn't actually go to the restaurant. My husband and BIL ordered it to go. So I ate an almost cold mushroom and pepperoni pizza, and it was still good. IMO that says a lot. I will have to come back to NY and try it again.", "author": "Ardielyn F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-08", "description": "Tourist trap, busted. Try out some other NYC pizzas, every borough has something better to offer than this, even in the specific subgenre of wood fired oven pizzas. Totally overrated, save yourself the wait.", "author": "Leah G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-03", "description": "The Line....The LOOOOOONG Wait...The Price....NOT WORTH IT!!!\n\nI REALLY don't know what the BIGGGGG fuss is about this place....\nAND...I don't know what ever make them think that I would like FLAVORLESS/BLAND, CHEWY, RUBBERY pizza...tisk tisk...", "author": "Eszee R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-04", "description": "Stopped by Grimaldi's yesterday to try out NY's supposed best pizza... we waited over an hour in line for takeout- yes... I said TAKEOUT. You have to wait in the same line as everyone trying to eat in the restaurant unfortunately. We opted to eat at the pier down the street for the lovely city views at dusk and I'm very happy we did. \n\nThe pizza was very good- we ordered a large half pepperoni. The fresh mozzarella is all that and more. The crust and sauce are yummy as well. But to tell you the truth, I've had pizza similar to this so I wasn't mind blown like some of the other yelpers were. I'd go back but hopefully not to deal with an hour plus line.", "author": "Marina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-21", "description": "\"Sooo when are we going to Grimaldis?  Jeff and I are down anytime.\"  These were the words of a close friend who fell in love with Grimaldis the first time after going there in Manhattan.  \n\n\"It can't be better than Lombardis!\" was always me and a close girlfriend's reply.  So we went off on the search for the best pizza in the city, based on our limited time and knowledge. (I will try Di Fara's someday...it's just a matter of when).\n\nWe came to Grimaldis on a Sunday afternoon around six, and waited in the line for an hour and half before being seated.  Starving by then, we ordered the large pizza with sun-dried tomatoes, sausages, and mushrooms.  At first bite, the pizza was delicious--it arrived within ten minutes of ordering.  But first impressions do not always make lasting impressions.  As I took more bites, I realized that the crust was way too salty, and something just was not right about the cheese.  Something, just something didn't fit into the puzzle.  I think I want to go back just to try to figure out why.\n\nI also dislike  the business model of not being able to call in ahead of time.  For someone as impatient as me, I would rather pay more than to waste my time in line...a personal preference.  Thank goodness there was good company, as my friends made the time pass by so much faster.  Yes, the wait in the hot sun made the pizza taste so much better when it was served, and at that moment, when I bit into the pizza, I proclaimed right away that Grimaldis was better.  But it was a biased opinion, somewhat like saying experiences are always livelier and better under certain conditions.  True, but the best experiences should never have any bias.  It doesn't matter when or where, or how much fluff is below or above.  When something is good, there is no need to mask it.\n\nAnd yes, Lombardi's is better.  So much better.  The girls are right again...and this time, the guys actually agreed with us after we took them to Lombardis...well, except for the price at the latter.", "author": "Buggy Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-27", "description": "Service here really ruined the overall experience and the pizza just didn't make up for it.\n\nThe manager was incredibly rude to us as well as the other 2 parties waiting in line. After being seated we waited for 20 mins for our server. When he showed up he looked like he hated his job and life. \n\nThe pizza came out blazing fast but was nothing more than OK. A little too soggy for my liking and no real \"Wow!\" factor. \n\nWhatever made Grimaldi's famous is apparently lost.", "author": "Ben L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "The best pie of my life. The wait is too long and they really should offer cover from the sun but the bread, sauce, and toppings are all really good. Hot wait but I would do it again. Thank you!", "author": "Tracy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-10", "description": "It's my first trip to NYC. My flight was diverted for four hours in DC. I tell the taxi driver at the airport to take me and my lady to Grimaldi's.\n\nUpon arrival there was a line three storefronts down.  It took around thirty minutes to be seated.  I didn't do enough research. I did not know Grimaldi's does not sell pizza by the slice. No problem though because I'm starving! It's cafeteria style/community seating....the kind where you are practically bumping elbows with the couple next to you. Also, you may be sharing the red pepper shaker with your neighbors. It's small inside, but the place has a lot of character. It has a lot of photographs and art arranged in a disorderly manner that works.\n\nWe order half pepperoni/half sausage with garlic and basil all over. We don't mess around, we ordered the large!  It came out pretty quick. I noticed from the first bite they use fresh mozzarella balls for their cheese which is awesome. The garlic and basil was a nice touch.  I could have used a little more basil. The coal oven crust was nice and crispy.  Despite being a deep dish lover, I can appreciate this thin crust New York classic. I washed it down with a cold bottle of Brooklyn Brewery's Lager. Perfect pairing.\n\nOur waiter could have paid us more attention. We were not offered dessert. I would probably come here again. If I lived in town I would definitely grab a pie to go.\n\nFYI this place is CASH ONLY.", "author": "Phil X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-31", "description": "Best pizza I've had in a long time.  On a trip to New York and wanted an authentic New York pizza.  We were not disappointed.  Ordered a large white pizza and large pepperoni for the family.  The crust was thin and perfectly done with with a little char.  The pepperoni we smaller, but thicker and more flavorful than any I've had before.  We ordered takeout and walked over to pebble beach for sunset. Overall a great New York experience!", "author": "Laura S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-01", "description": "The line is always SUPER long to place an order, the same can be said for the wait time for the pizza to be made. Sometimes the pizza crust can be a little burned, which isn't the best taste ever, but when its perfectly made, this pizza tastes like HEAVEN!!!!", "author": "Kelly D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-18", "description": "Amazing pizza, true New York style! (Don't get fooled by the pizza places on every corner that reheat pre-made slices.) The line is really just part of the experience, and if you've got just 2 people in your party you can zip to the front more quickly when they call for the next party of 2. Even so, I went on a Saturday at 7pm in a group of 3 and we only waited about 30-40 minutes and met some friendly people in line.\n\nDine in or take it to go and head down to the pier on the East river to see the view of Manhattan. (Ten times better at night, and if you go to the left side instead of straight, there are usually fewer people and a slightly better view!)", "author": "Bob Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-28", "description": "Pizza had fresh ingredients and was not greasy at all.  Love the thin crust.  Only issue was the Frank Sinatra burnout who was taking down the number of your party outside.  We told him we were ordering take out outside but he ignored that and set up a table anyway and gave us a dirty look when we told him we were ordering take out.  Then we were asked to wait outside in the cold because he told us (with attitude) the waiters were all complaining we were in the way yet the waiters were moving past us without issue.. Even served me a water while I was waiting inside.  Oldblueeyespizzahost was completely rude and this is not the way to treat people who wait outside over an hour for pizza. This Frank Sinatra-stein makes me want to fly to the moon for pizza instead of Brooklyn for my pizza.", "author": "nicole h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-06", "description": "Waited at least 30+ minutes, but it was worth it. At first I wasn't sure how much I liked it until I tried to compare it against something else and there's nothing as fresh and moist as it is. I don't think it's my favorite and can be a bit pricey when adding all the toppings. Make sure to bring Cash and a nice pair of shoes to wait in line with!", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-21", "description": "We went in a group of 3 at around 3pm on a Sunday afternoon in early spring. We waited over 1 hour to get seating. Tip: You basically can cut the line if you have 2 people in your group, as the turn around for the two person seating is much quicker than any of the 3+ group tables. Just be sure to tell the man at the door that you have 2 in your group.\n\nFood: The pizza was good - better than Lombardi's in my opinion (but not worth the wait). We got 1 large pie with sausage, peppers, onions, and anchovies. The sausage was good, the peppers made the pizza watery, and the anchovies were ground up into the sauce - good, but pretty salty.\n\nBottom line: Good pizza if you are willing wait for it.", "author": "Jane K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-12", "description": "Upon further review, I feel like I want to place Grimaldi's just slightly ahead of Lombardi's, which has been my all time fav since '98.  Seriously on some other level of what a pie can be...just had Lombardi's in May, as well, so everything's fresh in my mind.\n\nThat being said, I suppose choosing one over the other is an exercise in futility - Grimaldi's crust is better, but Lombardi's still brings it with the sauce and toppings.  They should, by all rights, be forever tied as the two best pizza joints in the history of humankind's existence.\n\nAnyways, 5 stars is a no brainer here.", "author": "Bryan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-14", "description": "We waited in line for over an hour, and sure that's to be expected since it's Grimaldi's, but if I'm going to wait that long for food, it better be damn good.\n\nWell, it wasn't.  Alas.\n\nWe ordered a small, with onions, basil, and sun-dried tomatoes.  Service was exceptionally quick (add a star there!), which impressed me considering how packed that place was.  The decor was simple and appropriate - red and white checkered tablecloths, Frank Sinatra photos on the walls, Frank Sinatra music on the speakers.  \n\nThe pizza, however, didn't blow my mind.  The middle part was soggy and flimsy, there was too much sauce, and all in all, it tasted like a standard slice of brick oven pizza.  Nothing spectacular.  I was really looking forward to it too, because this place seems like one of those New York institutions, you know?  Perhaps there's still always a long line here because the place has already established itself, and its name is enough to attract crowds.\n\nI thought the pizza was just kind of whatever.  Good, but nothing to write home about.  \n\nStill, a coupla stars for the super quick and efficient service, for the decor, and for being just decent.  \n\nNot great, not bad.  It was just...pizza.", "author": "Vivian C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}