{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-01", "description": "Pretty good pizza! The ingredients were really fresh (basil, mozzarella) and the pizza just had good flavor overall. That being said, thin crust pizza i've had in Chicago is better ;) Ok, now that i've gotten that controversy out of the way. Yes, we waited in line but I didn't mind it so much since the line moved rather quickly. \n\nOnce inside we were seated next to a group of guys that probably made the whole trip THAT much better for me. These guys had the accent you expect to hear in Brooklyn (blame the media!) and I was happy to be sitting close enough to be in on the conversation (and by in I mean eavesdropping). \n\nOnce I stopped focusing on them (ok, when they left) I was able to look around and see people from all over and really take in the energy of the place. I can why people come here and why a short wait in line is definitely worth it.", "author": "Rhonda G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-23", "description": "My boyfriend and I went on a muggy, kind of rainy Sunday, so we only waited in line for a couple minutes, but I can imagine it would be VERY busy on a better day. When I first read about this place, it sounded as if you would walk right into it after coming off the Brooklyn Bridge, but that's not really the case. We did walk the bridge beforehand, so from the end, it only took us about 10-15 minutes to get here. The pizza was so fresh and was decently priced at $14 for a large (8 slices). We got two cannoli's to go, which were some of the best I've ever had. Everyone that works here is really nice and it's in a great area. Definitely a must visit and I will be back!", "author": "Lainey J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-19", "description": "The pizza is great.  The people are annoying.  We sat at the bar and the people next to us gave small tips.  The waiter audibly scoffed when collecting the money.  I don't need that.  Also my water glass was never filled and that's also annoying.  Use this place for take out. If you have the courage to wait in the line for it. Yum", "author": "Scott P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "Good cheese :) Love it!\n\nOnly problem: Be prepare for a long wait. We came here at 3pm thinking we could have less wait time, but we still waited for 1hour under freezing temperature.", "author": "Joseph F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-29", "description": "Yeah, I did it.  I stood in line for 40 minutes to get into Grimaldi's.  I slurped down half a large pizza with pepperoni and mushrooms, then ordered a second.  And I am not ashamed.\n\nExpect a wait, but I'm not telling you anything you haven't heard before.", "author": "Bria D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-13", "description": "The. Best. Pizza. Ever.  I cannot even begin to tell you how good this pizza is.  Yes there's a long wait (at least 30 minutes) and yes, there is a line, and no, there isn't AC, BUT it's totally worth it.\n\nI usually like thin crust pizza, but I'll always make an exception fort this place.  The crust is this great doughy creation and the ingredients on their pizzas are super fresh.  Sadly it's cash only and you can only order pies (no slices), but definitely the place to go to if you're visiting Manhattan.  It doesn't matter what the potential commute will be for you to get there, everyone has to experience the amazing pizza of Grimaldi's.", "author": "Ruth A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-11", "description": "Crust was chewy, sauce is good. Fresh mozzarella. Went on s recommendation with no wait. Still cannot beat new haven pizza and Pepe's and modern.", "author": "Tony L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-06", "description": "Walked across the brooklyn bridge in 20 degree weather, just to go try this spot. and as soon as we got there, the smell coming from the kitchen alone woulda been enuff. We orderd a large pizza with pepperoni, sausage,onions,mushrooms, and it was probably the perfect pizza. everything blended so well, the cheese, the sauce, the meats, the crust..Grimaldi's you have made me a fan. i will be back soon.", "author": "Jay M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-22", "description": "If you want some absolutely fantastic brick oven pizza, this is the place to go. Pizzas are only sold whole (no slices), but you and a friend will have little trouble finishing a pizza between you. There's often a line outside, but there's plenty of seating and the line moves quickly. It's also cash only, so keep that in mind (there's an ATM inside if in all your pre-pizza excitement, you forget).", "author": "Jessica C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "Had what looked like their Margherita Pizza.  It really was very very good.  Being coal brick oven, it did have a \"different\" flavor than a regular brick oven.  I definitely would come back again.  I thoroughly enjoyed it. Pizza is sold by the pie, not the slice.....", "author": "Dorothy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-10", "description": "Before this place moved (and it's still excellent after it moved) this place was bliss. I used to have weekly meetings in the Brooklyn Navy Yard and we would get takeout from here all the time, I can't express how much I love this pizza, I've often said this place is the \"baseline for what NY pizza should be.\"\n\nManhattan has some great spots but Brooklyn pizza wins and it starts with Grimaldi's. If there is any negative it's the long, hour+, wait that extends down the block, because of this I usually go to lesser known places that are about as good.", "author": "Justin F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-04", "description": "It's okay. I respect the history behind this establishment but the long lines I don't understand at all.  Anyways,  the pizza was okay. My gripe is that it was too soggy. I've had better. It's all preference - there is no best.", "author": "Will K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-29", "description": "Overly hyped!! Pizza was good but not great. As far as the service goes, it was non-existent! Very rude and arrogant staff! Thank goodness we were able to walk up \u0026 get seated right away or else I would have been upset to waste my time for such a bland experience!", "author": "Vanessa L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-31", "description": "Only good thing about this pizza is the fresh mozzarella cheese.\nToppings... ok.\nCrust... ok.\nService... ok.\nAtmosphere - guess a bit historical which is kind of cool, but other than that, the pizza is overall A-OK.", "author": "Cindy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-29", "description": "It was my first visit to New York and i wanted to get a slice of pizza everyday that I was there....the first two days i had regular slices from hole in the walls and i wasnt impressed...they say its something about the water that makes NY pizza unforgetably different....sooo far, MEHHH!!!!\n\nHowever, i was told that Grimaldi's Pizza would change your life's perspective on Pizza...whenever i hear $h*et like that, i automatically think BSSSSSS!!!!!!....well its not jes my friend's friend thought, when we got to the store front there was like 50 other pplz standing in line at 3pm on a saturday afternoon who also thought this pizza was UNGODLY!!!!!\n\nafter an hour wait we go in and order our two large Brooklyn Pies b/w 3 guys....one pizza we did sasuage and ham, and the other we picked red roasted peppers, olives, and mushrooms....\n\nupon the first bite of the pizza...after all that hype and one 1.5 hr wait, my feelings of this place was 'LEGIT'!!!!!! we dusted both pizzas .... but its OK, we were planning on walking through the brooklyn bridge afterwards to digest some of those calories...\n\nIt wasnt like the pizza had an entirely different taste that made it exceptional...i think its just everything about this pizza was slightly better in each angle of criticism....like the crest had a good bite to it, toppings are fresh and simple, good amount of cheese and sauce just made this the best NY style slice i've ever had, hands down!!!!\n\nthe life changing perspective was a huge overstatement though!!!!!!", "author": "Sam C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-15", "description": "Decided to come here because I heard that Grimaldi's was going to close soon. Pizza was Awesome!! Unlike the other yelpers, I didn't have to wait online for an hour. It only took like 10 minutes. Came here on a Tuesday during the afternoon. \n\nOrdered: Large Pizza ($14) with Sausage ($2) and Extra Tomato Sauce ($2) \nTasted really good with the extra tomato sauce!! Simply yummy. I like the fact that they added basil leaves onto the pizza - it gave the pizza a great taste.\n\nCons:\n- service was kind of slow (in terms of the waiters - it took them a while before they came over to take our order and to give us the bill but I guess they got their hands full)\n- seats were kind of cramped in there\n- AC was too strong but hey its a pizza place so it's bound to be really hot in there without AC (I should have brought a cardigan with me)", "author": "Teresa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-31", "description": "Grimaldi's pizza was delicious. This pizza reminded me of the fresh pizza I had when I studied abroad in Florence. The fresh mozzarella cheese and thin crust is the best part. The best decision we made was calling ahead and ordering our pizza via telephone. When we called to order they told us it would be a 15 minute wait. By the time we got to Grimaldi's our pizzas were ready to go and we were able to bypass the long line outside. We took out pizzas to pebble beach and enjoyed them overlooking the New York skyline and Brooklyn bridge. The red pizza with sausage and pepperoni was my favorite. Overall an AMAZING experience.", "author": "Karen R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-26", "description": "Very, very good coal brick-oven pizza! Pizza comes out quickly and is incredibly fresh. They also use good quality sausage! It's not the best pizza I've had in New York, but very much worth a try. \n\nSome notes: They don't deliver, accept credit cards, take reservations, or sell slices.  The small pizza (6 slices) was the perfect amount for two people.", "author": "James K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-30", "description": "Our thin crust pizza with sausage \u0026 garlic had large fresh mozzarella pieces, bits of garlic and bland tasteless sausage pieces.\nThe crust was disappointingly soggy on the bottom.  All the hype and wait for just below average pizza.", "author": "J Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-15", "description": "I heard this was the best pizzeria in NYC.  It's not anything fancy, just a hole-in-the-wall kinda place.  It's pretty cramped in there.  You pretty much don't have any other choice but to be sitting shoulder to shoulder with stranger(s).  The staff is friendly, but due to the restaurant being so busy, you won't get as much attentive service that you normally would at a sit down restaurant.  \n\nHOWEVER, the pizza definitely makes up for it.  I don't consider myself a pizzaholic by any means, but from my experiences, this was the best pizza I've tasted thus far in my life.  YUMMMM.", "author": "Kaimana S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}