{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-10", "description": "Came here with some friends after some high praise from my east coast brethren.  \n\nLet me caveat this by saying I'm a huge fan of New York style pizza. I live in Chicago and we have some good options but New York thin crust hard to come by. \n\nWe went with a rather large party of 8 on a weekend so the line as expected was looong. Out the door to the street so expect to wait. As we got close to the door we were greeted with a rude 'I don't know' when we asked how much longer.  \n\nFinally we got seated and the waiter we had was not very kind either. Taking long to come and then looking at us weird when we asked questions about the different pizzas. It seemed like they had no time for us.  Then when the pizzas came out they put them on the stands and walked away. Never came back until we pulled them for the check.  Maybe the attitude is intentional here?\n\nService aside, the pizza was OK.  I've had better in smaller mom and pop shops in Chicago and even some places in Manhattan. \n\nNot worth the wait in my opinion !", "author": "Sarfraz K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-09", "description": "Grimaldi's has the best pizza I've ever tasted. \nThe crust is perfect, light and crisp with just the right bit of its own flavor. The sauce is beautiful and the toppings are baked to perfection. \n\nThis is my favorite NY pizza and worth the wait. \nI've personally enjoyed the pizza out of the Hoboken storefront a little more but Dumbo is more convenient for most people.", "author": "Christi O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-28", "description": "Get your tourist thrill on (even if you live in NYC) \n\nThis place has been around forever and I used take visitors here all the time. Well . . . that was back when the restaurant was in the place where Juliana's now resides. I am glad that the overall formula for the pizza has not changed over the years. You will not be disappointed with the pizza; however, the pizza is not that great to wait in a line for more than 30 minutes. There are way too many places in NYC to enjoy a nice pie. \n\nUpon my recent visit, I have not been here in about 6 years, a few things annoyed me. \n1) The plasticware and paper plates. Come On!!! You mean to tell me that you cannot get real plates and silverware? Cutting the pizza with a plastic knife feels like sawing logs. I probably logged in an extra 300 steps with my Fitbit trying to cut the pizza. \n\n2) This is (and always has been) cash only restaurant and the restaurant does have an ATM on the premises. But, the ATM charges a $4.99 transaction fee. I've never seen such a high transaction fee, even at the most shady bodega ATMs. \n\n3) Really, no wine or beer? Most people will shell out a couple of bucks for a glass (or two) of wine to consume with their pizza. \n\nAll in all, you should come here if you REALLY want to but you do not need to make a special trip out here.", "author": "Kwame S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "Family friendly and super cozy. The pizza is tasteful but a tad bit overpriced if you're a Brooklyn local. It's definitely a tourist spot that's for sure !!! \nIf you wanna go out with a few friends and get a brick oven slice, this is the spot. But just to let you know the lines are long and the wait is crazy!!!", "author": "Soraya T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-04", "description": "Came here after Julianna closed at 10 p.m on a Saturday night. This is opened until midnight and there was still a line, although it was a lot shorter. \n\nThe pizza was honestly just 'ok'. It's like your typical pizza. I found it to be a little bland and had to add hot peppers and garlic which made it taste a little better. But it was pretty cheap around $14 a pie. \n\n*Cash only, no slices*", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-24", "description": "great pizza but the guy at the front door ruins this place. customer service is dead - i have never in my life heard a host speak to people this way", "author": "Tina B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-29", "description": "One of the most popular in NY but not the best.\n\nLocated right over the Brooklyn Bridge, good walk back if you want to walk off the pizza.\n\nTourist trap, so expect lines. Off meal times are better for quicker seating.\n\nOld school looking pizza joint. Service was fast. Cash only. \n\nLarge Pizza w/ Mushrooms - $14 + $2 - Good thin crust, just needed to be a little more crispy. Tomato sauce was fresh and simple. Good amount of mozzarella. Not much mushroom was added and they did not spread it out evenly. Some had a bunch and some had none. Those little things matter in a good slice.\n\nGood price and good spot to visit if you like touristy places but you can find better.", "author": "Kevin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Very delicious pizza, will not be disappointed! Service and staff are very friendly definitely worth giving a try out in Brooklyn!!", "author": "Ava C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-19", "description": "Kinda disappointed... brought my parents here because they said it's one of the oldest pizzeria in nyc... wait for half hour in the line and when we got inside... it's just feel like you walked into a random pizze shop. Nothing special. Food, service and environment are below average standard. Probably won't come again. Just not worth the time waiting in the line for an average pizza.", "author": "June C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-03", "description": "Overhyped pizza for sure. The crust was soggy. Even after extra mozzarella and basil, there was nothing on the pizza. It was very tasteless. Avoid this place at all costs if you are looking for a true new york style pizza.", "author": "Lovereen K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-19", "description": "Rude and condescending servers. I ordered a pizza to go because the woman taking the takeout order told me the wait would be 30 mins. That was a total mistake, the wait is way more than 1 hour. And had I stayed in line to dine inside, I would have finished by the time the takeout was ready. \n\nWorst of all, when I went inside to inquire about my order, the door man rudely \"ordered\" me to wait outside. What? Why? Am I not allowed to go in even to use the restroom? Then I saw somebody who cam after me had got their order. When I asked, the man said they were here before you and they left and came back. Then he began to rant about how busy they are and they made 1000 pies a day. I don't care how many pies you made, as that's your business. But for sure you don't know customer service and you are bad at time management. Will never be back.", "author": "Simon T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-19", "description": "I came here with very high expectations. Maybe it's because my friend and I were a spillover from the long wait of next door. \nOverall the pizza was good. We had a sausage, mox, sweet peppers and black olives.\nThe crust felt a bit thicker and moist. Because of the moisture, it couldn't hold its weight very well. Still gobbled it New Yorker style - fold! The sauce was not special. The sweet peppers were very good. The mox tasted pretty fresh. The service was good. No wait and staff friendly. \nI'd go back... but with much lower foodie expectations.", "author": "Retta C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-26", "description": "I'll give them four stars for the pizza, but no higher than two stars for the service. Everyone we interacted with was brusque or rude. We just wanted to take a pizza to go, but were stopped at the door and made to wait outside like everyone else who was actually waiting for a seat, which I also didn't understand because on entering the restaurant there were plenty of seats available.\n\nPerhaps it was our fault for arriving during the shift change, but all of the workers seemed more concerned with their Mexican take-out order - which had just arrived - than how quickly they were getting pizzas out to their customers. It took us 10 minutes of hovering at the pizza station for someone to notice us and take our order.\n\nWe ordered a 6 slice regular pizza with no additional toppings, which came out to $15. Perfectly reasonable for a whole pie and quite tasty when fresh out of the oven. They use fresh ingredients, but how generously topped your pie turns out is really up to the discretion of the pizza maker at the time, and unfortunately, we got one of the stingy ones. The flavors were enhanced by the brick oven baking, but I don't know if I would ever go out of my way just to come here for pizza. It is not that good.\n\nHonestly, if you want a good slice, go next door to Juliana's. Their ratings are higher, their reviews are better, and hopefully you can get better sit down service there.", "author": "Sherry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-05", "description": "Recommend by a tour guide that lives in Brooklyn, and did not disappoint. Pizza was delicious.", "author": "Craig V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-07", "description": "Amazing Pizza! The line was actually not that long waited 10-15 minutes but literally orgasmic pizza. Right next to Grimaldi's is Juliana's Pizza and it feels like they're competing for the same crowd - WHO WILL GETT MORE CUSTOMERS!\n\nIn terms of Pizza I would recommend getting a small for 2 people - their small pizza still has 8 solid slices and is as big as a medium pizza at any other place. For toppings get the marinara sauce (red sauce FOR SUREEEE) with jalapenos, onions, and sausage.\n\nThe sausages melt in your mouth along with the fresh mozzarella - food coma in the making!\n\nThe price was very reasonable it came to around $15-18 bucks for the both of us!\n\nAfter lunch go to the park 1 block away and enjoy the waterfront.", "author": "Kunal T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "The pizza is DELICIOUS! The hospitality is great. It was super busy, but they were able to get us seated right away and the pizza came out fast. The only draw back? NO ALCOHOL! I think there was an issue getting their liquor license so they don't sell any beer, wine or hard alcohol and most of the bars in Brooklyn don't open up until after 5 so that was a bummer. Definitely worth the visit for the pizza though! Beats most of the places in the city.", "author": "Ashveen S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-04", "description": "My friend and I went here for a late afternoon meal. They didn't sell slices so we ordered a small pepperoni, mushroom and extra mozzarella cheese pizza(came with 6 slices). I liked that the pizza was thin crust. The pizza was good but I thought it didn't have enough cheese even though we asked for extra mozzarella. Also, I thought the pizza had a tad too much tomato sauce. Otherwise, it was a good NYC pizzeria.", "author": "Edster W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "My boyfriend loves pizza and every time we are in the Dumbo area he wants to try Grimaldi's but the line is always long. So we never get the chance. \n\nWe were in the Dumbo are on a Wednesday around 3pm and guess what? No line! We were seated right away. \n\nWe ordered a large pie. Half pepperoni and half cheese. Before eating I was thinking this place is probably over rated but I was wrong. It was the best pizza I have ever had! The oven that they make the pizza in makes it nice and crispy, the sauce was tasty and the cheese thick and delicious.", "author": "Ashley T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-17", "description": "Yuuummmm. Walked in on a Tuesday night at around 8:30-9pm last week after reading about this place. We had high hopes and there was no line. Ordered a 1/2 tomato, 1/2 white small pizza (3 large slices each). We ate the whole thing, it was delicious. We got it with extra garlic and salt cured black olives. The olives were WAY TOO SALTY - avoid! Otherwise, perfection. The service was efficient. *CASH ONLY*", "author": "Tamara H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-30", "description": "Very good pie, good flavor, fresh ingredients, excellent crispy dough, and wonderful sauce and fresh mozzarella cheese. Only draw why don't give 5 stars: they sell no beer to enjoy such a good pizza. Canolis are good and ice cream is veeeery good (great option to close).", "author": "Armando P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}