{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-21", "description": "Hands down my favorite pizza in Brooklyn, and my favorite pizza overall (other than Prince St Pizza's and Artichoke's Sicilian slices). The only downside is that you can't order by the slice, but to me, that just means I can either eat all of it at once or enjoy some later.\n\nI think it's cash only, but they do have ATMs inside. There's even one on the second floor.\n\nIt can get crowded, but even then I haven't really waited for a seat since they have multiple floors. Definitely a must-try if you're visiting NY or even if you live here and haven't been.", "author": "Dylan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-17", "description": "I really LOVE pizza. When I first time came to NYC, most of my friends recommend Grimaldi's  to me. After I tried their pizza I need to say it was really delicious. This place has too much followers, so I really recommend you come here in the weekday.", "author": "Season L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-08", "description": "Hands down the best pizza in New York. You also have to try the desserts. The cannoli is the best I've ever had.", "author": "Arno M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-30", "description": "Ask any New Yorker and they'll tell you the best pizza in the world comes from New York City, the best pizza in New York City comes from Brooklyn and I would say the best pizza in Brooklyn comes from Grimaldi's . The crust, the cheese, the sauce. You really can't get pizza any better than this. They don't sell slices and they only take cash but for $12 you can get a cheese and basil pie that's enough to fill two people. Grimaldi's for the win.", "author": "Dori D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-01", "description": "I am giving a one star just because the pizza was good. I have experienced the WORST customer service ever and I will never come back to this place again. I was with my family walking the bridge all the way from Manhattan side to Brooklyn with three of our carry-on size luggages. We had to bring them because we had to head to the airport right after. After waiting in line for about 15mins, a greeter told us to go upstairs cus the table was ready, so we did. The space was pretty small between tables and our family did not wanna block other customers' way with our luggages so I kindly asked the server where I should put the luggages that we had with us. \n\nThe server suddenly got extremely frustrated and upset that we brought our luggages and told us WHY WE BROUGHT OUR LUGGAGES AND WE SHOULD HAVE LEFT THEM AT A HOTEL BECAUSE THERE IS NO SPACE (There was plenty of extra spaces elsewhere. We wouldn't have come to this place if the greeter told us luggages are not welcomed). I told him we didn't have a place to leave them, and he laughed with sarcasm saying \"ha, no hotel\". I felt like I got insulted and the server's attitude was unacceptable. I told him we are leaving because of his attitude and the way he is treating his customer. He was like fine, whatever. Our family went downstairs and told the manager what happened. The manager was able to calm me down and apologized and kept our luggages in their closet and offered another table on the first floor. The manager checked with us frequently while we were there which I appreciated, but that server never came down to apologize. He just ruined our family's entire last day of NY trip and I will never ever recommend my friends to go there.", "author": "Eunsol K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-29", "description": "WARNING: Do not raise your hand in this place. They consider it \"rude\" or \"not nice.\" Check out my friend's (Elica N.) review.\n\nWas it worth the trek from Manhattan to this joint? Probably not but if you've never been then maaaybe give it a try. I actually prefer Lombardi's over this place as I'm sure most others do. It's right under the Brooklyn Bridge. Make sure you keep a lookout or you might just miss it. Oh yeah, major traffic jam for the bathroom. ONE bathroom for both men and women!\n\nThis place is just one big open space and you can actually watch the people make your pizza. Luckily, we came at a good time. By the time we got our pizza, there was this long line going down Fulton. The wait probably isn't too bad as diners are in and out of this place within 30 minutes or so.\n\nThe pizza was decent. I actually liked the crust better than Lombardi's. It had this oven-cooked taste to it which gave it this slightly burnt flavor to it. The cheese was a little rubbery and the toppings weren't all that great. We ordered sausage all around and half of mushroom. Only saw little samplings of the mushroom sprinkled on the half. I couldn't even taste it! My friends were complaining that parts of their pizza was cold. It also seems like they like to serve water with NO ice. Ick.\n\nI came merely for the experience and to compare this place to Lombardi's. Without a doubt, Lombardi's comes out on top. Would I recommend this place to friends? Probably not.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-23", "description": "It was pretty good and I'd go again if I had friends from out-of-town and wanted to see what this Brooklyn pizza is all about. We waited for an hour in line in the middle of the afternoon, so I could only imagine what the wait was during lunch/dinner! There is water outside though, which is nice of them.\n\nWe got half with garlic and mushroom, and half with ricotta cheese and sundried tomatoes. Both were great the first few bites, but it got cold pretty quickly (maybe because it's thin?) and I personally think the utility I get from cold pizza is dramatically less than what I get from hot pizza. I wasn't a huge fan of the crust, and the pizza was pretty oily. My cousin said the oiliness is usually from the cheese, when the cheese is old... I don't know how true that is, especially since I assume this place goes through cheese really quickly.\n\nIt's a hectic but friendly atmosphere (some guy struck up a conversation with me in the bathroom line). You definitely feel a little rushed, especially if you have a heart and know that there are people out there waiting, like you did, for more than an hour. And I hate being rushed.", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-07", "description": "Hands down best pizza I've had in NY and my friends agree.\nThe sauce was so delightful, the mozzarella and basil were very fresh and good quality. The pizza itself is thin with a delicious chewy crust. One pie fed 3 of us just barely enough. I also got a cannoli which really should have been shared but it was so delicious I ate the entire thing.\n\nI came here for a dinner (around 8:30pm) on a random week day so there was no line and wait time was only about 5 minutes.\n\nOh and some of the waiters are multilingual- I overheard a waiter speaking french, italian, and spanish to different customers!!", "author": "Yumi M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "I came here on a Sunday night, at around 8:30. As expected, the line was long, but it moved fast. The guy manning the line was polite and efficient. I ordered my pizza by 9, and took my first bite by 9:30. \n\nThe crust-cheese-sauce ratio is perfect. I prefer my pizza crust on the crunchy side, but was pleased with this chewier breading too. The dough had a lovely, intentional burnt flavor that worked well with the cheese and toppings. (I ordered the Italian sausage topping.) The sauce and the toppings were fresh -- you could literally taste every spice used. But I especially loved how little oil was used on the pizza -- other pizza shops tend to pile on the grease to compensate for the lack of flavor/freshness. Clearly not needed in this case.\n\nA \"small\" pizza (6 slices) with one topping cost me $17.50. Also, keep in mind that this shop is cash only. There's an ATM machine at another restaurant around the corner.\n\nGrimaldi's is definitely worth the wait. I wouldn't come here regularly, because, well, I live in Manhattan and can put that $17.50 to better use.", "author": "Alysha R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "During a recent trip to NYC we decided to walk the Brooklyn Bridge. The plan was to stop at Grimaldis for lunch and head over to Brooklyn Ice Cream Factory after. I was warned there WOULD be a line, however I was not prepared for the length of the line when we finally got there. It was well past the neighboring pizza joint and after about ten minutes I was seriously considering just skipping the pizza part of the afternoon. I committed myself to that line and after about 40 minutes we were seated. \n\nDrink orders were promptly taken and by the time the server came back we were ready to order. We ordered a basic medium pepperoni and mushroom pizza. I wish we ordered a large! It took about 20-25 minutes. The pizza was good, a little undercooked in the middle...sighhhh. Still, I wish we ordered a large! ;-)\n\nNo alcohol and cash only. Pizza was good, not sure I would wait 40+ minutes in the hot sun again good.", "author": "Tammy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-24", "description": "I just ate here for the first time a few weeks ago around 4:30pm. There was a line but we only waited about 20-30 minutes. Not bad. They had paper plates and plastic silverware which I thought was kinda funny. The pizza was fantastic, actually the best I had while visiting New York. The service was terrible and they don't serve beer and wine - another bummer. I could have used a nice cold beer. They do add gratuity to your order even when it's only a party of two. Probably why the service was so bad, they don't have to be nice for a tip. I will go back again but just for the pizza.", "author": "Jessica R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "Can't believe I never reviewed this place! After living in NY and eating numerous pizzas, this is my favorite pizza place. Yes, it is touristy, but not one of those touristy let downs.Pizza is amazing here. It's all about the thin crust and sauce here. They also moved down the street, so the space is a lot bigger now. Try to get here early, because the lines get pretty long. Also, let them know you're willing to sit at the bar, you'll get seated faster. Plus, this place is next to the Brooklyn Bridge, so you can walk it off into Manhattan. Note, this is cash only. Enjoy!", "author": "Lisa T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-08", "description": "I expect a lot from my pizza, especially in BK. The pizza was nothing special and the sauce tasted like tomato juice....no seasoning at all. I get that this place us famous and The antipasto was not worth it, the bread was too hard and the salami wasn't of high quality. The mozzarella was dry, but the olives were tasty. Also, their alcohol license is pending (has been for a while). \n\nI was lucky to not wait in line, but typically there are many tourists in line. NOT worth the wait.\n\nIf you like bland sauce on top of your pizza, no bar, and waiting for mediocre pizza, then this is your place. Really, grab a slice from Fascati's down the street, or there are a few other pizza places very close to try as well.", "author": "Sara W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-03", "description": "This was our first stop in New York.  I told my friend I wanted pizza and she said she heard great reviews about this place.  She said there is usually a line outside but when we arrived on a Thursday afternoon we were seated immediately.  We started with some tasty breadsticks and mixed some oil and vinegar to dip. Then our pizza... The crust was crispy and the sauce and cheese were fresh and delicious.  We topped our pizza with mushrooms and garlic and that made it even better! We will definitely stop by the next time we visit New York!", "author": "Jessica P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "This is a great place to eat if your in Brooklyn. I love their pizza, coal fired oven. There is always a wait, which you would expect with good food. Make sure to bring cash. Get the pepperoni pizza, yummy!", "author": "Jim M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-21", "description": "If you have to wait more than 1 hr for this place, then it's NOT WORTH IT! It's good, but jeez, not THAT good. If you're worried that you might not be able to finish a whole pie (since they don't sell slices), all you need is one other hungry friend to join you. Their smallest pie is definitely doable with two people. \n\nWhat I didn't like about it is that you have to pay for every topping. Sometimes I wished they would just have ONE pie that's a flat price and you can have ANYTHING and EVERYTHING you want on it. I'm not usually a crust person, but their crusts are pretty good, especially if you ask for some oil and vinegar and, voila, you've got Italian bread. Lastly, don't forget to enjoy the view of the Brooklyn bridge while you're there.", "author": "Rose W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-19", "description": "If I were rating this place on the pizza alone, I'd probably give it four stars. \n\nI'm not usually a fan of pizza, I really have to be in the mood. The white pizza was quite tasty, so I made an exception. My friends really love this place, but they also like pizza much more than me. There is a wide selection of toppings and types of pizzas which is always a plus. \n\nThe service stood out in particular, but not necessarily in a good way. The waiter gave my friend a soda even though he didn't order one and charged him anyway. I don't know about you, but I'm not really a fan of sneaky stuff like that. \n\nAnyway, if you love pizza, it won't be a waste of time.", "author": "Amanda L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-18", "description": "Really bad experience overall, huge line outside but when you get in there's at least 10 empty tables, plastic cutlery and plates, boiling hot inside and no AC and to top it all the pizza was average at best!! Low quality mozarella, mediocre dough and no flavour at all !! Go anywhere else you'll be better off", "author": "Leyla J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "We only waited for about 25 minutes for Friday night dinner -- not bad at all. The place is under the shadow of the Brooklyn Bridge, and charmingly New-York in every way, from the chatty servers to the checkered tablecloths. Most importantly, the pizza was worth the wait. The crust was maybe the best I've had so far in NYC, somehow both chewy and light, a blank slate for the toppings, but also slightly salty and flavorful in its own right. The sauce and the cheese were also on point. The pepperoni, however, tasted a bit freezer-burnt or over-processed or something. Also, the cash only deal is a bit weird.\n\nAll in all, it's a place I'd enthusiastically suggest for guests, and maybe I'd grab a pie to go if I'm spending a day at Brooklyn Bridge Park, but it probably won't become one of my go-to's.", "author": "Amanda H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "I love this place ! Great sauce and pizza! Only bad thing is no reservations and can be busy !", "author": "Nely M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}