{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-02", "description": "I am a fan of pizza in all shapes and sizes.  BJ's in LA, Zachary's in Berkeley, Gino's East in Chicago -- YUM.  But I think Grimaldi's tops them all.  To me, this place is the very embodiment of five stars.\n\nMy wife and I made the trek out to Brooklyn on a Saturday evening, taking the F to York and walking over to Old Fulton.  A thermometer on display informed us that it was 29 degrees and it was windy.  It was more than worth it.\n\nThe decor is perfect for the personality of the restaurant.  Picture frames of all shapes and sizes line the walls in an irregular arrangement, Sinatra and others are playing at a nice volume, and people are packed in and having a good time.\n\nWe ordered a large pizza ($14) with sausage (+$2), mushrooms (+$2), and garlic (+$2).  When the pizza came out, it was piping hot with steam rising off the surface from the fresh crushed tomato sauce.  I will now attempt to describe how perfect this pizza tastes.  The crust is thin and chewy and the sauce -- oh the sauce -- can only be described as perfect.  I'm not sure if it was because we added the garlic, but the flavor was just perfect.\n\nWe finished off dinner with a cappuccino and a canoli (delicious).  Our only regret was never trying this place sooner.  We've resolved to go back as often as possible.  Yum.", "author": "Simon Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-22", "description": "Substantially and completely the finest pizza in NYC.\n\nWe did a 2 borough test - Patsy's, Lombardi's, and Grimaldi's. Grimaldi's was the unanimous.\n\nSlightly salty crust, with the perfect balance of tomato sauce - medium basil and not too bitter tangy tomato acidity. Hints of bay leaf and oregano. \n\nDon't even bother with toppings - the fresh mozzarella is PRIMO.", "author": "Eric J. R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-11", "description": "Oh man...\n\nMy mouth is damn watery right now even though I am just writing a review!\n\nplain, white cheese pizza is awesome and the ones with the topping were also very good.\n\nDefinitely going back ASAP", "author": "William M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-10", "description": "Heard from a friend about this place. Decided to go for the hour wait to try this hyped pizza place, and I will say that the wait was worth it. The pizza was really delicious. You can tell that the ingredients are fresh and the brick oven really makes for a better pizza. The place was crowded, but the service was still pretty good. We got two regular pizzas with pepperoni, olives, mushrooms, and sausage. It's a little pricey but well worth it. I think next time I'd like to try the white pizza.", "author": "Andrew N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-01", "description": "With 949 reviews I'll leave the basics!\n\nCONS:\n- Always a long wait.\n- There is better pizza in more convenient locations.\n- You share a table with anyone and everyone from anywhere and everywhere. You also share their conversations, and this is not a choice.\n- It's cramped and crowded.\n- The pizza is okay at best.\n\nPROS:\n- You can say you ate at Grimaldi's.\n- In the summer, there is an ice cream stand close by. The ice cream is more worth the trip out there than the pizza.\n- Where you get the ice cream has a nice view.", "author": "Magan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-21", "description": "Nice place. Food is good. It's especially good as you're pretty famished standing in line to get in. It goes down pretty quickly though. Don't go waiting in line hungry.", "author": "Robert D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-30", "description": "By far the best pizza in New York!  It's an easy trek across the Brooklyn Bridge to get to Grimalidi's.  If you have room, check out the Brooklyn Ice Cream Fatory.\n\nI'm pretty excited since they're opening a location in the Financial District in Manhattan.   Hopefully the lines won't be as long.", "author": "Russ K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-01", "description": "Best pizza ever!  I came here one summer evening around 6pm, and was slightly irked to have to wait outside in line for over an hour and a half just to get inside.  That is until I tried the pizza.  Fresh ingredients (we got the pepperoni and basil), amazing thin crust, fresh melted mozzarella.  The pizza was so good that we ordered two extra pies to go!  You can count on this being the first place I go to eat when I go back to NY!", "author": "Keya M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-08", "description": "You know I was a little disappointed by this place. There is a lot of hype for Grimaldi's to be the best pizza in NYC, and i found this place to be just A-OK. I came here with a few friends from out of town, after hanging out in the Brooklyn Bridge park, we were lucky there was no line to get in the door. I found the service to not be up to par. \n\nFor the money you are paying, there are better places out there. Its great to do the touristy thing, but I wouldnt make this MY spot.", "author": "Alysia P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-08", "description": "Went here yesterday, no line..thank god! The pizza was alright..thin.. was expecting more flavor though. The service was good, not a long wait at all, seating wise..I think it's cramped up. The best part is definitely the view of Manhattan and the Brooklyn Bridge. Overall...I've had better pizza", "author": "Shivana P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-27", "description": "Folklore states that when Frank Sinatra made a pact with the devil it included that he have the voice of an angel and the ability to eat great pizza in a town that he loved.\n\nWhen you walk into this pizza heaven, you are transported back in time as if Old Blue Eyes himself was sitting on the other side of the pie. The room is filled with wonderful music and even better aromas that instantly make you hungry. The timeless atmosphere and perfect pizza makes your trip to Brooklyn well worth it.\n\nYou get to watch them make the pizza. Their detailed and precise movements give the impression of an artist at work. But this edible art packs a punch! The ingredients are fresh and well prepared. The sauce and thin crust are the foundation of this New York style pizza legend. Go try it for yourself. \n\nMy love affair with pizza began and ended here. I can only quote Sinatra and say, \"Our love affair will be such fun, We'll be the envy of everyone.\"", "author": "Marcos A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-30", "description": "This restaurant is too \"famous\" to care anything about customer service. Had to wait outside in the cold which was expected. Man came out to write down party numbers. Only 1-2 parties can be inside waiting at a time. When our party got to the door my 2 friends went inside as I went to walk inside the same man looked at me and said \"shut the door!\". My friend went on to say there r 3 of us, he looked back at me and said \"shut the door\". As the door shut I heard him say to my friend \"2?\". He had already written down 3 then she told him 3 and he still asked \"2?\"!!! As I continued to wait outside I got pushed into the wall by the door which led to me finding out that being pushed into the wall got something yellow on my white coat. Once we finally got seated waiter came to the table 4 times. Take order, bring drinks, bring food and bring check. Food was good sure but I waited tables through college and a restaurant is rated good from me based on customer service almost as much as whether the food is good. I would not go back to this place.", "author": "Laurel C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-30", "description": "Guys, lets face it: this place is way overhyped. What do I look for in a good Italian pizza? Thin crust, a touch of crispiness on the bottom. Fruitful fresh, hearty tomato sauce, nice spices, like oregano that you actually taste, quality cheese. How so they rate on these criteria? Chewy, rather thick crust, a little rubberlike. Tasteless, loveless tomato sauce. Cheap, (fake?) cheese. Pepperoni was good. So overall not too great. Certainly nothing special. And absolutely not worth an hour wait. Tastes are different, but this is my opinion: save the time.", "author": "Simon N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-31", "description": "I waited in line for 1 hour on Wednesday evening to get in!! The service was fast and I loved my food.. No-hassle place serving the awesomest American pizza.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-06", "description": "You don't get this style of pizza too much in the west coast.  At least, I haven't found one.  Tons of Mozzarella Cheese with Basil and Tomato as the base of the pizza. Thin and Crispy pizza dough.  The Train ride it self to the place from Airport cost more than the meal itself, but I felt it is worth the trip.  (Trip in and out of airport = $10, Train ride =$ 4.25.  Large Pizza for 2 to share ... $14 per person).  Services are great and quick.  Not a long wait since we went in before the crowd starts.  Noisy and a nice home feel Italian restaurant.  The large pizza may seem huge for 2, but my co-worker and I had no problem finish them.\n\nThe only reason it prevent me from giving it a 5 is that I recall the quality of the food was better in my last trip 5 years ago.  I still enjoyed the pizza very much, but the crust was a bit burned.  The drink was on bottle, so no refill.", "author": "Jimmy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-13", "description": "I have a freaking picture of this pizza up in my profile and my dumbass forgot to review this spot ;-).  Definitely in the top 10 pizzas I have ever had!  We went there last year on a quick stop in Brooklyn.  We had to wait outside for awhile because we got there right when they were about to restoke the oven with new coals.  We got inside and ordered 2 pizzas.  One cheese and one pepperoni.  I grubbed down like a mofo!  Good cheese, good pepperoni and a little basil on top.  Excellent pizza.  The best I ever had....nah...that goes to Totonnos....but still good and its a must stop if you are in Brooklyn.  As far as the pizza nazi outside......  He was extremely nice to us and kept us updated on how long it would be etc.  Dont F with him and wont F with you basically.  He even shook our hand and said thank you for coming on the way out so he cant be that bad right????", "author": "Tim S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-27", "description": "Terrible place i went in i was sick that day wanted to get some pizza because of their famous name and i tell you the place looked dirty the pizza was burned and the staff was one of the most rude staff  ive seen i would never return to this place if they called their self one of brooklyn best there not!", "author": "Jerry Corey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "Delicious food. Long wait. Grumpy staff.  Had a pizza to go with sausage, roasted peppers and mushrooms.  Fresh ingredients, excellent flavor, sliced mozzarella makes all the difference.  Ate with friends in the park since the line was 30 mins long.  Cash only.", "author": "Josh T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-08", "description": "Whether as a NY native, resident or visitor, the defining taste of pizza is Girmaldi's. We take our guests for a walk over the Brooklyn Bridge, pizza at Grimaldi's and a walk down the pier. One late night, CSI New York was shooting a scene across Grimaldi's and a woman came out of her apartment yelling at them because she needed to sleep and the lights were bothering her! A real NY moment.\n\nIt's best to come over at around 3p.m on a weekday or about 5 pm on a weeknight as in my experience there is less wait.", "author": "Lara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-01", "description": "This is the best of the \"traditional style\" pizzas available. It's thin, it's tasty, and it's got real mozzarella on it. It is only sold by the pie, so go there with an appetiet.\r\n\r\nTip: If you want to skip the wait on a long line, give Grimaldi's a call and order a pie to go and eat it on the dock down the street, while enjoying the best view of Manhattan. There is seating and prime people watching. You can also end your meal with an ice cream cone from the Brooklyn Ice Cream Factory (http://www.yelp.com/biz/wMoIGPBqCiPnzcI_JjyDcA).", "author": "Ben W."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}