{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-14", "description": "Wow, grimaldi's has hands down the BEST pizza I have ever eaten! The thin crust and savory ingredients makes the long line worth it! This particular joint is always jam packed with people with at least a 1.5 to 2 hour wait! It's just that good! Definitely a must eat when in the big apple!! I would choose this joint over John's on bleeker any day! \n\nGrimaldi's has several locations with a way shorter wait time; food is just as good", "author": "Brenda L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-06", "description": "Good pizza. Cash only. Lunch for 3 under $30-fast service and good pepperoni. Decor is not their concern and restrooms only seat one at a time (why bother labeling them men and women when the men's room has far less traffic)?", "author": "Susan A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-11", "description": "For a video review check it out here: https://www.youtube.com/watch?v=fSkUJPLWGyE\n\nGrimaldi's - a famous pizzeria located under the Brooklyn bridge at 1 Front Street. The line moved fairly quickly, but just know it can take some time to get in. We ordered a regular mozzarella pizza. It had a chewy crust that wasn't too greasy. A great tasting coal-fired brick oven pizza. Grimaldis actually handmakes the mozzarella themselves. Our pizza cost $16 for a whole pie. This pizzeria has over 100 years of brick oven history. To last that long really is a statement in itself. Even former NYC mayor Rudy Gulioni loves this place. Make sure you stop by here if you are in the city.", "author": "Vahid R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-22", "description": "If you expect the original style of Grimaldi's, you'd better forget that real quick. This place is nowhere near how it used to be, the way that made it famous. \n\nI went here on Saturday, November 14. \nThe only positive thing about it was we were given a table (for 2) as soon as we walked in, no waiting time. Problem is the tables are tiny \u0026 extremely close together. Having to get up \u0026 go to the bathroom, I had to walk sideways \u0026 drag my ass on the table next to me. I'm sure they were thrilled. \n\nI knew it was gonna be a horrible start to the night when I asked what beers they had, which they have NONE. What kind of \"upscale\" pizzeria has no beer or wine? I had to order a root beer. Closest I'd get.\n\nWe ordered the antipasto. Came on a white plastic plate (just like what was given for the pizza). It was anything but fresh. The mozz was previously frozen, hard, \u0026 dry. The salami was the Citterio kind you get from one of those presliced packages in a supermarket. Oh, \u0026 3 olives were thrown on, with a bland slice or two of tomato. Gross. \n\nNow to the pizza. I've had pizza from all over NYC AND Italy (where my family is). It's near impossible to get pizza here like I've had in Italy. I've had pretty good pizza here though. \n\nLet's get back to the Grimaldi's pizza. \nThis pizza was horrible. HORRIBLE. \nI asked if they had prosciutto as a topping, they didn't, as expected. Only American ham. So I got that with some ricotta that tasted old, frozen, just like the mozzarella was. The bottom of the dough was burnt. I mean black - burnt. The sauce tasted like it was store bought, Ragu-ish with a hint of tin can. Maybe Tutto Rosso, or some cheap brand. At least Red Pack would've been a step up. Only had 2 slices (my date too) \u0026 we couldn't bear to go on. \n\nTo top it all off, the wait-staff wasn't even Italian.  They were all Albanian, with nasty \"I don't even want to be here\" attitudes \u0026 rudely and loudly speaking Albanian that it made everyone cringe. \n\nDefinitely will not be revisiting this place. Stick to other spots that make really good pizza, like Lucali. Even though the hostess last time was snobby as hell, the pizza is worth it because the super friendly wait staff makes you feel at home.", "author": "Ootz C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-11", "description": "Classic thin crust pizza. It's hard to expand on over 3000 other reviews but just wanted to say how much we enjoyed it! We came on the Brooklyn Pizza Tour and our host told is that the cheese they use is such good quality you don't get that weird orange oil that you find on other pizzas. The 900 degree oven also allows for the rich flavors without burning the crust.", "author": "Craig Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-16", "description": "This place is crazy.... You have to wait in the line in front like for an hour... After that you would expect nice place with good air-condition  ( I am from Europe and I am not to crazy about too cool air condition! ) but it was HOT! Too hot... Restroom was a mess...\nPizza was really good but it doesn't worth all the mess around... I am not coming back...", "author": "Domi J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-20", "description": "The freshest tasting pizza I've ever had, the toppings in our pizza weren't overbaked and really flavorful. The thin crust  and the sauce complimented each other very well, long lines but soooo worth it!", "author": "Pooja T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-24", "description": "Service was completely rude. From the geezer outside yelling and perspective customers to form a line (look buddy your manhattan grimaldis location got seized by the state for tax evasion so you got bigger problems than if customers are in the most perfect straight line ever or not) all the way to the inattentive waiter. \n\nPizza was merely edible. \n\nShould have just picked up a frozen pizza from the duane reade.", "author": "Melissa J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-10", "description": "Tip- be prepared to wait in line for a veryyyy long time, even on a weeknight! \n\nVery fresh ingredients and the host looked like he could be Mr.Grimaldi! It adds kind of a fun authentic feel to the place. Pretty cool atmosphere and I can see why there was a 1 hour wait! The ingredients were very fresh and delicious! I ordered 16\" with garlic, mushrooms, and ham. We have a Grimaldi's in Dallas, TX and they taste ALMOST as good but without the wait so I probably won't be coming back next time I come to NY.", "author": "Minh N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-26", "description": "The best pizza you will ever taste. The line can be quite long but it moves fast. You will not be disappointed!", "author": "Elroy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-10", "description": "Fast and friendly service. The pizza wasn't incredibly amazing, but it was good. I would definitely come back for their pizza. I love their crust.\n\nThe line was long but it went by pretty fast. People just go in eat and leave. So don't be too worried when you see the long line. \n\nif you're new to NY, yes this is a must stop place to try their pizza.", "author": "Cherie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-26", "description": "Pizza is very good , place a litle overated I dint wait 30 mnts for a slice since in went on a weekday and a rainy day. Had to try it. Place very old school only takes cash, ATM fee us $4.99 wanted a slice but they only sell u small pies which makes sense since they always busy small pie is $14 which is more than enough for 2 people. I recomend this place if you in dumbo on a weekday , when there is no line and have cash remember . Place doesn't sell alcohol since they have a liquor lisence pending so expect a soda for $3.00 .", "author": "Jorge G T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-24", "description": "It was alright, pizza was not life changing. Slightly on the soggy side around the center though. Not sure why. \n3 dollar sodas and cash only too, bummer", "author": "G K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-21", "description": "When we got here at around noon today the line wasn't too long, so we decided to give Grimaldi's a shot. After around 8 to 10 minutes of waiting, a man came out to seat us. He had a somewhat rude attitude so that was not a good first impression of the place.\n\nWe waited for another 8 to 10 minutes ish after we were seated. The whole time the area around us was pretty empty while there was a growing long line outside, so I'm not sure if they are just artificially keeping the line long outside to make themselves look popular, or if they don't have enough workers to seat everyone as quickly as possible.\n\nWe ordered a small pizza with mushroom and sausage toppings, for $21. We waited around half an hour for the pizza to come. The pizza tasted pretty decent for $21 but I'm not sure it was as good as everyone hyped it up to be.\n\nWhen we asked for the bill, it ended up being $27. NYC tax should have been $1.86 but they charged us $2 for it. Then there was an extra $4 service charge (basically 19% of our order). This service charged wasn't stated to us up front, but maybe it was on the menu and we missed it.\n\nEither way, I'm not sure I'll come back to this place again, service wasn't too great, the food tasted good but didn't feel spectacular enough to warrant the usually long wait for this place, and I'm not too happy about the mandatory 19% service charge for service that was not anything to rave about.", "author": "H T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-24", "description": "You know that crazy long line always in front of Grimaldi's? Let me answer your question: no, it isn't worth it. It's only that long because of tourists hearing good things in old travel books about NY. But let me tell you this is NOT the same place. It's pizza, it's fine. It's hard to mess up pizza, but do yourself a favor and go somewhere with better food, service, and less of a wait.\nIt's nearing summer time so the extensive wait outside is soon to be less painful- so if you have time to kill I guess this is the place for you?", "author": "Lindsey W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-28", "description": "Amazing amazing amazing!!! The pizza was amazing! The service was awesome! Seriously going back whenever I'm in New York again. And definitely going to check out the Palm Beach location.", "author": "Brenda G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-29", "description": "Have visited this pizzeria for the first time and literally had the best pizza ever, even better than Italy. Ordered the large white pizza with 6 toppings sunken in mozzarella, was so damn tasty. The food was unquestionable, however the customer service truly sucks, one of the super rude Polish waiters added up $6 tips up front to our check for the B.S. service! The management needs to address this kind of issues.", "author": "Ali N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-18", "description": "So much hype for such an average pizza.  Waited in a long line for nothing.  They serve you on paper plates and plastic forks. The pizza is nothing special.  The toppings are scarce (except for olives) and you barely taste  the sauce. Crust was too charred. One pizza and 3 drinks (no alcohol ) was $50. They only accept cash. Service was horrible. They treat you as if they're doing you a favor. No smiles. The man directing you inside was basically ordering people around. Very rude. They just want to take your order as quickly as possible and that's it. I would not return.", "author": "B J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-17", "description": "Been here a few times and each time, the pizza has never been disappointing. \n\nThe service however seem to have been lacking that little something. My most recent encounter with them wasn't pleasent, mostly due to the server not really being our \"server\". \nBrought a friend here, server came over, took our order. Pizza arrived and he never came back until the check was presented. Felt neglected. \nIf a place with this much hype can only offer food, I would go to another pizza joint and get better service. \nPizza is great however.", "author": "John T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-13", "description": "Delicious! I'm not a big rater of food but this pizza was GOOD! Definitely stop by for a slice of pizza and some coke or cream soda. This was one of two places on a pizza tour of Brooklyn I took and now I know why. Delicious!", "author": "Jordan P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}