{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-21", "description": "Okay so I am not gonna say its the ABSOLUTE best pizza in NYC but it's pretty good (bordering between a 3.5 to 4 for this review)...they make it right there, very fresh and much variety. \n\nI had pepperoni pizza, peppers w/ onions and white cheese pizza. All were very good. This is a cool spot to go to whether with a group of friends or a date. Not to mention after you eat you can walk by the bridge and enjoy the view of lower Manhattan. \n\nOnly drawbacks if any that I would say about this place is that one: they do not take credit/debit cards but I guess they still want to keep that old school feel because the place has been there forever. And two: it is not a big place so not only do not have a lot of arm/elbow space while eating your pizza but be prepared because you will be waiting on line for a while, especially on a nice day.", "author": "Jay L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-30", "description": "It's good pizza, but nothing spectacular. Definitely don't wait in line more than 15 minutes to eat here. Cash only.", "author": "Kaushik V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "Although the pizza I ate from Grimaldi's was cold when I ate it, I still enjoyed it. Grimaldi's feels like its caters to GERMAN tourists like everything in DUMBO. I would go back there casually or when my parents are in town who don't know a lot about food. Other than that I wouldn't try to impress someone on a date by taking them their because it's a tourist magnet.", "author": "Cassandra R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-30", "description": "It's an okay place.  The pizza is good and so is the service.  It's a nice stop for a quick bite and beer in the afternoon.  I always go back.", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-27", "description": "Great pizza. Crust nice and thin and crispy. A small was plenty big for two people. A lot of dime sized but thick pepperoni.  Was not greasy. You can't just get a slice. They only take cash.", "author": "Sherry B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-11", "description": "I do have to admit that they have pretty good pizza.. But they are not the original. Juliana's next door sold them the name. They are cash only and you MUST be careful and count the change once they bring it to your table because they will incorrectly count your change. Customer service is HORRIBLE and they sit you on top of each other sharing tables. This place is all about the income and not actually serving their customers.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-13", "description": "Growing up in Brooklyn I was always hearing about this joint but it wasn't until my late teens or early twenties (back in the 90s) that I got to go. I found it highly overrated and would have let the world know but Yelp was not around at that time (nor, even, the World Wide Web) for me to voice my displeasure.\n\nSince the advent of social everything and specifically online reviews, I didn't feel it would be fair to go online and post a review about a place I had visited twenty years ago but...last week I got dragged here again so now I can post an honest, UPDATED review.\n\nAHEM, AHEM:  GRIMALDI'S STILL SUCKS.\n\nLet me be clear, the food doesn't suck, it's average (at best). Pizzas are piled high with whatever you want and baked in a brick oven until half-cooked and half-burnt (that's not a joke, I'm serious). Personally I like char on a steak but not so much on a slice of pizza...maybe that's just me. The sauce is runny and watery and unflavorful. Pretty bad overall but as an amalgam, maybe if your bite has a little sauce, a little dough (the unburnt part), and some sausage, cheese and basil it is okay. I would give the food by itself three stars; as I said, it's okay, not good. But it's the whole...\"experience\" that drags it down to two.\n\nNow I won't go into detail other than to say there are long lines meaning long waits in the hot or cold, lot of noise, crowded atmosphere, horrible service and rude service. Born-and-bred NYers know how and where to eat better Italian and less expensively. This is mainly for fresh-faced groups of Asian kids having a non-Asian dining experience and tourists visiting The Big Apple for the first time. And before you try, please don't even try to read some prejudice in what I just said. Let me break it down for those certain people who look for offense in every aspect of the world around them: It's a statement of fact that when I went, there were a couple of tables with young Asian teens seemingly enjoying the experience (as I WOULD ALSO if I was with a bunch of Italian friends at an Asian place). Do you understand the reference now? Can you cancel the P.C. Police? LOL. My point is that the kids enjoyed it because of the contrast to their own heritage and cuisine (and because they haven't had a better Italian experience at Goodfella's Brick Oven Pizza or Patrizias Restaurant). And as far as what I said about tourists, don't take offense to that either if you're a tourist, the point is it's worlds away from any Olive Garden or Macaroni Grill they ever tried in Butthole, Idaho so it's, again, a contrast and a novelty. Okay, maybe that was offensive to non-NYers, LOL. (Seriously though, whenever I go outside of the Boroughs my non-NYer friends make fun of me because I am amazed at things like Walmart or roadside food joints so I get to make fun of them for liking a restaurant that abuses both the sensibilities and the palate).\n\nBottom line: groups of young kids who are non-Italian or new to the country will love the experience. Tourists who get to brag to their friend Marge about the loud, obnoxious place with burnt pizza that had a line around the corner will love the experience. But for anyone who knows NY or has tried it once, it's doubtful they will go back.", "author": "Alex R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-12", "description": "So my friend that we were visiting, had this on our \"must do's\" while we were in town, and who was I to disobey?  This place has a line, and luckily for us, it wasn't too extremely bad this day, and it has a great view right next door, which helps to pass the time.\n\nAnyways, it was definitely worth the wait, the food was great!! I was told that this is one of the older pizzerias in town, nice little family owned spot. I am glad we had a chance to visit here, put it on your list when you visit NYC", "author": "Amrita J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-07", "description": "For big families it's horrible we waited over an hour just to be called I'm writing this review while I'm still in line", "author": "Fabian D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-21", "description": "Best pizza in the 5 boroughs! Our pie was delicious, and was curiously devoid of the grease that often makes other pizzas so terrible. This was hands down the best pizza I've had in a long time. We got there about 7, and there was a line, but it moved quickly and we were seated quickly. Great little gem.", "author": "Kathy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-17", "description": "So good! We have one in Southlake, TX, but this location is amazing!  I am not sure if it tastes better because we were in Brooklyn or what but the white pizza is amazing. We also tried the calzone, but that was disappointing as it was just oozing with too much cheese. I know, I know, who says too much cheese is a problem? But really it was actually wet with cheese. Overall though good eats!!", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-11", "description": "I've dreamt about coming to this place ever since it was featured on pizza paradise.  Well it's not worth the hype.  Too light on the sauce and definatly light on the meat.  I was really wanting to be wowed but wasn't.  The service was ok not great.  Came from a long way, and as they the journey is more fun then the destination.", "author": "H K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-26", "description": "Was the pizza good? Yes. Great? No. Very fast service, and we didn't have to wait outside too long, which was a major plus. We got two pizzas, one plain, one with mushrooms. Both pizzas were very fresh with good quality ingredients, but they had very little flavor. We had to ask for garlic and Parmesan because the sauce didn't taste seasoned and the mozzarella, although fresh, was very bland for some reason. The mushroom pizza, unfortunately, had a very soggy crust. :( \n\nI was definitely unimpressed by Grimaldis. I laude their use of fresh ingredients, but their pizzas were pretty ho-hum in the flavor department. I recommend Fascati's up on Henry Street.", "author": "Emily H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-25", "description": "As a Nyc Born Italian and a chef be trade I am outraged that so many people give this place 5 stars.  I'm sorry Grimaldi's but like I always say I don't sugar coat unless I'm baking something fattening.   Even if there wasn't a single Italian in this place (I'm pretty sure everyone working there was Russian and Mexican)  but that has nothing to do with the quality of food so here we go:\n\n\nCame here on a day trip with fellow Angry ass and Yelper Amal, we found a spot basically right outside the joint so we figured god wanted us to try this pizza and so we did.\n\nShe called it... \"I know we are going to be disappointed\" And was she ever right.  Sure the price isn't bad at all but the pizza is beyond flavorless.  After you order your said pizza it was literally flung on our table.  We could deal with that were no puss puss.  The bigger kick in the pants came from what you tried to feed us.  Sure it looks like a great brick oven pizza, but it tastes like a piece of flavorless........??? I don't even know what to call it.  How could something with fresh mozz, sauce and basil taste like nothing?\n\nI could sit here and say what I think can be done to improve this but I wont bother, they are making a ton of money off this \"pizza\" and laughing at this review as they take their wads of cash to the bank, granted.  \n\nAll I'm saying is the pizza is made to order, put on your table and cold within 3 mins. Wow and if I thought it tasted bad before wait till this abortion slice gets cold.  \n\nWe fought over who got to eat the bigger piece, and not the usually \"I want it \" it was the \"na man you fucking eat that shit\"\n\njust sayin", "author": "Ben F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-13", "description": "Grimaldi's was amazing.  I've been a fan of pizza and the NY pizzas in cali just can't compete.  I guess the water does make a difference.  The texture of bread was thin and soft, not hard like the ones they sell at the pizza places around here.  The sauce and toppings were great combination.  The sausage was fatty and the pepperoni slices were thick and flavorful.\n\nThe only drawback from this place is there is always a long line outside.  I assume most of those standing in line are tourists.  If you want to sit down at a table, you should expect to wait at least an hour.  What i suggest is taking the pizza to go, grabbing a few drinks and having a picnic near the bay.", "author": "eileen h."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-29", "description": "In full disclosure I am a Lombardi's pizza fan so I had my doubts walking in the door. I got a white pizza and it tasted like rubber and my friends even thought so. We also ordered a pepperoni and it was really greasy. I think chain pizza is just as good from my experience, I really wanted to like this pizza. I have heard other locations are much better but I wanted the original and I am sad to say I don't understand what people like about it.", "author": "Leo R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-13", "description": "My friends and I, in a party of 4, wanted to try REAL New York pizza, so why not start with Grimaldi's? We ordered one large regular pizza (18\" diameter) with sausage and mushroom. As with all mushroom dishes, the mushroom has a very strong taste, but thankfully  it didn't overpower the other ingredients. In the pizza you could definitely tell the freshness of the mozzarella, which brought somewhat of a tart to the otherwise savory dish.\n\nOur waiter was okay. I was hoping for better service, but he did not once check up on us or gave us a water refill.", "author": "Jason T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-21", "description": "I loved my experience at Grimaldi's and I think it's worth the trip to Brooklyn. We came on a Sunday around 5 and waited about 20 minutes. We started with the Antipasto which was just okay- it confirmed for me that at a pizza place you should stick with pizza! My boyfriend and I shared a pie that had italian sausage on it. It was maybe the best pizza I've ever had. The ingredients were so fresh and I could literally see the guy making the pizza. I'm taking off one star for the way the tables were crammed. We were sitting next to this couple we didn't know at practically the same table- we were essentially on a double date. It was a little awkward. So, you don't really come to Grimaldi's for the date atmosphere, FYI. Also, it's cash only!", "author": "Leslie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-25", "description": "It's like going to DMV, you know there will be a line, high prospects for low-patience (indoor)waiters and frustrated (outdoor)line-waiters (hey-o). You do this process once every 10 years to validate you still live in NYC, than as you go past over the subsequent years, you marvel how anyone not from Detroit could wait in line so often and you say, glad I got my pie taken care of! \n\nAny misplacement of NYC pizza dignity card, I recommend visiting an express DMV station like Lombardy's in Soho. Different but equally as delicious.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-11", "description": "Let me start off my saying that if you can find a better New York style of pizza let me know. We ordered the sausage extra cheese pie and it was delicious. Fresh ingredients from the tomatoes to the bubbling cheese. My wife doesn't enjoy eating pizza crust but she was picking at my plate. A large pie devoured. Great atmosphere and decent wait staff.  Experienced no wait sitting even thought I read that lines could last up to an hour. Great pie!", "author": "Anthony H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}