{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-23", "description": "I will not come here if not because of my friend visiting from other country.tourist trap for sure,we gotta wait long line before even get in,and the pizza is good but not the best pizza i ever had,consider i live in italian neighborhood.", "author": "Vera C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "Was visiting in Brooklyn around lunchtime so I decided to try this place out. I really enjoyed the pizza and I would have given this place 5 stars but the place itself was a little rundown. But overall a very good experience. Would highly recommend!!", "author": "Anna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "this place is AMAZING!!!hands down the best pizza I've ever had. The staff is very friendly. Your cup will never be empty. I will definitely be back when I visit again.", "author": "TeiAndrea C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-24", "description": "Snuck in here on a random rainy Friday afternoon. No line- score! \nI respect the faithful followers, however I can't claim to be one.\n\nSee my pizza list if you care to delve into my hardcore pie philosophy:\nhttp://www.yelp.com/list/connecticut-pizza-fairfield\n\nThe pie was good. Not super good or even slightly great. Simply my opinion. \nWhen it arrived (in less than 4 minutes which made me suspect) was a thing of beauty- the colors of the Italian flag all red white \u0026 green....The fresh mozzarella all bright white \u0026 melty w the specks of red tomato peeking through with a smattering of blistered green basil splayed out on a very thin crust.\nFoldable, a bit dry, charred crust, slight chew. But my taste-buds were left feeling uh, disappointed. No party in my mouth that's for sure.\nThis is wholly not NYC style pizza despite its infamous location. It's certainly closer to the Neapolitan style.\nThe interior is well, not worth mentioning, so apparently it has no influence on why people wait 2+ hrs to get in.\nThe service was brisk, impersonal \u0026 we were overcharged by $12.", "author": "Debrin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-19", "description": "As a once ardent FAN of this ORIGINAL LOCATION... I wish I could give this once great pizza mecca ZERO stars...  What's happened here?\n\nFirst off... The big bald headed *cough* \"manager\" who thinks he's GOD running the front door and his old Russian a-hole boyfriend behind the bar (The only seat they would give me me because I was a \"party of one\") BOTH need to BEG the owners to let them visit ANY of their company owned locations that have opened here in Dallas. (Or others around the country)\n\nMaybe then... They can learn what THE REAL Grimaldi's USED TO BE, (And still IS here...) along with what Customer Service is all about. (YES..  At their Dallas location, you actually get REAL PLATES, silverware, and a full menu...salads, desserts... ETC)  The Pizza is BRICK OVEN AWESOME!  AND THEY TAKE CREDIT CARDS AND RESERVATIONS!!\n\nTHIS CRAP JOINT is now nothing but a \"herd em in\", \"herd em out\" \"Take THE CASH ONLY\" tourist trap.  Paper Plates, a plastic f'n fork, and a throwaway plastic cup for water with NO F'N ICE in it???  REALLY???  \n\nAnd then when you give the jerk $30 to pay for a 22$ pie... He acts OFFENDED that you want some change back...  I guess you should feel HONORED to have been \"ripped off under the bridge\" just because you GOT to eat here!\n\nScrew this place!  I'd rather heat up a $2 Totinos Frozen Pizza in a toaster oven.  Or better yet... Go to Bleecker St. Pizza next time I'm back in the city.  \n\nGrimaldi's Brooklyn has gotten my last dime ever.  And that's a shame.   20 years ago... I'd HAVE NEVER dreamed I'd be writing this.  I'm sure they won't care about this review...  Priorities have changed here over the years...  Obviously.", "author": "Frank Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-11", "description": "This place was amazing!! The pizza was so good and the hospitality was the best! The price was also really reasonable! Just bring cash because it's only cash only!", "author": "Beatriz H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Great pizza! Just what I expected a good pizza would be. It was pretty big, even the \"small\" was more than enough. We enjoyed it very much!", "author": "Stacy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "If you're in the NYC area and you're looking for delicious, authentic pizza, you MUST check out Grimaldi's. \n\nYou'll probably encounter a line (it moves fairly quickly), ensure you have cash (they don't take cards!), and you should definitely try the pepperoni pie. I've never seen pepperonis like this in my life and they.were.incredible. \n\nOn top of this, despite the crowd, our waiter was fantastic. We were worried about being late to a 7pm show (Sleep No More!), so he was very accommodating in rushing our pizza and cannolis. \n\nWhile the pizza was fantastic, I don't love that the soda was in bottles. And the cannolis were HUGE but not the best I've had.", "author": "Emily W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-30", "description": "I am not a fan of pizza as I don't think it's worth the bang for the buck. However, I came here because an out of town friend loves pizza. Grimaldi's, the famous pizza everyone knows about did not meet up to its hype. First off, cash only. That's a no-no in my books. Also, paper plates, plastic cups and utensils? I expect more from a place if there's a wait. The pizza was on the thin side and I would recommend the regular pie over the white pie.", "author": "gary m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-09", "description": "This pizza is overrated. I'm not saying this just because I'm from Chicago and we're known for our pizza (not to mention I've  lived in Italy and have been spoiled by the pizza there), but I KNOW this because Chicagoans are ALL about their pizza AND we know good pizza when we taste it AND I've had way better NY pizza than this. Granted, all ingredients are and taste fresh, but the flavor is very plain even after building my own pizza with the exact ingredients I wanted--where is the flavor? It kinda made me regret not pulling a couple seasonings from my kitchen cabinet and packing them in my purse before arrival. The property itself and the building's rich history is WAY more fascinating than this pizza. Don't believe the hype-- or do, if it makes you feel good. Never again will I stand in this line for over an hour for this pizza. The service was nothing to be remembered. No one was particularly nice, but no one was mean or rude either. I really don't even remember the waiter- nothing special about the service. However, I will give Grimaldi's kudos to their marketing team, they've got some serious promoters and Word of Mouth cheerleaders out in the city hyping this place up for many years. That's amazing! Without that accomplishment, less than three stars from me. I really wanted to love this pizza and make this my staple pizza place in Brooklyn because I really love NY style pizza (eh, shoot me, I tell my fellow Chicagoans this too!). Darn.", "author": "Mia M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-10", "description": "I mean for years i have heard of the \"best pizza in New York right under the Brooklyn bridge Grimaldi's\" but how disappointed when i finally got to try it out and how much of a disaster my experience was.\n\nFirst off, the service was nonexistent. We were seated. Drinks and food was served. And check. Thats it. 2 times i had to get up to go to the counter to ask for refills. Another time i had to get up and ask for the check after waiting 15mins.\n\nWhats worse is that the server tried to throw out the rest of the pizza that i was trying to get wrapped for togo. The pizza itself was mediocre at best. Its bread, tomato sauce and cheese they charge you 14$ for\n\nNO CARDS with $5 ATM surcharge. The old man bouncer was rude to majority of customers mainly non whites. ( i kid you not and put it on everything i love ) calling people dumbfucks and gooks behind their backs after rushing ti seat them. I may not be itlian but i sure know what the term mulignan means. ( look it up for yourself ) \n\nOverall a tourist trap for NYC. Seriously self proclaimed best pizza, if you are from NYC there are about 10,000 other better restaurants that treat customers with dignity. As for you tourist dont buy into the hype, do yourself a favor and go somewhere else. Seriously", "author": "Kevin Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-10", "description": "Been twice and I wanted to love the pizza here, but it was a huge let down. The sauce was seasoned well and the toppings were great, but the pizza was flimsy. Slices did not hold up and was soggy. This is not the kind of NY pizza I want my friends and family visiting to try. I might give this place another try if someone drags me.", "author": "Ali T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-17", "description": "Twenty minute line for pizza? Yeah it was worth it. Place is old school and the pizza is really good. I know pizza can be a polarizing topic with some people (especially in Brooklyn) but I'd definitely put this joint in the top ten for me personally. There's seating at the bar which makes the line move faster and it was cash only if I remember correctly. Their small pizzas actually do feed two people.", "author": "Vandad C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-21", "description": "Omg!!!  We arrived at 11:30 when they opened  we were the second table to be seated. Didn't get our pizza until 12:15...took them 45 minutes to serve us!!  Meanwhile all the tables around us, that were seated way after us,  got their food. When we finally got the waiter's attention he said,\"Oh ya, they had a hole in your pizza so they have to make another one.\" So frustrating. \nPizza tasted good, but the wait was enough to ruin the meal.", "author": "Tonia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "Best Pizza I've ever had! the ingredients were fresh and it burst with flavor. It's gonna be hard to go back to eating Round Table and Blast Pizza here in California ...lol", "author": "F F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "We wanted authentic New York pizza and they did not disappoint! Very, very good! We ordered two small pizzas for four people, which our server said would be enough, it was more than enough. The fresh Mozzarella was great, the rest of the toppings were flavorful and plentiful. If you aren't prepared for waiting outside, it might throw you. You need to stop outside and wait for the bouncer type dude to invite you in. Once you're in, you enter another world of some of the best pizza and cannoli this Midwest girl has ever had. Our sever, Mergim was adorable and great. If I'm in New York again, I will be back!", "author": "Mary S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "After we walked the Brooklyn bridge, we decided we had to go to the original grimaldis in Brooklyn. We went at noon on a weekday in January, and had no line. The menu is very simple. You can order a small or a large pizza. With whatever toppings you want. We put sausage and ham on ours. The sausage was unlike any sausage I've ever had. It was amazing. The pizza itself was great too! Now that I've been to the original grimaldis, I must take my husband to the Dallas one!", "author": "Chelsy D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-17", "description": "Y'All are CRAZY. You are rating a spot based on its pre-1998 Golden Era, where it was actually owned by Grimaldi. Since then it has dwindled and decayed into its current form. \n\nPatsy Grimaldi owns Juliana's NOT Grimaldi's. See here:  \"How Patsy Grimaldi, the 81 Year Old New York Pizza Legend is Getting His Good Name Back\": http://www.grubstreet.com/2012/10/pizza-legend-patsy-grimaldi-gets-his-good-name-back.html\n\nGrimaldi's USED to be good when they were at their original location. But then they were sold, they moved, and became a tourist attraction and their pizza is now sub-par... the type of pizza you can find in any joint from FiDi to Times Square. \n\nI recently went back to Grimaldi's due to an out of town visitor who was hungry (after crossing the BK Bridge). I can't do it. ever. again. \n\nJuliana's Pizza (owned by Patsy Grimaldi) next door is actually where you want to go. Read about the feud here: http://www.villagevoice.com/restaurants/the-julianas-and-grimaldis-rivalry-bite-by-bite-6563319\n\n(DiFara is still 100x better than both)", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-06", "description": "Seriously?  You decided to eat at the corner of Front \u0026 Old Fulton because of something a friend of a friend told you?  \n\nYou missed by about 75 feet!\n\nBetter luck next time.", "author": "PJ S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "After hearing about this place for years, I finally made it over. The pizza did not disappoint. Delicious crispy crust. Small bits of basil were both unexpected and also enhanced the flavor.  Fast service. Reasonable price. It's worth noting that they don't have a liquor license. The interior (at least on lower level) is pretty unremarkable. But again, the pizza made this well worth the visit.", "author": "Rebecca M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}