{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-05", "description": "I feel like I need two of these star reviews, but this one is for the last time I've eaten at Grimaldi's. \n\nSooo...this may be an unpopular opinion, but bear with me--Grimaldi's in its current location isn't even a tenth as good as the pizza they made in their original location (now Juliana's). I've heard that it's due to the unceremonious ouster several years ago of the OG of pizza, Patsy Grimaldi. Seriously, the current version pales in comparison to what they once were. Which is fine, since it still draws most of the tourists (so the really great pizza next door rarely has a huge line, even at prime time). That restaurant will be the subject of a future review.\n\nBut, let me reminisce on my first introduction to NY pizza: My first experience with Grimaldi's in 2006 was the most amazing pizza experience this Pennsyltuckian had ever had, bar-none. Subsequent visits the following year confirmed this pizza experience (and I knew it wasn't due to being starved for proper pizza in 'Murica). However, with the location change, the pizza is really salty and sometimes soggy and charred...at the same time. Not to mention the service has gotten even worse (and I really am willing to put up with rudeness for delicious New York pizza). You feel like you're just being processed, and I feel like I'm on final Jeopardy when selecting my pizza toppings...and they're still cash only!", "author": "Rachel T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-08", "description": "I was so surprised when I finally ate here two weeks ago and it didn't live up to the famous reputation. It's so popular, I thought, how could it be bad? The crust was chewy, but the stale kind of chewy, and also lacked the nice olive oil flavor I appreciate in good pizza crust. Tomato sauce and mozzarella were not as high quality as I expected. They did have Brooklyn soda in glass bottles, which was the highlight for me. Sad, I know.\n\nFor good brick-oven pizza, I'd visit Numero 28 in the Village instead, any day. Two Boots is another delicious option (not brick oven) with interesting pies like my favorite, The Bird. Still haven't tried DiFara but I hear it's really the best pizza in New York. I won't be back to Grimaldi's.", "author": "Emily N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-19", "description": "The \"no line\" is deceiving. There will always be a wait here as someone at the door is essentially dictating when a party will get a table. It seems like they prefer larger parties than smaller parties. We waited 30 minutes even though there was no line at the time we waited. Our party of three at to wait for all the parties of four to clear out from the \"no line\" before we were seated. \n\nFrom my understanding, the restaurant is popular due to the rivalry between them and Juliana's.  The two restaurants are next door to each other. The day we went for lunch, both had no line out front. My friend wanted to eat at both places. He preferred Juliana's crust to Grimaldi's crust. Due to the fact we had to wait a lot longer than anticipated we ended up only eating here for lunch. He felt Gramaldi's was a bit commercialized as they have a small store in a mall in Las Vegas as well. \n\nI'm a bit biased as NY pizza taste all the same to me. I prefer thin, crispy Sicilian style crust over the thin NY style crust that can be folded. I'd be hard for me to tell the difference unless I lived in NY and ate pizza frequently. \n\nIf I were to do it all over again I'd eat at Juliana's first and then try Grimaldi's.", "author": "David Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "It is great pizza. I consider it one of the top pizza places in NYC. \n\nHaven't been there for a year now...I think they have moved since I have been there. I am not a fan of standing in a long line outside...but the pizza is incredible - I could eat an entire pizza...its so light and easy to eat. I wish I could order delivery from there.", "author": "Johnson B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-11", "description": "Hi, I took two out of town friends to dinner at this location on September 8th because it's their first NY trip and I wanted them to experience some very tasty history.  I unfortunately didn't check the menu before hand as I figured, being a gluten free, vegan, there's bound to be a salad on the menu and since it's about the four other people with me, my dinner is not a big deal. But imagine my surprise when besides pizza and calzone, there is only an antipasti plate with meat, cheese and tomatoes!! Yikes! Oh well, again , not about me so I kindly ask the waiter to bring me the antipasti minus the meat and cheese and of course, he looks at me like I'm an alien... as anyone else would! LOL So I explain my situation and he says okay.  Low and behold, he comes back with a plate of tomatoes, olives AND ROASTED RED PEPPERS AND ONION!!  I was so grateful as I know it's difficult to have a customer like me come in and for him and the staff to try and make me happy was so touching, not to mention, I didn't leave hungry! And I loved the double espresso too! Thank you Grimaldi's!!", "author": "Elizabeth A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-07", "description": "Three words: Italian sausage pizza. \n\nLine sucks, but you need to visit this place. How good is the pizza? Well, it's so good I bought an umbrella down the block when it rained unexpectedly just to protect the pizza. Well worth it.", "author": "Sherief M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "The plain pizza is hands down the best item on the menu. Super good and fresh and flavorful. Easily the best pizza I have ever had. I've tried it with chicken as well but nothing beats the plain pizza. The cannoli was also massive and oh so good not to mention those tiny chocolate covered ice cream balls. I had to take a star off because the service was horribllle. Our waiter disappeared and would not come back for ages or ask if we needed anything. The manager is such a sweet guy. If only the staff adopted his attitude as well", "author": "Rita K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "I had been there some other time and I came back last Saturday with friends.  This place is very very nice.  It's authentic, the pizza is good and also the format (they do what they do, the menu is simple, they've been doing this for years).  The best for me was the service, they brought a fan for one of my friends, they asked us where we were from, gave us good advice on the food, places around to go out, took pictures for us (we asked them) and in general I thought they really wanted we had a great dinner (not being overwhelming)--smiling and nice people.", "author": "Katharine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-13", "description": "Skip the antipasto, stick with the pizza.   \nThe atmosphere and waitstaff are great and the pizza is phenomenal... \nWe had sausage and plain.   Both were Spot on", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-13", "description": "GREAT!   My wife and I ate here on our trip to New York 4 months ago and are still talking about it.\n\nTourist tip.  Take a subway to City Hall in Manhattan, walk across the Brooklyn Bridge, eat here, and walk back.  We did this in about two hours.  It was a great lunch.\n\nThere is always a line.  Take a right off the first stairway on the brooklyn bridge, not a left.", "author": "G M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-25", "description": "I was really looking forward to trying Grimaldi's pizza, but now I'm not sure if I ever will...\n\nWe visited this past Saturday for my boyfriend's birthday after living in NYC for years and never going. We had tickets to a show at the Barclays that evening, so we arrived early at Grimaldi's anticipating a wait. We had a seat just before 7 p.m. and ordered our pie immediately.\n\nCut to 40 minutes later when a manager came over and told us that he hoped our order made it in before they had to clean the oven (in the middle of dinner service... on a Saturday evening...). Spoiler: it did not make it. We were assured that cleaning the oven only takes a few minutes and adds about 10 to 15 minutes on to the normal estimated wait time of 25 minutes (but we're already at 40 minutes at this point, so...).\n\nOne hour after we ordered, there is still no pizza. Not only do we not have a pizza, but nobody in the upstairs seating area has one. The place doesn't even smell like pizza. The table next to us complains and are told by the manager that \"this is Grimaldi's -- you have to wait. And if you don't want to wait, there are 1000 more people lining up on the sidewalk who will.\" Probably true, but SERIOUSLY!? This is the way you treat paying customers?\n\nAt an hour and 20 minutes, I head downstairs to use the bathroom and realize: a) there are no pizzas in the oven because it is still apparently being cleaned, and b) not a SINGLE PERSON in this ~ 200 seat restaurant has a pizza on their table. Unbelievable.\n\nAt this point we were going to be late for the 9 p.m. show we had tickets to, so my boyfriend went over to the waiter (who, by the way, never came by the tables to refill waters or check in while we all waited) and asked to pay for the sodas we ordered. This one guy was the only compassionate one of the bunch, apparently, as he told us not to worry about the sodas. An older man who we think may have been the owner lambasted my boyfriend for not being patient and grumbled at us as we walked out the door. Not one person apologized for the inconvenience.\n\nThe bottom line: the pizza here may be good (I wouldn't know), but just because you have a successful business does not mean that you can treat your customers like they don't matter. Some may buy into the \"charm\" of waiting an hour and a half + for a pizza just because it's Grimaldi's and that's what they do, but just remember that there are 1000 more people lining up on the sidewalk who they care about just as little as they do for you.", "author": "Kristen J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-20", "description": "Just as good as the Dallas one.     Always busy here. They will not sit incomplete parties so make sure all of you are here.    It's good pizza.", "author": "Craig T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-23", "description": "Pizza = Really Good.\nService = Not so much.\n\nIf you eat here, take it to go.  The service is borderline rude.  The restaurant itself is pretty dirty and they don't clean the tables between customers.  They simply use the menus (which are nasty) to fan the tables...leaving sauce and whatever else for the next customers to deal with.\n\nAlso, the \"CASH ONLY\" attitude is pretty silly.", "author": "Raul A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-23", "description": "Grimaldi's is Superb. Unfortunately, prepare to wait in long lines.", "author": "Olivia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-21", "description": "It's the first day of Spring. Tuesday. A week day. i decide to be spontaneous and wrangle my friend Gigi to join me after work to go out to Grimaldi's in Brooklyn. \n\nThis time I'm prepared for the one hour line. I've been on it before but with a bigger, less patient group. We discover that the 2 or 3 train to Clark street from Manhattan is a much faster commute as well. \n\nOnce we walk up to the middle-of-the-block location, all we see is scaffolding and a dilapidated, boarded up storefront for what used to be Grimaldi's. But I'm not ready to give up. The restaurant next door lets us know it's around the corner.\n\nWe back track and pass a sign that says as much. \n\nWhen we arrive at the corner property, there it is- the new home for Grimaldi's and...\n\n...wait for it...\n\nNO LINE! ABSOLUTELY NO LINE.\n\nWe sit down and realize that the place is still quite packed for a Tuesday evening at 7:30PM. And then we notice the high ceilings and the two floors. That explains why there are no lines. \n\nWe order a large margherita with extra basil on one half and sun dried tomatoes on another. \n\nFirst bite and I think: I wouldn't mind waiting in line for an hour for this. The crust is thin but has the perfect balance of crispiness and chewiness. The basil is fresh. The cheese is fresh and not oozing with oil. It's also used with care rather than being dolloped on till the crust collapses under it's weight. The sun dried tomatoes are charred just the right amount and pack in a tangy, slightly sweet bite. \n\nIn one word: PERFECTION.\n\nSince I've had pizza in Italy, i can't say it is THE BEST pizza in the world. But it is definitely ONE OF THE BEST pizzas I've had.\n\nSo why am I knocking off one star? Simply because I rate on total experience. The wait staff is, for lack of a better word, aloof. I didn't expect them to come and see how we were doing. it's a pizzeria after all! But I can foresee that if I happen to return on a busy night, they might be grumpy and take it out on the customer. Also, the bathrooms were atrocious! But these a trivial things. So I can ignore them. \n\nThe pizza on its own gets FIVE STARS!\n\nPS: By the time we did leave, there was a line of about 10 people waiting to be seated. Not bad for what it used to be. Not bad at all.", "author": "T.E. M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-20", "description": "Came here with a friend who knew Mars the owner, we ordered three pies and some appetizers i loved everything except the anchovies on the pizza guess it was a mistake to order every topping on the menu next time we will keep it simple.  Great environment and delicious food! will definitely be back :)", "author": "Annie N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-07", "description": "Cash Only\n\nNo Reservations\n\nYou will have to wait in the same line if you are eating in or ordering for takeout\n\nA few friends and I came to Grimaldi's for pizza.  Three of us shared a large pie, while the other three watched. :D\n\nThe pizza was good, but it is highly over-rated.  We waited about half an hour in line which wasn't too bad, so our expectations for the place wasn't high enough that we had to be let down.\n\nI enjoyed the meal, the pie was huge, and the crust was so so.  I would be back only if I were showing this place to friends or, is someone wanted to come here.", "author": "Emily S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-24", "description": "The pizza at this place is average at best. I live a block from here and used to eat here all the time but each time I do I wonder why I did it. The service is horrible, the line is overrated and gave this place a big ego which they don't deserve. The last time I came here we waited in line for half an hour and finally when we got to the front of the line we saw that the place was pretty empty. We confronted the hostess guy about why he made us wait so long out in the cold when the restaurant was clearly empty and he tried to make up some lame excuse (ie they were changing server shift). This is an average pizza joint who think they are some kind of hot nightclub in ny. I would take my money and time elsewhere. \nSummary: average pizza, terrible overhype attitude--spend your money elsewhere!", "author": "M N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-15", "description": "I find to believe the news that Peter D. brought to the forums that Grimaldi's is getting evicted from their classic spot on Old Fulton when they are so busy on the weekends. We waited over an hour in line (thank good there was a overhang from the next door construction to provide shade) and people continued to snap shots of the line documenting how ridiculous the wait was.\n\nWhen we got inside we ordered a large pie with pepperoni, Italian sausage, and mushrooms to share. They were out of the independent soda/root beer, cream soda, black cherry, orange. The pie is soggy like Lombardi's. The sauce and ingredients are fresh. The crust is thin with burnt sides distributed unevenly on each pizza. One pizza can feed about 3 people. It's cash only and a real NY / Brooklyn pizza experience. \n\nTalk to the people next to you in line, you are all there for the same experience and you have quite the wait. We were also nicely surprised when the Red Bull Mini Cooper arrived right next to our group in line. Two model-type blondes began to pass out free Red Bulls as well as swag. My three extra cans in the fridge is an example of how asking and being in the right place at the right time has some real benefits.", "author": "Will C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-30", "description": "It really is good crust. Very good. Thin crust without being brittle and stale, and doughy without being chewy. But my pizza come out lukewarm, and the flavor just didn't wow me. Good, but not amazing. My least favorite part: the mozzorella is not soft and gooey, but dry and rather rubbery. Odd. \n\nNot worth the wait.", "author": "Christine C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}