{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-02", "description": "Not sure what the hype is about this place, because the food can't really save the bad service that my friend and I received last week. \n\nWe came last Thursday night at 8:30pm, and there was a long line out the door. Good sign, right? They seated us within 10-15 minutes, so that was also great! But then we waited and waited for somebody to acknowledge our presence. After 10 minutes, I flagged down one of the waiters and he told me that somebody would take our order soon. We didn't any water or utensils yet. After 20 minutes, I flagged down a second waiter, who finally took our order. Then we asked another waiter for water.\n\nMy friend and I split a small margherita pizza with capers, mushrooms, and fresh garlic. The pizza arrived pretty quickly, and it was good, but it wasn't anything to call home about. My friend thought the crust was too dough-y, though I thought it was okay. It just didn't have a brick-oven crispiness that I wanted for the pie itself. The toppings were nice, but nothing special, either. \n\nThe meal came out to be $25, with tip and tax included. When our other friends asked if they should come to Grimaldis I told them, \"Nah, skip it.\" Maybe we came on an off night?", "author": "Karen S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-21", "description": "Very disappointed with pizza...and liquor license is not valid, so they can't serve beer /wine. Pizza crust was soggy; toppings and tomato sauce were barely warm. Soda bottles were served warm with ice in glasses. The sodas were flat, and we noted that expiration dates on soda bottles were within 2 months of yesterday. Don't waste your time and money. There are many better choices in NYC, like Lombardi's.", "author": "Nolene F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-12", "description": "After trying four other pizza joints in search of the quintessential slice of NY pizza (L\u0026B Spumoni Gardens in Brooklyn and three other places in Manhattan), I finally found what I was looking for at Grimaldi's. \n\nI live in Boston and came to NYC last weekend with my wife and two of our friends from Denver, CO.  We were all a little hesitant to try Grimaldi's given some of the negative reviews about it being a tourist trap.  \n\nAfter being underwhelmed by L\u0026Bs earlier in the day, we all decided to venture out of our hotel one last time to try to find a good slice of pie.  We arrived at Grimaldi's at 11:30PM having called our take-out order in fifteen minutes earlier.  Although the place was packed when we arrived, there were no lines and we only had a short wait for our pizza.    \n\nLet me just say that this place is no tourist trap.  Without exception, Grimaldi's has the best pizza I've ever had!  My friends all felt the same way.  We had our large pepperoni pizza devoured before we got back to our hotel room which was only fifteen minutes away.  I will travel back to NYC from Boston for the sole purpose of indulging in Grimaldi's pizza again.", "author": "Lynn D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-18", "description": "This place sits at a 3.5 for me.\n\nAfter seeing Grimaldi's featured on the Travel Network many times this past year, I KNEW I had to Yelp Bookmark it and try it if ever I got the chance. So, as luck would have it, I was set to go to the Brooklyn Philharmonics Concert @ the BAM on Sunday... and so with my girlfriend (a Brooklyn native), we headed over to Grimaldi's immediately thereafter. \n\nIt took about an hour to find parking, but luckily, I had my girlfriend wait on line in the meantime, which worked out perfectly because we were pretty much seated as soon as I found parking. We actually ended up having to share a table with another couple (which was kinda awkward) and the food didn't end up coming out for another hour. So, in total, it took about 2 hours.\n\nThe pizza was pretty good (we ordered a pie with sausage, ham and onions), but I didn't think it was the best I've ever had. It was definitely up there, but a bit hyped up and not completely worthy of a 2-hour wait.\n\nWould I go back? Sure, but only if I was with another Grimaldi's newb who insisted on it.", "author": "Diana K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-04", "description": "So, I'm putting my bias on the table from the get-go. I'm from Chicago, and before you even say it, no, in order to be good, I don't expect pizza to be like deep dish pizza, which I actually hate. Tomato sauce is my least favourite part about pizza; it ruins the wondiferous goodness of the heavenly combination of cheese and bread, but I digress. Anyway, after we left the Galapogos Art Space (another definite place to visit), my friend convinced me to go to Grimaldi's since she'd heard all these wonderful things about it. As she said, it's \"supposed to be like really great NY-style pizza,\" which to me, translates to floppy pizza with a way less than optimal ratio of cheese to tomato sauce (Dear NY: Cheese is good. Get with it. Thank you). But I tried to walk in with an open mind, and I was delightfully surprised. We got a large pizza with half Italian sausage, and it was pretty gosh darn good. Crust was acceptable to my taste and the fresh mozzarella was yum-yum (I have a Masters degree, guys, can you tell?). I'm not usually one to do so, but I doctored it up a little with some garlic, and I gobbled the crap out of that pizza. I'm still surprised at how good it was. We went pretty late, not too long before they were about to close (after 11p on a Friday night), so we didn't get a chance to get dessert. But the servers passed by us with those huge cannolis and we were like OMGWTFBBQ Yes, please! Next time, we'll have to make that happen. There's tons of space to sit down (large group or not) too, which is nice. It's also pretty cool to be able to watch the chefs making the pizza too.  \n\nI still don't know if this is really what NY-style pizza is supposed to be like or more like actual Italian style pizza (I can't remember from when I was in Italy over 10 year ago; womp, I'm old). But either way, please go here if you haven't already. And when you want to give someone an example of good quality pizza in NY, Grimaldi's should be at the top of the list.", "author": "Adjoa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "Worth the trek to Brooklyn if Lombardis isn't an option.  Amazing pizza.", "author": "Scott R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-16", "description": "After hearing about this place from several sources I had to give it a try. \nWe waited in line for a good hour or so, no problem, it was a beautiful day and the view is spectacular.\nThe service is quick and so is the speed in which you'll huff down that tasty pie.\nThe ingredients are fresh and tasty and this thing comes to you piping hot! I see why out of over a thousand reviews it has an overall 4 star rating.\nWorth the wait.", "author": "No Longer Yelping B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-30", "description": "Just came back from trying \"The #1 pizza in NY\" just to be really disappointed. We got a table after 15 minutes or so , so not much of a wait. So after around 5 mins this guy took our order, blah blah blah, waited another 15 mins until our order finally came. My boyfriend and I ordered a small pizza with pepperoni and a small white pizza, to our surprise it came out a lot bigger than  we had anticipated. Anyway we excitedly grabbed a fresh hot slice and took a bite JUST TO BE EXTREMELY DISAPPOINTED. SO THIS IS WHAT THE BEST PIZZA TASTES LIKE?? Omg, it wasn't bad, but it wasn't good which was why I was disappointed. The small pizza w pepperoni was ok while the white pizza was the worst of all. It was so so so bland and it was just gross. I brought the rest of the 4 slices home only to have no one eat it. Anyway, as we finish the small pizza, we wanted more water and napkins. One of the waiters refilled our water looking pissed as hell and another waiter took a STACK of napkins, like 7-8 and just threw it on the table. So much for customer service! Now that we're done with our mediocre pizza, we asked for the check. It came out to be $36.... I was confused BC the pizza total should be $29. Confused, I decided to ask one of the workers, this old guy that seated us walked by so I conveniently asked, before I even got to ask him if tip is included he swatted me away and told me to ask one of the waiters. Ok so we did and turns out tip was added on to my paycheck. I honestly don't mind paying tip BUT THEY DID A TERRRIBLE ATROCIOUS, and DISGRACEFUL JOB SO WHY ASK FOR MY TIP. Anyway, I'm just really disappointed I wasted $36. Just know that they have really EHHHH pizza and if you want good pizza in Brooklyn, you can always try L\u0026B's. And they have really shitty service so be prepare.", "author": "Nicole J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-17", "description": "NY pizza is by far the best I've had \u0026 grimaldi's is definitely one of the best within NY.\nMargarita pizza is what they're known for and there's a reason for that, it's great.\nYou can only get a whole pie and they only accept cash, so stop by the ATM before you come.\nThere is usually a line but it goes fairly quick. If you dont feel like waiting you can always try to go Next door to Julianas (which is the original Grimaldis). Julianas also accepts credit cards if you don't have cash.", "author": "Kevin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-30", "description": "A couple of years ago, one of my former interns (from Brooklyn) recommended Grimaldi's for whenever I was in NYC. Normally I like to find a slice within a few blocks of wherever I'm staying at but I figured I'd take my intern up on her suggestion and give Grimaldi's a shot.\n\nIt was well worth it! Me and my co-workers got there before the lines got ridiculous so there was no wait at all. To a person, the pizza was fantastic. Wished I could've stuffed more in me.\n\nWhen we walked out, the line was down the block and we all instantly understood why. Highly recommended.\n\n{For a great slice at a quick, \"in and out\" pizza joint, see my Pizza Suprema review)", "author": "Ken R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-29", "description": "Wow, talk about overhyped. Like others, I've heard this is the best pizza in NYC. I really hope not. The wait was about 45 minutes, and honestly, I don't think it was worth it at all. The pizza itself was okay, nothing mindblowing. We got a half white half regular w/ mushroom and then another regular pizza. The pizza got to us pretty quickly after we were seated. I prolly won't ever come here again. The only redeeming quality of this place is the view of Manhattan right next to it.", "author": "Izzat A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-29", "description": "All i am going to say is that their pizza is NOT worth 1,5 hrs in line. Go next door for even better brick ocen pizza!", "author": "Alina T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-24", "description": "I never thought I'd walk across a bridge, stand in line for 45 minutes, brave a sweltering porta potty down the street in like 89% humidity just for...pizza.\n\nWas it worth it? Well, it was REALLY GOOD don't get me wrong, but was it the best pizza I've ever had? Meh...not sure I can answer that. Perhaps it was our toppings which weren't all too exciting (we got the pepperoni mushroom) but maybe a diehard Grimaldi's expert can answer that one for me.\n\nIt has really fresh ingredients and I liked the fact that it wasn't a super greasy affair as to avoid the post-greasy food diarrhea bubbles on the subway ride back. I REALLY liked the pepperoni, it was not too thin and not too thick (yes we're still talking about pepperoni here) and had a really good flavor.\n\nTaking it TO GO to eat on the picnic bench over at the water front area facing the NYC skyline = THE BEST IDEA EVER. I'm pretty sure my pizza tasted at least 13.78% better with the beautiful weather and view of NY.\n\nIs it the best pizza to try on a visit to NY? I have NO clue, but if you consider the added bonus of having it after walking across the Brooklyn Bridge and/or eating it outdoors to enjoy the scenery I'd say that's worth a trip to me. \n\nFrom a California tourist standpoint: A++", "author": "Elaine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-15", "description": "Best pizza of my life.It saddens me to know that i live 14hrs away from it.", "author": "Tramaine W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-22", "description": "I think this place is just popular but the pizza doesn't amazed me.  On our first night in New York, we headed here and waited for 45 -60 minutes for a table.  Pretty cold outside and I think they move to a building next to it.  Some other pizza place move in their original spot.  Their new place is 2 story so more seating I think.  The line doesn't move quick though.  They have a nice park with carousel inside for little ones.  The park has an amazing view of Brooklyn Bridge and body of water.  The pizza was burnt on the bottom so tasted a bit bitter.  We got half side with sausage, pepperoni, sweet chilli on one side.  Other side is ham, basil leaves and sun dried tomato.  The crust is too dry for my liking.  The pizza is not as thin as I thought.  Our meal comes to 40 bux with 2 sodas.  We wanted to try Lombardi to compare with this place.", "author": "Brandon L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-23", "description": "Grimaldi's pizza has become THE STANDARD for which I judge pizza. It's the best pizza I've ever tasted! The fresh ingredients with that smoky, coal brick oven taste and the thin crust is to die for... I had the pepperoni w/ mushrooms pie. It's perfection. \n\nWaiting in the treacherously long line is worth it! :)", "author": "RJ W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-10", "description": "I personally thought the pizza was worth every penny. Plus you get a nice New York feel with the atmosphere and people:)", "author": "Lauren N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-02", "description": "Its the pizza that made the Brooklyn Bridge famous. :)\n\nThe bf and I waited outside in a line for at least 20 minutes on a windy day back in May. I had made him stand in line for Artichoke pizza, but was highly cynical that there could be something much better. Then we were finally called in.... Its lovely inside, beautiful brick stove in the back, cute little tables, wonderful service, and simply delectable pizza! \n\nIt took me by surprise, seriously, how amazing my pizza was. We ate until we were full and beyond that. Their thin crust pizza is the Godiva of pizzas, leaving you satisfied, yet craving more. We laughed, talked, and swapped pizza from time to time. Their toppings are fresh, and juicy. The tomato and veggies on our pizzas felt like they had just been hand picked. I was and still am impressed.\n\nIts worth the wait in line. Its simply a New York must do. So go out and walk across the Brooklyn Bridge, go to an event at Saint Ann's Warehouse, but whatever you do, just make sure you eat your lunch/ dinner at Grimaldi's. It is the cherry on top for any perfect date.", "author": "Melissa A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-12", "description": "THE BEST. If you want a good place to take your family when they come to visit and everyone wants NYC pizza, you should take them here.", "author": "Kassie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-24", "description": "My friend and I came here during the winter with the line being a good 30 min wait. Myself being impatient, I wanted to leave because i thought this is just pizza. My friend convinced me to wait and I'm glad I did. We split a pie between each other with 3 toppings, yum!", "author": "Diana G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}