{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-15", "description": "We got there right before noon, and boy am I glad we did. We got one of the last tables and when we left the line was down the block.  The service is fast and friendly, the pizza is everything everyone says about it.  It is a little bit of a tourist trap, but with good reason.", "author": "Eric J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-28", "description": "Okay, its worth the wait for the FIRST time.  After that figure out when the crowd isn't there.  I LOVE the simplicity of their menu and the fact that their plain pizza is fresh mozzarella and basil.  Our pizza and everyone's around us was amazing.  Their very short wine list was actually really good.\n\nThere's one problem, and its big.  Their crust is tough and chewy, like the dough was WAY overworked.", "author": "Robert Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-14", "description": "The coal fired oven adds a unique and distinct flavor to the classic New York pizza dough.  If you don't mind waiting in line for an hour then it is well worth the wait. If it's good enough for Frank Sinatra to fly it to Vegas it's great for me! :)", "author": "Jon W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-08", "description": "I believe that you can tell the quality of a pizzeria by its cheese pizza. Ordered a large cheese pizza for three, we ate two slices each, and everyone walked away feeling unsatisfied. Could've been swayed by the coal-burning oven, the family feel, and raving reviews from fellow Yelpers. But when it comes down to it, the food needs to speak for itself. This pizza was a bit dry, without enough sauce, delicious cheese, and basil was a nice touch. But I've had better pizza outside the city, and I think I'll stick with Tarantella's in Nyack.\n\nJust an FYI: they accept cash only, and the ATM outside charges $4 for a withdrawal. Its a 5-10 minute walk from the nearest subway, which is a little hard to find if you don't know the area.\n\nBottom line: Didn't live up to the rep, but they do have some special touches. And always remember: Mind over matter; food over mind.", "author": "Kellee K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-18", "description": "Great, crispy crust. Good pepperoni. Decent prices. Sweet owner, though the rest of the wait staff were unfriendly. Don't know if I'd wait in a long line.", "author": "Sophia B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-12", "description": "Really good ny pizza, probably one of the best. Pizza tastes great, the only negative is that there is a line most of the time that goes around the corner. If you have the time, the pizza is def worth the wait!", "author": "Dmitry D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-25", "description": "I recently came here for a weekday dinner after about a year long hiatus, and my mind was blown. The place was newly renovated and became so much larger and cleaner! Most importantly, there was no wait! I assume it was because it was a weekday and because the place became large enough to accommodate more people. Nonetheless, it was a pleasant change for me. The pizza itself, however, was exactly the way I remembered it to be. Everything is cooked to perfection- the crust, toppings, sauce, etc. Although the service isn't that great, I really can't complain about any other aspect of this place. I can say with confidence that this is one of the best pizza parlors in the city, along with Di Fara and Bleecker Street Pizza.", "author": "Elle C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-02", "description": "Exactly my review is \"I've experienced better\" this pizza was just ok --- a bit sloppy and wet, but good in flavor. Definitely to eat while there and not take it go. Our waiter was very nice. If you are reading this DO NOT WAIT in line to get in, we went there on a regular weekday and got right in. There are much much better pizza places in NY. \nAlso read carefully THIS IS NOT ORIGINAL \"GRIMALDI's COOKED AND OWNED PIZZA! Just google some info about it before you go :-)", "author": "Gracie K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-28", "description": "TOURIST TRAP! I saw this place featured on The Travel Channel and I decided to give it a try on a recent visit to Brooklyn. What a mistake! I arrived on a rainy afternoon, After circling for 30 minutes trying to find a parking spot (there is no parking at all) I found one 3 blocks away. I walked in from the rain and looked around trying to figure out who the host(ess) was since none of the staff had uniforms or matching shirts on. Eventually a young man who looked like a customer came over and sat me. I ordered a ricotta and mushroom Pizza and a soda. Then a woman and her boyfriend came in and were seated next to me with their wet Dog which she was holding in her lap. The dog was cute and well behaved but it did not belong in the restaurant. It was wet cold and smelled bad.(the staff claimed they didn't see the dog but it's against code to have animals) Just as they got situated my clumsy waiter came over with my pizza and knocked my drink all over my jacket and scarf.\nI asked to be moved to another table to get away from the stinky dog and to clean my clothes off. I ended up at the bar near the front door in a cold draft. Then I noticed the bottom of my Pizza was completely charred like an overcooked steak. I asked another waiter who was working at the bar to have it re-made and he had a NASTY attitude about it; I'm used to New Yorkers being rude, but I won't allow myself to be mistreated. They eventually remade the pizza and this time it arrived half cooked and completely wet. If this is a Pizzeria, they really should know how to cook a pizza properly based on the ingredients one chooses. I get that ricotta cheese makes a pizza a bit more wet by nature, but even when I have ordered the same pizza at other \"brick oven pizzerias, I've never had one this charred or wet. There must be a way to reduce the moisture from the cheese before they use it on pizza! I finally decided to just leave. They were unapologetic and did not offer to pay to have my clothes cleaned after spilling the sticky soda all over it. I left very disappointed and will never go back. If you're visiting NY and want great pizza this is not the place to experience it. More than the lousy Pizza it's the way they handled the situation that was such a turn off.", "author": "J L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-22", "description": "One of the best pizzas I've ever had.. And I eat a lot of pizza!!!\n\nEating Grimaldi's pizza, I sighed after every bite; cuz with every bite, I came closer and closer to not having anymore :( :( #oinker\n\nThe line to the (one) restroom was long, but my friend (also female) and I got invited to use the employee restroom in the kitchen. However, afterwards we didn't see anyone else being allowed to use this one.. Sketchy much???\n\nTo answer the Grimaldi's vs Lombardi's million dollar question: they're both soooo good that you should just keep going back and forth to eat both and decide for yourself!! As for me, I don't want to make up my mind on this one; I'll glady visit both havens on my trips to NYC.GIVE PIZZA CHANCE!", "author": "Jen G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-04", "description": "Arrived around noon and there was already a line of about 15 people with more on the way. Since I was dining alone, it only took about 30 minutes before being seated.\n\nThe base pizza is your traditional Margarita (basil, cheese, tomato sauce) and you add extra toppings for about $2 each. I got a small 16\" with fresh garlic, mushrooms, and Italian sausage. Yeah, you read correctly. I was going to eat a 16\" pizza by myself.\n\nOne bite and I was convinced that my 30 minute wait was well worth it. Thin, crispy crust with a light spread of fresh tomato sauce. Nothing is overly spiced with the usual Italian spices which allows the toppings' natural flavors to shine through. Hands down the best NY pizza I've had so far!\n\nThe atmosphere is crowded and bustling - tables are never empty for more than a few seconds as the next customers in line are shown in. The service is fast and furious, but the wait staff remain friendly and courteous.", "author": "Daniel Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-21", "description": "This place is to over rated the wait was crazy the waiter did not even speak to us not one word the place look dingy and the pizza was not all that I have had way better pizza then this place", "author": "John N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-05", "description": "Came on a Monday for lunch and the line wasn't too bad as I've seen it before.  Although it didn't help that it was freezing cold outside.  Nonetheless, plenty of people were walking out so the wait wasn't too long.  There were at least 20 people ahead of us, but since we were a party of 4, we got seated quickly.  \n\nWe ordered 1 large pie with sausage and mushrooms, but for some reason we were eating with our eyes because we decided to order another on top of that order.  WTH were we thinking?!?! Luckily we ordered a small pie with ham, but it was more than enough food for 4 people.  \n\nThe pies came out quickly, which were both thin crust.  The food was good and the bill came out to $40 w tip, which included the pies, tea, and 3 sodas.\n\nThings you need to know before coming to Grimaldi's:\n1) There is always a line so be prepared to wait and dress accordingly\n2) All their pies are thin crust so don't expect or ask for thick crust, you ain't gonna get it here\n3) CASH ONLY\n4) If you want take out, you still have to stand in line (bummer, but it's worth the wait if you're really craving it)", "author": "ellainne v."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-30", "description": "This review is only about the service at this place and not the food.  STAY AWAY. After waiting in line for two hours with a relatively short line outside the place, we are allowed past the front door only to be met with a very rude man who tells us to go upstairs and sit there until our name is called. After sitting there for another hour we inquired as to the status and were told very rudely that it was hard to tell how long it would be.  We cut our losses headed back to the city and ate at Bleaker Street Pizza and were amazed by how great the food and SERVICE was. Don't waste your time or listen to the hype.", "author": "Happy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-30", "description": "Hands down, best pizza in my life!   While standing in line, a tour bus drove by and someone shouted, \"it's worth the wait!!\"  Standing in that slow moving line, hearing that was reassuring at least because I was starving!.  After a 20 min wait, our group of 7 jumped to the front of the line as they were looking for a large party of exactly 7 people.  Now this place is starting to look good to me already :).  Once seated our pizzas came out in a reasonable time.  We had the typical pepperoni, mushroom, garlic, onion, sausage toppings.  The pizzas were delicious...the toppings tasted great, the pie crust was just right, and loved that the mozzorella was all gooey.  I thought Lombardi's pie crust was too soggy for my liking, but the crust here had the perfect texture, thickness and crunch to it.  We also tried the white pizza with pepperoni (white sauce instead of tomato sauce), and surprisingly that was one of my favorites.    \n\nHaving tried both Lombardi and Grimaldi, I'd have to pick Grimaldi over Lombardi.  I love my carbohydrates so the pie crust was my deal breaker.", "author": "Lan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-30", "description": "Good pizza, had to go there to put a check in the box of living in NYC. I am sure you can get same quality pizza at a many other places in the city. Go for the experience if not for the pizza, it by the waterfront so you can enjoy sitting there or taking a stroll to digest the pizza after.", "author": "Pratik M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-07", "description": "An hour wait, but worth it, at least the first time. This is a tasty piece of pizza. The mozzarella cheese compliments the chewy dough and the amazing tomato sauce. Brooklyn made sodas available too. The atmosphere is low key and has a family atmosphere. \n\nWarning, there are a lot of tourists that go here.", "author": "Grace Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-07", "description": "Hmm...I really don't know what all the hype is about this place. The pizza was good but I don't think it's worth traveling all the way down there and then waiting in such a ridiculously long line. The way I see it, you should try it once just so you can say you've been there, done that but not wroth going back unless you live around the corner. Check out my other pizza spot reviews for if you are looking for something better...", "author": "Farah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-30", "description": "Great pizza for a great price. Nice thin crust pizza w/ fresh mozzarella and tangy sauce. I was there during lunch time and It was quite busy, so I had to sit with strangers (community seating). The service is pretty good considering a full house of patrons. My only complaint would be the limited parking spaces around the area, so the only opportunities to enjoy their food is only when there is a parking spot when I happen to be driving by the place.", "author": "Man W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-29", "description": "I don't just hand out 5 star ratings but this is the best pizza I've had anywhere in the world. And trust me when I say I know my pizza. This is the perfect pie. I bought an extra one just to bring back to my room and have for breakfast in the morning.", "author": "Thebig G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}