{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-22", "description": "Arrived to a 40 min line to the door. Expectations were high, and they were totally fulfilled. Yes, the wait was a bit much, the tourists waiting in line were a turn off (but i guess I was one too), and there was a sauce stain on our table when we arrived. But damn, the pizza was phenomenal. People kept getting the plain cheese, but it was totally better when you add sausage (out of the casing, not that crappy mini , ricotta, and onions. Man, what a pie. I watched the guys make it and it seems very simple. Dimple the dough (for a fluffy, airy crust) light layer of sauce, mozzarella slices, generous sprinkle of Parmesan, basil leaves, toppings, and finally a drizzle of good olive oil. Then in the wood oven for 15 mins. For something so simple, it was very good. Soo good!", "author": "William H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-29", "description": "It was sooooo good.  I know I say that about everything, but seriously.. SO GOOD!  Really nothing else I can say!  Extra basil and extra cheese.  MINT.", "author": "Jess H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-04", "description": "Yeah, I waited 1 1/2 hours outside - forget 'bout it. People who think this pizza is worth it don't have a clue!! (the best is at a place called Zach's in Oakland California)\n\nI saw the old Nazi outside ushering people from the long line in giving preference to a group that did not stand in line with the rest of us - WTF - is this a trendy club?? (I'm guessing he lives for this power, and over compensates for a very small package, or deficiencies in other area of his life)\n\nVery average pizza, btw there was no cheese on the table; not worth the hassle or the attitude. Seriously, you could do much better.", "author": "KEVIN M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-23", "description": "I make sure I stop in every time I visit NYC. Best coal-fired pizza I've ever eaten! Fresh!", "author": "Daniel D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-21", "description": "Late Sunday Night. About 9:15pm.\n\nFriend and I jump on the subway, two stops, found out it was going backwards, jump off and then take 4 more stops and walked a mile to the \"Great Grimaldi's\". Being from California, we were totally excited to try one of New York's \"finest\".\n\nWe were able to strategically come half hour before closing and skip the whole crazy long lines. Got a table in 10 secs. \n\nOrdered the large with pizza, sausage and mushroom. Witnessed them making our order. Threw it in the oven for a few mins and then it was at our table.\n\nThe ingredients are super fresh. Large slices of mozzarella and basil were a nice touch but in the end, it just wasn't great. \n\nMaybe my problem is, I like my pizza to taste like pizza and not like a fresh vegetarian pie from whole foods or some other vegetarian joint. \n\nI guess if I stumbled into this store, I might have given it about a 6/10 but with the hype, distance and price, I'd only give it 4/10 \n\nBig disappointment. I am just glad I didn't wait the two hours otherwise I would have been freaking pissed off and then I would have shown my ninja skills.", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-06", "description": "As is the case with places that have achieved \"destination\" status, Grimaldi's can thrive on mediocrity, and does.\n\nWhen we walk in there's a gentleman working the bar singing karaoke covers of Sinatra songs; he's doing so rather badly, and loudly. I can't imagine that the folks at the bar were getting much service during this time, but I'll leave that review to them. For our part, we're seated near the bar so it's difficult to talk over \"Strangers in the Night\".\n\nTen minutes later, a server takes an interest in us, and naturally we're ready to order by then. The pizza is fine - nothing special, nothing noteworthy - and we see the waiter maybe once after that, to deliver the check. It's a Sunday (hurricane Sandy Sunday, no less), and there's an air of lethargy about the whole place.\n\nI went to Grimaldi's a few years ago at the old location, and I understood the hype: the pizza was really good. What they're serving these days is pretty bland and inoffensive, and while I'm annoyed at myself for being pretentious enough to say this, it's probably the best pizza that Jeanie and the gals from Fort Worth have ever had, and they're clearly the ones being targeted. The new location is ugly and it seems to me that the standards have slipped. Grimaldi's is a legitimate brand now, and I doubt they care.\n\nWait an hour or two for this if you like, but make sure you're ready to convince yourself that this utterly generic pizza is the best you've had in your life. Otherwise you'll be quite disappointed, I'm afraid.", "author": "David P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "Pretty good pizza and couldn't complain about the service.  I was kind of surprised by the small selection of toppings but I would recommend it.  However, it definitely did not live up to the hype I've heard surrounding this place...", "author": "Boyd P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-12", "description": "BEST EVER! the only pizza place I went for my NY trip.\n - had to try the famous \"brooklyn style\" pizza.\n\nPros: very flavorful; decent price ($19?) for a good size pizza; you can see how they actually make it; everything is fresh! friendly waiters, cool environment, really cozy, prompt service.\n\nCons: one stall bathroom; pretty small restaurant; sit very close to people (but some very friendly NYers to talk to).\n\nAte: Small regular pesto, garlic, italian sausage with mozzarella cheese. Sooo delicious! Inculding 2 drinks = total $30-40. \nFilled-up a party of 2 people.... wish I tried the Calzone too, maybe next trip.", "author": "Cindy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-25", "description": "I have tried a lot of slices from a lot of different places and for the most part, pizza is pizza.  Granted, there are some places where the pizza is well below par, but whenever my friends tried to argue the merits of one pizza over another I could never understand how any one place could stand above the rest.  Then I went to Grimaldi's.  The sauce, the cheese, the crust, the toppings, were all excellent, making this the best pie I have ever eaten.\n\nA friend and I made the walk last Saturday from the Financial District across the bridge and straight down Old Fulton Street.  It was peak lunch hours and the line was intimidating, but it was a beautiful spring day so we decided to stick it out and ended up with a table after only 20 minutes or so.\n\nI have no problem adding my name to the list of those who claim Grimaldi's as the best pizza they have ever had.", "author": "Dru H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-18", "description": "If you don't care about the hype about Grimaldi's and you are not dying to eat when strolling the bridge/promenade---then Grimaldi's is really not worth it and nothing to wait in line for. The pizza is fresh and famous, but it gets cold really quickly and is really NOT ALL THAT GREAT. There are many better pizza experiences you can have in nyc if you want good pizza. I would def. recommend Lombardi's over Grimaldi's if you are in the city and would recommend Lucali's on Henry St. if you want an authentic pizza experience in brooklyn. Lombardi's is the same price range as grimaldi's, lucali's prices may be a little steeper but are well worth it. \n\nI was avoiding going to Grimaldi's because I heard it was all hype. But I gave in when walking the bridge with my fiance. I'm sorry to say Grimaldi's you really are disappointing.", "author": "Asma S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-21", "description": "Pizza a solid four - the service kicked it to three.  Long wait - terrible service as I watched not one, not two, not three but four tables who came in after us get their orders in and have drinks arrive by the time I got to order.  The waiters are incompetent or lazy - either way just not worth the wait, the crotchety guy at the door or the so called service.  \n\nThe pizza itself was quite good - nice thin crust and well balanced.", "author": "Brian G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-09", "description": "My mouth is watering just writing this review! Fresh, brick oven pizza like mama used to make ;) Nothing fancy about the place but that's why it's so great. You go there for the pizza and if you still have room, there is great ice cream and views right by the water. There is quite a wait outside as its all cash and no reservations so bring your iphone fully charged and play some gesture games to work up an appetite! \n\nIf your a tourist in NYC, don't miss this treasure and then go visit DUMBO neighborhood to walk off the calories. just ask ;)\n\nBuon Appetito\n\ndaniel", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-31", "description": "THE pizza place. Alaways a long line. Great place to take friend experience Brooklyn.", "author": "Tiantian X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-16", "description": "Good as hell. Man I wish they delivered to Florida.", "author": "Sean H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-30", "description": "Second best pizza place in Brooklyn. New location means no long waits which means delicious pizza at faster rate.", "author": "Dingin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-05", "description": "One of the best pies in NYC.  Sure, the line can be long (we actually walked right in and got seated last time...lucky us) but it's the Brooklyn Mecca for your pizza hajj.", "author": "Ben G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-31", "description": "Okay pizza, nothing great. Definitely not worth wait, service was poor. Cash only.", "author": "Rob A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-06", "description": "This was the most anticipated NY pizza joint on my itinerary, and if you know anything about me, you'd know how easily I get disappointed when something is hyped up. Unfortunately for Grimaldi's, this was just another example of something that didn't quite live up to the expectations. Now don't get me wrong... I thought it was okay. It just didn't have the wow-factor as Di Fara's did. The wait wasn't long and the toppings were fine (pepperoni and mushroom), but the dough just wasn't as chewy as Di Fara's and the pizza as a whole was soggy/watery.  \n\nOr maybe the fact that this was our third consecutive pizza stop of the day tired out my pizza taste buds (if such a thing even exists).\n\nI will say the view of the city and the walk across Brooklyn Bridge afterwards both made the experience of eating here worthwhile.", "author": "Ken K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-27", "description": "I can't recall if I've ever asked for a second round of food after having enough to eat... until Grimaldi's. Our group from San Francisco were happy to make it to Brooklyn to appreciate this unique pizza experience.  This place was packed, even at 2pm on a weekday... luckily we didn't have to wait more than 5 mins for a table of six.\n\nThe pizza is absolutely great... each thin slice freshly made in an oven that the waiters asked us specifically not to take pictures of it while they were working (sorry we just wanted to take a piece of the memory back home). Menu is simple (pick large or small \u0026 pay per topping you want), but leaves room for creativity and numerous combinations. \n\nHow cool it was talking and listening to the waiters with NY accents... my friend had asked about the good Jazz music in the background, and our waiter was keen/knowledgeable to write down for us the album/artist. Just awesome.\n\nThis place was so good, my friends wanted to make a special trip back to eat here again on another day. The only way to squeeze that in was to get take-out... which is ok, but personally I would only eat Grimaldi's right out of the oven to truly appreciate how good it is. Cold pizza just plain sucks.... and don't even think about reheating a masterpiece in a microwave... what an injustice.\n\nThanks for the memories Grimaldi... hope to be back one day. NY rocks!\n\nFood: 5/5\nDecor: 4/5\nService: 5/5\nValue: 4/5", "author": "King L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-30", "description": "So this time around, I was smarter, came here on a weekday and wow! NO LINES! YAY! \nHad a large pie with pepperoni, mushrooms, extra mozzarella and basil. YUM! \nI still like the Manhattan crispy slices better, but this is the place to go after crossing the BK bridge^_^ Their pizza is a little floppy so you may need to use a fork and knife just to save the yummy toppings from slipping off. \nBe prepared to feel like they are rushing you, so you won't be too comfortable and stay there to chill when they can get another table in right after you leave.", "author": "Renee C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}