{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-19", "description": "We came here expecting more. This place accepts cash only. If you do not have cash to eat here you will be using the ATM. I had cash. There are pizza options only. There are no salads and no beverage refills. The beverages are priced per beverage $3.00 There is also no AC. I recommend going to the pizza place next door for a sit down dinner. This place seemed very rushed, go in to eat and get out type of vibe. Ordered a small pizza and 2 beverages. Had to get up to get water and get water refill as I mentioned it was hot inside. The pizza took a long time to come out. The pizza was okay nothing special. Go next door if you're in the area. Will not be coming back here.", "author": "Chris L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-28", "description": "Brick oven pizza. I don't really see the difference in taste. It just sounds cool to have your pizza baked in a BRICK oven... instead of a stainless steel oven? I don't get it. \n\nIt's a bit expensive too. A small cheese pizza is ~16 and you have to pay extra for each additional topping. My mama and I shares a small cheese pizza with pepperoni and mushrooms. Ended up being around 25. You get like 3 pieces each. It is filling but that's because there was only two of us ha. \n\nThey give you plates and utensils...but like who eats pizza with a fork and a knife?! This ain't some fancy shmancy restaurant. Yet.. the tables around us were cutting up their pizza into small bite pieces. I didn't care. I just went grabbed that pizza with my bare hands and nom nom-ed into it like a starving lion. \n\nI totally see this as a touristy place. Ironically, we were part of the tourist group too. \n\nMy mind was not totally blown so I probably would not go out of my way to come here the next time I'm in NYC. Sorry, folks! \n\nOH and also, CASH ONLY!!! So dumb.", "author": "Alison K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-12", "description": "Great pizza spot in Brooklyn. Went around 5 and there was no wait. Plus it's less expensive than other pizza places like it. Loved the burnt style crust and super cheesy pizza. I'll definitely recommend to anyone planning to visit NY. Only negative is they're cash only.", "author": "Barb P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-25", "description": "Please, if you are lining up here because the line at Juliana's looks longer, then please go back to Juliana's. If you are lining up here for good pizza, you're at the wrong place. If you are here because there is nowhere else to eat at Dumbo, and you are hungry, please go to Shake Shack--better food, better service, better pricing, and no time wasted. Please heed my advice, it may save you precious money and time.\n\nThis place only takes cash, that itself is sketchy. The food took well over 30min to come out, and honestly, Papa John's has better pizza. Everything, from plates to forks to cups are disposable--says something about the quality of the restaurant. Service? Close to none, came once to take the order, second to serve food, and third to give us our checks. And surprise! A mandatory 18% service charge added to the meal for absolutely nonexistent service. What a joke.", "author": "Ji Hwan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "So we got there and we didn't wait at all but I would say the average wait time is around 15 to 20 minutes. I'm giving this place four stars because the pizza is great; however, not amazing. I did love the pizza but it's not a full five stars worthy. I do feel that it is a bit overpriced and not worth the money. We paid 49$ for two pies. It's more of a \"famous tourist\" type spot and I might go back if I'm in the mood but won't go out of my way to come back here. The service was great and fast. Overall, my experience was good.", "author": "Jay G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-11", "description": "Great location for first time Brooklyn touristas. Although thin crust is not my favorite pie, this was exceptional pizza! The coal-fired brick oven did its duty and the pizza was delicious. Being able to watch them make pizzas in the open kitchen is a nice plus.\n\nWe ate on the first floor, with our backs to the oven bricks, which was perfect on a cold, rainy day.\n\nJust a short jaunt down the block is the waterfront and the Brooklyn bridge.", "author": "Alan H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-15", "description": "This pizza is very filling. We got a small with onions, mushrooms and fresh garlic with red sauce. The crust was really crunchy/hard on the outside and really soft/ wet on the inside/center. I gave it a 3 star because I felt the need to dress each slice to taste. I added garlic salt and hot sauce to the pie. Without, it wasn't to my liking. The service is prompt because it often buys and a long line outside; however it moves quickly; between a 30 and 40 minute wait. Our pie and 3 beverages were $35. This establishment is cash only.", "author": "J B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-03", "description": "The pizza was worse than I expected. The store itself was not clean at all. The waiter was not so friendly. Would not go back.", "author": "Hanna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-14", "description": "For my 800th review, I thought it should be something memorable, like my experience at Grimaldi's. \n\nI believe Marshall Eriksen said it best, \"Just pizza? Let me tell you about the thing you say is \"just pizza.\" We begin with the first bite. Aww the crunch, and then marinara, that roiling lava of tomato and oregano it overtakes you. I'm falling. And that's when she catches you. That chewy voluptuous mistress Mozzarella. Oven-kissed cheeks crackle with warmth in your mouth, cradling the sauce and the bread letting you know from now on this is home. This pizza... It's home\" \n\nThe best slice of new york style pizza I had while on my trip....The End! \n\nOverall Thoughts\n\nA journey I am glad I made and one I shall certainly do so when I return back", "author": "Eddie W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-08", "description": "Really not sure what the hype is about. Less than Mediocre pizza and very very rude people. Decided to try it out based on the hype and yelp reviews. Drive from Times square ( when there were better options like Rays pizza here) went to the counter for the To go orders and I told the guy over there I'm new to the place so I needed some help with the ordering and he stopped taking my order and looked up and said\" this is not the place to be if ur undecided, please go out and wait in line\" what the heck? Ur selling me a 20 dollar pizza don't act like it's cavier or something.  And between a 20 dollar pizza which was not even worth the 10 dollar uber drive. The lady who took over from him was equally rude, could be coz they are only used to seeing white people? Don't forget we are paying the same price too like every other customer you have.", "author": "Anju S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-29", "description": "I had one of the worst experiences ever in the restaurant. There were plenty of tables inside, but they lined up people outside in a cold weather (21 F, -7 C). Why should they do so? It looks like they enjoyed it. They definitely had tables for 4 or more, but always called 2 people. We are a group of 6, waited for more than 40 min, almost frozen, and so decided to split, but they switched us with others behind us because I argued about it. Then, the manager said and claimed, \"I am a gentleman\", while doing so. I wonder whether he knows the meaning. Anyhow, I expected a delicious pizza, but it's below average. Even we waited for a small set of pizza for almost another 40 min. I ordered lemonade, but gave me ginger ale. Cheap paper plate and plastic fork were provided. They even put a tip in the check in advance, requesting cash only. I have never ever had such an experience before.", "author": "Kwang C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Awesome! Coal fired, great cheese and sauce! Any toppings you want but don't over do it! Cash only.", "author": "Ernie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "The pizza the well made in a brick. Thin and delicious. They don't accept creator card only cash, however there is an ATM machine inside which charges you $5 fee to withdrawal. The line for two people may vary between 20 to 35 min wait. More people longer you wait. This location is great because you can have a really good time at the park and etc. also, there is a boat to take you to manhattan, $2,75.", "author": "Gabi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-23", "description": "One of the best pizzas I ever had! Decided to check it out after walking the Brooklyn bridge. It was 3 of us and we ordered a large pepperoni, perfect size for all of us. Def a go to when visiting Brooklyn !", "author": "Angel B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-05", "description": "Maybe I expected way too much before I got there.\nNothing really great or bad.\nThe price was I think really in the good range.\nThe location was awesome, walking distance to the great view of the Brooklyn bridge!  \nTaste: I think I can taste similar one here in Las Vegas (now).", "author": "Bo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "My second time here was as fine experience as the first. My family and I were welcomed in to a table upstairs and was delighted to hear Depeche Mode in the background. I expressed my approval to the manager and he kept it playing for the time we were there. The pizza is some of the best in the world. Thin crust, fresh ingredients, and not too much cheese. About $16 for a large pizza of 8 slices which fed 4 of us. The only catch is there is a queue outside that may take 30 minutes.", "author": "Greg R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-20", "description": "Very famous place and was recommended by a true Brooklyn native. There was a line, but it moved pretty quickly.  Not much to look at if they seat you upstairs. My husband and I order a small regular pepperoni and mushroom pizza.  It was pretty tasty, but not the best I have ever had.  It is a great place, but I gave it 4 stars because I guess I was expecting a wow factor I just didn't get.", "author": "Katie T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-18", "description": "Not worth it and so blah. Didn't want to wait in line at Juliana's in the rain so we opted for Grimaldi's. Bad decision. Pizza was sub par, calzone had zero flavor. Waiter was so boring and kept saying they only had pizza. He was then eating a salad at the bar, huh? So weird and so not flavorful for NY Pizza! Juliana's is 100% better and tasty! Worth it to wait in their line! It's my go to for pizza in Dumbo.", "author": "Brooke B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "Do yourself a favor, call and ** ORDER TAKEOUT **. If you are local and want to have an amazing pizza, call in, pick it up 30 minutes later and eat it at home. If you are a tourist, eat it in the park with an amazing view. The restaurant is not great inside, plus it's not the original building, but pizza is really really good, and gets even better when you walk past that line and pickup exactly what you want and when you want it.", "author": "Mike N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-28", "description": "Simply put, this is good pizza.  It's coal fired, and you can't get that very many places.\n\nWe ordered the classic, margarita.  You can tell they use amazing ingredients.   I was told the tomatoes are imported from Italy, and the mozzarella cheese has come from the same New York family for about 75 years.\n\nThe crust was thin and crispy, and doesn't come with a pile of cheese... just like it is supposed too.  If you want to know if a pizzeria uses fresh high quality cheese, just look and see how much grease is on top of the pizza.  More grease = less quality.  You won't find any grease, and actually, they use a bit of olive oil to bring out the amazing flavors.\n\nIt's worth a trip, where else do you find coal fired pizza?", "author": "Eric W."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}