{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-25", "description": "We came here for an early dinner and didn't have to wait for a table.  We ordered the Pepperoni, Italian Sausage and Mushroom Pizza made in a brick oven. Absolutely delicious! Pizza was eaten with paper plates and plastic forks.", "author": "Ken L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-11", "description": "I'm torn on what rating to give...\n\nThe food a solid 4 stars. It was good, not THE best i've ever had. but it's pretty high up there. Def only get the small for 2 people, it's plenty! We had the pepperoni which was actually the best part of the pizza.\n\nThe service is easily a 1 star. They seemed bothered that we were even in the joint. Plopped down the soda on the table took the order, never refilled our water (89 degree day after walking the BK bridge and there's barely a hint of AC in the restaurant). Grabbed our check again no words just plopped it on the table. I guess they don't need to care with all the tourists they get coming in. \n\nThe ambiance is again a 1 star. No real AC and just table fans filling the place on again a hot and humid day. No music. No tv's on (though there were tv's on the wall). All you could hear was the table next to you.\n\n\nGoing with a 3 because i'd much rather go to any other NY pizza joint that is just as good at a better price without the 'tude and the schlep to Brooklyn from Manhattan.\n\nps CASH ONLY", "author": "Lea B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-25", "description": "Too much hype. It's better than your chain pizzerias such as papa John's and pizza hut but not even close to other authentic Italian pizza place", "author": "Luc T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-10", "description": "Ever since I went here for pizza, other places have not met my expectations.\n\nMy girlfriends and I went here on a whim on a random weekday afternoon and it was packed! The line was long but we didn't mind the wait since we heard about how good this place was. \n\nWhen we finally got seated and ordered the food came out almost instantly.  The pizza was absolutely delicious! I love that they use fresh mozzarella on their pizzas.  It was thin and crispy, just how I typically like my pizza.  Between 3 girls, we devoured the large pizza within minutes.\n\nWhenever I'm in New York and craving pizza, this place will definitely come to mind.  I wish we had one in San Diego!", "author": "Amy N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-12", "description": "Such a disappointment. I was last at Grimaldi's a number of years ago, when it was still under the old owner, in the old space and making pizza by the old recipes. This new version doesn't remotely measure up. The mozzarella is industrial, the crust is soggy, and the sauce is bland. I'll be taking my pizza dollars elsewhere.", "author": "M V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-15", "description": "Living several minutes away from Garden City makes Grimaldi's something well-known in my travels for pizza. In that venue, you'll see a lovely painted image of the original location under the Brooklyn Bridge. Today, I got to live that image as my girlfriend and I ventured off to have a pie at this original Brooklyn pizza establishment. At a bustling street corner right by that classic bridge named for the borough you'll find Grimaldi's. We waited outside under some nice umbrellas for about 5 minutes before getting seated inside near the bar area. The restaurant is quite small in terms of width, but has height to it as there's an upstairs dining area as well. We were squished in next to another pair of two, but it seemed to add to the ambiance of the place. Service was a bit sporadic to begin and end the visit, but the center of our time there (the eating part) was what we hoped to expect. We began with antipasto and finished with a small pie, half plain and half meatball. The antipasto had fresh pieces of salami and mozzarella along with juicy olives and tomato slices. As for the pizza, it was just what we expected if not better. Melted mozzarella cheese with basil and large pieces of meatball with a wonderful sauce made this a great meal. Overall, it was nice experiencing the original Grimaldi's while spending the day in Brooklyn, though next time I might just stick to Garden City (or Douglaston) to save a little time on commute.", "author": "Josh G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-21", "description": "Absolutely loved it! The pizza is amazing and it tastes very fresh. I would definitely recommend this place but please remember CASH ONLY! This is a big turn off , and since there's a lot of customers the two ATMs run out of money fast. It was a great experience but the cash only part left it at 3 stars.", "author": "Camila M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-06", "description": "After 6 years in NYC I finally made it to Grimaldi's in Dumbo, Brooklyn.  We went with a small group of 5 visiting from CA so we had to show them what NY pizza was all about.  They were down to wait no matter the how long so that was a huge factor.  It was 30's out and windy but our wait wasn't too bad at 3pm got in within 30 mins.\n\nWe ordered two pizzas: 1) Margherita with Garlic and 2) Pepperoni, Sausage, and Garlic\n\nBoth were a hit and extremely delicious.  We loved the crust and the sauce flavored very good.  No one complained and usually my girl from CA loves to complain so this was very impressive!!!!!", "author": "Sourivone V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "This was one of the best pizzas I've ever had. The service was very good, and the building was really cool. It was a former bank. We got a pepperoni and meatball, and it was delicious! The pepperoni is the good kind that has the grease on top of it.", "author": "Priscilla L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-13", "description": "Wth? I never wrote a review for this place? Yes, it's a NYC institution and the summer lines are freakin insane! Lucky for me I live in Queens and there is a location in Douglaston. Giddy up! Grimaldi's is one of the longest standing pizzerias in NYC. There is so much history to this place. It's kinda funny how the current location was actually the original location, then moved to 19 Fulton street only to move back to the current location. Weird. The place is not fancy, it's super casual, there are no slices, there are no reservations and the service is kinda ho hum. But you go for the food.\n\nThe food:\n\nAntipasto- Genoa Salami, oven-roasted sweet red peppers, fresh Mozzarella, Sicilian olives, oven toasted crostini. I thought this app was really nice. The fresh mozz was great, it had really nice texture, the sweetness of the peppers was a nice complement, the olives offered a nice salty punch and the Salami was good but I enjoyed everything else a tad more.\n\nRegular pie- The pies are great, the sauce has a nice sweetness and the mozz is great. Pepperoni they use is fantastic, the sausage crumbles were good, the mushrooms are a nice addition. The pies are great but on one or two occasions I had a soggy middle and that bothers me. Overall I say it's one of the top pies in New York.", "author": "Ben L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-25", "description": "I first visited Grimaldi's about six years ago. At the time, I wasn't impressed. An interminably long wait ended in a sub-par pizza. But it turns out that the passage of time in addition to the restaurant's slight move down the street to a larger place has really improved the Grimaldi's experience.\n\nMost notable was the lack of a wait; we walked right in. And then the pizza tasted much better than I remembered. We ordered ours with pepperoni and sausage. I particularly enjoyed the crisp and tender crust, the thicker-sliced pepperoni, and the quality mozzarella absent the greasiness that often characterizes New York-style pizza.\n\nThe only negative of the visit is that I was dismayed to find that Grimaldi's is cash-only, which I find rather odd for the prime location of a chain that stretches as far as my home state of California.\n\nSummary: Not quite as Grim as before.", "author": "Rene P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Stopped here for lunch while on a weekend away after reading recommendations. Loved the setting and atmosphere, staff and service were great, pizza was delicious. Big thumbs up for Grimaldi's.", "author": "Carrie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-02", "description": "Grimaldi's\nNY: Brooklyn: DUMBO\n1pm Saturday 2nd May 2015\nFive Stars\n\nIts not like I have anything special to add but for posterity's sake. Here goes:\nI had some San Diego Friends  in town and NY Pizza was on the todo list. So we started with bagels and ice cream and then meandered through Brooklyn Bridge Park to DUMBO.  The line was short. It only took 25 minutes to get a seat. We sat upstairs and watched them make pie after pie like a mechanized assembly line.  We ordered a Large with Pepperoni, Sausage, and fresh Jalapenos. In another 20 minutes, we got a fresh coal fired pizza.  The crust was thin and crispy with a hint of char.  The sauce was simple and very understated (I prefer way more sauce).  The fresh basil added a nice aroma.  It had plenty of pepperoni which were dime size in circumference but nickel size in thickness.  The Sausage was fatty and very moist.  The Jalapenos were still crispy and add plenty of spice. Overall, it was great pizza for a normal price at one of the most famous places in New York.  If you cannot cope with a wait then go somewhere else. \n\nTips:\n To Stay and To Go = Same Line\n Cash Only\n No Single Slices\n Get a Large its worth the $2 Extra", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-19", "description": "I was really excited to try out Grimaldi's, one of the famous coal brick-oven pizzerias in NY.  I loved reading how their coal-oven is hand-built and that they have fresh mozzarella delivered daily.  Since the hubs and I were in the DUMBO area, we decided to check them out!  Their menu offers pizzas (white or regular), calzones, and desserts (homemade cannoli, tortini, tartufo, and spumoni) - I liked how their menu is pizza-centered!  They do not offer pizza-by-the-slice (which was totally fine), so we ordered a Small Regular Pizza with pepperoni and 'fresh garlic.'  The pizza was ready in 10 minutes, which was nice!  When we received the pizza, I noticed that it didn't really look appetizing - it seemed unevenly cooked, as the edges were a bit burnt, and the interior of the pie was not really cooked through.  The pizza itself was also not tasty - the pepperoni had that nice curling action, but there was no 'fresh garlic' taste at all, not even a subtle hint.  In addition, the mozzarella was not melted all the way through, due to the uneven baking, and it just tasted as if you were biting into the cheese slices, set on top of tomato sauce.  We were both pretty disappointed, as we heard rave reviews of this place; however, our experience was pretty underwhelming T___T  Our server was really nice, though, but we'll not be back!\n\n+located in the historic white DUMBO bank building\n+disappointing pizza T___T\n+no pizza-by-the-slice option", "author": "Hannah H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-19", "description": "Came here for lunch yesterday and must have beaten the crowd because we were sat right away. The tables are tiny and it feels a little crammed inside but since it was a cooler day and it was nice and warm inside I didn't mind it. All the staff are so nice and welcoming. \n\nWe ordered a large pizza to share with meatballs, pepperoni and mushrooms. It came out really fast and nice and hot. The crust is just about perfect and it has a nice sauce. I was disappointed with the other ingredients though. The meatballs are definitely not homemade. They are slices of something very highly processed. Did not have the look of meat at all just a sad gray circle. Pepperonis were fine but I wish there were more mushrooms, there were not too many to be found. As the mozzarella cooled it became almost rubbery on top but it's still cheese so still pretty tasty.\n\nI would give this place another try. I would skip the meatballs and maybe stick to vegetables next time.", "author": "Jen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-01", "description": "This is a must try- a true NY slice to the core! A little bit of a wait initially, but once we were seated it was totally worth it. Their sauce was super yummy, and pizza was done perfectly. Highly suggest adding ricotta to your pizza!! Would definitely come back.", "author": "Kate A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-21", "description": "Great pizza, generous portions and a whole lot of filling. However, the wait (we had to wait outside for about an hour before we even got in, not to mention the wait once we were finally inside) and the prizing is the reason why I only give it three stars. My group really craved for a beer with the food after the long wait, but unfortunately they do not serve alcohol.\n\nThe pizza is worth the buzz, but I would think you could get more food for your money (and precious time!!) elsewhere.", "author": "Sanne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-03", "description": "Grimaldi's was one of our first meals in NYC. We came looking for some good New York pizza and we were not disappointed. We did one pizza with red sauce and pepperoni and sausage, and one with white sauce, chicken, tomatoes, ricotta and basil. The dough was good and it was the thin, floppy New York pizza that we were looking for. The chicken on the white pizza was breaded which I found a bit weird, and the basil was burned to a crisp. It looked like they put the basil on before cooking the pizza, which is not my preference. We were overall pleased with our meal at Grimaldi's though. It's good pizza and just a few minutes from the Brooklyn Bridge.", "author": "Maggie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-14", "description": "Best pizza ever. Period.\n\nWhen I have regular pizza, I ask myself, why am I not having Grimaldi's? All other pizza taste like cardboard compared to Grimaldi's godly pies.  At $14+ per pie, you are really not breaking the bank here.  \n\nDon't be scared of the line, it moves quickly since the restaurant has two levels of seating. I never waited over 30 minutes nor have I ever felt that the wait wasn't worth it.", "author": "Susan N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-10", "description": "It's the line you always pass by on the way to or from Brooklyn Bridge Park.  It can't really be worth waiting an hour in the summer sun for, can it?  After years of skipping the wait, I finally gave in and found myself here around 6pm on a weekday night.  Luckily, there are no lines on weekday night in spring.  The decor is pretty fitting for the old school Brooklyn pizza vibe - lots of vintage posters and rugged wear on everything in the room.  \n\nThe pizza, overall, wasn't superb but wasn't bad either.  Let's say I'm very glad I never waited on line for Grimaldi's.  The tomato sauce is a bit mild, lacking substantive punch or kick to it..  Had to rely on pepper or other toppings.  Thus, of the 3 types I tried - regular mozzarella, regular with sausage, and white - the regular with sausage was best.  The white didn't have much garlic in it and the cheese was a bit too chewy.  Perhaps I just wasn't hungry that day, but couldn't finish my pizza.  Good service, but a bit overrated.", "author": "Richard M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}