{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "We traveled here from Arizona and didn't come here because we had so many chain restaurants of Grimaldi's in our own town. Boy, were we WRONG to miss this on our first trip!! We went on a food tour and heard that the reason this one is so popular is because if the water and how it affects the taste of the crust. In fact, the pizza was so different that they had to bring in a special water filtration system in AZ to try to make the pizza taste the same. Today I had our first pizza here in New York and can honestly say it is 100x better than any of the chain restaurants. Don't miss this stop! It was one of our best meals!!", "author": "Alicia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-26", "description": "The pizza was excellent. It's cash only so come prepared.  There is no alcohol sold here. The wait was not as long as I thought it would be. They seem to do their best to usher people in and out. Long story short I stuffed my face with pizza and it was delicious!!!!", "author": "Sam B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-24", "description": "Great place...great pizza...cash only, and like any New York spot there is a wait and these guys are not here for small chit chat. loved it but in my\nOpinion not the best pizza I've had", "author": "yolanda c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "Pizza was great.  We were going to the fancy pizza resturant next door, but it just couldn't compare.  This place is really delish.  The crust on the ends are even tasty. The cheese is perfect and will sting. Just wish they had beer and wine then it would be 6 stars. Oh and the service was great.  The pizza was out in 15 minutes.  You got to try this!!!", "author": "Sharon H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-29", "description": "Went to this place with my family and service was pretty slow. But the line might seem long but it actually fast lol. Pizza taste soo good can't even explain. I will definitely come back.", "author": "Karen L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-06", "description": "Shitty pizza shitty service. I have no idea it is ranked so high. It was not worth the wait and the money.", "author": "Shao-Hsuan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-24", "description": "I wasn't sure if having a coal fired pizza oven made a difference or not. One of my friends insisted I try Grimaldi's pizza because they use this type of oven. The pizza is very good. Thin crispy crust, the cheese was delicious too. \n\nStill not sure if the coal oven makes a huge difference or not, but their pizza is good. Eating here at the location under the Brooklyn Bridge adds an aura to the experience too. A short distance from the waterfront so you can eat and then walk it off whilst enjoying the skyline. CASH ONLY and they don't do slices here.", "author": "David H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-19", "description": "Beautiful pizzas are made here in an old building by the Brooklyn Bridge.  The location has the ambiance of a basement but who gives a care about that!  \n\nPizzas are absolutely delicious.  My favorite is a white pie with fresh tomato, garlic and chicken.  \n\nI have eaten at every single Grimaldi's in the Las Vegas area and I'm glad they faithfully deliver the same great pizza.  \n\nAlso, it's less expensive than Lombardi's in SoHo. Staff is cheery and friendly and very appreciative of your business.", "author": "Peter H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-26", "description": "I have had a few days to think about this iconic Brooklyn pizza joint and I keep coming back to the pie.  It was just great.  It is a thinner crust and you can tell there is some guy who rolled the fresh dough out with the skill that only comes after a few thousand pies.  The sauce is like you would expect in a place with the strong reputation. and the toppings are fresh and generous.\n\nTips - bring cash - that's all they take.  Be patient and be ready to wait in line (especially if the ferry just arrives), bring a hat - the sun in the waiting line gets hot.  Bring your appetite.  Enjoy!", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-14", "description": "Came here when I was in town a few years ago and have been looking forward to coming back ever since. The pizza is phenomenal. So glad I made it back today.", "author": "C D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-21", "description": "Great Pizza!  Love the historic building - great service, we had an extra slice we took back to the hotel, man it's still good.  Small seating area but worth it!  If you are in the area and have some time for a great slice of pizza - you better stop by!!!", "author": "Joey M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-21", "description": "Service was eh. Not that friendly but not rude either. The pizza isn't bad, but it's not the best. Pizza is not always consistent. The last time we went to Grimaldi's, the dough was a little too tough and chewy. The only reason we came here was because there was no line. Usually there are long lines but we were lucky (and we came on a weekday).", "author": "Vivian M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-03", "description": "A tourist trap, Grimaldi's.\n\nUnfortunately we didn't really have a choice about going here, the people we met up with had their heart set on going here and so we went along. \n\nAppearing open we went in, but we were unceremoniously ordered to go back outside and wait, in a queue that was yet to form. But hey, we're first in the queue, so it wasn't all bad. And a long queue did form. \n\nAfter a 15 mins wait we went in and were served really quickly. Which was good and bad. Good we were fed really quickly. Bad, the staff hovering over our table to get us out quick so they could seat the next lot of people. \n\nPizza was good. But the whole attitude of the business took away from my experience. \n\nGo if you really must, but you'll pay over the odds for a rushed meal you'll probably have queue a while to experience. \n\nNope. Not for me.", "author": "Cristin L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-04", "description": "Cash only. Yup. $18 a pie. Toppings are extra. No single slices.\n\nOn the menu \"liquor license pending\". You think they would make nice with government agencies with all the dough they roll in daily. Well if Frank had paid the taxes and didn't have a rap they would've never lost it in the first place. \n\nWe brought out of town family for \"authentic italian pizza\". Waited on line in 30 degree weather for about 30 min. I much prefer Lombardi's on Spring street but my sister had her heart set on the Brooklyn Bridge, Brooklyn Ice cream factory and Grimaldi's. So off we went. They sat us upstairs (13 of us). We took up a whole wall of tables.\n\nThe tables are decked out in traditional red n white checkered tablecloths and not so traditional plastic plates with plastic cutlery. Orders were placed swiftly. Food arrived just as fast. It tasted great. Dough was crispy and it had a good sauce and cheese ratio. How hard is it to mess up pizza? One, two, three and they're handing you the bill to get the heck out. That line has to shorten, of course. They conveniently have atms on all 3 floors in case you forgot they were cash only and arrived with plastic.\n\nI went to the 3rd floor to use the restroom. The stairs leading up are open, old and creepy. The lights are so dim that you can't see the steps at the top which is a hazard. There's a big door at the top of the stairs that says \"Private\". My nosy family had already walked in to find a huge empty room with beautiful tall windows and a bar. After seeing this, I'm convinced the line is for show only because they could clearly arrange over 25 tables in that room.\n\nBack to the restroom. It was so dim that you were a shadow in the mirror. Single toilet only. There was paper all over the floor. The empty soap dispenser on the wall was hanging for life. There were holes in the wall which I assume is where the napkin dispenser once stood. On the sink, was a wet paper towel roll and a bottle of almond scented 99 cent soap. Keepin it classy.", "author": "Shirley V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-29", "description": "A restaurant with a racist attitude. \nWe waited in line for 1 hour to get inside the restaurant. We were a party of 2. First of all, they seated 3 groups of people who were behind us, before they seated us. When I questioned that, he said they don't have empty 2 seater tables. When we went inside eventually, I saw at least 10 empty tables for 2 people. Once we were seated and gave our order, we waited for about 20 mins. I saw that they had stopped making pizzas. I asked the waiter how long it would take before they would serve us the pizza. His answer was arrogant and rude. He said if we wanted the pizza instantly we should come either early morning or late night. We were supposed to wait indefinitely for the pizza to be served. After 30 mins of waiting we decided to just leave. Before leaving I questioned why they let people inside when they are not even making pizza. His answer was rude and racist. He told us \"GO BACK TO YOUR COUNTRY if we can't wait\".\nThis is the worst place you can go to for food. I wish I can give negative stars for this place.", "author": "Malathi R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-08", "description": "Great location! I've been to Grimaldi's a long time ago when they used to be in the smaller space located next door with long lines. Now that the lines are gone there's a lot of space, the pizza remains excellent, and the service is really fast. \n\nThe manager was particularly nice. He ushered me in to wait indoors for the rest of my party. \n\nAs for the pizza, I enjoyed it. We had two large pizzas, with 4 toppings of cheese, mushroom, sausage and ham. What I love is the basil and delicious mozzarella cheese. \n\nI'll return and recommend for sure.", "author": "Ymk D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-30", "description": "Fresh mozzarella was awesome on the pizza, there was just nothing amazingly unique about the original pizza. I love the thin crust though.", "author": "Kay T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-05", "description": "Best pizza we have ever had. The ingredients were so fresh. Real buffalo mozzarella! Thin crust. I'm definitely going to try and come back before we leave the city.", "author": "Jen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-25", "description": "My husband brought me here while we were in New York.  He has always talked about it so I had high expectations.  It was probably one of the top pizzas I have eaten.  \nI live the use of fresh mozzarella on the pizza and the crust was very tasty.  We lucked out and got there just before the crowd and didn't have to wait.  This will be a place we visit again!", "author": "Stacy O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-22", "description": "It's an establishment - got it.  For the pizza, I enjoyed the pepperoni.  The tomato sauce was ok - could have used more.  The white cheese is also ok.  The hype for me didn't necessarily deliver.  The olive and vegetarian was good with interesting flavors but not my favorite.  They serve Stewart's and it's the tried formula of brick oven thin crust pizza with no frills.  I'm partial to NJ pizza and this place has nothing over Trenton pies.", "author": "K D."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}