{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-28", "description": "Great pizza....and this is from a CT Pepe's/Sally's pizza snob. Although the line was long, it moved quickly.  Our waiter was wonderful, so accommodating. A must try if you are in the area.", "author": "Jackie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-15", "description": "I would consider myself a pizza aficionado.  I am also a purist.  I like my pies basic, that way you can taste the quality of the ingredients and appreciate the textures.  \n\nReasons I love this pizza:\n\nOnce you get seated and order, the pizza comes quick (I guess because the ovens are so hot the pies cook in no time)\nWhen they delivered it to our table, the pie wasn't too hot to eat so you can just inhale the first slice.\nThe second I tasted this pie, I knew it was the real deal.  I heard the faint sounds of angels singing as the chewy / crispy dough danced around my mouth.  \nNext, the fresh taste of the sauce and mozzarella cheese with just a hint of basil, is what these ingredients want to be when they grow up.\nIt's cheap!  You can spend much more money eating at a chain restaurant, but why would you want to?  If you are in Manhattan, do yourself a favor and cross the Brooklyn bridge for the best pizza this side of Rome.", "author": "Tony M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-31", "description": "Its 2013 and they still don't take credit cards?? They do however have an ATM that will bang you for $4.50 to get money to pay your bill. I don't care how good the pizza is, its Brooklyn and I can find a great brick oven pizza place that doesn't rip off its customers like that.", "author": "Kenny M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-16", "description": "What happened to this place? \nThe new location is on the corner but the decor sucks. I mean the original restaurant had that old BK feel but this place feels like youve walked into a eastern european restaurant in Astoria, Queens. I will say I still liked the pizza but I felt this place was partially great because of the atmosphere.", "author": "Roo P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-27", "description": "What's the story?\nThis 9 generation, Italian-owned authentic pizzeria has one of the three remaining coal-fired brick oven's in the entire city.  What makes it so special is the final flavors and the texture of their pizza that results from this one of a kind oven.  The city prohibits any more of these ovens because of the risk that they may burn down an entire establishment.  However, they are still privileged (I don't know why) to be exclusively using one from way back when this pizza joint began and making NY's #1 pizza.\n\nWhy is it SO DAMN GOOD?\nBecause of the special oven, the pizzas are cooked flawlessly with ingredients melted on top, slightly doughy in the middle and still with a hint of crisp-and-chew on the very bottom.  When you take that first bite, that melted cheese will just come right at you and you won't even know what hit you.  You may be slightly interrupted as you try to control the strings of cheesiness dribbling down your mouth but your tongue will get a sliver of the tomato sauce and hint of basil as you notice a slight smokiness (burn from the coals) that rounds out your mouth as you chew your way and push that pizza down towards stomach heaven.\n\nHow do they do it?\nWell, on top of all this, they use very FRESH ingredients. They use fresh mozzarella slices instead of shredded cheese, which results in super cheesy-stringy-neverending yummy pizza.  You would imagine them prepping the dough, then the tomato sauce on top, then the cheese and finally extra ingredients.  No, the tomato sauce is drizzled on LAST after the cheese and any extra ingredients are put on with the fresh basil sprinkled on top  ...Finally, another masterpiece seasoned goes into the oven!\n\nWhat to order?!\nOrder what you want but if you don't come in here and order a 'plain pie' which is your basic cheese w/basil, you are missing out on life!  Oh, and a large is really not THAT large since the slices are thin.  Trust me, 2 people can definitely finish that.  \n\nCash Only, No slices- only whole pies, \u0026 No Reservations.  I was lucky to not have had to wait in that gregarious long line since I came at 5pm.  Transportation wise - 1) Either walk across the Brooklyn Bridge or 2) Take the subway and walk 5-10 minutes towards the harbor or 3) Find the oh-so-limited meter spaces around or pay $12 for some parking", "author": "Jessica C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-15", "description": "I liked the flavor of the pizza and a chance to pick my own topping, but I felt they should have their own recommended type as well. Otherwise cheesy and fresh, which is expected since there's a gazillion ppl.", "author": "Queenie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-28", "description": "The pies are good. really good.\n \nWe waited for around 45 mins.  (Sat afternoon)\n\n**tip, apparently when it rains the lines are REALLY short, go when there is bad weather.\n\n\nThere was a man who came by to make sure we were doing ok in line and give us updates on how much longer we'd have to wait (very friendly).  \n\nThe pizza is thin, crust is chewy.  The whole thing looks small but is deceivingly dense.  I was full at 2 slices, but ate three.", "author": "Grace K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-12", "description": "The pizza is unquestionably delish! But what i dont like about this place is its so overrated that you have to wait in line for hours just to get in! If you are hungry, you better go somewhere else.", "author": "Pandora S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-19", "description": "I came here with a few friends and the wait was 45 minutes which wasn't that bad because we were seated faster and we were let in before a lot of people that were in front of us. lucky, right? We ordered two pies, and i'm usually not a fan of meat toppings on pizza, but the sausage in particular was very good. It  had a sweet taste. The pizza had a thin crust that me and my boyfriend prefer.  We also ordered a  veggie pizza which was good as well. The price wasn't bad, I would definitely come back and order more pies!!!", "author": "Carmen L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-19", "description": "Did the whole walk across Brooklyn Bridge and eat at Grimaldi's.\n\nWait was roughly 30 minutes.  There was some schmuck from out of town who schmoozed with the owner and was able to get in along with his friends/family of about 8 in front of the rest of the line.  That didn't feel too nice.\n\nWhen seated, fortunately we were the end seats of about 8-10 seater table, most (I think all) of us were a couple of 2 - so yeah, you're seated next to a stranger:(  \n\nGot a large \"regular\" pizza w/ mozzarella and basil.  Okay, the pizza tasted really good, maybe the crust is thinner than I'd prefer.  But the wait was too long and the place too crowded and boring to instill a desire to return.  Will go to John's Pizzeria off of Bleeker St for pizza just as good, no wait, and much nicer ambiance.", "author": "Bec C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-26", "description": "Delicious pizza with quality ingredients. Crust tasted great, good chew and char. Sauce was delicious, just an all around good pie. Worth the wait but the service was a bit sketchy as in rude and if we were not in a public place, dude may have been inclined to mug us. Would still go back though:)", "author": "Jason S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-18", "description": "Pizza in my mind for dinner, I have quests, took them there last night, boy-o-boy was it bad! Shamefully bad. No descent pizza baker would serve what we had last night. Doug was't risen properly, it did not have any air. It tasted like a unrisen doug and leathery.\ni asked garlic as the part of my topping, it wasn't chopped properly, a  whole piece was just sitting there.\nI felt bad spending al that money, I felt bad for all these people who wait to eat there.\nThere are so many delicious places in NYC, not this place. do not read old articles and reviews and think you will have a good meal here, you are not.", "author": "I I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-21", "description": "It was ok. The pizza was good, not life changing, average service and an obscenely long  wait for a table.", "author": "David A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-28", "description": "Sometimes all the right opportunities fall right into my lap. And I'm there to swoop them up and give them a good nuzzle and cuddle.\n\nTake Grimaldi's. Never heard a thing about it until last night when some idle chatter with a friend in Hoboken brought up the topic of yummy pizza. This was his recommendation and lucky for me, I remembered the name.\nAdd in the opportunity to be in Brooklyn, just before 5 pm, oodles of people on the subway and on the street who knew exactly where Grimaldi's was and were happy to keep pointing me in the right direction.\nThrow in no queues, friendly guys working there, entertaining couples at the tables around us, fast service of our 18\" pie, a great price, plenty of cash on hand to pay for it, and leftovers for the next day...\n\n...what's there to be unhappy about? Nothing, I tell you. I had a great experience. \n\nThe combination of herbs in the sauce and as toppings was delicious. The smoky crisp crust and underside made for a smart fold.\nThe thinly sliced mozz that spead out around the edge of the pizza made for good photos and tastiness. Mmm. \n\nI bore my paper wrapped leftovers proudly on the train back to Manhattan.", "author": "Lemonjelly L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-15", "description": "We had a one hour wait on a Saturday evening, and it was worth the wait.  The experience of walking across the Brooklyn bridge and then grabbing pizza was outstanding.  \n\nThe pizza itself is solid and quite tasty.  It isn't mind blowing by any means, but you certainly won't be disappointed by the fresh basil and real mozzarella.  I downed four slices in record time.\n\nThe price was about $14 for a basic pizza with 8 slices - completely reasonable.  \n\nThe restaurant is clean and has lots of exposed brick on the interior.  It was very pleasant.  The service wasn't anything spectacular, but not bad either.\n\nI'd recommend a visit.", "author": "Aaron P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-21", "description": "This was the first of many pizzeria champions I'll be trying in New York.  I went in with a well-grounded expectation.\n\nI was not disappointed.   They're made to order with fresh ingredients, and the coal brick oven scorched the basil leaves that brought out an amazing aroma.\n\nTwo things truly stood out for me: cheese and crust.  The quality mozzarella wasn't greasy at all.  It was light yet full of flavor.  Same goes for airy and chewy crust that you could eat by itself.\n\nThis sets the bar for other pizzas I'll be trying.  Off to Lombardi's next!", "author": "Andrew J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-10", "description": "Under the Brooklyn Bridge is apparently where pizza began in America in 1905. Grimaldi's coal brick-oven pizza attracts lines down the block with hour-long waits. Wondering if the pizza was really worth the quoted wait, I asked the man serving up spumoni on the sidewalk for his thoughts. His response: it's all about the experience. Grimaldi's is heavily decorated, annually being recognized as of the best in the city and showing up on food shows.\n\nThe door is handled like a club, with droves of people clamoring towards the front of the line and a stocky, finger-pointing man asking how many in each party. Luckily, looks don't seal your fate... you just have to bide your time. What we noticed was that the wait to take out was much quicker. So if you're not dead-set on sitting down inside, you can always grab a pie and take it towards the promenade.\n\nThe restaurant has traditional New York Italian restaurant motif with photos of NYC-centric people and places on the walls, red and white checkered tablecloths, and the smell of tomato sauce and baking bread in the air.\n\nWe ordered a large regular pie ($14) - tomato sauce and mozzarella and a half carafe of wine ($10). The pizza was amazing; better than anything just about anywhere else... except Patsy's. Yes, despite the hype, the wait, and the taste, the crust wasn't quite as crisp, the sauce not quite the perfection of sweet and savory, and it was lacking mozzarella. However, the pizza we ordered to go and ate on a nearby bench was considerably more delicious and was \"1B\" to Patsy's \"1A\" pie.\n\nGrimaldi's has branched out with locations in New Jersey, Arizona, Texas, and Florida.\n\nAnd keep these tips in mind: No reservations. No credit cards. No slices. No delivery.", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-27", "description": "We waited outside for an hour an a half in 23 degree weather for this and it was worth every second! It's not doused in pizza sauce everywhere and the amount of cheese is just right! \n\nI wanted to try the best pizza in New York and after trying a few highly recommended places, this took the cannoli....seriously, they also have HUGE cannolis!\n\nWhat I wouldn't give to be back there...sigh..", "author": "Arpa O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-12", "description": "One of the best pizza spots in New York. Been going here since I was a baby \u0026 still love this place till this day", "author": "Armin R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-04", "description": "If you are looking for the true Grimaldi's, look no further than the place next door. This spot only has the Grimaldi's name from when Patsy sold the rights to Frank Ciolli back in 1998. Since 1998, the pizza has had no true affiliation with the Grimaldi family.\n\nAs a Brooklyn resident, I can attest to the plethora of better pizza options in the borough. One of the more notable places happens to reside at 19 Old Fulton Street, which is also the original location for Grimaldi's when Patsy owned the restaurant. Juliana's in fact has the original coal oven, making Juliana's truly the original in that it is owned and run by Patsy himself, is in the original location, and has the original oven.\n\nGrimaldi's has a tacky sign claiming they are the original Grimaldi pizza, which is no more than false advertising. Grimaldi's in essence is now a tourist trap. Works out better for me considering when the lines are always so long at Grimaldi's, I can always walk in for the authentic Patsy pizza at Juliana's with much less of a wait. \n\nAlso, Grimaldi's has terrible service, they display a tacky sign on the front door that the restaurant is \"cash only,\" and only care about quickly serving pies so they can get to the next people in line rather than focus on the quality of the service. \n\nIf you want a rushed dining experience for pizza that is not truly the original, so be it. But if you open your eyes, you can have the truly authentic Grimaldi's pie right next door at Juliana's. And chances are you will get to meet Patsy himself as he loves to greet customers and ensure a pleasurable dining experience for his clientele. The choice is yours.", "author": "Lisa N."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}