{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-27", "description": "You can tell this place is managed with precision and excellence! I love the pizza crust. I love the attention to customers, in that they get you in and out even when it's super busy. Could be cleaner.", "author": "Audrey S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-27", "description": "I thought the pizza was good but not the best I have ever had. I will never go again and wait in that line up. I think people just go b/c there is a line up to get in, but trust me if you want really good pizza this is not the place.", "author": "Stacey J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-26", "description": "Don't waste your time waiting on those long lines. The other location in Douglaston, Queens has less crowds.", "author": "Shanette D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-16", "description": "Tourist looking for NYC pizza. This place has a grade pending on the health department.... I researched this rating and it is not good!!! Check these places before you eat people!", "author": "Sherill M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-25", "description": "This pizza is well worth the wait.  This is my second visit and I will return.  The techno dance music pumping inside made conversation difficult.  Drop the dance track in favor of something more conducive to digestion.", "author": "David L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-23", "description": "It was fun to go. It was good. I am glad we ordered in advance because that line is scary", "author": "Steph G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-23", "description": "Waited 20 minutes in hot sun for the shop to open.  Tour bus pulls up.  All of bus gets into restaurant before those who had been waiting.  Employee says \"Oh, we have a contract with them\".  We left, went next door to Juliana's for terrific pizza \u0026 pleasant staff.  Turns out Juliana's is the REAL Grimaldi's.", "author": "Lorraine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-17", "description": "I say this as a native New Yorker: despite how ordinary the pizza is, Grimaldi's is something every resident needs to experience at least once.  \n\nCome when the weather's nice for a perfect, somewhat kitschy, somewhat classic, somewhat lame, and yet somehow entirely perfect date. Walk over the Brooklyn Bridge, wait on the deceptively long line, pour your date a glass of water from the water cooler outside, meet a few strangers, and you've paid your dues to park your toosh at a narrow table with no elbow room. The decor is straight-up pizza shop: waxy red gingham tablecloths, carafes of house red wine, and a brick oven handled by a bunch of hairy-armed Italian guys. The pizza, though somewhat soggy, is loaded down with an almost absurd amount of mozzarella, sauce, and toppings, with a crust that is soggy in the middle but crispy and slightly scorched on the end. It is without a doubt delicious, sitting heavily in your stomach. When you finish and pack up the leftovers, skip the meager offering of desserts and drag yourselves over to the promenade for a scoop of ice cream at the Brooklyn Ice Cream Factory. You're guaranteed to wait on yet another line, but again, it's part of the experience. Despite the amount of tourists it attracts, I am adamant in my conviction that Grimaldi's and Brooklyn Ice Cream Factory are quintessential New York joints. So suck up your pride and go!   \n\nI am completely serious when I say the line-waiting is essential to enjoying Grimaldi's. There is a location in no-man's-land Queens (Douglaston) that serves a superior pizza (perfect crust, sauce, cheese) in a similar setting without ever having to wait. And because of that, it really doesn't feel the same and the pizza just seems overpriced. It seems counter intuitive, to enjoy a mediocre pizza more when you have to wait for it, but its entirely essential to appreciate and pay homage to the pizza mecca that is Grimaldi's Brooklyn.", "author": "lora c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-19", "description": "It is true, the line can be SOOO long, even on a wednesday evening in the middle of winter, but every minute standing outside in line is worth a grimaldis pie. They rarely have an off day (I've been going there for 10 years, and its 99% amazing). The service is so-so, they kind of make you feel rushed, you can't get slices, they don't deliver, its relatively expensive for pizza, but I still highly recommend. The crust is very thin, they put just the right amount of fresh mozzarella and sauce on, plus fresh basil. I've never ordered anything else from the menu, but they also offer calzones and anti-pastos.", "author": "Karen V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-28", "description": "pizza is just fine\nas long as there is no line\ntourists are crazy", "author": "Will Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-05", "description": "It's worth the hype. It's trendy, touristy, and busy as hell -- but the pizza is delicious, and the ambiance is worth it. Eat delicious pizza at a place Frank Sinatra used to hang out at (for good reason). Too bad they might be closing soon at this location (moving into Manhattan b/c their lease wasn't renewed).", "author": "Justin P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-04", "description": "So I went here on my first visit to NYC after living in Chicago or a few years.  It was a rainy Sunday afternoon...\n\nSo only 3 stars?  I believe that NY pizza is good, but it's just not as good as deep dish.  The wait was too long for this because the restaurant is small.  Luckily (from what I gather), I only waited 40 min outside in the rain.  \n\nThe pizza was definitely good though.  It had a nice thinner crust and there were definitely toppings on it.  The price was a little higher than I would've liked, but it's NYC.  A very friendly wait staff, but they were a little busy.  \n\nOverall, the place is good.  I wouldn't wait an hour to eat there again, but the food is good.", "author": "Nate W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-03", "description": "A whole bunch of friends raved about this place and talked about the always present line to get into the place so I had high expectations.\n\nMaybe my expectations were too high, because I thought the pizza was just okay.  We ordered two different pizzas with red sauce as follows:\n\nPizza #1: Italian sausage, mushrooms and onions\nPizza #2: Pepperoni, sundried tomatoes, and garlic\n\nI'm glad we ordered two different pizzas; Had I only eaten Pizza #1, I would have been extremely disappointed and would have wondered what's with the line.  It was bland and we had to add salt to the pizza.  Pizza #2 was WAY better.  Despite being full, the four of us devoured Pizza #2 because we didn't want to carry it home and we didn't want to let it go to waste, and we left behind two or three slices of Pizza #1. \n\nTo be honest though I don't understand the hype.", "author": "Stephanie N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-21", "description": "Good pizza but I wouldn't wait 90 minutes in line again for it. The crust was delicious with lots of char. Loved the fresh basil and ricotta on their regular pie. We couldn't figure out the method to the madness regarding the line. Parties of 2 were called out of the line regularly, while parties of 3 and 4 waited well over an hour. If we had known, we would have split into two groups of two. Carryout waits in the same line so no advantage there. We did evelop camaraderie with people on line near us and cheered for each other when we got seated. The atmosphere inside was loud, busy, happening, and enhanced by a soundtrack of 80s music. We are glad to have experienced Grimaldi's, but with so many other great pizza spots nearby, won't likely return.", "author": "Deirdre R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-28", "description": "I do enjoy thin pizza,  however all I experienced while in NYC was one undercooked pie after another.  Now I know why New Yorkers fold their slices in half while eating them!  The sauce was bland and the slices needed additional seasoning. The toppings list was too limited. The dining space was tight and the servers weren't very friendly. The Brooklyn Pilsner is definitely recommend. Overall disappointed with my experience with what is supposedly one of the best pies in New York.", "author": "J Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-22", "description": "I had a party of 8 with me and there surprisingly wasn't a wait.\n\nIt was about 30 degrees out and our two drivers had to find parking.  I went in and asked for a table, this old man asked if our whole party was here, I said no and he said.. \"okay, wait outside\" and went to another table.  And so we stood by the door, as it was really chilly outside. \n\nNot long after, the old man came by the door and ask if the entire party was here yet, and I said no, but we are able to order first.  I didn't even finish my sentence and he cuts me off rudely with a \"SHH\" and glared at me... after a quick 2 seconds dead stare, he said, \"I didn't ask you if you can order first\" I was so shocked by what he did, I couldn't even say anything back.\n\nHe told us to call our two drivers and tell them to valet the cars (8 dollars) because the valet drivers had to circle 45 minutes to find a spot... oh that's funny, because BOTH of our drivers found a spot within 10 minutes.  He only allowed 4 of us to sit and didn't allow the other two to sit because they had the responsibility to call the drivers... how ridiculous is that...he literally held me by my elbow and said, you sit here...\n\nWe found a dead fly, tomato sauce and crumbs on our plastic table cloth.  The waiters didn't even bother wiping down the tables, they just took away the dirty dishes from the previous customers and put new plates down... disgusting.. and when we asked them to clean our tables, we were ignored... and it got to the point where we didn't even bother... we just wanted to get our food, eat it and leave.\n\nThe pizza was soooooo SOGGY.  When you try to hold it up.. oh excuse me, you can't even hold it up because the toppings will slide off the crust... I had to eat a slice of pizza with a knife and fork because it was so soggy... who does that?!!?!\n\nHORRIBLE SERVICE, NASTY OLD MAN (OWNER), SOGGY PIZZA... why would anyone even come here for pizza?!", "author": "Christine M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-24", "description": "Grimaldi's is the real deal! I was in New York for about a 24-hour trip, and I ate here twice! They really know how to do pizza here. I ordered a simple pepperoni pizza, and it was certainly the best pizza I have had in the U.S. so far. I still fantasize about this pizza...(sigh)", "author": "L. H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-02", "description": "Another New York staple that is worth the long wait.  It was snowing outside and there were still at least 30 people waiting in line to get in.  Totally worth it, the pizza is everything New York dreams are made of!", "author": "Dana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-30", "description": "What could be better than the best pizza served by cocky young, \u0026 angry old Italian dudes? If you can get through, order out. The line is usually a joke.", "author": "Bubbles McTroubles S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-02", "description": "Definitely one of the best pizzas I've had in NY. It's a popular place so instead of waiting in line we called and ordered ours ahead of time and then caught the subway there to pick it up. I've never dined in at Grimaldi's and my boyfriend said the workers are always rude but I could care less, their pizza is delicious.", "author": "Melisa K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}