{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-26", "description": "Probably my favorite pizza I've ever had (which is saying alot because I lived in Rome for awhile and have had most of California's best offerings) I've been to multiple locations but this was the one I went to first. Best friend picked the place and it was an excellent choice", "author": "Greg D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-26", "description": "Now these guys know how to cook the classic thin crust pizza. I am not a big pizza guy but you know when you eat a great slice of pizza. The pizza's are cooked in charcoal oven which add to the taste. The place is pretty cheap but don't forget to get cash these guys don't accept card. The place is not too big for the no of people who turn up everyday. Its just filled up with chairs and table everywhere.\n\nThe thing that i hate about the place for which is deducted the 1 start is the huge line they attract everyday. You usually have to wait for 30 mins to get in . But its worth the wait. I would suggest to get some ice-cream from the Brooklyn ice cream factory which is just meters away from this place and the Manhattan view from this area is amazing ..another reason to visit this place.", "author": "Abhinav g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-09", "description": "Haven't been since they changed locations, but this place made me see pizza in a totally different way.  After eating here, I cannot eat pizza in my local CA area as it is just crap in comparison.  Mushroom and pepperoni is best.  Go, waiting in line for an hour, and learn what real pizza is supposed to taste like.", "author": "Jason E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-20", "description": "We've heard so much about Grimaldi's pizza  that On our way to New York on Wednesday we decided to stop by and see what the fuss was all about. From the moment I had to stand on line outside and wait while my husband parked the car\nI was taken back by how rude the gentleman at the door was to all the people standing in line to get into this dump. I asked him where does one park in this neighborhood since it was taking a very long time for my husband to join me and his answer to me was \"good luck\".  When my husband did finally arrive we were ushered up a narrow dark dingy staircase to an upper level  which had ceilings that were about to fall  from water damage. They sat us at the tiniest table ever and give you a menu that serves only pizza with different toppings. We ordered a margarita with sausage and peppers and two sodas.  The staff was inattentive and more interested in looking at the soccer game then attending to the needs of the patrons. The pizza came and it was not good. The sausage had bone fragments and it had way too many peppers on top which made the pizza soggy.  I am so sorry that we ever stopped there as I could've had a much better pizza in New York City. I don't know how they get the people to come here... I guess most people don't have a pallet for good tasting pizza.  As I came down the steps I encountered the rude doorman and asked him where the ladies room was located. He ignored me and walked totally away... The final straw... Who would ever want to come back \nto a place like this.", "author": "Patricia D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-24", "description": "The main question you ask: Is it worth the line?\n\nYes. Yes it is.\n\nAnything you get on your pizza will probably be good. Affordably priced for Bklyn/NYC. Classic Italian decor.\n\nThat is all. Now go eat some pizza.", "author": "emily h."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-03", "description": "I don't know what the big deal is. I got there at 630 PM and there was already a line outside (15 minute wait). The crowd was predominantly tourists. Because it's summer time, there were several large groups of teenagers visiting with their family from wherever. And other big noisy groups wearing Crocs or other suburban-like clothing.\n\nIt's not the most relaxing dining experience when you get called inside as you have to sit elbow-to-elbow with other diners on little chairs. The service was curt and SLOW. It took a lot of eye contact and waving around for us to get the servers attention to get our pie. \n\nThe pie was not even all that amazing. I've had better at Isabella's or Lombardis. It was not a pie I will be dreaming about. The general sluggish service, overcrowded/overhypeness, wall covered with framed photos of 'famous' people who have visited the restaurant, made an overall not so exciting or worth the train ride experience.", "author": "Isabel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-19", "description": "They have great brick oven pizza and you can tell by the line you have to wait on. But I have a tip that will help you avoid the long wait. And have a great date as well.\n\nCall the number and say you want to order take out. If you go to order take out they still make you wait on the line. Then walk to the pier take in the beautiful view of Manhattan and come back in 15-30 minutes and pick up your pie and go back to the pier to eat it on the benches there. \n\nIf you want to you can pack a blanket and go sit on the grass at the 2 near by parks. They even have tables there that you can sit on. And the views are just at good.", "author": "Scott Sira S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-06", "description": "Solid pizza. Not the best I've had, not the 2nd best I've had. Maybe in the top 10. Maybe.\n\nI'd say it wasn't worth the wait. Came here with my girlfriend on a Thursday night and waited about an hour outside with the smell of rotting garbage. When we finally got seated, they packed us into a table with some folks, not a horrible thing I guess. \n\nWe got the white pizza and it was good. Not great, just good. Worth it to check out the hype? Maybe. I probably won't come back. It did give me a reason to walk the Brooklyn Bridge and check the Brooklyn Ice Cream company though.", "author": "Mark C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-15", "description": "Wow, the reviews are pretty on the mark, it has to be on your list if you want to try New Yorks best pizza.  We went on a Wednesday night so it wasn't that packed and we had no problem with service or overcrowding.  The pizza was different than your typical slice pizza, it tasted very fresh, non greasy, and the cheeze and sauce was excellent.\n\nI did run into a problem which was parking and taxis.  There isn't much parking around and I would HIGHLY SUGGEST NOT TO TAKE A TAXI in that area.  I had to park around Atlantic Ave which a good 20 minute walk/ five minute taxi ride.  But 7 Taxis refused to drive on that street!  It didn't look like a bad neighborhood, but they refused as if they were afraid for their life, one said it was too dangerous!\n\nBasically, every cab driver refused to take us 5 mins to Atlantic ave. for whatever reason.  I told a different street address \"he said no problem\"  then after we got in I told him \"atlantic ave.\" Then he told us to get out of the cab!!  SO I WOULD RECOMMEND NOT TAKE A TAXI IN THIS AREA.\n\nI had to tell the cab guy I was looking for a Bank and lead him to Atlantic Ave in order to get the guy to go to Atlantic ave.  Now can you believe that???  I had to hustle a taxi driver just so I can get back to my car parking spot??\n\nI'm still giving 5 stars because the place is great and every New Yorker has to come here at least once.  And the location is amazing, right under the Brooklyn Bridge!!", "author": "Johnny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-12", "description": "Grimaldi's is the type of place you want to go to when you're hankering for a long wait in line and poor service. OR... if you want basic, fresh and tasty NY Style Pizza.\n\nI walked the Brooklyn Bridge for the first time and did as millions of others have done before me -- headed straight to Old Fulton St and went to Grimaldi's.\n\nWaited in line and chatted with the other people in line which made the time go by so much faster. In about 30 minutes we were inside and seated.\n\nThe service sucked, but whatever, the food came out quickly and was very good. Ordered the small ($12) with mushrooms (+$2) and pepperoni (+$2). \"Soda\" (I really want to say pop here -- the Midwesterner inside me) is $2. If you use the cup of ice, make sure it's clean. Mine wasn't and they unceremoniously took my cup of ice and Sprite and came back with new ice, but of course, no replacement Sprite.\n\nI didn't have a fork. Server THREW a fork onto my plate with a loud clang.\n\nVery poor service, good food, NY tradition... what can you do?\n\nYou take it or leave it. I think after that, I'll leave it, but it wasn't bad, it should be done at least once by everyone who lives/visits NY!", "author": "Joanna L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-15", "description": "I've heard many things about this place. We decided to check it out after walking across the Brooklyn bridge.  Unfortunately, It didn't really lie up to the hype.  We ended up being seated after waiting in the old for an hour.  We ended up ordering a pie anchovies and mushrooms.  The three of us were so excited to order anchovies.  The pizza itself; however, ended up being pretty watery and damp.", "author": "Caleb L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-22", "description": "Actually, this place deserve possibly 3.25 or 3.5 stars.  I am still not sure if it worth 4 stars.  Here's my reasoning...\n\nI did not have anything to eat all day (not even breakfast) and decided to venture to Grimaldi's around 3ish.  Hoping that the weather will hold up and there will not be a long line.  Man was i wrong!  even if you go there around 3ish, there's still a line.  There seems to always be a line.  A never ending line.  I wonder if you come around 10:45pm (right before closing) if there's a line outside.  I bet there is.\n\nSo i waited on line for a little over an hour (which doesn't seem long comparing to other yelp reviews) and was starving by the time we got seated.  You could have given me like Stouffers frozen pizza and I would have thought it was kick-ass!  Let me repeat....STARVING!\n\nSo that's why i am not sure about the four stars.\n\nDid i devour the pizza?  Hell yeah cuz i was starving and about to pass out.\n\nOverall...good.  Can't go wrong with Pizza and this place is suppose to be THE Pizza place.\nService: Fast and Speedy.  If you're looking to be wined and dined by the waitstaff, this is not the place.  The host (an older gentleman at the door) was very nice and friendly.\nPrice: Decent $$\nFood:  Good.  Can't go wrong with fresh and simple ingredients\nPlace/ Decor:  They pack you in.  You may be touching your neighbors elbows and can't help but overhear their conversations.  Of course they're gonna pack you in like cows....did you see that line outside!", "author": "N S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-24", "description": "After waiting in line for about a hour and watching celebrities walk out I expected more....what I got was less...sorry but this pizza was TASTELESS and undercooked....San Diego's Filippi's in Little Italy by FAR makes this place a laugh.", "author": "Arthur K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-24", "description": "The doorman, Ralph and I chummed it up while I waited for my to-go Grimaldi's Pies. I would say if you go around off hours, and after stormy weather, you are guaranteed to bypass any chance of a line. The pizza is hot, the crust is perfect, the cheese is the right kind of melty and the sauce is in perfect abundance. The waiters are attentive, but down to business - just the way a Brooklyn joint should be. Don't forget cash! Ralph likes to hook up the locals, and needless to say, I will be back, he is my new BFF.", "author": "Lindsey T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-16", "description": "I'm torn between 3 and 4 stars because of a few things that happened while we were there. The pizza was indeed as amazing as everyone said it would be ( we ordered a traditional margerhita). Excellent flavor and crust (ask for some Parmesan cheese and they will bring out yummy fresh grated Parmesan). We didn't have to wait long but we only had three in our party. Once we were seated we were informed they were cleaning the oven and it would be about thirty minutes before they would be cooking again(it took an additional ten minutes for our pizza to arrive once they started cooking again). They brought some bread which was nice while we waited. I didn't mind waiting because our server took our order and brought us drinks etc. The part that irritates me is that they clean their oven between 5 and 7 every night. Is there seriously not a better time to do this???? I know we ate early (about 5:30) but really is there no other time they could shut down food production for 50 minutes. My other beef is it's cash only. I know that's part of the charm of the place but it's irritating to me when a dinner place where your bill will be over ten dollars won't take a card. \n\nOverall the food was good and decently priced, service was efficient but nothing to write home about, and atmosphere was fun. The only reason I'm torn between 3 and 4 stars was because of the oven cleaning and no cards accepted. I also heard other diners complain about how long it took to get their order taken. Be prepared for long waits for good pizza that could probably be had elsewhere without the hassle", "author": "Whitney S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-03", "description": "Classic New York pizza. Among the best I've had. The ingredients were fresh and tasty. They know their pizza and even if its a tourist destination it's still worth the wait.", "author": "Gil B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-20", "description": "Best pizza in NYC that I've had.  The sauce is so fresh and they prepare the pizza with the best toppings, in the perfect ratio.  \n\nYeah, there's a long line but it is well worth it at least once.  I can't always bear the commute and the long wait but when I want THE BEST pizza, this is where I go.  The service is great for how busy it gets too. The atmosphere inside is also very energetic and hilarious at times.  \n\nKeep in mind that you can't order slices, it is cash-only and even if you want your food to-go, you still have to wait in line with everyone else.  It is a small price to pay for perfection...and speaking of prices, they are very reasonable.  \n\nBring cash with you because their ATM is broken and the one next door has an outrageous $4.50 fee!", "author": "Justin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-20", "description": "I'm a fan, not sure about the line though.... Pizzaaaaa is yummy but the line is yacky...!!! I'd def go again only if.. you got it, there were no lines... Parking is tough to find as well... Going to try the take out next time", "author": "Steve L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-18", "description": "It was worth every minute of the 1.5hr wait and a cab ride from LES in 95 degree weather.", "author": "H N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-07", "description": "After wanting to try Grimaldis for gawd knows how many years, it was finally accomplished.  The reputation for the long wait is daunting.  It was decided, we were going to face it headfirst.\n\nThat reputation is not founded on nothing but truth!  We passed a father and son after parking and went into a store for 10 minutes and headed over to Grimaldis.  On the line, there happened to be the father and son, who were about 10 people ahead of us!  So word to the wise... get there, don't dwadle and get on line.   It seemed like it was a better idea to go with a bigger group since groups of 3 and 4 were seated before groups of 2.  \n\nOnce inside, the aroma was so flagrant.  I watched the guy put together at least 10 pizzas while in line for the restroom.  They do not use shredded cheese, but fresh square mozzarella cheese and minimal toppings compared to your regular corner pizzeria.  Tomato sauce is spooned on, not ladeled on and fresh basil and spices are used.  \n\nThe pizza was great; a bit burnt.  The crust was chewier than Lombardis, the sauce was definitely sweeter.  We ordered the garlic and sausage.. the sausage is the nubby kind, not the sliced and that was a plus.  It was loaded with garlic and I tasted it from my first bite.  Grimaldis is an instutional must stop for good pizza when in Brooklyn.\n\nHere's the breakdown for those pizza enthusiasts... Grimaldis crust is cooked so it's a bit burnt, it's crusty and chewier than Lombardis.  Their sausage is better and their sauce is sweeter.  However, Lombardis trumps Grimaldis in location, better beverage selection, selection of toppings, and the wait period!!\n\nI loved Grimaldis and will go back if in Brooklyn.  If I'm in the city, order me a ricotta and sausage at Lombardi's.", "author": "Irene H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}