{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-22", "description": "My boyfriend and I went to Grimaldi's after touring Brooklyn.  It was about an hour before closing time but we were lucky to have only waited in line for about 5 mins.  A 5 minute wait for New York Style Brick-Oven Baked Thin Crust pizza was worth it...\n\nWe ended up ordering the \"small pizza\" with Italian Sausage, Peperoni, Sweet Peppers and Olives.  6 slices was plenty for us.  The crust was baked to the right consistency, the pizza had a good amount of sauce and toppings, but the best part for me was the sweet peppers.  I'm not entirely sure why I liked the peppers so much but they added to the pizza.  Keep in mind that each topping is $2 extra, sweet peppers were $4. (They're also cash only)\n\nI suggest trying Grimaldi's when there's not too much of a line or you're a big pizza fan.  Otherwise, it's somewhat touristy and the line gets too long for pizza.", "author": "Marybelle P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-25", "description": "I had been dreaming about coming to the Grimaldi's in Brooklyn ever since my first taste at the Dallas location a few years ago.  And it definitely lived up to expectations!\n\nI arrived there at around noon on a Wednesday.  We were the first people to be put in the line, and got a table in about 5 minutes, but by the time that we were going in there was a really long line and people were being told 30 minute waits so I think you jut gotta get lucky about the wait time!\n\nThe pizza.  The pizza was amazing.  It was everything I'd hoped for.  The crust was perfectly thin and so delicious, the cheese is fresh and amazing and the sauce is just the most perfect tomato sauce anyone has ever made!  \n\nIt did taste almost exactly the same as the Dallas location though so I'm not sure I believe all the hype that somehow this location is best, but I could tell a very minute improvement in crust quality at this location.  I freaking love the pizza at the Dallas location though so it's not a bad thing!!\n\nService was good as well.  Prompt, not necessarily overly friendly but they got the job done and that's what counts.\n\nOverall - fantastic.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-07", "description": "I'm going to give you a tip so you don't end up waiting in line for an hour: if you're a group of two, pair up with another wiling group of two in line. Often they're looking for 4-tops instead of smaller tables, you'll be in an out in no time.\n\nPizza is good...I am a plain cheese girl but we got the white pizza and it was tasty as well! Classic \u0026 simple flavors....work it off afterwards by walking the Brooklyn Bridge back to Manhattan!", "author": "Alicia S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-02", "description": "I have never had customer service this bad. We were not greeted. 15 mins after sitting down we had to get a server's attention just to get drinks and order food even though several servers passed by us and made eye contact with us. Once we got a server, he was extremely rude to us but friendly to the other tables. Our pizza didn't taste fresh, and not one person asked how the food was or how we were doing after receiving our food. We also had to wait 20 mins after they took our dishes for them to give us the check, and when we left, still no thank you or come again. Not worth it.", "author": "Rheanne U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-16", "description": "The pizza is delicious, and it's worth going once for the experience and to say you did, but now that I've been, it's defintely not worth the wait again!\n\nWe waited in the hot sun for a little over an hour.  It was a fun adventure for the day - we took a subway there from Manhattan, ate at Grimaldi's, then walked back to Manhattan over the Brooklyn Bridge.  I definitely recommend this approach!\n\nFact is, the difference between this pizzza and other pizza places is not enough to make standing in the sun for an hour worth it more than once!  :)", "author": "Megan P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-01", "description": "Good pizza but the shittiest service I've ever had in my life. If you want to be told by the disgruntled host to go sit at the bar, ignored for fifteen minutes before someone realizes you're even there, never checked on again during your meal, no one wants to make eye contact to come over and see what you need, and finally have the bus boy come and help you so you can get the hell out of there after being done with your meal for fifteen minutes, this is the place for you. No one here gives a damn about customer service. During my meal, a guy sat down next to me and after he was ignored for ten minutes, got up and left. I wish I'd had the hindsight to do that.", "author": "Sophie P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-14", "description": "Over rated. We ordered a small pie that took 45 mins to make and was covered in so much grease the bread was soggy. Very disappointing. Pizza in the DC area is even better.", "author": "GiGi D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-19", "description": "NOT EVEN ONE STAR. it looked absolutely mouth watering, and then when i took a bite it was worse than plastic. I was so disappointed, like HELLA mad. $17 for one shitty ass large pizza. like I would never Yelp about food, but this was just i crappy ass way to ruin my saturday night. I'm a college student and the effin 99 cent pizza across the street is 10xs better. thanks 'f nothin grimaldis", "author": "Bianca B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-03", "description": "Super yum! I read about this place as well as personal reviews and I was not disappointed! I was expecting a wait in line which was about 10 minutes because it was only 2 people in our party. The service was the biggest downfall. They took our order quickly however it was 15 minutes for our drinks to arrive and another 45 minutes for the pizza. We got a 6 slice half mushroom half pepperoni and the pizza was quite good. The crust was thin. Not overwhelming on the red sauce. The cheese was excellent, as well as the toppings. Love the atmosphere. Even after we were done with our meal there was still a line with a 15 minute wait!", "author": "Rae Lynne K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-13", "description": "I brought my parents here when they came to visit New York. This restaurant is an embarrassing representation of New York. \n\nThe wait staff is horribly rude. They are very understaffed. We were sitting at our table for about 30 minutes until a waiter came by to take our drink order. This restaurant lost its liquor license a few years ago for serving minors and having contained bottles of alcohol. The pizza wasn't bad - it was just ok. Have had much better at other locations. \n\nI really wish I would have done my homework before taking my family here. If you want to try the pizza, I'd suggest ordering take out and sitting by the water to enjoy it.", "author": "Lauren G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "Really near the Brooklyn Bridge. We walked from Manhattan. When exiting the bridge we guessed wrong, should fork left to go under tunnel. Grimaldi's has great pizza, the small was more than plenty for 2. Service slow but friendly. Surprisingly no wait to be seated.", "author": "Linda M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-30", "description": "This place lives up to the hype. We went mid-week around 3pm, an off-time, and it was about a 15 minute wait in line. I am sure most times, the line stretches down to the water, but we were lucky. Tables are nice, not overly big, but all parties sit comfortably. Staff is great. We ordered a small pepperoni pie and it was cooked to perfection. Loved the crust, it wasn't too thick or undercooked. They use San Marzano tomatoes and sauce which is always the best. It was delicious. The bill for lunch for two:  pepperoni pizza and one Ice Tea: $22.00 with tip. Not bad, and worth it!  I reccomend trying to eat here at least once.", "author": "Rachel F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-28", "description": "I would wait all day for this pizza pie. O wait, I actually did. Gratzi, Grimaldi's, Gratzi.\n\n\nGrimaldi's in other parts of the country just dont compare, Trust me!", "author": "Thomas I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-10", "description": "Buncha hype. I got lucky and didn't have to wait in the legendary lines. When I got in, the waiter was rude and inattentive. There were other waitstaff with whom I had good interactions but our waiter was the worst.\n\nThe pizza itself? Again, overhyped. There are so many places in Brooklyn to get pizza that I can't understand why someone would subject themselves to long waits for sub-par quality. Do yourself a favor and skip this place and head to Ribalta near Union Squre. This place is not worth the time or money.", "author": "Louis F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-21", "description": "The ingredients are very delicious but I'm not going to lie. I enjoy the $.99 Pizza joints across Brooklyn and elsewhere much more than a $20+^ pizza from Grimaldis. I've been here twice, and it was good, but.. I don't get the hype aside from, using fresh ingredients, being old, and I guess.. historic? Stop in here if you want, it is definitely good, but manage your expectations. Don't confuse this with the \"Best Pizza in NYC\" that is crazy talk.", "author": "Tyler S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "The pizza here is delicious.  There's no doubt about it.  The relocation next door couldn't of come at a better time when the weather is dipping into the teens.  Very spacious, therefore less wait.  I came here with some friends on a Saturday night and we were seated immediately!  Yes that's right baby, no wait!\n\nPizza arrived approximately twenty minutes after our order was taken and came out the same consistency I had known it to be, thin, crispy, perfect.  Compared to other pizza joints, Grimaldi's pizza is not greasy with oil dripping nor a thick crust.  My party had a war against tomatoes and ordered all whites that evening.  The fellas all ordered a small white pie each who were all satisfied at the end.  I shared with a girlfriend a large white pie with pepperoni and sausage.  The pepperonis are really cute.  They're about a quarter size of regular pepperoni pieces I'm used to seeing.  I absolutely love the cheese that they use.  It's not super cheesy and annoying that when you're manhandling your pizza you would even need to stretch it out three feet before the cheese will separate from your mouth.  The fresh basil and garlic brought the whole pie together real well.\n\nMake sure you bring cash as credit cards are not accepted.", "author": "Lena Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-07", "description": "Came in from LA looking to try that awesome pizza that new york is known for. The pizza here was ok, service was so so. not much taste very bland pizza. I had brothers pizza on 4th ave in brooklyn pizza was way better!! Save the timw, money and effort. Not impressed tho location is dope", "author": "Luis R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-28", "description": "As a visitor to NYC this place came highly recommended, but a lot of the yelp reviews for this place seemed mixed, saying its more of a tourist attraction, or the line makes it not worth the wait. Well, I would wait in line for this pizza!!! It was so good! It was flavorful and the ingredients tasted fresh. So if you are looking for good pizza try this place but bring your patience just in case you have to stand in line. Take note: this place is CASH ONLY and does NOT serve alcohol.", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-19", "description": "too much hype. couldnt disceen it from the rest of the other pizzas in NY. olives were too salty for me though. plus they better start serving smaller portions... for our weak asses :)", "author": "Ram M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-20", "description": "Food 5/5: solid, fresh,  good quality pizza. like my mom's\n\nService 2/5: they rude. not personally to you but in general. yes they would help you to choose and will explain everything but they would use profanity discussing their work staff and stuff. its disgusting! Clients should NEVER be a witness to the problems of the restaurant.\n\nPrice: 4/5 $40 for 2 with the beer\n\nLocation: 2/5. first of all yo have to walk very far, plus yo have to wait in line for 1 hour. There is enough pizza places in NEW YORK. \n\nWill NOT be back", "author": "Dmitry T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}