{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-26", "description": "Best Pizza ever!!! I love this small place under brooklyn bridge. Great white and red pizza. Small size pizza is actually good for 2 people craving. We tried the white and red small pizza and we killed it!! you can pick  what toppings you like.e.g...sausage, tomatoes et.al....It's a create your own pizza kinda thing! No debit/credit cards, cash only. Italian cooks and servers too!!! and the best part is...It's inexpensive!!!", "author": "Yumi G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-13", "description": "Mmmm, now this is New York pizza.  Service is quick, and the pizza comes straight from the oven to your table piping hot.  The sauce is tangy and delicious, the crust is perfectly crisp and not too thin or thick.  Every pie comes with plenty of cheese and basil.  The sausage pie was awesome; we almost considered getting another one!", "author": "Dee S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-06", "description": "After hearing that NY has the best pizza known to man, I searched yelp far and wide for the best pizza joint around. Grimaldi's came up as the highest and most rated place. I was prepared for the lines and I even had cash on me. What I wasn't prepared for was a less than orgasmic pizza. SAD! I really expected to have my mind blown out of the water and for my taste buds to sing high praise but Grimaldi's just gave me a good pizza I feel like I could've gotten back home. In fact, as blasphemous as this may sound, I've had better pizza in California. Yes, that's right you New Yorkers, I said it. I will continue my search for NYs best.. but for now, I am quite disappointed.\n\nNeed to know before trying:\n1. CASH ONLY\n2. Can't order pizza by the slice\n3. The lines are long, bring an ipod to listen to music and play games.. or good company to converse with\n4. Service really is horrible. We never got refills on our water.", "author": "Charlene S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-17", "description": "Eat here. Die happy.\nThe end.\n\nBut seriously, the line will be long, and you'll be annoyed,  but it's worth it.  Honestly, it's what pizza  dreams are made. Get the pepperoni and die a happy death! \n\nInsider tip: Do what we did and get a pie to go. The inside is tiny and cramped. Take the pie over to Empire-Fulton Ferry State Park and sit on the steps near the water over looking the best view of NYC,  swear you're going to eat 2 slices, then finish the pie. High five. Repeat!", "author": "Katie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-10", "description": "My absolute favorite pizza in New York. The wait is worth it. They don't sell by the slice, and, if memory serves they don't take credit cards. The seating is cramped. Arrive early, as the lines can be long. After pizza, walk just down the street and get ice cream at the ice cream shop at the Brooklyn Bridge pier.", "author": "Scott J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-09", "description": "Notwithstanding the quality of the pizza, the host here is a vile creep who wouldn't stop patting my shoulder while asking if I needed anything, and hovering beside me as I ate (on my own) at the bar. GNC folks, beware.", "author": "A W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-19", "description": "Quintessential coal oven nyc pie perfection. Located in Dumbo Brooklyn, wow kinda felt like a movie set. Finish the pie, walk out the door, look to your right and there's the Manhattan skyline and the Brooklyn Bridge. Now walk over the bridge to work off that pie and get some more!\nWhat an experience. Well worth the 45 minute wait. \nWould I go back? Let's put it this way: We're planning another trip to NYC just for Grimaldi's, Lombardi's and a Yanks game.", "author": "Jimmy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-26", "description": "Ok, y'all know that when you come to NYC, you have to get a slice or two of NYC pizza.  When I first came here, everyone swore up and down about Grimaldi's. Now maybe it was because I went to Di Fara's first and then again maybe it just wasn't up to snuff.  Now don't get me wrong, the pizza was good and the price was reasonable.  Though the sitting area was not the best.  It was a good way to meet and talk to strangers when you are new in the Big Apple though.  I digress...bottom line, the pizza was good and price reasonable.  Just not my #1 pick is all.", "author": "Mickey N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-26", "description": "I've been to Grimaldi's many times and as a pizza lover, I must say I deeply enjoy the great and distinct taste of Grimaldi's brick oven pizza.", "author": "Martin Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-04", "description": "Delicious pizza.  Hard to figure out the line situation.  Pizza could have been a bit warmer, but good none the less.  can't get any more Brooklyn, than being under the bridge.", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "One of my favorite spots to eat at when I'm in NY.  Lines are always out the door and there's always an hour wait at least, BUT it's definitely worth it.  Space is pretty crowded, but once u start eating, you forget all about that.  Definitely a New York pizza experience you shouldn't miss", "author": "Kristel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-15", "description": "I agree that the crust was a bit moist in the center of the pizza.  A bummer.\n\nThat aside, I think this place deserves 5 stars as one of the very top pizza places in NYC.\n\nDi Fara is arguably still #1 in my heart, though.", "author": "Tony M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-18", "description": "Really it's a 4.5, but waiting in line sucks!\n\nThe food here is worth the wait, but you can avoid it by going when they open and having your whole group with you.  Particularly if you are a group of 9!  I mean it, go when they first open! Some of us got there at 12:15 on Saturday and it was already packed, but there was no line up (11:30 M-F and 12 on Saturday).  Another idea is to get it to go and eat it somewhere with a view.  If I would have thought to do this we could have ordered a pie or two and taken them up on the bridge to enjoy!\n\nTo make up for the wait - the service inside is prompt.  The pizza is worthy of the hype.  And the price is right.\n\nWe ordered 2 pizzas at first, but ended up getting another one.  Not because it wasn't enough food, although after the wait we were famished, but because it was soooo good!  \n\nPizza 1 - Sun dried tomatoes, onions, mushrooms\nPizza 2 - Pepperoni and mushroom\nPizza 3 - Crushed tomatoes and extra basil\n\nMy mouth is watering just thinking about it!  Man right now I wish I worked / lived in Brooklyn...", "author": "Melanie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-04", "description": "I love me an old-skool racket. Farm the folks in, stuff 'em, shuffle 'em out. Cash only please (thank god I had just refilled the coffers at Chase). You want toppings on only half your pie? That'll be full price, thank you very much. NO SLICES FOR YOU! They won't even spring for pizza boxes; takeout is sent in just a square of cardboard and a white paper bag. I think the menus were mimeographed.\n\nAfter walking the BKLYN bridge and wandering around the parks at its foot, we decided to hit up the joint for lunch. We just managed to make it in with the first wave - no lines for us, suckas! We selected sundried tomatoes, mushrooms, and onions for our pie. I found myself craving just a touch of oil, a touch more spice in the sauce. Nothing some hot pepper flakes couldn't improve, really.\n\n\"It's decent...Not the best I've ever had,\" opined my hubby (he who favors Hungry Howie's back home in D-town). I give it 4 stars for authenticity, simplicity, and working its well-worn groove.", "author": "Dee T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-09", "description": "What can I say about Grimaldi's that the 649 people before me didn't say?  Probably nothing.\n\nGrimaldi's was the last stop on a whirlwind day in New York City where I got to check off four New York institutions on my to do list.  \n\n1. Watch a game in the old Yankee Stadium before it was demolished.  CHECK.\n\n2. Ride the subway.(#4 train from 161st St to City Hall) CHECK.\n\n3. Walk across the Brooklyn Bridge.  CHECK.\n\n4. Have pizza at Grimaldi's.  CHECK.\n\nGrimaldi's pizza is the standard for me.  No matter where I have pizza I always compare it to Grimaldi's.  I have yet to find a better pie on the planet.  I didn't realize how bad the pizza was in California until I had Grimaldi's pizza.  \n\nAnd I wanted this pizza experience to fail.  I first learned about it from Rachel Ray on the food network.  I was certain that she was wrong.  She wasn't.  I had to wait 90 minutes to get a table.  It was worth it.  The people sitting at tables around us were loud and annoying.  It didn't matter.  You know the pizza is good when all of the elements for a terrible experience are in place and you are still blown away by the food.", "author": "Britt W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-11", "description": "It was definitely worth the wait...  while my boyfriends brother waited in line i walked to the Brooklyn ice cream factory so i can't complain.  The service is very fast an efficient.  We added pepperoni, mushrooms, onions, and roasted red peppers to our cheese pizza.  It was everything i could ask for in a pizza... fresh ingredients, hot from the oven, and a super thin crust.", "author": "kristabel r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-26", "description": "No introduction needed.  Grimaldi's is on every top 5 NYC pizzeria list.  I suggest coming around 3PM to avoid a long wait.  Things to remember if you haven't done your research already... 1) cash only 2) no slices 3) no reservations.  This rates #2 on my NYC pizza rankings but not by much... I just prefer Difara's greasy crust and fresh basil more!", "author": "Thompson L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-08", "description": "So, the Pizza A+. The people, C-. I don't care a ton about service, really, but it is a bit important, so I'm going with a 4 here.\n\nWhat's the problem with the service here. Try calling an order in! We tried for about 30 minutes straight (seriously) and got a busy signal the entire time. I figured they just had that much business and moved on. To my surprise when I was waiting in line for the restroom (there is only one, so it can take like 15 minutes to get in) I saw why you can't call in: The guy that handles the regular orders there, if he's doing something else, ignores the phone and then kills the call without answering it.\n\nWe didn't have time to wait the 30 minutes to get into the restaurant so we went in to order a pizza to go. We were \"greeted\" by a curmudgeon who questioned what we were doing in the restaurant. \"I'd like to order a pizza to go.\"  \"Did you call it in?\" \"No, your phone doesn't pick up.\" \"One of you must stay outside. Go up there, order and pay.\"\n\nGave me a bit of a \"hmmm...\" feeling, but it was freezing out and people were waiting in line, so it must be decent. Ordered a Small Pepperoni pizza. 20 minutes later it came out. We took it to the sidewalk and ate outside. It was Delicious! Not incredibly better than Lombardi's but better and the crust tasted a little buttery too...So tasty.\n\nKeep in mind, cash only and beware the crotchety man at the entrance.", "author": "H B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-26", "description": "Possibly the best pizza I've EVER had.\n\nA short walk across the Brooklyn Bridge and you can find yourself in the pizza shop which Frank Sinatra called his favorite.  They make the pizza in a coal brick-oven which embues the pie with some extra ordinary and almost magical.  I especially suggest getting a pie with meat.\n\nNow the things \"you should know\" beforehand.  At lunch or dinner the line gets kinda crazy and I've found myself waiting for an hour.  You get seated at tables possibly with other groups and the interior ... well, not that great.  Also they only sell pizza by the pie (not the slice).\n\nSo my advice ... go early when day and get it to go ... it is worth the trip.", "author": "Randy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-24", "description": "Boy, you can smell how good this place is from the bridge on your way over to Brooklyn to grab a pie. It's so delicious. That's all I can say. Of course, of all the Grimaldi's (and I remember when this was the original) you have to visit this one, as it's the best. The line can be long but it generally moves quick \u0026 is worth the wait. There are tourists that come here. There are also a fair amount of New Yorkers that grub here. Seating is cramped, but hey, it's NYC, that's how we sit and eat (so close in fact it's almost just one long table lol). Coal brick oven pizzas cooked to perfection. I stick with the more traditional flavors (I find with adding mushrooms/peppers/onions etc., it can \"water\" down the pizza). Plain cheese or add fresh garlic, sausage or pepperoni or mozzarella, garlic and spinach. Those are my favorite. They also get some hard to find Brooklyn Brewery beers, so ask for their specials.\n\nTip: When the pizza comes, no matter how hard and tempting it is, give it a minute or two for it to \"settle\". One, you'll save burning the crap out of your mouth, therefore ruining your pizza gorging experience. Two, when it's still that hot, because the sauce and toppings are so fresh, it may \"fall\" off the crust. Trust me. During that settling time, take a picture of it. Pose with it. Yelp it. Post it to FB and/or IG. Message me and I can drool over it while I wish I was there. Then go for it!\n\nAlso, if it's warm, take it to go. Walk down the 3 blocks to the waterfront. Grab a seat. Enjoy the sweeping vistas of Lower Manhattan and the trio of bridges spanning north. Then grab an ice cream. Your day has been made.\n\nCash only. No slices. So grab a friend.\n\nI wonder if I can get this shipped to Chicago . . .", "author": "Aaron B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}