{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-20", "description": "Not worth the wait.  The pizza was good, but 2 hours in the hot sun... never again!", "author": "scott m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-17", "description": "the atmosphere was exactly what i imagine brooklyn to be. the pizza was not memorable. i can get something similar at my local whole foods.", "author": "david y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-30", "description": "It turns out my perfect date is a walk across the Brooklyn Bridge in beautiful weather with my favorite boy, and dinner at a great, friendly pizza place where we run into friends.  Yummy.", "author": "Brooke G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-31", "description": "what's up with all my pizza reviews on yelp? they seemed to have all disappear. damn... must've been too... cheesy? ha! anyway - this is the top pizza place i've been to in nyc. take the subway to brooklyn... grab some pizza here... and walk back to manhattan across the bridge. overall - pizza is delicious, fresh cheese, light thin crust, and awesome meat! highly recommended...", "author": "Darren W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-08", "description": "Great food, terrible service, and the owner is a racist. But I don't care, because the pizza is great.", "author": "G R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-10", "description": "OVERRATED!!!  Yeah its better than Pizza Hut, but don't get your hopes up to high like I did- after all its just pizza. Another problem was the wait. It took us about an HOUR AND A HALF just to get in. An hour and half of agonizing standing outside smelling cigarette smoke. If you do decide coming here, get there about 2 hrs early!!", "author": "Alec L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-02", "description": "Grimaldis is definitely the most hyped place I've eaten in NYC, and it didn't disappoint. Delicious pies, an ice cold beer, and a totally reasonable wait for a table. And we were out of there for $30 total! NY style pizza at or near its' peak.", "author": "Scott L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-16", "description": "the standard for pizza. thin crust, fresh mozz, basil, not sauce heavy, and toppings of your choice. i'm a pepperoni and garlic kinda guy. : ) yea, there's always a line, so don't go there starving. you will probably faint from the aroma of brick oven pizza. place is small and cramped. you can probably reach over and grab a slice from the next table cramped. but it's cool. they make up for it with the awesome pizza. overall, i like the whole experience. walking over the bkln bridge on a nice day and admiring the bkln bridge and manhattan views atop the bridge. the view from the promande is amazing. makes for some great photo ops (tourist or not)especially when the sun is setting or just staring at the night skyline of manhattan.", "author": "Tan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-13", "description": "As many times as I have ever been to NY being from California..this is my first time there eating here.....WOW is all I can say after waiting in the line which was well worth it ( and I never wait for food lol). To each bite I took I was fully satisfied.", "author": "R D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-16", "description": "pizza's good, but i don't like waiting on line while the guy in front of me sings Journey classics out of tune.", "author": "M S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-30", "description": "the line sucks on weekends but it is so worth it.  This place reminds me of Pizzeria Da Baffetto in Rome and that's the highest compliment I can give.  The crust is thin but not too thin and all of the toppings are amazing.  My cousin, my boyfriend, and I trekked here in 0 degree weather and managed to eat two pies.  (they don't do slices)", "author": "Angela K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-27", "description": "Let me just say that this review will break a lot of hearts.\n\nI do have to put it out there that I have been avid fan of Yelp for a while now but never felt the need to create an account / post a review until my recent visit to Grimaldi's where I felt the need to tell people the truth.  I know I have not built up my credibility in the Yelp community yet but this is my review.  Take it or leave it.\n\nSince we were already doing the touristy thing by going to Grimaldi's, we decided to top it off by walking over the Brooklyn Bridge to get there being that it was the one day it was not raining in NYC this summer.\n\nOnce we arrived, there was already a line and a man with a clipboard taking names.  We were told there would be a 40 minute wait.  No biggie, except that it was about 90 degrees that day and most of the line did not have any shade.  But we have no one to blame but ourselves since we made the decision to go there.  The restaurant did have a water cooler for those of us waiting on the line.  Not too bad of a gesture I would say.  True to his word, about 40 minutes later, we were called.  We were lucky enough to be seated at the end of the cafeteria style table so we only had to watch out for 2 elbows.  We ordered a small pie, half plain and half garlic.  At this point, we were famished.  20 minutes later, our waiter gave us the pizza.  FAIL.  It was not worth the wait and any different than any other pizza I have tried.  The first slice was okay because it was steaming hot and that's when a pizza tastes the best.  My 2nd slice was already cold and soggy.  Run to your nearest Patsy's.  Then again, pizza is pizza, you can never go wrong with bread, cheese and tomato sauce unless you're being fed by Domino's. I am quite content with my $1.50 slice from the local corner pizzeria.\n\nIt's safe to say Grimaldi's is never again for me.  I SO badly wanted it to be great because of the hype and because I just wasted about an hour waiting for pizza.  Who is the genius in charge of the PR for this place anyway?  If you do decide to go, go for the experience and not the food.  AND if you want to make it a whole day where you over pay for mediocre food, try the Brooklyn Ice Cream Factory down the block where the ice cream sundae is no different than that of McDonald's. \n\nAnd like many Yelpers has already mentioned, there are a ton of tourists that go here.  Tourists never really bothered me because it IS New York City.  What do you expect?", "author": "Yu-Ching L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-17", "description": "I've been a New York most of my life and have been hearing about Grimaldi's for years.  Last night after walking past and seeing there was no line my sister and I decided to give it a try and we definitely will never be back.  The pizza was just okay, but I've definitely had better.  Apparently they shut the oven's down for 30 minutes between 5-7 to \"reboot\" the oven but not sure why they wouldnt do it earlier.  They keep a line outside the restaurant almost to make Grimaldi's seem like a bigger deal then it was because there were plenty of available tables inside.  They only accept cash but both ATM's inside were down.  When I asked the manager for the nearest ATM, he sent me on a wild goose chase and after a solid walk turns out there was a small ATM right next door.  We were told when we went in that the ovens had gone down and it would be 20-30 mins.  About 30 minutes later we were told again that the ovens had just gone down and it would be another 20-30 minutes and that the earlier statement didn't factor in the pizzas they had left to make.  Trying to get change for our check at the end was also quite a process.  Crowds inside are loud and touristy, children screaming, bathrooms dirty.  All in all, definitely go somewhere else -NY is filled with good pizza, much better than Grimaldi's and for a lot less, and all without the hassle.", "author": "Kimberly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-14", "description": "Grimaldi's Pizza, what can I say.  This establishment has become an icon of Brooklyn Pizza for a reason.  I have never been disappointed by this place and will continue to go back.  Everything seems just right, from the thickness of the crust, to the firmness of the pie, fantastic.   Never to oily and always has right amount toppings.  I have never actually eaten inside of Grimaldi's since I am not the biggest fan of standing line for an hour.  You can frequently expect a line down the block with a mix of tourists with a few local New Yorkers mixed in-between.  Do yourself a favor, call in your order ahead and takeout!", "author": "Steve B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-18", "description": "like lombardi's i REALLY wanted to like grimaldi's, especially because I made dining there part of a \"brooklyn experience day\" which included walking across the bridge, shopping in dumbo, eating at the brooklyn ice cream factory, etc - but I just don't understand the hype! it was good - I won't say I didnt like it, but I found the sauce to be a little sour, the pie was a little too soft, and it tasted a little too smokey for me due to the coal oven. that said, I did have a great brooklyn day, regardless! as for my take on the debate, I like lombardi's more than grimaldi's... but I only like both marginally more than any random pizza joint in the city. factor in the wait time, and I'd rather eat at the place on the corner.", "author": "Yee C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-23", "description": "Very good, very solid pizza. It's closer than most of the other outer-boro pizza joints and it is delicious (of course). I like the location and the old Italian-NYC feel of the place. Grimaldi's is definitely worth a stop on any NYC pizza tour.", "author": "Suzanna G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-20", "description": "quality pizza for the money, authentic italian pizzeria environment, efficient service....would go again.", "author": "Joo P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-07", "description": "I like this pizza. Been going for years. I think the hype has gone to their heads though. The last time I was there, we stopped in for a quick late-night bite and just ordered a small pizza, nothing more. I got the sense from the server that he was disappointed the order wasn't bigger. This sense was reinforced over the course of the dinner, when I repeatedly asked for water, asked three different servers, and never got service. It was late, and it was half-empty even. So no excuses there. Disappointing. 4 stars for the pizza, minus 3 stars for the service equals 1 star.", "author": "A S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-09", "description": "I went to Grimaldi's recently and having been so hyped about it, I was disappointed. I am not a fan of pizza BUT I am a fan of great food and Grimaldi's just did not make the cut. My major complaint about the pizza was that it was soggy. How can a slice of soggy pizza be claimed as the best in NYC? The mozzarella and the rest of the ingredients were fresh and overall it was not bad experience but if you are visiting from out of town and looking for the best pizza in NYC, i would suggest that you go somewhere else.", "author": "Kathy F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-18", "description": "great pizza, make sure to bring cash....large is about $14 bucks and $2 bucks for each topping and drinks about $2......", "author": "PAUL M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}