{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-09", "description": "WHAAAAAT!!! I went to New York in January and I haven't reviewed this yet? WHAT WAS I THINKING!!!!!!!\n\nTHIS WAS THE BEST PIZZA I HAVE EVER HAD.... and I have had a lot!!!!\n\nI went to John's on Bleecker a couple days before, because I heard that was the best... and it was GOOD... but this is better!! \n\nTheir basic cheese pizza is basically a Margarita Pizza, fresh basil and mozzarella! Awesome! The crust was awesome too! It did suck though that their ATM was busted, and they don't accept credit cards. \n\nThis is a reason alone to fly from California to Brooklyn!\n\nOh... and expect to wait..... and to sit right next to random people. lol. i love new york!", "author": "Tim M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-03", "description": "Beware if you call in an order, the guy on the other end of the line isn't there for idle chit-chat. He might be slightly telepathic, since he didn't let me finish my sentence. However, when I arrived they seemed to know what I ordered. \n\nEven ordering calling in around 2pm will result in 30min-ish wait, and will set you back $40 bucks for two large pies.  Was it good? That's what you want to know? The best ever???\n\nIn Dumbo, no question. \nAnd I'll leave it at that.", "author": "Erik C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-13", "description": "I'm going to say it: Grimaldi's is for the tourists. New Yorkers know they can get good pizza elsewhere without a wait. \n\nThe pizza at Grimaldi's can be very, very good, but it can also be pretty mediocre. The first time I went to Grimaldi's, I found the pizza to be tremendous. It was so crispy and fresh. It had me longing to return. The last time I went to Grimaldi's, however, the pizza was greasy and blah-tasting. \n\nI need consistency with my pizza places. Grimaldi's doesn't cut it.", "author": "Cindy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-16", "description": "Close to the best I've had.  Want to know what's better?  Read my other reviews of pizza places in NY.\n\nCrust was perfect, peperoni was phenomenal, sausage was good. \n\nWhat you need to know: expect to stand in line, go in a smaller group (2-4 is perfect), get peperoni on it, don't expect too much from the wait staff as far as checking on you often, soda comes in bottles, almost all of the other 400+ reviews love this place.  Now, go get prepared to stand in line.", "author": "kurtis d."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-09", "description": "Yes, the pizza is good, and is definitely old-school.  However, it's absolutely not worth the hours of waiting on line outside. \nHere's the menu: pizza, calzone, antipasto (not the salad kind, the meat kind), dessert, and beverages. So after waiting online for hours and either sweating your butt off or being pummeled by wind or rain, you can't get a side salad, garlic bread, pasta - anything! The last time I was there, the pizza took about 20 mins to get to us and we were STARVING, sweaty and exhausted from the wait (my friend was in from out of town and was insistent on trying the famous Grimaldis - I was outvoted). The tables are small and crammed together - so prepare to eat with your purse on your lap and get intimately involved in the lives of your neighbors. The waiters, although efficient, are too busy. There's no sitting and chatting, although you wouldn't want to as the seats are not all that comfortable and it's loud, very loud. I'd much prefer going to one of its competitors any day.\n\nCash only and no parking.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-20", "description": "We waited over an hour to get in and it was not worth the wait. Pizza was good but nothing to write home about.  Nothing to wait over an hour for.\n\nThey added 18% tip for a party of 8 but did not tell us. We were about to give another 15% until one of us saw the S/C at the bottom of the bill and asked what that was.  Not cool!\n\nKing Julian rules!", "author": "Hen C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-12", "description": "Wow, I am really surprised about the reviews from the more experienced yelpers... I took my bf here for his birthday, almost a year ago to the date, and I was pretty disappointed. I knew it was somewhat of a tourist trap, and was okay with waiting in line and expected rushed service and cramped quarters etc.\n\nHowever, what I certainly did not expect was a pizza that was burned on the edges (more than a normal brick oven should be), cheese without a whole lot of flavor or texture and a tomato sauce that had no zest or freshness to it. \n\nAnd - for those of you who have been to Italy (i just went!), this is certainly not a true Italian pie...\n\nI will continue to look for the ultimate pizza..", "author": "Vee V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-18", "description": "The pizza is awesome - thin crust \u0026 cheesy - but be prepared to wait in line. This place is popular among tourists. The seating is tight, there is little room between the tables, so you may feel like you are having your meal with a bunch of strangers. I would definitely go back more often if this place is closer to where I live.", "author": "Ally W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-19", "description": "The place is tiny, the wait is forever, and the pizza was average.  The hype is beyond what i can understand.  People go there to take pictures of themselves with the pizza; not because the pizza itself is worth 45 minutes outside on line, and then another 30 minutes inside waiting next to a bunch of strangers literally on top of you.\nI had a good time but never again.  My local pizzeria has tastier pizza, and it's ready in 15 mins.", "author": "Peter A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-07", "description": "If you're into New York style pies - Grimaldi's definitely fits the bill.  I can see how haters \"hate\" the line that you have to go thru to get here - but it's part of the experience!  Forced myself to take a long trek to Brooklyn in 20 degree weather to try a few pies and was not disappointed.  Went for:   fresh mozarella \u0026 basil - and - sausage, mushroom, fresh garlic \u0026 extra shredded cheese.  Both were good. (I highly suggest adding the fresh garlic as it definitely makes the pie worth it...) The pie is best right out of the oven - so I wouldn't do take out as I'm unsure if it would sit well..  Will definitely try to make it back to Brooklyn the next time I'm in town.  I came in early Saturday and the wait was not long at all..  I'm personally a chicago-style pizza gal but Grimaldi's is creepin up close to the top!", "author": "Lor B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-21", "description": "The pizza is delicious but thin. The whole pie is definitely necessary, maybe a 2nd if you're really hungry. The wait can be redic, but if you time it right you're golden. Kind of hard to go there with a large group so I'd avoid that if possible just because the seating can be a nightmare. You likely won't be disappointed, definitely some of the best pizza around.", "author": "Xavier M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-08", "description": "This is by far the best pizza in all of New York City.  I've had a lot of pizza too.  From the kitsch-esque atmosphere of Lombardi's pretty good pizza, to the slices as big as your head up at Coronet's and dozens of 'Famous' Ray's in between.  I've had a LOT of pizza in this Berg.  But I'll tell ya, Grimaldi's will melt your face.  \n\nTucked away under the Brooklyn Bridge, this age-old pizzeria serves up coal-oven pizza at its finest.  I highly recommend getting pepperoni on top because this was some of the freshest most delicious pepperoni I've ever had.  I think it cooks better in the coal oven for whatever reason.  \n\nPizza-lover beware, two things that make this place a BIT of a hassle (and believe me when I say 'bit' because the pizza is so so worth it) is that if it's crowded, make sure it's sunny outside because the only waiting area is out in the street.  Chelsea J and I lucked out on the night we went because even though it was POURING outside, it was dead inside so we sat right down.  Also, it's cash only.  Sort of makes me think they don't want any sort of paper trail...\n\nJust kidding.  But seriously, I would eat here every day if I lived in DUMBO.  If you haven't been and only had delivery (like me for the longest time) make sure you actually go sit in to eat.  Something about the place makes the pizza taste even better.\n\nEDIT -- Right after I posted this I decided to look and see what other people had to say.  I can't believe what my eyes are reading here!  The most major complaint of all?  \n\n\"I HAD TO GO ALL THE WAY TO BROOKLYN!\"\n\nLet's get real folks.  Every single person who complains about that seriously needs a tighter grip on reality.  New York City is FIVE BOROUGHS!  New York City is not just the island of Manhattan.  Stop whining.", "author": "Andrew J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-16", "description": "This place is fantastic.  On my quest to find the best pizza in NYC, I have decided that Grimaldi's, Di Faras \u0026 John's Pizza on Bleeker Street are my top 3...not in that order though :)\n\nThe line, although annoying while standing in it, moves pretty fast.  They pack you in there really close, so don't expect to be able to have privacy with whoever you're going with.  You're sharing a table with the tourists from China.\n\nThe service is fine, but really all they have to do is bring us our drinks, and our pizza, and then leave us alone, so this is virtually fool-proof.\n\nPizza is absolutely incredible.  The crust is great and it's not too thin, as I really don't like paper thin pizza.  Finish your pizza before it cools too much!!\n\nHere is my ONE complaint about this place, and I know it's ridiculous, but someone just has to agree with me on this.  When you order a soda, they give you a 20oz bottle, with a glass of ice.  But no straw.  Let me repeat: no straw.  I don't know if this is common, but I can NOT drink out of a glass that has ice in it without a straw.  I'm having to fight with keeping the ice cubes out of my mouth.  This might be because I practically have no top lip, but UGH.  I can't understand why they don't have straws!!  On the good side, it really says something about a restaurant when the only thing I can pick on is that they don't have straws...I'll start carrying them in my purse.\n\nI have to say, the view over the East River into Manhattan is breathtaking.  You have to end the night with the walk over to the water.", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-22", "description": "One of my three favorite pizza places and deserving of its reputation.\n\nI rarely go to places that require a long wait--usually make reservations--but made an exception to Grimaldi's to try their famous NYC pizza.  After an hour, I finally got close to the start of the line so that I could place my take-out order.  Some 15 minutes later, I took my Margarita to docks to enjoy with my dining companion.\n\nThe prime pizza had a crisp crust, subtle sauce, and top-notch ingredients.  The toppings were not as generous as Umberto's, but the quality of ingredients and the great sauce made the long wait worth it.\n\nA beautiful clear day, we were able to enjoy the atmosphere (including a wedding or two) along the water overlooking the cityscape of lower Manhattan and the Brooklyn Bridge.  What a great experience :-)", "author": "Mickey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-29", "description": "We expected a long wait but it was pretty fast. We ordered pretty fast. We ordered a large pepperoni pizza for 4 people which meant 2 slices per person. I could have probably eaten more. The pizza was really good. Probably the best pizza I have ever had but I don't really eat pizza that much. The waiters were kind of slow though. It took them forever to give us our check. Only one bathroom.", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-22", "description": "Being from Boston there is a lot about New York that I hate. The Yankkes, the Mets, the Giants , the Jets and the Rangers to name a few. This pizza does not fall in that catagory however. The wait might be long and the service might be slow but the pizza makes up for it. If your in Brooklyn put some time aside and try it out.", "author": "David C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-07", "description": "Good Pizza, best thin crust I have had in New York and prompt quick service.  I went at 3pm so there was no line and we were actually able to sit a table of fourteen in five minutes! The pizza was very good, one large pizza can be shared by 3 hungry people (remember the crust is thin!) \n\nI also  liked how their sodas are from soda bottles and not fountain soda because then if you do not finish it you can take it with you.\n\nWe ordered half of a pie with mushroom and the other half with a topping but everyone is right the topping just takes away from the pizza.  Don't do it.\n\nOh and it is cash only so leave the plastic at home.", "author": "Diana H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-16", "description": "Definitely worth the wait.\n\nMy cousin came to visit, and we planned an afternoon grabbing a pie at Grimaldi's and then walking over the Brooklyn Bridge.  Only to find a line almost to the end of the block (it was a prime summer afternoon).  If there was anywhere else worthwhile within sight, we probably would have skipped it -- note to potential Brooklyn Heights restauranteurs.  \n\nBut we stuck it out and it was SO WORTH IT.  I was really prepared for this to be one of those NYC tourist experiences that gets really hyped up (guidebooks, the Food Network, that sort of thing) but turns out to be nothing special.  I was very, very wrong.  \n\nI'm sure this is covered below, but beware that they don't serve slices, only full pies.  This is OK, though, as a regular sized pie is the perfect amount to feed two young women.  If you're a big dude, you could probably finish one yourself.  \n\nIt should also be said that Grimaldi's does not serve what I would consider \"New York Style\" pizza.  They're kinda doing their own thing, which I think is great.  But if you went expecting the traditional NYC pizza experience, you might be disappointed.  Also, if you are a tourist, keep this in mind and be prepared to have the traditional slice somewhere else in your trip.\n\nGrimaldi's would be 5 star worthy if they were a carefully kept secret hidden away out in Bay Ridge or something (or better yet, around the corner from my place...), the sort of place you could drop by on a Saturday night.", "author": "Sara C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-22", "description": "It was a good pie but I was turned off by the basil I never asked for. Found out it came on all pies but I really dont like basil. \n\nIt was pretty crowded in there which is cool but I really dont like eating at the same table with complete strangers.\n\n4 stars cause it was still a pretty good pie when I picked off the basil.", "author": "Jeff D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-12", "description": "OMG this place is just delicious. I can eat about 4 slices of this pizza, \u0026 im not a big girl. My husband \u0026 I love to eat here as often as we can we always get the half white half regualr pie. I love their white pizza!!BUT it lost one star because no matter what time of day you go, YOU are WAITING on the line to get in....it's definitly worth it but on a cold winter day you just have to remind yourself thats there's awesome pizza inside. Another negative is that the tables are very close to each other so make sure you make friends with your neighbor LOL...Just an FYI there's no slices also only pies\n\nENJOYYY its amazing", "author": "Gia S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}