{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-10", "description": "Which is better:  Grimaldi's or Lombardi's?  Honestly, I couldn't tell you.  They're both great.\r\n\r\nA plus for Grimaldi's is that you can walk over the Brooklyn Ice Cream Factory after dinner...but then Lombardi's is right next to Rice to Riches.  I guess it's too close to call.", "author": "Heather H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-20", "description": "Always a fan of Grimaldi's!   Love to say I was at the original Grimaldi's when visiting the now branched out sites in different cities.....Did have to wait about 2 1/2 hours, but it wasn't (and still isn't) all about the pizza for me, it is for the experience and the atmosphere in appreciating what Grimaldi's is about.....NY pizza....", "author": "Melanie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-19", "description": "Had to stop by this place after seeing it involved in a food competition on TV...also being from California it may be some time before coming to the NYC...best pizza I have ever eaten...the crust has crunch on the outside and that awesome chewiness on the inside...they use fresh \"everything\" I can honestly say I have never had a fresher pizza...when we got there there was only one group of 2 in front so the wait wasn't much at all...by the time we left there was a line that went down the block...if you ever find\nYourself in the NYC and you love pizza as much as I do...you would be doing yourself a disservice if you don't stop by Grimaldi's and pick up a pie or two...", "author": "Anthony F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-05", "description": "I'm giving these guys 3 stars for a number of reasons.  First of all, maybe it's my fault, but I had it really hyped up in my head before I had even arrived.  That day, my wife and I decided to take the 6 train to city hall and walk across the bridge.  By the time I got there, I was famished, but then I saw the line.  It was long, but this is New York.  \n\nOnce we got inside, we were seated in a cramped table in very close quarters.  Then it took quite a while for us to be approached by our server.  In fact, we had to flag one down.  If we didn't , who knows how long it would have been.  We ordered a large pepperoni and mushroom, two waters, and a root beer for my wife.  The pizza took a long time to come out.  Usually these thin crust, coal or brick oven places cook pizzas at a very high temperature, so a pizza can cook in 5 min or so, but it seemed to take about 20 mins or so for our pizza to come.  It did come out hot and fresh though.  Definitely no complaints on freshness. \n\nThe pizza......it was big enough for two to eat, and take home a couple of slices.  It looked like it was cooked nicely from the top, just the right amount of toppings, not skimpy at all.  There were a few crust bubbles that should have been popped during cooking, that bubbled up and turned black, but I could live with those.  The pepperoni was excellent, maybe the best I've ever had.  At first, I thought they were too small, as I typically prefer the larger ones, but once I tasted them, they were amazing!  And nice thick pieces too.  The cheese was great, the mushrooms fresh.  My other complaint was that the crust was wet at the bottom.  Not from undercooking or being raw, but from condensation.  I think that means that they need to put some cornmeal underneath it to get a little airflow under it, but maybe not..I'm not a pizza cooking expert, just a pizza eating expert.  Lastly the sauce. It was rich, flavorful, and on the sweeter side.  it was awesome sauce.\n\nMy wife didn't like her root beer, so I had a sip, and it was overly sweet for my tastes as well.  But not Grimaldis fault.  They didn't brew it.  \n\nThe water, was water.  lol.\n\nOverall, I give three stars because the soggy crust was a big disappointment, the line was a little annoying, but not the worst, and the service was non existent.  \n\nThe price wasn't bad either.  Our bill was just over $20.\n\nWould I go again? Probably not, but maybe.  I would prefer to keep moving forward on my search for the best pizza in NYC because there are infinite pizza shops in this city, and when you find something you love, you'll know it.\n\nSome other pizza places that I recommend are Patsy's in East Harlem, Europan because I love the super crispy crust, but my favorite was Eataly.  The pizza was wood or coal fired, but the best part was the cheese on the 4 cheese pizza.  It was the richest, creamiest cheese that I've ever had.  I love cheese my whole life, and I had no ideal that cheese even existed like the 4 cheese pizza at Eataly.  That place is by the Flatiron building.  Try it.", "author": "Chauncey W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-19", "description": "It's been a long time coming...but we finally made it to Grimaldi's.  We love coming to the Brooklyn Bridge park and we always saw the line for Grimaldi's.  Intrigued is an understatement.\n\nWe decided to go for lunch to cut our wait time down.\n\nThis is a thin brick oven pie with tremendous flavor.  The crust was PERFECT...chewy and crunchy at the same time.  Unreal.  \n\nNot the best I've had...but pretty damn close.", "author": "Bill F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-28", "description": "Better than any other chain pizzeria but still not the neighborhood taste i prefer.", "author": "Rafael R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-18", "description": "Went there with a friend who was visiting New York.  I'm a New Yorker and had never tried Grimaldi's so it was now or never.  \n\nWell, the wait was about an hour and when we finally got the pizza on the table (a sausage and mushroom pie), I couldn't believe this was what we waited for and paid $16 for!  I couldn't even find the mushrooms in the pie.  I had to look for them.  The sausage was flavorless as was the cheese.  Luckily, they had some hot pepper flakes and Italian seasoning on the table to give it some flavor.  It was also extra thin so not much to bite into.  \n\nI'm really not sure what all the hype is about.  Can someone educate me?  I just made myself a frozen pizza that I added tons of onions, peppers, pepperoni, cheese and basil to and it's 10 times better and more flavorful.  I'll be eating my frozen pizza from now on.", "author": "Eva C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-18", "description": "Don't go here.\nIt's not actual from Brooklyn.\nIt's just some tourist BS that belongs in Times Square. \nSupport your actual local pizzeria.\n\nIt's not 1 star only because its hard to mess up pizza.", "author": "Scott H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-31", "description": "I like Lombardi's just a tinsy bit better, but this place is still really good. The price isn't the greatest.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-08", "description": "Old school pizzeria, order garlic on your pie, it's not chunks so you don't see it, but the taste and flavor is like no other.", "author": "Natalie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-20", "description": "So its all the rave amongst tourists descending on New York city in search of the pizza legends. The queues are impossibly long and I never had the patience to wait. A clever little tip: if you must go dont bother spending hours in line, go after 11pm any night and walk straight in.\n\n\n Although it is classically Italian and seductively cheap, its not Pizza a La New York like a good old Joes, Rays or Patsy's.", "author": "Kudge"}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-29", "description": "The pizza has a lot of hype god good reason. Delicious!", "author": "Carrie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-12", "description": "Ive been going since it opened, same place different name, the absolute heavy weight champion of the world of Pizza. This is the real deal that every coal this or wood that owner tries to copy. \n\nHow do they do it?\n\nIve tried and I have no clue all I know is... it works \n\nPatsy used to deliver Pizza to Sinatra when he was in town...\n\nThe End", "author": "John E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-27", "description": "Grimaldi's, words cant even explain how much I love you! Best pizza I've ever had. \n\nThe Bf and I walked the Brooklyn Bridge quite early, and by the time we made our way to Grimaldi's, it wasn't open just yet. It had about half an hour to go, so we decided to roam around brooklyn for a bit. When we returned, there was a ginormous line! Luckily time passed by pretty quick. We got a mushroom and garlic pizza, with half pepperoni for the carnivore. The thin, crunchy crust was perfect. The mozzerela cheese was so fresh. Oh this pizza is SO good, we devoured it in record time. I cant wait to come back!", "author": "Trina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-18", "description": "I waited over an hour in line to try Grimaldi's and I would do it again in a heartbeat.  I've tried other pizzerias in NYC, but none have compared to Grimadi's yet.  \n\nThe crust is perfectly thin: not chewy but not like a cracker, either.  It achieves the perfect balance, probably due to the old school coal brick oven.  How can pizza be made in anything else?  The cheese, sauce, pepperoni, and sausage tasted so fresh that I find it difficult eating anything with any of those ingredients now because they feel like bad cover versions compared to the freshness at Grimaldi's.", "author": "Frank M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-10", "description": "Before you question my taste and opinion for pizza, I would like to inform you of where I have been. Bleecker St. Pizza, Johns Pizzeria, Grimaldi's, Ray's and I am 240lbs. so lets just say I know how to eat lol. I want to give this review without being too negative so I will be as nice as I can and say I was disappointed. I have eaten at another Grimaldis in Las Vegas, was amazed how awesome their pizza was, and could not wait to go to the original. I came on a Tuesday night, there was no line, and we were seated fast. The environment was cool and old school but I thought it was weird when I heard the accent of the workers and did not recognize the language as being Italian but more like Russian. \n\nAnyways, we ordered a pizza with pepperoni and enjoyed it but it was not awesome or wonderful or anything special. Disappointed yes, I wanted to love it, I mean I watched the food wars show and was ecstatic when Grimaldis won over Johns so believe me I was going into this experience ready for the best pizza ever. To find out, I ran into a couple of New Yorkers through out the city like at the Yankee game, Katz's deli and NYU and everyone of them spoke about Grimaldi's being a tourist trap and I happen to believe they were right. Again, the pizza was good but nothing great. Should you try it, yes, find out for yourself and then you can have an opinion. It is not horrible it is good but I believe there are better.\n\nI ran into one of the waiters outside, I asked him where he was from, he said POLAND and that all the workers were from POLAND. Poland and pizza is not what comes to mind when thinking of pizza. Personally, I would do Johns Pizzeria", "author": "Nathan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-10", "description": "What is Lindsay K smoking?  WOW.  She must be related to the owners of Lomardi's!\n\nThis place is amazing and is by far the BEST Pizza in New York.  Lombardi's is good but Grimaldi's is out of this world.\n\nEverything about the pizza is absolutley fresh which means it is as tastey as it can possibly be!  They make the pies perfect with fresh mozzarella laid down first, then toppings, then light on the sauce (aka perfect) and then with some oil on top before they slide it into the brick coal oven.\n\nIt is just so amazing.  Yes there is a wait to get into this place.  We waited on line for about 1 hour.  The wait is the only down side but the cost benefit ratio is waaaaaayyyy too high to let a little standing around ruin your day.\n\nThere isn't anything more that I can add that hasn't been said. If you are visiting NYC and you want amazing pizza (not to mention amazing views of Manhattan) this is the place!\n\nThey also recently opened a location in Manhattan on 20th and 6th if you want to check that out.", "author": "Andrew S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "Best PIZZA in NYC! and that's saying a lot because there so great places to good pizza in the city. My favorite is the Hawaiian Pizza they make it's do die for!", "author": "Brianna T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-02", "description": "The hype is what makes this place, Sunday night the girlfriend and I decided to try this place after hearing so many things about it. After searching for about 15 minutes for parking, we stood in a short line for about 10 minutes or so.\nWe finally were seated by this older gentleman that must either be the manager or the owner. Everything inside is so cramped, we ordered a small pie, my girlfriend tried ordering wine and the bad news is for those that drink, they don't sell alcohol, maybe this is a temporary or permanent thing.\nAfter waiting for about 15 minutes for the pie, we finally got to taste what the big deal is about, well it was an ok pie, after a few minutes the pies tend to turn sort of soggy, at least ours did, we noticed that when it was brought it was a bit wet, no it wasn't the sauce, a small puddle formed in the center of the pie.\nThe only crispy part about our pie was the small burnt crust, the dough had this refrigerated taste to it, we ordered extra basil and the pie only had 5 crumbled pieces on top. We left 1 piece of the 6 slices, not saying it was the worst pizza in the world, but it wasn't the best either.\nFrom the time you're seated to the time you're given the check, there's this feeling from the and I'm assuming managing staff (the older gentleman seating everyone and another short heavy set mobster looking guy) as if they're rushing you, it just feels as if someone is going to tell you \"hurry up and eat\" \nI once thought that Grimaldi's was a one restaurant deal, there's a poster at the front door with over 30 locations in certain states, makes me just think that this place is on it's way up to becoming the next Pizza Hut.\nOverall I'm not saying this is the worst place ever, but maybe they were having a bad night, but you know what they say it's the first impression that counts.\nThis place has a lot of tourist pouring in, probably brought there by guide books, they probably think this is the best in NYC, is waiting in line as if it's for a FEMA help location worth it? NOOOO, go elsewhere if the line is that long.\n\nP.S. No credit cards are accepted at this place, take money out before you get there, the ATM at Grimaldi's charges $4.00", "author": "German P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-20", "description": "If you ever need a reason to visit New York, then Grimaldi's is it. A better pizza just does not exist on this planet. We got there at the perfect time and luckily didn't have to wait too long for a table. \n\nI literally have no words to describe how this pizza changed my life. I compare every other pizza to the one I had at Grimaldi's. And I'm a not a hard person to please when it comes to pizza, I'm a cheese only kinda girl. But wowza, even the cheese pizza at Grimaldi's will change your life. I really feel sorry for any other pizza I encounter, it doesnt stand a chance.", "author": "Danielle F."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}