{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-24", "description": "Was rather disappointed when stumbling into this Grimaldi's.  I've eaten at the one in Coney Island several times and LOVE it there.  This one is not the same.  First off they don't have pesto pizza which totally sucks.  Then the regular was flavorless.  The staff was nice and it's in a nice location, but that's about it.  Hold out and try the Coney Island one.  It's delish.", "author": "Brooklyn R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-25", "description": "I lived in Brooklyn all my life. I'm a pizza type of gal! Grimaldi's is over hyped and over rated! I think the best part of the pizza is the sauce, its watery (prego tastes better!), the cheese is good, but for the price and the \"reputation\" I would expect better sauce. \n\nIf you want good pizza, try Di Fara's that place is amazing!!", "author": "Jennifer F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-05", "description": "Still the BEST pizza I've ever had. I picked up a classic pie to go and WALKED for blocks to meet up with my family. After 30 minutes of power walking, I finally got indoors and thought about how much of an idiot I was for walking with a large pizza across Brooklyn in freezing, drizzling, horrible weather. Anyways, I was sure that my pizza was soggy and cold but oh. my. gosh. IT WAS NOT..soggy! Just a little cold haha, but definitely something an oven could fix. If you love thin crust pizza, Grimaldi's always comes through with that good good!", "author": "Christine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-04", "description": "OMG! I died and entered pizza heaven :)\nTheir pizza is soo delicious. On my trip to New York, I traveled here to Brooklyn with my friends and we just had to try Grimaldi's because it had such high reviews and sooo many people go here. So we went on a weekday and off peak holiday times during January. \nIt took forever to find because since we're out of towners, the New Yorkers totally told us to go in all these different directions and I was like what in the world?!?!?! Where is this place, but then you're on hte street and you smell this savory, robust smell of... deliciousness!!! \nSo you sort of smell your way there and you know you get closer with every step because the smell becomes more intense and makes your mouth drool.\n\nSo you're there, and they seat you and it's a cute little place with a brick oven where they bake their pizzas. Love it already!", "author": "Cindy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "Busy place, but we went at 4:30pm and only had to wait about 15 minutes. Friendly service. Cash only. Great pizza. Between the two of us, we shared the large pizza with Italian sausage. It came with fresh mozzarella, basil, and tomato sauce. It was delicious! It's a great place to sit down after walking across the Brooklyn Bridge.", "author": "Emily D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-07", "description": "This place has the best pizza that I have ever tasted. It is the standard by which I judge all pizzas (5-star). Both the price and the pizza are as good as it gets. The wait staff was very attentive when we were there. My only complaint is that there can be a wait to get seated but given the popularity of this place, it is to be expected. \n\nMy Recommendation: BEST NYC PIZZA!", "author": "Alexandar C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-24", "description": "I'm from Los Angeles and I still thought this pizza sucked if that tells you anything.\n\nIf you're visiting NY, do yourself a favor and go to Artichoke instead.", "author": "Caroline R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "It's a New York classic.  Period.  The lines are more manageable now, than I remember a few years back at their old location.  The pies are true thin crust, flavorful, light, and simply good.  They also do good espresso.  My friends shared two different desserts:  capuccino and amaretto truffle.  Amaretto was the group's favorite.", "author": "Anya A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-21", "description": "Out of all the pizzas I tried in New York, this was by far the best. We had sausage and garlic on our pizza and it was fresh and delicious. We didn't need to add anything to it, it was just perfect. I would recommend getting two if you're eating with three or more people.", "author": "Tamara T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-10", "description": "Super hyped but worth nothing. \nReasons:\n1. Attitude of the doorman :  We waited almost 30 mins to get in and doorman's attitude was .. \"Its nothing people wait more than 2 hours to get in. You are lucky\".. Okay I hope pizza is worth the wait.\n\n2. Seating : We all (4 adults+2 kids) were crammed next to the exit door with extra chairs. The place was hot with no fans..  We still hoped that pizza would be great.\n\n3. Service:  The server was in absolute rush and same attitude as the doorman. Few of us ordered soda and I ordered water, which came almost at the end and again had to wait long for refill. \n\n4. Pizza : We ordered Pizza with Green peppers , pineapple and Jalapenos  and another one for kids , with cheese only.  Both were crappy in taste.  We have eaten a much better even on road side food trucks.  So much for waiting and hype.", "author": "Human H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "Great pie at a great price with even better service.\n\nAwesome to see them expand to a larger space!\n\nParking is quite the challenge though.", "author": "Patricia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-18", "description": "I wanted to try New York style pizza and was in the Brooklyn/DUMBO neighborhood, so decided to go to Grimaldi's. The pizza was very good, though I wasn't really into the cannoli like others are. The line for a seat was out the door as they don't have space for waiting indoors. It was pretty warm and many people were already sweating standing in line. Luckily, my friend and I didn't have to wait as long as others as a 2 person seat opened up, but while waiting for our food and eating, we saw the line extend even longer. The pizza was good, but I don't think I'd want to deal with the line again.", "author": "Becky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-24", "description": "I've been here on several occasions, mostly when family comes to town and want to try New York pizza. The line gets very long, especially on the weekends and during the summer, but the food is worth it. The pizza is so fresh. Everything is made to order so you're not getting a pre-made, heated when you order slice of pizza. Depending on the amount of people that we have, we typically get at least 2 pies. You do have to pay per topping, and from experience its best not to go on overload. Keeping it simple is the way to go. You can take any slices you don't finish home, and they do reheat well and also taste good just eating it cold. \n\nYes this place is mostly filled with tourist but it is an establishment that you have to go to at least once. The pizza is great, the service is friendly, and with good people you won't have a bad time at Grimaldis.\n\nOh and it is cash only -- so be prepared.", "author": "Jess P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-22", "description": "I don't know why people continue to line up and eat here. Granted about 4 years ago when they were next door the place had a bit more authenticity and they actually took some care in making their pizza. Oh, their glory days are long gone. \n\nService was always bad not going to complain about that but it wasn't something I cared about because the pizza was good. \n\nNow all they care about is churning out the pizzas as fast as they can, quality is so low with the pizza burned to the point you wonder if you'll get cancer the very moment you eat it. And it just doesn't taste the same. Really not worth the hype and don't waste your time lining up.", "author": "Eva C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-17", "description": "The pizza is good but not as good as its hyped up to be. Customer service is very important. My friend asked the guy for cheese and instead of handing it to us he insists that they make the pizza with cheese already. Which blew our mind because the customer service was already terrible and we predicted he'd say something as stupid as that! It was almost so bad, it was funny. Pizza is definitely good though.", "author": "Shirley L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-16", "description": "1- Are you kidding me? (Original Location) Cash only (what)!\n\nI was so excited to eat at the original Brooklyn location. When I took my first bite I cringed. What is all the hype about with this pizza? Even the amazing view of the Manhattan skyline could not make up for my disappointment in this pizza. People wait on line for this stuff. Why? So over rated. The franchises are even more disappointing (Garden City). Thank goodness for tourists and local that do not get out of the area too often who keep giving this place great reviews. Otherwise there would be no lines. \n\nOriginal location closed. New location close by\nGood luck parking\n\n2- Are you kidding me? (Newer location) Cash only continues\n\nI'm sure years ago this was the best pizza in town. And maybe waiting in line at that time was worth it? (I wouldn't wait on line for practically anything food related). But this pizza is not worth the wait. Kudos to Grimaldi's business and the customers that keep lining up to eat here. If you are not from NYC then this pizza is probably many times better than what you are eating wherever you come from. It's great for their business and I wish them continued success. But with all the pizza competition in NYC the wait is over.\n\nThe cannoli I ate here was excellent. The largest cannoli I have ever seen. Crisp fresh shell and a creamy filling with chocolate jimmies on both ends. Delicious! Better than the pizza.\n\nWIGB? Yes, for a cannoli", "author": "Hungry K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-31", "description": "You can see them making the pizzas, which is cool I suppose... but there wasn't any \"wow\" factor to it.", "author": "Kathy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-27", "description": "Wow okay this Grimaldi's owns the Douglaston Grimaldi's by 3958734597345.\n\nI've only had the Douglaston Grimaldi's before, and time and time again it disappointed me with their sogginess! I've heard that nothing beats the original and I can attest that that is absolutely right.\n\nMy friends and I bypassed the line as we had someone already inside eating at a table who picked up 2 pies for us to-go. We ate them at the nearby Brooklyn Bridge Park and everything was fantastic - down to the crust. We had the simple mozzarella pizza with pepperoni and it was the perfect combination of thin crust, sweet marinara sauce, and meaty yet crunchy pepperoni. \n\nI am sold now on the original BK Grimaldi's. Perhaps I should wait out a few years before returning to the Douglaston one because I hear the brick oven takes some time to break in ;)", "author": "Valerie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-03", "description": "Took 25 minutes to get seated and then had to wait 40 minutes for pizza to come out. Waiter was not nice at all and literally said nothing to us. Got no refills the entire time at the restaurant. Plain cheese pizza tasted good at first but got cold very fast and then did not taste good at all. A waiter ate in front of us while we waited for food. We were looking forward to eating at this location but ended up having an awful experience.", "author": "Joshua S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-06", "description": "This was the first thing I ate once I arrived in the New York/Brookyln area and I am glad I did! This place does live up to all the high yelp reviews. Luckily there wasn't a line when we went and were seated right away. My GF and I shared a pizza, half pepperoni and half mushrooms. I love mozzarella and the stringiness of it and think it should be used on all pizzas. This pizza definitely had lots of it. The pepperoni had great flavor, spice, and just the right crunch. The mushroom was also very tasty as well! This place is cash only so make sure to bring cash!", "author": "Steven J."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}