{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-05", "description": "This past summer I went and visited a friend in NY. I had a laundry list of food places I wanted to go to.  Grimaldi's was on that list.  \n\nAfter an 11 am brunch in Chinatown me and my friends decided to walk to Brooklyn and check out the sites. Once we got to Brooklyn, I knew we were in Grimaldiville.  Once we got there I asked if Grimaldi's was around and our friend's brother-in law said it's real close.  \n\nKnowing it was close I said \"How about Pizza?\"  My friend's were kinda shocked since we just ate but I told them might as well check it out since were here.  So as we strolled around Brooklyn for a bit we headed down towards Grimaldi's.  I was kinda intrigued since me and my friend's had Lombardi's the night before and we thought it was good, but not the best.  \n\nSo me and my friends walk in, sit, look at the menu and make our order.  Honestly I can't for the life of me remember what we ordered, but it had pepperoni, cheese, sauce, some other toppings and it tasted GOOD!  I was diggin it.  \n\nThe crust was perfect, nice crunchy and chewy texture.  The sauce was flavorful. The cheese was nice and not overcooked.  It was a nice harmony of flavors and actually made me appreciate this pizza more since it wasn't just some run of the mill pizza.  You could actually taste the quality.  \n\nThis place definitely has their pizza on lock and I will most definitely make the trek there again when I visit New York.", "author": "Ignacio L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-03", "description": "One of THE BEST pizza's ive ever had.  my husband is a pizza fanatic, he can live off pizza for the rest of life, seriously.  and we came across this place during the day bought a pie and we finished it in the car on the way home.  although i only had 2 slices (only cuz my husband finished the rest!!) it was SOOOOOOOOO good.  i can probably eat a whole pie to myself.  Came here again at night and the line is long.  seating inside is TIGHT.  service is fast, staff is friendly.  would definitely come here and definitely recommend this place to a friend.", "author": "anne s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-27", "description": "DELICIOUS. Totally worth the wait and all the hype. The cheese and the crust are simply to die for.", "author": "Dani W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-12", "description": "Coal-Fired Red Brick Oven. Sublime Mozzarella. Nuff' Said! with ample marinara and some fresh basil; The Best Pizza I've Ever Had In My Life! Antipasto appetizer with sweet roasted red peppers are amazing!", "author": "Jimmy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-13", "description": "I agree with the reviewer who said a pizza should be greater than the sum of it's parts, and this pizza, while good, was missing something. Pizza, great pizza, is a synergy of ingredients--it's not just good cheese, or good sauce or good crust, but a singular entity. This place does not quite get there with their pies, which are a collection of individually wonderful things. There are people, some from not NY, who will vehemently disagree with me. The pizza they ate at Grimaldi's was one of the best pies they've ever had. It probably was. For me, that wasn't the case. That said, I'm always a fan of this kind of pizza making, so I hope this place continues to have lines out the door.", "author": "Shoshie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-11", "description": "I gotta say, the pizza here is just phenomenal. And walking across the bridge on a sunny day and queuing up for one of their pies is pretty close to perfection in terms of overall experiences. Don't go overboard on the toppings, or you'll miss out on the deliciousness of the fresh mozz \u0026 basil. Pepperoni \u0026 mushroom are my toppings of choice. The crust is burnt in an oddly pleasant way, and goes down smoother with olive oil (which they bring out on request). And for under $14+$2 per topping it's a pretty good value.", "author": "N C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-04", "description": "grimaldi's changed my definition of pizza. \n\ni wish it wasn't in brooklyn... i'm scared to leave the city. eeks.", "author": "Julie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-05", "description": "Dude... probably the best pizza in NYC... I recommend the takeout.", "author": "Jonathan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-11", "description": "As a life-long New Yorker, I have to say that this is not the best pizza I've ever had. Is it good? Sure, if you eat it while it's hot. Otherwise it's nice and chewy. It definitely beats Lombardi's in terms of taste.", "author": "Lisa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-11", "description": "Legendary pizza. Long lines. Fun to go to after walking over the Brooklyn Bridge. When the weather's fine, call ahead and order one to go as you're walking off the bridge, and you can walk with it to the beautiful riverside park just beyond. It's a good way to skip the line and enjoy the skyline.", "author": "N B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-20", "description": "Grimaldi's doesn't live up to the expectation. If you want to get in you have to wait in line for at least 45 minutes, to eat in the restaurant or to get a Pizza togo. The Pizza it's average. I'm sure you can get a great slice in the city in any corner joint. Zero customer service, the waiter did not care to tell us, after waiting for hours , that they turn off the oven. Which means more time waiting. So if you are really hungry you should bring snacks because they don't really serve anything else that a platte of antipasto that is really overprice. The owner was at the restaurant and he was rude, not friendly and fought with the doormen.", "author": "Celia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-15", "description": "Great thin crust brick oven pizza.  They don't serve slices only whole pies which you can add as many toppings as you want. They also do not accept credit cards so bring cash. You may want to get there early because the line to get in gets insane. Don't expect a fancy smancy place, wood paneling and a lot of pics all over the place. Seating may get a little cramped", "author": "Anthony T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-16", "description": "I do not know where they put the people in front of us?We waited in a very long line, The line moved within minutes. We were seated pretty quickly, and next thing you know , we ordered, we ate and the check. It was fast and the PIZZA was amazing. We had two children with us, so this was really good.", "author": "brooke z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-11", "description": "the pizza is indeed fantastic just as the line would suggest, however this is like a once a year pizza place or a tourist trap pizza place. this isnt the place on the corner that is quick, remembers your face and your order when you walk in. thats what i feel like a good pizza place in ny should be, and i have found a few of those in my time in the city. everything here is fresh and great but because of its popularity the prices are more like you are going out for a fancy meal than having some pizza with friends. i do suggest going here if you have never been before, i'll let you form your own opinion on when you need to go back....\n\nlike a few other people i do suggest going in off hours, if you can guess when those are. i promise you wont be the only ones with this idea though.", "author": "Ryan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-15", "description": "i hate lines, i hate waiting in lines and waiting in lines outside when my feet are cold...however i would gladly wait another hour in line in much colder weather for this pizza. \n\nday started with a walk over the brooklyn bridge which Ive never done even though ive lived in New York my whole life (yes, i know im sorry). it was a beautiful sunny day and the views from the bridge are breathtaking. we knew we were in the right place the minute we saw the line. Everyone was excitedly waiting  for their turn to try some of  arguably the best pizza in the city of great pizza.\n\nso we finally make it in  and the person who seats us says it will be 30 minutes for pizza so they can reheat the oven. But it didnt matter now, we were in . We decided to stay classic getting ust a regular plain fresh mozz pie and then we got another one half sausage and peperoni and half sundried tomato and roasted red pepper.  The roasted red pepper and sundried tomato slice was life changing..ive never had a pizza that tasted to fresh and had such a perfect balance of flavors.\n\nAt pies starting at $14 its completely more than worth it financially and it definitely has a fun atmosphere full of people all excited to being part of the experience", "author": "Alexandra N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-13", "description": "Awesome pizza. Nearing perfection and I'm torn between 4 and 5 stars. I was pretty lucky and timed it right so no long queue. Score! I ordered the Margarita with added pepperoni and black olives and it was delightful. Hot, very fresh and flavoursome with a great texture to the perfectly constructed thin base. The fresh basil adds a nice kick too. I was a little overzealous and ordered a large just for myself. Oops. Although it was an extremely yummy pizza and I was hungry I just couldn't finish it. I think this comes joint top as the best pizza I've had and bizarrely the other was in Düsseldorf, Germany. I think places like this will prevent me from ever eating a Dominos or Pizza Hut again.....and on that note my decision is made. 5 stars and yey for coal ovens!", "author": "Graham M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-27", "description": "Lives up to the hype! For the best pizza in NYC head directly out of Manhattan across the Brooklyn bridge and kinda get lost below it and you will find it.  (Hint look for the long line ... like people waiting for the release of a Nintendo product)\n\nFirst you get Margherita pizza nothing else you don't need pizza distractions if you want some goofy pizza goto California and while your at it say to yourself if it weren't for my horse I wouldn't have spent that year in college.  When you cook a bizzillion pizzas a year you will master the art of the perfect crust and Grimaldi's has the pizza shell you will compare all other pizza's for the rest of your life to.  That said I LOVE NYC but aspects of a better pizza exist elsewhere but not in a complete package in my mind.  The perfect pizza as I have had it would be Chicago Cheese (Lou Malnati's), Boston (which I detest the place long before the city won any kind of sporting events but thank you Giants!) sauce (Pizzeria Regina) and New York crust cooked in NYC by a real paizan!\n\nYou'll see the french cuffed evian swilling bree munching types sitting next to dockworkers in perfect pizza harmony.  I recommend you use the bathroom here then you can tell yourself after peeking at the prep station you learned a trick or two ... ah cheese first then sauce on top!\n\nI loved the fact that they served bottled beverages though not the green approach.", "author": "MJ A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-25", "description": "Absolutely the best pizza in the world!!!  The ingredients are super fresh and I love the thick slices of mozzarella they use.  It's well worth the wait.  One thing I wouldn't do again is order the mushroom toppings - they made the pizza too soggy and \"watered-down\" the taste of the overall pie.", "author": "Sally C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-14", "description": "Read, READ, READ the 1 and 2 star reviews here and BELIEVE them. What an enormous disappointment.  This is definetely a case of -maybe this place was really good at sometime in the past but a huge Tourist Trap now. The pizza middle was SOGGY. The edges were burnt, not crispy-nice, burnt.  The basil was burnt-black. The sauce was just canned tomatoes.   I should have known something was wrong when I noticed there was not one Italian person working there, none of the pizza chefs, none of the wait staff, not the manager etc.  In Brooklyn at a Pizza Place -Really??? Not one Italian working there? Odd. The best part of this place were the views of New York on the way back walking over the Brooklyn Bridge. Avoid the 1 hour line, avoid the cramped, elbow-to-elbow tables, but especially avoid the pizza at this place.", "author": "Richard G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-09", "description": "Best pizza in NYC? Horse Shit! Don't get me wrong, the pizza was good, but not 1 1/2 hours line wait good. I can get just as good NY pizza delivered to my house from Peppino's in 10 minutes. In addition, the geriatric ass-clown at the front door was rude. Don't believe the hype, it will have you waiting in line for an hour + for just pretty good pizza.", "author": "Trevor L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}