{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-19", "description": "When considering the pizza on its own, it's great. My girlfriend and I went to Grimaldi's after hearing about the hype and were not let down at all. The pizza is pretty straight forward; you pick your toppings/size and the pizza is cooked above coal. The service was great and the wait wasn't that bad (15-20 min?) but we might've had a good day.\n\nHowever, I do think this place is over priced. It's a bit ridiculous how they charge for each topping you put on. I think that they're able to do this because tourists visit this place after hearing the hype and pay whatever to eat after waiting in line for a long time. It's a great place to go one time if you're visiting Brooklyn, but I think it's way too over priced for multiple visits. They also don't tell you that it's cash only until you're seated. We probably should've checked whether it's cash only, but I feel like that's something they could've told us when we were in line as the waiter came out frequently to check on the line. As someone who hates carrying cash, I was forced to use one of their atms, which charges 5 extra dollars for using the machine, after I ordered, so I suggest that you bring enough cash when you visit Grimaldi's! I honestly didn't mind the paper plates and plastic forks/knives/cups, but I guess that's dependent on your preference!", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-22", "description": "First of all, cash only. Right there I see a profit being turned on their personal ATMs due to the fee. So that was a little annoying. We didn't experience a line like most guests.. That was nice- however, we were directed to a table with 4 chairs for the two of us. Having never been here before, we assumed we just had two extra chairs, because the tables were pushed together. We both had shopping bags and purses, so we set them in the seat. It wasn't much longer before a waiter came over (before even getting our drink order) yelling \"ah ah ah\" like we were dogs and telling us we weren't allowed to do that. Of course I said we had no idea, considering no one informed us. I think he regretted his behavior after that, because he was sort of sheepish. It was pretty rude and embarrassing. We don't mind sitting elbow to elbow with strangers, but there's a better way to tell people that's how this place works. In general, you're not going for friendly service I can tell you that! The pizza was good. However, we also waited 45 minutes for that - yet there was no line? So that was odd. It was increasingly odd when the people that were sat RIGHT NEXT TO US (15 minutes after us)got their pizza before us. We only had two toppings.. The whole place is just weird. The pizza is good yes, but I wouldn't say great and I wouldn't say this is a must eat. We only went here because we were starving and it didn't have a line. Lesson learned.", "author": "Abigail B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-08", "description": "Took my parents to this place and they absolutely love this place! Great great food and great staff!! Would come back here again!", "author": "Sophie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "This pizza was very good.  I could taste the coals from the oven. \nWe order a small pizza and it was more than enough for my 8yr old granddaughter (who often eats more than me) and myself.  However, they were nice enough to packed it up for us. \nIt's a nice little walk (5 minute) from High St Subway.  \nThe Cannoli looked delicious, however my granddaughter  didn't like it and I was too full to try it.\nThere is nothing fancy about this place.  We are with plastic silverware and plastic disposable plates.  Sodas were 20oz bottles and a cup of ice. \nHowever, I recommend this place.  The food is good, the place has character.  If you go at night you see an amazing view of Manhattan.  And this little old place is right under the Brooklyn Bridge.", "author": "Patty S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-07", "description": "As a lifelong New Yorker, Grimaldi's is an over-hyped pizzeria that is comparable to many other pizzerias throughout the five boroughs. With that being said, the pizza IS delicious, but the question is if it's worth the wait? Honestly, the few times I've been here were for friends who are from out of state and desperately wanted to try this pizza they've heard so much about! It is in a nice location in the heart of DUMBO near the Brooklyn bridge and a gorgeous view of downtown manhattan. I never really cared too much about the wait because I've been with friends and we always find ways to pass the time, but I must admit it can get tedious and long. They have a line outside of the restaurant and someone takes a head count of the parties in line keeping track of tables that open. I always enjoy the pizza, truly I do, but I'll tell you there are many amazing pizzerias in brooklyn and Staten Island comparable in taste that don't have lines down the block to get inside!", "author": "Gabriella T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-01", "description": "Pizza was good.. pretty sure I got scammed by the girl at the register.  I handed the girl 2 20's on a 28 dollar tab. I didn't get any chance back, she says I gave her 25 so when I tried to give her the other 3 bucks she said no don't worry about... now either she is extremely nice or she got me", "author": "Kristopher S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-26", "description": "We walked in asking if they were still serving as it was 10:40 PM, and was informed we could order to go, and so we did.  However, as we were standing, waiting, and watching our pizza made before our eyes big boss man came to inform the staff they don't stop seating until a quarter till 11 PM.  We were invited to stay, but not to impose we took our pie to go and being an eager beaver, I ate my pie, curbside.\n\nSitting on the curb, I had a few thoughts going through my head...\n-Wow this cheese is really good, I definitely recommend getting extra fresh slices of mozzarella\n-White Pizza yummier than Marinara, but it was interesting how they kinda splatter the pizza sauce around instead of painting a thin layer on the crust, I actually appreciated the sporadic pockets of sauce\n-Nice crispy thin crust, but not consistent throughout the pie, maybe because the pizza sauce soaked it?  However, overall not too bad\n-Hmm, this is a pretty good view of the Brooklyn Bridge\n\nTIPS:\n#1 NO SLICES, only whole pies, and with each topping being a la carte, it adds up \n#2 CASH ONLY, so bring at least $20\n#3 Don't come close to closing, but the plus side was no line =)", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-28", "description": "The place has a long line outside in the cold to get a table, meanwhile inside is 6-7 tables empty from the time I sat down til I even got my pizza. No need for all the hype and long wait inside. This place needs to flip tables more. Not to mention they don't serve alcohol. 10 feet away you can enjoy yourself with a glass of vino and pizza at Juliana's. Pizza was ok nothing to rave about.", "author": "Briana O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-27", "description": "I was told this was the best ny pizza. That was definitely wrong. The pizza itself was very pretty, but the taste was bland and the crust was way too crunchy. If the pizza had been good, I would have excused the bad service, but since it wasn't lets now talk service...\nFirst, refill water when it gets low. It's basic restaurantology. I should never have an empty glass and have to ask for a refill. And seriously a smile or a thank you or something would go a long way. You can't be rude AND have bad pizza. \nThis place is OVERRATED!", "author": "Emily S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-30", "description": "Just revisited my favorite pizza place and it's not the amazing pizza I remembered it to be. It has definitely changed over the years, or more and better pizza places have popped up to compete with them. Don't get me wrong, my friend and I still inhaled the pizza because we were starving and all the ingredients tasted fresh and delicious. We ordered a red sauce pizza with meatballs, mushrooms and olives. The meatballs were really good. A few too many olives on there and they were super salty. Didn't see a trace of the basil that was supposed to be on there. The crust has changed too, it's not the amazing crust it used to be. We went on a Friday afternoon and waited in line about 20 minutes, so it wasn't terrible. And by the way, it's cash only.", "author": "Mahsa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-26", "description": "I always their pepperoni pizza. Hands down the best pizza in nyc. Highly recommend. The employees are very friendly and professional. The place is very clean. If you are visiting ny definitely try Grimaldi's before leaving.", "author": "Albert K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-13", "description": "UHHHH MAAAAAY ZINNNNNNNG PIZZZZZAAAAA! I've made a quest, where I'm going to go to all the pizza places near DUMBO! You have to get the regular, it's still delicious without the toppings! The cheese, sauce and basil went so well together, and it was so filling! The ingredients tasted fresh and the crust was amazing!! Must have when you're at DUMBO!", "author": "Shanjida B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-21", "description": "The AC doesn't work when it's hot out and they don't serve alcohol. If you want a sauna to eat your hot pizza with warm apple juice then this is the place for you...\nGave 3 stars because the pizza is good but the experience in there was not", "author": "Jefferson M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-10", "description": "Whoa. Grimaldis pizza has paper plates and plastic knives?  We sat in the second floor which is not air conditioned so we were very hot the entire time. The place is a dump of a restaurant. The tableclothes are stained, they don't offer any bread as an appetizer. I wish I could rate this place some negative stars. It took forever to get the check and then we were told it was cash only. What kind of place is cash only?!?  Obviously this place does not care about customer service. Terrible service. Terrible environment. The waiters seem like they should be working in a mall food court. Big tourist trap.  If you want an authentic pizza go to Julianna's next door to grimaldis. Still run by the Grimaldi family and they take care of you there.\n\nThe pizza was an altogether different issue. My family eats pizza in every city we visit. When a thin crust pizza is cooked correctly, it is not gooey. We ordered a cheeseless pizza and it still came out gooey. I've never seen a pizza like this that was not crisp. It's like they do not know how to cook a pizza or try to do it very quickly. Or maybe they prep the pizzas in the morning and the sauce sits on the pizza. Either way the pizza sucks. \n\nI absolutely hated everything about this place. Don't wait in line for it!  Soggy pizza. Rude waiters. They hide the tip in the bill. Cash only. No AC. No appetizers. What a DUMP!", "author": "Troy O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-26", "description": "Went to this tourist trap at the request of out-of-town visitors back when I lived in the city. The line is always long. The pizza is nothing special, especially for NYC. Service was terrible. Our waiter took our order and never returned to our table. Never entered our order. We had to flag-down another server to get our order placed. Not even in the top 10 pizzas places I've eaten at in NY.", "author": "Bryan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-20", "description": "The pizza was great! Good quality made with fresh ingredients. The fresh mozzarella on the pizza is amazing. Upon arriving we waited in line for about 15 minutes outside to be seated. Once seated we realized that it was a cash only establishment, no big deal, but would have been nice to know before hand. Depending on the time of day you go it may be hard to accommodate large groups. It was some of the best pizza I've had in nyc and will definitely be returning. It was well worth the trip.", "author": "Kirsten A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-07", "description": "It's worth the wait and worth to check next door. I love Grimaldi's but it's Brooklyn there is a lot of great spots like Juliannas next door or Di Fara's. You could also go over the bridge to Lombardi's. Just saying", "author": "Brandt S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-12", "description": "I don't really like pizza but I like this place. Got the white pizza with chicken and extra mozzarella. \n\nThere is a bit of a wait and it is pricier but it is relatively good pizza. Not too heavy.", "author": "Jenn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-22", "description": "Love this place. Call a pie in to go, pick it up and eat it out on the street. That's the move.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-15", "description": "Loved the pizza. Great place to eat after crossing yhe Brooklyn bridge. Cash only, but authentic brick oven pizza with fresh ingredients. So, delicious.", "author": "Kevin M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}