{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-29", "description": "With a restaurant as popular as Grimaldi's, the haters are bound to come out.  There are reviews that state the authenticity is gone and that it is more of an assembly line than a restaurant.  Getting off the subway in Brooklyn, Grimaldi's was a short walk away but when we asked a local for the directions to the pizzeria, it was as if she has been asked that question a million times.\nOnce we got to the restaurant, not long after lunch hour, there was about a 15 person lineup.  It was very well organized and the hostess seated us after about 20 minutes.  We ordered a whole pizza, and the kitchen is open concept so u can watch your meal being created.  Each topping is about 2 dollars, we went with pepperoni's and roasted peppers and it was amazing.  Paired with fresh mozz and a light amount of sauce, it was perfection.  What Grimaldis has that mosts dont is a coal oven.  It gives the crust a great flavour and crispness.  Grimaldi's is worth the hype for me, and i will definitely be back the next time i cross the bridge.", "author": "Amy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-21", "description": "Quit  your bitching and wait on line like everyone else. The pizza is great. Then go to the ice cream joint down the street. Great summer spot. Walk the bridge to go eat.", "author": "K M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "I don't know if this place is as awesome as you believe it is when you leave, or if you're just so starved and miserable when you get in that sitting at that tiny table and feeling your legs thaw is so heavenly that anything would be incredible.\n\nThe line was long when we got there around 1:30 on a Saturday in February, longer when we left.  We were told 35 minutes. Ha. Try 95 minutes.\n\nIt was freezing, with 50 mph winds, but still we stood, shivering, for an hour and a half, for this pizza.\n\nWhen we finally got inside, there were literally body parts I could feel radiating cold. I ordered a beer to counteract the potential hypothermia, we got a half pepperoni, half regular pizza, and sat waiting.  Waiting in line for the bathroom was actually one of the better parts of visiting, because you're standing next to that deliciously hot oven watching the guys whip up beautiful pies.\n\nThey do a pretty good job of packing people in there.  The atmosphere is fun, and despite what have to be exhausted employees, everyone is jovial and friendly.  A bride and groom came in just for pictures, and the room errupted in cheers.\n\nNow, the pizza.  Living in California, i'm starved for really good pizza.  You don't realize how bad the pizza is until you have good pizza.  I don't know why this pizza is so good. It goes against everything I believed I loved about pizza, fluffy crust, thick cheese... The crust is thin and crisp, the sauce minimal.  The flavor is amazing though, with the fresh basil. And I swear, they milk the cows out back to prepare THE freshest mozzarella I've ever had. I'd buy cheese from them if I could.\n\nThe pricest are fair.  I'd definitely go back, and I'd wait in maybe an hour max line, but definitely not in the freezing cold for an hour and a half. Glad I did it though.", "author": "LK A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-09", "description": "I love their pizza. It's the best I've had thus far.\n\nBut I absolutely HATE the long lines. On a good day it takes 2 hours to get in. On days where they partition a section for a party then you're lucky to get in 3 hours. There have been countless times where we want to go there but are turned away by the lines.\n\nIt doesn't seem like management really cares about moving the line along and get more customers in and out especially when we see empty tables. The long lines makes them feel more attractive as a eating location.", "author": "Michael T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-08", "description": "I admit the pizza is good at Grimaldi's but, there are more than enough fabulous pizza joints in New York which will likely satisfy you as we'll.  we took friends there yesterday who were here from England.  The trek across the bridge was fun and the day was beautiful so you got terrific views of the City and we worked up an appetite.  The line was not all that bad - most people were from out of town.  We got a table upstairs and our order was taken quickly.  We were starving by the time it arrived.  Service was extremely slow and the pizza was warm and then cold by the time we ate it.  Didn't want them to reheat it as it would have taken forever.  Don't get me wrong, it's good pizza but, #1, don't think so.  Save yourself time and money and frequent your own local pizza place.  La Traviata, here we come!", "author": "Jill E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-30", "description": "I went last  night, and contrary to popular belief the line was long. However moved quick. We waited for about 10 minutes. We had a party of four. It was quick and easy! We ordered two pies, sausage/pepperoni and ricotta/meatball/mozzarella. Delicious!  Washed it all down the a black cherry soda.  The staff was AWESOME! We had tried to take a shameless selfie and the waiter came up to us and said \"I do this all day long long here is the best spot!\" Moved a table, took a picture \u0026 let us see. Once we gave it the ok he put everything back and did the same thing for another table. Service was AWESOME. The pizza tasted like Italy in the summer time on a cool breezy night. (or I assume lol) Everything did taste fresh and crisp. As it should it's old school brick oven Italian pizza. One draw back though, the liquor license is pending. No drinking. At least it's family friendly. Still no complaint's! I highly recommend this NYC staple!", "author": "Simon B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-19", "description": "For all the hype that this place gets, I thought it would be awesome to try... Everyone in NYC seems to rave about \"the best pizza in town\".\n\nHad to wait outside for like 40 minutes to get a table. \n\nWhen we were seated, to save on space, we were seated with a couple, so had to make best friends quickly...awkward. \n\nService was alright, nothing extraordinary. \n\nPizza was a generous size for a small. Pizza, itself, was delicious!!! :-) It didn't quite live up to it's hype, but hey, it's some great pizza!!", "author": "Christina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-06", "description": "Go there for the pizza. Obviously. \n\nThis is the best pizza I've ever had and as an Italian girl who has been eating New York pizza for decades, it beats every other one.\n\nYes, the service is slow and there is a substantial wait, however when was the last time you went to a pizza parlor for exceptional service? That's mind-numbing. You frequent the pizza place deemed best in New York for one reason: the pizza. \nAND THIS PLACE DOESN'T DISAPPOINT!\n\nThe crust is slightly chewy with pockets of crisp. The cheese is melted so it's stringy, but not rubbery and the toppings are fresh. We ordered sundried tomato and basil and were floored with how every bite was better than the last.\n\nThe real secret is the sauce. I'm not sure why it's so good, but it's not too salty, not too acidic yet leaves a perfect balanced taste in your mouth.\n\nUnfortunately, there is a wait so I'm not visiting Grimaldi's often, but I'll be craving it every day until the next time I do.\n\nClearly, anyone who knows good pizza and has eaten at Grimaldi's knows it's the best they'll have in NYC.", "author": "Rachel C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-24", "description": "it's good. but not THAT good. plus, i hate how it's so hard to find. i always arrive at grimaldi's in a terrible mood because i've just trekked across the brooklyn bridge and gotten lost. and then i have to stand in line while i'm hungry. NOT a pretty combination.\n\nluckily, i have friends who don't take this quite as badly as i do, so they manage to cheer me up. the pies are good at grimaldi's, but very thin so not that filling. i'd say one large pie per 2 people is about right. :) the service is quite good considering the sheer number of patrons.\n\nworth the wait and the walk? NO! worth it if a visiting friend really wants to go? yes. :)", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-06", "description": "I think I'd have to put this on the overrated list. while it was a tasty slice and super fresh ingredients it reminded me of so many other coal brick oven pizza places. \n\none downside is it's only pizza and you can only get a pie...no sliced allowed. thankfully we didn't have to wait in line for a table cause the service was subpar. we split the pie as half pepperoni and half margherita and the pepperoni was way too strong and killed the pizza sauce and fresh mozzarella taste. definitely worth a one shot deal but I'm not dying to get back here anytime soon.", "author": "Peter A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-18", "description": "This is one of those review. One of those reviews that has so little purpose because Grimaldi's clearly already has a good consensus.  So my 1 cent: great base, great toppings, great flavor, classic yet exhausted venue, undesirable line, wonderful location. But not quite the best I've ever had. I would not go here again just because of how inconvenient an experience it is. However it is definitely a worth one time novelty experience.", "author": "Adam B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-12", "description": "OMG ABSOLUTELY FAVORITE PLACE! This is definitely a place to check out if you happen to go to New York. Took a vacation to NY and went to this place and waited in line in the rain for about 30 MINS but quite worth the white. IT WAS DELICIOUS!\n\nThe owner was so friendly and nice.", "author": "Lynn U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-02", "description": "I gotta say, after all these years of hearing about the world-famous Grimaldi's... I'm just not that impressed. Maybe we made a mistake going with a simple classic (basic margherita - tomatoes, cheese, basil and sauce), but we thought that was the best way to sample up the true classic pie. It was good, mind you, but certainly not the best in all of NYC metro area, or even Brooklyn. The crust was doughy, and not really crispy at all. Flavors were nice, but again - this is the best? Nah. At least the prices were decent. I just wish we had tried Juliana's.", "author": "Dan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-28", "description": "Those long lines of tourists waiting for the ultimate pizza experience, \nSomehow, someone got Grimaldis name into a guide book, consequently \nthe line of tourists,   Someone should tell everyone that JULIANA right next door to Grimaldis ,is the original owner and Crater of the the Grimaldis pizza, so if you want the Grimaldis pizza made by the original owner Go Next Door to JULIANA'S\"S  Grimaldis you should have never sold the original store    UFFA", "author": "Anton N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-09", "description": "To all pizza lovers everywhere, i present to you the holy grail! i consider myself well versed in the language of pizza and have none that top this place. the pies are kinda small so order 2 and the place is usually packed but you can always call for pickup. my all time favorite is the plain with extra basil, always fresh and fantastic. i also strongly recommend the ala vodka and the pesto even more so. no matter what you choose it should be amazing. check out the website as they have other locations in long island and other boroughs", "author": "Spencer F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-25", "description": "Walked across the Brooklyn Bridge from Manhattan to burn off some calories with Grimaldi's as our end goal.  We read that the wait can get up to an hour but we were still shocked when we saw how long the line was.  We walked up to the restaurant, saw that the line started a few feet away and started walking....walking.....walking.....towards the end of the line which was almost towards the end of the block!  We waited in line for about 20 minutes but then came up with the ingenius idea to phone in our order.  AWESOME IDEA!  We picked up our small pepperoni pizza about 15 minutes later and headed down to the river where we ate with a great view of Manhattan's sky line.\n\nThe pizza was pretty good.  Not the best I've ever tasted - I thought the crust could have been a little crispier and less doughy but the ingredients on top - the mozarella, the pepperoni, the basil - were all super fresh and super tasty.  And the small pizza was huge for only $14 ($12 plus $2 topping)!\n\nWas it worth the hour long wait?  Probably not.  But worth the 15 minute to go order wait :)\n\nBy the way, the cannolis here are super good here!  Kind of expensive at $3.50 a pop but they are huge and a great way to end the meal!", "author": "Jenni Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-01", "description": "Pizzas here are good but not worth the wait in the cold for 1 hour during winter.", "author": "Anine Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-15", "description": "Stopped in for lunch with a co-worker since we were in the area.  I had never been here but she had on a few occasions and was a big fan.  It's a big establishment with seating upstairs and downstairs.  We ordered a large cheese pizza.  The pizza is thin crust so it's easy to eat 4 slices no problem.  The sauce is ok and the cheese is fresh mozzarella.  Overall, it's tasty but not the best I've ever had.  The price of $14 for a large plain pizza was a bargain in my book.  The pizza came out fast so if you're on you're lunch hour, you should be ok.   The price for a soda was $3.  NYC pricing I guess and my soda was flat.  The service we had wasn't friendly or warm but it was acceptable.    I will be back.", "author": "Michael F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-25", "description": "Went to DUMBO for the first time for work and was told this was the BEST spot in DUMBO to get pizza.  So myself and 2 friends decided to check out all the hype!  One of my friends and I split a large cheese, which was $14 plus tax \u0026 tip.  All l can say is I would have been better going to a place where I can buy by the slice and spend about $4.  It was so NOT worth it!  There was absolutely nothing special about the cheese, the sauce or the way it was seasoned.  I did like the thin crust, but other than that, I am totally confused on why THIS is one of the best places... Also, their food rating is PENDING, which usually means they failed their inspection or looking to get a better grade! So, just be aware.  I will say, out side of the food, the ladies restroom was an absolute disgust, which we did tell them.  Next time I'm in DUMBO and I want pizza, I won't be going there!", "author": "Ophelia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-21", "description": "Worth the 40 minute trip on the subway.\n\nWorth the possibility of waiting an hour (or more) on a line that goes around the block.\n\nWorth doing all of this in the winter in the freezing cold.\n\nEven if it's only for one teeny tiny bite of a slice. \n\nIt's just THAT good.\n\nSeriously.", "author": "Rachel H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}