{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-12", "description": "Awesome pizza----staff not too friendly. The tables are super close, so any conversation is heard by table on either side. But the thin crust pizza is outstanding!! Well worth it for that alone.", "author": "Beth P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-27", "description": "Cash only restaurant. Their pizza were great!  I did a take out but was asked to wait outside. A bit odd. But the place was packed with people lined outside so perhaps there was no other standing room. The line seemed to move relative quick if you decide to dine in.", "author": "Hoon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-17", "description": "Come before 7. The lines gets so long after that! The price is pretty good tho. Crust was burnt in some parts but pizza was great esp with ricotta cheese. The service here isn't that great since they don't exactly have that where they will fill your water and pay attention to you. So you have to ask for water and actually go to them to get the bill or your going to be waiting..", "author": "Helen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-08", "description": "I wish I had reviewed this place before the move, because this would make a much better update.\n\nBefore the move, the place had a lot of character, it was small, if you were in the know you could take away without waiting in the line, a line that was ALWAYS at least 30-45 minutes and up to 1.5 hours. Then you got in, it was tiny and cramped, and the pizza was amazing. I liked this grimaldi's. This was a 5 star grimaldi's.\n\nNow, the space is a lot bigger, the line is (on average) shorter, there are flat screen TVs, the framed photos of frank sinatra appear to have moved with the space, but are more sporatic, and the pizza... well at least when I tried it, it honestly wasn't as good. It was good, and I had a first-timer with me so I feigned enthusiasm, but it wasn't as good as the original. \n\nI could have just landed an under-oven-fired exception to the standard, but still... I also found out on the way out that they didn't move the oven from the old location (20 feet away), which struck me as odd... doesn't the oven make the pizza? (I mean this in the theoretical sense, not the literal sense)", "author": "Jake D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-31", "description": "We got their early as we saw a line the night before. Line didn't form until 11:40a on a Sunday, when they open at noon. They got everyone seated by 12:15 and pizza showed up very shortly after ordering. \n\nIt was delicious. We ordered an 8-slice large pizza, at ate 6 of the pieces so we probably could have gotten away with the medium (6-slices). That said, the pizza was still good out of the fridge later too.", "author": "Tim C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-07", "description": "Tasty pizza. Very basic menu, but hey some of the best things are kept simple. Place is a bit cramped but it's NYC what do you expect!", "author": "Jane M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-08", "description": "Waited 40 mns to get seated but it was well worth the wait.  Thankfully it was a gorgeous sunday so it wasn't so bad standing outside, mind you we did arrive after 2PM.  If driving you can try to find st parking or there is a lot for $5 and they valet your car (right next to the brooklyn ice cream factory).\n\nOnce you're at the front of the line they're quick and efficient in seating you.  Tables are right next to each other so you're pretty much eating right next to strangers, no need to be shy, you're all there for the same thing...Delicious pizza!\n\nWe got the large pizza with pepperoni, extra basil and mushrooms.  Crust was thin with just enough garlic and grease to make it tasty yet not overwhelming.  I usually don't eat all of my crust since that's all filler but i definitely ate it all here.  We killed a whole pie between the 2 of us although i ate the smaller slices while my bf ate the bigger ones.  We were both happy and full (not stuffed) once done.  We got some orange sodas to wash it all down (tasted just like orange creamsicles).\n\nWill definitely be going back although i think we'll go earlier...The line didn't change at all while we were there so doesn't seem to matter what time you arrive.  BTW, place is small so if you have a huge party, you'll either have to split up or just order takeout.  We saw one opt for takeout.", "author": "Caroline V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-08", "description": "I've orginally from Brooklyn and I always have to have some thin crust pizza. The pizza sauce is very fresh and tasty. You can taste the ingredients and the quality of cheese that is used. Highly recommended if you're in Brooklyn!", "author": "Rick D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-20", "description": "Yep, takes a little trek from the subway to get here right under the Brooklyn Bridge. The line was long and wait was about an hour and a half but like others have said, it was entirelyyyyy worth it. The pizza is amazing. We got half pepperoni-mushroom and half margarita. \n\nOnce you're done take a way down to the waters and hit up the ice cream factory and enjoy the view! You can see the statue of liberty from here, albeit quite small. \n\nBrooklyn Bridge\nBrooklyn Pizza\nBrooklyn Beer\nBrooklyn MEN\n\nDefinitely highly recommended! :)", "author": "Tammy Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-13", "description": "I do like the pizza,  not a fan of the wait time.", "author": "Inessa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-20", "description": "Lines may be long, but it goes by reasonably quickly and it is definitely worth the wait! Their pizza is amazing.", "author": "Abby B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-02", "description": "LOVE LOVE LOVE this place!  Got to go to the orig. location in Dumbo.  Best pizza in NYC!  Well worth the wait in the long ass line, however here is a trick-- you can call the store and order take out and guess what?  You can skip the line and go right in to pick up your order :)", "author": "Francine S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-13", "description": "This place gets a revoked star. After giving it a second chance years later, I just don't get it. Lines I don't mind. I don't even mind overhyped things and I think I'm usually a fair judge. I don't expect amazing service. But what we sat through last Sunday was pretty damn bad.\n\nI don't know if daylight savings screwed them up and they were short people or if their service is normally that bad, but we must've sat for about 10 minutes before my husband was finally able to flag someone down to take our order (we had no idea who our server actually was because all of the workers were all over the place).\n\nIt definitely wasn't just us experiencing this either. Looking around our section, everyone seemed to be having a couple of problems be it getting the check, waiting for their server, or getting things wrapped up (we ended up asking twice to get our leftovers wrapped up and finally just gave up, picked up our two slices, and walked home with them in our hands). I get the impression that this is the kind of place that doesn't care about making a good experience, because they're always going to get that line of customers no matter how they're treated.\n\nThe pizza isn't worth it, and the second time around I've realized without a doubt that I have had better pizza at multiple other places across NYC. The sauce tastes like it comes from a can and there's nothing spectacular about the crust. In short, everything tastes totally generic. I think I'm done with Grimaldi's.", "author": "Tanya T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-24", "description": "Why did I get sucked into going here. My instinct told me not to fall for the trap but a friend convinced me otherwise. The pizza was bland, soggy and left a lot to desire. In a city where the options are limitless, do yourself a favor and skip the long line and go Joes Pizza on Bleecker for delicious authentic slice of pizza", "author": "Avneet M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-08", "description": "They don't allow you to buy a slice. You have to pay cash. Plus the menu is limited. The food was fresh but I was left a little disappointed by this place.", "author": "Robert R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-21", "description": "This was the first pizzeria my friend and I went to during our recent trip to New York.  We arrived at Grimaldi's around 10pm to find a long line of about 20 people outside.  My friends and I decided to use this opportunity to act like tourists and take pictures with the Grimaldi's pizza store sign and nearby Brooklyn.  We waited for about 15 minutes and was seated at our own table near the window and the a/c unit.  And now onto the pizza...\n\nOMG delicious!  We ordered a large (8 slices) regular pizza with Sun Dried Tomatoes, Pepperoni, and Italian sausage.  The pizza was delivered to our table steaming and hot.  The crust was toasted and crispy, but did not crunch like a rock.  The toppings were delicious.  Hands down, better than any pizza I will find in the Bay Area.\n\nLeaving the restaurant, we were four very happy and satisfied tourists :)  We slowly wobbled back to our subway station.\n\nNote: CASH only, can only order whole pies, NO slices", "author": "Ray Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-31", "description": "My star rating is actually 3.75 really. \n\nFINALLY! I get to stand in that ever-long line to try their famous coal oven pizza! WHOO HOOOOOO!   \n\nCame here with a group of friends and they were all very pleased with the pizza.  Based on their overall feedback - they felt that the crust was fresh and chewy...which is not easy to create for any pizza joint.  To them, Grimaldi's stood out to be one of the best pizzas they have ever tried.    For me, the tomato sauce was REALLY fresh and I felt that the ingredients were all up to par with quality and taste.  One pie is definitely fit for 3 people on average so the portions were not lacking at all.  In terms of the crust, my palate is very picky.  Although i do see the point about the chewiness of the crust and the way that it's made - I also taste the burnt aspect of the coal oven surface touching the bottom of the pizza.  Because of that, i felt the burning (or coal) taste prevailed over the fresh ingredients.  Again, this is because of the palate being very sensitive to a lot of flavors, especially when presented  simultaneously.  Besides, my review does not even matter even with no stars... it's already got superb reviews.  But it's a good thing to point out, nonetheless.\n\nOk, so the way it works is that for the pizza menu - it includes a list of  toppings for $2 each mainly.  Garlic, mushrooms, extra cheese, haha.  Before you know  it, you're adding toppings like nothing and the bill comes out to be one hefty pizza pie! HAHA  So just be mindful of your topping choices.  \n\nThe place itself is a bit tight - so be aware.  My friends were over 200+ lbs and it was a tight squeeze but we made it work for ourselves.  Because of the tight space, you have to be careful with pizza guys floating around trying to serve other customers.  Again, depends on where you will be seated.  The other area that might be lacking is service, depending on how lucky or unlucky you are.  Some of the servers may be exceptionally friendly and there are those who just wants to get you the damn pizza and give you the check.  I also noticed waiters who were trying to work through a tight space and showing some expressions of irritation (I mean, it is a busy place).   So it really depends.  (but to me, I find this to be heaven for waiters with constant turnovers and imagine the gratuities! haha!) \n\nOh, another recommendation is that if you are intimidated by the the line, there is always Juliana's.  It's the same brick oven Grimaldi's use to have.  Well, you can google their news on that.", "author": "Serene T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-28", "description": "Came here with a group of friends who were visiting the city - it seems that Grimaldi's is on the top of many tourist lists for cool places to go eat outside of Manhattan, so.. here we went!\n\nFor a group of 12, on a Sunday night starting at 4:30 pm\n-Our wait was 1.5 hours \n- For 3 large pizzas, an additional 30 min. But, we had conversations going, so it didn't matter too much.\n\nPro's:\n- The mozarella here IS good, I'll give it that.\n- Pizza has a nice thin, yummy crust. Minimal amount of tomato sauce (which I prefer). And it isn't too greasy, which was great.\n- The guys serving us were very attentive and easy going. Good.\n- We were surprised to see that, despite that long wait, the inside seating area of Grimaldi's wasn't actually 'packed' at all, like many other popular joints we've been to. I sort of admire the fact that they don't stuff so many tables into the restaurant to get as many people seated as possible. And, if anything, it made the eating environment less noisy, more enjoyable.\n\nCon's:\n- The wait. -- I would give this place 4 stars, but, I would probably never go to this place again because of the wait. But, I AM glad that I have at least tried it and can say that I've been here.\n- Again about the wait - the lines for eating in vs. take out are the SAME. \n\nRemember, CASH only!", "author": "Julie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-13", "description": "Over rated. After seeing so many reviews decided to go and check it out. The pizza was extremely soggy and tasteless. The server came over and made it look like if it was my fault for adding ricotta cheese and mushrooms to it. Worse pizza experience ever. I will never come back", "author": "Ricardo G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-16", "description": "Waited (wasted) 45 minutes (outrageous!) to eat here after hearing all the hype. Pizza was bland, tasted like cardboard. How could pizza taste so...tasteless? Cannot believe this place is consistently rated one of NYC's best pizzarias. They must be living off of their reputation. Maybe they were good years ago, no more. I'm guessing that this place is featured prominently in a NYC Frommers or Fodors travel guide, attracting lemming tourists who don't know any better. That's what it seemed like as no real New Yorker would eat here. Sooo many better pizza places: Totonnos in Coney Island, Luzzo's on 1st Ave in Manhattan, Il Posto not too far away, Oregano in Williamsburg, to name just a few. Try ANY of these places instead of this joke.", "author": "Rich D."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}