{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-20", "description": "Since it was such a nice day, I figure I would take the advice of others and go grab a pizza from Grimaldi's and experience the walk across the Brooklyn Bridge afterwards. As already noted there was a long line outside the place, and you have to wait in it, even if you were ordering take out. I think as others stated, the best way to enjoy the pizza is to order it to go, and walk over to the pier next to it, and take in the lovely view. \n\nAs for as the pizza goes, its was just okay in my opinion. I have to give them credit for the fresh light taste of the pizza it wasn't rich. So it was easy on the stomach. The pepperoni is def the way to go. But at the same time, it was lil too bland. I think its a nice spot to hit up in you are in the area, but I don't think its worth a special trip or the long line. I kinda feel like \"Been There Done That\" afterwards, meaning I would be okay if I never went again.", "author": "Falayn F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-03", "description": "If the line wasn't a 45 minute wait it gets the full 5.  Pizza is different for different people.  For me - this is nearly pizza perfection.  Thin, slightly charred crust, sweet, tangy red sauce, stringy fresh cheese.  The half pepperoni was top notch, not greasy but spicy with a crisp!\n\nIt is pizza love!", "author": "Rob V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-29", "description": "Pizza was good but unfortunately a decent portion of it was burnt.  More importantly, the service here was substandard.  We got there about 25 minutes before they opened but no one told us that we should wait in line, and when we came back a couple minutes before they opened, there were at least 50 people waiting in line in front of us.  Also, when we asked for water, it never came until we reminded them, and then our glasses weren't refilled for a very long time and not until we asked.  Finally, we never got our change -- we didn't really want any change since it amounted to a standard 15-20% tip but they should at least ask us and not just assume that they get to keep the change.", "author": "Dinesh M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-15", "description": "Famous pizza. Worth venturing out of Manhattan to try it. Plus, it was nice because my parents got to see the Brooklyn Bridge and take pictures.\n\nBottom line, delicious delicious NY style pizza.. I wish they delivered to California :T", "author": "Christina C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-12", "description": "Finally tried Grimaldi's and I gotta say -- what a tourist trap! I was prepared for the long wait and made a lazy Sunday out of it; got there around 2:30pm and had to wait around half an hour for two people -- not terrible. But the pizza was the most mediocre pizza I've had -- the crust was nice and thin but the pizza itself was actually bland and unflavorful. I've never had to add salt to a pizza before but I had to here and even then it was barely salvaged. I don't know how this place has managed to retain its popularity, but I guess with the constant throng of tourists it can survive off people just going there once and never coming back. I sure won't be coming back. There is much much better pizza to be had in New York.", "author": "Fawn M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-01", "description": "The line grows quickly, but we called in and the pizza was ready when we arrived.\n\nThe crust has a nice char and chew.  It's an excellent example of the style, though it doesn't break any new ground and I've certainly had better.  The toppings were great.  Fresh mozzarella, spicy pepperoni, salty anchovies, the toppings were on the money.\n\nGlad I tried it.  Don't think I'll do it again just because I'm in NY only once a year, but it's good.", "author": "Onur U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-26", "description": "Pizza is delicious but not worth the wait.", "author": "Vicky L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-05", "description": "If you are lucky enough to live in NY, and come whenever there isnt a line, its smooth sailing. This pizza sucks badly when it gets cold, so eat it as quickly as possible! And enjoy!", "author": "Richard B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-18", "description": "We were on vacation and this place was highly recommended by quite a few of the locals, and they were right, this place was absolutely the best by far. Would highly recommend eating here, I will definitely be back the next time a visit New York!", "author": "Marissa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-30", "description": "Do NOT even THINK a bad thing about this place. Blasphemy!\n\nI love this place so much it hurts. Rosario's and Lombardi's are the only ones that can hold a candle to it's perfect brick-oven crisp crust and fresh mozarella cheese \"love\". That's right, I go here to mistake food for love, and I'm not ashamed to say it. \n\nThe view of the Brooklyn and Manhattan Bridges is breathtaking. I got engaged AND married in the same neighborhood. AND I named my cat after this place. \n\nNow, that's love! Not to be missed - totally worth the trek into Brooklyn.", "author": "Sabrina I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-28", "description": "After finding a Geocache this afternoon, C. and I saw a family eating a pizza on the sidewalk. We asked where they'd gotten it, and the fellow said Patsy's -- just up the street. He said there'd be a line, and that if we wanted a table, it'd be about 45 minutes. When we got there and got in line, we looked up at the sign and said, \"Oh, right! Grimaldi's!\" I'd forgotten we were but steps away.\n\nThe line was long, given that it was a beautiful Memorial Day weekend, but we stuck it out. We even decided not to get takeout but to experience the inside. It's awesome. Tight quarters. Loud with conversation. A line for the restroom, too. And amazing pizza that's just shy of Totonno's.\n\nWe got just a small plain pizza with two mineral waters. It came in about 10 minutes. The sauce is fresh and slightly tangy. And the cheese is wonderful. The crust, while excellent, could be a bit more crusty. That said, C. even ate the heels, which means it was good.\n\nCheck out the other patrons and the wall of Frank Sinatra memoribilia. Supposedly, Sinatra considered Grimaldi's the best pizza, and you can't really argue with that.", "author": "Heath R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-27", "description": "Yiss.  Now, when I leave work on Saturday nights and hop over to the B25 bus and see one million people waiting for pizza...that's crazy.  But last night, I was in DUMBO and didn't want to pay Superfine prices for food.  So I called ahead and found out there was no line.  Some friends and I sauntered over, and were sat immediately.  We ordered some pizza, a waiter asked me if the book he found on the ground was mine (Captain Underpants?  REALLY?!), and we ate.  2 Large pizzas and some soda + tip - ten bucks a person.\n\nGood pizza.  But that waiting thing is CRAZY.\n\nAlso, you can call and order to go and have your pizza in 15 minutes.  You show up and just walk in and grab your pizza.  The people in line look at you like you're MAGICAL.  Also they want to kill you.", "author": "Kyle H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-27", "description": "Best Pizza in town! especially with black olives!", "author": "Mike L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-10", "description": "I always see the lines forming down the block every time my husband drives by the bridge. I had to go and check out  what the hype is all about--alas, disappointed! The sausage was ok. The ingredients were fresh and the enticing basil smell cures all hunger growls. However, for 1 hour wait on line? I had better pizza at Di Fara, Nick's Pizza, and even Lombardi's. They use the same method to prepare their pies, all made with fresh quality ingredients. Sorry, guys.. maybe it takes local \" DUMBO\" residents or \"yuppies\" to appreciate and feed into this hyped up pizzeria. The service was extremely slow. And be prepared to wait at least 30 mins for the order.  And bring cash. No credit cards/debit cards. The trip was not a lost cause, we got the ice cream from Brooklyn Ice Cream Factory. It definitely made up for the hyped up pizza.", "author": "Linda W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-20", "description": "A New York institution located just under the Brooklyn Bridge on the Brooklyn side. \n\nOlder Part of Town? Yes\nCrowded?  Yes\nClose in Tables?  Yes\nBottle Drinks Only? Yes\nCash Only?  Yes\nGruff Servers? Yes\nRed Checkered Tablecloths? Yes\nGreat Pizza?  Definitely!!!\n\nAmazing place almost too hard to describe.  A favorite of locals and tourists alike.  Pizza is thin and they sprinkle olive oil on it before cooking. Other than that, you just have to go try it out.\n\nFresh, fresh ingredients no matter which pizza you order.", "author": "John G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-07", "description": "This is good stuff, it's a shame that you have to wait .. oh theres one in gramercy?!?!?  So fk the lines and get it at the limelight!  The mozzarella is fresh, I can probably eat the cheese alone as a meal.  The problem is the wait is so long that you would be happy with papa johns when it finally comes out.  Be prepared to sit down next to people who would probably eat your face off to get in faster.", "author": "Eric W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-19", "description": "Really, really good pizza, but still not convinced it was worth the line. And yes, I'm sure this had nothing to do with my spoiling my appetite with some luscious butter pecan icecream from the adorable place at the end of the boardwalk. \nIt's just - over an hour? Come now, certainly you jest? Yes, the crust is great, and sure the sauce and mozzarella complement each other well...but really? I mean, have you tried Spacca Napoli in Chicago? The pizza may be just a tad pricier, but just as fabulous (if not a tiny bit, dare I say it, better!) and the there's no line in sight. You may wait a while sometimes, but getting a table fast mostly involves only good common sense. Namely, don't arrive at 8 pm on a weekend evening. \nThat's all. I've said my piece (haha, the pun was unintional but amusingly appropriate). Don't hate me.", "author": "Purnima M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-06", "description": "I felt like such a tourist waiting on line, but the pizza  was so worth it.  Service was on par too, very smoothly executed meal.  This is one of those spots you may begin having a weekly ritual at.", "author": "Dan R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-21", "description": "I am a native New Yorker and I make a point of not patronizing bad service.  There are so many great restaurants here that you do not need to tolerate it.  I've never been to here but I've always heard that it was overrated.  I will be in the area next week but after reading so much about the rudeness of the staff I will not be spending my money there.  I don't care how good it is, NYC has so many great pizzerias that I'm sure this one would not make my top 5.", "author": "April B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-31", "description": "I think at this point adding to the 170 or so glowing reviews may be moot, but this place hit the spot for me. I took my brother, a pizza junkie and aficionado, and we enjoyed the mushroom pie. \n\nWhen I used to live nearby, the lines deterred me , but we hit the timing just perfectly at 3 on a Thursday, and were seated right away. This pizza reminded me of New Haven pizza, which may be a crime since this is NY, but the most famous New Haven pizzeria, Pepe's, has a similar coal-fired oven. \n\nThe difference here is ingredients. Grimaldi's uses a fresh-tasting, slightly chunky sauce (which, if it is canned, I'm fooled), silky fresh mozzarella, and other fresh veggies and spices. The pizza comes sprinkled with a few basil leaves, and a crispy, sometimes charred crust.", "author": "Justin C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}