{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "I FINALLY had Grimaldi's.  Yum!  Def some of the best pizza I've ever had.  I personally prefer Di Fara's, but the pizzas are so different I really think it's like comparing apples to oranges.  Whichever you prefer is just personal taste.  Grim's was delicious though, an amazing thin slice, good ingredients, crispy crust.  \n\nWe called in our order and walked right in to pick it up, didn't have to wait at all, so that aspect is a huge win.  I think I would have been a little disappointed if I'd had to wait in that ridiculous line.", "author": "Sherri M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-14", "description": "Tasty thin-crust pizza, solid ingredients, love the coal-oven char, but I have to say there wasn't anything that knocked me out of my seat.  I definitely enjoyed it and thought it was a good pizza, but shudder to think that it potentially could have been at the expense of hour(s) long waits.\n\nMy friends and I arrived on a Wed about 15 minutes before it opened, was quickly ushered in with only a few parties ahead of us, and were served promptly and quickly.  That's the kind of wait I would put up with for this pizza, but if I saw the line up snaking further down the street?  Probably not.\n\nAlso tried Lombardi's a few days prior to this trip - I like Grimaldi's better, found that the pizza was overall more flavorful, and texture of crust crispier and more pleasant contrast to the toothsome toppings.  However, I was a big fan of the pancetta at Lombardi's, of which there was no comparable topping at Grimaldi's.\n\nMy point of reference, the pizza I hold all pizzas up to? Al Forno in Providence, Rhode Island.  Their grilled pizza is absolutely exquisite and an experience worth making the trip out for.", "author": "Dan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "This is probably my favorite pizza in new york until someone shows me otherwise.\n\nIts got the thin crust on it and the saltiest olives in the game. The long line outside is kind of a downer, but it moves pretty quick. \n\nMy favorite part was the ipod hooked up to the speakers which was DEFINITELY on shuffle. I'm pretty sure I heard \n\nclassic stereotypical italian music\nsome douchebag dance/techno\nmarvin gaye\nthe ramones\nand then some more douchebag dance/techno covering a top 40 song.\n\nIn that exact order.", "author": "Paul Q."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-04", "description": "There are two things that are better at Grimaldi's than expected: the line and the hype.  Line stretches 45 to 75 minutes, while the hype stretches all the way to the other side of the Atlantic (and the Pacific too, and I don't mean the avenues in Brooklyn).\n\nPizza at Grimaldis is OK, but nothing deserving of its \"reputation\".  There are better pizza shops in NY (may I suggest a place called Gruppo, for example).\n\nAlso, Grimaldis is a chain restaurant, just like Applebees, TGI Fridays, and Olive Garden.  With locations as far away as Hoboken, you get to enjoy almost the same quality pizza elsewhere, sans attitude, long wait, and bad service.\n\nBut on occasions when you have a friend visiting NY, who \"has heard\" that Grimaldi's is the best pizza joint in all of NY, and \"must go there\", then you have no choice but to go there.  That is a sure sign that the said restaurant has arrived in the \"Who is who of the average restaurants in NYC\".", "author": "Buratino M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-20", "description": "Yeah yeah, the pizza's good. Not the best, kind of soggy at times. I can't stand the sour russian waiters that walk up and pretty much say \"WHAT YOU WANT\" and grumpily go put your order in. There have been times where I've been sat, seen, and ignored for a good ten minutes. \n\nIf you really want to try it AND enjoy it.. order a pie to go and eat it at the beautiful park nearby.", "author": "Chelle T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-16", "description": "Really good pizza. A little expensive and the service could be a little faster but bottom line is the pizza is worth it.", "author": "Lorena C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-03", "description": "We were seated immediately. Pizza came quickly but don't insist on too much personal space. Tables are on top of each other. Crust was excellent but center of the pizza seemed soggy and kind of watery. I think this was because of the marghrita style. Overall ok pizza. I'm very glad we didn't wait. It's not worth it.\n\nCash only is annoying and they don't serve fountain drinks only bottles.", "author": "Ginny S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-19", "description": "My first meal in Brooklyn couldn't have been more perfect! The pizza is so fresh and the sauce is amazing. I ordered a Margherita style pizza, super simple but equally tasty. Mr. Grimaldli(the owner?) was a bit of a character, he pretend spazzed on a girl in my group, but he was just being cute. I had no idea, I thought he was serious at first.\n\nMy mouth is just watering thinking about it...too bad I'm 2,500 miles away.", "author": "Jamie O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-29", "description": "Ahhhh I love this place! I mean it's crowded as crap, but the pizza is so good you forget the long wait the second you have your first bite. When I start eating it, don't try and talk to me because this pizza turns me into Chris Farley's \"Gap Girl\" character from SNL. \"LAY OFF ME I'M STAAAARVING.\"\n\nGo get some awesome ice cream at the Brooklyn Ice Cream Factory across the way for dessert. (Or you can be like me..I usually get the ice cream first....being a grown up rules!)", "author": "Lizz K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-29", "description": "Not so much.\n\nIf you like Ray's Pizza, you'll think this is the best thing you've ever tasted, and in comparison, it is. What it is not is the best damned pizza in NYC,  the world, or the universe (depending on the scope of your ambitions). \n\nFat, soggy crust. Boring flavor. Tourists around the block. I don't get it. Head to Lucali instead.", "author": "Michele W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-14", "description": "I think there is a calculated reason that Grimaldi's is tucked down under the bridge and is difficult to get to... Its to keep uppity Manhattanites somewhat at bay. And to those aforementioned I say this, \"Please stay away. We dont want you in Brooklyn. You make the line longer and make us suffer your whining about having to be in Brooklyn for longer than 10 minutes... Stay on your side with your $15 drinks and second tier pizza joints.\" \n\nAdmitted, John's can serve up a good pie. Its just not as good as Grimaldi's. Patsy's? forget it, their salad is better then their pizza.\n\nListen, if you dont care about the quality of your pizza, you just want it now, go to Ray's, or better yet, Domino's- they have a guarantee.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-30", "description": "Is one of New York's best pizza, the taste of the Cheese makes it special, but I wouldn't give it five start, since is not NY's BEST.\n\nIs it worth the wait? Maybe one time, however as a tip, try to get there on a weekday afternoon or early evening and you will not have to wait or perhaps will wait for only 15 minutes. \n\nMy prefered choice for NY Best Pizza is Patsy's take out in east harlem (I tried the Patsys in the Upper East and is ok, but not as good at the one in Spanish Harlem), by far my favorite pizza in town. I dare you to go up there and try it.", "author": "Deivo E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-29", "description": "Horrid customer service. If you want take-out, they'll ignore you like the plague. The man out front pretty much cherry-picks customers out of the line with complete disregard for how long people have waited.\n\nAs for the pizza, mediocre.", "author": "Julie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-10", "description": "The wait for a table is approximately 45 minutes. It's good Pizza but is it worth the long wait for pizza? They use fresh vegetables and bake the bread in a really brick oven.", "author": "S S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-18", "description": "I think this place is awesome. The people were really nice this time I was there. Last time I was there a few loud girls in our group got us kicked out.\nBut the pizza is really great.", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-08", "description": "Grimaldi's may not be the best pizza in New York City but its pretty damn good.  The pizzeria is small, cramped, not very fancy and there will undoubtedly be a wait of at least an hour but its definitely worth it at least once.  If you arrive about 20 minutes before opening or around an hour before closing, the wait will be minimal.  \n\nGrimaldi's uses a coal brick oven to bake all the pies with a temperature of about 900 degrees.  The pizzas take about 6 minutes to cook and are prepared with a thin crispy crust that has a charred, smokey flavor the way pizza was meant to be.  \n\nAt Grimaldi's there are no pre defined pizzas, you build your very own with about sixteen different ingredients to choose from.  My favorite combination is the the Sausage and Pepperoni.  The pepperoni is thick and tasty, sausage has a good spice and mozzarella is fresh and creamy.  Enjoy every savory bite! \n\nIf you're heading back to the 212 after stuffing your face with some amazing food, take the Brooklyn Bridge walk path to burn off the calories from that extra slice.  The walk has some awesome views of Manhattan and if you're on a date, there are a lots of nooks and crannys to sneak a few kisses.", "author": "Bassam K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-14", "description": "WAY over-hyped.  The line isn't long because the pizza is so good, but it's long because people THINK the pizza is good.  Everybody stands in line in the hopes that they will experience the best pizza they ever had, but I have to say that my husband makes better pizza than this (granted, he is a very good cook). \n\nFirstly, the place feels like a chain.  Oh, wait...it is a chain!  There's 3 of them!  Secondly,  the pizza wasn't bad but it was mediocre.  It's better than Domino's but it's not the best NY style pizza.  We ordered the margherita pizza.  The crust was the only really good thing, but the rest of the pizza tasted so bland.  Again, my husband's margherita pizza tastes WAY better. \n\nThe service was very good once you actually got in the place - the waiters were like super waiters.  Really fast and attentive!\n\nI'd rather go to a very small pizza place in NY with an old Italian man making the dough as if he has done it all his life.....went to a place like that but just stumbled upon it and don't remember what it was called!", "author": "Deanna K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-25", "description": "There is nothing like it. I'm a NYer and been all over the world and the US. Never had better. My mom's an Italian chef, so I'm not easily impressed. A 30-90 minute line? I said no way, nothing is this good. I was wrong and I apologize. Believe the hype of this place. If you call pizza a pie, you will be changed forever. Go. Don't mind the line. You get that wait at a fucking outback steakhouse, with Cisco frozen shit to show for it at the end. Buy a postcard of the Empire State Building, but get a pizza here.", "author": "Nicholas B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-10", "description": "This place is the real deal!  Great character and location.  I'm usually a slice person but this is the best place to get a whole pie.  The crust is perfect and goes well with the cheese and sauce.  This place is a must see.  Walk the Brooklyn Bridge after.", "author": "John I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-18", "description": "Grimaldi's pizza is probably one of the best I've ever had. The cheese is just amazing and the crust is a perfect blend of thin and crispy yet breadlike and flavorful.  The service is friendly and the atmosphere is low key and excitable. This is an authentic bare bones pizzeria, the interior looks like it hasn't been touched in 30 years. Even the sign outside has had some strange plastic hanging off the awning for the past few years.\nThe only reason I don't eat here all the time is the wait. I went here on Saturday afternoon and waited for an hour and a half. It was a gorgeous day, so it wasn't a problem, and I'd have to say that nothing tasted better than that first sip of beer once we were seated.  The only thing I'd change is that I wish they had some sort of a green salad on the menu to start off with, but I am sure I am one of the few with that request!", "author": "Tricia K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}