{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-30", "description": "Waited 1.5 hours outside -- expected because of how popular this place is. Once seated inside, it took the waiter 15-20 minutes just to take our order. This is after we approached him and he said he'd be by soon. Then it took at least  another 30 minutes to just get our pizza, that was soggy in the middle. The ingredients were fresh, but the pizza was not worth the wait. The waiter was incredibly inattentive (btw, the family that was seated next to us got IMMEDIATE service. wtf. seriously.) and made the experience just terrible for my party. Never going back again, not worth it.", "author": "Yuri K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-01", "description": "Big YUM, good price, homely atmosphere and right at the BK Bridge!! What's not to like?", "author": "Helen D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-23", "description": "I don't see what all the hype is about...the pizza is okay. There are so many other pizza joints out there that are five times better that are underrated. For example, Adrienne's in FiDi, Williamsburg Pizza on Union St., and Roberta's in Bushwick are just a few of the best places to get high quality seasonally creative pizza.  Don't get me wrong, Williamburg pizza has really good pepperoni too.  Carmine's in Brooklyn has some really good veggie options too.", "author": "Anthro Food E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-21", "description": "One word: hype.\n \n- Cash only. ATM was broken and took forever to reset which made me extremely uneasy \n- New location doesn't serve alcohol- possibly due to a pending liquor license?\n- Prices were reasonable, the pizzas came out fairly quick, and it was a solid pizza pie nevertheless, but it still doesn't justify the wait (which sometimes can be over an hour and blocks deep). \n- Worth a try if there is no wait.", "author": "D K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-24", "description": "\"Where Brooklyn at!? Where Brooklyn at!?\" - Notorious BIG.\n\nThat's what I wanted to say to some random person as I walked the streets of NY. I was in search for some good pizza!\n\nYou know the place is a hit if there is a long line outside. Noticed the spot was also hit up by a YELP sticker on the window. Wait wasn't that bad. Fifteen minutes later we were in and ordering our pie.\n\nWent with pepperoni and mushrooms. The cheese was the real deal. Not that shredded weak stuff. The pepperoni could have been bigger. The basil on top was a great touch. \n\nFolded my slices in half and ate them taco style. Good stuff. I am satisfied. This place got me singing \"When the moon hits your eye like a big pizza pie, that's amore!\"\n\n\n\nI am always down for some pizza. This is a good spot to hit up if you are ever in the Brooklyn area.", "author": "Chris P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-09", "description": "I am so glad that I went to Grimaldi's during my visit to NY. Now I can tell people what a real New York pizza is suppose to taste like and really the experience has blown me away. \n\nWhen we arrived at the shop, there was a long line, about six parties ahead of us. As we waited, there was a bald man who called out the party by names. When our name was called, we were missing one person btw who was lost trying to find the place. The douche would not let us in. We tried to explain to him that she was on her way and even if she doesn't show up, we will still pay for the price in full. Basically, I tried to talk sense to him that one person will not hurt our party but meathead said it was not his problem and denied us. We eventually had to reduce the number of party so we can be seated and when my friend arrived after we ordered we grabbed another chair and set her in. Our solution to our problem would have been that simple! \n\nBesides the poor service, the pizza experience made up our bad mood. After you order your dish, you can watch the guys make your pizza. I noticed that they use rectangular sliced mozzarella and fill in on the pie. Any areas untouched are covered with tomato paste And then, they lay over the toppings and finish off with a splash of oil and basils on the center. The pizza goes in the coal over for about 5-10 minutes and viola, ready to be served. The pie is in the furnace long enough not be over or undercooked. \n\nI hear this place competes with Lombardi's in the city but I do not know which one tastes better. Next time I am in York again, I shall try Lombardi's.", "author": "Paul L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "It is quite good but head next door to Julianna's for the real P.Grimaldi.\nJulianna's wins that pizza rivalry.", "author": "Jon D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-09", "description": "Delicious!  The sauce and ricotta cheese is the best!  When we got there, there were about 20 people in line in front of us.  We stood there, debating whether or not we should leave, but the line seemed to be moving at a decent rate.  We ended up waiting for about 25 minutes.  \n\nThe inside is nothing fancy- very basic, but cozy.  The room is literally packed with tables, not much room to move around.  Be prepared to have people accidently pushing their chairs into the back of your chair!  But the bottom line is that people go there for the great pizza!  The service is very efficient and the staff is friendly.  I highly recommend going here if you are with a few friends and are willing to wait a bit for some really tasty pizza!", "author": "danielle n."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-16", "description": "Best pizza I've had in years! \nA friend and I ordered a small pizza with sausage and mushrooms. We were surprised to see fresh mozzarella and basil on this smoking hot pizza pie ;)  I said \" Holy cow, this sucker looks good! \" Then I bit into it and realized it tasted better than it looked. Not to mention, the atmosphere is cozy and definitely enjoyable. You step outside, look to the right and you get a great view of Manhattan.\n5 STARS for Grimaldi's all the way!\n\nNote : Don't come to Grimaldi's with a small appetite and a credit card. They only take CASH and the pizza's are not sold in slices.", "author": "Cassy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "So I finally got to taste this pizza and it was well worth the wait (which I confess was a bit long).  But I would do it again.  Pizza done to perfect with succulent pepperoni.  I will be back for sure.  Again and Again and Again... Loved it.", "author": "Roger W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-16", "description": "if you're visiting NY you def have to get a pizza from this place, very fresh and tasteful pizza. The waiting on line to get seated sucks but once you're in the service is pretty quick", "author": "Carlos M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-29", "description": "great pizza ,weird russian people running the joint.  last time i was here it was very difficult to get a waiter's attention, and they had apparently lost their liquor license, and the manager got in a fight with the busboy for dropping a tray of silverware.  Yes tis the same people hwo always ran Grimaldi's but their antics are less acceptable in the new space.", "author": "Brian F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-28", "description": "Just a regular pizza... Nothing special, overrated and overpriced ... Heard lots of great staff about this pizzeria , decided to try by myself- wasn't satisfied at all... Maybe it is just not my type of pizza...", "author": "Iryna T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-20", "description": "The best!  Coal ovens!  Brooklyn! What else is there to say?  Well I will say it I guess.  I love the new location!!!  So much more seating but to be honest It wouldn't matter if this place was in a dungeon because I would still want to eat this delicious amazing unique Brooklyn Pizza.", "author": "Leslie J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-30", "description": "Wow!!  Talk about great tasting pizza not to filling but just right in flavor spice the most fabulist aromas of tomatoes, garlic, basil, arugula, and mush more toppings to choses from.  Love the atmosphere and hospitality of the place although it's not a very big of a place and indeed there is a wait time depending on the day of the week you go.  It still a must go an experience endeavor.   So for an Italian orgasmic taste in spice and aromas I do recommend this wonderful trendy place to be explored on your next visit to Brooklyn.", "author": "Angel H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-12", "description": "This is an honest review! I have had MANY pizza styles, a lot! And I'll touch the entire experience in this review\n\nIMPORTANT: SC means surcharge, it doesn't matter if it's a party of 2 or 7 they put in the tip. Don't be confused!\n\nLocation: AMAZING. There is nothing more romantic without getting too awkward or just hanging out. It's perfect either or!\n\nWait: The usual suspects for good places: very long. We waited 45 minutes on a Monday night, I can just imagine the weekend. Larger parties especially. Have someone stand on line and then try and find parking. Try.\n\nSeating/ table: Very tight, nice setting. \n\nWait staff:  The taller bald guy seating us was honestly their best host, he did a great job constantly acknowledging that we'd been waiting and \"he'll seat us soon\". When we had questions about our check he answered them, best person there.\nThe actual waiter??? He was rude, didn't acknowledge that we were there. We waited about 15-20 minutes for someone to even come to our table and that's after we asked if we'd get a waiter. Then we saw him 3 times, when he took the order, brought our drinks and to explain the check again to us. Someone else delivered our pizza \u0026 brought the original check. Even the runners were annoyed at life. I honestly didn't like the staff.\n\nFood: And so it begins! Where to start. Hands down one of the best pizzas I've ever had, especially for the price. Not too shabby! We ordered a meat lovers kinds pie and it was well cooked, not over, not under. The sauce was VERY good, cheese didn't make me sick. Everything tastes fresh! Even had some to go. The pizza is amazing, perhaps, for now the best pizza in DUMBO!\n\nBathrooms: Horror show. I don't want to think about what the kitchen will look like. Paper flowing out of the garbage can. Toilet was nasty.... let's just say it was gross.\n\nAll in all: Maybe I'm too picky, maybe I think the service should be as good as the food, but taking into account everything else, the scenery, the food and again the staff the place was ok. The staff sucked, the bathrooms were filthy with paper over flowing the garbage and absolutely no one, no one checked on our table, ever and because of that it doesn't matter how good the pizza is the question is would we return? Not by my choice, if some friends said they wanted to go and there was nothing else, sure.", "author": "Cee M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-30", "description": "The best pizza in town!!  So much flavor!\nThere's a bit of a line and dont accept credit cards, but definitely worth the wait.  They have ATM inside.  Highly recommend to any pizza lover!!", "author": "Karina R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-10", "description": "Came here while visiting New York when the SF Giants were in town. My sister and I waited for about half an hour for our table. Our waiter was nice and told us a little bit about Grimaldi's before taking our drink orders. We ordered a large pizza with pepperoni, Italian sausage, and mushrooms. The two foreigners sitting to our left had a complaint about their uncooked sausage in their pizza, but the waiter just took it out of their fork and probably tossed it out. No complimentary drinks or meal? What's up with that? The waiter didn't even have the nerve to apologize. Is this how you treat your customers? Overall, our pizza was good but the way the waiter handled the foreigners was unacceptable. Either apologize for your mistake or comp a drink or the whole meal. Avoidance no problems never lead to future returns.", "author": "Edgar G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-16", "description": "This pizza is OK but I would not walk across the Brooklyn Bridge on a super hot day for this pizza ever again. Also, the health department rating is a well-deserved \"B.\". My plate was a little dirty and the salt shaker looked like it had been dropped in the middle of someone's pizza slice. I really didn't feel comfortable asking for a clean plate, a clean salt shaker or even a refill on my water. My fiancé asked for a Diet Coke and was brought a Coke. You could tell the guy serving us didn't like having to go fetch a different beverage when my fiancé (nicely) pointed out the error.\n\nThis place isn't worth the hassle.", "author": "Allyson P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-10", "description": "Stellar pizzas. The crusts is crisp, chewy and slightly salty. Topped with creamy, fresh mozz and a simple tomato puree. Delicious! with just enough blisters in the crust to set it apart from your run of the mill pizzas. Complete with drinks for 3 it was possibly the least expensive meal we had in recent memory.\n\nIf only the service was at least decent I would've rated this restaurant higher. \nOur waiter completely forgot about our drinks and never once tended to us after the initial order. \n\nSo, approach and feast. Just expect subpar service. At least, if you end up with our waiter.", "author": "Mary Y."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}