{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-20", "description": "A good day out with a special friend. Perfect place for casual date.", "author": "Sally N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-30", "description": "My roommate and I stood in 45 minute lines to get into Grimaldi's-- repeatedly-- just for our monthly pie.  Great pizza, but eat it while it's hot.  Once it cools down, it's not half as good.  Paired with a carafe of house wine, you will feel like you are back in old Brooklyn.  The decor wouldn't disprove it either.  The red-checkered table clothes, somewhat gruff service, and graying photos of dead celebrities are all part of the Grimaldi's experience.  No, maybe it isn't the best pizza in the entire world, but it's pretty good, and worth the trip across the bridge.", "author": "Alison M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-29", "description": "I wasn't blown away.  I've eatin at better places.  I would have hoped to have had a way better tasting pizza after that long wait, but it wasn't.   I did enjoy the decor and the welcoming feeling.", "author": "Jorge B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-26", "description": "mmm :) i was impressed. \n\nat first i was skeptical of the hype.. another tourist attraction. after waiting exactly an hour outside on a Sunday night, we got seated next to three other couples. we ordered a small pie with pepperoni and sausage. the fresh mozzarella that it comes with was amaazing. you could just tell this wasn't just your ordinary pizza.\n\ni probably wont be making the trek here that often but its not a bad place to go with a small group of friends (2-4) that you want to catch up with... and hey its getting nicer out so maybe next time i'll be up for waiting on the equally as long line at the brooklyn ice cream factory after dinner.\n\np.s. i must've not read my yelp reviews thoroughly enough before but i learned while i was there that apparently there are multiple grimaldi's locations! theres a new one in douglaston plaza in queens, and one in glen cove for those of you who are from the queens/long island area :) both of which are more family friendly locations to bring my family. will update again after getting their reviews.", "author": "Jovita K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-26", "description": "the line was REALLY LONG, but honestly the wait wasn't as bad as it looked. it helps to go with friends so you chat while you wait. \n\nthe pizza was great, but not AMAZING. i like thin crust pizza, but it gets cold quickly, esp since we were sitting under the AC. We split 3 16\" pizzas between 5 ppl and we were all stuffed at the end. it came out to about $13/per person. I thought it'd be more expensive, so i consider this a good deal.\n\nbecause of the line, i dont think i'll be back unless i have friends from out of town.", "author": "Flo T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-28", "description": "yikes, so many reviews!  here it is short and sweet:  There was a short line because i came at an off time (weekday and at 3 pm).  We waited in line 15 minutes for a table of 3 so I thought it was great!  *** If I had to wait longer than 15 minutes I would have been disappointed and really really hungry by the time we got our food ***", "author": "Alyssa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-10", "description": "This was my first NY pizza dining experience upon moving here and it did not disappoint.  We ordered 3 pizzas for the table and they were all delectable.  \n\nWe did have to wait for about an hour outside in the cold before getting in, but that's just a testament to how good the pizza is.", "author": "Blair H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-31", "description": "I came here last year.  There is a line outside waiting to get a table...not too long of a wait tho.  There was a decent size dining room and it was packed!  The pizza was pretty good, probably won't come back here again tho....I'd rather search for a better NY pizza:) I know it's out there:) Oh, and there's a real good ice cream place down the street, and right in front is a great place to take pictures of the NYC skyline and brooklyn bridge.", "author": "Maria L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-02", "description": "Grimaldi's is a religious experience! Your taste buds will be singing--Allelujah!! When you're in NY, stop by their place and it will be worth the trip. Don't be discouraged by the loooooong line, I promise you their ridiculously crispy-thin crust, that ooh-so-good sauce and whatever-you-top-it pizzas will make it WORTH your precious time. The downside: They don't take credit cards, CASH ONLY! and no reservations--that's why I give it 4 stars. Otherwise, Grimaldi's is absolutely fantastic !", "author": "Tricia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-26", "description": "After walking across the Brooklyn Bridge from Manhattan, my friend and I waited in line for almost an hour before we were seated at Grimaldi's on a Sunday afternoon. While waiting in line, I did notice that the take-out line and the dining line are now one and the same. This was clearly stated at the entrance of the restaurant. I have to say the thin-crust pizza remains one of my favorites in NYC. However, I was put off by the service charge that was inserted into our bill. A review on another website said that the \"service charge\" was inserted because the diners looked like \"foreigners\". The simple one-page menu did not state that a service charge would be levied for 2 people dining at the restaurant. Has anyone else have had service charge levied on their final bill? \n\nBecause of the wait and the service charge inserted, I am giving this a 3-star.", "author": "Dawn M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-11", "description": "Grimaldi's isn't all hype...they back it up with a mean brick-oven charred slice. Fresh mozzarella, tangy fresh tomato and your fav toppings make it worth the trip. But for God's sake, take the PATH and hit the one in Hoboken. With the wait in Brooklyn, you can travel, eat and see the Lion King all before you're likely to make it into the door on a weekend!", "author": "Gregg B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-24", "description": "This place was already poppin' by 1:30pm so I am grateful that my party and I arrived early enough to avoid the ridiculous line outside. This pizza was exactly what I pictured New York pizza to be, thin crust and so delicious! We had the white pizza, and then a veggie pizza with roasted red peppers which were sweet and tasty and complimented the sauce really well. I also enjoyed the fact that while dining on my delectable pizza I was able to feast my eyes on photos of various celebrities that also enjoy this fine eatery. I must say, Grimaldi's was the perfect way to wrap up my NY vacay.", "author": "reina t."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-18", "description": "After a long morning walk around financial district to memorial park to across bk bridge, their thin crust hit the spot.", "author": "Derricho S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-18", "description": "Love the pizza, its a great thin slice, I could bang down 2 pies. But no food anywhere is worth the wait of that line. I suggest calling in a pick up", "author": "Salvatore H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-12", "description": "Really good. Really. Worth a detour if you're visiting Manhattan. I think that means Michelin 2*. But you gotta like thin crust pizza done in the Italian style (i.e. not the huge mounds of ingredients of \"modern\" pizza factories)", "author": "Bruce C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-29", "description": "I don't think this place needs anymore reviews but I feel like giving one anyhow. I'd like to start off by saying it is really really good pizza. The cheese is delicious! the place is small and quite crowded. I went during a weekday maybe like around 2pmish and I was able to find seating right next to Vince Vaughn's picture. Good luck finding room on any other given time. Back to the point, the pizza here is like no other (or I could just be thinking that since I am from California), but seriously its worth the trip. TRy it!", "author": "Sharon V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-23", "description": "Best pizza I've ever had in my entire life.  No joke.  Thought there was a bunch of hype and that it might be a bit touristy, but I was wrong, and I hate admitting that I'm wrong.  Great idea to stuff yourself with pizza and then walk over the Brooklyn Bridge back into Manhattan.  You have to get the Brooklyn Lager which pairs well with the massive pizza that you don't think you'll finish, but you do.  You just cannot stop eating it.  Basic pizza with fresh mozzarella, tomato sauce and basil $12-14, additional toppings $2-$4 each.  AMAZING.  Also, super friendly and charming owner.  What a delight!!", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-09", "description": "Grimaldi's.  It's an institution.  And that's the problem.\n\nI would like to start out by saying that I have eaten divine pizza at this bare-bones beer and pizza joint.  But I ate that pizza at an odd time, before it really got busy.  If you are interested in eating here at a regular time, say 8-10 pm, Wed through Sat, good luck.  Last time I tried to eat here, there was a line about 100 people long (no joke) and they were all from the tourist buses that were parked down the street.  I waited 15 minutes, moved about 5 feet in line, and then quickly left to get to Sam's before that closed.  Sam's is great by the way.  \n\nThe problem with Grimaldi's is not just the wait; it's that when there is a wait, you can be assured that you will be hustled in, hustled out, and that your pizza will be undercooked.  This has happened to me on more than one occasion, and is the real reason I give such a low rating for this institution.  Let's face it, NYers are used to long waits, but a long wait conbined with terrible food is just not a good idea.  Go to Sam's instead.  \n\nOh yeah, and the door guy's terrible attitude that night didn't help either.", "author": "Adam N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-29", "description": "We came here on Saturday at 4 pm thinking we would beat the dinner crowd but were clearly wrong. The wait was an hour and 20 minutes. The 3 of us ordered two large pies (1 plain and one with half mushrooms and half sun dried tomatoes). The sun dried tomatoes were a hit as was the plain pizza. We left 2 slices of the mushroom pie even though we weren't filled up. Their tartufo is incredible. It was better than some that I had in Italy! In my opinion Grimaldi's is only worth an hour plus wait for a one time experience. I would never wait that long again but I had to do it once to see what all the hype was about.", "author": "Chrissy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-16", "description": "We arrived at 12 PM. We arrived partially hungry and with enough to do to kill the time. Shockingly, we were seated in under an hour. By this time, I was not hypoglycemic but I was at the peak level of hunger about thirty minutes before hypoglycemia. In other words, the ideal level of hunger. We were seated at a table for ten, except the eight other seats were occupied and by strangers, all of whom preceded us on line. Holy. Deliciousness. Almost in a pleasant contrast to Di Fara's, this lack of a uniform distribution of cheese sauce was kind of fun actually. In fact, the whole crowded and rushed experience is the opposite of the calm and relaxing experience at Di Fara's. Thin and crispy but not burnt. Perfect crust. As perfect a pizza as there is. I demolished my half of the large pizza in just a few minutes. We did everything short of licking the pizza pan clean. And our neighbors' pizza pan clean. We debated a second pizza. Any time you debate a second pizza in one sitting, that's the highest of compliments. Grimaldi's should be on any list involving Things to Do, New York, Pizza, or all of the above. In fact, I'd even consider it on a list of baby names.", "author": "Jeff M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}