{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-19", "description": "The trick here is to call in as you're walking across the Brooklyn Bridge and place your order. By the time you get there, the pizzas will be ready. Just avoid eye contact with the hundreds of people waiting in line (they've probably been waiting for a good hour already), walk into the restaurant, pay, and pick up your pizzas!\n\nA group of at least 10 of us took our pizzas to the benches in front of the Brooklyn Ice Cream store down the street, and enjoyed our pizzas under the sun. Perfect Saturday afternoon!\n\nI've traveled to Naples to try their famous brick oven, thin crust margarita pizzas, and I have to say that Grimaldi's is probably tastier. The mozzarella is chewy, the dough is baked perfectly, just the right amount of tomato sauce... The best pizza I've ever had!", "author": "Carolyn W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-10", "description": "We had a table for 10 which was probably the dumbest thing you can do in New York, but we surprisingly waited less than an hour.  Maybe because we showed up for dinner around 5pm, so by the time we sat down, ordered, and got our food it was about 6:30pm. \n\nTheir pizza is light and crispy.  We walked over to the ice cream factory down the street and enjoyed the view of the Brooklyn Bridge and the river.  I haven't had a chance to try Lombardi's yet, but this was definitely my favorite pizza in NY.", "author": "Esther W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-11", "description": "Grimaldi's defines what New York pizza is all about...hands down! \n\nWhen you arrive at Grimaldi's make sure you have a few things. Cash, Plenty of free time, and a big appetite! They only accept cash so make sure you take some out before you get there...but don't fret in case you forget because they have an ATM and there's another one next door. You also need to make sure you have time to spend there because no matter what time of the day you go, there is a line that stretches outside the door...for quite a distance I might add. You might ask yourself \"Why are all these people subjecting themselves to waiting on this really long line?\"...the answer in short...it's worth it! Last but not least...make sure you have a big appetite, or at least a few friends with you, because they don't sell pizza by the slice...they sell the whole pie. \n\nAll of their pizza's are hand crafted masterpieces! All the toppings are fresh and the mozzerella cheese is thickly sliced and applied lovingly to your pie instead of having shredded cheese just thrown on your pizza. \n\nGrimaldi's is one of those pizza places that you simply MUST try in your lifetime! I don't even know why you're still reading this...GO ALREADY!!", "author": "Jacob C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-26", "description": "Top quality pizza. No wait line for me (Sunday noon time). Impressive restaurant decoration. Nonetheless, no alcohol available when I visited. And the service is not great.", "author": "John S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-18", "description": "It was okkkkkkk. Certainly didn't live up to the hype of life surrounding it (though I'm aware that it's an NYC institution). \n\nI've been twice (one time in the middle of the snowstorm of LIFE so I was tearing into it off the strength of being hungry LOL) and on both occasions, I still felt like there was more to be desired...\n\nFor those contemplating standing in line (suckasss): DON'T! Just call ahead of time, place your order, stroll in and move on with the rest of your day! You also have the dine in option but the ambiance is nothing special. \n\nWith these things in mind, come here if you HAPPEN to already be in the area and want to take some slices over to the Brooklyn Bridge Park to pass the day on a sunny afternoon or check out the Dumbo architecture, etc.", "author": "Sharifa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "This was a must go place in NY - and so we followed advise. Glad it was worth the hype. The pizzas were out of the world - thin crust, fresh and so crispy. We completely loved the pizza and would love to come here anytime we visit NY in future.", "author": "Varun V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-01", "description": "I am in brooklyn almost every weekend and my friend came into town from Oregon. A bunch of friends and I went to Grimaldis and waited on line for atleast 45 mins to an hour... but boy was it worth it. the pizza was great here and the customer services is awesome too. You are treated like family and in a good way. I came back here with just my gf and it was prob 95 degrees outside hot and we didnt eat anything all day. they brought out ice cold water for everyone which was great.\n\ngreat place try it if you never have and the pizza is awesome.", "author": "Vinh L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-05", "description": "Very short wait in line to get in and served very promptly and it was a Friday evening. Pizza was very good, classic Brooklyn brick oven. Had an antipasto and large white with regatta cheese and whole tomatoes and two sodas for less than $40. After we ate we took a nice walk along the river in the Brooklyn Bridge park which is only a block away. Worth the trip.", "author": "Patrick M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-16", "description": "Went on a Sunday afternoon.  Beautiful white building.  Tourists EVERYWHERE.  I felt like I was near Times Square.  I don't mind tourists at all, but just didn't expect that.  Don't be a snob and go into the restaurant first to see if you put your name down, just get in line.  The tourists seem to know that.  The wait wasn't painful for 4 people as it was ~45 minutes.  \n\nAnyways, the pizza is solid and it's affordable ($ large plain is $14).  Nothing extra special about it, but it's a standout because it's made with great balance of crust, sauce and cheese.  I like it plain.   Perfect for a gluten glut.  \n\nThere are other places like Arturo's, Artichoke, Motorino, Luzzo's, Grimaldi's Pizza etc. etc. in Manhattan that do a good pie so I don't know if Grimaldi's is best pound for pound for someone who lives in Manhattan.  But it's a place everyone should go, just to experience Grimaldi's and taste the long lasting history.  \n\nAlso, take a stroll down to the pier, great view of Manhattan.", "author": "Patrick M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-21", "description": "I have to be honest I do not get the super hype of this place. Yes we all love a great crispy thin crust- but there are so many other great places in nyc.", "author": "Liza H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-19", "description": "I came here on a Thursday around 5:30 and was so happy to see there wasn't a line. Me and my friends were seated in 10 minutes and our server was fast too. By the time we left at around 6 the line was down the block.\n\nBut the pizza was just...not good. Unimpressive. I'm glad I didn't have to wait outside in the heat for it because that might have made the let down even worse (though they have a cooler full of water outside for people on line, I thought that was nice). \n\nThe pizza is cooked very well, its thin and crispy. But the crust tasted weird, as does the sauce, and the cheese. I wish I had something more useful to say than \"weird\". Maybe its on the sour and bitter side? It didn't help that they don't offer oregano on any of the tables, but they do put out garlic salt, red pepper flakes, and black pepper. Weird, and it really could have used that extra flavor. The slices get worse as they get colder, which they do kinda quickly. The bland cheese gets somewhat chewy and rubbery.\n\nThey have tortoni, which I got exited about because I never see it anywhere anymore, but it was only alright and slightly freezer burned. \n\nOne of my friends thought it was good though, she said it was a nice change of pace from a traditional pie. But I think I like traditional pies best. I'm not sure what \"kind\" of pizza this is, but I don't think its for me, at least not from here.", "author": "Luci B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-28", "description": "We ordered to go and waited for over half an hour. The lines outside to get in are long too. The pizza was good but I wouldn't say its the best in the world. If the wait wasn't so long I would be happier. Also very pricey and CASH ONLY.", "author": "Tatyana N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-22", "description": "We came in after our trek across the Brooklyn bridge. We were so hungry and had read so many reviews about how we must try a pie at either Juliana's or Grimaldi's. Well, Grimaldi's won our business simply because they came up first on our path. It was crowded inside. We were greeted by a very friendly older gentleman who sat us promptly. Please keep in mind that this place is CASH ONLY and offers NO SLICES, so bring your money and your appetite. We ordered a small (huge) pizza that comes with 6 slices. The base of all their pizza has cheese, basil and tomato. We added mushroom, garlic and black olives for an upcharge. Honestly, if we ever go back, I'll just get the pizza as it comes without any extras. I ended up taking off the olives. Less is more here. The pizza was amazing. It must be the sauce. We asked for the grated Parmesan shaker because I douse all my pizza in cheese. Perfection.", "author": "Natacha I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "Delicious thin crust pizzas that you can customize to your liking! They do not take credit cards so bring cash! The wait is usually 20-30 min minimum but I would say it is worth the wait! Good for a group of people as well. The waiters are very nice and helpful.", "author": "Julie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-17", "description": "Not that this place needs another review, so I'll just say that this is the best pizza I've ever had and I don't even eat sausage....I was wowed!!!", "author": "Demetria M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-22", "description": "Right under the bridge! Line out the door, but we (3) were seated within 20 minutes. Pizza was fantastic and very reasonably priced.", "author": "Keith T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-15", "description": "My boyfriend and i got lucky the day we decided to try Grimaldi's. There was no line and we found parking like right in front. It was a spur of the moment thing as we passed by and i saw there was no line.\n\nWe ordered a reg plain pizza. The pizza was good. Brick oven usually is. It was made quickly with fresh ingredients and i always love fresh mozzarella :) Sauce was good and overall the pizza was good.\n\nInside the place was nothing special. just some tables, maybe a little wood feel and a blasting hot brick oven in the middle. It's cool that you can watch them prepare the pizza. Staff was ok, nothing great.\n\nI'm glad i got to experience the pizza without the wait. I think i would've thought way less if this place if i had to wait on line for an hr+ just to taste pizza that was \"good.\" HOWEVER, as a tourist who hasn't experienced NY pizza, it would be really good :)", "author": "Melissa N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-22", "description": "I'm a huge bread lover and the crust on this pizza definitely gets my vote (it was thicker than a thin crust but not anywhere near a chicago style pizza). My friend and I dined around 11:30 for an early lunch and luckily, there was no line! We were seated immediately and ordered the white pizza with sausage. I wasn't a fan of the thick mozzarella cheese, but the presentation  was great! The tables aren't \"swept\" up, so there are some people's leftovers..but oh wells! It's part of the ambiance right?\n\nGreat homey feel... can't wait to try more!\n\nUnfortunately or FORTUNATELY, you can't buy JUST slices of pizza...has to be the WHOLE shibang!", "author": "Emily C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-12", "description": "Omg! The line is so long, waited for 45 minutes. We got some yogurt while we were waiting in line. We were starving after walking the Brooklyn bridge and there was 2000+ reviews so we must try this. We ordered the sausage and pepperoni with white sauce. Our pizza  came out in approx. 20 minutes. I mean the pizza tastes okay. I don't think there was anything special to it, I prefer artichoke better. The thing I don't like is that they charged tax and they only accept cash.", "author": "Carmen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-26", "description": "Execellent fresh ingredient pizza. Poor service. Decent prices.\n\nI won't say it is the best because I have had better but this pizza is different than most because it's made to order. Most things made to order taste better. \n\nThe cheese is real mozzarella, not the weak shit that normally is spread onto pizza nowadays. Also they put the cheese first then the sauce- nice twist. Nice crispy crust and thin body. \n\nMy honey enjoyed it thoroughly and so did I. I would come back. Thankfully we had no waiting time.\n\nThe only downside is you can only order a pie, not a slice. So bring a buddy with you.\n\nCash only.", "author": "Tiffany S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}