{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2005-12-28", "description": "Not as great as it used to be, not as great as Totonno's, but a terrific location, open til 10:30, and great to have \"real\" pizza right across the bridge.", "author": "John H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-05", "description": "Yummy pizza! not to much of anything, everything was perfect. Not greasy. although the line there on saturday was about an hour and a half long wait. Well worth trying.", "author": "Bunny L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-10", "description": "This place was not at all worth it. We waited on line for a table for over an hour and were seated by the meanest, most impatient man who made our entire experience really terrible. He actually yelled at us multiple times for no reason. The pizza was good--but that's the great thing about New York--we actually have good pizza at lots of places. And I can tell you at most other places the host doesn't make patrons feel like crap. This place is totally skipable.", "author": "Hannah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-15", "description": "This is probably one of my top favorite pizza restaurants to pig out in. The location couldn't be any better as well, located right under the Brooklyn Bridge with a one block walk to the pier provides a wonderful view of the city. On hot summer days you can almost expect the line to stretch down the block and for me the line is most definitely worth the wait. The inside of the restaurant has a rustic Italian look to it, from the red and white checkered table clothes to all of the pictures on the wall. The photos contain some of today's top celebrities that have dined at grimaldi's like jay-Z, Beyonce, Vince Vaugh, and and that funny guy from blue's clues. The menu is rather small but the ingredients and pizza is made fresh in a coal brick oven. The dessert are very limited but the canoles and tortoni's are a must eat. The one thing that I considered a down side to this food spot is the lack of space. For the most part you'll be seated next to a complete stranger with no room at all. You're pretty much sitting elbow to elbow and also at times you're rushed to leave since the line at times can be overwhelming. For the most part this doesn't bother me since I know it will be worth that delicious pizza in the end.", "author": "jose c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2005-12-12", "description": "I honestly do not understand how anyone can not love this place, unless they don't like real pizza. Pizza is supposed to have an extremely thin crust, and a sauce which is actually made of crushed tomatoes instead of tomato paste. The crust, fresh mozzarella, crushed tomatoes and fresh basil are all outstanding, and they come together perfectly in the 800 degree coal burning oven. If you only want to eat bread with tomato paste and supermarket cheese, then you may not enjoy it here. But come with an open mind, and you'll learn what real pizza is; a VERY tasty lesson indeed!", "author": "Steve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-30", "description": "The line is usually really long but I can't complain. The pizza is really good. You have to ask for the crust extra crispy. Otherwise, it can be a little undercooked, especially if they are busy.", "author": "The L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-01", "description": "The lines tend to be very long. I used to call in my order and get it to go, but I don't think they offer this anymore, so even if you want takeout you have to wait on the long lines. The pizza is very good. The waiters can be somewhat rude and the space is cramped.", "author": "Margaret M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-03", "description": "Took forever to get in...but well worth the wait. Amazing staff and great pizza (the best I've ever had I think). Would definitely go back again!", "author": "Federico H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-24", "description": "Love it, love it, love it.  The best pizza in the world.  My wife and I cannot walk into a regular pizza place and order a slice, it's just not the same.  I hated the waits, so I place my order and drive up.  They bring it out to your car.  I always get dirty looks from the huge line, but it's your own fault....", "author": "Arthur B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-19", "description": "Def some of the best pizza I've ever had, thin crust, it melts in your mouth, fresh toppings... but I waited in line for almost 2 hours! I think anything would have tasted good after waiting for so long.  I would love to give it 5 stars but the wait was just too long, and the inside was super cramped.", "author": "Lisa S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-08", "description": "I hate to give this place just one star, since I actually thought the pizza was surprisingly good. It had a nice cheese/sauce/crust ratio and didn't leave us feeling too weighed down afterwards. I even enjoyed the jovial crowded, mom \u0026 pop pizza shop atmosphere (probably because it wasn't too crowded then).  But the real problem was the service, which was absolutely horrendous. We managed to go there on a not-so-busy weekday afternoon (best time to go) so there was no wait. The waiter seemed nice enough at first, but eventually left us at the table waiting for our check for at least 20 minutes after we finished the pie and he cleared our plates.  When we finally got his attention, he was obviously annoyed and said he would get it for us in 'just a minute'. Meanwhile another 10 minutes go by and he's in the front chatting with some friends and/or co-workers. He should get 5 stars for ruining a perfectly good lunch experience so efficiently. Oh, and by the way, we never did get our check. After another 15 minutes we couldn't stand  watching him ignore us any longer so we just tallied it up ourselves and left cash on the table. I'm not very good at math, but hopefully we left him with at least 25 cents tip, because he definitely deserved it.", "author": "Ed P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-13", "description": "took a stroll on the brooklyn bridge and arrived at grimaldi's for lunch.  super fantastic pizza... not a lot of sauce which worked well.  good amount of cheese and toppings.    the bottle of root beer kind of sucked though.  a bit on the crowded side too.  still worth it.", "author": "Huckleberry L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-12", "description": "delicious new york style pizza, but you can get same or better in places w/out such a long wait", "author": "Sara H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-19", "description": "I heard that Grimaldi's had the best pizza in the NY area, within reason.  The best place is apparently an hour into Bk.  We went over the weekend, and there was a long line outside.  According to our hot hot Italian waiter with the Bk accent, it's less busy over the weekdays. The view of the Brooklyn Bridge was great and the line moved quickly.  The brick oven is in the back and we gawked watching pizzas being prepared while waiting for the 1 bathroom.  The ingredients are definitely fresh.  The Italian sausage is literally a huge ball of ground sausage that the pizza cook places on the pizza in little pieces.  I love that basil leaves, cheese, and garlic/olive oil come on every pizza and you can add add'l toppings to that.  Our pizzas were definable good but I'm troubled that this is the best pizza NY has to offer.  I like that even though this place is popular, the prices aren't inflated and it's decorated like it should look without any hype.", "author": "K B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-25", "description": "Pizza was...OK. Certainly no where near something I would recommend. I'll be honest- Fresh mozzarella is not my thing, but that does not have a hand in my review. Very hard to find a parking place #1, and #2, the people i came in contact with were RUDE. Granted, the door man who is a staple at the place, does have to deal with a few Bozo's coming in, but that's the food biz, you should never EVER become an asshole yourself in response to a middle eastern family walking in that happens to turn you off. Sorry we ALL can't be Italian. #3- (While I was waiting in line) I told him I came from New Haven (2 hours away) just to try some Brooklyn Pizza, he says to me- \"I've had Pepe's Pizza (On Wooster Street in New Haven) and said the clam pie (that they are famous for) wasn't good at all. He wrote off the place pretty hard. Pepe's has been around since the early 1920's and this guy was out of line on all counts. My honest review? No big deal really, won't go back. Ate in my car and enjoyed it, but that's it. One other thing.... Anyone gives me a pizza wrapped in butcher paper again?...can keep it. Btw?... Best pizza on earth is Pepe's in New Haven (a few more locations now). I've had some of Brooklyn's so-called best pizza, and none...NONE, can hold a candle to Pepe's. Hands down.", "author": "Edward P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-10", "description": "i had this pizza on my last day in NY. i read reviews about the best pizza in NY before i went on my trip. it took us a while to find it but we did! this is great pizza! if you live in ny or will be in the area you need to eat here!....yeah the wait is looonnngg! but its well worth it! i ate here new years eve in the morning. we waited about an hour. we were just a party of two :) so that helped...oh dude was it cold!!! too cold...im not used to the cold weather :(  but anyway once inside we were sat and we ordered. its really cramped inside this place. we were sitting like elbow to elbow with strangers!  but people that where there that day and at that hour to savor this great pizza!!! ok so we got 2 cokes :) and the 16inch pizza. it was all great. i cant believe that LA doesnt have pizza like this. there is only 1 restroom i believe so there is a long line for that too. the line is right next to where the people cook. so while i was there i saw this guy make like 4 pizzas. it was all fresh ingredients. i also saw the brick oven and the pizzas inside of it. you must definitely eat here!", "author": "Maria B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-28", "description": "best pizza in new york. 'nuff said. long lines at times but worth it. my girlfriend and i walk acroos da brooklyn bridge and eat here every so often. again, da best in ny.", "author": "bruno p."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-08", "description": "pizza fans - sorry to break it to you, but grimaldi's is WAY overrated!  i'm seriously not kidding you.  we waited in line for 1 hour and were shocked when we walked into such a tiny, cramped dining room. wow.  i was sitting closer to the stranger next to me than my husband across the table...i know others have mentioned the \"tightness\" in other postings, but i didn't think it would be that close!  it was uncomfortably close to the point where you should just start conversing with the people around you...your pizza trays pretty much overlap each other and you can hear everyone else's conversations but NOT the one you are having.  it was interesting.  definitely a shock!  as a matter of fact, a guy who sat next to us was cracking up at how close the seating was and looked at my husband and i and said, \"what's up....this is so close, haha!\"  we sat at our table for 2, which was actually within a table for 10...we were smack dab in the middle, so maybe the server didn't see us because we waited for 15 min. before someone acknowledged us with a \"what's up?!  the pizza came out piping hot, but cooled down rapidly because the temp in the restaurant was freezing!  the pizza was overcooked, but overall was edible...haha - the toppings were soggy, not flavorful and the sauce was nearly tasteless...not that tomato-y goodness you get elsewhere.  it was not nearly as good as lombardi's or john's on bleeker.  we were so shocked because the line was crazy and people rave and rave about this place.  the funny thing is, when we were waiting a guy came out of the pizza joint and said, \"hey guys (to everyone in line)...it's JUST pizza!\"  he was right.  it was a cool experience walking across the brooklyn bridge and experience it, but the pizza really wasn't worth the trek.  i would by miles prefer either lombardi's or john's on bleeker....the true test is which pizzeria is better between those two!", "author": "three's company M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-09", "description": "soooo we waited in line for 2 hours.. and it is quite annoying being a party of two and having parties of 4, 5, 3, ok one more party of 4 all behind us in line and seated before us. i felt like the ugly girl trying to get into studio 54 or something. then the pizza.. fresh moz, fresh salty olives, great! but the crust (i DO like thin crust) was burnt and not edible. after waiting 2 hours to get in i was STARVED and intended on devouring the whole pie. oh well. johns pizza in the west vill on bleeker st has the same coal brick oven pizza with no wait (well maybe like 10 mins).", "author": "riss m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-22", "description": "what a big rep!  doesn't live up to it... pretty basic really, and pie sure did cool off quickly - lukewarm at best by 2nd slice!  if it wasn't sitting smack under the Bridge and written up from here to Tokyo, would it really be any more popular than your friendly neighborhood pizza joint?  well, maybe - great fresh tasty ingredients actually, including basil and creamy mozzarella, although small portions of onion \u0026 sausage on ours yesterday - a good-looking 18\" pie with nicely charred crust, well-cut and delivered quickly - and reasonably priced considering it's a Tourist Temple - cold bottled Brooklyn Lager and fine service are definite pluses - celebrity photos on wall need good cleaning but otherwise basically well-kept - filled with customers having good time - staff cool and accommodating - just one john, but thank god they had that!  out-of-towners should generally enjoy Ye Olde New York location and ambiance but pie not so much more than Bertucci's", "author": "Chris B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}