{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-25", "description": "My fav NYC pizza joint...just avoid adding mushroom as your topping so that your pizza isn't soggy when you get it...I'd recommend just adding sausage and pepperoni. \n\nNot a fan of the line...tourists go elsewhere please!!!", "author": "Thomas C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-13", "description": "Probably the best Pizza I've had in New York.  I've been to several \"must taste\" pizza places and I've like this place the best.\n\nPizza is moderately priced and the ingredients are insane good.  There's something about the way its cooked thats just different.\n\nWhy I can't give it 5 stars is because you have to wait45 mins to sometimes 2 hrs for a dang pizza.  Kind of not worth it.  And the dude manning the door is kindo of a prick.  And he can be: the pizza is really good and they have so many people that they could give a rats butt cheek.\n\nFlavor A+....  experience D...\n\nBut I like going back.  I usually order to go... and i'll eat it around the corner or down at the dock near the ice cream co.  When you do a phone order you don't have to wait.", "author": "Samuel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "Yes, the pizza is definitely good, but it was not spectacular as most people claimed it to be. \n\nThe main reasons I am giving Grimaldi's only a 3.5-ish to a near 4 are because: we walked 5 miles to get there from SoHo, and we were super hungry- but we were not saying: WOW after eating a large thin crust pepperoni. And, it's CASH ONLY--that's a bummer. We did not mind the wait-- we waited only 20 mins.  And not have slices is strange for such a popular restaurant. They would make a bigger cash cow machine if they sold slices from another line or a walk up window.  When you go here, it's really about getting in, eating fast \u0026 going. \n\nYes, definitely go check it out, but also check out other pizzerias such as Lombardi's, Ray's (on Prince St), Joe's \u0026 Rizzo's.", "author": "Al G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-12", "description": "Who doesn't love pizza? Much less, some of the best pizza you can get?Not a day goes by that I don't dream of a fresh pizza pie from Grimaldi's.\n\nBeing a Californian with tons of NY visiting experience, I had always known that pizza/Italian food isn't exactly the West coast's forte. But hell, ever since trying Grimaldi's this past October, I could barely stand the idea of eating pizza anywhere else. Besides going to Naples or something, what would be the point? Hot and fresh out of their famous brick coal oven and hauntingly delicious, each bite is as satisfying as the first. You may even forget you waited a short lifetime just to get in the door (Myself, my boyfriend and my friend stood in line outside for an hour and a half). Next time I come back out East, I will be RUNNING to Brooklyn with enough room in my belly to devour a whole pie (or two) all to myself!", "author": "Julianna C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-20", "description": "I guess if the line is down the block the popularity of the joint will sky rocket!\n\nWell let me tell you my experience with Grimaldi's... I was expecting the best coal oven-brick freshly imported spices pizza EVER! lol But that surely wasn't the case.... It was good but not good enough to wait on a line for 2 hours!  This is a great place for tourist, because they already come with a mind set on waiting on line for anything in NY for two hours... If I were in Cali I would wait on line too\n\nYou know when you go to a movie that everyone has been raving and ranting about how good it is and it falls flat on its face?  That was what happened to me... my expectations were too high...  and to top if all off there was a long line to the restroom too! What The Hell-   Let me put it to you this way, the pizza can be duplicated!  \n\nTips: \n\n1) Be prepared to wait on a long line (even off Peak times) Tourist never sleep...\n\n2) Be prepared to eat elbow to elbow with strangers because the place is so small. Under the BK bridge, what do you expect!? fugetaboutit!\n\n3) Be prepared to order a whole pie because that is all you can order... but don't worry about coming hungry cause by the time you get in it will be dinner time! \n\nlong waiting bites!", "author": "Maritza S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-19", "description": "Upon walking in the front door, we were greeted by the typical Brooklyn-ite hostess with a nasty, \"WHAT?!\" I didn't realize restaurants no longer greet you with a, \"Hello,\" anymore. I was curious to find out the wait time before deciding to wait on line, and proceeded to ignore her nastiness and ask my question. She responded with, \"DON'T YOU SEE THE LINE?\" There are 2 possible reasons why she did not answer my question: 1) She is so angry/disappointed with her life and job that she just does not want to respond to customers anymore, or 2) she is too ignorant to comprehend the English language, even though she can yell it rather well. Due to being greeted with such a horrendous attitude to a place where I wanted to monetarily contribute, I asked to speak with the manager. She proceeded to walk into me, shove the door in front of my face and again pointed towards the line. After having gone to this restaurant for years with family and friends, I can say with certainty I will never go here again. The management may laugh at losing the business of simply a few customers, but they should be ashamed that they hire such a negative staff, as it is reflective of their own values. And tourist traps don't last forever in NYC, they should know that by now. The night actually turned out to be wonderful, however, as we discovered a new pizzeria just a few doors down - Ignazio's! Ignazio's staff is not only kind, but their food is delicious, way more reasonably priced, not too long of a wait, and it's very clean inside. Ignazio's knows what they're doing - they're getting all of the disgruntled customers from Grimaldi's :-)", "author": "Vanessa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-10", "description": "As Soon As I Walked In 1 Min Before It Opened There Were People Already Seated! The Manager Is Very polite although maybe i'm not accustomed to real pizza but this pizza made me run for the greasy old-fashion oven pizza up the street !", "author": "Nad E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-06", "description": "Went here with Hubby for lunch on his birthday. We've been meaning to try it but the line was always ridiculously long. Caught a break mid day on a Saturday. Sat down .... noticed if to be too close for comfort. As I was eating i turned around and in my face was this guys money sticking out of the back of his pocket. As far as I'm concerned the only \"dough\" I wanna see is the kind I'm ingesting.  The pizza was brick oven style, crust very light airy thin and sauce and cheese applied sparingly. Bring cash no credit cards.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-14", "description": "Let me begin by saying that I have eaten at the Grimaldi's locations in Peoria, AZ, Tucson, AZ, and Tampa, FL before finally making it to the original location in Brooklyn last week. My first three experiences at Grimaldi's were all five-star experiences - some of the best pizza I've ever had, and usually fairly good service. I came to the original location last Friday at around 5:30pm. Luckily there was no line because of the bad weather, so I was able to grab a seat right away. First of all, this place is cash only as everyone else has noted, which was not the case at the other locations I've visited. Inconvenient, but no big deal. \n\nI ordered a small pizza, half original with pepperoni, half white with ricotta cheese. The pizza came out in a timely manner after I ordered, but to my dismay the bottom of the crust was actually soggy. Not sure why, but there was so much grease on the bottom of the pizza that almost every slice had absolutely no crisp to it. One of the things that makes Grimaldi's so great is the perfect amount of crispiness in their crust, so that was completely out the window. I wanted to love it and tried pretend that it was still really good, but after the 3rd or 4th soggy slice of pizza I faced my disappointment. Because of that, I'd give the pizza itself three stars. \n\nHowever, the reason I'm bumping this down to two stars is because the service was absolutely horrible. I had clearly been finished eating for a good 10-15 minutes before the server came over to check up on me (the only time he never came over), at which time I told him I was done and asked for the check. Now, the place was not busy at all. The restaurant was maybe 2/3 full, and the place was filled with staff who were just standing around talking to one another. After about another 10 minutes went by since I'd requested the check, I look over and the server is standing by the bar texting on his cell phone. I stared in his direction for a good minute or two, and once he was off his phone he proceeded to just go back over to the oven area and talk to another employee. Then he was back on his phone for another two or three minutes. Finally he walked over towards my direction and saw me sitting there waiting, and he had a look on his face like \"oh!\" and then went back to get my check. By the time I got the check, I had been waiting for 15-20 minutes. This is unacceptable by any standards, especially when the place is not busy at all. \n\nI'll come back and try it again because I love Grimaldi's pizza so much, but I was disappointed that I had such a poor experience at the original location.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-26", "description": "I'll just add my voice to the choir of screaming fans.  I love this place.  A friend and I dined here last Sunday evening.  It was my 2nd time visiting Grimaldi's under the Brooklyn Bridge, so I knew what to expect, but it was my friend's first time. We waited for an hour and 20 minutes (it was relatively warm, 35 degrees but it started to get to us after a while), so it was going to be interesting to see if my friend thought the wait was worth the pie.   And, without a doubt, he thought it was well worth the wait.\n\nWe had a large with pepperoni and sausage.  It was great and we devoured the entire pie.  We also split a half carafe of the house wine.  I'm sure it's just boxed or jug wine, but it gets the job done for a reasonable price.  They also had other bottles on the menu that were reasonably priced. I'm not a wine guy so I can't speak to the quality of those bottles.\n\nI will definitely go back but one has to ask, at what point will Grimaldi's become too popular and folks move on to what's next?  Maybe never.  In my opinion, that point can't come soon enough because I don't want to wait that long! \n\nOh, and my friend liked it so much that we went for lunch the next day at their brand new location in Manhattan at 20th and 6th in the Limelight space.  I'll do that review next.", "author": "Travis T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "Went last night with a close friend and sat down to eat there.  They didn't seem to be to crowded so that is always nice considering it was a week day and late at night.  The staff was very friendly and nice. We had a peperoni pizza with basil and it really was truly good. I've been traveling a lot and Ben eating pizza everywhere I go just to compare it and I can say I've only had 4 pizzas better than this one.  I would definitely go back again if time permitted. It wasn't overly pricey either so that's always pleasant.  And they don't do slices which is alright. But definitely worth stopping by and grabbing some pizza here.", "author": "Dimitri J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-20", "description": "Stop #3 on the NY Pizza taste test. \n\nThey definitely don't lie that the line for this pizzeria gets loooong.  We waited at least 35 minutes (which apparently is on the short end esp on a weekend).  Too much cheese, not enough sauce and not enough crust (not to mention that it was burnt) isn't my kind of pizza.", "author": "jen m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-14", "description": "Best pizza I've ever had, period.  Even when it gets cold.\n\nNice thin crispy crust, very fresh ingredients.  We tried a half sausage with pepperoni and half white.  Both were just absolutely delicious.\n\nThe line outside can get very long so ordering ahead of time should be considered.", "author": "Chai S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-24", "description": "This pizza has tasteless sauce, we couldn't put enough chili pepper and salt to make it taste good, and still it didn't. Sorry west coast beats east coast.", "author": "Debbie J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-29", "description": "I do not understand. My friend has telled me about this place so we go one day, all of us. Now I understand that in Ukraine we do not have pizza's but I eat many a pizza since moving to Brooklyn and this one was nothing special.\n\nWe all stand in line for hour or two, suffering in cold as smelling come from all over us. I must admit, it was good smelling. I was excited almost  to the point of sexual. Finally we get to front of line and we make order for a whole pizza. Waiting a while, we finally get pizza. Our mouth's watering with delight, we each take a slice. \n\nWas like eating Totino's Pizza Roll. I was unimpressed by this Pizza. Cheese was like goat's cheese that turn sour and red meat on tops was spicy and greasey. How dare they sell such things for human consumption. I will only buy again as laxative, for this...it does job well.", "author": "Dima T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-11", "description": "It's good, for reals.\n\nBut Lombardi's is way better.\n\nThere, I said it.", "author": "Jackee K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-22", "description": "Even after waiting an hour in the FREEEEEEZING cold, I have to say, Grimaldi's hand-kneaded and stretched pizza was pretty good. Maybe not worth waiting for in chilling winds in the dead of winter, but definitely good on a fair weathered occasion.\n\nWe greedily ordered the large 18\" for the 2 of us. That's 8 big slices. You start with the base ($14) of red sauce, mozzarella cheese (i counted 22 slices on a large), and fresh basil. Then you can add toppings at $2 each. We topped our creation with roasted red peppers and sausage. While this was good, it could have used a bit more salt. And so if I were to go back, I'd get the sausage and pepperoni combo with extra basil. I think that would have been fantastic.\n\nRegardless, the pizza once baked in the old style coal oven, was delicious. The crust had just the right amount of give and chew. Crispy hot and fresh, yet thin. The ingredients are fresh. You can see the guys making them. All made to order. A well-oiled operation.\n\nCouple of quick tips:\n- Get there early and try to be part of the first seating when it opens. \n- Account for the pizza tours that show up and get priority seating. You may have counted on being among the first, but then the tour bus shows up and hogs up 20 of the best seats!\n- Come in small groups. Tables are tight.\n- Ordering take out takes the same amount of waiting time. It's a first come first serve basis.\n- There's only 1 bathroom so time your bowel movements for a line.\n- A small 16\" pizza is PLENTY for 2 people.\n- Cash only. There is an ATM outside the restaurant in case you forget.\n- And dress for waiting in line. You never know.", "author": "Cindy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-24", "description": "Oh Grimaldis....\n\nI have been here twice. My experience was the same each time:\n\nDo not come here and expect to be treated like royalty, which is surprising considering how hospitable Italians are. In fact, expect the opposite. The wait staff reminds me of the Italian mafia. Go in, do your business, and leave. No small talk, no funny business. \n\nThe lines can be very long.\n\nWith that out of the way, lets dish about the pizza. HOLY SMOKES what a pizza. Paper thin crust, fresh mozzarella, large pie...\n\nThe first time I went, my group ordered approximately 5 or 6 pies that we custom ordered. They were AMAZING. \n\nThe second time I went with my boyfriend and one of his law school friends, we ordered a simple pie and dessert. The cannoli was perfect!\n\nDESPITE the poor service, the food more than makes up for it. Go to Grimaldi's with your focus on the food, not on the entire experience.", "author": "Sheila M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-04", "description": "All I'm saying is the tour bus must get a cut from his recommendations!  This place below average.  Too bad I didnt take time to read the other reviews.  We went there for dinner, line was a little long, but gave us time to recap the day.  The pizza that they gave us was so THIN and not from all the cheese you would think they added just thin and runny.  Olives were salty, we had to take off.  When we finished we went by another place called Rays pizza, which was another recomendation, and still not that great.  I say the best NY pizza is in California, where they know how to do it the right way!", "author": "Cori R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-10", "description": "The magic of off peak timing...\n\nOne brisk day in Brooklyn - DUMBO to be precise - me and a dude named Peter D were walking by the bridge. As we turned a corner I heard an off-pitch lady squeal behind me and I turned around slowly to see my once masculine* friend Pete with a look on his face that most closely resembled a little girl getting a pony on her 11th birthday.\n\nAfter the squealing subsided, we approached with caution as the source of excitement became clear: there was no line and no wait for a table at Grimaldi's. Since this was a celebratory occasion we decided to share a large margarita 'za**. Patrons around me were devouring ooey gooey perfectly thin and slightly burnt on the crust pies. I felt a squeal rising in my throat and I may have let out a few \"omg omg omg\"s as they brought our huge feast to the table. Service is fine, not super friendly but they know they've got a good thing goin' and simply don't care.\n\nThe pizza? It was all I'd hoped for and more. The cheese to grease to dough ratio is mathematically beautiful. Admittedly, if I'd had to wait for an hour to be seated my rating would definitely have decreased. Despite being the most perfect slice of pizza I've had yet - when I get too hungry I stop tasting food and become a superhuman zombie with a whiny voice. But in the case of Grimaldi's I choose to go during off peak and leave time on the way to prepare my mouth for a party that this old school joint can most certainly deliver.\n\n\n* some parts of this review may be exaggerated.\n** possible the worst alternative word for pizza", "author": "Jane K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}