{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-24", "description": "Pizza was good. There was a long line but it was nice out.\n\n1) It was oven baked pizza \n2) price was reasonable\n3) staff was very kind\n4) best thing on the menu is a white pizza with some garlic and any green you like\n\nI liked it but I still think bleeker st. is better. The crust at bleeker is just crunchier.", "author": "John L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-03", "description": "Best pizza I've ever eaten.\n\nDon't come here in a large group or you'll be waiting forever to get a table.", "author": "Amber F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-13", "description": "The good: reasonably priced - even the soft drinks. A nice antipasto salad.\n\nThe bad:  long lines - Not worth the wait. The pizza is bland. This place in no way lives up to the hype. The bathroom was par with some crappy gas station bathrooms. Come on guys, with the cash you make in one day, you can at least remodel the bathroom. Especially for the women.", "author": "Logan S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-23", "description": "Very good pizza, but if you're going to make it seem like I am going to meet the President of the USA by buying a pizza from you, you better god damn smile, smile wiiiiiiiiiiiiiiiiide and be friendlier than a stripper with 5 kids, who needs the rent money ASAP.\n\nWhat I am trying to say is, work on making the service better.", "author": "Said M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-19", "description": "Pizza was pretty good. I love oven baked and thin crust pizzas, and I think Grimaldi's is the closest thing I've found to a thin crust pizza from Italy. I had pizza there one summer that pretty much changed my life, and I've been craving it ever since.\n\nYou have to order a whole pie and they are made fresh to order. Our group of six got two pies, and it was more than enough. My only quibble would be that the burnt parts of the crust got too burnt. I like thin crusts, but not crispy burnt crusts.\n\nOur waiter was super friendly and energetic, and happily helped us slice our pies after we admitted defeat. The place is casual and lively.\n\nBe prepared for a long wait, especially if you have a large party (four or more).", "author": "Trisha D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-15", "description": "A must for any visit to New York, and admittedly this is the only time I go to Grimaldi's, when people are visiting. But the pizza is so worth it! I'm all for fancier pizza, and unique ingredients, but Grimaldi's has some type of magic in their sauce so here simple is better. Don't try to order lots of toppings here, keep it simple. Let the sauce speak for itself. \n\nMy favorite is a simple Margherita pizza, which is so divine. It's always worth the wait to taste the synergy of the tomatoes, basil, and mozzarella melting together on that perfect crust. This is by far the best pizza I've had in New York. \n\nAnd when you leave you get to walk over to the dock and watch Manhattan and the bridges and it's beautiful.", "author": "Sophie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-24", "description": "As a New Yorker, born and raised, I have gotten the chance to have pizza from MANY places here. This place is NOT worth the 1 hour wait.  I think most people like it not because it's good (it's average) but because of the affordability. (A large pie is only $14)\n\nHowever, based on reviews, the \"second\" best pizza in Brooklyn right after Grimaldis (since New York has the best pizza in the country, I will say this is the \"second\" best place in the country!), Di Fara Pizza on Ave J, had MUCH more taste. The prices there are ridiculous but it's VERY tasty.\n\nI'd take Long Island Pizza over Grimaldi's any day. (Long Island has great pizza as well!)", "author": "Marie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-28", "description": "Delicious.  Absolutely delicious.  Though I did think Lombardi's was slightly better, you can't go wrong by putting some their delicious goodness in your mouth.  Be prepared to wait in line though.  Some shows on the Travel Channel and Food Network say it's a 20 to 40 minute wait.  That's BS.  My friends and I came in on a Sunday evening after the dinner rush and waited for over a hour and a half.  And don't wait til the last minute to bleed your lizzard either.  The line for the closet size, single person, unisex restroom is just as bad.  At least a half an hour.  You throw a couple of people ahead of you dropping deuces and that can further inflate that wait time. \n\nMinor obstacle and suffering for one of the best pizzas in NYC and a visitor's landmark.  The owner is very colorful and friendly.  He meets all his guest at the door, seats you and thanks you on the way out.  He'll throw in a couple of Sinatra classics on his karaoke machine throughout the evening pro bono.  He's not half bad either.  By far the best service of any restaurant on my 5 day visit to NYC.", "author": "Bryan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-03", "description": "Got a white large pizza with ricotta ham and fresh mozzarella and fresh garlic it was amazingggggggg with a cream soda on the side and a cannoli for dessert loved it minus one star because there was like 5 flys that kept hovering over us but food wise it was amazinggg", "author": "Junior M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-20", "description": "I will never pretend to be an expert on good pizza...especially in New York...especially brick oven style.  Debates over 'Who makes the best pizza in town?' has raged over decades, generations in fact.  I will never know the answer and neither will a lot of people but the advantage of this is we get a lot of great choices and frankly, they are all winners.\n\nSo with my limited experience, never having lived in NYC and only peripherally experienced it as a resident of the Philly, I'd have to list Grimaldi's of Brooklyn as one of my fave pizza places of all time, and a dining destination whenever I'm in town.\n\nYes it's not in Manhattan but for those who don't know, it's worth the trip across the bridge (Brooklyn that is) since this famous pizzeria is located strategically by the pier that gives the classic tourist's view of the Brooklyn Bridge spanning over the East River.  In fact on my second trip I brought my full camera gear with me to spend some quality time shooting the bridge at night while my friend waited patiently in line til we got a seat, and be warned, there's almost always a long line here.\n\nSeating is crowded, noisy, mostly on long benches packed in tight next to hungry strangers, n and the ambiance is rough around the edges, but people aren't here for the Lady and the Tramp dinner date.  They're here for good pizza and I have to say, theres something about the unevenness of the crust, sauce and cheese that gives it that genuine handmade feel that I love.  \n\nOptions on the menu are pretty simple, there's pizza, some antipasti, maybe a calzone for the person who is utterly confused as to why he's even there, and toppings for the aforementioned pizza.  A purposeful, focused menu for focused pizza lovers.  For those who haven't gone, what are you waiting for, and those who have, why are you reading this?", "author": "Ed K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-09", "description": "TOURIST TRAP ALERT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\n\nare you kidding me with this place? as one other reviewer mentioned, where are the italians?  they weren't playing italian music, no italian waiters, cooks, or anyone in there?  \n\nthis place is a tourist trap.. im a tourist and i got trapped. \n\n+1 stars only because i was with the wife so we got seated quick as a party of two (as another yelper mentioned)  \n\n+1 star for the cheese, but that credit should go to the cheese guy!  not this place\n\ngo to lombardi's for better pizza. whoever thinks this place is better than lombardi's needs to get new taste buds", "author": "Mike M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-30", "description": "Line is long, pizza is good, no beer. Liquor license expired. What?! Pizza is always better with a cold beer.", "author": "Angie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-18", "description": "Huge line.  Service was lacking, but the price and the quality of the food made it worth it.", "author": "James F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-25", "description": "Very Meh.  Pretty bland if you ask me.  Seems more like a tourist trap than a revered NY landmark.  There's a lot better out there.  A coal oven isn't everything.  Totonno's does it the same way.  DiFara, as greasy as it is, is at least something different, involving different cheeses in his pizza and a lot of love. I respect the history and tradition but would you buy a 1920 Model T Ford to go to work just because it was made that way back in the day?  No, cars evolved and so did pizza.", "author": "David F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-08", "description": "Add massive tip and be super patient loooooong line", "author": "Keith B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-17", "description": "Pizza is my favorite food. I could eat a slice of it any time of the day, hot or cold. I was very excited to come here and try some \"real\" NYC pizza, unfortunately for me the place did not live up to the hype. I had been eating pizza all week and had had some amazing pies during my trip. I thought this was going to top them all, but what I experienced was rather lackluster. The crust was almost soggy, the sauce too salty, and the edges were burnt. Combined they made for a rather sad pizza. It was still better than most places on the West Coast, but after consuming some truly phenomenal pizzas in New York I left Grimaldi's a bit disappointed.", "author": "Kristopher V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-12", "description": "I'm from LA and we don't take our pies very seriously. So you want to know what makes this pie soo different? I will tell you:\n\n1. The cheese. Absolutely FRESH mozzarella and LOTS of it! Giada herself would be proud.\n2. Dough that is cooked in a coal brick oven. It give it a big of a smokey taste. Their pizzas are more thin crust which I find is more traditional and tastier.\n3. Toppings that are FRESH! The sausages \u0026 pepperonis taste like they haven't been injected with a million different preservatives.\n\n5 girls ate 2 LARGE pizzas (which are about 8 slices). We each got a soda and the bill came out to about $55 with tip.\n\nI also loved the environment. Its so cheesy Italian restaurant decor! The red plaid table clothes! Pictures of Sinatra \u0026 New York everywhere!\nThey were also blasting music from Black Eyed Peas, Journey, and even Markie Mark and the Funky Bunch!!!!\n\nMy ONE complaint was that their soda was SUPER flat. I noticed they use older bottles (ours expired in 2 months) probably to cut costs?\n\nThey also opened a new branch in Manhattan, but its worth the trip to Brooklyn just for kicks.\nI highly suggest getting a pizza take out and taking it to the Brooklyn Bridge Park just a block down for some AMAZING views of Manhattan \u0026 the bridge.\n\nBelieve the hype. Wait in that line.", "author": "Paula L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-26", "description": "Great pizza - truly great but it's turned into a tourist trap.  There is plenty of good pizza in this city but this is not worth the wait.  If you must, phone in a take out and enjoy at one of the parks along the east river.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-29", "description": "Best coal-fired pizza in New York although I didn't try many. It's customizeable (you start with the basic cheese pizza and then add as many toppings as you want - there are no recommended or suggested pizzas but your own)!\n\nIt is often packed, so get there early. Prices are reasonable. Atmosphere is pretty loud and crowded. Don't be alarmed if someone has to pull out a table so you can sit on the other side of it, before putting the table back into its place.", "author": "Jordan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-01", "description": "Mmmmmm!  If you have to choose between Lombardi's, Difara's, etc...you better come here.  Walk the Brooklyn Bridge first to get yourself hyped up, wait the long minutes/hours here, and get your eat on.\n\nOh so scrumptious pizza!  The cheese just melts in your mouth, the crust is even good (I dislike most crusts) and the pizza overall just has something in it to make me crave for more.", "author": "Lili K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}