{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-20", "description": "Grimaldi's.  Okay, here's my honest opinion.  It's good, it's a NYC staple, tourist attraction, and the service was amazing.  The host, Ralph, hooked us up.  He even said that because I was a New Yorker that the next time I come, I won't have to wait in line. \n\nNormally, the line is about 1-1.5 hours, we waited about maybe 15 minutes.  \n\nWhen you enter, the menu is really simple.  Either you order a small or a large pie, and you select whatever toppings you want. \n\nWe got the pepperoni and it was good, but for the hype, not all that.  Plus, our pie was kinda cold and because I've also eaten at Lucali's--can't say that this is the best pizzeria in NYC. \n\nBut, for what it's worth...it's a great NYC bucket-list checkoff item, and you'll leave this place, full.\n\nAlso, this is CASH ONLY.  They do have an ATM upstairs, but be prepared. \n\nThe cost of a large pie:  $16.00 plus each topping ranges from $2.00-$4.00. \n\nSo for two people, it cost $25.00 (which also included two sodas).  They don't serve alcohol either.", "author": "Soo Jin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-07", "description": "No alcohol, no credit card. Old style I understand, and it is actually cool, but cash only? No no no\nGood pizza in a cool place, long waiting, mostly tourists. Maybe the best option here, but still can do a lot better.\nOh yes, the pizza is delicious, the surrounding and the way to get it is what makes it questionable...", "author": "Dominic B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-01", "description": "Service was very rude, especially the host who rudely told us to back up on the line by YELLING at us like we were disobedient children. Very unprofessional. Then, inside of the restaurant, he FORCEFULLY pushed my chair to make more room instead of just asking first. I was appalled and the pizza was not good enough to make up for the terrible service. Just head over to the pizzeria next door.", "author": "Angie G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-04", "description": "Worst experience ever! Usually I either go to Ignazio's or Juliana's when I come to the area but on a Friday, they both decide to close at 10 pm, leaving yours truly as the only pizza option.\n\nIt all started with the long unnecessary line. I say it was unnecessary because when we walked in we were told, \"Go upstairs and go all the way to the back,\" as we passed many open tables. As directed, we walk all the way to the back to sit at the last booth. Just as we were about to sit, this rude tall asshole of a server comes up and berates me, loudly scolding, \"How many plates do you see?! There are four for a reason.\" I try to respond but he turns around to a table and begins dialogue. \n\nThen he thought he was going to serve us... Thought wrong!\n\nI wouldn't be so agitated if the pizza made up for it but it didn't. It was terrible and so were all of the flies, flying and landing all over the pizzas. Time for a revisit from the Health Department because as soon as I arrived home I ended up sick in the bathroom. \n\nTo top it off they only accept cash and their ATM charges are $5 per transaction. This is in addition to whatever your bank charges.\n\nAll in all, it was the worst service, pizza and experience oh yeah, NO ALCOHOL. So, if you are looking for this amazing experience, make it to any of the garbage Grimaldi locations near you that are never clean, filled with flies and rob you blind.", "author": "Raghda K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-17", "description": "Awesome pizza shop. They only accept cash.... and let me tell you!!!! I can't wait 'til I go back there their pizza is like none other, very tasty, fresh and succulent. Staff is also great especially their security guy at the door. Very helpful, even chips in to have you seated, places orders for you and brings your orders right over when its ready..... Great location and great prices for great food!", "author": "George I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-04", "description": "4-star pizza.\n\nMinus 3 star service.\n\nThus, a one-star review. The pizza's good, but I would never return after my experience.\n\nI won't blame Grimaldi's for the lengthy line--good for them for being so popular--but I will blame them for the crabby guy who treats everyone like they're lucky to be standing in his line. He walks up and down the line asking how many are in each party, then as people decide to leave because the wait's too long, he gets frustrated. As we neared the front, he asked how many were in our party (for the third time) and when we said \"four,\" be snapped, \"Everybody keeps changing and now I have to start over.\"  (Our party had been four all three times he asked--he just gets annoyed that people leave the line and it screws up his list.)\n\nAfter 50 minutes in line, we get inside and are directed upstairs by a younger host. When we get up there, the same old guy asks what we're doing up there and we tell him the host sent us up. He barks something about there being no room and storms downstairs, presumably to have words with the host. \n\nAfter standing around uncomfortable for a while, we get a table upstairs, which has all the charm of someone's mistreated basement rec room. There's pealing paint on the window next to our booth, a bunch of cables (coaxial and Cat5) dangle and nothing's very clean.  To put the icing on the cake, the temp on the second floor is hovering around 83 degrees.\n\nAfter ten minutes no one has waited on us, so I approach a server and let him know we've been waiting ten minutes.  His response is \"He'll get to you.\"  That's it.  \"He'll get to you.\" \n\nHaving now invested an hour of waiting to sit in uncomfortable heat and be ignored, we finally get service. Finally, things are looking up!  \n\nTwenty minutes, no pizza. Thirty minutes, no pizza. Forty minutes, no pizza. Fifty minutes, no pizza. Finally, 55 minutes later, our pizzas arrive! In that entire time, the server never checked back with us. \n\nI don't care how good your pizza is (and it is good at Grimaldi's), I am still going to give a one-star review for that kind of terrible experience.", "author": "Augie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-18", "description": "Damn, the line here is ridiculous! It's a good thing we only had 3 people so we were able to get a table pretty quick! \nThe pizza here is really good! We basically build our own and shared it among my two friends and me. I could really taste how fresh the quality of the every ingredient is in the pizza. 1 whole pizza sure filled us up too! We also got the spumoni and that was a really good dessert! I highly recommend that you should end your meal with a spumoni!!!", "author": "Shirooroo K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-06", "description": "Brooklyn reinforces that NY has the best pizza in America. This is the first place in Brooklyn I've had pizza, but it is easily one of the best slices I've had. Nice fresh melty stringy mozzarella, chewy pillowy crust with a crisp exterior, just the right amount of sauce, just a wonderfully composed pie. Not to mention if you order the anti pasta it comes with nice flat bread made from the same dough as the crust. Love that they have plenty of seating and great timing of food coming out of the kitchen.", "author": "Nina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-14", "description": "This is my favorite pizza in New York. I don't care that I'm basic for saying that because this place is famous -- it's still amazing. The cheese they use gives me life. I just wish it weren't so crowded all the time!", "author": "Kate J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-05", "description": "Recently went to Grimaldi's again. As a native New Yorker, I have long loved Grimaldi's pizza. The pizza is still amazing. However, I have to confess the service is not like it used to be. This made me sad, because the pizza still tastes great.", "author": "K K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-18", "description": "My favorite pizza! Sat upstairs, great service! The pizza was so delicious! The ingredients so fresh! I would like the slices a little more cooked so it wasn't so flimsy! But the cheese was melted just right! Dreaming of the pizza now!", "author": "Selena N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-15", "description": "Honestly I thought this place was supposed to be amazing. And don't get me wrong the pizza was good but it didn't really meet my expectations. We ordered the small pizza with pepperoni. It was oily and just not a lot of flavor to it. The pepperoni was super salty too. I expected a lot more and probably won't return, but I suppose it was cool just for the experience.", "author": "Avi K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-06", "description": "Was concerned that this place was just a total tourist trap since the line was so long but was happy when a couple folks in front of us were natives \u0026 raved that this is actually really great pizza \u0026 worth the wait.\n\nDidn't wait too long for a table (about 1/2 hour). Been told the line at night during the weekends could be over an hour. Anyway, we sat down all happy \u0026 excited but waited for more than 10 for any one to come over \u0026 even acknowledge we were there. (Come on Grimaldi's so far you've lost 1 star for the even longer, unnecessary wait.)\n\nThe pizza is truly delicious. Nice thin crust, high quality cheese, basil, \u0026 great sauce. It's really authentic brick oven pizza. \n\nMy main problem with this place is the service. It's slow \u0026 honestly not nice at all. Also make sure you check out your bill. They add the tip to it \u0026 not tell you. Service this bad doesn't deserve even $1.\n\nChecking out Juliana's next door the next time. From the reviews on here, not only is the service better but they also accept credit cards \u0026 it's the same recipe since it's the original owner.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-12", "description": "Grimaldi's is a really special pizza in Brooklyn that's worth the wait if the line isn't too long. In the couple of times my friends and I ventured out here, we never had to wait more than 5 minutes to get in, which I hear is pretty lucky. The basic red pie with mozzarella and basil has been the way to go. It's not too crazy price-wise, though you can definitely find a cheaper bite in Dumbo. And for the price, you get hot, smooth pizza that tastes just like it would in Napoli. On the taste front, it's an A+.\n\nBased on my luck with the lines, I wish i could give this place 5 stars for the wait and flavor, but what I can't get over is that in 2017 it's still Cash-only. Yes there's an ATM machine in the pizzeria, but I'm used to not carrying much cash and my friends tend not to either. We're young people and living in the digital age. Cash-only places don't tend to do well with us. The mystique is fading. Not sure if I'd come again, favoring convenience at a place like L\u0026B Spumoni gardens in South Brooklyn or Prince St Pizza in Manhattan. Just as good if not better flavor, and I can swipe my card and go.", "author": "Chris P. B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-17", "description": "My girlfriend and I wanted to eat our way through NY. We only wanted small meals / snacks to maximize the number of places we can visit. The two of us came after the lunch hour rush around 3pm and still waited around 20 minutes for a table inside. We ordered a small pizza with pepperoni (6 slices) and we weren't even able to finish that. Took the remaining 2 slices to go. They wrap each slice in foil, so you don't have to worry about it laying flat in the bag. The pizza was delicious, but I loved the pepperoni the most. It was crisp and thick. The disc is a bit smaller than what you normally see, but the thickness makes up for it.\n\nService was a bit slow, but we didn't mind since we were enjoying the A/C and outta the heat.\n\nThey only sell whole pies. Cash Only.", "author": "Char L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-03", "description": "There is ALWAYS a line. The line moves faster than Juliana's next door because there is more seating available, but I say Juliana's is worth the additional wait. Grimaldi's is inconsistent. I've been a few times and unfortunately, maybe 1/3 of the pizzas I've had have been burnt. I get that it's a busy spot, but please try to get more quality assurance. This place is also often overrun with tourists and it feels like the waitstaff just wants customers in and out. I'm not a fan of the vibe. I'll be on the other line waiting for a seat at Juliana's.", "author": "Donna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-25", "description": "Very good pizza\nGreat location and service\nEasy to get to by rail take A train to high street exit", "author": "Steven G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "As a tourist must-do, it's vital to have a legit pizza in New York. I did a lot of research on how to find the perfect bite of New York pizza and it took me to this little gem in Brooklyn. \n\nIt's was definitely worth the commute from upper manhattan! Perfect firm smokey toasted crust, fresh mozzarella, savory garlicky tomato sauce, topped with fresh basil! This was just the regular plain pizza! $12 for a whole pie (6 slices). \n\n(Also, it's right next to the Brooklyn bridge if you have plans on walking it.)", "author": "Genee M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-31", "description": "I came here for the first time on Saturday. The line was long, but the men who work there were doing their best to get everyone seated as quickly as possible, and it's a pretty large space so it's definitely a good sign that every seat was filled and they still had a line down the street. The pizza was great and the service was good. The only thing to keep in mind is that they only accept cash which is a bit inconvenient.", "author": "Danielle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-22", "description": "I have been living in NYC for past 10 years and I have never gone to this place due to crowds and totally touristic vibes of the place. But we gave it a shoot last Thursday and the pizza was unbelievable delicious. As a matter of fact it was the best pizza in my life including Italian vacation experience.", "author": "Irene Z."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}