{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "Let my start by saying the pizza is still unbelievably good after all these years but they need to give the place a serious face lift. Love the old school charm but no ac units on any floor?!. Again the pizza is still worth a few units of sweat but it's uncomfortable to say the least.... they also have no liquor license??? They used to! What happened guys?? Pizza and beer go hand in hand!", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-03", "description": "We came here after walking across the Brooklyn bridge and after reading all the rave reviews. We came on a Monday around 3 and there was a short line outside. When we came in, I was surprised to find out there was no air conditioning, and you eat off of paper plates. Also, it is cash only. We ordered a pepperoni and meatball pizza and it was quite delicious. I loved the fresh mozzarella and herbs. Overall a good meal. Of note, the bathrooms are tiny and the stall doors do not lock. It's a great place to eat though and there seems to be a line outside all the time.", "author": "K H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "Gee whizz dude. What can I say about this place? It's freaking awesome!!! The flavors are so delicious!! Be ready to wait in line even in 90% humidity in 100 degree heat! Don't worry, the line goes pretty fast and they have a complimentary jug of water outside so you can hydrate while you wait. Cash only, but there is an ATM inside.\n\nI found out there was a Grimaldi's in El Segundo, Ca and I about died!! We took a drive to the beach to get a taste of that pizza!! It was good, but not as good as the original Grimaldi's.", "author": "Rochelle P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "Super delicious. Been here twice now. Be warned, service is very Italian in mannerism. Seemed to catch people off guard. Tables of two walk right in. Larger groups prepare to wait. \n\nToday we got to-go. So it only took about 15 minutes. Half pepperoni, half sweet pepper. Small. $21. There menu says small feeds 1-2 people. But we had 3, and it was plenty. \n\nThe bread is great. The sauce simple. Cheese is super great.", "author": "Megan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-31", "description": "During our holiday visit to New York City from Los Angeles during Christmas vacation; our hotel and our friends in NYC recommended Grimaldi's Pizza because it is one of the best pizza around.\n\nThe recommendation was correct, best pizza around, bar none.  But why would I give them \"1\" star?\n\nRodents!  Our table was next to a pantry/storage door (and also to an ATM machine).  After we have finished our pizza and paid our tab, 1 mouse decided to come out and visit the bar area.  And after few minutes collecting our thoughts/soul (due to shock and another bigger mouse came out and went along the bottom of the bar and decided to proceed to the other side of the dining area.\n\nMy friends and I left the establishment immediately! And there is a reason they don't take credit cards because one can not chargeback on CASH!  \n\nI don't care if people are going to say this is NY, it's dirty, and get over it.  This is a food establishment and this is never acceptable!  This is how plague got started in the medieval times. \n\nWhat I am saying are 110% true and not a word of falseness.  Please read my review on this place and don't ever eat there!\n\nJan 6, 2017 update:\n\nAfter a Yelper pointed out to me, that this 1 Front Street Grimaldi is an imposter pizza place.\n\nPLEASE GO TO NEXT DOOR pizza place called Juliana's.  The ORIGINAL Grimaldi!\n\nP.S.  Even the ole Brooklyn/New Yorkers were fooled by the imposter pizza place!", "author": "J C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-22", "description": "Great place!!! Super casual, I tried one of the best pizzas I've ever tried. Menu is super simple you just add toppings.", "author": "Guadalupe R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-16", "description": "Definitely agree with some other reviewers. I'm not sure about the claim by one other reviewer about being \"racist\" but I'm sort of feeling the same way thinking that restaurant has attitude somewhat. I could be wrong, but don't know. My job here to write what I've experienced. We were first-time travelers to Brooklyn planning to have that awesome Brooklyn pizza for the first time in life so we had no idea about the menu or how topping prices and system work. The problem is the lady by the entrance who takes the orders. She was so impatient when my wife wanted to add a topping and not respectful or whatsoever at all. It was one of the worst customer service I've ever had. I had to tell her that we are paying customers and we could be confused and asking some questions and she needed to be patient especially at that time no one was behind us. I understand that she could be tired because this non-stop orders thru out the day and that's not my problem. Owner should hire another person if one person can not handle, right? No need to treat us like 2nd class citizen. The restaurant is right next to the harbor where the tourist arrive on boats. Most tourists are from China so they might have hard time ordering and understanding the menu.The restaurant might think that they are so established and have enough business and leverage not to give a s*hit to those tourists because no matter there will be a line because \"everyone, who is first timer is excited to try Brooklyn pizza\" right? But the truth is the this place and the one next door are totally counting on these tourists that they are treating them like s*hit, IMO and we were one of them. I actually doubt that locals would come to this place. \n\nSo the first part of placing the order was horrendous. However when the pizza arrived, it blew our minds. My wife who is not into pizza was super stoked and all my angers and madness were just melted and vaporized. Pizza was big, colorful, and I actually give lots of credits to those guys next to the oven made this incredible pizza happened. They got my hi-five. The lady, zero.\n\nFor the reason- the great pizza, I've added two stars to to this review. Sorry that's all I can afford.", "author": "Theo J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-20", "description": "The pizza was okay. The sauce lacked flavor and taste. The staff was nice and friendly. Great atmosphere.", "author": "Nakia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-30", "description": "We were initially going to go to Juliana's, but once we saw the line there (1 hour minimum), and saw no line at Grimaldi's, we quickly changed our minds.  This is an authentic New York pizza place.  I have to admit that I expected so much more from the pizza, but can't complain.  The pizza was huge, and good enough.  They do not sell pizza by the slice and take cash only (what year is is?!), but conveniently have an ATM in the corner.  The pizza won't be anything to write home about, and I've definitely had better, but I'd still say it was good and this is a place you need to try at least once if you're in New York.", "author": "Tanya A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "I absolutely love Grimaldi's pizza. I've eaten here several times. The pizza is amazing and the staff are very welcoming and polite.", "author": "Kiesha J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-17", "description": "Waited to be seated for about fifteen minutes on a Sunday afternoon. We ordered a large pie with basil and sun dried tomatoes- it arrived to us in about ten minutes and was devoured in less than five. Crispy and thin crust, and you can actually taste that the ingredients are fresh. Certainly a place everyone should try at least once.", "author": "Sadia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "My girlfriend and I came here on a Sunday around 2pm after walking the Brooklyn Bridge. I have heard about the lines but luckily we didn't have to wait at all. We got a small pizza with half pepperoni and ate the whole thing. Definitely enough food for us, we felt full afterwards but not uncomfortably so. About an hour later, we discovered I had left a shopping bag there with some gifts and after calling the business we were informed that they still had it. We traveled back again to pick up the bag and my cell phone died and one of the employees let me use his charger which was super fast and allowed us to travel back safely! \n\nGreat food and service all around!", "author": "Katie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-10", "description": "Long lines, and over priced for pizza. I've been here three times, at the old location where Juliana's is now and the new location and the pizza is just okay. Not worth the wait for this tourist trap. The pizza was soggy and every slice you pick up, the toppings just fall off... including the cheese.", "author": "Greg L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-04", "description": "Good thin crust pizzas if you want to wait in line for them. Otherwise, the Grimaldi's in Hoboken offers the same minus the waiting outside. \n\nCash only at this location.", "author": "Jade B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-02", "description": "The mozzarella is soo fresh! The crust is to burnt for my liking and could use more basil for flavor. It was just average but not worth waiting in a long line for, very overrated!", "author": "Monica L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-21", "description": "So very disappointed. Since I was a kid, eating a Grimaldi's pie under the BB was on my bucket list. Finally on a trip downstate I ended up in DUMBO, took a walk over the Grimaldi's  and saw no line there at the door... had a seat within 5 mins. Ordered a pie with pepperoni and mushroom. For it not to be busy, it took a bit long to come out. When it did come out, it wasn't even hot, as I saw other's pies coming out steaming... \n\nIt was way beyond thin even for NYC style pizza standards. We are talking rolling paper thin here. The dough (except the outer crust) was very raw and undercooked. How could that be even for a dough so thin?? Sat there waiting for the waiter, never shows up for the usual \"how is everything?\" so I got up and found him and told him the pie is undercooked and I'd like it put back in for a few minutes. Now it gets better...\n\nHe follows me back tot he table and says \"well you ordered the mushroom on it, so it will be soggy like that\"... I said huh? Um no, I showed him the gooey undercooked dough and he says again \"The mushrooms make the dough juicy like that\".... and he walks away annoyed and sends over this lady host. I tell her \"this dough is not cooked, clearly look at this, it's gooey and raw\". She says \"when you order fresh veg on your pizza the juices go into the dough and make it soft\".... WHAAATTT??? Ok listen honey, I've had many a NY pie and I make my own at home all the time, so no that is NOT the case my dear. You mean to tell me that everyone in here that has some sort of veg on their pie has a soggy undercooked crust??\n\nShe gets mad too, doesn't even ask me how I'd like to solve this problem. I say can you please just have this put back in to make it crisp, you don't even have to remake it. She grabs the pie and walks away pissed with an attitude. \n\nMaybe the very old original Grimaldi's was THE place to go back in the day, but as others have said it's now a tourist trap and if I'm gonna have tourist trap NYC pie then I'll just go to Lombardi's where I can get mushrooms on a COOKED crust. And for CASH ONLY, with that much business, well thats another reason that this place is just shady. \n\nMy advice: Think twice before waiting in an almost endless line to eat off paper plates and plastic cups and utensils. There are way better places in this great city to get a true NY pie!!", "author": "Sarah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "No alcohol, no credit cards, no music from after 1978. Great cheese, tasty sauce and crisp and chewy crust! Too much burnt crust. Nice servers, curt host and they make you wait outside even when not necessary. Overall it's fine for a small pizza and coke but not a destination (tho it was packed with tourists).", "author": "Dave T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-28", "description": "While visiting we had to do the famous stops of course..so off we trucked across the Brooklyn Bridge we found our way to the shop. We where greater at the door and showed to our table on the second floor...was nice we could see the brick oven and the pizzas being made...menu is very basic your pies, calzones, and some anti pasta.  We each ordered a small pizza it states it serves 1 to 2 people and consist of 6 pieces so we figured it would be on the smaller side.  16 for a small and 18 for a large they come with fresh mozzarella basil and tomato sauce the topping is where they get ya 4 dollars a topping  (ouch). They where not small btw def enough for two people possible three.\n\nI ordered the traditional with pepperoni fresh tomatoes and my friends just had them plain...they come out quick no waiting here...the fresh tomatoes made mine a little soggy but it was def thin and had an ok taste..it was rather bland so I added the granulated garlic and some salt and pepper to add flavor..over all I was a little disappointed I thought it would be better..guess that's what happens when you walk a whole city for a pizza lol...they did package it up for us so that it was easy to carry but beware it comes out all bunched up.  Is it worth the trek...probably not but if your in the neighborhood it's worth the stop.", "author": "Brandy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-22", "description": "Pizza was amazing..... service alright at best to the detriment of the business. If the staff were more attentive and on it they could easily flip the tables much faster and get the money out of all those pockets waiting outside or considering to get in line. Took us 20 mins to get in but 45 mins for 1 pizza. BTW paper plates and plastic cutlery are pretty crude and as an attempt to speed the flip is not as effective as having staff spend more time serving and less time sitting there chatting while the dining room stares at them to place orders and pay bills", "author": "Derek M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "Lucky for us there was no wait unlike other times I've seen a line out the door.  We went on a weekend in the late afternoon.  The pizza tasted so fresh and did not take too long.  Service was good.  We all thought the black olives were a bit more bitter than we are used to but probably because they are not canned.  I would go again.", "author": "Ameet V."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}