{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-13", "description": "3.5 stars. Pizza was pretty good. First time trying ny pizza. A bit pricey for pizza but was a good experience. Wait time to be seated was kind of long.", "author": "David R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-24", "description": "is it the best pizza in nyc?  i liked it, but i'll let you be the judge.  coal fired pizza is pretty cool, though i was starving at the time and we waited in line for an hour...so just about anything would have been fine.  i'd go back again though the line kind of turns me off.  if it were closer i'd probably do take out.", "author": "Todd N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2005-11-12", "description": "If you're based in lower Manhattan, the weather is mild, and time is of no concern, the fastest way to get here is by foot, hoofing it across the Brooklyn Bridge, under which it's been located seemingly since time began, since the nearest subway station is nearly as far as the other side of the East River. (Alternatively and more expensively, you can take a water taxi that will deposit you at a pier down the street, then walk back to work off your meal.) The interior probably hasn't changed since it first opened its doors - the decor consists of plastic red-checked tablecloths and hundreds of autographed photos of famous patrons. This is New York-style pizza, pure and simple . . . there isn't an arugula leaf in sight. A thin crust is topped by tangy tomato sauce and thick slabs of buffalo mozzarella oozing towards the crisp edges, and topping options don't get much fancier than pepperoni and black olives. Definitely avoid this place at the usual lunch and dinner hours, or you'll wait for nearly as long as it's been here. Cash only.", "author": "Gourmet G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-01", "description": "Every time I ventured around this place, there was always a long line outside. After so many attempts at eating there, it was eventually decided to order it to go, the wait was about a half hr or so. The pizza smelled sooo delicious, I couldn't wait to get home to eat it. The drive was about 20 minutes, but by the time it got home, the pizza was already cold (it was around winter time) and had to be reheated in the oven. Although the pizza was good, it could have been better. I had high expectations considering how famous Grimaldi's is and also due to the pizza's initial tantalizing scent. I suspect it's better to eat the pizza right there and then at the restaurant. I had a much better experience at Lombardi's.", "author": "Xiomi R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-02", "description": "SHOCKINGLY AWFUL.  1) Waiters slow and rude. 2) We asked for OLIVES and got ONIONS.  3) The onions made the crust completely SOGGY and like glue. 4) We also asked for mushrooms, which were TINY SLIVERS, almost invisible and gave NO FLAVOR.  5) HORRIBLE WINE.  6)  Music so LOUD we could not have a conversation without saying WHAT? 5 times.  7)  One of the staff came and took one of our party's coats and threw it on a coat rack by the door.  Didn't even ASK who it belonged to. When our older friend came back from the embarrassing bathroom, he completely freaked out, thinking it had been stolen.  No one had seen the man take it.  The reputation, and the line (which we blessedly missed) are AMAZING and WRONG.  It seems that once people HEAR someplace is great, that's it.  But this place SUCKS.", "author": "Lainie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-21", "description": "Sure you've heard it before.. \"Brooklyn style pizza is the best pizza\" but its true!! We waited for 1h in the cold but it was well worth it. All the hype is true. Its the best brooklyn pizza with the best view! The staff was very nice. The owner is the one that greats you at the door so it makes it feel more like a mom n' pop joint. We ordered two larges amongst five people and it was enough. Next time we are going to try it with the fresh garlic on our pizza.", "author": "NYC F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-08", "description": "ok.  it's good.  i get that.  but are our standards that low that we have to hold this up as the best pizza in new york?\n\nin my opinion the customer service is pretty bad.   you walk in, there's no one to greet you, you don't know where to go.  \n\nonce i walked up to the register to get helped, and after waiting thru three orders, i was finally told to get in line outside if i want to be seated.  how was i gonna know that?  and then outside there was no actual line, just people mulling, confused, hoping that no one claims there spot when the guy comes out and calls 'next!'. \n\nin my opinion, if you are fortunate enough to be as successful as grimaldi's, then you should hire enough help so that you have a host, your staff doesn't have to be short and impatient with people, and none of your customers feel like they are invisible. \n\nthat being said, congratulations to them for having great pizza and a great place to kick it near the brooklyn bridge.  \n\nrecently i went on a date that was just grabbing a pizza here and taking it to brklyn bridge park.  couldn't have been nicer...", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-22", "description": "One of the great debates between the citizens of America's First and Second cities centers around the merits of their respective pizzas. And even though I'm not sure that Grimaldi's qualifies as \"New-York style\" pizza, I will concede that it is better than anything I have had in Chicago, or anywhere else for that matter (so good I had it twice during my one-week visit). The margherita was the best, perfect in its simplicity, so much so that I barely noticed how sardined in everyone is. My eternal gratitude to Mr. John Augustus Roebling for allowing me to experience this pizza nonpareil.", "author": "Geoff M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-18", "description": "mmmmm. mmmm. wow. mm. Not many words were spoken during this meal. Expect to wait in line, expect to be a little cramped while eating, expect a great old style pizza. Lots of toppings are great, but I recommend the plain as it's held it's own since day one and will not disappoint. Go at night and enjoy the spectacular views!", "author": "paul j."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-09", "description": "After reading about all the hype, I decided that pizza at Grimaldi's had to be one of my last stops before moving out of NYC.  We arrived just after 12 noon and were seated right away by a friendly server who took the time to fix our unsteady table.  We got a large pizza with mushrooms.  Now, I must say that the place smells incredible.  As eating is a sensory experience, you are convinced that the pizza that will come out of the oven will be the most amazing pizza you've ever tasted.  As for the real thing?  Yes, the pizza is good, the crust is thin, the basil is tasty, you've not overwhelmed by the cheese, etc.  I easily ate (and regretted eating) four slices, since the pizza probably wouldn't have reheated well, and cooled off really quickly.  It didn't taste like the smell, though, so as for it being the best pizza in NYC, I can't be sure.  But I would say go at least once for the old school dining experience and a tasty thin crust pizza.", "author": "Kim D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-22", "description": "After hearing so many great things about this place, maybe my expectations were too high. I have definitely had better pizza in NYC--and at places where I don't have to stand in line outside. Overrated.", "author": "Andrew J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-11", "description": "prime example of reeeaalllly good ny pizza. from what i remember, the wait wasnt too bad. be prepared to sit uncomfortably close to your neighbor...especially if the place is packed. i really dont know what it is about this place that makes the pizza so good. could be the cheese. the cheese forms strings from your mouth after every bite...its so freshly made. a medium is more than enough for two people. this place definitely has a family feeling to the decor, which is really comforting. in the back of the room you can see guys tossing pizza dough in the air and hUUUUUUUGE chunks of mozzarella mmmmmmmmmm =).", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-14", "description": "No one can make pizza like they do.  The wait is definitely worth it.  While the space is small and cramped, you won't care once you've tried their pizza.  Everything is fresh and delicious.  Afterwards, be sure to hit up the ice cream factory down the street for dessert!", "author": "Kim W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-12-15", "description": "Nothing beats a Grimaldi's pizza... I'm drooling just thinking about it.  Walking across the Brooklyn Bridge is a nice way to work up an appetite.", "author": "Jane K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-16", "description": "I heard a lot of great things about this place before going there and some even say it's \"The Best Pizza in NY\" so my friends and I definitely had to check it out for ourselves! Unfortunately, it was BEYOND disappointing. \n\nOur first and, most definitely, last visit to Grimaldi's was on July 12, 2010. After getting lost for at least an hour trying to find this \"hidden treasure\", we were met with a semi-descent line outside. We must've gotten there just after the lunch-hour rush because the line got really long very quickly. Regardless, this line was very deceiving. It still took us an hour to get to the front of the line where the hostess was kind enough to let a group of 10 cut in front of us because supposedly they were \"friends of the owner\". Sigh. \n\nInside was very crammed since there were way too many tables for such a small place. It'll be a miracle if you get through their maze of tables without bumping into or being bumped by other people. Now comes the bad part of our experience. lol. First was our waiter, who was kind of obnoxious in my opinion. It took him awhile to come over and take our order but when he finally arrived he was nice enough to get \"up close and personal\" by placing his crotch on my shoulder which I gently shrugged off. Then he kept slamming down our drinks and almost hit my hand! I was already in a really bad mood at this point but I wanted to give this place another chance to wow me with their food. Their pizza, even with an odd choice of cheese (mozzarella, i think), was actually not too bad but is simply not enough to deserve such high praises from so many people. Their calzone, on the other hand, was simply horrible. I'm not sure what was in that thing but it was bland and the cheese had the texture of spoiled milk. It was like eating sugar-free whipped cream inside a piece of bread! \n\nOverall, Grimaldi's is just an over-hyped pizza place! There are a million pizza places in New York City that taste just as good, if not better, without the hassle of long lines, uncomfortably rude waiters, and strange cheese! Take Famous Famiglia Pizzeria for example! But hey, ours was just a one-time experience. It could have just been a sequence of  unusually bad coincidences for all I know. This was from one man's perspective so if you have nothing better to do and have lots of patience then I suggest you give them a try. Just don't go out of your way to visit or expect too much from a pizza place. One thing's for sure though. I can now say, \"I've eaten at Grimaldi's\". haha! God bless!", "author": "Joey M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-14", "description": "Grimaldi's pizza taught me how to love and changed my life forever.", "author": "Linh P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-11", "description": "Perfect pizza and no wait but pretty poor service while waiting for a check for over 20 minutes and asking multiple waiters.  The pizza comes out the perfect temperature with the perfect crunch to chew factor on the crust.  Not too heavy on the toppings but certainly not too light.  The perfect slice that crushes Di Fara's or Lucali's recent efforts.  This is a pizza you could eat every day but could only wish you lived next door and you could actually not have to wait for it.", "author": "Jonathan E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-09", "description": "fast service and the pizza is super thin and tasty. stick with the red sauce though!", "author": "Vicky H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-11", "description": "Pretty good, though the pizza came out a little undercooked.  Strangely, the basil and crust were kind of burnt, but oh well.  It wasn't horrible.  I sort of liked the ambiance--it was very bustling and family friendly, although those two four year olds next to us were rather loud and slappable.  Service was tolerable, but not the most attentive.  If you can get there early and not have to wait in line for so long, it might be worth it, but I cannot comprehend why people would stand in line for an hour for this. I've had better, and sorry to its fans, but I would not wait for Grimaldi's again.", "author": "Miss C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-05", "description": "pizza here is incredible! i love the fact that they use fresh mozzarella, basil, and crushed tomatoes - sooo goood. less processed ingredients = less greasy = puts a smile on my face and leaves me feeling satisfied instead of gross. the staff could have been a little less cold than the weather, and the seating was extremely cramped, but the pizza was all worth it.", "author": "dee w."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}