{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-03", "description": "This place is famous for a reason!  And they sure make you earn it by spending hours in line.  A bit cruel, perhaps, as you are forced to stare at people eating through the front windows and every time the door opens a heavely smell wafts out and overcomes you...The good news is, once you're in and place your order your pizza arrives in no time.  And it's worth it.  Mmm it's worth it.\n\nOther things to note - cash only, and no slices so come hungry!  If the line is huge and you're starving a good alternative is Front Street Pizza just a few blocks over.", "author": "Becky R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-29", "description": "People always compare Lombardi's and Grimaldi's... for me it is always going to be Lombardi's.. as stated in my Lombardi's review, I am a sauce girl, and Lombardi's had the best sauce, in my humble opinion.\n\nGrimaldi's has the best crust, and the best cheese.  Is it worth the wait outside?  Yes. Yes it is.  Grimaldi's makes a terrific pizza, and I have waited outside to sample some of it more than once.  If you are a crust person, you should choose Grimaldi's.  Just the right amount of chewy and tasty.\n\nYum.", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-14", "description": "On rare nights, in certain restaurants, memories are created that, in the later telling or yelping or remembering of them, remain unscathed by such details as long lines, cramped conditions or an excess of tourists. I'd suggest drinking too much cheap and decent Chianti out of your water glass, giving it back to the Italian fixture who mans the line, ordering sausage on the pretty exceptional pizza and grabbing a cone at the Brooklyn Ice Cream factory before taking in a view that is more first-kiss-worthy than any I've seen. If it's summer - you must - walk the bridge home to Manhattan. The city won't seem so far away.\n\n5 Stars for Grimaldi's or the nights I've spent there.", "author": "Lindsay H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-21", "description": "Good pizza.  I still like Di Fara and Modern Apizza just a slight bit better, but it's like splitting hairs.\n\nAll NYC and New Haven pizzas kick the crap out of all the bad California-pizzas I'm surrounded by.\n\nI will stop by Grimaldi's, Di Fara, Modern, and Pepe's on my pizza tour next month, and also check out a few places I haven't been to yet.\n\nCalifornia sucks.  I can't wait to leave pizza hell and join y'all for a decent East Coast pie! :)", "author": "Justin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-10", "description": "Q:  So, how does a Filipino use deduct, defense, defeat and detail in a sentence?\nA:  Deduct flew over defense, defeat first, detail last.\n\nQ:  What is a Filipino's idea of devastation?\nA: That's where one catches the bus.\n\nQ:  How about Protestant?\nA: That's where one gets apples, bananas and oranges.\n\nQ:  There are three Santas on the roof. Which one is the Filipino?\nA: The one wearing the bunny suit.\n\nSteven Spielberg and a Filipino:\nA Pinoy went to a bar in Hawaii to have some drinks. At the counter, he sat next to the famous Hollywood director, Steven Spielberg who was already ahead by a quart of alcohol. After a couple of beers, the Pinoy sensed that Spielberg was glaring at him. Suddenly, in a flash the Pinoy crashed down from his stool, felled by a vicious hook from the director. \n\nPicking himself up, he yelled, \"Wat da hell is dat por?\"\n\nSpielberg ranted: \"That's for the bombing of Pearl Harbor, you #@@!!##! My dad perished in that bombing!\"\n\n\"Pucking shit!  I am not Jafanese, you stufid Nincomfoof! I am Filipino!\" exclaimed the Pinoy.\n\nThe inebriated director replied, \"Yeah yeah yeah ....Japanese, Burmese, Chinese, Vietnamese, Filipino ...you are all the same.\"\n\nRegaining his composure, the Pinoy dusted off his white pants, straightened the collar of his loud bird-of-paradise printed shirt, took his seat and ordered a double R\u0026B from the bartender. After a few sips, the Pinoy stood up and delivered his best Jackie Chan karate kick, sending the director flying halfway across the room.\n\n\"What was that for?!!\" shouted the surprised Spielberg from about fifteen feet away.\n\n\"Dat's por da sinking of da TITANIC! I had my grandpader on dat shif!\" the Pinoy answered back.\n\n\"You ignorant shit! The TITANIC was sunk by an iceberg!\" exclaimed the director.\n\n\"Yah yah yah...Iceberg, Sfielberg, Carlsberg... you are all the same.\" \n\nAnd finally...what is brown and white and flops on the beach? \nA Filipino and a seagull fighting over a fish.\n\nWTF?! What else can I really say about this place? It already has 208 reviews. No, make that 209...So might as well tell some lame-ass Flip jokes.", "author": "Marco d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-20", "description": "I wish I owned Grimaldi's.  Lines out the door and cash only.  Nice. \n\nWhat's not to like about this place? The setting right under the Brooklyn Bridge is awesome, the pizza is fantastic. Not much elbow room and the waits can be excrutiating, but who cares? And you can get kick-ass ice cream at the Brooklyn Ice Cream Factory after gorging yourself on a delicious pie. Polish waiters, Mexican pizza makers and an Italian owner. The Pope would be proud.", "author": "Izzie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-24", "description": "NY pizza, disgustingly good, full stop.\n\nBeat the crowd and get there as it opens or you'll be waiting in line forever, famished, and riotous. Obvies don't go for the ambiance because there is none. You'll be seated charmingly RIGHT next to a family who took their contraception advice from the Brady Bunch or a bunch of firefighters on lunchbreak... close enough to smell their sweat. It is loud and crowded and the pies keep flying out of the door for the take-outers but that should only affirm how good the pizza is. They also serve good local sodas.", "author": "Laila V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-10", "description": "Went to Grimaldis for the first time last night with my girls after a few drinks at Brooklyn Brewery. We've all lived in NYC six years or more and figured it was finally time to go to the proposed Mecca of NYC pizza. We orderend the margherita pizza, practically salivating with anticipation, and have to say it was a huge let down. The crust was great, but the toppings were not. I'm not Italian, but I have had pizza in Rome and fairly confident they would spit Grimaldis pizza out and throw it to their dogs. The sauce lacks the love required to make their pizza even remotely memorable, the mozz was not fresh and it's clear they skimped on the basil...Basil! The cheapest ingredient! Thankfully, I have several other pizza joints to select from, but now I know what I've been missing and it's nothing much.", "author": "Marguerite S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-05", "description": "Just one thing before I get started. This location got a \"B\" rating by the New York Department of Health \u0026 Hygiene. I was really shocked by that, but didn't notice until we got to the top of the line. \n \nMy boyfriend and I arrived at Grimaldi's around 3pm on Friday of Labor Day weekend. I thought that the line wouldn't be so bad because it was before 5pm on a weekday, but I was wrong. The wait was just over an hour (just as other reviews have mentioned). A man runs the line by maintaining a list of peoples seating requests - couple, 3 people, 4 people, etc. If you're going as just a couple, I would suggest making buddies with the couple standing right next to you. The seating is family style anyways and you will more likely than not jump a significant portion of the line as these tables were turned over much quicker. When we got to the front of the line at least 3 groups of 4 were let in before us. And by the way the man is quiet salty so nothing makes waiting in that line more annoying that his constant demands of moving back and tightening up the line like your cattle. I suppose that might be part of the New York experience for the tourist, but to me he was just a cranky old man. \n\nNow to the actual pizza. We ordered one plain large pie (8 slices). (FYI: No ordering by the slice - cash only.) The slices aren't huge and trust me you'll be hungry when you get there. My initial reaction was that the cheese is was tasty and every piece of basil I had made the slice taste amazing. Although I stand by that statement, I think my initial reactions may have been due to my starvation upon arriving. As we continued to eat we noticed the pie was extremely doughy. When we looked at our slices closely there was no char on the bottom at all. We looked to our left and another couple's pie was cooked more thoroughly. I'm guessing our undercooked pie was the result of either the fact that we had no toppings (no extra cooking time) or that they just plain rushed it out to turn over the table.   \n\nI chose 3 stars soley on the pizza. You can get much better almost anywhere else, won't have to wait an hour, and won't have to be treated like cattle. \n\nOne last thing - they have opened up a location in Garden City, NY. I went there with a friend and the experience was much more enjoyable. We walked in and ate at the bar. They have a nice happy hour special of beer and personal pies and those pies were cooked much better. I think the Brooklyn location is overwhelmed by its popularity.", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-29", "description": "Maybe there's better pizza out there but I haven't found it. Best darn pie I ever had until I went to DiFara's.\n\nYou really honestly can't go wrong with a day walking across the Brooklyn bridge (figure it's a 20 minute walk from City Hall),  and getting in line to get pizza here. Just about at all times there will be a line, but it won't take too long if you come during the day on weekdays. Nights and weekends? It could be a while, an hour to an hour and a half.\n\nI'll leave the details of the pizza to the other Yelpers who have it well covered but I'd advise caution before having olives on your pie. It's not that the olives aren't great quality, they are, but their natual saltiness can be a bit overwhelming. Also, if you get extra cheese you won't regret it.\n\nIf you have some extra room after you've had your pizza, split a canoli. They're as good as any bakery's in Little Italy.", "author": "Andrew W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-26", "description": "The pizza is so, so good. The right amounts of both sauce and cheese. And of course that crust with the perfect blend of crisp and softness. Don't bother with toppings (except for some basil, if that counts) -- so not the point. \n\nThe \"atmosphere\" holds zero appeal for me, to be honest... and the folks who run the place remind me of certain family of mine I'd prefer not to be reminded of. \n\nBut the pizza... worth it.", "author": "Cara A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-26", "description": "Stroll by casually on a weekend afternoon and witness the biggest mystery of Brooklyn: an unbelievable block-length line. Rumor has it that at one point in time it was possible to order take out without having to endure the consequences of the unfounded hype, but those times are gone: take-out or sit-down, a long line full of tourists it is.\n\nThe pizza itself is OK. It's not at all bad, but it is no more refined, better-prepared, or gourmet-tasting than my neighborhood pizza joint. \n\nDo not order olives as your topping, because you will be getting the cheap awful kind that consists of black substance, unidentifiable in texture and consisting almost entirely of salt.", "author": "Anna A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-14", "description": "I've had John's, Lombardi's, Nunzio's, Patsy's, yeah, all the places people say is the best pizza in NY, and thus, arguably, the world. (OK Naples, Rome, and Italy, not counting you guys, then again, you don't do pizza like your emigrants here have taught us to do.) \n\nGrimaldi's is still probably the best, up there with Lombardi's (which is also really good in Philadelphia too, by Rittenhouse Square.) Let's say this place is so good, my girlfriend, who hates pizza, liked this place.\n\nBiggest drawback are the huge lines, but, I love the vibe and service. I mean, the place is jam packed, there are always tons of people in there, people are all loving the food, and if you're a loud group, sitting next to another loud group, makes you feel like you're at a neighborhood bar. One time I was standing around, waiting to get to the bathroom, and one of the owners looked at me with that old Italian mysterious squint of his, called me over and told me to follow him without telling me what was going on, (honestly I thought I was in trouble, I had no idea) past the kitchen, to another bathroom no one was using. He smiled, let me in with a flourish of the arm and pat on the back.\n\nMan, I miss those good old days when everybody used to know your name.", "author": "Kevvy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-09", "description": "Everyone is opinionated in choosing their favorite pizza in the city, saying this pizza is better than that and so on.  This pizza is my favorite.\n\nWhat are you doing in my seat, get out of my seat!\n\nHooligans.", "author": "J. G. B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-21", "description": "Absolutely delicious! And likely the best New York has to offer. \n\nNow that all the hot air has been blown, I can't honestly say I'll go out of my way to eat here again. First, there are often lines outside for an hour... (this is pizza folks, c'mon). Second, I feel like the first slice and a half are amazing, but then once the pizza cools a bit, it loses some of its zestiness. The service? I'll give it an - eh. Cash only to boot?\n\nI really can't complain about the quality of the pizza but unless you're in dumbo, you're better off just heading to Patsy's on University for a similar pie, but better overall experience.", "author": "Jonathan Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-25", "description": "Delicious delicious OMG YUM!!!!\n\nIt lived up to all the talk for sure. We had a long day walking in the rain, and crossing the brooklyn bridge, that a slice of this pizza was trully heaven. Now I know what everybody is takling about when they talk about NY pizza. \n\nNOTE: They close everyday between 4-6 to clean and prepare the oven. They do not sell by the slice. \nAlso, Im pretty sure ordering just one pizza for a group wont be enough. \n\nWe had a pepperoni, and olive/ and a Sausage and pepperoni pizza. The sausage was fresh and tasty, REAL pepperoni and buffalo mozzerella. Just enough of a little crisp on the outside and chewy on the inside. For a large pizza $18 , that was the best dinner ever!\n\nFriendly staff, good restrooms, clean and comfortable atmosphere. \n\nNo you may NOT know how many slices I had!", "author": "Jackie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-25", "description": "there are so many reviews that I dont even think I should waste my time.... I will be lost in the shuffle.....So here it is- short and sweet-\n\n\n\nNOT WORTH THE WAIT\n\n\n\nthe end", "author": "Kim B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-05", "description": "Sometimes I think about jumping on the earliest flight possible to NYC and taking a cab straight to Grimaldi's and spending the whole evening there, gorging myself of pepperoni, mozzarella and fresh garlic until I pass out.\n\nGrimaldi's remains my favorite New York pizza joint and with good reason. The freshness of the toppings brings tears to my eyes and the zip of the coal brick oven is heart-wrenching. They're not kidding that it's the heat that makes the difference and no new-construction joint can use that kind of oven these days, so the goodness stays tucked here under the Brooklyn Bridge.\n\nIf you want the taste without the wait, order ahead and skip the line in the summer by getting take-out and bringing it into the park along the river.", "author": "Caitlin G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-01", "description": "OK, OK, so I like Brooklyn now.\n\nIt's so hard to find a nice thin crust pizza in this town.  Almost all the pizza I've tried is so dough-y, it's hard to taste the toppings.  Grimaldi's is a very sweet change from all that.  Lots of gooey cheese, very tasty pepperoni and sausage.  Not too much sauce.  Perfect crust.  Theirs is not necessarily something I will crave, but it's up there on my list of favorites.  I could be convinced to take the train there for the sole purpose of eating a pie or getting some to take home.\n\nTouristy?  Not when we were there (11pm on a Friday), but I can believe that and will take heed accordingly.  \n\nThe neighborhood is really cute, and afterwards, take a walk to the bridge and hang out on the promenade.  Take crazy pictures.  And take somebody to smooch.  I felt a little lonely.  *snif*", "author": "Maria M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-23", "description": "visited Fri night 5/30/08\n\nPizza is the 5th food group according to my husband.  So we HAD to do the Grimaldi's thing even though there was a 40 minute wait in line to get in.  This is not a romantic place unless you call getting squeezed into the middle of a long community table romantic.  And, there's no such thing as a private conversation because it's so loud that you have to shout across the table.  At which point the people all around feel the urge to join the conversation.  (At least everyone was friendly.)  But I digress...\n\nHave to say the pizza was pretty darn good.  Okay, maybe great.  We had no problem finishing a large sausage and roasted red peppers with a bottle of valpolicella.\n\nAnd the place was like a big party - pretty fun after all.", "author": "JJ S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}