{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-12", "description": "Ordered a small pizza... verdict: it was OK. I can say I've had better pizza and I can say I've had much worse pizza. The middle of the pizza was very soggy and had no stability, which is a major letdown for me when it comes to my pizza but the pepperoni was probably the best I've ever had, super fresh and crispy. Overall, I think the hype of the place is what makes it a staple in Brooklyn, rather than actually having really good pizza. I'm wondering now if I made a huge mistake, by not stopping next door and grabbing a pie at Juliana's instead. I guess I know for next time. \n\nNotes:\nONLY SELL PIES, NO SLICES!\nCASH ONLY!", "author": "Brandi P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-22", "description": "One of the best brick pizza I've ever had! The four of us ordered two large pies and destroyed both pizzas to the very last crumb! It was THAT good. \n\nIt was soooo worth the long journey going to\u0026back Grimaldi's, which is an adventure in itself since some subway lines were not operating. Thank goodness I was with local New Yorkers!\n\nThe wait-time is definitely part of the experience. Will I wait in line for 90 minutes again for a slice of pizza? Probably not (but Lombardi is on my list for my next NY trip so maybe). Calling for take-out is a higher possibility for me, but this is one of those things that everyone should try at least once!\n\nI'm so thankful for the friends that waited in line with me (they would have high-tailed outta there as soon as they saw the line). Guhhh, thinking about Grimaldi is making me crave it now. Too bad I'm all the way from the other coast in SF.", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-20", "description": "Hands down, my favorite pizza spot in Brooklyn. Price is great and the pies are cooked to perfection. My friend and I ordered a pie with sausage and jalapeños which ended up being the perfect amount for the two of us. I definitely recommend this place for all age groups. Perfect place to bring a friend who's visiting! Even better with a cold one", "author": "Christina S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-07", "description": "I am not a fan of scattered toppings.  I know this is a famous pizza place but I wouldn't recommend it.  Paper plates and plastic forks, sauces and cheese scattered on the dough and drinks out of a bottle and cans.  Enjoyed the atmosphere and servers, but not the pizza.", "author": "D M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-24", "description": "Waited so many years to come here. It was nothing more than another bucket list of things to do. Line outside was about 20 minutes. Not too bad. The wait inside was extremely long. The place is run down. Pretty dirty and unkept. \nThe bathroom was dirty. Toilet paper everywhere. There was even a plate in the ladies bathroom.  Floors and tables were dirty. \nAs for the pizza... It was bland. No taste. We ordered different toppings and yet it was nothing exciting. I had to put salt and garlic on my slices and I Never put salt on anything. The ingredients were fresh but even so it was not the best pizza. \nAs for the customer service, I actually enjoyed the maître d Ernie. Great and funny guy. No complaints about the service. I won't be back.", "author": "Jess F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-17", "description": "They say they have the best pizza in the city. Well, let's not exaggerate! we have taken different pizza and it tasted all the same - ham or sausage fresh tomatoes-  it had the same taste - if to be correct I would say the pizzas were equally tasteless. For sure when you add salt and peperoncino it tastes like something but definetely I was disappointed. For sure it is a great location and prices are moderate but please, do not say you have the best pizza in the city! \nOhhh ma da quando questa roba si chiama la pizza italiana?!", "author": "E. M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-03", "description": "You can't go wrong with a fresh mozzarella pie! Grimaldi's has its unique touch when it comes to pizza. It's so good that it's always busy. Give yourself a lot of time and bring cash.", "author": "Jamie J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-10", "description": "Had this place in my bucket list as a must go during my NYC trip. Went there with 5 friends there for lunch today. Nothing special. The pizza's were as skinny as a paris model :( I would rather eat little caesar's 3 meat treat for a small fraction of the price! I wouldn't go there again!", "author": "Rolland L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-14", "description": "Debated if we should have given this place  a 3 star or a 4 star... \nReason being that the service wasn't that great. There was an middle aged man sitting at their bar greeting people as they came in and he seemed to be the owner or a main manager, we didn't have to wait at all to get seated. But the server was not as nice, didn't explain much to us and didn't give us change for the bill(so he ended up getting a lot more for tip that he actually would have). They DO NOT HAVE ALCOHOL here!!! So frustrated because all we wanted was a place for a beer and pizza.\nPizza was good, we got small, pepperoni, with mushrooms and it was enough for my husband and me. It was delicious, but we ate something very similar in Long Island city and it wasn't touted as \"world famous pizza\". Either way, nice place to visit if you're in town, want some good pizza, have extra money to spend on tip", "author": "Jasmine B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-31", "description": "We ordered a pizza with half pepperoni \u0026 half white between the two of us, \u0026 we had 2 slices leftover to take home. I can't believe how insane the reviews are for this place, the pizza was good but definitely not the BEST. We were lucky to come at a slow time and only had to wait 5-10 minutes, I would've been really disappointed if we waited an hour like some reviewers did.", "author": "Waverly B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "I had a half pie brought to me at work by two amazing people. \n\nHands down some of the most flavorful, well-constructed slices of pizza I have ever had.", "author": "Adam P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-04", "description": "YUMMMMMMMMMM!!!!!!!!!!!!!!\n\nBest Pizza around!!!! Grimaldi's is an institution, a brand, a name in the pizza game since 1905!\n\nokay so I reviewed there other location in Coney Island and let everyone know how unbelievably yummy this pizza is, so this review is mostly about location and service.\n\nLocation is great.......UNDER THE BROOKLYN BRIDGE.......its a block away from Brooklyn Bridge park (pier 1 and 2), its kind of tricky finding parking in this area, but if your going to the park you can walk from the Grimaldi's to the park or vice versa.  The actual pizzeria is a beautiful white old time building, with huge windows, arches and lots of detail. Its a landmark, has the plaque on it, apparently it was Brooklyn's first safety deposit bank, back in 1869.\n\n\nTHE LINE: everyone says \"look for the line\" and they were rite! There is a line outside for seating and takeout, but I think they do this in order to keep the waiting crowd away from the dinners, since there's not much standing around space inside. Older dude keeps the line moving quickly, waited less than 10mins. \n\nOrdered my \"to go\" pie (we were having a pizza picnic in the park), got a # ticket and back outside I go to wait. Waited another 10 minutes and before I knew it the take out girl was yelling my #.\n\nWalked over to Bk bridge park, got a spot on the lawn, had a spectacular view of the city skyline, near the water, great weather, beautiful sunset and crispy thin crusted pizza with fresh mozzarella, and sweet tasty marinara sauce made with fresh crushed tomatoes.....what's better than that???????????\n\nLarge regular pizza is 14 bucks, toppings are generally 2 bucks. I think this a very fair price, all pies have fresh mozzarella. \n\nCustomer service is good, line dude was kind of strict, but I guess that's what keeps it \"moving\". Didn't feel like I waited long. Take out gal was friendly. \n\nNO CREDIT CARD, NO RESERVATIONS, AND NO SLICES  (and you will have NO hard feelings about all this after trying there pizza!)\n\nDid I mention I think this is the best pizza around???....oh yea....I DID!......LOL", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-05", "description": "I've been here several times and I think this is my favorite pizza in NYC.  I honestly think it tops Lombardi's and John's.  There is always a line basically and it's quite ridiculous.  If you have a party bigger than 2 expect a 2 hour wait.  But if you don't want to wait in line you have two options(don't tell anybody though cause this is a secret):\n1.  Show up before the lunch rush, so you need to show up before 12PM.\n2.  Order take out.  This is tricky cause the phone lines are tied up most of the time.  Also this poses a problem because well...  WHERE DO YOU EAT!?\n\nI think they are the most consistent with their pizza, everytime I have had it it was spot on, I guess that also explains why they're my favorite.", "author": "Kent C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-14", "description": "after things went sour w/ my first love, Lombardi's, I discovered this place. I had my goto spot again for pizza. \nthen they moved, to their current location. \nSigh....", "author": "Henry L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-16", "description": "I spent this past Saturday checking off items from my New York City bucket list. On that list were walking across the Brooklyn Bridge and getting a pie at Grimaldi's!\n\nWe planned it right by going in the late afternoon because it was not too sunny while walking over the National Historic Landmark, and because we arrived at Grimaldi's right between the hours of lunch and dinner. We were able to be seated in 20 minutes, and our pie came out soon after that. While I have to admit the pizza didn't blow either of our minds, it was a solidly tasty lunch/dinner. (linner?)\n\nCheck and check!", "author": "Nicole C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-29", "description": "This place is over rated. I live in New York and tried both Juliana's (next door) and Grimaldi's. Juliana's is so much better- from the abidance to the quality of the pizza. I felt like a number at Grimaldi's. The waiter didn't check up on us and seemed annoyed when we asked for more water. It's crowded, dirty, and you can only pay in cash. The people who work there clearly don't want to be there. When we got our pizza, you can tell the cheese was low quality and the pizza itself was mediocre. It wasn't crispy, the cheese wasn't melted, and there was minimal sauce (missing in some spots). \n\nBottom line, it's a tourist spot that's not worth the visit. They survive on the name and have really cut back on quality over the years. I will not be returning.", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-08", "description": "I did an experiment whereas I ordered a small pizza from Grimaldi's and one from Juliana's, the original maker of Grimaldi's pizza. Keep in mind I had no narrative bias, I really wanted to see which was the better pizza.\n\nAnd the difference was striking. Grimaldi's tasted like supermarket pizza and made me yearn for real NY pizza. I was laying blame on the style of the pizza. Then I went to Juliana's. Interestingly, small pizza with identical \"look\".But that's where the similarities ended. I was blown away by Juliana's Pizza. Every part of the pizza offered a complimenting flavor. The crust was toasty yet malleable whereas Grimaldi's was doughy and powdery. What's the point of the oven if that's how you serve it?\n\nJuliana's cheese was scrumptious and alive with flavors whereas Grimaldis tasted like mozzarella alone. The sauce at Gromaldi's was watered down, at Juliana's it had a rich flavor. Even the basil leaf on the Juliana pizza offered an interesting unique flavor while the Grimaldi's leaf might as well been an ornament. It tasted like  over cooked lettuce.I found a respect for the style of Pizza at Juliana's.", "author": "Hugo F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-11", "description": "Came here on a recent trip to NYC and we weren't disappointed.\n\nThis was my first time eating New York Pizza and I'm glad we chose Grimaldi's.  It was delicious.  We ordered a large Pepperoni, sausage, \u0026 jalapeno pizza.  It was so tasty.  It didn't taste like any other pizza I've tried before.  The toppings, sauce, and cheese tasted fresh and flavorful.  The cappuccinos were yummy as well.\n\nThe server was quick but didn't bother to come back and check how things were.  Maybe he just assumes everyone loves their pizza.  But I still want to be checked on.\n\nThe only down sides: the cannolis  were too sweet for my taste. And they only take cash. There was a large sign saying cash only when we walked in but we failed to see that and weren't told until we pulled our cards out.  Thankfully the other couple we traveled with had cash.", "author": "Natasha A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-30", "description": "Mmmmhm. Such a satisfying pizza! The pizza here is good quality, Italiano cheesy heaven. They have good deals if you don't want a whole pizza. The place is nice, and they are time oriented. Well done Grimaldi's, well done.", "author": "Thomas A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "My friend and I came here on a Saturday after failing to find the ever famous Smorgasborg. Since it was extremely humid, we definitely felt our energy draining as we gave up on our Smorgasborg food adventure. Luckily, Grimaldi's was right around the corner from where we were walking, so we decided to grab lunch and replenish our energy here.\n\nApparently, Grimaldi's boasts as New York City's first pizza restaurant that cooks their pizza in a brick oven as opposed to the stainless steel ovens we all know and love. While I don't know how true that is, I was honestly just glad to put something in my stomach. Since my friend and I arrived there before the lunch rush, we missed the line and were seated fairly quickly on the second floor. It's evident that Grimaldi's tries to maintain an atmosphere that encourages patrons to talk to each other - our server told my friend and I, as well as the table next to us, that \"We're all one big family!\". I thought that was cute - how often do you see restaurants encouraging people to talk to each other??\n\nMy friend and I decided to order a small pizza with half pepperoni and half Italian sausage. When our pizza came, it was extremely hot - fresh out of the brick oven. I couldn't help but be internally disappointed at the size of the Italian sausage. While half of our pizza was covered in this delicious meat, the size of the sausage itself was pretty mediocre. However, I am comparing the sausage chunks to commercialized pizza chains, so maybe this might be the actual size of legitimate sausage, and not some hormone injected mystery sausage.\n\nAfter struggling to cut off a slice for each of us, my friend and I finally dug in. The pizza was steaming hot, with gooey melty cheese and a crunchy crust - just how pizza should be! Grimaldi's gives you a fork and a knife to use for your pizza, and I was almost tempted to do so because the slice was that hot. But then I thought, \"I'm a New Yorker, what am I doing?\" and ate it with my hands. Everything tasted pretty fresh, when compared to all the free pizza I get during the school year, so I was definitely a fan.\n\nWhat prevents me from giving Grimaldi's five stars is the fact that while the pizza comes out piping hot, it quickly gets cold in the center. By the time I had finished my first slice, my second slice was kind of hot bordering on warm. So when I ate my second slice, my third slice was just a little over room temperature. I mean, the amazing thing about pizza is that it tastes good no matter what, but its just a little disappointing not to have experienced the stretchy cheese with every slice. Another reason I won't give Grimaldi's five stars is the fact that its cash only. As someone who hates cash only places, having a cash only establishment automatically makes it harder for me to give you a five star rating.\n\nBut overall, I had a good experience, I'd probably come back if the line isn't normally to Queens.", "author": "Pam K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}