{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-04", "description": "Best pizza in Brooklyn.\n\nCrowded.  Line.  Worth the wait.\n\nWe tend to hit it on a rainy weekday to avoid crowds.", "author": "Jonathan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-16", "description": "This place came highly recommended by various guidebooks, so I dragged my posse over there for a late lunch.\n\nDespite having to wait (as expected) outside, and having snow piles fall off the roof on one of us--twice, we really enjoyed this pizza.  The fresh mozzarella was very different than anything I've ever had, but it was very good.  Highly recommended.", "author": "Jason B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-13", "description": "I went as a tourist, so take my review with a grain of salt, but I really enjoyed Grimaldi's. My friends and I waited about 45 minutes (which I hear is actually quick for this place), and got a pepperoni, sausage and onion pizza. The food was delicious, and reasonably priced. \n\nI didn't understand how the doorman was choosing people to enter though. It kind of felt like a club. Several groups of four got in before my group of three. I felt it should have been first come first serve, especially since we were outside in the middle of winter.", "author": "Marianne H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-27", "description": "I can imagine myself scarfing down 4-5 slices within 10 minutes, just like it was seconds ago. Had my 2nd visit to Grimaldi's with my roommates + roommate's parents. \n\nHeaded on a gorgeous Spring night by walking across the Brooklyn Bridge from Chinatown (~40 minutes). Got in an extremely long line at 8pm, and were seated in an hour at 9pm. Mind you, our party was 7 people so that wasn't bad at all. \n\nOur stomachs and eyes were hungry...I mean really hungry. Every time we inched ourselves a little bit closer to the door, we would breathe in the smell of Grimaldi's pizza goodness. Almost there.\n\nWe sat down finally. Immediately asked the waiter if he was Italian, and he got our hopes down by saying he was Polish. :( Who cares. We were still f-ing hungry. Ordered 2 margarita pizzas (basil + mozarella), 1 veggie (tomatoes, onions, mushrooms), and 1 meat (ham, sausage). Plus two humungo \"jars\" of wine. Classy, just the way we like it. The margarita pizzas were awesome. But, it would be a dream if we could get all toppings onto one pizza (of only they weren't $3+ per topping!) \n\nI left so stuffed, naturally, I had to unbotton the top button of my jeans. We had tons of leftovers to bring back with us. Ahh, maybe I shouldn't have eaten that fast. Too bad.", "author": "Jeanne C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-14", "description": "Coming here after trying pauly G's is going to be a let down. This pizza is plain at best!", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "I've been coming here for years, before they relocated a few steps down. Not not only do I love this place for the historic factor of it but the pizza can not be beat! Original and the best! I always bring out of town visitors here for the true New York style pizza experience", "author": "Mrym K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-30", "description": "We waited in line for more than half an hour...and the entire time I ate there, I kept saying \"I just don't get it.\"\n\nTo me, the pizza was not that delicious.  In fact, it was kind of soggy.  I like my pizza crisp.  I've had better $2.00/slice pizza in ghetto Brooklyn. I just don't get the hype.", "author": "Diana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-01", "description": "Being a CA native, I was used to every New Yorker telling me, the pizza here in LA sucks! After a while I thought it was just trash talk.  Then I decided to give Grimaldi's a try. Man, did I eat crow! It is the best pizza I have ever had.  I would seriously give up my first born for some of that pie!  Or at the least send them on a flight to Russia!\n\nI waited two hours in line to enter a ridiculously packed house with so many people elbow to elbow that I could've eaten a slice off the neighboring table.  We ordered the simplest pizza possible, the margherita with just mozzarella and basil. The crust was perfectly thin and sauce delicious, but not overpowering.  I missed my flight out of town b/c of this pizza and I would do it again!\n\nNow my next question for you New Yorkers - What the heck is a Pizza Hut doing in the middle of Manhattan?!?! And why are people in there!?!? I hope for reputation's sake that the people I saw in there were tourists from Europe (judging by the Daisy Dukes on some of those guys, I think they were, but then again...) I can't even understand why NYorkers would eat in California Pizza Kitchen!  All we have to show is putting some duck or BBQ sauce on the pizza. Fuhgettaboutit! WTF!\n\nAll the girlfriend and I could think about that whole week was that dang pizza.  Now when people in LA tell me they have found the best pizza place, I answer with the only thing that makes sense - Shuddup!\n\nBest Thing -  pizza", "author": "Hion L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-03", "description": "Over rated pizza! I'm born and raised in Brooklyn and this is NOT the best! Customer service is rude, and tablecloth is dirty! If you want good pizza that you don't feel obligated to leave a tip for, try anything else!", "author": "Manuel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-16", "description": "Grimaldi's is the ultimate slice of thin crust pizza I've ever had. \n\nThe day I had Grimaldi's pizza was one of my best days in NYC. I caught the subway downtown so I could walk the Brooklyn Bridge. I got to Brooklyn about 15 minutes prior to Grimaldi's opening and there was already a line of about 8 people (and did I mention that a bus tour also pulled up and was seated before us). I had read so much hype about this place, I thought I have to try it. Little did I realize that I would have to buy an entire pizza for myself as they don't sell by the slice. \n\nDidn't bother waiting for a table inside, despite the heat. I decided to take my pizza and sit near the waterfront. As I opened the white package I could tell that this was going to be a great pizza - fresh buffalo mozzarella, basil, pepperoni. My first bite of pizza put me in pepperoni pizza heaven! yum, Yum, YUM!!! The sauce was perfection, there was just the perfect amount of cheese and pepperoni. \n\nNeedless to say I wasn't able to finish an entire pizza on my own, so I shared it with two NYPD officers, who were coincidentally sitting in their car with the a/c on and finishing their own pizza. I then walked back over the bridge with a smile on my face. . . ahhhh good pizza!", "author": "D S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-14", "description": "Never get the black olives. They were so salty that i could barely taste the actual pizza itself. And the service was horrible", "author": "Clara C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-02", "description": "One of the most awesome pizza spots in NY. Make sure to hit the Ice Cream at Brooklyn Bridge Park. Avoid peak eating times and you won't have to wait.", "author": "Rob M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-23", "description": "I'm currently training for the Avon Walk for Breast Cancer, which will see me walk 39.3 miles in two days .... so I'm walking a lot every week, with endurance walks on the weekends.  So far, several friends are joining me for some of these, and this one was no exception.  I had to log in a 6-mile walk, so I organized a group to start in Times Square, walk down the west side Greenway, then over the Brooklyn Bridge and down to the waterfront.  We ended 6.3 miles on line at Grimaldi's....\n\nWe figured we earned the pizza.  And after hearing so much over the years about how great it was, and seeing the lines, we figured we were in for pizza heaven.\n\nWas this the best pizza I've ever had?  Far from it.  Not to say it was bad, but it was rather bland and not terribly memorable.  The waiter was VERY memorable - he was adorable and charming and flirted shamelessly, and was definitely the best part of the meal (along with sitting down, after 6.3 miles and an hour's wait).  \n\nMy best pizza ever was Vinnie's on the West Side, a lovely hole-in-the-wall institution that unfortunately no longer exists..... *sob*\n\nIf you don't have to wait long for it, this might be worthwhile, but I don't think I'll be back.", "author": "Philine V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-14", "description": "Genuinely good pizza but not worth the wait. You should go there once to weigh in on the Great Pizza Debate, but thats about it. The pizza is good, but like so many things in New York, its mostly hype.", "author": "Jaimie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-12", "description": "A long wait lead you to a great pie.  \n\nBeware of tourists.   Come here before you're hungry.", "author": "Glenn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-27", "description": "It's really good. People hype this place up too much. It's definitely good. 3-4 stars for sure.", "author": "John D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-22", "description": "Better than average pizza. Not really sure what else to say lol.", "author": "David T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-06", "description": "I must preface, I'm from California so most pizza in NYC is amazing to me (EVEN the late night munchie pizza that you get at one of those awful hole-in-the-wall-spots next to the bars). So, I love this place. I've been here a couple of times, and have loved the basic pizza with extra basil. \n\nYES, there is a long ass line (which I have braved in both the bitter cold AND rain), NO, there are no bells and whistles, YES, if you forget to grab some cash, you will pay $4.50 at the ATM right outside (how is that even possible?!?!)....but the've got a heavy pour on the house wine!\n\nHey, everyone has their opinion on what is \"THEIR\" best pizza spot, and this one is great for sure and worth checking out, even just once!", "author": "Candice C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-09", "description": "Very tasty pizza plus the house wine and the evening has just begun. We had lots of parties here.", "author": "Michael F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-27", "description": "Got lucky and didn't have to wait. A line would bring it down to 3 stars. Great pie, not worth standing in a crazy line though.", "author": "Jason F."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}