{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-05", "description": "Had a little wait and when we were finally seated I felt a strong draft coming from the window (happened to be 17 degrees out). I asked if we could move our table and they moved us instantly. Pizza was delicious. Service was great! So glad I finally made it", "author": "Anais V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "I got there at 5:30 on a Saturday and the line was only about 15 min long, though it took 40 min for them to bring us pizza after we ordered. \n\nReally great thin, fluffy crust, with fresh tomato and cheese. And by thin I really do mean thin - by the time the pizza cools, the crust is pretty much soggy from the toppings. This is meant to be eaten right after ordered. \n\nAll in all, it was a very good pizza - I'm just not sure it merits the long wait times and all the hype.", "author": "Audrey Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-07", "description": "The pizza is great but the service is very disappointing. A friend and I went on a (sort of) snowy Friday afternoon and there was no line. We got seated immediately but then sat there for an hour watching everyone around us get served, eat, pay and leave. Our server took forever to take our order and then never came back to check on us, which would've been helpful since apparently the kitchen lost our order. I realize Grimaldi's is an iconic eatery with enough tourist traffic to ignore customer service, but there are plenty of other options with equally (and even more) delicious pizza with good service for locals.", "author": "Lizzie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-10", "description": "Grimaldi's is famous for their coal brick oven, made on the spot with whatever toppings you'd like hand crafted pizzas. I ordered a small pizza, perfect for two with Italian Sausage and Oven Roasted Sweet Red Peppers. Delizioso!\n\nVisit my blog http://simplypamarie.com/2014/07/02/grimaldis/ for further details and pictures!", "author": "Pamela G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-24", "description": "Grimaldi's used to be good back in the day.  Not so much anymore once they changed locations and ownership.  Skip the long, tourist trap hell of a line and hit up Julianna's, which is literally 3 store fronts over.  You will not regret it.", "author": "Jonathan T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-28", "description": "Average pizza, only 3 ingredients and everything you want to add is extra. Service is what you expect from a fast food food place nothing special really. Most important they only take cash so if you're in a hurry you'll have to use the ATM they have inside which will charge you 5 box. Not terrible but I would not go again.", "author": "Maria Alejandra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Best pizza I've EVER HAD in my life. PERIOD. The prices were reasonable, especially for being New York. The pizzas are big and truer to their Italian origins than many other popular pizza places. The quality of the crust and sauce were amazing and the whole place is kinda neat. Would gladly come again!", "author": "Corey N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-27", "description": "There's always a line outside, but I got lucky one Sunday morning. Instead of going to the normal smorgasburg, I decided to wait on line for 15 minutes to check out  Grimaldi's new location. Surprisingly, the whole pizza ordeal with waiting, ordering, and eating only took 1.5 hours (which is about what I'd expect if they made it fresh).  Since we were one of the early ones on line, we got the first batch of seating. If you ever miss this first set, you should probably just give up because you'll be waiting another hour to have the pizzas made, eaten, and checks paid.  I think there's a paper about this somewhere that talks about wait times at restaurants around peak hours.\n\nAnyway, the best idea is to call in and get the pizza to go. Eat it in the park and make everyone else jelly. You could probably sell a slice at Smorgasburg if someone's desperate enough.\n\nWe got a pepperoni pizza pie and ate 4 slices each. I don't mind to admit it when I'm a piggy. When you wait 30 minutes to get a seat, you might as well get a large and indulge in the stewarts black cherry or rootbeer. \n\nThe pizza itself. Still awesome like the last time. I'm sure most of your complaints will be about the wait. If I had the time to kill, I'd defiintely do it. In fact, this would be a great date spot so you can see which girl is patient enough to take the time to wait for a good thing. Or... which girl really loves pizza. Both are wins in my book.", "author": "Clemens W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "Great pizza, the wait is killer especially when its hot but its so delish.  You can probably get similar pizza at say Patsy's with less of a wait but its worh it to try this place.  I love that its so close to the water so when you're done, you can walk around and explore Dumbo (and work off the pizza).    \n\nWe waited at least 2 hrs in line (give or take a few min) but the crust, cheese, toppings were all very yummy.  Try it for yourself but if you're into coal oven pizza, you'll enjoy this place.", "author": "Chevon B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "Heard about this gem based on reviews online and decided if I was in Brooklyn, I must check it out! \n\nBusy restaurant, with lots of notable celebrity visits on the wall. The food is known for their thin crust pizza and hot-stone oven. We ordered the basic (mozzarella and tomato sauce with basil) and added extra basil, mushroom, and salami - so good!! It's simple, tasty and has amazingly fresh flavour. \n\nPrices we're affordable and there was no line-up to arrive. However, it was in the middle of a Friday around 3PM. \n\nOnly downer was that they did not have a liquor license and a beer would have been divine!", "author": "Tamara B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-31", "description": "After meeting up with a friend in NYC she highly recommended having lunch at Grimaldi's as she reckons this is the best pizza in town. We planned our day accordingly and walked the Brooklyn Bridge from Manhattan and then headed to Grimaldi's.\n\nThere was a line down the road for this place and we made the mistake of not asking the people at the front how long they had been lining up. We joined the queue and waited over an hour to get to the front. \n\nThe wait was worth every bite of their pizza. We didn't order anything too fancy and kept it simple with the basics and it was an amazing pizza. Super sized and could feed a family. I'd recommend going here at least once to experience the quality and size of the pizza however go early as the wait is deadly.", "author": "Andy M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-29", "description": "Kind of a tourist trap!  The pizza was good but was it good enough to wait in line for an hour? At this point...I'm not really sure. There are no slices here...I just wanted to try the pizza but was forced to buy the whole pizza...luckily I have a fridge in my hotel room...I've got pizza for the rest of the week.  The crust was fantastic on the pizza...the coal burning oven just rocks.  I'm glad I tried it but I would not go out of my way to return here.\n\nGood people watching!  Guy running the front door was funny.  He had to keep busting on tourists. People would try to scam into the resturant...after walking past the line outside. Yeah because 60 people standing outside a pizza joint is normal in every country.    \n\nOh yeah bring cash too...no credit cards! Take that Uncle Sam!!!\n\nSo to recap! Fun experience but would probably never do it again!!!", "author": "Anthony M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-15", "description": "Excellent pizza, worth waiting 2 hours for a pie- absolutely not. Want the same pizza without the wait go to Staten Island or Hoboken. \n\nExactly the same thing- but I get it-\nIf ur visiting NYC as a vacay- and u want authentic pizza waiting in the line is worth it. My fav: the ricotta cheese white pizza", "author": "Jamil S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-25", "description": "Good pizza but pricey. I would say ok.  we came early so luckily we were the first ones seated upstairs. I would say that the place is overhyped. But the building is very cool and the staff was friendly.  It did stay packed the whole time i was there so they must be doing something right.", "author": "Janet D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-17", "description": "Waiter didn't say a word to us. We had to ask for drinks other than water. Pizza was decent and came out fast. However after finishing our meal we saw a mouse running under the tables. Waiter didn't seem to care.. poor experience.", "author": "Jake M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-25", "description": "First time trying New York style pizza and I was not disappointed. This is definitely a place I would eat at again when visiting Brooklyn.", "author": "Jason S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-08", "description": "Seriously the best pizza I've ever had. We ordered a large margherita pizza and a large italian sausage between 5 people. We were quite satiated after having the two large pies but decided to try the white pizza, since it was our first time, and it was well worth the gluttonous experience.\n\nThe pizza here is pretty amazing. And I would have this on a weekly basis if it wasn't so far away. Maybe I'll have to try the Hoboken locations and see if it compares.", "author": "Jaclyn G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-16", "description": "Came here before they renovated the place. Great pizza, crispy crust and the wait was definitely worth it. Came here after they renovated the place... great pizza, crispy crust, no more wait and a bigger and cleaner facility. I love Grimaldi's!", "author": "Belle L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-14", "description": "One of only a few coal oven pizzerias in NYC, the famous Grimaldi's is one of my new favorites. They don't try TOO hard and they keep their roots. Pizza is EXCELLENT for this style. It's simple, traditional pizza. Tip: Just get a size Large as it's only ~$2 more than a medium. Can't go wrong here. I took my wife here for Valentine's Day as we live in the neighborhood. Simple, fun and yummy.\n\nVisited February 2013", "author": "Arun J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-19", "description": "Come here within 30 minutes of opening, and there will be no line awaiting you. I have to say Grimaldi's is a bit better than Lombardi's. But they come pretty close in competing for authentic Italian pizza.\n\nThe ingredients were fresh. But I still recommend the regular Mozarella pizza. It's thin, cheesy, and dry on the bottom. Win!", "author": "Angie K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}