{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-26", "description": "Paper plates, disposable plastic cups, cash only, and no alcohol.  The pizza was just okay, but we did enjoy our tartufo for dessert.  Our local Grimaldi's is much better and this location was a disappointment.", "author": "Jim K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "If you are looking for the best pizza in Brooklyn Heights, this is it. The menu is very simple, and the pizza is perfection. I've been to this place 3 times, and is where I always take anyone who's visiting Brooklyn for the first time.\n\nAfter dinner, I recommend heading over to Brooklyn Bridge Park for a great walk, and taking in the beautiful views!", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-06", "description": "(YC2017, 74/100)\nSome of the best pizza I've ever had!  We were surprised there was literally no wait when we came here one night and were seated upstairs immediately.  You can watch the magic of the pizza making happen on the first floor right in front of everybody.  The staff here is a little brash with that whole stereotypical NY-personality, but they get the job done.  \n\nWe ended up ordering a large White Pizza with +Chicken and Sun-Dried Tomatoes.  The toppings are added individually and will cost you ~$2-$4.  If I were to make one recommendation, it would be to get the WHITE pizza.  I've had the red as well, and although it was good, the white was amazing!  The pizza only took about 10-15 minutes to come out and it was so good - the slices were large and the crust was thin but had a bit of chewiness to it.  The mozzarella cheese was very prevalent and the toppings we chose went perfect together.  Sharing this pizza among two people, there were about three slices leftover, so I would say one large pizza could feed three people.  We also ordered the Cannoli, and we did not like it at all.  It was way too creamy and the cream was a bit rough in texture.\n\nThey weren't kidding when they said Grimaldi's had the best pizza in the NY.  For me, they even took the crown for the best pizza anywhere!  Great quality at a fair price - would recommend.", "author": "Jeff T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-20", "description": "Despite being 14 degrees out, there was a line outside.  Not enough room for a line inside, it's tight.  \n\nAfter a bit of a wait and the loss of an extremity or two, we went inside, looking forward to stabilizing our body temperature along with that authentic Brooklyn pizza.  It was unexpectedly cold inside, and we were seated next to a drafty window that enticed us to leave our coats on.  Almost as cold inside as it was outside.  We were told that, since it's a historic building, they were limited in what they could do to weatherproof it better.  \n\nWe decided on two large pizzas for four people.  It seemed a bit much, but we wanted the variety.  We suspected we may wind up with some extra, but a large is only $2 more than a small. \n\nWhile we waited, one of our party noticed other pizzas being brought out with a darker or charred crust.  He was able to catch our waiter and request ours lighter.  Good call for us, but YMMV\n\nOkay, I had this review pending / started, and I'm stopping it right here. Pizza was good, but they were just closed for health violations.  Two stars:  one star rating for the health violations, bumped up to two stars because I didn't see any mouse droppings on our pizza, but wasn't looking for them, either.  YUCK!\n\nhttps://ny.eater.com/2018/1/17/16900786/grimaldis-dumbo-temporarily-closed-department-of-health", "author": "David I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-15", "description": "The pizza here is to die for! Everything from the cheese, sauce, pepperoni, and sausage were delicious! As close to perfect when it comes to a pizza! I will definitely be coming back here in the future!", "author": "Victor V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Let me start out by saying I'm from Michigan and prefer thicker crust pizza. This pizza is by far my favorite thin crust pizza in NYC or East Coast for that matter. Way better than the over rated Pepe Pizza in New Haven, Connecticut. The sauce is extremely flavorful and makes it. It is coal fired and NOT burned at the bottom. It has a nice chew that is super. I love this pizza! Excellent. Plain small pizza is $14 we got three toppings: Meatball, Black olive and roasted sweet peppers for $21.", "author": "Lee T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "2PM Saturday afternoon and there was no line. I waited for quite long for our pizza to come out--I guess around 25 min. But what came out was probably the best pizza I've ever had. Fresh tomato sauce and mushroom, gooey cheese filling, delicious pepperoni on a perfectly baked thin crust--altogether they make a great pizza! The freshness of the taste really was impressive. And the brick oven truly makes a difference! A small pizza ($16) with two toppings ($2 each) easily fed us two (but we are no ferocious eaters).", "author": "Leila L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-24", "description": "All hype with no substance. We ordered a margherita pie to go since the line for dine in would be hours long. The wait time for the pie itself was 20-30 min. Other pizza establishments that specializes in pizzas with coal/wood brick ovens takes about 10-15 min, and that's during peak times. The dough of the pizza was slightly above above average. It doesn't have the air bubbles in the crust and pie itself, almost as though the dough wasn't given enough time to rise. The mozzarella-- we expected only the best ingredients and the mozzarella didn't taste fresh. Lastly the sauce-- the sauce I felt could do better with having mini chunks of tomatoes, instead it was tomato purée.  \n\n\nWas this pizza absolutely terrible? No it wasn't. But would I wait in line for hours for this? Absolutely not. If anyone is in Atlanta looking for authentic Neapolitan pizza, try Antico.", "author": "Chi N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-06", "description": "Cash only, no slices, solid pizza, average service and friendliness, and full of tourists (like myself)\n\nPizza toppings are what would you expect from typical pizza place. Don't expect prosciutto, goat cheese, balsamic glaze, or anything what one may consider non typical (or modern) topping.\n\nDough is solid. Crispy on the outside and chewy on the inside.\n\nWait isn't that bad for a small group of 2-3 people.\n\nBut the host (owner perhaps?) isn't the most friendly person. More like \"You! How many? 3? Seats at the bar. Go grab them.\"\n\nStaff is more friendly than him.\n\nOverall, solid pizza, typical toppings, long lines partially because of tourists, and average service.", "author": "Elliott W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-18", "description": "Made a trip out from NJ to BK one day and decided to make a pick up order. The lady asked me what I wanted and i asked how many slices is a large and she replied rudely 8. I told her I wanted a large plain pie. She didn't ask my name and said 30 minutes and hung up. I get there, and the nice security guy directed me to a Sandra-Bernhard looking woman. I gave her my card and I asked I ordered a personal pie (honest mistake on my part) and she replied with the BIGGEST attitude we don't do that. I said sorry I meant a large plain pie. She asked my name three times throughout this convo too (not that hard, it's Michelle) and I said I ordered a pie 20 minutes ago and she asked if I called the right place and tried to brush me off. I told her the number and I had the right one (just like I thought). Lady went oh guess you did call. And told me my order will take 20 minutes...so I sat there and decided to write this review. I'm all about women empowerment but this lady was straight up a b****. (Can't also help but think you kept assuming I didn't understand English because I'm Asian..repeated things as if I were dumb) I probably won't be a patron of this establishment again...unless she's gone. \n\n Baker must have heard our convo, because pizza came out in five min and she gave it to me.\n\nPizza was cool though. However this experience has definitely made me more biased..never thought it spectacular but now it's closer to the average end. I honestly wouldn't recommend this place to people unless they live in the neighborhood.", "author": "Michelle I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-03", "description": "Super rude staff. They absolutely don't know how to speak to customers! Or they are probably plain racist!!\nBtw.. if you are coming here with a kid, please note that they don't allow strollers inside! You will have to leave it outside the place. (Soooo weird!!!)\nCompletely agree with other reviewers about the pizza!! Its just ok! Not sure why it is so hyped! \nAlso, they accept only cash!! All in all, not a very pleasant experience. Will probably not come back here. Especially the Brooklyn one!", "author": "Srishti G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-29", "description": "Meh. That's how I felt about my experience here. Especially considering the wait, I felt that the pizza under delivered, almost entirely because it came to our table cold. Also, despite it being 0 degrees outside, we were pushed out of the restaurant while we were waiting the 5 minutes for our Uber to arrive. \n\nI am guessing our experience is not the standard here however we will not be returning.", "author": "Brandon K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-25", "description": "I ended up at grimaldis because juliannas next door closed early for christmas eve but it wasnt bad ! There was a pretty long line outside the restaurant so that says something about it! \nMy boyfriend and i got a \"small\" (but honestly not really small i was stuffed after a slice of pizza each slice is as big as 1.5-2 regular slices in california LOL) regular pizza with sausage pepperoni mushroom onions and garlic. The toppings were  2-3$ each pretty hefty price... I dont think the $30 i paid for the pizza was worth... hence the 3 stars. But the food tasted pretty good, toppings were flavorful, my boyfriend loved the cheese on the pizza and service was good as well. This is the only pizza place ive tried in NY so far and maybe it really is alot better than other places, i just dont know yet. Maybe ill update the stars on my review after trying some other pizza places.", "author": "Aileen L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-07", "description": "Okay this place is overrated. I've waited about an hour on line, once I got in I waited an additional 45 minutes for my pizza to come to me. It wasn't even all of that anyway. It was average. OVERRATED.", "author": "Shenia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "This is by far one of the best pizza places I've been to in my entire life. We got one original and one pepperoni pizza and they were absolutely perfect. The crust is just the right thickness and the ratio of sauce to cheese is spot on. They use a brick oven to cook them so they get that nice char on the edges of the crust. The place is also super friendly and cozy. We were greeted by the owner as soon as we walked in and had a great conversation with him about the place and where we were from. A very nice guy and a great place to hang out. I will definitely be coming back.", "author": "Nate C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-18", "description": "The line was too long on juliana pizza, so i decide to try this pizza instead for quick bite.\nThe pizza look really good, but the taste and crispeness didnt match my expectation.\nLarge pizza with black olive was 19.00..\nThe bottom of the pizza was burn, and i dont know if the fire was too high to  cook it quick or something else...", "author": "Hicham M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-10", "description": "Sorry, but this is bad pizza.  Thin, soggy, flavorless crust.  I don't know how \"coal-fired\" became a thing but I'm not into eating anything that has  a \"coal\" flavor.  Wood-fired, sure. Coal?  No way.  This place might have been good back in the day but not worth any kind of wait.  Go next door to Juliana's or find Roberta's.  It does get two stars for super-friendly staff.", "author": "Mark B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-14", "description": "We went at 730 pm on a Saturday night expecting a long wait. Nope walked right in got a prime location table to ourselves. The music was 70, classic rock was great. The waiter was amazing. The pizza was absolutely delicious. What a great experience.", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-20", "description": "ITALIAN BORN AND RAISED HERE. \nSHOCKED! I thought this was supposed to be good Italian pizza, similar to Juliana's next door. I am Italian, and I brought my sister visiting from Italy here. \nI couldn't be more wrong. This pizza is NOT Italian, and doesn't taste at all like brick oven pizza. They don't even use mozzarella, but chemical cheese compost. 7-Eleven pizza tastes better, and I am not joking. \nBesides, they don't even serve beer, and it's cash only. \nDid ownership change or something? I was speechless.", "author": "Pat C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-24", "description": "Grimaldi's stands out as one of NYC's best pizza options and NYC pizza is the best in the USA!  It's pizza, so I'm not here to tell you what to order.  Just make it a traditional thin crust and put on any toppings you like or just go with cheese.\n\nBut I want to alert people who read this review that Grimaldi's lays at the doorstep to one of the coolest things you can do in NY whether you are a tourist, a native or a transplant.\n\nPlan your Grimaldi's dinner to be completed just before sundown.  Grimaldi's is located under the Brooklyn Bridge approach and you want to be walking across the bridge when the sun goes down behind the Manhattan Skyline.  It's fabulous, photogenic and you won't likely forget having done it.  Pick a good day.  Not too hot or cold, not too windy... and then, eat a pizza pie at Grimaldi's and take a hike across the bridge at sunset.  \n\nYou can thank me later.  : ~ )", "author": "Doug B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}