{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "Definitely in my top 5 pizza places after our visit last night. \n\nIt's up there for me with Goodfellas in Staten Island and Enotica on Court street. \n\nDefinitely will be coming back.\n\nFriendly staff, very fast and courteous.\n\nRemember... Cash only!  Atm available. \n\nThanks guy!!", "author": "Belan V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-23", "description": "Every good New yorker,and tourist is always dieing to try this place out, definitely lot of hype. I dont know it was great pizza, but not the best I ever had. Came here last night for dinner. Got soo lucky no infamous long lines like other yelpers mentioned. We got seated in the very back facing the wall. No biggie we were just happy we got a seat. Not two mins in, a waiter comes along asking if there were three of us. To which we replied just us two. He makes really stupid skeptical face saying well if they get more pple in they will have to take our other half of the table. Its not like we wont let them, but was it really necessary to run up to us, and say that just as we sat down. First thing that threw me off for the night. \n\nA few mins later another waiter came to take our order. Menu is very straight forward with few selections, and cash only! We decided on the a large pizza with olives and mushroom. I didnt like that waiter really didnt have any emotion. Its like he didnt want to be there. I will say pizza came out in record time. Less than ten minutes. This time this waiter was smiling. I will refer to him as tall guy with the hair bun.  Pizza tasted great! That think crust of theirs' is unbeatable. My only complaint are the olives way too salty. Yes, menu did say salted cured olives. It was just too overbearing. I had to pick them off when I had my second slice. \n\nWe finished our meal and wanted the check. None of the waiters were even looking in our direction. Service is really bad. Not once did anyone check on us after we got our pizza or even refilled our water. Tall waiter with hair bun came to rescuse. My husband was able to make eye contact him. He quickly wrapped our leftovers, and brought the check. He was very attentive and friendly. Rest of the staff was awful. Espically that young punk. Noone even took that table next to us. Overall, nice decor of the restuarant. Very rustic and old school Italian feel to it. Pizza was great but not the best ever. For all the hype bout this place expected something more. Service needs some improvement. Place wasnt that crowded that no one even refilled our water glasses.", "author": "Sofya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "Cash only. No slices. No reservations. \n\nThats important- cuz i carry no cash \u0026 there are no convenient banks in the vicinity. They have a lovely ATM that charges $5 so u can access your money. \n\nThe pizza was delicious tho. Fresh mozzarella, fresh basil, thin crust. Sooooo good. Not ur typical NYC pizza slices thin. \n\nIf u take a pie to go, dont expect a pizza box. Pie is on a round carboard \u0026 they slide it in brown paper envelope...? Its a bit awkward to walk around with it but it worked. I dont know how it would hold up in rain...\n\nI would return. Very flavorful and fresh.", "author": "S D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-09", "description": "Pizza was good, not sure what all the hype is about. If you're walking the Brooklyn Bridge then stop in, but it's not worth a special trip, neither is the service which is why I gave it 2 stars. But what do they care what rating I give them or what service they provide? There's a line out the door, all tourists wanting to taste the famous Grimaldi's.", "author": "Michele K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-25", "description": "Really good pizza! We got the traditional: red sauce, mozzarella and basil. Added mushroom. Cheese and crust had great textures. I generally prefer thin crust and this one is just a bit thicker than what I like.\n\nThe wait wasn't too bad: 30 minutes at peak lunch time on Memorial Day weekend. \n\n$16 for a large pizza is a steal anywhere... For a good one, unbeatable! Try it once...", "author": "Raj S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-16", "description": "I've been told that there are places out here that serve awesome pizza without the long wait. But I still had to visit Grimaldi's because it's Grimaldi's. \n\nThe wait outside was about 45min. They let us cut to the front since we were a party of two and okay to sit at the bar. The wait after ordering was another 30min. We were so hungry, the two of us split a large (3-4 people) and killed it. Water never got refilled. The host made me laugh though because he reached for my bicep and asked if I work out.\n\nWhat's this I hear about artichoke pizza though?", "author": "Sheila D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-19", "description": "I came here with family that were visiting from overseas \u0026 after walking over the Brooklyn bridge we needed something to eat. I set the expectation that the line would probably be huge, but to our surprise there was no line so we practically ran to the front door! (It was a weekday in December). \n\nWe ordered a large pizza \u0026 shared it between 4 of us. As it was lunch time this was just the right amount, 2 large slices each. We opted to add 2 toppings, ham \u0026 mushroom. The pizza was delicious! It had a thin base but wasn't too crispy and it was full of flavor. My relatives said it was the best pizza they had ever had! \n\nThe decor is casual, it was cool to see the photos of stars that had visited in the past. The tables are a bit close together so it is a bit of a squeeze, but I would definitely return here if in the area \u0026 if there was no line..", "author": "Lynsey H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-09", "description": "There was a bit of a line up outside but it was completely worth it. The pizza was amazing and lived up to the hype!", "author": "Melissa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-22", "description": "The one and the only . This is the location you want to visit when crossing over the Brooklyn Bridge! Pizza service all excellent a small is more than enough for two", "author": "Dan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-10", "description": "We waited all of zero minutes to dine at Grimaldi's, and that's possibly the reason why I'm so pleased with this place.\n\nDuring a snowy (if not a bit blizzard-y) evening, I can understand why none of the tourists braved the cold. But us, we're a different breed of tourist.\n\nSo we faced the snow (which later became heaps of rain) to test out the pizza. Verdict? Delicious! The regular-sized pie (on which we added pepperoni) was sufficient for two relatively hungry adults. The sodas were offered in a 20-ounce bottle, which was a nice reprise from the poorly mixed fountain drinks.\n\nService was fine and the decor I couldn't care less about. All in all, happy that we faced that snow.", "author": "Adena B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-11", "description": "Well worth the hype. \nI went on a rainy weekday and was seated immediately!\nI had the tomato based pizza with sausages and bell peppers. The pie crust and toppings were cooked to perfection.", "author": "Remey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-20", "description": "it was my first time in this location, and i have to said that it was all worth it!!! we came from the bronx and after 1 hour 30 minutes we arrived!! the crust is thin and the sauce very good.\n\ni will definetely come back!!!", "author": "sheyla v."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-03", "description": "We were actually looking for Julianna's (next door), but had the bad luck to get a little bit lost, and not arrive until 3:30 - Julianna's closes for a short while at 3:15 to re-stoke the fires for the pizza oven. We were hungry and not willing to wait, so we ended up at Grimaldi's. No line at 3:30, and we were seated right away. Unfortunately, we were also there at break time for the waitstaff, so though the pizza came quickly and I certainly wouldn't call us neglected, we did eventually hunt down our waiter to pay the tab on our way out.\n\nMy traveling companion reports that the food quality is much the same as the location in Dallas (I do not recall having eaten at a Grimaldi's before). I suppose there is something to be said for dining at the original location, but we were looking for something unique to our New York experience, and though the pizza was good, it wasn't \"pilgrimage to the motherland\" good. \n\nThe toppings were very good, toppings and cheese had nice coverage, and though it was foldable-thin, the crust was still a bit thicker than I was expecting. Be aware that beverages are not free-refill fountain drinks; if you order a soda, you are going to get a can and a glass of ice.\n\nCash only.", "author": "Amanda M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-25", "description": "Was here today till 6:40 PM and it has already started pouring. My friends and I were standing outside on the side of the stairs waiting for our Uber when the manager of this location (tall, caucasian guy) said \"You cannot stand here waiting. Go to a Mexican restaurant and wait for your Uber there\". He didn't care how hard it was raining and pushed me on my left shoulder and out to the rain. He was very rude and it's unfortunate that this is how they treat paying customers. :(", "author": "Dave D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "Yes it is that good. Done deal. As anyone who loves pizza knows: sauce and dough is everything. They guys have mastered sauce abs dough. \n\nTo much cheese to make it really on the authentic side but come on... Who's going to complain about too much cheese, Buffalo mozzarella at that.", "author": "Bart A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "First thing - It is cash only. There is an ATM inside the restaurant.\n\nWhile strolling under the Brooklyn Bridge, we noticed a long line waiting outside a pizza place. As it has already become my second nature, I instantaneously grabbed my cell phone and checked their reviews. Their good reviews drew us to this place and we waited in a long line for about 45min to have their popular pizzas. \n\nBeing a hot sunny day, it was a bit treacherous waiting outside. Anyway, we were called soon enough and took a seat. All the pizzas come with tomatoes, cheese as the base. The small pizzas are $12 and the large pizzas are $14. One can add any number of toppings to the pizza. More of the toppings are $2; a few toppings cost $4.\n\nThey don't give slices; you just have buy a whole pizza. My husband and I ordered a small pizza and we added mushrooms and pepperoni toppings. Soon, our oven hot pizzas arrived and god, I really understand why people go crazy over their pizzas. They were soooo yummy. The thick layer of mozarella cheese on the pizzas is to die for.\n\nThere is only one reason why I have to knock off one star - Although there is ample space inside the restaurant, they wittingly make people stand outside to attract crowd. I hate that. The weather was scorching and I just think it is an inhuman act.", "author": "Anu M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-20", "description": "Overhyped and touristy. \n\nAfter all the hype around it we finally decided to try the place. About 30-35 mins long line outside of the place. Once we were seated the server did not show up for at least next 10 mins.\n\nService was really sub standard and slow. We got the Pizza about an hour after we placed the order.\n\nThe food was good. I would give 4 star to the food. Not the best Pizza I ever had but better than many others.\n\nThe place does not accept Credit or Debit Card. There is an ATM machine on the second floor but it's a rip off. They charge around $4 for the ATM fee.", "author": "Saurin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-01", "description": "Grimaldi's has excellent pizza but does not get a four or five star rating because of the run-down ambiance, service, and most importantly the lack of a liquor license. The fact that the place is cash-only which is kind of a pain.\n\nI must say that the pizzas we had were on point. Three of us shared two small pies: one red pie with oven roasted peppers, pepperoni and mushrooms and one white pie with Italian sausage and ricotta cheese. \n\nBoth pies were good but the red pie was head and shoulders better than the white. The white pie has no sauce - only mozzarella and garlic. It was a bit on the dry side, but it had a nice cheesy garlic bread taste. On the other hand, we were very pleased with the red pie. The red pie had just enough sauce - not too much but enough to give the pie a great tomato flavor without making it soggy. The roasted red peppers were an excellent topping choice, and the pepperoni tasted better and seemed to be of higher quality than the dog-food pupperoni you find on Domino's/Pizza Hut pizzas.\n\nThe crust/dough at Grimaldi's is good, elastic with a bit of crisp. The mozzarella was creamy and you could tell it was fresh. The other ingredients tasted fresh, too.\n\nThe bill was around $45, which I thought was a tad-bit on the expensive side but not unreasonable. The service was not great and the place was a bit gross inside. Glass bottles were strewn around the place and the waiter kept coming over to us and knocking on a window that was behind us to get the attention of someone downstairs. We had to ask twice to get our waters. There is also no liquor license, which was a bummer because the pizza would have been that much better washed down by an ice-cold beer. \n\nI will definitely come back here because I think it is probably one of the better pizza options in Brooklyn. However, the lackluster service, cost, sub-par white pie and lack of liquor/beer options eliminate the possibility of an elite Yelp rating.", "author": "Nicholas A R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-11", "description": "Hands down the best pizza I've evera had!!!  Get there early because the line can get long.", "author": "Ricky R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-22", "description": "Good food? Great hot fresh pizza made to order!\nGood service? Very helpful, but be prepared to wait for seating\nGood atmosphere? very touristy\nWorth the price? 100%\nWill we go back? YES.\n\nMy boyfriend had been talking about this place since he had a work trip to NYC 4 months before our trip. I didn't really buy into the whole \"best pizza ever\" deal he kept saying, as I think all pizza is great. However, I almost ate an entire large pizza to myself.\n\nThe line out the door is a good indication about how great the pizza is. My boyfriend does NOT wait in lines, and for him to sign us up to wait outside in the NYC summer heat is a big deal. Once we were seated, the staff was fast, and the pizza was pipping hot once it was delivered to our table. These people are professional pizza connoisseurs.", "author": "Andi V."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}