{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-27", "description": "Great pizza.  Line was a too long.  I think the original spot next door is better.", "author": "Yolonda R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-09", "description": "Great brick oven pizza done the right way. You can taste the quality in every bite. Perfect place to come to after hanging out down the block at brooklyn bridge park.", "author": "Hasib B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-02", "description": "I met a boy named Grimaldi but I have to go all the way to Brooklyn for his (sweet and salty) special sauce.  When I arrived, he made me wait.  He didn't even offer me a glass of water after all that waiting, even though I obviously looked very thirsty.  Did I mention all the waiting? After I was done, I thought, \"Meh.  I've had better.\"\n\nHe's perfectly adequate and I'd stop by for a quickie if I were in the neighborhood but he's not worth a subway ride from the city.  He's definitely not worth a transfer. But judging by the 1300 other girls who have very good things to say about him, I don't think he'll miss me, either.", "author": "Cynthia T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-01", "description": "Great place to go with friends, cheap, spacious. The margarita pizza is incredible, very quality ingredients.", "author": "Allison S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-13", "description": "The pizza is some of the very best in NYC... if not the entire USA. The dining experience is quintessential NYC phenomenon dinning. Expect a line at the door, which normally is annoying, but the view of the Brooklyn Bridge and Lower Manhattan is spectacular and entertaining.\n\nOnce seated the staff is fast and you'll soon be rewarded with some of the best pizza you'll ever eat. The decor is typical pizzeria and the jukebox can sometimes be very fun. One last tip -- It's cash only. \n\nIt's a must do while in Brooklyn. If you have the time check out Lombardi's on Spring Street (or visa versa)  and if you're really a pizza foodie make the long trek out to Di Ferra's on ave J.", "author": "Christopher B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-20", "description": "I went here the day after I went to Lombardi's. And I gotta say Lombardi's was the winner for me. However, Grimaldis was close. The toppings, cheese and tomato sauce were all very good. I would say I prefer the tomato sauce at Lombardis but Grimaldis was also very good. The thing about Grimaldi's that I was not a fan of was the crust. It wasn't crispy, you couldn't fold it over and eat it because it was saturated with sauce so I had to cut it and eat it with a fork and knife. Flavor wise this place is a 5 star for me. Texture/crust wise I give it less. In any case, it is one of the best pizzas I've ever had.", "author": "Roxanne H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-27", "description": "After being a Grimaldis fan because of the Las Vegas locations, I wanted to try the ORIGINAL under the Brooklyn Bridge pizza. Truth is, the pizza options are slim but the pizza is good. Not great, but good. They also don't have a true beverage system, they give you a cup of ice and a 20oz drink of your choice, so refills are out of the question. Its also a little pricey but for the experience, its worth a shot.", "author": "David B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-29", "description": "I think that the reason why this place is so popular on Yelp (2000 reviews and 4 stars) is that it's one of the few restaurants around the Brooklyn Bridge vicinity and that you definitely bump into it if you crossed the Brooklyn Bridge from Manhattan.  Also, the greeter at the front warmly greets and welcomes people here.  \n\nThe pizza was just meh here, nothing extraordinary however.  Looked very family style and the tables were all squished together to fit maximum capacity.   Had to shift the table and such when someone wanted to go to the bathroom.  \n\nAlso, the way this place works it that they serve the basic pizza but they don't have any special pizza.  Rather, you pay for each of the toppings you want on it and they're $2 each or $4 for speciality items.  But a large pizza is $10 and it's sharable amongst three people at least so price wise, it wasn't that bad. \n\nThe worst part of the meal was when we were trying to pay the check with a credit card and the waiter serving us rudely clapped his hands and yelled, \"cash only!\"  Geez buddy, sorry didn't know.  That guy did not get a tip.  \n\nDon't think I would return here and would instead make an effort to find another restaurant even if it is a longer walk.", "author": "Susan Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-12", "description": "Yes, there is ALWAYS a longass line.\nYes, you will be starving (and a little grumpy, if you're like me) when you finally sit down.\nYes, everyone does the same thing of walking across the Brooklyn Bridge \u0026 then stopping in for some pizza.\nYes, service will be a little rude \u0026 rushed.\nBut you will freakin LUV all over their pies.\n\nMy two dining partners and I ordered a large (about 8 pieces.) Our toppings were sausage, black olives, \u0026 garlic. Hands down one of the best pizzas I've ever tasted. Crust is not too thick and ingredients are fresh and classic. And, just to top off our cliched day, after pizza, we walked to the Brooklyn Ice Cream Factory for some ice cream!\n\nSidenote: One of my favorite things about this restaurant is the picture of Frank Sinatra's mugshot--what a gorgeous man in a gorgeous picture.", "author": "Fancypants X."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-10", "description": "NOT the original Grimaldi's. Now part of a franchise, with franchise quality. The new owner is just banking on the history of the name and making it a tourist trap. Instead, go to Juliana's where Patsy and Carol Grimaldi can tantalize you with the REAL Grimaldi's pizza in the ORIGINAL historic location. Check the facts. http://blogs.villagevoice.com/forkintheroad/2013/06/julianas_and_gr.php", "author": "Alis H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-19", "description": "Food wise, there is not a negative thing to be said about Grimaldi's on Front Street! Sliced meatballs on a pie, ummmm of course! The flavor of all the ingredients stood out down to the crust, I was blown away. Suffice it to say, I will have a positive memory of this pie for life and when I return to New York, I will be back for more. Now down to the atmosphere... yes I understand the building is as old as New York City, but that does not mean that the interior should suffer!! Seriously, use some of that hard earned dough (haha) and remodel! Oh and add a soda machine instead of serving individual bottles, should save on over head and wasting the staffs time by throwing away so much trash.", "author": "Ben O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-05", "description": "We waited in line for an hour and 15 minutes. You will have to wait in line. Just go ahead and face that fact before you get there and be patient. The good thing is, the staff has gotten it down to a science and moves people pretty quickly considering they're cooking full pizzas (they don't do slices.) One thing we also noticed - when you're standing in line, you expect it to be chaotic inside. It looks jam-packed and noisy, but it's really not. It's pleasant in there.\n\nNow that that's out of the way, the pizza was great. They use mozzarella and cook it in a coal oven. The pepperoni was also especially spicy and good. When you order, you pick a size (small or large) and add toppings. Toppings range about $2-4 each.\n\nI'm not going to say it was worth the wait, but it was definitely damn good pizza.", "author": "Heather A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-06", "description": "They don't take reservations so get ready to stand in line. But it is well worth the wait. the pizza is made to order so also there will be a wait for the food. They don't sell slices so you have to order a whole pie but taking the left overs home is not a bad idea at all. Bring cash they don't take credit cards. The ambiance is very casual but the food is just amazing so fresh we delicious. Great for lunch or brunch with friends. A must visit if you are in NYC.", "author": "Eman E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-29", "description": "Got here for opening \u0026 there was a full line waiting to get in so it's true you gotta be ready to wait, or else go early (or late perhaps?).  Well I had heard so much about Grimaldi's I was so psyched to finally try it especially with my food loving sis.  Well we got a single small which was perfect for two peeps and she got black olives on her half and i got mushrooms on mine while we had sausage all over the pie.\n\nSo the pie comes out quick and the service is very friendly so everything is great so far.  Well once we started chowing, I didn't get that instant sh*t-eating grin that I was hoping for.  Instead, I felt a little let down.  Part of that, of course, was the expectations I had - damn them!  But the other thing was that our pizza was really salty.  Not sure if this was an aberration or what, but definitely it was too salty and that made it harder to enjoy.\n\nSad face...\n\nWell, the good thing is that I like some of the 'za I've had back home in San Francisco more so I think I may have to go get some of that to make a more fresh comparison!", "author": "Gene X."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-12", "description": "Really bad service. The waiter was cold and didn't even make eye contact with us the whole time. C'mon, man! Smile! Plus he got snotty when we asked about the vegetarian pizza. The host working the line was downright grumpy. I guess for a famous place with a line, they don't have to treat their customers well.", "author": "Gail P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-13", "description": "Best Pizza I have ever had in my life...  bar none\r\n\r\nI'm looking forward to trying the competition:)  Lombardi's Pizza that is\r\n\r\nDefinitely worth the trek, and didn't experience a wait (2 people) though larger parties may have an issue.", "author": "Henry B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-31", "description": "nothing new to be said... fabulous NY pizza, exceeded my expectations. ordered a regular small to split with my friend. perfect amount for two ladies.\n\nwe arrived around 8 pm on friday evening. no surprise, there was a long line out the door. however, we walked right in and immediately plopped ourselves at the bar! easy peasy!\n\n4 stars for the pizza and snagging a bar seat right away\n\n5th star is for our delightful conversation with the owner, who walked over and chatted us up (of course with a heavy, charmingly italian accent) until our pizza arrived. \n\ncash only, no reservations, no slices, and no delivery", "author": "Maressa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-05", "description": "A NY pizza institution, no doubt.  Bring cash and be prepared to wait in line.  No need to get fancy, just \"cheese please\" for me.", "author": "Alison Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-02", "description": "I'll try to be subtle and understated about this. \nTHIS IS THE BEST PIZZA IN THE WORLD!!!!!!!!!!\nHere is a list of things better than this pizza:\n\n1)The Emancipation Proclamation\n\nThats it. Thats the only thing better than this pizza! The only downside to this place is that you are going to have to wait on line with a bunch of Brooklyn hipsters. You will need to be able to stomach an annoying conversation by the people behind you about the Vivian Girls. If you don't know who they are, don't worry. It only means that you aren't an pretentious asshole.\n\nDrive, run, sail, kayak, hang-glide, snowboard, surf, base-dive, or ambulance yourself to this place. NOW!", "author": "James M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-06", "description": "Honestly, I went to this pizza parlor simply because my girlfriend is a huge Frank Sinatra fan and supposedly this place was his favorite location to get a slice. However, today this place is a tourist trap. The pizza is nothing special, one could walk into any random pizza parlor in manhattan and get a better slice of pizza. \n\nInside, is extremely uncomfortable. Every inch of the store is crammed with every table they could possible fit inside, leaving the customer literally rubbing elbows with the person next to them. Plus, since it is so crammed with people inside, you have to scream in order to communicate.\n\nThe dining experience is extremely rushed. They simply want to get you in and out as soon as possible to serve the next customer. Lastly, since this place is only a tourist trap, there is always a huge line outside just to get seated for a table.\n\nAll in all, don't waste your time here. So what Frank Sinatra liked to eat here 50 plus years ago. Today, the pizza has transformed into a product rushed out of the oven just to get a tourist in and out as fast as possible, and their wallet lighter than when they walked in.", "author": "James C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}