{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-09", "description": "I've had great pizza and this is not the BEST i've ever had, but is pretty tasty.  I think we botched our experience a little because we decided to order our pie to go after waiting in line for 1hr 15min and hearing that the kitchen announced it would be closed for another 30min for oven cleaning and shift turnover (it was 6:30-7:00PM, smack in the middle of dinner rush!).  Anyway, we figured that we can run the pizza over to the water landing to enjoy with a gorgeous city skyline view.  Within 3 minutes of receiving our order and running it to the water, the pizza lost it's crispiness due to the steam trapped within the to go bag (yes, it's in a bag, not box).  The only REAL criticism I have on the pizza's taste profiles is that the sauce is a bit bland and sausage is pretty mild in flavor too.  These factors on top of the use of fresh mozz w/o much salt / seasoning, culminated in a pie that lacked a bit of flavor.  All in all, I see where the genius would lie with this place, but have been blown away by finer experiences before.  \n\nThe skyline view with the pie and topped off with a water ferry ride back to 34th St in Manhattan was PRICELESS!  That was worth the trip, hands down.", "author": "Yvette H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-26", "description": "This place has 1200+ reviews. Why do I need to review it? I probably don't, so I'll let you turn to other reviewers for the food details and just stick to my experience, very little of which has to do with eating.\n\n2.5 hours in line. That part I won't forget. Largely because the insufferable office wench behind me blathered for 35 minutes straight about her office-crush's sex life. (Jason, a word from me to you: RUN. Do not fuck this woman. She is stalking you, she's bitter about you fucking her assistant and the only people who voluntarily hang out with her appear to be relatives and French men who speak little to no English.) She also kept shoving the edge of her gigantic purse up the crack of my ass. I would inch away and she, as if she felt the line was moving because of my modest escape attempts, would edge closer and promptly jostle her bag into my buttcrack again. I feel a sense of personal failure that I didn't spend childhood summers like the neighbor boys did, as they perfected the art of farting on command. I would've fogged up her makeup mirror for later. (Passive aggression is key when you've already invested an hour in a line and you're not ready to risk a fight and having to walk away before getting food.)\n\nI finally got some respite from the butt vs. bag war when the handbag frotteur wandered off with her friend and left the blessedly silent Frenchmen to hold their place. \n\nThen my group arrived. I didn't know everyone in my group (distant relations + friends of), which is why I suggested a place with such a prohibitively long line.  I mean, they wanted to do the touristy thing, so I didn't choose Grimaldi's as punishment. I just wanted to go somewhere that was inconvenient enough that I wouldn't shed a tear if someone did something so mortifying that I could never return. (Happened at a friend's group birthday party. And again at a bachelorette party, which  ended up as a controversy du jour on Grub Street. Forgive me if I pass on joining your large party in a place I want to visit again.) Fortunately, everyone in this group was well behaved, so I can return to Grimaldis -- if I get a hankering for a 2+ hour line and gluteal abuse by Chinatown knockoff. \n\nThe guy who showed our large party to a table was friendly \u0026 efficient at squeezing us in. I know 8 is a lot more difficult to handle than a two top. His good attitutude and efficiency were appreciated.\n\nOur waiter was humorless and seemed very agitated at having to work. When the young teenager was being obnoxious and I apologized for it \u0026 made a joke, he could've cracked a smile instead of rolling his eyes. Sorry the acting/music gig isn't working out, man. \n\nThe pizzas! Yes. They were very, very good. It's the coal fire brick oven that does it. 1200+ other people have covered that, so read their reviews for crust \u0026 sauce details. The ingredients at Fornino (in W'burg) put Grimaldi's to shame. So I think I'd rather take a trip to Williamsburg and grab a hot Trevisana in half the time it took me just to get a table at Grimaldis. Great pies at either place. I'd secretly love to know what Fornino's Trevisana tasted like after being fired in a coal burning brick oven.\n\nTheir antipasti platter was kinda... gross. I'd rather not eat Sysco after a 2 hour queue. The dudes ate it. That was some hard ass mozz. It dug into my cheek the same way that office lady's bag did. \n\nOh, and Grimaldis? The tourists might not know that it's illegal in NYC to tack on 20% gratuities, but the locals do. We would've left you that much anyway, but it's taaaaacky. Locals, if you didn't know, you do now. It's illegal for restaurants to tack on gratuities to checks unless your party is 8 or more, then restaurants can add a gratuity of 15%. That policy has to be plainly written on their menu. Grimaldi's isn't playing by the rules, and even writes the check kind of confusingly (not labelling the gratuity overtly -- we had to ask a waiter) which seems to be something restaurants do when they're hoping you'll tip on top of the secret illegal tip.\n\nSo the morals of this review are: \n1. Go early in the day before the tourists get there. \n2. Stick to the pizza. \n3. Jason, RUN!", "author": "Emma S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-13", "description": "Sometimes when you are visiting a certain city, you just have to eat a certain pizza.  In Phoenix you have to go to Bianco, in LA you must try Mozza, and in Brooklyn that place is Grimaldi's.  These are the type of places that give the diner instant pizza reviewing credibility.  This way when you are out with your friends you can casually say things like, \"hmmm, this pizza is alright, but it really lacks the char on the crust that the coal oven produces at Grimaldi's.\"  That's right - part of the reason I ate at Grimaldi's was so I could pizza name drop.  \n\nAnyway, on to the pizza.  I came here for lunch on a Saturday because I figured that the place would be way less crowded than for dinner.  Grimaldi's is right under the Brooklyn bridge and opens up at 12:00.  We arrived around 11:25 and there were only two groups in front of us.  Just as I was wondering if we should walk around for a bit rather than waiting in such a small line, a whole line of taxis unloaded about 4 more groups of people.  And I looked around and people were walking up to get in line.  So we stayed in line, and boy we were smart.  In a half an hour the line was filled with about 75-100 who wanted pizza.  \n\nThe pie is pretty darn tasty, although it is a bit cheesier than others I have tried.  The best part is that the crust is cooked perfectly - I am guessing because of their famed coal oven.  There is char without the feeling that the crust is burnt.  The peperoni pie we ordered had very thick slices of peperoni that cut some of the cheesiness.  Overall the pizza is great, but I am not sure I would return because the lines are so long.  I thought Patsy's was also great, and the line was not as crazy.  Good pizza, but for me Pizzeria Mozza in LA is still my favorite pizza.", "author": "Dana H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-27", "description": "Moderate at best, I don't understand what's the hype is all about. I had much better pizza in my life. We're a party of three and queued for about an hour. When we were first in line, the manager skipped TWICE on us, just because we're a party of three, he prefers party of four to fill up the table.\n\nWhen we asked for the check, the waiter included TIPS in the total amount. For a party of three ? I can understand if we're a big party, but for a party of three ? That's illegal by law. When we asked why he included the tips in the amount, he said he has to be \"harsh\" and thought that we're tourists. The waiter was rude and unapologetic.", "author": "Stephen K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-06-03", "description": "I thought this place was alright, I'm giving it 3.5 stars.\nMaybe I'm just really picky but I expected to be WOWed by this place.  So after standing in line for about 30 mins or so to be seated, I expected it to be spectacular.  Our order came out pretty fast and it tasted like pizza. That's it.", "author": "Lina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-14", "description": "I waited for 20 minutes outside in the middle of winter (it was 25 degrees outside) and it was so worth it.  It's way better than Lombardi's.  \n\nI have been to 20 pizza places in New York and Grimaldi's is easily the best.", "author": "Ben O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-16", "description": "I'm from northern California and this is my first time to New York. Let me just say of all the pizza places i've been to so far(about 4 or 5) Grimaldi's is probably the best.\n\nAlthough the interior doesn't look as nice and the menus arent as pretty looking as Lombardi's, I can safely say that this place just blows every other pizzeria out of the water. Extremely delicious pizza, not too high of a price, quick and straight-to-the-point service, with a little bit of an \"underground sleeper restaurant\" feeling because it doesn't look incredibly fancy.\n\nOverall this is place is so awesome I definitely would not mind going there every night. If I lived in brooklyn that is.", "author": "Jonathan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-09", "description": "Dear gosh - i don't remember the last time i waited 1.5 hours in order to eat dinner... luckily weather was decent .. the pizza was quiet delicious - the palce is extremely packed.. there were three of us and we shared a two person table - but thats ok - pizza orders came back very quickly - i really liked a sausage and mushroom pizza with basil on top.. yum\n\ndefinitely next time tho - i will order in advance via phone to take out\n\nthe line to takeout and eat in are the same .. so order to take it home if you live in the area.", "author": "Diane L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "There are so many things I liked about Grimaldi's! First of all, we thought it opened at 11... but it didnt open until 1130, which made us first in line! The waiter was adorable, with his gruff new york personality, but he was walking around singing along to the music that was playing. Service was quick and easy. Our pizza was yummy, maybe not the BEST EVER, but definitely very good. Also the prices are totally reasonable and not all jacked up due to the tourist nature of this place. I would certainly come here again! Plus it is right next to Brooklyn Bridge Park with is BEAUTIFUL!", "author": "Lori H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-08", "description": "The trick to this place is to go at like 5:30 (sooo early) in a pouring rainstorm and you won't have to wait, even on a Saturday. That was pretty brilliant thinking on Melissa M's part. I mean, what else is there to say about this place? It's delicious. The best pizza I have had in NY. They don't take credit cards, which usually drives me up the frickin wall, but here, it just seems like part of the charm. It's definitely worth it to go and don't feel bad about splitting a large cheese pizza between two people... and finishing it...and wishing you had more...", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-19", "description": "came back here yesterday to show the pook what real pizza is. \n\nthis time i wasn't so lucky and waited almost an hour to get inside. after we got inside our order was taken within a couple of minutes. unfortunately.. our order was lost somewhere and the two couples on both sides got their food and finished it before we got ours.. in fact.. the couple to my left had their pizza order eff'd up and they finally got it right on the third pizza.. yup.. the THIRD effing pizza..\n\nanyhoo.. the pizza made up for it. we got one large.. half garlic half sausage/mushroom/onions. garlic was still the winner IMO. so simple.. and so delicious.\n\nbring water with you to make the wait in line easier if its a hot day.. \n\nps. the wait for take out and dine in is the same line.. so be prepared to wait!", "author": "Lena H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-29", "description": "The food was good and worth the wait. My favorite item on the menu was the cannoli.. Awesomely delicious :) The owner was a very friendly guy, and he posed for a picture too.", "author": "S M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-03", "description": "Delicious pizza my friend's.  I'm not going to compare it to DiFara because of the apples and oranges thing.  No slices offered or given except from the whole pie itself. Waiting seems to be no big deal before 7 to 7:30 pm as long as your whole party is ready to eat.  The waiters are friendly and the pizza comes out quick.  The fresh garlic alone is worth the price of admission.\n\nThey (specifically the silver haired maitre d' aka Pauly Walnuts) do rush you a bit to clear the tables once you're finished eating.  Which I can understand, in order for a place to make money the tables need to rotate.", "author": "David B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-10", "description": "This is the style of pizza I so crave after going back to the ATL. We just don't have pizza joint owners brave enough to hold off on the big cheese hands. Ny ers' are very lucky to have a 100 options similar to this treat.\n\n1/2 a block away is one of the best views of Manhattan at night.", "author": "Chef Invisible T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-15", "description": "Thank you Yelp for starting my NY trip off right! \n\nMy friends and I went straight to Grimaldi's off the plane. It was well worth the late night subway trip to Brooklyn and 30 minute wait in line. This is definitely the Best Pizza New York has to offer. I looked high and low the rest of my week in NY and couldn't find a better slice!", "author": "Charles L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-11", "description": "Finally, after four years in New York City I have eaten at Grimaldi's.  It's not that I haven't tried, but the line has been too daunting on a couple of occasions and that one of the big problems with Grimaldi's.   You envision a lovely evening of walking across the Brooklyn Bridge, going to Jacques Torres chocolate or the Brooklyn Ice Cream Factory afterwards, but when your friends see that line they'll probably whine that they don't have time to wait or suggest you go somewhere else.  Then you'll be the bad guy\n\nThis time I had it easy.  I showed up late and my friend Diantha was already waiting in line, which was shorter since it was lunchtime.  An apology and I was off the hook, and we were sitting down quickly and eating a delicious pizza.\n\nThe service was perfunctory.  Is that the word I'm looking for?  Also the place is cramped.  We were so close together, our neighbor sat on our table cloth and nearly pulled everything off our table.  Fortunately, no pizzas were harmed in the making of this incident.\n\nThe pizza.  Well, we ate it all quite quickly, and it was very good.  But I have had better.  \n\nIf it came up short to some of my favorite all time pizza places, I would say it was because the cheese and toppings were of average quality, but I hate to compare.  It was very tasty, and well worth the nonexistent wait.\n\nIf you go at night when it's busier, it might not be...Unless you're counting on making a night of it.", "author": "Frank W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-11-12", "description": "Seriously?  I think it's grossly overrated and poorly managed.  How is it that you have to wait in line for 30 minutes to get in and then still have to wait 45 minutes to get your pizza?  There's got to be an easier way.  Plus you have to wait in the same long line for take out?  Doesn't that defeat the purpose of getting take out??\n\nService is very brash, don't expect any greetings.  The table cloths are just so filthy I wouldn't dare eat anything that falls on it.  It's not cheap but it doesn't take credit card.  Not a good business practice.\n\nThe pizza itself is really not that great.  What did I say: grossly overrated.  Yes, I know it's supposed to be thin crust but even thin crusts should be able to hold its weight and then some!  This one just falls flat on its face.  Really, save your time and don't bother going.", "author": "Yohanna B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-15", "description": "I don't know if we went on a bad day or what but came here w/my boyf and his friends. The wait wasn't that long and we got our pizza fast. However, I was very disappointed about the pizza. It was soggy and not crispy. The server was kind of nice; he went to look for orange cream soda for me but it was warm and I was hoping for a cold drink. Overall, it wasn't as great as what people have been telling me. It's not the best pizza, I've had better brick oven.", "author": "Vivian Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-22", "description": "Long wait and the pizza was not good for me! It was margherita style and herbal tasting (lots of basil) and their sauce is strange.. veering towards sweet, but not at all sweet. My friend had what she called a \"tomato tumor\" on her pizza (literally 1/3 of a large tomato sitting whole on her slice). One of my friends decided to forego her entitled second slice becase the pizza was so bad. She literally had one slice and was done. I've never seen anything like it, and trust me, my friends love to eat. \nI love coal oven char, but Grimaldi's straight up burned half of the pie's crust. The pizza isn't great at all, guys and this sentiment was shared coming from 3 pizza experts native to NYC. If you want GREAT pizza reflective of what NYC has to offer, go elsewhere, there are so many more options that are less expensive and less of a wait than Grimaldi's. Ugh :( I really wanted to love this, but it just wasn't worth it. Especially not worth trying to navigate DUMBO.\nThey're arrogant there too. The waiters wear shirts that read \"I'm going to serve you up a pizza you can't refuse\". This was cute until I tried their pizza. Additionally, the place is small so you'll be seated next to strangers. Again, this might have been cute if their pizza had been worth it. But alas.\nBottom line: I like my pizza greasy and cheesy (like a real New York City pizza). This is not the place for that kind of pie. Screw you Grimaldi's. Oh, and this is a tourist trap.", "author": "Yari C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-15", "description": "The only thing that prevents me from giving Grimaldi's five stars is the poor service.\n\nThe pizza however is excellent and so far the best I've had in NY (yes I have been to John's, Lombardi's, Patsy's, Totonno's, Una Pizza Napolitano, Nick's, etc...).  \n\nI usually get a large pie with just garlic.  I think too many toppings takes away from the quality of sauce and crust.  Eating a slice with a bottle of Brooklyn Lager and I'm in heaven.  Bon appetit.", "author": "Y S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}