{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-21", "description": "I normally go to the Grimaldi's in Tucson so I decided to stop here while I was in New York. Surprisingly I thought the pizza was every so slightly not as good as the one in Tucson. It's a very different atmosphere though. There's a very long line outside and then the inside is very cramped (not surprising) and it's a bit more rushed and chaotic (also not surprising). Overall, it's not bad but I would still prefer to just get some of the super cheap, quick pizza available in New York.", "author": "Sara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-26", "description": "Best authentic Italian pizza I've eaten outside of Italy.  Lombardi's is close second but I didn't think there crust was as soft.  Grimaldi's starts with a thin layer of pizza dough, layers it with fresh slices of mozzarella (not shredded), next the toppings (which are usually $2 a piece) then tops it with a sprinkle of fresh basil leaves and a small amount of sauce before popping it into the brick oven.  I think the large cheese pizza was $14 then $2 for each additional topping.  It won't fill up four hungry people, but keep room in your belly for Jaques Torres' chocolate shop around the corner.\n\nService was excellent!  We went at 1pm on a rainy day and there was no line, but I've heard the line can be VERY long at times.  Call ahead.", "author": "Julie P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-06", "description": "First off - the pizza was great - BUT - the line was too long (45 minutes) and the service was a notch above \"I'm doing you a favor\".  Slow waiters - took 15 minutes to place order - took 20 minutes to have pizza brought to table - took 30 minutes to get waiter's attention to get check!  No pizza is worth that!", "author": "John L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-23", "description": "from what I've read and heard, grimaldi's is sort of a touchy subject. you either love it, or you think it's completely overrated as far as new york/brooklyn pizza goes. having only lived here a couple of months, I'm probably not qualified to weigh in on the new york pizza scene but hey, I will anyway. \n\nI've been to grimaldi's a couple of times. people like to talk about the outrageous lines, but the first time I went (around 7 on a tuesday, I think) there wasn't any line. although there was a fairly long line the second time (same time, but on a monday) it moved really quickly and we were in the door within 10-15 minutes. the service has also been refreshingly friendly both times and I appreciated that they kept a water cooler outside for people waiting in line, since it was hot hot hot...\n\nthe pizza both times was solid. I recommend either sticking to plain cheese (the cheese is delicious) or getting one topping, two max. my only criticism is that the pies seem slightly undercooked. I like a reasonably firm crust, and I think in an effort to turn tables they take them out a tad too soon. hence the warning to limit toppings...otherwise it turns into a heavy and slightly limp mess. all in all it's really good (probably the best pizza I've had in new york), but I have to be honest and say that I've had better pizza at home (texas)...which is pretty sad considering this is the pizza capital of the states (no thank you chicago deep dish).\n\nI'm eager to venture over to lucali's and difara to see how they stack up.", "author": "Caroline N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-05", "description": "OVERRATED ! I have been passed this place millions of times and always said \"hmm, what's the line about \"? Well , this Friday I found out and let's just say I should have saved my time and Weight Watchers points LOL. The restaurant is PACKED and I mean PACKED , there is barely enough room for you to eat comfortably . We got our pizza and it was the wrong size \u0026 the wrong toppings . Ok, we sent it back and with no apology the waiter throws our pie on the table. At this point I was ready to walk out !!! So after a few bites of this so so pizza I realized we wasted our time . My boyfriend and I agreed to NEVER go back there . Trust me it's nothing to brag about AT ALL !", "author": "Kimberly C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-21", "description": "Yes, wait in the line, you wont be disappointed.  It's cramped as hell, especially with two pizzas on the table but it'll work, just keep your beer away from the pizza tray ;)", "author": "Jon G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-29", "description": "Well due to the fact that I didnt get a chance to sit down after waiting on line.  Apparently the owner was doing the seating and sat my party of 5 people in a 4 person seating area.  No elbow room.  The tables are back to back and you are like sardines in a sardine can, then we ask the gentleman to sit as another area better for our 5 person party, he refused and told us if we dont like it to leave.  Even after we offered a $20 tip.  Thats ok we went to Pete's Downtown right down the street and had the best night ever.", "author": "Debbie V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-13", "description": "okay.  so there is alot of hype about this place.  the line was down the block and people said they were waiting a long time.  somehow my friends and i finagled our way at the bar.  apparently they are supposed to pull you out of line for that but oh well.  we only waited 10 min instead of an hour.   pizza was really good and fresh.\none of the better pizza's i have had in nyc.   better than ray's or John's on bleeker imo but we have good pizza around here too.  better at some places.", "author": "Nicole B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-03-12", "description": "Nothing special about this pizza, it's a wanna be brick oven thin type crust, but it fails at that, too doughy. The cheese used is nothing spectacular, just above average, the sauce again above average, the crust isn't even all that good. The toppings, also above average, but nothing stands out. I suspect this place is frequented by people who don't know what a real pizza is, they're used to franchise type pizza and this is basically that Pizza Hut type of pizza, but not mass produced. \n\nSorry, the beat up worn out interior to make the place look like an authentic pizzeria won't make the pizza come out authentic guys, it's cute they leave the place a bit worn and dated looking, it adds character to the place, too bad that it doesn't add any authenticity and taste to the pizza, all just for show and a fraud.\n\nPizza is made like this in most Southern Euro countries, and in most places there tastes a lot better than Grimaldi's.\n\nThis is good pizza to those wanna be hickster type non-New Yorkers, who get mad too when you point this pizza is just ok, to the uncultured know it all hickster mid-west transplants it's the Mecca of pizzerias, to someone who knows pizza, it's ok, fun once in a blue moon or when you're in the area and have no other food options or you're a hickster trying to impress people that you know the \"best\" pizza spot in NYC, and they're from out of state and don't know what a good slice of pizza is.", "author": "John L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-13", "description": "I really envy the owner of this place, he has got the best scam in the city going.  If you are from NYC do not go to this place.  Any neighborhood pizza place is a lot better than this.  Luckily we didn't wait on the line too long, but this has to be one of the biggest tourist traps around.  The pizza has almost no flavor, and is surprisingly bad.  Stay away!", "author": "Tron S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-14", "description": "Pizza's decent.  It's notable for using crushed tomatoes instead of sauce and nice medallions of mozzarella cheese, but neither really stands out as particularly special as far as gourmet-style pizza goes.  The tomato flavor was on the waterier side, and somewhat bitter.  The crust was good, thin and a bit sweet; however my piece was a little too charred on the bottom, and my jaws got a work out from the chewiness.\n\nHonestly, if I hadn't gone at 11:30am on a workday when there was no line, I would have had to rate it 2 stars.  The pizza wasn't memorable - I'd much rather have Lucali's or My Little.  I just can't understand the hype.", "author": "Seth M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-24", "description": "Visited today with my wife and daughter at 2:00 and there was no line.  We walked in and a nice younger gentleman was about to sit us when an older gentleman told us to follow him, he walked us outside without saying a word and walked back inside.  I guess that was his way of telling us to wait outside.  We found him to be quite rude, we understand they do great business but customer service should still be a priority.  If this individual does not understand that we suggest that he should retire.  We are disappointed that we did not have the opportunity to try their famous pizza.", "author": "Moira K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-13", "description": "OH man only in NYC would I wait almost an hour for pizza!  Good thing I had my iPhone and some company.  I had the large pepperoni \u0026 mushroom and I have say it was well worth the wait.  The crust was very thin \u0026 chewy and I loved the fresh mozzarella.  I would have given this place 5 star but cause of the wait it gets 4  Cash is king here and skip the dessert and go down the street for some ice cream at Brooklyn ice cream factory and enjoy the view.", "author": "Timothy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-08", "description": "Don't get me wrong. The piszza is great. But this place is a bit too touristy for me. If I'm with a group too big for Totonnos or if we're heading out on the town, I'd go here. If you want brookly pizza, go to Totonnos in Coney Island.", "author": "igor I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-11", "description": "A year after I moved to the neighborhood, I made my ninth or tenth trip back to Grimaldi's, this time with the parents in tow.  At 9pm on a Sunday we expected quick, awesome pizza.  Unfortunately, the service was anything but quick, making out experience anything but awesome.  After waiting an unconscionable 40 minutes for a table (when the line was just 8 deep), we were roundly ignored for 5-10 minutes. Meanwhile, there was more than adequate space to seat my party and many others waiting in line, but because of their seating policies/ineptitude, nearly a dozen of us were kept waiting outside while the space sat vacant inside.  Service was non-existent.  I was grateful for the carafe of water they brought us, because hadn't that been delivered, we'd never get a refill again. Pizza was nearly launched at our table, as was the check.  And when we were within 30 minutes of closing time, the music was cut off and the air conditioning was blasted.\n\nA potentially great experience with the parents that was dampened by the Grimaldi's staff.\n\nThanks for giving me a reason to Yelp again.", "author": "Andrew U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-03", "description": "I heard about this place from a doctor I work with who grew up in NYC.  So I figured this pizza had to be truly delish. My friend and I made our way under the bridge, following the smell all along.  The night was cold and snowy which made it twice as shocking to see that there was a line you would expect for a club. We ended up waiting for an hour.  While in line, it was quite entertaining to watch the old man (I am assuming to be the owner or manager) come in and out of the door to call out who could enter the place.  He reminded me of the soup nazi from Seinfeld because he was very serious and particular about the order of the line and the exact amount of people who could enter the building.  I was almost scared he would shake his head at me and scream, \"No pizza for you!\" (He ended up being very sweet). \n   When we finally made it to our table, we were shoulder to shoulder with every other person in the tiny room.  The menu was also small and to the point. I have to say, it was amazing how quick the pizza landed.... \n   Sadly, I can't say the pizza was amazing but it did taste fresh and authentic.  The crust was crispy thin and had the flavor from the coals that they use in their brick oven.  I did like that they used fresh mozzarella and basil. The sauce was good but not great.  \n   If I were ranking the experience, this place would get a 4 but the pizza was not as exciting.", "author": "amanda p."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-19", "description": "Do not wait two hours here for some authentic new york pizza! They tell you it's 30 mins but nope it is not. So please don't get fool, but i guess they have amazing scenery at night during sunset time, you can go check out the place but just please don't line up and wait for it. It is not worth itttt!", "author": "Sandy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-12", "description": "Pro: The pizza was fresh.  The flavors of the ingredients came out with each bite. The texture was consistent with the ingredients.  Open kitchen.  The price was reasonable.  \n\nCon:  The long wait.  The door man who kept flirting with all the ladies.  The restaurant is small. Everyone is packed in. Only 1 restroom.  Drinks are expensive.", "author": "K W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-28", "description": "I came here with a girlfriend, on a rainy weeknight -hoping that the wait to get in wouldn't be as bad. boy, were we wrong! the line remained JUST as long as it normally did and the wait was over an hour as anticipated. my girlfriend and i cleared our schedules for the night because we weren't sure how long our evening would be, just to try some \"amazing\" pizza. luckily, the people who stood before and behind us were friendly and made the wait much more enjoyable. when we finally got in, we were rushed to order something. i guess that's the norm here because the waiters slammed down our glasses of waters on our tables and scurried off when we had the \"undecided\" look on our faces. my girlfriend and i settled on an original and one with olives and mushrooms. what they lacked in service here sure made up for it in the pies. the pizzas were delicious and savory. unfortunately, they don't sell pizzas by the slice becausei think it would've shortened the wait time on the major aspects of this establishment (customers and food). not to mention, there was a wait just to get the check! now would i come back again? i'd have to think twice about that... was it really worth the wait and the disgruntled waiters? well let's see..we are in NYC where pizzerias are plentiful! :)", "author": "Ten E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-14", "description": "I'm only giving two stars because the 30-60 minute wait is totally not worth it. We ordered a medium pie, the cheese was ok, and there was barely any sauce. Honestly the whole pie had almost little to no flavor. I had dollar pizza better than this crap. But don't get me wrong maybe with some toppings and extra sauce it can go up a star. My friend asked for waters first then soda. The guy gave us the sodas first and we were done quite quickly. We had to ask three times for water, what incompetent and slow waiters. So if you have about two hours to kill it might be worth it, Maybe, other than that Difaras, IL Fornetto and others have better pizza.", "author": "Oliver G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}