{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-19", "description": "One of my favorite pizza places! I have been going to Grimaldi's with my family since I can remember. Yes, you do wait in line all the time. Yes, the pizza is great! A few of us even purchased Grimaldi's t-shirts! We always take my family from Italy when they come to visit \u0026 no one ever complains. They talk about Grimaldi's pizza all the time. If that doesn't tell you that the pizza is good, I don't know what will. Also, if you have a large group, get a pie \u0026 a calzone! The calzones are just as delicious as the pizza. I love that it's in such a great location, close to the Brooklyn bridge \u0026 near the water. It can get touristy, but this place is worth the wait!", "author": "Giovanna A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-11", "description": "I really don't understand the hype. This is a tourist trap and nothing more. The pizza is okay but nothing special.", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-06", "description": "It's all about the crust. Toppings are just toppings but it's the crust that makes a great pizza. I savored every bite until it was all gone. It was the best. Only complaint was they didn't have fountain drinks. A cup of ice and a $3.00 twenty ounce coke is what you got . But then I thought about that delicious, savory, wonderful crust...and all was once again harmonious in the universe.", "author": "David C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-31", "description": "Good pizza but you are coming here more for the experience. Make sure you get here and start lining up before they open, otherwise the wait can definitely be long. Not the cheapest pizza either, but its a great vibe at the restaurant, the pizza is made with really good ingredients and you really get the New York feeling when you are in this place (maybe that is why so many tourists come here after their walk across the Brooklyn Bridge). Worth a trip once, for sure!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-22", "description": "I do NOT recommend going to Grimaldis. The pizza is good, but not worth the wait or the awful service. If you want to wait an hour for decent pizza and lousy service, suit  yourself. Within 1 week I had pizza at 3 different pizza places in 3 different cities: Grimaldis in NYC, Pitch in Omaha, and Settebellos in SLC. While good, Grimaldis was the worst of the three with the absolute worst service. Settebellos was best and Pitch was a close second, only beat because the crust at Settebellos is amazing. When you can get better pizza in both Omaha and Salt Lake City, you know Grimaldis ain't anything special. ... BTW: Settebellos is part of Vera Pizza Napoletana, an international organization that promotes authentic Naples-style pizza (http://americas.pizzanapoletana.org/), so yes you can have great pizza in Utah.", "author": "Mr. M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-02", "description": "Really great pizza with a unique, chewy dough. I suggest going later in the evening to avoid the lines.", "author": "Wesley H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-23", "description": "Another one of my favorite pizzeria joints but not at the top of my list. The line as usual was insanely long for those waiting to sit and eat but the food was worth it. Customer service was good and the place for the most part was clean inside. The prices for the most part are right on par with other famous pizzeria's in the city. The only thing I did not like is the noise level at the restaurant as everyone working at this place is running around like crazy. Grimaldi's is my second favorite pizza joint in the city and if you are in Brooklyn you definitely have to check this place out. Great view of the Brooklyn Bridge from this spot also...", "author": "Ed M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-16", "description": "Grimaldi's.....can I say the best slice I've ever had so far. A native New Yorker that had his fair share of pizza slices, this is by far the best I've had. It's true this pizza is not your classic NYC pizza, but rather tastes like a slice of Italy. As long as the wait and the travel under or over the Brooklyn Bridge its definitely worth the wait.", "author": "Mark M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-11", "description": "Not the best pizza I've ever had but definitely worth trying it out at least once before you die! The mozzarella is packed heavily on this pizza and will definitely fill you up. Very good pizza. If you absolutely HAVE to try it, do it in the summer so you won't have to wait outside in the cold!", "author": "Nikko M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-02", "description": "When there's a line around the block you expect the food to knock your socks off, am I right or am I right?\nWe waited half an hour outside, which would have been fine except that after we ordered it took an hour to get our pizza. It was fresh and the crust was delish but the overall experience left us wanting more. \nThe wait combined with the grumpy staff was not fun and then we were underwhelmed by the food. I know it's New York, I get the attitude, in fact I kind of like it, but when your customers are all hungry and anxiously waiting for hours, the least you can do is pretend not to be annoyed. Would have all been worth it if the pizza was better. \nSorry Grimaldi's, I wouldn't leave this review if I thought it would make that long ass line go away, but I know it won't.", "author": "Kristin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-21", "description": "Amazing pizza but usually a long wait.  Tables are cramped inside so get ready to get cozy with some strangers.", "author": "Daniel Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "Walked the Brooklyn Bridge and waited outside in line for 30 minutes on a chilly December afternoon but it was well worth it. Quiet restaurant with amazing pizza surrounded by great neighborhoods for walking it off!", "author": "Courtney M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-25", "description": "I saw people lined up out the store on a cold Brooklyn afternoon and wondered what the hype was, and a friend insisted I try it. I grew up in Chicago so grew up a deep dish lover but this place is amazing, some of the best pizza I've ever had! Worth the wait and the line moves fast. All thin crust pizza, NY style. Definitely worth making the trip to Brooklyn for. I also recently tried Lombardi's, which was good, but I thought Grimaldis was better. Finish your meal off with some ice cream next door and a walk across the Brooklyn bridge back to Manhattan.", "author": "Jonathan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-28", "description": "Fantastic thin crust pizza. As with all great pizza the secret's in the sauce and fresh ingredients. \n\nI highly recommend having a glass or three of red house wine for $5 to go along with a large margarita pie. \n\nCome hungry and leave happy (and goddamn full).", "author": "Chris V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-01", "description": "A MUST IF PEOPLE VISIT YOU IN THE CITY: \n- Walk across the Brooklyn Bridge \n- GO TO GRIMALDI'S \n\nTop notch pizza (order more than you think you'll eat because you'll end up eating it). Cramped space and you'll often wait 30 min or more -- but it's worth it. \n\nCash only. Staff is rude but this adds to the charm and to the overall experience. When your pizza is this good you don't need to have good service. \n\nWaiting in line for long. Pick the sucker who will save your place and go walk to the river. There are also a few great shops in the area.", "author": "Mark M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-29", "description": "I used to live right around the corner from grimaldis....so this our regular pizza spot. I can honestly say some of the best pizza I have ever had. My only disdain was all the tourist and the long ass line. I do miss being so close to this place.", "author": "Vanasha D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-21", "description": "There was a queue outside so we thought things would be good. Last time I was here the pizza was great, so far the service has been less than impressive. The waiter got our drinks wrong 3x, and took a long time to take our order. The pizza's were great as I remembered, nicely done in the charcoal oven.", "author": "Robert B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-30", "description": "Yes it's a bit of a tourist trap (me included in that), and yes they look at you like they wish you weren't there, but forget all that and just enjoy the pizza!\n\nAs a tourist, I won't have sampled as many NYC pizza joints as some of you locals, but I have done the usuals - Lombardi's, DiFara's etc. and some of the not so usual - Artichoke (weird), and I have to say that Grimaldi's in my opinion is the nicest.\n\nThey have great crust, and a combination of chewy and crispy base, fresh tasting tomato sauce, buffalo mozzarella and fresh basil.\n\nYou pay by the topping - I had pepperoni and onions - the pepperoni was nicely crisp and flavoursome.\n\nAny place that sells a 16\" pie as a small is good in my book, and this is what I got which would be enough to feed two people.  I think the large is 20\" which I'm guessing would feed 3-4 people.\n\nThe new place on the corner has a lot more space then the old place, but still expect to see a line coming out.  And they still look at you like cr@p!\n\nAll in all, for me the best pizza in New York.  So go ahead, embrace the fact that there are tourists there.  The tables are packed so tight that you will end up speaking to them anyway - may as well enjoy it!\n\nOh yeah - cash only.  Don't make the mistake I did - they look at you even worse when you hand them a wad of coins and dollar bills.  C'mon, who doesn't take card now - it the 21st century!", "author": "Thomas J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-28", "description": "This is good, solid pizza.\n\nThe place is crowded as all getout usually, but they have fast turnover. \n\n You can't really go wrong with a plain or an extra cheese (both mozz and parm).\n\nYou might feel a little trapped between the people to your right and your left as you consume your pie, but you won't go home unsatisfied.\n\nBonus: There's an ice cream place right on the pier.\n\nNot so bonus: Getting ice cream in the dead of winter ends up with frozen fingers and watery eyes. \n\nBring your camera if you want. I don't care what people think of me taking pictures as long as I get the shots I want. :P", "author": "Michele G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-27", "description": "I will start by saying I had high expectations. I went to the one in Chelsea and left disappointed. We ordered a ceaser salad and cheese pizza. The salad was the same as anywhere else and the pizza while good lacked the dazzling factor. What made this an eh visit though was the service. I had to ask 3 times to get my drink even though the place was nearly empty. I have been a server in the past and never would I leave my customer without a drink while I chit-chat with my buddy. That being said it also took about forever to get the check.  The only thing memorable about the place was the terrible service.", "author": "Loretta H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}