{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-17", "description": "Some NYC institutions are worth the hype, and consequently long lines.  Grimaldi's is one such place.  \n\nMy boyfriend and I had never been to the Brooklyn waterfront restaurant, so we ventured over last Saturday, sweating and getting eaten alive by mosquitoes as we patiently stood in line outside.  The owner came outside about 15 minutes into our wait, offering cold water to everyone.  I know it's a small gesture, but given the popularity of Grimaldi's, people would have waited anyway, heat stroke or not, so I really appreciated such a \"you're family\" touch.\n\nThe line went by relatively quickly (30 minute wait on a Sunday at 7 pm) and the service was even faster.  The pizza truly lived up to my expectations in every sense of the word - crust that stays crispy and firm, not tons of cheese and grease, fresh toppings (which are coincidentally the same qualities I look for when I wolf down half a pizza and don't want to feel guilty about it, which I also did).\n\nSpeaking of cheese, though: beware of the double-decker buses carrying loads of poncho-wearing tourists through - while we were waiting no less than 4 buses came by, tripling the length of the line and annoying all the locals who had to wait behind them.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-12-06", "description": "My stomach still hurts 5 hours after eating this crap.  The pizza here has REALLY gone to hell, it was good when I was in NYC 6 years ago but the recent reviews have not been a fluke - the Grimaldi's we knew and loved is dead.\n\nThe pizza is soggy and unevenly cooked, the sauce is just OK and the whole thing is thrown together just as fast as possible.  Try Joe's Pizza in West Village for real \"New York\" pizza, the kind that locals like.", "author": "Scott S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-26", "description": "Yummy!  I went here with my friend who lives in Brooklyn.  She had never been (and she's lived there for 3 years) and I'm always down for pizza, especially NY pizza.  We took a cab, and I was relived that there was NO line!!  We were seated right in front of the door when we realized that we would freeze our asses off, so we joined a couple and sat down at a table for four.  It worked out great.  \n\nNow, onto business....the pizza was soooo good.  It was different from the pizza I've had in the Bronx (Crosby Pizza), but the cheese was nice and gooey, and the crust was nice and thin, the way I like it.  I ate one too many slices, but it was well worth it.  I would go back even if I were not staying with my friend in Brooklyn.", "author": "Olive O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-24", "description": "it's pretty good here.\n\nlocals might think it's overrated here, but everyone suggested this place and i was not one bit disappointed.\n\nit was hot as hell and we had to wait in line. and the line usually goes as far as the end of the block. but at least they provide water while waiting. \n\n\nCASH ONLY.", "author": "Rosalee C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-15", "description": "Don't believe the HYPE!!! \n\nAll I ever heard from my friends in Brooklyn was Grimaldi's. \"It's the best pizza\" they would constantly boast. So I finally went, expecting to be completely blown away by what is considered to be the definitive NY pizza neighborhood. What a LET DOWN! At best it is under whelming. So many places doing this same thing SO much better. I can only guess that the reason so many of the folks from Brooklyn think this is great pizza is because none of them are FROM Brooklyn. Or New York for that matter.\nWhatever. Next time I'll opt for a TombStone pizza.", "author": "Junk T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-17", "description": "The white pizza was very good - the small is big enough for two people unless you're starving from your long cold wait outside.   The regular pizza is good - could use more sauce.  Honestly, my neighborhood place has better pizza and service ,  but you have to make a lunch stop here if you're walking across the Brooklyn Bridge.   I know its touristy - we're actually the only Americans I can see sitting around us hahaha!", "author": "Sheila H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-29", "description": "YUM. One of best pizzas I have had in my life. It's even better than my beloved Costco.\n\nThe crust is awesomely thin. Two girls and one boy finished a large with basic, sausage, garlic. I think what really makes it is the cheese and sausage. It's not precooked meat. They have a pile of sausage that they pinch little pieces from and throw it on to the pizza. SO good. The cheese is also fresh mozarella... not the shredded kind. Next time, I would skip out on the garlic because it was slightly overpowering but still good.\n\nIf you want to minimize your wait time try to make it for the first seating... meaning... go there at least one hour before it opens. We went 30 minutes prior and we had to wait a total of 1.5 hours. But it was way worth it.", "author": "Beverly T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-03", "description": "Man...\nI'm not that much of a pizza girl, but...man.\nI had to check out myself to see why are they so famous and guess what???\nI gave them five stars, the only way for you to understand is not to read but to go there and try them. \nI'm licking my fingers already.\n\nby Daiana Noel", "author": "Daiana N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-26", "description": "I can't imagine what it would have been like if one had had to wait in the seemingly endless line.  \n\nJ however glided up to the front of the line and secured us an original with extra basil to go.  15 minutes later we were setting on the dock watching the \"waterfall\" and eating good hot pizza.  This is the way to do Grimaldi's\n\nSauce is a bit too tame, crust could have a bit more crunch, good pizza, but I wouldn't wait for it.", "author": "kellan e."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-10", "description": "A MUST New York Experience:\n\nWalk across the Brooklyn Bridge, stop in the middle and take picture of self with the incomparable NYC skyline behind you. After exiting the bridge, walk back and underneath it to walk towards GRIMALDI's. Wait in line for 25 minutes to go inside and eat the BEST PIZZA in NYC.  Italian style thin crust slices of heaven.\n\nAfter patting stomach and taking another picture to chronicle your success, exit restaurant and proceed to Junior's for the BEST CHEESECAKE in NYC.\n\nTake subway home and sleep.", "author": "Susan N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-06", "description": "Best pizza in New York? Far from it but if you can overlook the massive hype for this place, it still has a pretty decent pizza as well as a few really interesting toppings and varieties to check out.\n\nThe pizzas are small and bit pricey, while you can split one with another person, the chances are you can pound down two or three of these easily if you aren't keeping track.\n\nThe crust is thin and the sauce is more tomatoey than it is tangy. They cover their pizza in an unapologetic amount of cheese or toppings to the point where you can hardly taste the flavor of the slice.\n\nHowever, the hype is still there and if you're in the Brooklyn Bridge area and you have a large group of friends, you can still have a great time here. Just if you're on a quest to find some amazing Pizza in Brooklyn there are better options to look into.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-22", "description": "After living in NYC ofr 7 years, I finally trekked out to Brooklyn to try Grimaldi's. We got there and saw that the line was already way out the door, but it moved fairly quickly. I think we were seated in 40 minutes--but then of course there was another wait once we sat down due to the poor service.\n\nWe ordered one large pie with sausage, pepperoni, roasted sweet red peppers and mushrooms to share between two people. This is a perfect size for two hungry people with a decent appetite. The pizza came out and it was a bit overwhelming, I have to admit.  Can't give this place 4-5 stars because the pizza was a little too soggy in the middle with pools of juice from the peppers and also because the service here is pretty bad--but what can you expect from a famous establishment?\n\nThe pizza itself is quite good and the center will firm up a good bit as it cools down some. Also to be fair, you probably wouldn't have this abundance of liquid on the pizza if you got different, more dry toppings. I love the thin crust and the ingredients were so fresh and the meat was good as well. The sausage had just the right amount of spice, and the pepperoni was smaller in diameter, thicker and pinker than the stuff you find from fast food chains.\n\nOverall, a lovely experience. If you're on a date, just walk down the street to the pier for a romantic evening--the view across the river into lower Manhattan is so picturesque! I saw so many couples on the pier enjoying their time together. I would recommend this place as a very casual 3-4th date spot.\n\nDefinitely would like to go back one day.", "author": "Stella Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-03", "description": "After having lived in Manhattan for 20+ years, the land of fabulous pizza on every corner, I was kidnapped by an out of town guest determined to follow the tourist track who dragged me to Grimaldi's kicking and screaming to sit with a bunch of tourists with nary a New Yorker in the place!\n\nFrom the looks of the crowd there it's probably in every guide book on the planet for which you'd expect worse. So long story short; OK But not worth the trek. Given the taste was fresh, not the typical canned tomato sauce you get. But there is equal or better pizza on most any corner in Manhattan especially now with the new breed of artisanal pizzerias these guys can't really compete unless you're a tourist and don't know any better and are afraid to enter your local pizzeria.\nI have to say that those that give it high ratings really don't know much about NY Style aka Sicilian pizza. So yes it might be 4 stars if your idea of pizza is Dominos.", "author": "Valerie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-28", "description": "This was a pit stop on a food tour I recently went on to celebrate my roommate's birthday (happy birthday roomie!). \n\nThe pizza is second best around. I've had Lucali's, and they just had me at hello. The wait was insane - we waited an hour and 20 minutes for 2 plain pies to go (we went to the park down the street and ate there). The pie was pretty good - brick oven, all fresh ingredients - our mouths were watering the entire time we waited.  There's nothing better than good pizza and then some ice cream (Brooklyn Ice Cream Factory - right around the corner). \n\nNot gonna lie, it was a lovely day with lovely food.", "author": "K W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-11", "description": "Worth the trip coming from the UES on a Saturday afternoon. We got there around 4pm there was already a line but it wasn't as bad as I expected it to be.  Placed our order took about 20 minutes and our pizza came out perfect! Fresh mozzarella and pepperoni on thin crust was super yum!  Best pizza in New York!!!  No slices and cash only.", "author": "Angel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-03", "description": "my native new yorker college roomate said if i ever get to NYC, hit up Grimaldi's and I understand why.\n\nThis is GREAT NYC pizza. Good food, prices, and atmosphere... a true institution. Remember to fold the slice!\n\nremember to bring CASH!", "author": "Inga R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-13", "description": "The only reason that i deducted a star is because the client base is made up of tourists.  These tourists will, due to the proximity of the seats, invariably annoy you with such 'can't-help-but-over-hear-it' charmers as \"The best pizza I had before this was in Breckenridge...\", \"Do you want to get take out to get out of here faster?\" , and \"Mmm, just like I read it should taste\"\n\nIn closing, the 'Battle of the Pizzas\" special I watched on the Learning Channel was right, this pizza tastes phenomenal, took forever to arrive, and is definitely the best I've had since that slice of Fatty's I enjoyed in '89.\"", "author": "Jason C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-25", "description": "the best quality ingredients pizza I have ever had! The cheese was so yummy as it melts and stretches as it goes into my mouth. it was worth me strolling my luggage in for a bite before i hit the airport. its super crowded though so get their early!", "author": "Beach L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-11", "description": "Grimaldi's Pizzeria is overrated.  Got the pepperoni.  The pizza is baked in a coal oven with fresh basil and fresh mozerella.  The sauce is nothing special.  The crust gets soggy.  I can't stomach the fact that folks will stand in line --- a block long --- in freezing weather for this stuff.  Thank GOD I didn't.", "author": "BrasilPo P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-17", "description": "The pizza is really good, duh.\n\nBut is it the best? I'm not so sure. It does have a certain taste you won't find anywhere else -- that true, charcoal brick-oven taste.\n\nIs it worth a long wait? If you're in town for the day only, definitely. It's practically the biggest landmark in the area aside from that bridge.\n\nIf you want to get in quickly, head over for lunch on a weekday. You shouldn't have a wait over 2 minutes. If you do, check out Front Street Pizza instead. It's another (much different) joint with a big following, and classic NY pizza.\n\nAt Grimaldi's, the price is awesome for such a famous place ($14 for a plain), and the service has never been anything less than great. You're crammed in with 100 other people in tight space, but it's worth it.", "author": "Kenny K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}