{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-23", "description": "excellent pizza in an iconic restaurant ruined by terrible service and carefree attitude towards the diners-IF the wait is longer than 30 minutes you should double think this decision as it will be at least another hour inside-again, for good pizza, but terrible service and manners didn't make up for the food", "author": "M P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-06", "description": "We had Monday lunch at Grimaldi's.\nTook the subway into Brooklyn and walked right over.\n\nThere was no wait, and we were seated right away.\n\nLights and camera...wonder what's going on...\n\nWe were super hungry, so we ordered the small with sausage and mushrooms.  Pizza came out in minutes.  Hot and yummy.\n\n...hmm...that camera is filming me eating...but this pizza is sooo good...\n\nThen the pizza was gone.  All gone.  \n\nThen we paid the bill and on our way out, we met the guy with the microphone, and the camera was pointing at us again.  \n\nQuestions...why did you come here?  Manhattan slice of the Brooklyn pie...???  \nThen we found out that NBC is taping for a segment airing on Saturday (12/8) at 7:30.  Look for me on TV!!!\n\nOh yeah, pizza was crispy and doughy, cheese, toppings, and basil - oh so good!\n(Chicago pizza is still be best though!)", "author": "Kyung P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-31", "description": "On my recent trip to NYC, a pilgrimage to Grimaldi's was the first thing on our list (after a walk across the Brooklyn Bridge, natch).  I waited in line while the rest of my family went to the nearby Brooklyn Ice Cream Factory for snacks (very yummy). Once we got in an piled into our table, we kept it simple: half pepperoni and half cheese with the antipasto dish. Everything arrived and I'm thinking, \"That's it?\". Looks can be deceiving so I kept an open mind and dug in.  After finishing everything I'm thinking, \"That's it?\". I cannot, for the life of me, figure out what the big deal is with this place. I had better pizza in NYC next door to my hotel.\n\nI would have given three stars but I had to wait an hour to get in.  The line isn't their fault but if I wait an hour I should get a better-than-three-star dinner.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-06", "description": "It may be a tourist trap. You may have to wait in a line that (at least when I was there) extends to the other end of the block. But it is damn good pizza. Damn good, authentic (well, at least more than Dominoes) Italian pizza. \n\nWe had the pepporoni and garlic and one with sausage and mushrooms. They were simply amazing! Fresh mozzarella on all the pizzas. I'm not sure how you can go wrong. You know, one thing did go wrong--our sausage was a little undercooked on part of the pizza. Scary for processed meat. They threw it away and made us a new one. Not burnt. Just done all over the second time. The manager that evening came over to ask how things were going. We mentioned that the sausage was a little raw, but that the server had taken care of it. He said, \"we do not make raw sausage,\" promptly got up from the table and talked to the kitchen. Really hoping no one got in trouble, that stuff happens, but you know, I like the proactiveness. \n\nHad all the desserts. Large table, fun for sharing. They're all great. But, um, the connoli was un-freakin'-believable. I've had my share of connoli, this was the best. If you save room for dessert (yeah, it's impossible to do), get the connoli. \n\n...and so p.s. and not really relevant to my review: how is the manager of this place driving a Bentley?? Just asking. Though I could conjure up a few answers myself.", "author": "Sarah W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-05", "description": "I really like the pizza at Grimaldi's - I do. It is the best pizza I've ever had. And if you go right after work or for an early lunch there's no line to get in. But after my last experience there last week, I don't think I'll be ordering anything there anymore, not at this one. \n\nMy husband had seen a calzone the last time we were there and that's all he could talk about for weeks, so when we got there that's what we ordered. Unfortunately they put too much into it, so it took 40 minutes to get it. In the meantime, we were able to notice how the tablecloth hadn't been changed in days. And how there were mouse droppings in the corner - EEK! \n\nI'm pretty sure calzones come with cheese and sauce in them, but this one was all cheese. We asked for some sauce on the side and the server brought it out in a mug. The mug was all crusted over with sauce - it looked like it had been left over from somebody else. And the calzone was cold in the middle. \n\nWe ended up leaving right after which nearly made me cry as the couple next to us had a delicious looking pizza that came quickly and smelled so good. So don't get the calzone! And I'll have to try the Grimaldi's in Douglaston and pray its a bit cleaner. :(", "author": "Rebecca G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-03", "description": "The atmosphere is so-so, the grumpy manager is not making the scene any better. I think this place is overrated. Pizza is delicious though. Long queues in front is a bonus.", "author": "Baris D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-30", "description": "The place is kind of dirty and the pizza is just ok, dough was undercooked.  Not worth the line and they don't take credit cards.  Overrated.", "author": "Ilana A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-10", "description": "Really good pizza, the lines are out the door and kind of ridiculous, go early, they let tour bus loads of people in this place and your wait can ne an hour long.", "author": "Vaughn S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-07", "description": "The best pizza I have had in New York, simply the best.\n\nLight, cheesy, perfect sauce - fresh ingredients, soooo good.\n\nThe line was long, it was very crowded and worth every bite.\n\nWe had a large pepperoni and mushroom pizza -- I wish I could\neat it every single day!", "author": "Andrea C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-23", "description": "The line outside is intimidating but it does go fast.  We got pysched out and decided to do carry-out instead.  But while waiting for our pie, we watched the folks who came after us and we realized we would've been seated already if we opted to wait it out in the line.  Foo on us.\n\nSo we took our pie and ate it on a bench along Fruit St, overlooking the river and lower Manhattan.  Before you think, \"Oh, romantic!\"  Wait.  I think the Hubbs and I would've preferred the A/C restaurant.  It is August after all.\n\nIt's nice that Grimaldi's makes their pizza \"old school\" with a coal-burning oven but taste-wise, it was just okay.  ....Wait, coal burning?  Hmmm, maybe they should go less \"old school\" and more \"politically correct.\"\n=p", "author": "Leni A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-15", "description": "Yummy sauce. Yes, we waited 45 minutes on a Sunday (plus 20 minutes inside for our pizza). Was it worth the wait? Well, not exactly. But at least we can say we did it. \n\nThe dough was definitely chewy, mostly all chewy. I was expecting a bit of crispy crust on the exterior then the chewy inside, but it was no where to be found. It was definitely good pizza, and me and my boyfriend finished a large pie. \n\nI can only imagine how it looks in the winter with people wearing their stuffy clothing and scarves.. we were packed like sardines in there without someone wearing some obnoxiously large coat!\n\n\n--- ps cash only! ----", "author": "Melissa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-16", "description": "Admittedly I'm not from NYC, but I've been to 10 or so of \"the best in NYC\" - at least from what the Yelp reviews say - and this is easily the best.  The sauce is the most pungent, the cheese the richest, the toppings the most well-cooked, and the crust the best blend of crispy and soft.\n\nThe big negative is the wait - an hour seemingly at any time of the day.  And be careful going between 430p and 6p, where they have to re-make the fire which means they don't serve any pizza for 30 minutes (my lord!)\n\nI'm a chicago-style pizza guy through and through, and this is the only pizza in NYC that ranks up there with the chicago places.", "author": "Jay F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-08", "description": "This is just average pizza.\n\nThe most enjoyable part of this experience is walking across the  bridge.\n\nTake off a star for the hellish wait.", "author": "Jen G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-02", "description": "I've eaten here a couple of times whenever I visit NYC.  I like to walk over the Brooklyn Bridge and then eat here so I don't feel so guilty for pigging out.\n\nThe pizza is great and I could eat a couple of them.  I love the crust.  Very tasty pizza and when you visit NY, you should definitely eat here.\n\nThe only drawback is the bathroom situation, and drinks come in cans, and you get the feeling they want you in and out in a jiffy - which they do 'cause there's usually people waiting to get in.\n\nAfter eating here, take a stroll along the Brooklyn Promenade.  Great views!", "author": "Cranky Greg M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-30", "description": "It lives up to the hype.  My wife and I go there every time we're in Brooklyn.  Brave the long line instead of doing takeout and rub elbows with the other patrons.  Simple menu and near-perfect coal-oven pizza.", "author": "Jordan P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-25", "description": "Grimaldi's Pizza is known for being among the best pizza's in NY. I have to strongly disagree. The pizza was \"good\", and by \"good\" I mean that although it was one of the worst pizzas I've eaten, to me NY pizza can really never be bad. Unsure why there is so much hype about this place? Oh, well, got to check it off the list, I guess... meh :-/", "author": "Ashley F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-13", "description": "Grimaldi's pizza is indeed the best pizza in NYC. My friend and I went to Grimaldi's on a cold winter night, after walking across the Brooklyn Bridge from Manhattan, which definitely worked up an appetite. And going at night, or when the weather is not great, is the best time to go to Grimaldi's, because the line/wait to get inside is shorter and faster. Once inside, the tables are very close together and the ambience is casual and has an old town feel, with all the pictures hanging of the owner posing with famous celebrities.I think the atmosphere greatly added character and flavor to the pizzeria, which , other than the pizza, is a major reason why New Yorkers and tourists must come here once to truly get a feel of a NYC old style pizzeria.  My friend and I ordered a pie ( they only sell pies, with either 6 or 8 slices, and more I think as well) that was half pepperoni, half cheese. Our wait time was alright, only about maximum 15 minutes. During this time, I realized as I looked around that many tourists do frequent the spot, which added to the location's bustle. One we got our pie, the pepperoni on the slices were thick and savory, tasting very fresh and real compared to other pizzerias' dismal pepperoni cuts. The crust was perfect, not too thin nor thick, and had an almost  lightly-buttered aftertaste. The cheese pizza was perfect as well. A definite for tourists, especially after a walk across the bridge, and locals alike looking for a great bite to eat at great prices ( cash only!)", "author": "Jemi J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "A NYC classic experience. While not traditional NYC style pizza, this thin crust pizza is possibly the best pizza I've had in the area (and maybe anywhere). Try to go when the line is short or you may face an unfortunately long wait.", "author": "Julie E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-23", "description": "Maybe my sentimentality regarding spending a memorable time here with family I never get to see has tainted my ability to rate Grimaldi's without bias. Maybe the fun I had with 10 of my cousins, competing to see who could create the best pie has veiled my senses.\n\nKeeping that in mind, Grimaldi's was an experience I would have been disappointed to miss out on. Sure it's a wait, but it wouldn't be as good without the wait. I see this as an equivalent to Pink's Hot Dogs in Los Angeles. Sure the hot dogs aren't that amazing, but you're going there for the chance to experience it with good family and/or friends.\n\nIt just didn't hurt that their pizzas also happen to be pretty damn good.", "author": "Emily R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-22", "description": "Delicious pizza! Showed up around 4ish on a Sunday afternoon and only waited 20-25 mins. You seem to be seated faster as 2 over a group. Strange but for 20-25 mins after we sat down no one seemed to get any pizza! Then they started all coming out, we got ours after 30 mins..... Bliss! Happy we tried it and would come back!!", "author": "Tash R."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}