{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-07", "description": "Was it good? Sure. Was it worth an 1 hr long wait in the blazing heat? No. \n\nI never went to the Grimaldi's at its original location next door so I can't attest to whether the quality has gone up or down since relocating. However, I can say for certainty that Lombardi's beats Grimaldi's (new location)", "author": "Ryan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-24", "description": "By far one of the best pizza's in NY; tons of flavor packed into every bite, super-fast service...you gotto love the bold old school Brooklyn, NY attitude that you'll get. The intense line is a bit silly and touristy, because honestly there's great pizza all over New York", "author": "Sam T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-29", "description": "After walking back over the Brooklyn Bridge on a weekday, we decided to give Grimaldi's another go.  I found the pizza to be just ok (as did the friendly couple next to us) which was a little disappointing after waiting for 40 mins.  Once again the pizza was slightly soggy in the middle but not as much as last time.  With the 2 experiences combined I'm gonna give it a 2.5 stars.\n\nIf you really want to go here are some of my tips after waiting in line:\n\n1) Take out orders wait in the same line, but if its a nice day its worth getting take out (you need to tell them you want take out when they take down the number of guests).  Even though you will wait in the same line, you will typically wait less.  Once you have your pizza take it down to a nice spot on the water not far away\n\n2) A group of 3-4 is probably best.  There were a lot of couples in the line before us.  Much to our disappointment the person manning the line would often let groups of 3 or more skip the line.  It seems that he only reserves the tables in the middle of the restaurant for couples and the booth like tables on the outside for groups of 3 or more as they can squeeze ppl into the booth side.  Ultimately it will depend on line on the day, but this certainly was what happened to us when we went.", "author": "Trent C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-10", "description": "My friend and I were in NYC for a day. We of course tried to cram as much as possible for our very busy day. We drove to Brooklyn (yes... drove) from Manhattan. It wasnt too bad of a drive but trying to find parking in this area was complete hell. We ended up parking in a neighborhood about a mile away but the pizza was worth it. :) \n\nWe showed up last Saturday afternoon and waited in line for almost two hours. It was intermitently raining so that part sucked. But after about an hour and a half wait, we finally got in :). We sat down and within five minutes our order was in (a small pepperoni and sausage with two sprites). They brought our pizza in like 5-10 minutes. The girl next to us seemed really annoyed they brought ours first since she had been waiting a while but... oh well.. her pizza was larger so it probably took longer to make. \n\nThe Pizza was SOOO good. The sauce was great. The cheese, fresh mozarella slices , was just enough and the meat was seasoned right. The crust was thin and soooo crispy. I loved it. I had two slices and took my last one to go. My friend had all three of hers and washed them down with her sprite. If we wouldve been going back to a hotel with a mini fridge and microwave, we wouldve bought another but.. alas... our hotel didnt have either. \n\nI really wish they sold single slices so that people wouldnt have to wait for so long. They could make a lot more money. If im ever in NYC again, I'd love to come back but I wouldnt make the mistake of coming on a Saturday night again.", "author": "Kat G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-28", "description": "We got here 15 mins before opening to avoid a line.  Good thing too because a few minutes after wards, a line started forming! Four of us split a tomatoes pie with pepperoni and mushrooms, as well as a white pie with sun-dried tomatoes and ricotta cheese. Their pizza was my favorite of all the ones I've tried I'm New York. The crust was thin and chewy and the fresh mozzarella was cut into such thin slices as not to overwhelm the crust. I also liked how the pepperonis were so cute and mini. Great, great, great pizza and atmosphere all around!", "author": "Jojo L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-21", "description": "I'm a Chicago girl, so naturally consider myself a pizza expert.  I wasn't expecting to be an east coast pizza convert, But after sampling Grimaldi's, I have to say I'm a believer.  I thought service was good, and our host had the proprietary air of the owner.  Either way, he was a sweetheart,  and I left feeling like I belonged in the neighborhood.   The pizzeria was charming, but packed.  The pizza was a dream.  The sausage was superior to any I've had.  It was piping hot and quick.  The crust was crispy on the bottom and crusts, but the crust had a tender interior that really grew on me.\n\nThis dream pizza date was preceded by a walk across the Brooklyn bridge and followed by ice cream at Brooklyn Ice Cream Factory.  Perfection!", "author": "Kimberly D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-14", "description": "I reviewed it's competitor, Lombardi. Gave this place one star less, for several reasons:\n1) How much better can pizza get? Lombardi Vs Grimaldy is either the same, or just a tad different. \n2) Place is too small. And no, I will not be one of those people that wait in line for 30mins-1hr so that I can get a pie to go. \n3) Because of the hectic environment, service is a little rude/pushy. But you know how that's like. \n\nIf you come here to wait for a pizza to take to the park nearby, it'll be alright. But come here on a date?...good luck with that.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-05", "description": "Good Solid Slice, so not worth the wait.", "author": "Danielle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-24", "description": "We waited. It was cold.  We sat down. Pizza was great. There's a not a lot more to say.  The pizza really is good, but you don't come here just for good pizza, you come for the experience.", "author": "Katrina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-06", "description": "Best pizza I've ever had. We got there at the perfect time because there was no line. We took out pizza Togo and ate it by the water. When we were leaving, there were at least 25 people in line. Glad we didn't have to wait. It still would have been worth it if we had to tho.  I heard there is one in Vegas now, but the original is always the best. It's not too far from the Brooklyn bridge. My sister and I had a whole pizza.", "author": "Nancy L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-16", "description": "Waited in line for about 20 minutes.  Hostess, a very rude man, asked how many in our group, 2.  Needless to say this was a BIG mistake.  He was sitting larger groups!  To avoid waiting longer, we sat at the bar.  Service after that was pretty fast, but our server, well that's another story.  Good pizza but Las Vegas is better considering the same name.", "author": "Laura S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-06", "description": "Pros:\n- Pizza! Fresh ingredients. Cooked in a coal burning oven. The smell is aromatic. We had riccota, olives, mushrooms, pepperori, and italian sausage. Ended up getting a 2nd pie because the 1st was so good. \n\nCons:\n- Long, long, long wait, but its worth it. Warning, dont eat too much otherwise you kill that good sensation of eating a great pizza. \n\nThis is the best NY in NY. Its too bad the walk from the Brooklyn Bridge is so long. Maybe they can build a stairway that drops you down instead of walking all the way to the end of the bridge.", "author": "Leon L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-06", "description": "Good pizza, but I wouldn't say it's worth the wait. Leave the lines for the tourists, and grab a comparable slice almost anywhere else.", "author": "Alexis M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-26", "description": "Given the wait for this place is 1.5 hours most of the time, already knocks one star off. \n\nNext, the sauce and meat on the pizza is minimal. Can you put a little sauce on this pizza, k thanks! \n\nThere is another location that just opened in the limelight market which doesn't (or didn't) have a long line, but albeit the pizza doesn't taste the same. \n\n\nBottom line: If there isn't a line, check it out. If there is a line and it is no more then 20 minutes long, wait.", "author": "Bryce A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-19", "description": "YUM! i only had a few bites of my host's plain cheese slice but the bites i had were delicious! crispy, cheesy, delicious sauce! yum-o!", "author": "Clara L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-29", "description": "Wait on line? I guess so, if you're a tourist. Consensus of self and friends. Grimaldi's trading on the name. The pizza runs hot-cold, which is common with a \"national\" brand. Juliana's, a couple of door down, is the original and always outstanding. \nThat said, my #1 is Keste, on Bleecker St. Check out their oven.", "author": "Arnie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-15", "description": "I'm more of a chicago style pizza fan myself, but if I go for NY style pizza this is one of my favorite spots. Make sure you bring cash.", "author": "Kevin G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-17", "description": "Keep away, don't waste your time or money! Pizza is good, more Neapolitan style vice NY style pizza. We were advised that it would be 15-30 minutes while waiting outside, we waited over an hour to get inside. Once we sat down, we waited over an hour for pizza. VERY poorly managed, VERY rude staff. Plastic cutlery, plastic plates, soda in bottles, no beer, no service by the wait staff. You will also be charged a service charge!", "author": "Emily Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-04", "description": "Don't wait in line for this place.  \n\nIf you can do take-out or there's no line, it's decent pizza and something to cross off your to-do list because of all the hype.  But seriously, there is much better pizza in NY, and in Brooklyn.  \n\nWe did take-out because I live in the area so we only had to deal with calling from the couch for 30 minutes (alternately busy and continuously ringing) and being hung up on once, after waiting on hold 10 minutes.  We finally got the order in and rushed over there to get our pie.  After a 10 minute wait (beyond the 20 minutes wait they told us to expect) we had the pizza and were on our way home, very excited.  \n\nIt was a pretty major disappointment.  The best part is the crust, but ours had been badly burned in spots.  The sauce was bland and there wasn't enough of it.  The cheese was flavorless and sort of rubbery (not fresh).  And the basil was just shriveled up in 4 or 5 hunks on the pie and didn't contribute anything to the flavor unless you got one of those bites..  \n\nIt was decent pizza, but nothing better than what you can get on many street corners in NY.  John's on Bleeker and Lombardis actually live up to the hype if you want to go to one of the famous NY city pizza places.  And a better option in Brooklyn, in nearby Fort Greene, is Graziella's - same type of pizza, done much better.  And they take reservations and deliver, like any normal restaurant that isn't just coasting on hype around the name.", "author": "Stephanie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-02", "description": "We waiting about half an hour to 45 minutes for 2 seats. We knew what we were ordering already because we had plenty of time as we were waiting in line.\n\nI like the simplicity of the menu. You pick your type of pie (regular or white) and size (6 or 8 slices) and then can customize it according to what kind of toppings you like.\n\nWe ordered a large regular ($14) with Italian sausage ($2), onions ($2) and fresh garlic ($2). The 8 slicer pie came out piping hot. It's a thin crust pizza with fresh mozzarella, crushed tomatoes and basil. There's a thin crust with loads of mozzarella and the slices aren't dripping with sauce nor are they dense and filling.\n\nI enjoyed Grimaldi's, even though our pie was a bit burnt. I also ordered an Olde Brooklyn in black cherry. The cold beverage was perfect with the pie and was not overly artificially sweet.\n\nI would come again, probably would be more inclined to visit if I had out of towners. The wait is just a bit long as well as the commute. Also, the seating is communal seating so expect eavesdroppers and you might even get someone who comments on your personal conversation, like we did.\n\nOf note, if the line to eat inside is too long, you can always order take out (you'll most likely still have to wait, but it may be shorter) and take your pie down by the water (there are tables and chairs outside the Brooklyn Ice Cream Factory) or to the park.", "author": "Janel Y."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}