{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-07", "description": "Best pizza period. If u are in Brooklyn u must try.  U will forget about the 2 hour wait once u are inside eating the pizza.", "author": "jia k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-24", "description": "Beware of sunny weekend days, the line can be 3 hours long.  But this place really is one of the best places to get a New York pizza.  Plus it's a nice area to walk around and you can grab some icecream down the street afterwards.", "author": "Karen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-21", "description": "One of the best Pizza's I've had in my life. Luckily when we went we didn't have to wait too long. Everything just tasted right and it was fresh. I wouldn't change anything about it. Pepperoni \u0026 Mushroom pretty hard to mess up.", "author": "Dustin W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-13", "description": "This was a very good pizza, but not a great pizza.  The crust was outstanding, but the cheese, sauce, oil, and herbs were so haphazardly applied that each bite either lacked in or overwhelmed you with one ingredient.  That being said, the quality of the ingredients used make this an almost excusable offense.  However, a five star pizza should create something greater than the sum of its parts.", "author": "Casey G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-14", "description": "The best I've had in the city.  I love Fornino's, but that's more for pizza with the frills, like capers and anchovies and fresh herbs and such.  At Grimaldi's I got the plain, and it was perfect... add to that nice waiters, a great vibe... and, again, the pizza... THE PIZZA.\n\nSigh.  I can't wait to go back.", "author": "Patrick W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-19", "description": "Pizza was good but not as good as one may expect. The staff is rude, the service is horrible and the atmosphere are depressing. My advice - call your order ahead, pick it up without talking to anyone and go enjoy it at home or better yet at the park enjoying the view.", "author": "Alex T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "Best pie I had in NY. Worth the substantial wait.", "author": "Jason L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-06", "description": "Not worth they hype. The wait was long and the pizza turned out to be mediocre. HOWEVER, I would try it again...", "author": "James H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-18", "description": "\"Yes! Yes! YES!\" is what I would have been saying if my mouth wasn't crammed full of delicious delicous Grimaldi's pizza. I make it a point to go here every time I'm in the city. The generously sized pizzas are easily and quickly devoured even by the lightest of eaters as they discover previously unknown room in their bellies. It's that good.\n\nLast time I was there I sat next to a couple who have ate two entire pizzas! Each! That's 4 pizzas total! and they weren't lardos either. It brings out the best in people.\n\nYou may have to wait outside on line for around an hour. But it's worth it. The wait staff may be impolite and somewhat rude. But it's worth it.", "author": "Joseph B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-30", "description": "The line is crazy long but it moves fast. You also get the opportunity to give tourists tips on great New York activities while you wait!\n\nThe pizza is awesome. Everything is fresh and yummy! The sauce is perfectly balanced to the cheese.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-08", "description": "I'm a bit new to New York Style pizza. My heart is still in it for Chicago.\n\nThis is a great place to go; just walk from Manhattan, over the Brooklyn Bridge, then stop for a pizza. \n\nYou'll likely have to wait in line. Though; don't worry. They move pretty fast. They'll usually let people in blocks of 4-8 people every ~5/10 minutes.  It will be a bit crowded inside.\n\nThe food, was so good. The pizza sauce has a slightly tangy flavor too it. It really tastes like they use fresh tomatos and ingredients. The mozzarella.. I'm not a cheese lover.. but it as so good.\n\nNow as for the basil. It comes with a few here and there. Get extra. I'm not a basil person; but the basil complements the sauce so well. Perfect!! We're getting extra basil next time.\n\nThe pepperoni was crispy.. crispy spicy pepperoni. Can you beat that? It's thick.. and flavorful too. OMG.. so good.\n\nThis is definately my top New York Style pizza place. :)", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-21", "description": "Just Go eat there!!!!\n\nA small place in Brooklyn with a nice view of the Brooklyn bridge and Manhattan sky line. Brick oven pizza that is just delicious. Delicious!!!!! can i stress anymore GODLY!!!!  The place is small, we went during lunch time on a weekday there was no wait.", "author": "Regina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-27", "description": "Grimaldi's is a place to bring out of town guests.\n\nArrive about half an hour before you actually anticipate your hunger coming on...that way the line isn't unbearable. \n\nBring cash.\n\nAlways order large.\n\nDon't expect great service. They want you in and out. Theres a line outside. This is completely no-frills. \n\n...don't bring your camera. You'll be looked at as a tourist.\n\n: ]", "author": "Jenna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-17", "description": "Loved the cheese on this pizza. My friend and I shared a small pizza with pepperoni and mushrooms (I think it came out to $16 with 2 toppings). I've heard there can be lines, but we had a zero wait time since we ate on a Monday at 3pm.", "author": "Ziggy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-08", "description": "I am lowering Grimaldi's a few stars because it just doesn't seem to be as good anymore. Sorry Grimaldi's.  Yet, if you're a tourist and in the Dumbo/Brooklyn Heights area, you should probably still check it out.  Of course, I'd say go to Di Fara first if you have the chance.  Now that is true Brooklyn pizza at its best.", "author": "Joolz M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-01", "description": "A shadow of its former self. The wait staff are rude and unhelpful. They forgot our order after we waited for over an hour outside. The pizza arrived and it was so salty it was practically inedible. Worst of all, we didn't get an apology. There are plenty of better NYC pizza joints than this.", "author": "Ron D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-31", "description": "Pizza: 4 Stars\nLine management: 0 Stars\n\nTell me why the take out line and the waiting for table line is the SAME line!  I went with my family and my dog to Brooklyn Height and wanna to try Grimaldi's therefore I want to get take out since my dog can not go in. The guy told me if I want to get take out, I have to wait on the same line as people who wants a table. FINE! I was expecting to wait anyways so I waited online.  We waited for 2 hrs because he keep on call party of 2. Finally we are the first on line and the guy who is managing the line refuse to let me in to order my take out. He keep sending people of 4 in and they are the people who is lining up behind me. I ask him what am I waiting for and all he said was,\"pls understand these are people who are dining in and you are taking out.\" I was like I totally understand that, but why can't you let me in to order my take out first since I am next in line and they are behind me! Then he had the nerve to tell me that these ppl are there lining up longer than I am! I got very piss off and start to screaming at him and was like I was online waiting as long as these pplz are and longer! I am in font of them how can they be waiting longer than I am!! These doesn't make ANY SENSE!!! \nAfter all these talking back he has nth to say and just send in inside to order! This whole line management thing is very F*CK  UP! I dun care how good the PIZZA is but I am not going back!", "author": "Jody H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-15", "description": "This place is terrible.  A complete tourist trap, with incredibly rude staff \u0026 owners and a massive wait.", "author": "John D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-29", "description": "Im taking a star away for the wait. The LONG LONG hour wait. Pizza is fantastic.", "author": "Samantha W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-05", "description": "We waited about 10 minutes at 12:30 on Monday, but when we left, the line was probably an hour long.  Great pizza, but probably not worth the wait.  I prefer Il Fornaio in Little Italy - but they only serve pizza at lunch.\n\nFriendly inside.  Fast, bustling, no frills.", "author": "Bill L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}