{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-05", "description": "I absolutely love this place! They have the best pizza ever, seriously. They beat out every pizza place there is. Coming here has made me a pizza snob. \n\nIve only been there twice, but I think its becoming quite popular because the second time I went, my friend and I had to wait like 25 minutes whereas the first time I didnt have to wait at all. \n\nAnyway, I always get the white cheese pizza with tomato and basil and it is absolutely fantastic. Its so thin and perfectly made, it just melts in your mouth. The size is the right amount to fill you up too, one whole pizza can fill up two people. Sometimes its not enough only because its so scrumptious you want to keep eating more. \n\nThe service is great, everyone is really friendly and nice and the owner is also very sweet and nice. The prices are about the same as one of those chain pizza restaurants except its actually worth it to get pizza here.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-21", "description": "The standard for which all pizza should be based. Outstanding pies!\nWe got a plain cheese \u0026 it is probably the best pizza I have ever had; I am salivating now as I think of it. \nMinus one star for \"cash only\" with a broken ATM in the foyer; sorry for the seventy-two cent tip Mr. Server, I only had thirty bucks in my pocket.", "author": "David W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-17", "description": "Good pizza that isn't worth the wait.  Both the cheese and sauce tasted really fresh, but the middle of the pie got real soggy pretty quick.  Prices aren't bad, service was great, but I can't say it was THAT much better than a slice from your favorite local pizza joint.  Maybe my expectations were too high.  A-OK.", "author": "Peter L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-21", "description": "This is the BEST PIZZA I have ever tasted outside of home! I was very impressed (and very hungry). A local friend recommended that we try this place. It sits right under the Brooklyn Bridge in a quaint area near the river. I heard that it gets packed all the time. There was a waiting period for us when we got there, but it was well worth it.", "author": "Cesar C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-08", "description": "Beautiful day in the city so I decided to walk to walk across the BK Bridge and act like a tourist. Took a couple pics on our way across to BK for some Pizza by Grimaldi. Learned about this pizza shop after watching a program on Chicago and New York pizza on the Travel channel. The pizza looked amazing so I had to go to this place. (I have a couple other ones aswell to visit) We knew we had arrived at this place after we saw a long ass line. We then go on lline aswell. People kept leaving because they were tired of waiting. Very excited at this point as we were getting closer and closer to the door. People were coming out stuffed. We were waiting for a third party by the time we reached the door. They kept skipping us because they were lookin for partis of two. The person finally arrived and we made our way in. First thougt was \"wow! This place is small\". You look around and you see old pictures of famous people who have visited the pizza shop aswell as regular people who are fans. You also have italian music playing which makes this a very authenic place. We ordered two pies. A plane mozzarela and basil pie and a pepperoni, sausage, roasted peppers and sun dried tomatos. I must say the best pizza I ever had. The toppings were so fresh. Never had anything like it. I used a knife and fork just so that I can take my time eating each slice. Nice and hot with a great aroma. Service is great aswell. Very attentive The pizza took 30mins to come out but it was worth it. Waited an hour online for the chance to eat Grimaldi's pizza but worth every min. Just sad that now that I kow what the pizaa taste like im gonna have to wait in a long ass line to get my craving over with.", "author": "Michael J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-22", "description": "Best Pizza I've ever had, hands down.  Something about the sauce in the pizza makes it stand out from others that I've tried.  If you goto Brooklyn, NY check this place out.  It's cash only, there's a significant wait in line since the place is really small.", "author": "Francis M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-22", "description": "My first review on Yelp: I m from Australia, i was starving from a jogging on Brooklyn bridge, and I decided to have my dinner somewhere near the pier. I saw the line up in from this restaurant, and decided to give it a go. Pizza was good but not great, I mean, better pizzas are out there at a similar or a bit higher price, at least I tried much better pizzas in Melbourne. Service is ok not so good. A gentleman sat next to me was surprised abt the size of the crust, yep even the regular size seems to be huge to me. So he asked waiter to make sure they gave him the correct size, and the waiter said 'yes, yes' and rolled his eyes.. I understand it is a Cash only restaurant, but The ATM inside charges $4.5 as CC surcharge, outrageous! I d like to give it 2.5, but Yelp doesnot allow me, so I d like to give it \"Meh. I've experienced better\".", "author": "Ming L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-02", "description": "delicious! we waited in line at 10:30 on a Friday night, in the freezing cold, so i was hoping it was worth it. The line took about 30 minutes, once we got in, we were definitely cozy. The tables are so close to each other and it so crowded, but once we ordered, the pizza came out within 10 minutes. The calzone took a bit longer.  Everything was so fresh and tasty. The pizza seemed to get cold quickly so eat up as soon as you get it! Just the right about of sauce and cheese. I'm definitely glad we waited and would def make a trip back!", "author": "Jenn T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-12", "description": "Now, why is it that this place getts so many good ratings is beyond me.  I think itmay be due to the fact that it was really good in the past and had built up a reputation as well as being one of thepioneers of te kind of pizza it serves.  Well I have gone a couple of times, and no way in hell is it worth the line that people from outside of this place.  I would never, never, wait in line for a pizza for an hour to start with, but for their pizza...  Both times we went, it was disappointing.  So many other pizza places that are so much better ( Lucali's, Franny's).", "author": "M F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-10", "description": "Hands down, best pizza I've ever had. Ridiculously long line ... on a Saturday night, waited about an hour and a half to get a table. It's a small space, so be prepared to get veeeerrryy close to the rest of your table and other random people around you also waiting for some delicious pizza. And depending on how much pizza you get, space is also going to be a bit short on your table. Not too bad of a wait for ordering and for the pizzas to get to our table once we got in. The pizza itself ... delicious. Good crust, fresh and delicious ingredients, piping hot ... absolutely no complaints here. Only praise and the residual taste lingering on my tongue. If you're visiting New York, this is a fun trip to take - knock something else off your list and walk across the Brooklyn Bridge beforehand (and/or after .. gotta burn off those carbs somehow!) to enjoy this pizza. Alternately, go to the location on 6th Ave for no waits and the same quality pizza.", "author": "Victoria B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-13", "description": "Went here for our pizza meal while in NY based on reputation and reviews. Waited about 20 minutes in a line outside. Seems like there is always a line. Got seated and promptly served. The menu is simple, pretty much pizza, calzone, antipasto. The place was packed and the seating is cramped. It is clearly an old building and it shows. The service was not rude or gruff, just fast paced, as pretty much everyone seemed to be constantly working on something in there. \nThe pizza was excellent. The olives were the most flavorful I have ever seen on a pizza, almost too much so, as they had a little too much salt on them. The pepperoni was great in thick small slices that curled up when cooked. The cheese is fresh globs on mozzerella, rather than tons of shredded cheap dry mozzerella. The large pizza with 5 toppings set us back $28, but honestly, that is not much more than I pay for a large good pizza at most independent places. It was the meal we felt was most worth what we paid in NY during our trip. All in all, really good pizza. No credit cards though, which I cannot stand, especially considering how many other places in NY only take cash. What is the deal with that? Also, they say No Takeout, but I saw people walking out with full pizzas packaged up, so I am not sure on that one.", "author": "A. L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-08-12", "description": "So we are waiting on line the 2 of us. The white doorman says how many? We reply 2 of us. He walks in checks on seating and comes out and looks behind us and says to the 2 white ladies how many? They reply 2. He says step right in...Hello fudgepacker we were NEXT!! \"O sorry guys, i didn't see you guys standing there\". You get which way this review is going...Bunch of class-acts there. Son Im from BROOKLYN!", "author": "Drew M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-21", "description": "Ok, native Californian here.  We visited NY a few months back, walked a lot saw the sites, blah blah blah.  But my REAL intention was to find some great NY pizza!!   After walking across the Brooklyn bridge and talking to a few people we stumbled upon Grimaldis.  The weather was hot, the line was long but it was so worth the wait!  This pizza was excellent!  Yum!  Back in Cali, I have yet to be satisfied with great pizza, oh well my search continues......", "author": "SweetCA I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-04", "description": "its not the best pizza in the world.  and i'm personally more of a fan of deep dish.  however, don't let the long lines deter you - stay with it, try it out, and you'll walk out fulfilled in the tummy.  \n\nwe waited outside in the record cold wave but id say it was well worth it.  there was an old dude there directing people where to go and i assumed he was the owner.  he just exudes old school grumpy italian.  \n\nthe brick oven they use is authentic.  go make friends with the dudes making the pizzas in the back - it'll be worth it.  trust me", "author": "Jh M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-16", "description": "This place is always packed, but the wait is def worth it! Highly recommend! By Chris Fasullo", "author": "Fasullo C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-15", "description": "I don't know how people can complain about this pizza. I think the complaints against the pies here are just backlash from Grimaldi's legendary status because I am not lying when I say that this is perhaps the greatest slice known to man. Foodwise, they live up to the hype, and I was so so happy with how delicious it was. Mmmmmmm. We got a regular pie and a white pie with sausage, and I would highly recommend both. \n\nHowever. It smells like a foot inside, and it was too cold from all the air conditioning, which tragically made a piping hot pie turn to cold pizza far too soon for a slow eater like me. And although we were lucky and only waited in line for ten minutes at 6:00 on a Thursday night, that actually put us in a bit of a pickle. There were four of us, but two others were planning on coming, having warned us not to wait for them. We decided to just sit down and hope that they could squeeze in should they finally make it. Unfortunately, when one of our friends did arrive and attempted to come inside, he was physically accosted, and when I tried to explain that he had come to join us and would be able sit beside me on the bench, I was yelled at for about five minutes by a short old Italian man who had clearly let the power of manning the door at Grimaldi's go to his head. He was incredibly rude and his behavior entirely uncalled for. That is not at all how one should be treated as a guest and patron. There's a way to say \"no,\" without being an asshole, and it's probably worth mastering if you're going to be interacting with people for a living. So we immediately asked for the check, picked up our remaining slices, and walked out. It was an unfortunately bitter ending to what had been a very good meal. Five stars for pizza, but one off for bad smell and over zealous air conditioning, and another for the vile behavior of the host. I'd go back though, because it was freaking delicious.", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-16", "description": "yummy yummy pizza!\n\nwhat else can i say?  this place beats lombardi's.  however i'm a very impatient person so i don't know if i would wait the 1 or 2 hour line during prime dinner time.  we went at around 5:30 and while there was still a line it wasn't bad and it was worth it.\n\nthe pizza was good and i didn't feel like i was being rushed out like many busy places will tend to do.  this place isn't pretentious and yes its the same wait if you want to get carry out.\n\nI have yet to try Di Fara yet, so I may have to update this after I try Di Fara, but as for thin crust goes, this is my best choice for NY pizza spots.", "author": "Red J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-05", "description": "The pizza was indeed yummy like I was anticipating. But was it so mouth watering delicious that it was worth the trek from downtown NY, then worth the long wait in line.... I'm not too sure. I would recommend people to try this at least once, but I'm not sure if I'll be going back.", "author": "Elizabeth C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-05", "description": "imma go for 3.... i know. it may even deserve more. but a solid 1.5 hour wait outside. 10-15 minutes inside for the actual pizza to be made...? that doesn't even count travel time.. i mean... it's good. very good. piping hot.. that nice smoky, coal oven flavor... but... was it the best pizza i've ever had? eh. does the waiting in line while ur toes turn frozen, and ur clothes are permantely damaged because of the guy standing behind you was smoking the entire 1.5 hours --- deeem... worth it? errrhm...? i say... it's anywhere most defintely worth let's say 30-45 minutes. anything more... just.. you may want to reconsider.\n\nwe got extra sauce, cuz i read someone say it was a must. in terms of taste i'd say the extra did some good...it  may be a little dry? without it? but since it's so thin.. the pizza got soggy quick. so.. gamble gamble.. reg tomatoes may be dry - while extra may be a little too much...\n\ndon't get me wrong.. it's defintely a yummy pizza.", "author": "Mary K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-02", "description": "I'm working in New York for 3 weeks, in from California, and am still looking for a better slice than what I can find in Los Angeles.  I'm beginning to think that New Yorkers just have never had pizza anywhere else and assume theirs is the best.  Grimaldi's was Pizza #3.  After grumbling to some locals about the first 2 crappy slices I had, they said, GO TO GRIMALDI'S!  It's the best!  Ok, I head down with 2 co-workers and stand in line for an hour.  We finally get inside.  The place is so packed that every time people at the table beside us got up to go to the bathroom, they knocked things over on our table.  This happened 4 times over the course of dinner, which was about 25 minutes.  The pizza was ok.  The pepperoni was good, but the ham was flavorless.    Decent crust, but minimal sauce and cheese.  We ordered 2 larges and service was fairly quick.  A big complaint is that the AC is so friggin cold that by the time we dug into the second pie, it was cold...and we were eating pretty fast.\n\nSo yeah, still not impressed by New York pizza.", "author": "joe s."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}