{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-24", "description": "Lombardi's was the first pizzeria in America. It may not be the best one but it has served as a Pizza College for some great pizza cooks that went on to open their own places. Tottono's in Coney Island, John's on the West Village, Patsy's in Harlem and Grimaldi's in DUMBO.\nThe thing about this place is that they sold the restaurant a couple of years ago and the new owners are what we now as Grimaldi's. The Grimaldi family opened Julianas, almost next door.\nBoth of them are really great but Grimaldi's have something over the rest of them: they get tomatoes delivered on a daily basis from Napoli. Pretty cool but not that important according to my opinion.", "author": "José Ignacio O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-15", "description": "Worst Service Ever!!! PIGS!!!! I was so excited to try this place since I heard so much about it. I came here with my boyfriend and my mom and we waited outside on the line for 20 minutes. After we finally got in, they sent us upstairs and told us to sit on a bench. Meanwhile people that were behind us in line got to go in an sit before us. Then we complained they told us to go downstairs, we did, one guy told us to sit at a table, the other guy said no we can't sit and that he was saving the seat for a family of 13 so we ended up leaving because clearly they do not know what they are doing. We will never go back to this disorganized mess of a place.\n\nThx for responding business owner but how does this benefit me and my family? You guys don't care because you always a line.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-13", "description": "I was driving by Grimaldi's pizzeria and to my great surprise there was no line and I decided to order take out .. I ordered large pie with pepperoni and mushrooms .. I paid and tipped the waitress who took my order. I politely asked where should I wait .Manager approached me and pointed at the rock outside of pizzeria, somewhere in the middle of the block  . I thought he was joking and I was like -oh ok .. I sit at the counter and order a drink . He said - No . It's a restaurant's  policy that I can't wait for the take out even if I'm going to order a drink and that he's being nice to me by pointing at the rock so I dont have to stand on my feet . But restaurant is empty .. -It will get busy .. - not in the next 5 minutes until the pizza is ready .. Then he told me ok .. wait outside of the doors .. I was standing humiliated next to the door  in front of empty restaurant while waiting for my 25$ pizza .. But my humiliation wasn't over yet , Manager sends over a hostess , she tells me that her  manager doesn't want me to stand next to the door and I have to leave a restaurant until my pizza is ready  , I wasn't believing my ears , I was helpless .. Tears were chocking me , I asked if they don't want me to wait for pizza then I can take my money back and leave while talking to the girl  my pizza got ready and I grabbed it and ran far away to never come back to this place ever again .. I paid 25 $ plus tip for my humiliation at Grimaldi's pizzeria doors while staff was hanging out at the empty counter .. Thanks for the experience which I never forget ......\n\nP.S Joseph S . thanks for your reply .. But I don't believe that you're going to do anything about this . There are so many reviews regarding this person's rudeness , How can you let your customers being  verbally abused and humiliated ,He has  been working at this place for years and nothing is done !", "author": "Nina O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-26", "description": "full disclosure, I've been very iffy about this place from day 1\nit is obviously not a bad pie.\nIt is very decent NY pizza, but it does not live up to the hype\nand I feel bad to the tourists who line up for this place..\n\nbut if you are in dumbo and looking to eat something,\nit is definitely not a bad choice, but Juliana's might be slightly better (though not MUCH better).\n\nTheir ingredients are good and since there's a always a big crowd, I believe they are fresh as well, since the purchase cycle of the ingredients would be way more frequent than other places! But to my personal taste, the crust is really a so-so level.\n\nThis DUMBO location is better than the one Chelsea and Coney Island, that's for sure.", "author": "Narim K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-18", "description": "This place is a MUST after walking the Brooklyn Bridge! Be prepared to wait 20+ minutes! If you're a party of one or two, make friends with another party of one or two and they seemed to sit those parties much quicker! Also if you're a party of 5 or more they'll will straight up tell you that your best bet is a \"to go\" order if they already have a large group inside, there are parks and benches just down the street and Grimaldi's staff will provide plates and such.\nOk now for the food!!! Pizza is DELICIOUS, and piping hot. We ordered a Large, pepperoni, sausage and ricotta cheese. It didn't need any extra Parmesan cheese on top or chili flakes, nothing! If you want to compare it to famous Joe's Pizza, this crust is thicker and the sauce is thicker also. If you're walking the bridge give it a try!", "author": "Sheilah M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-25", "description": "The first time I came to Grimaldi's two years ago, I absolutely LOVED this place. At that time, I thought the pizza was out of this world. However, after my most recent visit, I was less impressed. The chicken was extremely bland and didn't taste good at all. Also, sitting on the highest floor of the restaurant, the temperature was EXTREMELY hot. We felt like it was overwhelmingly warm and it deterred from our overall experience at the restaurant. I see myself trying out a different pizza place in Brooklyn next time I'm in the area - this visit wasn't the best.", "author": "Vidisha P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-28", "description": "I was asked as we left the restaurant - was the wait worth it? Answer: yes.\nThe line was daunting but it moved pretty quickly considering - we only ended up waiting for about 30 minutes and then were seated in their upstairs portion of the establishment. You can only order whole pies so we settled on a large regular (the other option is a white pie which doesnt have crushed tomatoes, just more cheese) with pepperoni, sausage, onion and garlic. I love how there wasn't actual sauce but just crushed tomatoes and our toppings. The crust was thin and crusty, and was the perfect base. The three of us somehow managed to finish the entire thing and didn't regret it one bit.", "author": "Tram V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-18", "description": "Great experience!!! Have to give praise when and where it is due. Heather went above and beyond and took care of us. Need more people like her really appreciate her. Good quality pizza sauce and cheese good ratios. Forgot to ask for well done but overall great coal fired pizza.", "author": "Sagir P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-24", "description": "So I was over Julianna's since the pizza did not add to the hype. Figured after a loooooong Brooklyn bridge walk I would reward myself with a nice pizza from Grimaldi: \"the better spot\". Welp, I couldn't have been more wrong!\n\nOver one hour of wait and getting bird pooped on later, we finally come in to the \"legendary\" Grimaldi's. Little pizza place, family owned, family friendly. Nothing over the top or super cool about it. Very average \"Italian pizza shop\" style. \n\nOnce we FINALLY go in after freezing our butts off, we have more waiting to do. Yes. Took forever to be acknowledged by our waiters. Finally we get our little one page paper menu with our paper plates and cutlery. Here we are after hours of wait sitting down to paper plate settings. It's ok though because a good pizza doesn't need to be served on a porcelain platter. I mean if it's good it's GOOD, right?\n\nAfter our plain old margherita pizza came out, it was nothing but pure disappointment. Nothing outstanding or original about it. The dough sucked. The sauce was basic. \n\nI would never complain about a pizza place because you can never go wrong with pizza. My issue here is the hype is way too hype. You're going to be disappointed as I was. But sure, don't knock it til you try it. I'll let you knock it yourself but it's pointless to wait. Truthfully worst hyped up pizza of my life. We're in NYC, the capital of pizza. Skip Grimaldi's get something better! That's all.", "author": "Marietta C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-19", "description": "I came here a few weeks back on a recommendation from  family who are locals. They said it's not the \"best\" but it's a damn good pie.. and they were right.\n\nWe got a grilled chicken salad and a meatball and pepperoni pizza. To be honest thumbs down on the salad (who cares it's a pizza joint anyways) the cold chicken on the salad isn't what we were expecting but maybe we should have been more specific and asked for it still hot! Now now you're here for the pizza review!\n\nThe use fresh cut mozzarella cheese which really gives it just a fantastic flavor. I loved that. They also put a very generous amount of topping on the pies too. They do however use a spice in their meatballs that I hate. Don't know what it's called but it's that one that makes sausage taste a certain way. The haters of that spice will know what I'm talking about. But the pizza was great and I'd go back for sure. I would 100% be trying something different however.", "author": "Anthony H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-16", "description": "This was my first visit to Grimaldi's. It was a Wednesday at noon after a walk across a very crowded Brooklyn Bridge. It looked fairly busy then most of the people left since they were all part of a Brooklyn tour group. The manager seemed friendly and upbeat. I ordered the small traditional pizza. I enjoyed my meal while watching local CBS and ABC news and listening to Frank Sinatra, followed by Frank Sinatra and then a little Frank Sinatra. I somehow was able to finish it all. I would consider the taste to be in the more satisfying range for thin crusted pizza. For full disclosure, I am partial to deep dish and Sicilian.", "author": "Mark S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-23", "description": "I was disappointed with this restaurant given the hype built up about it. Honestly the Long Island location in Garden City is 100000x better and fresher than this place.\n\nRecommend finding another pizza location in Brooklyn if you're visiting and looking for good eats. This place isn't worth your wait in line and they only provide paper plates \u0026 plastic utensils.\n\nGet yourself the better pizza you deserve!!", "author": "Helen C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-05", "description": "When old man Grimaldi manned the oven Grimaldi's was a 5 star experience. Unfortunately old man Grimaldi made a decision to sell the name and the location. The experience is now watered down, don't get me wrong it's a solid pie but nothing worth waiting on line for. As a matter of fact in such NY fashion Old man Grimaldi opened Juliana's next door....\nIn any case if you want the original Patsy Grimaldi pizza....go next door.", "author": "Jonathan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-22", "description": "Great pizza place for a true NYC experience! Coal oven pizza cooked under the Brooklyn bridge\n\nOrdered one large cheese pie and one large half buffalo chicken/half bbq chicken pie \n\nLoves:\n- taste \n- ambiance \n- ample seating \n- location \n- service \n\nCons:\n- cash only \n- $$", "author": "Liz B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-30", "description": "I mean... how can you go to NY and not get a slice of pizza?\n\nThis is the original Grimaldi's location I believe. Long line is expected but luckily we got there and was no wait. I do have to agree with other Yelp reviewers: this place is a tourist trap. \n\nPizza was mediocre and sadly I've had better pizza elsewhere (outside of NY). Mediocre pizza in addition to subpar service gets a solid 3 stars.", "author": "Manami S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-30", "description": "Ended up here after an event reconnecting with a friend and it was worth the find. It is a more intimate setting to have New York Style pizza but isn't super fancy or requires dressing up. \n\nWARNING: They are cash only and they dont do slices. So if you don't read past this at least know that. \n\nWith that being said I wouldn't go here alone unless you can stuff down a whole pie by yourself and if course they allow you to take leftovers home so that's a plus. \n\nI was disappointed because they don't believe in pineapples going on pizza so it wasn't a pizza topping offer, but the service and deliciousness of the food made up for that. \n\nI see myself going back to try other toppings and enjoy another slice with a friend if I can.", "author": "RaSheba J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-16", "description": "Nice little pizzeria. Line up was long but well worth the wait. If you go, be sure you're prepped for the wait. We went for the experience. Going to Brooklyn you must have a pizza from Brooklyn. Staff was friendly and fast after we got our table. Really enjoyed the pizza. NY pepperoni is delish. I love marinara with basil so I do wish they would have put on more basil but it may not be for everyone. There was left over but which we took home for later but we were so full after and on the go the next day and we weren't able to take it on the plane. Wish we had a Grimaldi's in Toronto Canada?!  But I would definitely order from there again when I'm visiting.", "author": "Andree C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-26", "description": "I seriously would go back to brooklyn from texas just to eat this pizza again anyone in the area its a must try!!", "author": "Jocelyn M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-26", "description": "Local Brooklyn favorite pizzeria. Line was out the door. Seated in about 15-20 mins non- traditions way of operating a line. A man standing at the front ask for certain number of parties, rather than first come. \n\nFood - ordered the Fresh mozzarella and added jalapeños, mushrooms and onions. Pizza was excellent. It came out smoking, crust was good, light and the flavors were out of this world. The jalapeños were super spicy and the sauce wasn't over powering the other Ingredientes. \n\n(My mom ate the pepperoni ) said it was awesome! \n\nTip- walk across the Brooklyn bridge (about 20 mins) you'll be hungry when you get there and can see some killer views while walking back to Manhattan. \n\nSide note - While waiting in line outside, I was blessed in by a bird in front of the pizzeria. Look up and pay attention. I wasn't the only one in line who this happen to \n\nDefinitely one of the top 3 pizza joints in N.Y. \n\nCASH ONLY !!", "author": "Breoni M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-11", "description": "When in NYC, I absolutely had to make a stop at this joint, having heard and seen so many great reviews!\n\nNeedless to say that my pizza was amazing, and the service was great!", "author": "Charn S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}