{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-22", "description": "CASH ONLY.\n\nMy friend and I were lucky to have two of our guy friends stand in line for us as we were late getting there.  We got there and waited a max 10 minutes before getting in on a flash flooding Saturday evening.  They had waited a total of 40 minutes.\n\nBefore getting to the pizza, I must say, the Brooklyn-born root beer is delicious!\n\nA group of 4 of us got a large regular (sauce) pizza with sausage and onions and a small white pizza - plain.  The sauce on the regular pizza and the combination of amazing sausage was awesome.  Loved it.  The white pizza, not so much - it was a bit too plain and like cheesy bread for my liking.  I would have liked more fresh garlic as well (-.5 stars).\n\nOn the way out, I was apparently in a waiter's way, and he proceeded to take a menu and slap me in the back to get out of the way.  Really?  RUDE.  Minus .5 stars for that.\n\nOverall, a nice, cheap food excursion.  Will be back if I don't have to stand in line again :)", "author": "Allene T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-15", "description": "Loved the pizza :) \n\nSaturday night. 6:30pm. Wait was about 45 minutes for 2. \n\nRegular small pizza with sausage and mushroom. It was great! It's not your typical neighborhood pizza. The tomato sauce was delicious. The mozzarella tasted fresh. Everything went well together. \n\nThe only downside is the service was slow (though friendly).", "author": "Judy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-08", "description": "I finally had a chance to try this hyped up pizzaria. I mean what's the big deal, it's just a pizzaria right?\n\nI came on a weekday afternoon(around3:30pm)---no line! From what I've read from other reviewers, it is quite common that you will stumble onto a line when you're visiting this corner pizzaria. \n\nThe pizza was simple, fresh, and mind-blowingly delicious. I'm not a really big pizza eater but I couldn't stop myself from finishing the last piece of the pie.\nThe service is really quick and they are also very friendly. Our made to order pizza was at our table within 10 minutes. It was so worth the trip!", "author": "Mabel W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-20", "description": "20ish minute line. The bald front guy is so rude! He pushed my mother because we were standing at the door (like the rest of the people that were ahead of us before) and said \"This is my space\". We were seated in a 4 person table and another couple were seated rigth in beside us. Paper plates plastic cutlery, no beer, no wine. \"No alcohol\" should be announced outside. We wait like 40 minutes for the pizza. It LOOKs good...only looks! Bland pizza, soft crust with burned areas. I have to use salt and garlic powder to gice some flavor...there is better pizza back home at Puerto Rico. Don't waste your money here and skip this place!", "author": "Fanny R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-08", "description": "What can I say? It's a total pain in the butt to go to this place but it is completely worth it. We waited for 45 minutes in 95 degree heat to get in to this place, and it doesn't have air conditioning. But there we were, refusing to get out of line, on this pizza pilgrimage. Sounds like hell right? Before we started eating it felt like it, and we kept saying things like, \"This better be worth it,\" as we grumbled in line drowning in sweat. \n\nBut even with all of that, I'd go again. The dough is what does it. The chewy, stretchy, but crispy dough! It's perfect and I would eat that dough every day if I could. We got 2 small pizzas for the 2 of us- 1 white pizza and 1 italian sausage pizza, and we ate both of them. All of it. I'm almost embarrassed to admit it but that's how good this pizza is. It's a must in Brooklyn or Manhattan.", "author": "Frances B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-18", "description": "Rude service, we asked how long the wait was and we were walking out and a young lady ran out and told us to come inside and she seated us.  A man behind the bar came over and asked if we seated ourselves with a nasty tone because there were people waiting before us,  we told him no that the lady seated us and he walks away with the same attitude.  I was hoping the pizza made up for it, the crust was burnt and hard. Going to try the pizza next to this restaurant, the line is around the block but it's owned by the original owners of this place I read.", "author": "Trika R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-10", "description": "I've had the pizza.  It was good,, not great. There are far more excellent pizza joints in Brooklyn.\n\nThe lines are ridiculous; I have no proof, but I think money changed hands between the tour bus companies and Grimaldi's. \n\nJuliana's (in Grimaldi's previous space) is far better without lines that are as long. \n\n\nLucali's on Henry Street was great. I haven't been there in a long time. \n\nThe House of Pizza and Calzone on Union between Hicks and Columbia is my favorite.", "author": "Jonathan H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-18", "description": "The famous walk, the famous pizza at the end. My boyfriend had just finished walking the Brooklyn Bridge and was thrilled to have this place be the prize at the end. We got to the restaurant around 2 PM and luckily it was busy but because it was 2 PM we didn't have to wait. \n\nDISCLAIMER: They only take cash! We had to use their atm to get money out. Bring cash!\n\nWe decided on a small pizza with sausage, onion, and mushroom. When I saw small pizza, I figured it wouldn't be that big. Nope, it's pretty big. It says feeds 2-3. It can probably feed 2 very hungry people. Either way, the pizza is big. The pizza itself was pretty good. I was super excited to try the famous NY pizza. I think I was expecting this overly amazing meal because of how much people hyped it up to me. Too bad after I bit into it, I wasn't overly amazed. The pizza is good and I'm glad I tried it, but it didn't amaze me. What I did like about the pizza, is the crust was perfectly crispy and they add full basil leaves on top of the pizza. I love basil so it worked for me. \n\nI'm glad I tried Grimaldi's and it was good, I just wasn't amazed. At least I can check that off my  food bucket list.", "author": "Stacey L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-15", "description": "In my opinion Grimaldi's should be open 24/7 because sometime when i wake up at 2 am and i just want to walk over to gremaldi's and order a pie! I have gone to almost all the best and famous pizza shop and but Grimaldi's on top of my favorite list and here is why!\n\n+ coal oven baked\n+ fresh ingredient \n+ they don't offer pizza by slice which every pie is freshly baked just for you \n+ friendly staff\n+ even crust taste awesome\n\nthing I'm not fan of \n- its cash only\n- if you go in groups of 4 or more you will have won't long wait but if its a party of two you may be there a long time waiting to be seated.\n- they never answer their phone\n- sometime lines super long like 2+ hour long wait type of long.\n- all those tourist taking pictures all around me while I'm trying put the pizza in my belly.", "author": "Awais A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-26", "description": "Pizza cannot get any better, their ingredients are so fresh! \n\nThin crust that has a nice chewy bite to it but crispy on the outside and ends. \nLots of tasty gooey cheese\nGreat options for toppings\nNot greasy at all, and the flavors the come from cooking it in the brick oven are deliciousssss\n\nBeing a west coaster, good pizza is hard to come by (obviously). This place takes the cake and the fact that its located right under the Brooklyn Bridge is an added bonus! You can go for a stroll on the bridge to walk it off after!", "author": "Alyssa O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-29", "description": "Resident family and life long New Yorkers say \"Don't ever go into a restaurant that is empty.  And if there is a line chances are it must be good\".  NAIL ON THE HEAD! \n\nThis was my first real NY pizza experience 7 years ago and it's on the to-do list every year we go to NY.  \n\nIt's a great tourist experience.  Under the Brooklyn Bridge, wait in line, see them toss the dough, it's comes out steaming hot, and it's delicious.  It's also in a neat neighborhood.  \n\nThe line is serious.  If you hate lines you will not like this place.  But if you don't mind the line then make time for the Grimaldi's experience.", "author": "Melissa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-27", "description": "Just after the Brooklyn bridge, when it comes into view it looks more like a nightclub.\nThere's a husky guy in a leather jacket letting a restricted number of people in, few at a time. The line stretches to the end of the block. But it's not a nightclub, it's Grimaldi's. It's New York. It's a big deal.  Even if the seating is super close to each other, the shoddy tv barely broadcasts the futbol game, the AC doesn't seem to work, and the wait is long (the oven shuts down for 2 hours in the afternoon) it's still worth it. It's all about the NYC experience.\n\nThe basic pizza is topped with basil and mozza. That's it. It's simple and it's delicious. The dough is unparalleled anywhere else, it's chewy but just enough that it's also soft. What kind of sorcery is this?! It's Grimaldi magic. The pie looks huge but when you're actually down into it, it goes really quick, the pie is super thin. One pizza was enough for the two of us, but I'm sure the men could polish off one to themselves comfortably.\n\nBecause their oven shuts down everyday from 3-5pm (I think) the line builds up incredibly fast. No point in coming for early dinner because you end up sitting and looking stupid.", "author": "Elle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-03", "description": "We were in our fourth and final day of our visit to NYC and we still had not had pizza or visited the Brooklyn Bridge.\n\nMy Gals Boyfriend, a Brooklyn native, suggested we head to the original Grimaldi's. He stated it was worth the wait and walking distance from one of the best views of the bridge.\n\nWe caught the train from Manhattan and after a 10 minute walk we arrived. The line went all the way to the end of the building but seemed to be moving quickly. It was raining but we had umbrellas and a poncho. The line went pretty fast.\n\nWe ordered a large pepperoni, mushroom, and garlic pizza and a small sausage, meatball, and ricotta (there is no medium). Um, it was amazing and we killed it. \n\nIt was a worthy NY experience and definitely\nworth the wait!", "author": "Caro S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-26", "description": "We were visiting New York from San Francisco to celebrate my husbands birthday. We came here on our first day, Friday March 21st at around mid-afternoon.\n\nThis was the BEST pizza I've ever had! We were greeted by a man (whom I assumed was the manager or owner or whatever) and were told to \"wait here\"(lol, total NY directness without being rude. Loved it! :P ) We waited by the door for about 7 minutes until we got a table. He just told us \"sit at the table by the window\" :D Still loving the NY attitude. LOL. \n\nAnyways, we got our pizza, and even though we were stuffed, we couldn't stop eating because it was so good! Hahaha! Fresh tomato sauce, fresh mozzarella and basil with garlic. \n\nGo here for sure!!!! :D", "author": "Jessica K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "Went with a group for dinner and it was the best pizza I have had! The reason I am not giving it 5 stars is because our group waited for about an hour in line just to be seated, but it is worth the wait! Our group split the large Margarita pizza and we each got a cannoli for dessert. It ended up being about $10 per person. The staff was great and the manager was very nice and hilarious. He went to every customer in the place and even chatted with us while we were waiting in line. I would recommend this to anyone who visits NYC to make the trip over to Brooklyn for the experience!", "author": "Sarah H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-28", "description": "Was so disappointed with this location!   Found out about Grimaldi's in Las Vegas and loved the pizza.  Visit the location at the Palazzo every time we're in Las Vegas.  Nice thin crust, good toppings, delicious!   So I was expecting the same great food.  This location didn't meet up to my expectations.  We were seated quickly but the upstairs was super hot.  They had a fan running in the corner but that was it.  No liquor license. \n\nWe were served our drinks at room temperature with a couple of glasses of ice, but because it was warm in the room, the ice melted quickly.  We had to constantly ask for our water glasses to be refilled and get more ice.  \n\nNot sure I would come back to this location.  I will continue to frequent the LV location unless that place fails to deliver its good service.", "author": "J L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "My sister and I were in Queens earlier this summer visiting family. We were told that Grimaldi's in Brooklyn was the best pizza in New York.  We weren't sure if the pizza would live up to the hype, but we decided to check it out. \n\nWe were told by our family that there might be a long wait. However, it was a rainy day, and so there was a table open when we walked in, so we didn't have to wait at all. The server was friendly enough.\n\nWe ordered a small regular pizza with pepperonis and jalapenos. The pizza was served to us pretty quickly. \n\nThe pizza was phenomenal. All of the elements were in perfect balance with each other. The crust was light and crispy. The cheese was tasty but not greasy. The pepperoni was flavorful and the jalapenos were pleasantly spicy. Just typing about this pizza is making my mouth water.\n\nI will definitely be sure to come here again next time I'm in Brooklyn.", "author": "Ravi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-02", "description": "The wait wasn't too bad (15 mins). Made a lot of friends during our wait which made the wait time fun. One of whom (Lauren) suggested that we save some space for home-made ice creams near Pier5 (Ample Hill Creamery). Another stranger, now friend (from Canada) told us about how they visit NYC each year especially this pizza. They told us all about the Nazi-doorkeeper at Grimaldi's and 100 ways to skip the queue. Thankfully, we dint have to do anything illegal to get in ;) \n \nLove the brick oven baked pizzas. The crunchy crispy crust perfectly compliments the fresh mozzarella. They make them right in front of you (see photos). The mint topping comes on every pizza and was surprising and refreshing!", "author": "Madhuvika M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-02", "description": "I'm disappointed I'm disappointed. The pizza is four stars - hot, fresh, and tasty. Not the best pizza I've ever had. I really expected it to be mind blowing. I would be equally satisfied with great pizza joints in Manhatten, and I think the pizza here is only marginally better. BUT the incredibly slow service (FIFTY FIVE minutes for ONE PIZZA?! geez louise!), the line out the door (ugh), and the rough (sometimes rude) waiters really bring my impression of this place down. They couldn't even offer something. Waiting almost 55 minutes is just ridiculous for pizza that is slightly above average at best. The restaurant is cramped, and they really need to add a brick oven or add liquor to the menu. Other than pizza,  a mediocre antipasto appetizer, a cannoli, and coffee/soda, you'll just have to sit there and twiddle your thumbs out of boredom. There's really nothing else. \n\nThe owner was friendly at least?\n\nThe pizza wasn't bad, but it wasn't worth the trek out. I wasn't that impressed.", "author": "Stef S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-12", "description": "The pizza was very good, although it tasted more like what I had in Italy than the greasy, cheesy pizza I associate with NY.   We split a large regular ($14) (http://www.yelp.com/biz_photos/grimaldis-brooklyn?select=CSu1j77ryoX4mwkTuB9DFA#CSu1j77ryoX4mwkTuB9DFA) and it was more than enough for the two of us.  The fresh mozzarella on the pizza was amazing and the tomato sauce was light and sweet.   Definitely a good pie, but I think I would have been a little annoyed if we had waited on a super long line for it, since we have similar places in CA.  Fortunately when we went on a Saturday around 8 pm, the wait for 2 people was less than 10 minutes.\n\nService is really non-existent.  I was not expecting anything fancy since it's a pizza place, but we had a really hard time finding someone to take our order and refill our water glasses.", "author": "A M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}