{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-02", "description": "On recommendation from several people, we came here to try a \"classic\" NY style pizza. Maybe this is what classic NY pizza tastes like, but I don't like it. \n\nSure, it's big, flat, and thin. Fresh ingredients, maybe. Too bad it doesn't make the pizza taste all that good. \n\nThe crust/dough was decent but boring. The tomato \"sauce\" was very weak and seemed kind of watered down. Fresh mozzarella was soft (as expected) and lacked any flavor. Pepperoni was pepperoni. Black olives were the kind that taste very briney (salt/vinegar) and didn't go well with the pizza. The service wasn't friendly either. \n\nMaybe now I understand why Michael Scott says that Sbarro is his favorite NY style pizza?", "author": "Kevin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-02", "description": "I have been to this place three times and there was always a line outside about half a block long.  Be prepared for a wait that is about 20 minutes to 30 minutes during rain or shine. Cold or not. If you are allergic to waiting on long lines then this place is not for you. Avoid this place. Run, not walk, away from there. \n\nFor those thinking that they could get the pizza ahead of everyone else, be forewarned that the line for take out is the same exact line as the one for those waiting to dine in.  This makes sense since each pizza is made to order for everybody, dining in or not.\n\nNo ordering by slices and no credit cards accepted.  Cash only here.\n\nNow that the information about the place is given, how is the pizza you ask?  Damn good.  I have a preference for thin slice pizza so I was already a little biased toward this type of pizza even before I got here the first time around.  I have tried the white and regular pizza each time I was there and I was never ever disappointed with the quality of the pies that I've eaten yet.\n\nThe regular pizza is crispy thin crusted with a little burnt oven taste, giving it a slightly smoky flavor. Home-made mozzarella cheese and sauce are used while  whole tomatoes slices and basil leaves are baked into the pizza. \n\nThe white pizza.  Same wonderful crust but slightly soggier because of the olive oil used in place of the regular pizza sauce. Same home-made mozzarella cheese but more of it on this pizza.  There is a hint of garlic.  Wait too long and this pizza might get soggy and limp faster than the regular pizza.  This shouldn't be a problem if eaten fresh.\n\nThe seating is a little tight inside.  The seatings and tables are packed in very close together. I have never experienced the rudeness of the staff that a few other reviewers reported.  My impression is that they are so overwhelmed with the constant crowd that they were never able to give you undivided attention but were professional enough when you wave them over.", "author": "Wing L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-29", "description": "I went with my boyfriend last week from reading reviews on yelp. I pizza isnt bad, but I've had better. The main problem is the staff, they don't notice you or care. Doesnt help when you've been waiting in the queue, which is lengthy. Feels touristy. I wont be going back.", "author": "Tamilli M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "Had a great time walking over the Brooklyn Bridge and down to Grimaldi's. We showed up late afternoon and there was a very short line. The place is actually pretty big inside. We were seated upstairs. The inside is nothing exciting. Very basic, old. The pizza was exactly what we expected based on the all of the good reviews we read. Awesome traditional NYC think crust pizza. It wasn't to die for, but it was really tasty, and fun to visit such an iconic pizza joint. Jimmy was helping manage the place that day and he is fully of personality. He even let my 12 year old borrow his basketball, so he could go play pick up ball down the street.  I would def recommend a visit to Grimaldi's in Brooklyn or NYC.. If you go to the Brooklyn location, consider walking the bridge like we did. Amazing views of the East River, Lady Liberty, and the NYC Skyline. We took a ferry back to the city. The Dumbo district along the river is a fun place to stroll around.", "author": "Kym W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-19", "description": "The pizzas are good, but it's a hard dish to screw up, so I'm never that impressed by good pizza. We waited in a pretty long line to get a table. I'd say it was worth it, but only once for the novelty. the service is slow but relatively friendly. I would eat here again, but o", "author": "Mon C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-15", "description": "long lines.  snotty tude. does not make a five star place.    make no mistake tis a fine pie but be warned if yours arrives a tad too hmmm charred there is nothing they can or will do.   the place is more tourist spot than destination spot.     there are way too places to try", "author": "Steve W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-24", "description": "Pizza here is awesome! cooked perfectly, garlicy, cheesey, saucy goodness.   I thought this place was going to be one of those tourist places, where I would try once and never go back, but when I bit into the pizza I knew that I will definatly be back (on a rainy day when people are working) I hate waiting.  \n\nThey only serve house wine here ~ don't bother, it's definatly no good, save your money and order a soda.  Drink elsewhere after your meal.\n\nThe Service - Horrible slow service, our waiter took 15 min to come  take our order (this is after we waited an hour outside already so you can imagine my frustration), then after we ordered he forgot to bring our drinks. I waited 15 min till I had to give him the drink in hand, shrug shoulders werid look on face signal from afar. I give the service 2 stars, the pizza itself 5 stars so technically if I averaged that out I should give Grimaldi's 3 1/2 stars but that's not possible, so 4 stars!  Only because I am salivating thinking about the pizza right about now... :(", "author": "Jan Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-28", "description": "NOT WORTH THE WAIT. This is just herd mentality--people following everyone else to try this crappy pizza. \n\nGrimaldi's only has slight differences with the 99cent pizza down the street from my apartment. One slight difference is you have to wait 1 hour in the freezing cold to try it. \n\nI spend 1 hour in below 30 degrees weather to get in the door of Grimaldi's. Inside was only 15 degrees warmer. It was so cold that everyone was still wearing their jackets and hats inside. In the upstairs seating though it was probably warmer. There is a lot of room for customers to wait inside before being seated, yet they make everyone wait outside to give the appearance that there is a long line. \n\nWe waited almost 50 minutes for our mediocre pizza basically freezing inside. The waiters looked miserable while being ordered around by this older Italian guy with man-boobs. \n\nWhen we got the pizza it looked amazing. My friend and I actually watched a girl sitting at the bar take 10 minutes worth of pictures of her pizza slices. The the taste though was average. I kept on thinking how I could probably make my own pizza better than this. I also thought that this place was pretty pathetic if they had spent almost 150 years baking pizzas and this garbage was the best they could come up with. We weren't the only ones dissatisfied. The couple next to us talked to us about how their pizza was also mediocre. \n\nIf Grimaldi's and Lombardi's are the best pizza New York has to offer, then honestly, I have given up on New York pizza. Both of these places are the same quality as any average pizza place in California. \n\nIf you are a stupid tourist whole follows the crowd like a dumb mule, please! Go ahead and try Grimaldi's! Hopefully you will freeze to death waiting to get in the door! = ) If not, go to Lombardi's or even your local 99c pizza place.", "author": "Rob B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-06", "description": "I believe.  Yes, I believe.  Grimaldis is the Zeus of all NYC pizzarias.  For those of  you who want to physically eat a slice of NYC heaven, Grimaldis is definitely the way to go.  Their brick oven cooked pie is wonderfully smokey and oh so tasty.  All pizzas start off with a light tomato sauce, fresh mozzarella, basil, and a sprinkle of parmesan.  From there your pizza is your canvas with the wide options of toppings that this joint offers.  A large pie feeds 3-4 people (8 slices per).  So, if you haven't assumed by now, Grimaldis is the absolute best pizza pie I have ever had the luxury of eating.  Definitely a must eat!  Ohm nom nom nom nom!\n\nTip:  To avoid the long wait, try to go for lunch right as it opens.  Also, if you are in the mood for some really tasty ice cream, the Brooklyn Ice Cream Factory is just down the street on the pier.  Enjoy!", "author": "Tim M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-12", "description": "My expectations for NY pizza yet alone Grimaldi's was very high. Unfortunately, I was not impressed at all. I think it was because we had to wait over ONE hour to dine in and it wouldve been the same wait for take out. Not mention it was freezing cold that night. Don't get me wrong the pizza was not awful. It was okay for the praises it has been getting. If the wait was not so long I'd give it one more star. But honestly, I thought the $1 pizza slices in LES were just as good if not better.", "author": "Brigitte M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-20", "description": "Definitely a popular place. The cheese is fresh, the crush has a decent yeast flavor. Lombardi's seemed to have a slightly better sauce and perhaps toppings. But this is a better pizza overall. Though still a long line for this as well. And pizza isn't really the type of food I would normally wait an hour for.", "author": "L R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-28", "description": "Once known as Patsy's, Grimaldi's has become a New York institution. Taking a cue from fellow Brooklynite pizzeria - Totonno's, Grimaldi's serves some of the best brick oven pizza in the city. \n\nWhat makes this place so great is not just the pizza, but the decor and style of the restaurant. Nestled directly below the Brooklyn bridge in one of the coziest nooks in New York City, Grimaldi's has been serving hungry tourists and addicted patrons for many years. Inside, the restaurant is small and packed. You can feel the heat from the brick oven in the back and watch as they painstakingly make your pizza from scratch. \n\nNow to the food: The pizza is superb, thin and made with the freshest ingredients. I can down 6 slices of their pizza and still have room for more! My favorite combination is pepperoni and mushrooms. \n\nThere are a few caveats to eating here though. Specifically, the wait to get in is usually 30 minutes to an hour. The waiters aren't the most attentive and on many occasions I've sensed a level of douchery coming from some of them. \n\nTotonno's; my favorite pizzeria in Brooklyn; is just one step above Grimaldi's. But Grimaldi's still serves an incredible pie and has the surrounding area to serve as a supporting actor. After feeding my insatiable desire for pizza, I usually take a stroll to the pier and surrounding area to soak up the view of the Brooklyn Bridge and lower Manhattan across the river.", "author": "Jonathan J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-30", "description": "I would give it a zero if I could. Pizza is good but the service and management is simply and disaster! Waited for an hour in the freezing cold only for them to then let an entire BUS load tour cut in line leaving all of us standing for another hour! Every time we have gone we have had to wait and honestly it just isn't worth it. Fascaties up the street makes an incredible pie it has been in the heights for about 35yrs and it is every bit as good. Grimaldi has more of an exotic selection but when you compare pizza for pizza it's is NOT worth the wait. I am a pizza fanatic and wouldn't say anything bad about this place unless it really did deserve to be brought down and coupe notches.", "author": "Seth D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-11", "description": "I live in Brooklyn, I Love the pizza, always hated the \"No Credit Cards\" policy. But it just got worse, needed cash so used their ATM.  It is the biggest rip-off I've every seen, $4.50 with a max withdrawal of $100.  Bring Cash!\n\nGrimaldi's please consider paying your taxes and accepting credit cards!", "author": "Jay A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-10", "description": "Came here on a rainy day, so plenty of tables were waiting for us. The pizza we had was not hot enough. The bottom was burnt while the center top was too wet. The favor is good tho. The service was not good at all. Servers weren't attentive. We asked for cheese. A server gave it to us. Few minutes later, another server picked this bottle up, shook it, put it down and left without saying anything. Oh... When we asked for anything, they don't even say a word. We didn't even know if they heard what we said. The only nice thing is probably the owner gave us a warm welcome when we walked in.", "author": "Yuk L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-11", "description": "I have to say the one in Hoboken does a better job.\n\nI didn't mind the 30 min wait for the pizza, but with memories of what I had at their other location had my expectations set high.\n\nClearly this is a tourist spot, but who cares if the pizza is worth the line right.?\n\nI think your better off hopin' on the path to Hoboken", "author": "Anthony F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-17", "description": "Worth the wait, but if you go for an early lunch, you can avoid the line!  Almost as great as the old Leonardo's Brick Oven Pizza on Court Street and 1st Place in Carroll Gardens.  (where they paved paradise and put up a Dunkin' Donuts :( )", "author": "Jo Anne R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-25", "description": "I could write a long long review for this place, but there is but one thing to say...\n\nTHIS IS THE BEST PIZZA EVER!!!\n\nGroup of 6 split 3 large...  a lot of pizza.  Even though we were STUFFED, we had to get a 4th.  All agreed the pepperoni rocked (I NEVER order pepperoni).", "author": "James C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-08", "description": "Had to wait over an hour, but by the time I was seated, I was hungry. Pretty good pizza!", "author": "Elda L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-02", "description": "Its good, but its not that good...\n\nTotal bad attitudes, a gigantic line, and the surliest \"doorman\" at any pizza place ever. He's really the worst. If you eat in they'll make you wait in line, yell at you for taking up too much sidewalk, and hustle you out in 20 minutes or less. If you do take out, we'll... you can't do take out apparently. I tried to call in and get a takeout order, but then once I arrived they had lost my order.  \n\nI've enjoyed this pizza a lot in the past, it really is one of the top 3 pies in NYC, but the lines gotten so bad that its really not worth it. The success has totally gone to their head. Its not fine dining guys, just pizza.", "author": "dave m."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}