{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-01", "description": "It's taken me forever to try this place, because the line is always so intimidating. Then my friend told me she had the secret number (how dramatic) and it was over.\n\nI'm going to go ahead and say it. I think it's the best pizza in New York.", "author": "Natalie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-29", "description": "Really tasty and made fresh while you wait, but you have to order in whole-pie increments, and the lines make it hard to justify doing very often. There's often a line at least a half-block long. Make sure you have plenty of time, and if its a nice day consider walking across the Brooklyn Bridge on the way there or back. They put a cooler of water outside for the people in line. It's also mesmerizing to spend a few minutes watching the staff make the pizzas. While you're there, you can splurge on the tasty wares of the Brooklyn Ice Cream Factory, which is about a half-block down, by the water--not a ton of ice cream choices, but what they have is good.", "author": "Mira S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-04", "description": "If I had to wait more than 15 minutes for a seat, this place would not have been worth it.  Since I didn't, I'm giving it three stars.\n\nThe smaller your party, the faster you'll be seated.  We passed groups of three or more because we were a party of two and a table opened up for just two people.  The place is cramped inside and everyone sits next to someone else.  I met a couple from Memphis and they liked the pizza.  Told me never to go to Memphis though because there's nothing to do there but drink and get high -- not exactly a deterrent for a lot of people.\n\nAnyway, the pizza came out quickly.  It's almost like they had the pizza ready made and just threw some toppings and cheese on.  I think I waited maybe 10 minutes for the pizza to come out from the time we ordered.\n\nBut the pizza got cold and soggy after we finished our first slice.  The sauce was delicious with a bit of sweetness, but overall, I feel like I had my expectations too high.  I walked out feeling like I've had better pizza without having to make the trek to Brooklyn.\n\nIs it worth it?  The price isn't outrageous, so probably worth trying since this is one of the more famous pizza places in the US.  Would I make a return trip?  Probably not, unless it was out of convenience or I was just in the neighborhood.", "author": "Brian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-27", "description": "Went here long before sandy and stood in the massive line one hot summer night. Just as I was about to give up and turn into a puddle on the sidewalk it was our turn. Got the margarita pie to go. Went down to the park and made it a picnic. It was delicious the night air had cooled and the pizza was so fresh that people around us were jealous. I would not eat in seeing as to how cramped the interior looked.", "author": "Maya B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-21", "description": "This is a New York must and experience, so I had to try it out! I tried to get here early enough so that we wouldn't have to stand in the legendary line, but that didn't work. They opened at 12 noon and we got there at 12:45 and still had a 30 minute wait. \n\nThe pizza was really good. I especially liked the fresh mozzarella, yummy! It was weird though, because half of the pizza was perfectly done, and the other half was BURNT! We had mushrooms and pepperoni for the toppings. \n\nIt was definitely worth it for the experience!", "author": "karen s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-11", "description": "If you are looking for some great tasting pizza with a spectacular view of the city skyline, go to Grimaldi's down by the Brooklyn Bridge. The wait can range anywhere from 10 minutes to more than an hour long, but if you happened to be in Brooklyn, it's not a bad stop to make. \n\nPatience is a virtue and it is worth the wait to see that steaming hot pie come right in front of you. I suggest getting a large pie, which is eight slices in total, and any topping that suits your fancy. The tomato base is slightly sweet and the cheese isn't very heavy on this thin crust pizza, so request for extra cheese if you're a cheese lover. \n\nIf you are a fan of personal space, this is not the place for you! The tables are set up like a family-style sit down, so you'll be sitting very close to your neighbors. So close...you can reach over and grab a slice of their pie if they aren't looking! \n\nFor those who are unable to make it to the Brooklyn location, Grimaldi's does have two new locations in NYC. The first location is right off the Long Island Expressway near the Douglaston area. The second location is right in Manhattan around west 20th st and 6th avenue, where Limelight use to be located. Both are fairly new and not quite well known as of yet, so check out those locales for some fine pizza!", "author": "John P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-18", "description": "Pizza was very good but I don't agree with my friends that it's the best anywhere.  First two pies were good. Last one had charred bottom. Warm bottled soda on ice wasn't great also.", "author": "Richard K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-14", "description": "The infamous Grimaldi's is located in one of Brooklyn's most beautiful neighborhoods  situated near Brooklyn Bridge Park.  Sit down for some pizza, then grab some ice cream and go for a stroll along the promenade.  Here, you can get a gorgeous view of lower Manhattan and the East River.  \nThe wait can be excruciating, especially if you have a large group, and there's no wait list so come prepared to stand in line.  Come a bit early if you don't want to wait too long.  We showed up close to 7PM on a weekday and only waited about 15 minutes.\nI can't say from my first experience if it was the best pizza I've had.  I probably need to go back and just have a plain margherita to decide.  I was really hungry that day so I wanted everything on my pizza: sausage, onions, jalapeños, etc.  It was good; the cheese and crust were especially memorable.  The large is pretty huge, but two moderately hungry people could finish it.  We did, and still had room for that ice cream afterwards.", "author": "Nisa N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-09", "description": "The pizza is good, BUT the service is the worst we have ever received. The drunkard at the door, Ralphie, randomly selected people to be seated; order didn't matter. He yelled at one person in our group, which caused many people in line to leave ...in retrospect, we should have done the same. The servers were if the grumpy kind, too. Go to the place next door, they'll greet you with a smile.", "author": "Carolin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "Excellent food, simple menu, nonchalant service, characteristic and old-school (but sometimes grumpy and aloof) host. Still, it's the best pizza place under the bridge. But try to avoid weekend evenings. Looong lines of tourists that stretch down the avenue.\nOh, and make sure you bring cash. They don't take cards and their ATM charges $4!", "author": "Tom S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-25", "description": "The prize after walking the bridge on a sub freezing day was well worth the trip! Best pepperoni and sausage slice I have ever ate.", "author": "Won H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-25", "description": "So, so, so good! Came on a Wednesday at 6 and there was no line. Took over 30 min to get our pie, but it was worth it. Wish they had a few more things on the menu.", "author": "Gloria S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-15", "description": "Best Pizza in NY, I understand that statement sounds ludicrous but as far as ingredients and taste Grimaldi's stands above the competition. Fresh cut mozzarella, no single slice sales, a line always outside, this pizzeria is without a doubt something to recognize. Take out and indoor seating is available, a scenic backdrop of the Brooklyn Bridge is very close as well as the Brooklyn Ice Cream Factory. \n\nA MUST TRY. Even if the service can be a bit sour, I overheard one of the host ordering a young couple to wake their slumbering child from the carriage since there wasn't any room inside for it.", "author": "Eddy D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-27", "description": "Locals - avoid at all costs!!!\n\nWalked by here on Xmas eve and figured this was my chance to try it since there was no line. Boy am I sorry, this was by far the worst service and most awkward restaurant experience of my life. Apologies ahead of time for the long winded story, but this one is a doozy.\n\nFirst off this is the biggest tourist trap in NYC. Seriously you'll find more New Yorkers at the Times Sq Olive Garden. Forget NYers, we were the only Americans in there.  The table is set with plastic plates and cutlery. I don't mean to be a snob, but look who's giving this place 4+ stars and who isn't and the correlation with their locations; I should have known better. But I'm not letting that impact this review. \n\nMenu is really simple: red or white, small or large. Want prosciutto, arugula, broccoli rabe or any topping not from a can? Fuhgeddaboudit! We ordered a small red, and the waiter repeated back white. I corrected him red and again he said white. Ok, Brookyn Italian restaurant, they like to mess with you, I get it, been there before. We laugh it off and order a red once more,  30-40 mins later a white pie comes, you gotta be kidding me! \n\nThe original waiter disappeared so I explained to the other waiter what happened and his response was to tell me that my waiter has been there for 20+ years and is burnt out. No apology. I feel for him, but come on, I said red, you put in a ticket for red, not that hard. So they took the white pizza back and put sauce on top. That's not a red pie, but we ate it and it was pretty good. I'd take a piping hot slice from Joe's on Carmine over it without a doubt. Then comes the worst part...\n\nThe 2nd waiter comes by and tells me I need to explain to the original waiter what happened so he understands his mistake. I then hear waiter #2 tell waiter #1 \"do your f*cking job!\" on his way to me.  I recalled the situation calmly and respectfully to waiter #1, with sympathy (\"I thought we were having a laugh but maybe you misunderstood me\") and he proceeds to give me the most unholy guilt trip of my life (I'm a BK Jew so I consider myself an authority on the matter). He tells me I'm making him feel like he has a mental handicap. I try to say \"hey it's Christmas, let's just move on, no hard feelings\" but this guy isn't letting go and I'm now in the most awkward experience of my life. My girlfriend was legit worried that they were gonna take us to the back and beat the crap out of us. Between getting the leftovers boxed and paying the check, we have 3 more interactions w the guy and he apologizes probably 30 times in a guilt inducing manner.  It was a master manipulation. I leave feeling like an asshole for sticking up for myself and politely asking for halfway decent service.\n\nShocking behavior, they should be ashamed. Go to Red Rose on Court St if you want the true Brooklyn Italian experience.", "author": "Adam R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-24", "description": "Let me start by saying the pizza is decent.  However it's not the best I've ever had.  \n\nI'm a big stickler on service.  There's something about great customer experience that keeps me coming back.  Appears that this has been forgotten by the employees recently.  \n\nA recent trip to the restaurant I noticed the staff at the door treating customers like cattle and rude.  As if they took for granted that customers made the business.  Especially repeat customers.\n\nAfter being seated, it took too long for service prior to ordering and the wait staff hardly came back to check on several consumers.  Poor experience and I am more than happy to try other pizza places like Lacili's.  Thanks to Grimaldi's poor service, I stumbled on a better place with service that makes you feel appreciated.\n\nCustomer experience is top pririority.", "author": "Mark H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-18", "description": "Grimaldi's is great. This pizza is the closest to actual ITALIAN pizza I have had in the US. While I love Brooklyn style pizza, it is very different from the extremely thin, brick oven pizza you get in Italy. Grimaldi's is very authentic to pizza in the motherland, and is therefore worth the wait.", "author": "Susan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-19", "description": "Sure the line is LONG but that's all a part of the experience here. Go on a nice day and enjoy the view. Then indulge in some of the best pizza the city has to offer. \n\nGrimaldis has the perfect cheese-to-sauce ratio. I hate when places are loaded with sauce and you need to go digging for a tiny bit of cheese. They use fresh mozzarella which earns some major brownie points with me. All their ingredients taste really fresh. This is definitely a place where all New Yorkers need to go at least once. \n\nHere's a hint for those who want to try and avoid the line. I came here last summer right after work to meet with some friends. I was the first one here and it was about 5:20 on a Tuesday. There was absolutely no line. About 30 minutes later when my friends finally showed up the line was almost down the block. So try going early on a weekday and you should be OK.", "author": "Elizabeth T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-10", "description": "THE BEST PIZZA I'VE EVER HAD!\n\nThis is the best pizza in New York! The crust is crisp and amazing. I'd wait in line time and time again for this pie!", "author": "Nina P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-14", "description": "If I could give ten stars I would!  \nI spent a significant amount of time in Sicily... and the pizza, antipasti, cannoli, etc., all taste like the real deal.  \nHowever, I haven't tried Lombardi's yet--so, I'll update as necessary in the future.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-17", "description": "You really want to wait in line with a bunch of tourists?  And pay cash?  Go for it.", "author": "Kimi R."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}