{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-09", "description": "There are a lot of good things about Grimaldi's but pizza is not one of them. The walk over the bridge, the view, the pics of famous peeps on the walls - these are cool. The service, the horrendous lines, the cramped quarters, the mediocre pizza - these suck.", "author": "amy c."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-28", "description": "Good pizza. I was taken there by my loving fiance who is a native New Yorker and she insisted that if I wanted pizza, this was the spot. We waited in a long, long line that stretched aroudn the corner and got a couple of huge pizza's to go. They were definately well above average, with fresh dough and toppings, but it wasn't the best I've ever had. In fact, I've had much better from little hole in the wall spots in NYC that I'll never be able to find again.", "author": "Myles A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-27", "description": "OK, let's see where should i begin? First off i though the wait staff was very attentive, the place was run like a ship, everything was done in order and quickly even though it was jammed packed. As for the actual pizza i thought it was very good, yet not the best I've tasted. The pros: the slices were on the bigger side than the ones I've tasted in other joints. The amount of cheese was also bigger, they cover the whole pizza with cheese; unlike other gourmet pizza joints where the just give a glob of cheese here and there. I also thought that the crust was very well done, it wasn't burnt. Now the cons: the sauce was very plain, had no kick to it, i have tasted better. The toppings didn't seem to improve the lack of kick of the sauce, i felt like something was missing. Overall it is good pizza, with great service, but its not the best.", "author": "Juan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "First visit to New York, and one of the food place on our list.......Grimaldi's. The wait is worth it.", "author": "Flint D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-16", "description": "Everyone says it for a reason, and i agree: the best pizza in new york. Being that it is one of the last remaining coal brick oven pizzas, it is also of historical significance. These guys make the best, thin, crispy crust pizza with delicious toppings that are top notch. The lines are insane, but well worth it. i usually get the regular, which has fresh mozzarella slices and basil on top. They do not do any single slice sales anymore (shame). this is my favorite pizza ever - every few times i go up to new york, i'll have to feed my craving for perfect pizza by going here.", "author": "Wade C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-06", "description": "The line was legendary, about 2 hours at 1PM on a Saturday. This was probably the best pizza I've ever had, but if you've ever had any decent pizza, your second-best is probably not too far below this. The crust is good and chewy. The fresh sliced mozzarella makes it special, but the toppings are not evenly distributed. As a tourist, I'm glad I experienced it, but I can't imagine anyone going back unless there was no line whatsoever.", "author": "Kevin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-14", "description": "This place is amazing! Fresh ingredients and amazing toppings! Brought back 4 pies back to California!", "author": "Valentine K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-29", "description": "Went with a few friends on a cold, rainy Sunday so luckily the wait was only for 15 minutes.  When we were seated, we ordered wine and surprise, pizza.  There were 6 of us and a baby so we ordered 4 pizzas.  We ordered a plain cheese, a White pizza, an Italian sausage pizza, and a roasted tomato and pepperoni pizza.  My favorite was the plain cheese.  Nice basil, fresh cheese, and very nice crust.  It was very good pizza and one of the best I've had but not THE best.  I understand the hype but I wasn't knocked off of my feet.  The service was good though and I liked the old-school authentic feel of the place.  I will only return when guests visit from out of town.", "author": "Roy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-08", "description": "If you are in New York and you do not make the time to go here for Pizza you are seriously missing out on somethying special. There is a reason on Friday and Saturday night that there are lines. The pizza is amazing. It is old school, thin crust, hand made, fresh toppings heaven. \n\nYou are literally crammed into the restaurant on busy nights. When you get your food, you are happy to be knocking elbows with a stranger next to you. It is a great atmosphere every time I have been regardless of how busy it is. There are just so many happy people enjoying the fantastic pizza.\n\nYou are right by the bridge and can go for a walk before or after eating on a date. Parking as well as the lines to get in can be a pain sometimes. This is one of the only places I will wait to get in and feel like it was worth it when I leave. \n\nYou must go. It is that good.", "author": "Toby M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-06", "description": "great pizza! not the average way to prepare it and love how they give it to you in a big square bag. also they dont serve slices but i dont mind that at all because a slice of pizza from here would not be enough!", "author": "Bilal E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-07", "description": "ROTTEN PIZZA by the BRAIN DEAD\n\nAnd that's not strong enough for what I encountered on my visit.  I cannot believe the rave reviews on Yelp (which is why we came) and you shouldn't either.  These reviewers must not get out much.  \n\nThe guy tending the front door needs a lobotomy to get a personality or even care that he is alive.  Every person that worked there seemed to be medicated.  No excitement, no enthusiasm, no passion.  You know it's going to be bad when an ITALIAN restaurant has no passion. (I am Italian and frequent Italian spots).  Oh, and I always go to an Italian restaurant to listen to Latin music --- yes, they had Latin music playing.  As to the decor, they really did it up -- three 8X10 photos of Frank Sinatra in drugstore frames hung on longer than 20 foot wall made you feel like, well, you were in a cheap drugstore.  \n\nThis pizza doesn't have any of the great attributes of coal or brick oven pizza and if you've ever had a good one, you'll see right away -- this ain't it.   I have never tasted a more flavorless, unsatisfying pizza in my life and I'm over 50.     Did you ever have to ask for salt in a pizza parlor?  We had to, that's how lousy it was.  Cheap, ordinary ingredients hastily prepared by the brain-dead.  I guess the basil leaves cooked into all the pizzas were supposed to really connect them to Italian food --  how pathetic.  The tomato sauce tasted like it came out of a can, the crust was thin, soggy and bland, the toppings were sparse and flavorless.  The cheese was Polly-O -- run of the mill, cheap cheese made by Kraft -- not at all high-end or befitting a supposedly great pizzeria.   Seems like this place cut back on all the ingredients once they got a following to make more money.  Speaking of money, it's  ALL CASH by the way.   They are clear about that in a big sign and on the menu -- NO credit cards, NO delivery, NO reservations, No This, No That.  They don't deserve to be in business because they simply don't like or appreciate their customers who wait in line to be served crummy pizza.\n\n\nWe also had what they called an antipasto -- four pieces of supermarket genoa salami with a tasteless slab of thick mozzarella on each and a pile of mediocre roasted peppers in the center.  No spices, no oil, no nothing.   We couldn't believe that a place that was so popular took so little pride in their food.  It was nothing short of disgraceful.  The owners and workers are on autopilot and judging on the look on the customers who came out, they were too.  No one was happy, laughing, enjoying.  Everyone was simply bland just like the food.  \n\nThe bathrooms were located on the third floor with inadequate lighting, the ladies said the toilet was broken and there was no more toilet paper.  Another woman who was in urgent need used the men's room which was dirty.  Neither rest room had a lock.  \n\nI cannot think of one reason to go here nor will my presence every grace their doorway again.  If you think this is good pizza think again.", "author": "John G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-05", "description": "Worth the wait.   Worth the calories.   Ah-mazing.", "author": "Francine M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-04", "description": "It was definitely an experience going there, but I wasn't too amazed with the pepperoni pizza I was craving for. The thing lacked for me was the crust.", "author": "Jonathan C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-19", "description": "This place used to be great... back in 2010, but since then the \"old man\" (the host and possible owner) seems to now be around anymore. The service has become terrible. There used to always be a 45 minute wait, and now the place is empty. I sat at my table for like 20 minutes before anybody brought me water or took my order. I will not be returning. The new owner seems more concerned about exploiting the name for money than sticking to what made Grimaldi's great.", "author": "Justin W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-21", "description": "Good, classic NYC pizza but not worth the long wait in my opinion. I view this as a bit of a tourist trap.", "author": "Kim W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-13", "description": "This was great pizza, but the wait was crazy.  That's no fault of the restaurant and obviously a testament to the popularity considering the fact that this is not a touristy part of the city.  Not sure what we had for toppings, but the experience was great as my first NY pizza (other than a crappy little place in Midtown that I grabbed a bite in a hurry one day).  We were with local friends that gave us the heads up that it was cash only.", "author": "Jim N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-06", "description": "Not enough could be said about this spot, all the food is amazing obviosly .. best neighborhood pizza joint period!!! bar is nice tooo", "author": "anthony A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-14", "description": "Okay, listen up.\n\nIt's almost a given that most \"institutions\" in New York are overrated and overpriced. Grimaldi's knows that they're going to have a good business forever, so they can act like they pretty much do. not. give. a. fuck, which is exactly what they do.  A surly waitstaff, dirty plates, and cramped seating--their pizza better be GD amazing. \n\nAnd Grimaldi's does have very good pizza.  Is it the best pizza I've ever had?  No.  It's like that quote: \"Pizza is like sex and The Simpsons.  Even when it's bad it's still pretty good.\" \n\nBut am I gonna wait in a 2 hour line to get a pizza?  R U FO REALSIES?  I don't think so.", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-28", "description": "Probably the best pizza I have eaten till date. It was little pricey and also the long wait but  it was all worth it. l have tried only the pepporoni, sausage toppings pizza. It's must stop place if visiting New York.", "author": "Shaggy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-12", "description": "I concur: waiting in line sucks, and this is the best pizza ever.", "author": "Erica C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}