{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-11", "description": "Sorry BURNT crust isn't my idea of good pizza.\nTried the Margareta style on a Bus Tour..I don't even think I tasted any Basil. \nThis is one Pizza joint I won't return to.", "author": "Matt S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-19", "description": "one very important thing to remember is that if you are expecting a traditional NYC slice, this is not the place to go.  They make amazing margherita pizzas here and they put them in a bag instead of putting them in a box like your typical pizzeria.\n\nThe sauce, dough and cheese are delicious.  The service is awesome as well. They've become quite a bit of a chain over the years, but the quality is still high.", "author": "Biru S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-09", "description": "There's only one appropriate word to accurately describe Grimaldi's. AMAZING. I came in with my brother to grab some pizza. He had already been here once before, and he sung it's praises so I decided to take the plunge and hop on the subway over to Brooklyn. \n\nWe grabbed a seat and ordered a small pizza which came to be three slices for each of us. It was a margherita pizza that had tomato sauce that tasted like a fine wine. The mozzarella was fresh, and the crust was heavenly. It was a thin crust pizza cooked in a coal brick oven. At first I was in awe of how good this pizza was, then I started mowing it down and we decided to order another small. In total we had 6 slices each. When I got to the final slice, I almost wanted to quit, but it tasted so good I just couldn't stop. \n\nSo since we felt like a bunch of fatties, we figured it would be wise to walk back over the Brooklyn Bridge to Manhattan and walk it off. \n\nIf you want a legitimate slice of pizza in New York City, you NEED to go to Gramadli's. It's the best.", "author": "Mark K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-18", "description": "Didnt have a chance to get/eat my takeaway pizza due to an emergency, however was absolutely appalled by the service! Not only did they not greet myself nor the others who entered with me at the door but they proceeded to yell that we \"did not read the sign in the front\" and \"should be waiting behind the sign\" and gestured until we followed their instructions. When I returned inside to explain that I could no longer wait for my pizza and had to leave, their first reaction was to roll their eyes and say to each other, in front of my face, \"oh look, she's come back inside, now what?!???\" As if they believed I couldn't understand English. I am disappointed by how unbelievably rude and racist this establishment was, particularly for a venue that is such a local tourist attraction.\n\nOnly positive was that they gave me my refund when I explained that I had an emergency.", "author": "Sue Yean T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-22", "description": "I love pizza and I like to come here once in a while as a special pizza date night. Pizza is good. Delicious. But then again there's no such thing as bad pizza for me. Waiting isn't too bad ever since they moved to the current bigger building. Service is pretty bad as the waiters act like they don't need your business but overall it's good and that's why I kept returning here. \n\nToday, me and my boyfriend ordered two pies and it came out to $59 dollars. It was little too high for two pizza pies but we didn't think much of it and put $70. However, while the waiter took his time to get to our table as usual to get the check, I looked through the check and realized there's an extra $10 added up. We asked if gratuity was added and they said it is. Are you serious? Not only the 20% tip is way too much for their shitty service, it's shady and deceiving as they don't clearly say so on the menu or check. I'm not sure since when they added tips to every check or if everyone notices it but they must collect double on what they're supposed to get from a lot of tables. I know that we've been tipping on top of these gratuity-already-added checks. This is a landmark of Brooklyn for both tourists and locals and they should have the suitable business ethics. They probably don't care about losing couple of businesses now because they get endless tourists but it will catch up to them one day. Grimaldi is ruined for me. There are plenty of places that do coal oven pizzas.", "author": "Shinhae C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-06", "description": "I didn't understand the hype about Grimaldi's. \n\nPros:\n-Good crust\n-Use of fresh mozzarella\n\nCons:\n-Flavorless sauce (could have benefited from herbs and/or salt)\n-Plastic plates, cups, utensils  (I'm not a snob, this is just bad for the environment)\n\nOverall, OK pizza, but nothing worth raving about.", "author": "Michelle A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-08", "description": "Pizza was good. As everyone said, there is a long line. It might be just the hype that makes you think the pizza is good. Next time I will go to Juliana's to see if there is a difference.", "author": "John N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-14", "description": "I liked the pizza (as you can see in the attached photo), the place is nice and the small pizza is big enough for 2 persons, although I was hungry and ate it by myself and didn't feel uncomfortable after that.\nFor some reason, they accept only cash, so be prepared.", "author": "Ziv S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-10", "description": "This is a very casual, old school restaurant. Servers were friendly and cracked a lot of jokes with us. I'm a crust person - and I think it's important to get the crust of the pizza right. This place perfected that.  It has this yeasty flavor and amazing crunch. \n\nI ordered the medium red pizza with mushrooms and sausage \u0026 a plain white pizza. Definitely was wayyy too much for two people. Both pizzas were very good. The ingredients were fresh and the cheese was wonderful. It is definitely something to eat right out of the oven. I had leftovers for lunch the following day and it wasn't as good. \n\n\ntip: Cash only so don't forget to stop by an ATM.", "author": "Nhimo P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "Easily the best pizza I've ever tasted in my life. I had just returned from a three-week trip to Italy when I stopped in for lunch at Grimaldi's and my pizza here (pepperoni and Italian sausage) blew all of those in Italy out of the water. Luckily I didn't have to wait in line, but if you ask me, it's worth a wait!", "author": "Tony C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-06", "description": "I just want to start by saying that I loved Grimaldi's. Not just for the name and reputation, but the food is great! The reason for my 2 stars is from my recent visit to the Coney Island location. I have been there a few times mainly in the summer, however I decided to take my mom to Grimaldi's before she left for a snowbird vacatio to Florida. Coincidently she had a couipon for a free pie that she got from the famous summer concert series in Coney Island. So we went on a cold December night, ordered sodas a salad and the pie. The place was empty, but our waiter was still not very attentive. In any event the food was great so I didn't mind. It wasn't until I recieved my check that the trouble started. I don't mean to toot my own horn but I know what it is like to be a server and work on tips plus I have no problem paying for quality food. However my waiter was not able to tell me how my salad and to sodas came for 40 dollars!!!!!! Alll he could explain fro the scribbled reciept was that the free pie had a small service charge. Fine. Service charge, a ten dollar salad, 2 sodas and tax STILL wouldn't equal to 40 dollars. We ask him to go to the manager to double check why it was so much. Immediatley after he left, a female who I had peeped a few times giving me the evil eye, stomped confidently towards my table slams down the receipt and says \"18% is the service charge IT IS NOT too much\". Well I almost lost my composure because I am from Brooklyn, I do not do well with anyone charging at me let alone a manager of a buisness I am spending money at. LET ALONE , a buisness that holds meaning within it's name. I calmly ask her to break down the bill because it still did not add up. She started to talk nasty to my mom, even at one point telling my mom to let her speak.", "author": "Laurie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "First time hearing about this famous spot waited on line maybe 20 min because I heard lines are crazy here overall the pizza is really cheap a large pie is only 13$ I mean 8 slices that's very fair toppings $2 extra that's not bad at all. Real pizza is brick oven only don't fall for the regular ovens not the same taste because pizza is only worth eating on the spot.", "author": "DrizzyBaby S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-20", "description": "Probably one of my favorite pizzeria restaurant in NYC. But, the one is that you'll have to wait a huge line outside because all the tourist flocks to this iconic restaurant to have a taste of deliciousness. Everything is fresh and made when you ordered your pizza. The basil, tomato, crust, and oh the mozzarella is beyond amazing!!!", "author": "Aaron L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-01", "description": "This place is waaay too overrated and the long line is not worth it. The pizza was not good - it was wet and soggy and when we told them it's wet and not etable, they said it's because of ricotta cheese... unacceptable! $80 for two small soggy pizzas? No no no. You're better off going to Lombardi's in downtown Manhattan.", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-14", "description": "Delicious pizza without a doubt.  However, the environment is not welcoming at all.  You feel quite rushed and I didn't see a single smile coming from the staff.", "author": "Ramon G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-20", "description": "SERVICE- not so great. They are very busy with long long lines. You can't expect great service when you are that busy.  I understand that, but when they make you wait in the same long line for take out, is a little ridiculous.  I tried calling my order in three times but no answer. They need a better system. \n\nPIZZA- just okay. I ordered the pizza to go and by the time we made it to our room the pizza was cold. (Approximately 15-20 minutes)\n\nI'll try it again but next time i'll dine in.", "author": "Mike A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-22", "description": "I must say, Grimaldi's has some pretty darn good brick oven pizza. I thought Grimaldi's would be a over hyped pizzeria because of it's name and fame but it's actually not. The ingredients were great. Their thin crust pies are very crunch and crispy. I really like the cheese they use and their not too heavy on the sauce. What I like most about Grimaldi's is that their pizza isn't full of grease and oil. I hate eating a pizza that is leaking orange oil. At Grimaldi's, I didn't get that at all. Every ingredient on their pizza is well balanced.\n\nThere are 2 things I dislike about Grimaldi's.\n\n1 - Their restroom was pretty nasty. Bunch of flies and mosquitoes everywhere and the floor was a hot mess too.\n\n2 - When I was waiting to use the restroom, I stood right by where the guys prepare the pizzas. I saw a couple flies flying around touching the cheese and other ingredients. \n\nVerdict - Still very good brick oven pizza. I just wish they were cleaner. When I see things like that, I can't understand how some restaurants can get an A grade posted on their window from the health inspections. There's no question that their pizzas are good but you can't kick cleanliness to the curb just because you're a famous pizza spot.", "author": "Gary L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-18", "description": "It's OK pizza, I've had better tasting pizza at Penn station. There is better tasting pizza at other places, I knew I should have gone to Juliana's. OH well, next time.", "author": "GA F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-03", "description": "This place is small ,  long wait,  line is outside . Then your sitting on top of people you don't know .  Very uncomfortable setting.  Very rude host . I guess there aren't any options available so you have no choice unless you want to starve .  Cash only , no credit cards .   The pizza was pretty good , nothing great ,  just good.", "author": "Vito M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-14", "description": "Believe the hype! I was directed here by a friend who was visiting New York the same time I was. This is a small and quaint place that seems to be pretty old. The brick oven used to bake pizzas has been there since day one; or at least that's what I was told.\n\nWe had a very simple pizza; fresh mozzarella, sausage, pepperoni, basil and a very simple tomato sauce. The crust was extremely crispy even though the pizza was very thin. This is absolutely one of the best pizzas I have ever had in my life. In a nutshell it was very simple, fresh and delicious. I believe our pizza was about $18 which isn't a bad price for the quality and the size which was a large.\n\nI've heard the lines can be outrageous however we were there on a Wednesday about 5 PM and we were able to get a seat right away but it is a very small place.", "author": "Syl M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}