{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-30", "description": "I have been here several times, usually at the request of a friend who has not. \n\nThe pizza itself is okay. They have a thin crust style of pizza, not a lot of sauce, and not too much cheese. You can easily spend $16-$20 per pie when you start ordering toppings. If you can usually eat one regular NY slice, expect to eat 2-3 Grimaldi slices to get full. \n\nThe line is usually ridiculous. It stretches all the way down the block. This is not an exaggeration. If you are at the tail end of it, expect to wait an hour. The owner has, on a couple of occasions, come out and told people to go to the other pizza place down the street. (I didn't know that there was one, but it exists. How does it get business? I don't know.) When you are finally seated, they like to take your order ASAP. They have a lot of customers waiting and they want you out the door ASAP. So, I felt a little rushed, and there was definitely no time to chat for a little after we were all done. Plus, I think they put on the air conditioner really high, to freeze us and make us eat faster. Okay, maybe that is a conspiracy theory.\n\nIn any case, come here once for the tourist, but I don't think it is worth the wait twice.", "author": "Stacy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-17", "description": "This is pizza worth waiting in line for.  I have never tasted anything so delicious that called itself pizza in my life.  If you read my other reviews, you will know that I am not a fan of pizza--but this is different my friends.  \n\nThe place is cash only and sometimes has a two hour wait, but once you get in, the process is very efficient and worth all the peering into the doorway to see what the hype is about because it's legit.  \n\nThis is the perfect New York experience, especially when coupled with the walk across the Brooklyn Bridge on a pretty spring day.", "author": "Heather V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-30", "description": "There is much better if you search in the nooks and crannies of NYC. Grimaldis is good, but highly overrated.", "author": "John L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-01", "description": "Cash only. (Fairly common in this whole area.)\nRude (RUDE!!!) service.  (They act like they are doing YOU a favor allowing you to eat their pizza - think \"Soup Nazi\" in Seinfeld.)\nLONG (long) lines.  After being told the long line would take 30 mins but waiting over 70 mins, we finally got a table.  We were now STARVING (our fault for already being hungry when we came).\nWe quickly ordered.  \nThey brought us someone else's pizza (one, when we ordered 3)... we had to wait a LONG time, staring at this delectable looking pizza, until a server finally noticed that we needed them.  We told them this was not our pizza.  They took it away.  Period.  \nEventually, our pizzas came (1 cheese, 1 pepperoni, and 1 that was 1/2 veggie and 1/2 sausage olive - $2 extra per topping, even if you are doing only half... so the $16 pizza turned into a $28 pizza)... they were AWESOME.  We INHALED them.  4 people ate almost 3 whole pizzas (we expected to have a whole pie leftover and instead left with about 4 pieces).\nYUM!\nBut was it worth it?\nI guess it was fun to try, but there HAS to be pizza that is as good where they actually WANT your business.", "author": "stacie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-08", "description": "Came here on a rainy Saturday night there was no wait at all and I was seated right away. I was super excited to try the pizza here but to be honest I wasnt that blown away, it was good but I don't really get the hype. Is it the best pizza in Brooklyn? Nah. But its good pizza and worth visiting if you're in the neighborhood.", "author": "Jinelle T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-02", "description": "This is a place with awesome pizza! Be sure to bring someone with you to share the pie with. I went here last week for lunch with friends and we ordered two pies for 5 people. It was SO good!", "author": "Albert T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-22", "description": "Been living in Brooklyn for almost a year and decided to go see what the big deal was about Grimaldi's. My friend and I decided to order out, so we started calling, trying to get it to go. Nobody every answered. So we decided to grab the dog and walk over. We get there and the man tells us we'd have to wait in line, that we can't place an order to go. After much argument, he took our order and we waited outside for our pizza with everything on it (why not?!) and for $45 it definitely wasn't worth it. It was super salty and  the crust was soggy. I had a stomach ache all night because of all the salt. My body is definitely not used to it! \n\nAll in all, I'd say go once, but agree with Juan J.--it's definitely nothing special.", "author": "Leigh F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-04", "description": "Everyone says when in NYC you have to walk across the Brooklyn Bridge, and also eat at Grimaldi's. I'm going to chime in and say that yes, this is definitely something that you ought to do if and when you find yourself over there, the pizza is worth it. One large pizza easily fed the four of us, so not only are you getting good food, you're going to be getting enough of it to keep you happy. The line is long, but a hack we used was ordering it to go, it seemed to speed up the process.  \n\nBottom line: There's probably going to be a line, but it's definitely worth it if you're a lover of pizza/obsessed with food, like yours truly.", "author": "Liz P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-24", "description": "The line that forms outside of this restaurant is not only impressive but intimidating.  Even more so, it make it completely impossible to not have very high expectations for the pizza here.  Similarly to Pinks Hot Dogs in LA, the line for Grimaldi's reminded me of an amusement park line, all of these people waiting for what is sure to be an amazing ride.\n\nI will say that I was not disappointed in Grimaldi's.  The coal brick oven baked the pizza to a perfect crisp, and the pizza was not heavy at all.  The toppings we chose were mushroom and pepperoni, and I will admit I could have used a little bit more toppings.  It also comes with cheese and basil, both making the pizza very delicious.\n\nNow, I am definitely not the foremost expert on New York style pizza, but while I enjoyed the pizza here, it was not a life changing dish.  One of the best pizzas I have tasted was in San Francisco at Little Star Pizza, with its cornmeal crust it intrigued and blew my expectations about what a pizza could be.  Grimaldi's is standard and they do it well, but in a pizza I want something new, something I haven't had before.\n\nIt was well worth the wait and I am glad to have visited this place during my stay in New York, but there are so many great places to try in New York, and most likely this pizza will not warrant a return.", "author": "Liang W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-25", "description": "I did the smart thing by coming here at night on a Tuesday in late October. There were no lines. We got a seat right away. The staff was nice the service was quick probably because it was close to closing time and because the place was cleared out by then. It took  about 5-10 minutes to get my pizza from the time I ordered. It was super quick. I got the margherita pizza with sausage and pepperoni. Good I enjoyed it. The fresh mozzarella is what makes it good. I will come back but only at night during the week in the fall because I hate long lines.", "author": "Melissa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-11", "description": "The best pizza I've ever had was at Grimaldi's.  I'm from the bay area and nothing I've had really compares.  The wait was short at just a bit after 2pm.  \n\nI had a large pizza with pepperoni (delicious), garlic and roasted red peppers.  Everything just worked with this pizza, the cheese and sauce were light, and that balanced out with the richness of the dough.  Truly delicious, I'd recommend this to anyone visiting NYC.", "author": "Darius C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-10", "description": "It is a joy going to the original Grimaldi's where they still do it exactly how they've been doing it for decades. This is one of those places where nothing about their operation needs to change. The cheese gods smile down on this mecca of pizza. I mean that. If you are a lover of fresh pies cooked to order you must make the pilgrimage under the Brooklyn Bridge. \n\nThe crust is perfectly blackened on the bottom, fresh herbs and other toppings, great sausage with just the right amount of kick, and it comes to your table all steamy and I sit in awe everytime. I don't sit for too long though. My friends and I gobble one up before we have time to order another one. Takeout is horrible, just because I sit in front of the manhattan skyline and eat the entire thing to MYSELF and wonder where it went. I have eaten most NY pizzerias, the best pizza all over taly, Spain, China, Chicago, Phoenix and everywhere inbeteeen. No pizza in the world makes me slobber like Pavlov's pooch like the ORIGINAL Grimaldi's. \n\nThe bad side is waiting upwards of 2 hours in line. So dont be shy to make a few new friends in this line you are about to wait in. That's what NY is all about. Great food and random short term best friends.", "author": "Andrew A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-11", "description": "Me and my wife absolutely love Grimaldis.  We've been to this original location twice and despite reviews of long lines we've walked in both times with no wait.  Service could use a little personality but that could be cause its New York or cause Texas folks always want hospitality but they don't have to talk as long as their pizza does the talking for them.  We've been to 2 Houston area locations, San Antonio and Vegas so needless to say we're Grimaldis fans.  Large Pepperoni, Meatballs, Ham and extra sauce is our order.  Yumm Yumm Yumm.   Oh yea do try the Tira Masu and a cheesecake and Cannoli, can't go wrong and the wine as well or a Brooklyn Lager to wash it down with.", "author": "Edward A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-16", "description": "My friend declared that we HAD to go to Grimaldi's before I left New York, so we cabbed it on down to Brooklyn to get our pizza on.  It was the end of a long day, I was exhausted, sweaty (it had been like, 85 degrees all weekend), and not even feeling particularly hungry.  Standing in a long line outside the restaurant definitely did not appeal to me.  But once we made it inside, the aroma of freshly-baked pizza hit my nostrils and I instantly perked up!  The crust was thin and crispy and the toppings were of excellent quality.\n\nWas it worth waiting in line for half an hour?  Er...that all depends on how hungry you are.", "author": "Michelle K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-13", "description": "I honestly think I like the one in the Gaslight Building better - but it was good. We arrived a bit before they opened so we were seated first. We oddly ended up sharing a table with two gentlemen from Missouri and had a good conversation. I was the only straight person at the table : ). I think there is better pizza in New York, but I wanted to try the original Grimaldi's and at least check it off my list.", "author": "Missy E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-22", "description": "This place came highly recommended by a bunch of friends, so I (mentally) starred it on my list of places to eat in NY. I had also heard stories of long waits to get in, but that didn't deter me because if the food is good, I don't mind waiting. Fortunately the wait was relatively short since we went during the mid-afternoon after the lunch rush, and we were in our seats in about half an hour. \n\nMy party of four split a large regular pizza with pepperoni, mushrooms, and sausage. I have to say, it was some of the best pizza I've eaten in a very long time. The crust was just right and the cheese was perfect. I savored every bite, and there was just enough for everyone. Coupled with a Stewart's soda, and it's bliss. \n\nI didn't try anything else on the menu, but since it was just pizza I was looking for, it really hit the spot. Now is it worth the legendary 1+ hour waits? I think so. Next time I'm in NYC, I will likely be paying Grimaldi's a visit as well.", "author": "Nat L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-13", "description": "Unbelievable. Melissa and I stayed at the Millennium Hilton on Church St near Battery Park. Our last day in NYC, we walked over the Brooklyn Bridge and down Fulton to Grimaldi's. The highlight of this trip was not the Manhattan skyline.......Grimaldi's is unreal. I don't understand why people give this place negative reviews....is your pallet that engrained with the Olive Garden's and Red Lobsters that you can't taste good food anymore? Is it just \"cooler\" or \"trendier\" to say something is bad?\n\nDo not listen to these negative reviews. Best pizza I have ever had, and this is coming from a guy raised on Chicago Deep Dish - which is basically treason.\n\nAre you cramped? Is the owner bitchy? Is there a line? Do you have to pay in cash? YES YES YES YES....Is that a problem? NO. Who cares.....I'm sure Sbarro's was \"line free\" that day. \n\nEverything about the place was fantastic. I can't wait to get back to Brooklyn, and i cannot wait to get a pie here.", "author": "Matt S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-29", "description": "So my friends and I decided to brave the line and see if this place is any good and I'm glad to say the wait was well worth it. We just got a simple peperoni and mushroom pizza but there was nothing simple about the flavor that came with that pie.  The coal brick oven gave the bottom of the crust a certain taste to it that would normally be off putting to me but it all worked and love it.  The peperoni they use explodes with flavor.  It was a great dining experience and I will be back for sure and brave that line many more times in the future.", "author": "mark c."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-17", "description": "This place is known as the best pizza in NY, or even the best in the world.  It is extremely overhyped and is a major tourist trap.  We were lucky and only had to wait about 45 mins in line.  I heard some people have to wait 2+ hours at busy times.  We were served with pizza that was so SOGGY in the center.  I've never had a soggy pizza like this one.  The crust tasted quite standard for NY style pizza, and so did the cheese and toppings.  My friends all agreed and we're not coming back. I give this 2 stars b/c it's cheap and the servers were friendly.", "author": "Jessica N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-24", "description": "Hmmm... After reading the reviews and papa raving about it because he noticed there's always a long line to dine there, I decided to try it out with my parents on a Thursday night before Christmas Eve.  It was cold, arrived around 6:30pm and waited in line for awhile.   A New York must and experience eh? Sounds like a typical tag line to use for those who weren't raised in NY with all of the various cultural cuisines and variety of pizzas offered in the five boroughs (btw I'm not referring to Dominos or Pizza Hut). If you'd like a quick review:  I give Grimaldi's pizza an \"A-OK.\"  I give their cannoli's an A++.  Thirsty? Definitely order the Brooklyn Cream Soda.\n\nDetails:\nFirst off, if you're going there with a group of people (2+), make sure everyone is there.  The host will not get you seated until EVERYONE's present.  \n\nSecond, I do commend them for their fresh ingredients. We ordered a large pizza (8 slices for $14) with 3 toppings - mushroom, capers, and sweet red peppers ($2-$4 per topping).  For drinks, I'd recommend the Brooklyn cream soda ($2)!  YUMMY \u0026 REFRESHING!  Now, back to the pizza...  It's a blah.  I wouldn't say that it is amaaazing.  It's alright.  It's like a pizza you would eat in a fancy restaurant.  I didn't come out fulfilled.  However, the homemade cannoli was worthwhile.\n\nHow do I sum up my experience?  The place is laid back and home-like.  The pizza is \"A-OK\" for those who have experienced other pizzas in Queens, Brooklyn, Manhattan, and the Bronx (let's not forget SI).  If you're into the \"fancy\", \"superb\", \"exquisite\" type of food or were never exposed to authentic authentic (yes 2x) cultural cuisines, you might consider this as \"MUST EXPERIENCE.\" I won't go back there again for the pizza but I'd definitely go back for the home-made cannoli and the brooklyn cream soda.\n\nNote:  Grimaldi's accepts CASH ONLY.  The end.", "author": "Octavia V."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}