{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-23", "description": "Three things go against this place:\n1- Pizza taste\n2- Variety of food\n3- Cleanliness of the place\n\nFor the taste, I read on Google's review \"...it's not on the level it was years ago\".  And that is completely true.  The pizza was plain and hyped that we went in with such expectations that we ended up saying 'mehh; not worth it'.  The cheese had no flavor, the sauce probably bought from a ready to go container.  We asked for extra toppings among them garlic.  It appeared the chef preparing our pizza dumped all the garlic in one area.  So much hype for so little flavor; total disappointment.\n\nVariety of food choices can be a negative at this place.  My friend asked for a simple salad, NO.  They do not have any.  What about sandwiches with different type of bread? NO.\n\nAlso, this establishment needs a lot of work.  It is falling apart and customers (at least my two friends and I) get the feeling that the restaurant owners are not interested in repairing simple things such as wobbly tables or bathroom faucets.  The faucets were made to work by adding pieces of rough metal with edges that can cut the skin of the hands.  Owners did not bother to replace them with standard handles.  That and don't overlook the dust that is burgeoning all over the place.  It appears that cleaning does not get a high priority on the managers list.\n\nOverall, if one has to do an extra effort to visit a place such this pizzeria, he or she should be happy to talk about it and the experience afterwards.  Obviously that is not at all my case.", "author": "David C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-05", "description": "The two stars is for the food. Everything else was expected - the waiting outside, the wait for the pizza, overpriced drinks, paper plates and plastic spoons, etc. \n\nThe worst part was the food. The pizzas were burnt. They were bland with no flavor In the crust or in the toppings. We ordered 2 pizzas for three of us. \n\nMaybe worth one visit just to try them. NYC has many much better pizza places. Papa Johns for one. \n\n#NeverAgain", "author": "Rajat C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-02", "description": "CASH ONLY.  Went for dinner at Grimaldi's after walking from Manhattan on the Brooklyn Bridge.  It's not a long walk, maybe 1 mi or so.  At the split for walkers turn Left, then Left again.  Left Prospect, Rt on Front on the corner.\n\nWe didn't have to wait at 6:30pm on Thurs 3/29/12 for a table, but then once a day between 5-7pm oven is refreshed for 30-40 min!  Very annoying.  Why can't they do it 3-5pm?\n\nNo slices, gotta buy a whole pie.  Got a small which has 6 slices, for 2 people 3 slices each is lots.  Pizza taste best hot, so eat it fast.  We just got the Regular small pizza $12 \u0026 B. got 2 Brooklyn Lagers for $5ea.  Our total $22 + $2 tax = $24 before tip.\n\nCash Only, ATM on the 2nd Fl.  Separate bathrooms bottom Fl women's 2 toilet/1 sink.\n\nYou can get Brooklyn Ice Cream \u0026 Jacque Torres nearby.", "author": "Ann L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "Although this is the hipster dumbo area this is a pizza place you don't want to skip out on. The pizza is super cheesy and toppings are full of flavor and not dried like some other pizza places.  Can't wait to go back to get my fix. Authentic and fresh", "author": "Desiree Michelle M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-31", "description": "I came here yesterday and I was trying to find a place where they made gluten free food because I am gluten free. I saw this place and I wanted to give it a try. The lines were incredibly long but I thought if the lines are this long, it has to be good. Before I was going to eat here, I checked the menu to see if they made gluten free pies. It didn't say anything on the menu so I asked the host. Instead of getting a response of \"No, we don't have gluten-free pies, sorry for the inconvenience,\" or something like that, I got a response like this from an unhappy and rude older man(host), \"What do you mean, gluten-free pies, we don't serve that trash, we serve real pizza,\" I was in shock that this man said this and people around me that heard this as well were stunned. The best part is as I was about to leave, the same guy says to a family of three, \"You three people, with the baby, this isn't a park so either leave your stroller outside and come in or you can eat outside,\" Right then the mother was furious and she started yelling at the man for being extremely rude and he completely ignored her and walked away. After seeing and hearing this a bunch of people left and all saying \"I will never come here again,\" \n I will never come back to this place, and someone should really put that man into a manner class. The old man(host) was almost beat up by some pissed off spanish guy with his family. He told the host he was the biggest jerk off he's ever met. LOL. The host was a big a-hole.", "author": "Julio V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-03", "description": "Crispy, yummy, thin, awesome, delicious pizza. Straight out of the oven goodness. Must try! \nThe place is tight and always is filled with customers. We got there a little past noon and the four of us got seated right away. It's a two ...well, three story building but tables only in the first two stories. We were seated in the second story and even there it was pretty packed. \nSeriously...this place is so good! It's worth the wait.", "author": "Damaris Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-01", "description": "Extremely rude staff (especially the manager). Completely overrated! You can get a similar, if not better, pizzas elsewhere in New York. Expect the astringent attitude of the staff to leave a bad taste in your mouth!", "author": "Nazly H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-09", "description": "Come on Grimaldi's.. really?\n\nThis place is hyped up to be one of the best pizzas in NYC, and waiting that 45 minutes on the line sure seemed to back up that statement. False.\n\nPacked with locals and tourists, I knew the service would not be very pleasant. It started off with half-assed cleaning of the previous table and warm-cold glass of tap water. \n\nIf the pizza lived up to its name, I wouldn't care for those things, but the pizza really wasn't the one that \"I can't refuse\". As a matter of fact, I could refuse it right now. \n\nHalf of the pie's crust was decently burnt to the point where you can't eat them, and they literally put 3 basil leaves clustered in the middle. \n\nBut I'll give credit where it's due. It was a solid pizza - just not one of the best out there.\nWould I really go out of my way to get this pizza again? Probably not.", "author": "Sung K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "Grimaldi's = so freakin delicious! After being a New Yorker and being too bougie about going to a super hyped pizza place, I've finally tried Grimaldi's and recognized it deserves all of its recognition. The pizza tastes like genuine brick oven and in each bite you can tell how fresh the ingredients are.\n\nMy friend and I split a pie. She's a vegetarian so we got a pizza with mozzarella cheese \u0026 tomatoes (on my half I had to add peoperoni!) They don't do pizza by the slices, its all pies and you pay about $2-5 for your toppings, depending on which ones you get. It isn't cheap pizza, but its authentic and pretty much worth the price.\n\nAlso located in the best neighborhood in Brooklyn, Dumbo which basically asks for a nice picnic by Brooklyn Bridge park!", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-29", "description": "This, in my opinion, is the best pizza place I have been to.  \n\nThe basic pizza is a thin crust, crushed tomatoes (instead of \"sauce\"), chunks of mozzarella (instead of shredded cheese), and basil.  The way this all melts together is fantastic.  You can add toppings to your selection and everything is reasonably priced.\n\nThe 6 slice pizza is perfect for 2 people.  \n\nThe cannoli is probably the best cannoli I've ever had.  To prevent the shell from getting soggy, you have to fill it right before you serve it which I'm pretty sure they did.  It was amazing and, even though I didn't have room for it after half a pizza, I downed it anyway.\n\nThe seating is a little weird as they sit parties of 2 at 4 person tables.  There's nothing \"upscale\" about this place but who cares?  It's a PIZZA place!\n\nGo here and enjoy.", "author": "Eric R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-10", "description": "Not deserving of all the hype.  They stop serving food at 6pm for 30 minutes to clean up (like, who does THAT at peak times?!), a male staff member barged in on my GF in the bathroom (on the can, no less), they offered us the check whilst we were still eating, we said no and they bought it anyway and then one of the staff took my plate away whilst i was still eating from it.  Very disappointing - food wasnt that great either and they dont have a licence to sell booze so you have to have soft drinks from regular bottles.  Give this place a miss...rude staff, bland food.", "author": "James B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "If you're looking for classic Brooklyn pizza, this is it. My friends and I waited nearly 2 hours to get in and get our food, but it was worth it. Though there was a long line outside, once we got in it did not feel crowded, or rushed. Great music played over the speakers (granted it was from someone's free Pandora account), and when our pizza arrived, deliciousness was had. I ordered a small regular pizza with (just) extra mozzarella. The taste of the cheese still lingers in my mouth almost 18 hours later, and the sauce was spot on. Despite the pizza being a \"small\" it would have definitely been enough to feed two people, but I was especially hungry.\n\nLooking forward to coming back here!", "author": "Jake S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-07", "description": "Pizza was OK here.  We got a normal cheese pie and then one that was basically the supreme.  The supreme was super soggy and the cheese one was OK.\n\nI rather go to Lombardi's or Artichoke's.   At least you could walk over to Brooklyn Ice Cream Factory for dessert.", "author": "Audrey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-22", "description": "Ah, the World Famous Grimaldi's pizza! Was it delicious? Heck yes. I was actually pleasantly surprised. My expectations were already high, so I was praying my dreams of the deliciousness wouldn't be shot down. My friend and I ordered a large ($18) pie that was half regular and half white (YES, you can do halfsies) then also added some pepperoni and sausage to give it some meat. \n\nThis pizza was love at first bite. In fact, we finished the large! Perfect thickness and easy to hold. The pie itself has just the right amount of toppings except the cheese (hence the half star deduction) - not enough for me! I'm a cheese lover, so I was a little disappointed in that department. Other than that, I have no major complaints. Great location, outstanding food, and quick mediocre service. \n\nQuick Tips:\n\n1. Cash only. \n\n2. Walk across the Brooklyn Bridge after you eat, it's the perfect way to burn the calories you just devoured. \n\n3. Enjoy the pizza with a Brooklyn soda on the menu. Perfect way to wash down a couple bites! \n\n4. Rumor is that the line gets INSANE! I came right when it opened so we pretty much walked right in. We did see the formed line after we ate though. Come early!", "author": "Alvin Joseph R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-16", "description": "I don't believe I have written a review before and - as a small business owner who sometimes deals with inaccurate or unjust reviews about my business - I swore I never would write one. BUT... tonight I had to write a review about my experience at Grimaldi's Pizzaria in Dumbo, Brooklyn. \n\nSo I walked in at 8pm to ask if they deliver (I live nearby). The host laughed and said no. Ok, don't know why he needed to laugh -- pizzarias often deliver right? -- but whatever. So then I asked where I could order. He showed me to a man who was furiously dealing with orders. I asked if I could order and he grabbed a pen and pad and just looked at me. No smile, no how can I help, nothing OK, it would have been nice, but whatever. So I ordered a large pizza with sausage and green peppers. And a couple of cokes. He said it would be 30 minutes. I asked if I should pay now. He told me $31. I paid cash. I asked if he needed my name, since he didn't ask or give me a receipt or anything at that point. He said no names, and produced an old movie theater-like ticket and wrote down 205 on it. He said they generate random numbers. Ok, not sure how that is easier, but whatever. I went outside, made a couple of phone calls, came back 30 minutes later. \n\nThat's where the fun began! \n\nI produced my ticket and told the host I was here to pick up my pizza. '\n\n'What did you order,' he asked. '\n\nA large sausage and green peppers,' I said. \n\nThe guy who took my order now jumped in: 'I told you red peppers. We don't have green peppers.' \n\nSo I said 'No you didn't tell me that.' \n\nNow the host jumped in: 'I told you to look at the menu before ordering.' \n\nMe: 'No you didn't tell me that either.' \n\nI said 'Look, I own a business as well --' and before I could even finish my sentence -- that mistakes happen but that the business should listen to the customer before blaming them -- the guy who took my order became aggressive and said: 'You own a business? Well I'm the owner here. And I don't want your business. I don't like your attitude.' '\n\n'My attitude,' I said? I couldn't believe this. 'I came in to collect my pizza -- a sausage and green pepper pizza which I ordered from you and paid you for -- and now you tell me you had told me you only have red peppers, which you didn't. And your host's defense was that he told me to look at the menu first, which he didn't!' \n\nAt this point the owner slams $25 in cash back on the counter and says 'Take your money! I don't want to serve you!'\n\nI was shocked. But at this point I was hungry and had just waited 35 minutes. So I figured I would suck it up just to get my dinner. So I said 'It's fine -- then I'll take the sausage and red peppers, no problem.' \n\nAnd this is why I am now writing the review. The owner looks and me and pauses and says 'Apologize and I'll give you the pizza.' \n\nAPOLOGIZE?? \n\nI couldn't believe the sheer brazen arrogance of this guy -- who is the owner! Why would I apologize to this guy when he messed up my order...AND THEN lied that he had told me otherwise...AND THEN refused to give me the wrong pizza anyway unless...I own up to his mistake? That I should be contrite? That I should grovel for forgiveness? What the hell is wrong this guy! But I didn't say any of this. I just told him 'No I won't apologize'. So he pushed the $25 towards me. I said 'It was $31. And you have an attitude problem.'. He said something snarky again about not wanting my business. And I walked out. \n\nSo: here's are my take-aways: \n\n1) Grimaldi's clearly operates in a sellers market and the owner clearly thinks he is an old school guy running and old school business with an old school demeanor where he can get away with being a jerk because there is largely tourist traffic in Dumbo so he doesn't have or need repeat customers any way. But I am not a tourist. I live around the corner. And this was my first time trying to buy a pizza from Grimaldi's. So since I am not some intimidated tourist who might not see the value in calling them out on this but a local who lives and owns a business nearby, I am writing this lengthy review to make sure everyone know how these guys roll. As an owner, I ALWAYS talk to any customers calmly, logically and respectfully, even when they are in the wrong, since we are in the service business and that is what a service business owner should do. This guy was neither calm, logical nor respectful. 1 star. \n\n2) There are no fewer than two other pizza places on the same block: Julianne's and Ignazio's. After this debacle, I went to Ignazio's and ordered a pizza - it was great, they were prompt, no attitude. I hear Julianne's is really good as well. So you might consider those places as alternatives if you don't want to risk running into the same experience I did. \n\n3) Yelp is a pain in the butt when you are a business owner and customers lie or are unfair. But I guess it is a boon when you are a customer telling the truth and are justified in your complaint", "author": "gee l."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-05", "description": "Crappy horrible service.  Zero stars.\n\nWent to the restaurant on 8/1 and was seated on the second level which was covered by 4 male servers. Witnessed and experienced the following:\n1. Server with arm sleeve tattoo was kind of rude about where we should sit--didn't greet us very nicely.\n2.  Saw asian woman hand a bill to a bald server at the bar area--he didn't even acknowledge her. Just continued to count a stack of money.\n3.  Server with arm sleeve tattoo bulldozed into asian woman's child and didn't apologize. \n4.  Tried to get any server's attention to switch a drink soda.  All four servers were standing at the bar area which was right next to our table. Tried to wave them down. Called out to them politely. No one looked at us or acknowledged us for a while as if they were deliberately trying to look unavailable. Until finally the server who took our order came by. Asked to switch the soda to another kind--he just took the bottle and walked away. Came back with the new drink. No talking. Just handing us stuff as if it was an inconvenience.\n5. Tried to get a water refill and ice cup refill for soda. Bald server looked pissed and walked away and said something under his breath.  Nice, buddy. We can see and hear you.\n6.  Server with arm sleeve tattoo was only paying attention to table near by with young pretty ladies and didn't bother with any other tables.\n7.  Our bill was $27. Decent service would warranted maybe a $4 tip on the low end.  We paid with $40 and wanted change.  They never returned with our change. That's a $13 tip. Hell no, your service wasn't worth a single dollar, let alone worth $13.  We had to request our change.  They had no intention of giving our change back to us.  \n\nPizza was alright but tasted worse with the crap service we were given and observed. We will never go back to this place nor recommend it to anyone we know traveling to NY.  Suggest you train your staff to be nicer to guests.", "author": "Katherine H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-20", "description": "Tasty is simple. \nI like plain regular pizza because it helps I can tasty real pizza! And GOOD price! \n\nThe reason why I give 4 stars, their service quality are not that high then I thought.\n\nAnd they don't take credit card. So, you need to bring cash.", "author": "Joo H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-16", "description": "Good pizza, cash only  our server never came back to our table after dropping off the pizza to see if we wanted refills or anything at all.... Literally had to wave him over .", "author": "R C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-08", "description": "Poor service. Cash only. Undercooked mozzarella. Plasticware. Only positive is great pizza crust.", "author": "Aline C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-09", "description": "Eh Grimaldi's. It's kinda overrated. The pizza is good, but the ridiculous wait takes away from the tastiness. My friends and I waited over an hour to get in and when we did finally get seated, we noticed there were empty tables inside!\n\nUhm. \n\nDo they purposely NOT fill those extra tables so the line stays long and people think, \"Oh wow! This place has a super long line! It must be AMAZING!\" -_-\n\nI DID enjoy the nice accordion man who serenaded us while we ate! :) So to conclude, the pizza is delicious, but not worth the wait. There are other pizza places that are just as good, like Ignazio's around the corner!", "author": "Kei H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}