{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-24", "description": "I went back to try their food again and it was delicious.  Sorry about my last review Grimaldi's.", "author": "Larry P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-21", "description": "Pizza was good. But it was unhappy experience for me.  The old guy there was really uncomfortable. He said that I have to put my stroller out of the restaurant cause there is no place to put a stroller. I didn't want to do that cause I don't want to lose my stroller. So I decided just to take out the pizza. But when I came in to the restaurant, there were many people with stroller(and they even didn't fold it). I was really uncomfortable with the old guy, so I changed my mind to eat pizza in the restaurant. I folded my stroller and had to take my baby in one hand and bring my stroller the other hand. The pizza was good but not so special, it was just  normal brick oven pizza. I was really unhappy with this bad service. The worst thing was that some people pushed their stroller with their baby after me and the guy provided high chair also! What the....?? I am not gonna visit this pizzeria again.", "author": "Sam S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-15", "description": "This place blows, it was never close to the hype.  Too many young people with money thinking they know food let alone pizza.  I've eaten at several Grimmaldi's from NY to Vegas, and Phoenix, and the best one is in Tucson, no BS, order well done and enjoy.", "author": "Vince D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-10", "description": "We went to Grimaldi's over in Brooklyn under pouring rain, but the pizza was entirely worth it. The restaurant was packed at lunchtime when we arrived at lunch time, bustling with activity. I really liked the open kitchen where one can see the brick oven and different cooks stretching the dough and putting toppings. It gave the whole restaurant an even more dynamic, homey feel. \n\nWe ordered the basic pizza which comes with fresh mozarella and basil. It came piping hot from the oven, I took a bite and thought: near perfection! The crust was thin and crispy like NY pizzas, but there was also a slight element of chewiness (very slight, as the crust itself is very thin) that allowed the flavor to fully come through. The tomato sauce had a tinge of spice and was perfectly seasoned. The fresh mozarella had melted in the oven and coated the pizza with a perfectly proportioned layer of moist, flavorful, high quality cheese. And finally, the basil was surprisingly flavorful for the quantity that was sprinkled on the pizza. All in all, the perfect marriage of ingredients.\n\nGrimaldi's has definitely lived up to the hype. Rain or shine, I'm going during my next NY trip.", "author": "A W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-02", "description": "pretty darn good pizza for the price.... been there a couple times since my last review.  still not up on their customer service skills or how they run the place, but oh well", "author": "Chris J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-19", "description": "So if the guidebooks say it's the best pizza in New York then you just have to go and check it out, even if it's in Brooklyn about half a mile from the nearest subway (that's a long way with a toddler). I've been in once and been past a few times and there's always been a queue. We got there early and it was a good decision as the queue got very big shortly after midday. And the pizza? We had two huge pizzas to share between 8 (kids and adults) and I'm afraid to say one of the pizzas was burnt. My husband says I think toast more than slightly warm is burnt, but this is an exaggeration and no kidding the pizza base was not brown, but black in places. That did sour my opinion of the pizza. The general consensus was good, but not perfection in my book.", "author": "natynatster"}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-30", "description": "Great for a loud evening with friends.\n\nPlan for a night when you don't mind waiting in line. It's nearly inevitable. The pizza is great, of course--NY style thin crust. The service is fine. I love that the owner greets customers. I usually get the classic margarite pizza, but I branched out and got pepperoni last time and REALLY liked it. The place is loud and very crowded, but it's a lot of fun. And it's close by to great ice cream by the water.", "author": "Randi G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-26", "description": "i'll keep it short since...well everybody and their mother has something to say about grimaldi's right?\n\njust don't make the mistake i did...i talked too much and my pizza got cold.  just an excuse to go back!", "author": "jozilla w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-24", "description": "I just had it ! - just now... only 2 hours ago so a fresh review for some seriously fresh pizza! It was good, definitely good, I enjoyed it, definitely... we took a pie to go and ate it on the grass across the street in the park, the weather was sunny and beautiful...but I can't lie and say it was the best pizza, sorry, that's just IMHO. We waited about 40 minutes which wasn't bad given it was a beautiful warm sunny Saturday afternoon. It's the same long line whether you are eating in or taking out, but it's really not that bad if the weather is nice, it's part of the experience..I guess... We got the regular pie- fresh bread, fresh tomatoes and sauce and fresh round chunks of mozzarella cheese, it was $12 for a small pie, 6 slices but $2 bucks extra for to go?? weird... ok. It's a beautiful area, so make a day out of it and go walk around the area after, gorgeous views of downtown Manhattan. I'll give it 4 stars, but if someone somewhere out there knows a solid 5 stars in NYC, do tell!!!", "author": "Lana K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-17", "description": "Really good pizza. Neapolitan is not my style, but they did it well.", "author": "Tom O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-27", "description": "Been there twice. Pizza is definitely one of the best, the lines are crazy, though. Had to wait about ten minutes for the waiter to come over once we got in, but our order was ready pretty fast. All in all, if you have an hour to kill and feel like having a delicious pizza, Grimaldi is absolutely the place to go. You won't regret it!", "author": "M S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-19", "description": "I always see a long line at this pizza spot... One day driving by i seen no line so i figured let me try this pizza.... I realized it's just a tourist spot  ...I would never wait in line for there pizza... Waiters are rude also...THE PIZZA IS FRESH BUT I JUST FELT LIKE IT TASTED PLAIN ... BORING", "author": "G C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-24", "description": "Wow!  Pure deliciousness.  Everyone has well described the wait, but I think they understated how long you can in fact wait.  We definitely waited much longer than an hour, but luckily it was a perfect evening as far as weather goes.  At least it was worth it.  The pizza was delicious and the service was very quick.  For pumping pizza out that quick you would think that the wait wouldn't be as long.  We ordered a plain pizza and one with onions and red peppers.  The plain was just pure perfection.  It does get cold quickly (perhaps b/c the room was freezing) but it was still delicious.  The onion and pepper pizza was good - not my favorite.  It got a little watery b/c of the peppers, but still very good.  I think this is a great option for 2 people.  Groups of 2 were cutting the line much faster as they were wedged in when the rest of a table was taken up by a larger party.  There were so many parties of 4 - that is where the hold up is.  It was still worth it and I would go back in a heart beat - or maybe I would call in and pick up.", "author": "Deborah S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-23", "description": "Pizza is tasty but soggy.  Soft crust.  Used to be a lot better and the people that work there are rude.   I live across the street and only go when it's convenient to take out.  They got themselves in all the tourist books so it's loaded up with tourists but it's not even close to the best pizza in NYC.", "author": "Melissa R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-03", "description": "This used to be my favorite pizza joint bar none, back in the days Patsy was around.  Last few times, the wait did not seem worth the soggy pie...", "author": "petranna j."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-03", "description": "BEST pizza ever!!!!  Definitely worth the wait...it was so good I went here 2 nights in a row.  I love the combo of pepperoni pizza with ricotta cheese...I'm drooling just thinking about it.  We ordered 3 large pizzas for 4 people and almost finished it all....just can't get enough!", "author": "Sunday R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-13", "description": "Need I say more??  Great New York Style pizza and location near the Brooklyn Bridge.  If you are a tourist, walk the bridge after eating that mouth watering pizza.  Or take a picture near the water overlooking the bridge. I have high standards coming from the tradition of Deep Dish Chicago Pizza.  Trust me.  PUT THIS ON THE TOP OF YOUR LIST FOR PIZZA PLACES TO EAT!  You will not regret it!", "author": "Rhys R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-23", "description": "Would I wait in line an hour for the pizza?  No but a lot of people are willing and able.  My friend has a hook up.  Him and Joe are tight so we get hooked up.  Joe was telling us stories of all the famous people in the restaurant the past few weeks - Michelle Obama, Lady Gaga, Jay Z, Beyonce, etc...  Most people probably don't like him because of his gruffness and the waiting game but he is a real old school straight up fella.  Walked right in front of the line and were seated in 2 minutes.  The pizzas has an amazing flavor from the vibrant red sauce, fresh beautiful mozzarella and toppings.  The bread had a nice soft chewy flavor but it could have been a little crisper on the bottom of the pie.  Can you ask for it well done or would they kick you out?  The pepperoni is some of the best cured meat I've ever eaten.  Even my pregnant wife who never eats pepperoni loved it.  I'd eat the pepperoni pizza every day if we could get it a little crispier.", "author": "Jerrold S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-20", "description": "The pizza here is good, but it's not worth the wait. If you decide you must go anyway, make sure you eat a snack because chances are you'll be waiting for a LONG time. I went on a hot summer day. We were scorching out there as there was no real shade from the sun beside a tiny  tree on the sidewalk. Once inside, it does have a cozy feel and the pizza is fresh. 1 star for the cold beer after a hot wait, 1 star for the fresh mozzarella on the pizza, 1 star for the cozy atmosphere, 1 star for the location.   Minus 1 star for the long wait and I do mean LONG wait.", "author": "Bee P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-14", "description": "Here's the deal. From a local who has been coming for years. The pizza is pretty fantastic. The experience, so so. No slices and take out orders have to stand in line with people who are waiting to sit. They don't answer the phone. These guys could really improve the experience but they choose not to because life is easy for them. The tourists line up just about every day. Endless supply of first time customers. They could not care less about regulars or locals or really anybody. Stand in line is the response you get to every question. Years ago, one of my favorite things to do was to walk the Brooklyn Bridge and go to Grimaldi's for pizza. The trick was, call for a pick up once you were a little more than half way over the bridge. When you arrive, skip the huge line of tourists, walk in and pick up your pie. Now that they have moved down the block, they don't even answer their phone. If you do call and actually don't get a busy signal, the line rings until a machine picks up with no recording. You have a bunch of New York Italians in dirty t shirts standing around with attitude, while some Mexicans work hard and make pies. They must be rich from pizza yet the building they recently moved into looks like it could fall down. No love, No paint even. They don't even step out the door to reassure their customers who are all wondering how long this line can actually last. The answer. Longer than you think. I thought we had about a half hour. It was really over an hour. The product they make is very good, which is why they have big lines, but I am sure that I will never go there again. I don't like feeling like an idiot and that is how I feel standing in their line. They should be giving free drinks to people, smiling, chatting with customers. What you have a is a bunch of lucky family members who were born into a family business that is a gold mine. They have it easy. Rather than honoring their family and trying to improve the business, they just leach off of it. Sad. BUT, it is a pot of gold at the end of the rainbow (Brooklyn Bridge). Tip from a local... walk the bridge there, take a ferry back. I have to give them 4 stars (even though 3 stars is what I want to give them) because the pizza is great, but this place should be 5 stars. I hate seeing people that don't respect their own business or customers. I left feeling like a sucker. A little about the pizza. It is easily one of my favorites. The crust is perfect. Mostly crispy, a little doughy. The tomatoes must be San Marzano. Excellent. The cheese I am guessing is a local, fresh mozzarella. The topping are quite good and fresh. I like pepperoni and it is great! Thick cut yet small in diameter. If you get your to go, they put it in a brown paper bag on a piece of cardboard. Not great for traveling. We brought one back home in Manhattan and the grease was coming through the bag, making it tear. GET SOME BOXES! Again, I felt like a sucker. Wait in line for 1.5 hours to order a take out at the door. Then wait 20 minutes for the pie which they throw in a brown paper bag. I had to go back in for the sodas they forgot and to ask for napkins which they don't give you because they are too busy standing around while the Mexicans work hard.", "author": "Mark C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}