{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-01", "description": "Seriously over-rated, over-priced.  This place is a tourist trap, the pizza was unremarkable.  I've had grilled cheese sandwiches with tomatoes that impressed me more.  Save yourself the trip, the time waiting in line and the disappointment.", "author": "R T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-01-23", "description": "This is definitely for tourists only. The eat-in experience is absolutely terrible. You're pretty much sitting on the person next to you and I don't go out to restaurants to crouch over my food and hope my elbows don't knock off shit from the table next to me.\n\nAnd WOW, the authentic coal oven. So authentic that you taste the coal. Literally. The bottom of our pizza was quite black in most areas. Yum? We got the classic Margherita and it was good, but definitely not great. It's comparable to any restaurant pizza and I would take real Brooklyn pies over this any day. \n\nGot a great picture of the bridges while waiting a half-hour to get in though.", "author": "Samantha B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-26", "description": "The line was long but they were very efficient. The atmosphere is great... We enjoyed  watching them make pizza and really liked the sausage pizza we ordered. We split it and it was plenty of food. I recommend this place and walking distance from the Brooklyn bridge.", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-20", "description": "I absolutely love this pizza spot!!!! I would go here much more often with the exception of the NYC bus tours which drives by and dispenses all the tourist a block away - which causes a line of tourist which stream all the way down the block - terrible for us locals who want to be seated too!  Wish they would expand so i could go here more often :( Love the basil and sausage pizza....amazing!!! A++++++", "author": "Tamara V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-17", "description": "Beyond Unimpressed. First in line, waited nearly an hour while they \"cleaned up and fired up the coals\". Then waited nearly another hour for the pizza which was only good, not great. The waiter was offended when I asked for a time frame (this after 45 minutes) for when we might expect the pizza. He dropped it on the table and we never heard from him again. Seriously? Restaurant Abuse. I grew up in NYC so I am not thin skinned, but this is old and tired stuff. Poor service is not charming or interesting. I will NEVER go back. Meh.", "author": "Private P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-03", "description": "I must admit, the pizza was delicious! The service left something to be desired. Maybe we came on a bad day..", "author": "Marisela P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-02", "description": "Terrible wait, over 1 hour. Specifically asked for a well done pizza and received a raw undercooked pie, dirty silverware and waiter who kept pushing cannoli dessert. Since it moved locations pizza hasn't tasted the same. Not recommended anymore such a disappointment!", "author": "Michael C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-29", "description": "Is it considered rude to raise your hand to get a waiters attention?  I was yelled at and scolded by the old man host at this place!!  As we walk into Grimaldi's I desperately needed to use the restroom so I ran there before I sat at the table.  Upon my return I noticed that the waiter did not give me my water so I quietly raised my hand (no waiving involved) and waited for a waiter to come.  I sat there for a good 10 minutes and still there was no waiter, not even one that walked by.  \n\nThen all of a sudden the old geezer man host comes to my table shouting at me and calling me rude!!!  And I quote \"THATS RUDE!  PUT YOUR HAND DOWN!  THEY WILL COME TO YOU!\"  At first I thought he was joking so I kinda gave him a bit of a smile.....and then I noticed he wasn't kidding so i was dumbfounded.  I was playing the whole situation in my head and was trying to think of what I could have done to cause such a reaction, but there was nothing.  He seriously yelled at me for raising my hand, not waving, not sighing, not staring, just waving.  \n\nConsidering Lombardi's is 100 times better then this place they should be a little nicer to their customers and not flip their lids over something so trivial.  The food was forgettable at best and the service just made it that much worse.  I will never go back to this place and will discourage everyone I know to keep their distance as well.", "author": "Elica N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-13", "description": "This place is the real deal. After a 20-30 minute wait (Monday afternoon), we were at our little table squished in with a mixture of tourists and regulars. After eyeing the simple pizza next to us, the decision to get a regular plain small pizza for two ($12) was made. The place has a great atmosphere: an entire wall dedicated to Sinatra; jazz hits playing; and the typical red and white checked nylon table cloths. Everyone was very friendly, and because it was tight quarters, we chatted with the people next to us. The pizza was nice and toasty, with crushed tomatoes, fresh mozzarella, and basil. The crust was chewy and floppy, but with a good crunch at the edges; something I've been trying to acheive in my oven at home. Basically, if you're looking for what New York style pizza is supposed to be, this is it, and at a hard-to-beat price.", "author": "Colleen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-09", "description": "Long lines, very good brick oven pizza, decent prices, cash only. The crust is a bit too soft sometimes, it should be crunchier, but that's a personal preference. It's a very busy place so sometimes they have to rush the pizza. You can ask them to leave it the oven longer, but they will still do what they want. Topping ingredients are mostly ok, mozzarella is always very good. It's excellent pizza but let's not get caught up in the hyperbole, there are other similar places around town  that are easier to get to (and get in to). But, going across the street for ice cream afterwards, and a walk in the park, and those views, when viewed as a package, simply cannot be beat.", "author": "Craig G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-26", "description": "worst pizza i've had in my life. we first ordered a white pizza, it was awful. the mozzarella looks and tastes like the caulking around my bathroom sink! chewy, tasteless, like plastic. we thought maybe white pizza isn't their specialty, that the regular ones might be to die for, coz, after all, grimaldi's got itself famous with pizza. so we ordered another, regular, pizza. turned out it's the same thing -- caulking, with tomato sauce this time.\none word for grimaldi's: yuck!", "author": "vicky t."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-16", "description": "My husband and I were on a mission to find this place! It took all day but in the end it was totally worth it! We shared a large half margherita half sausage and pepperoni pizza and a half bottle of chianti. Not the best wine I've had but it completed our Grimaldi's pizza experience.", "author": "Candice H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-07", "description": "This review is for the pizza.  It was good not great.  Crust was burnt like crazy not worth waiting for.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-22", "description": "Great pizza, but only worth it if you get a carry out. The line is bananas, and the service sucks.", "author": "Rachel O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-05", "description": "Skip it! If you want to be pushed back at the door because you came too far into the restaurant (that's the extent of the greeting ;( ) Then after waiting, you get told to go upstairs...Hot as hell up there, no one to \"greet you\" and then told to sit in the middle of the table that was so close to the other diners that you'd think you were breaking up a party...asking for a better table is answered by scowls both upstairs and down..Go to the REAL original grimaldis a few doors down and get a friendly, comfortable, and air conditioned restaurant with great atmosphere and great pizza! I'm from NY and I know when a name in a guidebook outlasts quality.", "author": "JIM B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "best pizza, second floor had weird non - ambiance.", "author": "Sargent B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-31", "description": "One hour wait, the pizza is great but a bit pricey, we paid $160 for 4 adults, two kids.", "author": "Tasha K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-03", "description": "This place definitely lived up to the hype. Waited 20 minutes outside to get in on a rainy day around noon. I had a small anchovie pizza. It was the best!  Well worth it.", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-10", "description": "Huge line, cash only, no slices??? The hell kind of business is this?", "author": "Jeff G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-17", "description": "Delicious but no reason to wait online for this stuff. There's plenty of comparable or better places that don't have lines and you'll be just as happy.", "author": "Adam S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}