{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-11", "description": "Still the best, as always. Perfect as a dinner spot after a walk across the Brooklyn Bridge, hungry stomachs abound! We had the half and half - half pepperoni and half mushroom. Yum!\n\nThe pizza slices are true New York style, large, cheesy, with loads of ingredients and fairly thin crust. The place smells so heavenly, I swear it makes one ever hungrier as you are waiting for your awesome, delicious food! The menu is good, the service is fast and I would have given it five stars if not for the 1 hour wait to get in at 6pm! I thought we were early enough but I guess there will always be a line at Grimaldi's at all times of the day. \n\nBring cash and an umbrella - it drizzled while we were waiting so that was not fun at all! Well worth the visit though, I would come back here again when I visit Manhattan, just to get another slice of that yummy pizza!", "author": "Josh R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-19", "description": "This is without question an absolutely delicious pizza. Located right near the Brooklyn Bridge, Grimaldi's has been and continues to be one of the names that's become synonymous with elite New York style pizza. Yes, there will be a line around the corner if you arrive during peak hours. That is certainly a negative. However, the consistency of execution at this restaurant is to be admired. Grimaldi's coal brick oven gives the pizza the perfect texture--light, perfectly crispy, with a rich flavor. The ingredients are fresh and flavorful. The tomato sauce is perfectly zesty and present in the right quantity. The mozzarella is excellent and perfectly melted on top of the pizza. The sausage and pepperonis have that authentic Italian flavor. Honestly have nothing negative to say about this slice. It's excellent. And if I'm going to put my two cents in, I feel that Grimaldi's (based on my personal experience) is a tastier slice than its rival, Lombardi's. That being said, is this pizza so good that you need to drive all the way to Brooklyn to get it? My answer is probably not. New York, in particular, has plenty of delicious hole-in-the-wall pizza places that are comparable (maybe slightly less tasty) that you can access much easier without waiting on lines. That being said, I can certainly vouch for why this has become such an iconic NY restaurant. And if you eat here, you can say \"I ate here.\" At this point, it's like visiting the Empire State Building. Okay, maybe not quite. But close.", "author": "Justin V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-25", "description": "Grimaldi's = BEST NY PIZZA\n\nThe ingredients are SO fresh. I love watching them make it and sail right on over to my table. My mom and I put away an entire pie while we were there, and normally I only eat one or two slices. It's so light and hot and fresh - I can just keep eating more, which is dangerous. They have good bottled soda and great ambiance if you go right when they open and don't have to wait :)", "author": "Louise P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-09", "description": "A friend brought me to this place several years ago. Didn't realize how touristy it was until I got there with him. It was a 30 minute wait -and everyone in line was from out of town. I'm always apprehensive of touristy spots...\n\nPeople sat very close next to each other, shoulder to shoulder at the community style tables. Since no one knew each other, and everyone was a tourist -it turned out to be fairly awkward. \n\nIn fact -one tourist just stared at me wide-eyed throughout the entire meal. I think she had never seen a real live Asian person before from where she's from! In retrospect, it's hilarious, but at the time, it made me completely uncomfortable and annoyed.\n\nThe pizza itself was just okay. I've had better oven baked thin pizza in Japan. With just okay pizza and too many tourists, I probably wouldn't stop by here again.", "author": "Siobhan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-11", "description": "Can't possibly say enough great things about this truly authentic Brooklyn pizza shop in DUMBO. It's just perfect. Definitely going each time I visit NYC and hope to introduce many friends to it as well. \nThe manager also stood outside to have a conversation with us and was totally humble about the place. I thought that was a plus considering a lot of these big restaurants become hoity toity after making it big and being featured on this FoodNetwork show or that. Not Grimaldi's-- :)\nBeware though, tons of food and they only take cash. \nGrimaldi's, can you please open up a shop in the West Coast?", "author": "Kinjal N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-24", "description": "I walked about 1 hour from Manhattan across the Brooklyn Bridge just to check this place out. It was worth it since I never walked across the Brooklyn Bridge.\n\nI came at a good time because the line outside wasn't long. While I was eating in the restaurant, the sun also started to shine after a rainy morning.\n\nI would recommend getting half-half (tomato sauce and non-tomato sauce). Any of the toppings are good. The pie we got took about 10 minutes to come out. The cheese is the best thing about the pizza.\n\nI didn't like how there was 1 bathroom and it was near the hot oven.\nI do like how this place is near a dock where some good pictures can be taken.\n\nThis is a definite visit in New York.", "author": "Marlon T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-07", "description": "Don't know what people see on this place. Always a waiting line during peak hours,  awful and rude service.  Pizza is barely OK,  little cheese,  little sauce.  \n\nOh,  I had to stand up and refill my water.  Service is not even A 5% deserved.  Would never come back again \n\nBtw,  they do not accept other payment than cash", "author": "Daniel H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "The best pizza ever!!!!  I have been to many brick oven pizzerias and this is by far the best.  It has been consistently yummy for 20 plus years.  Also, don't let the line discourage you.  It generally moves very quickly.", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-21", "description": "Honestly - I've tasted MUCH BETTER pizza in Brooklyn alone! \n\n* The waiters was zombie like - paid no attention to our orders \u0026 got it WRONG\n* NOT much variety in topping options - what place doesn't have chicken as an option! and the 3 veggies options were under cooked. \n* The bread was BRUNT\n* And the worst - Grimaldi's has a few locations and I know for a fact they make enough money to have a CC machine - come on really your ATM fee is $4!! thank you ripping us off. \n\nSo whats the hype about ... maybe it was really good a few decades ago - KEEP UP WITH THE TIMES", "author": "Meherangiz B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-02", "description": "Shitiest  place I've been too, saw there reviews and all said they have gluten free pizza, I waited out side I the freezing cold 20 minutes got sat next to two strangers in the crowded resturant, on top of it all I was sick, the waitetr was rude and kurt, and when I ordered the guy told me they did it have gluten free pizza, now I am hungry, sick, tired, squished between people, waiting for my friend to finish their food, drinking a glass of water because that's all these peo People are good for.", "author": "Zorana J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-13", "description": "Yes, delicious\nYes, long wait\nYes, worth a try\n \nNo, if you have been before, is it worth going out of your way or waiting in the cold until your fingers are numb and fall off? \n \nIf you are in the area, the pizza was definitely satisfying with a Peroni beer. The pizza was very good, but I'm not sure how it compares to other pizza places. Not sure how it lives up to the hype, but it was good--just didn't live up to what I had imagined it to be while waiting in the freezing cold.\n \nThis place gets packed so be prepared to sit in tight quarters", "author": "Julie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-10", "description": "Worth the journey and the queue? Yep I would say so, although obviously still not a patch on a pizza in Rome. \nGrimaldi's is a tiny Pizza restaurant but the queue was stretched down the street lucky for us we jumped the queue as there were a number of big groups ahead of us and we were happy to be seated and eating. The service was less Disney than you get in Manhattan which suited us much more and some fun music made for a fun lunch. We didn't go large but were regretting it since the pizza was great.", "author": "hanzibar"}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-21", "description": "Good pizza....But not amazing and not particularly memorable. And possibly not worth waiting in the long line just to try it. Especially when they have other locations. Although that is a nice area to hang out. I'd say it's a good place to come with a group, have good pizza/drinks, walk around and enjoy the view.", "author": "Maria E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-11", "description": "Went on a Saturday afternoon (3pm) and waited for a little over an hour to get in. \n\nWe split a large pizza among the four of us and the antipasto. DO NOT buy the antipasto. Get another pizza. It will feed you better and the antipasto was basically a prettily plated assortment of pizza toppings. meh. The pizza was tasty though.", "author": "Lydia N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-04", "description": "White pizza!!!\n\nLove Grimaldi's. Perfected thin crust pizza topped with amazingly fresh and tender toppings. The white pizza with the hints of basil and ooey goodness of fresh cheese is mind blowing.\n\nI'm a California native,so I guess it's unfair for me to determine this as the ultimate ny pizza... But I'm always stopping by when in town.\n\nBtw... The Vegas replicas have nothin on he original. Keep it up.", "author": "Andrew N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-26", "description": "More fad than quality. Pizza is good, but one can taste the \"fuck the purchasers\" in it. It is something that comes along with the legend....", "author": "John D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-26", "description": "Front service women got a lot of attitude . They should know that they have competition from the next door ( the original place where they still have the original oven)", "author": "Dasun S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-01", "description": "Ah Grimaldi's. Brings back date nights and delicious pizza to mind. I've been here 2 or 3 times, and I gotta say each time gets better. The jalepeños are VERY spicy, so beware, it had our noses running. And water or red wine did not soothe it! The most recent time we had garlic, chicken, peppers, and I think onions. The pizza is absolutely delicious, has that brick oven feel, but also a home cooked feel. The service however was not the best this time, as it took them 20 minutes just to give us water. Not exactly that picky, but I can't help think they were a bit ignorant. Nonetheless, the pizza was worth it.", "author": "Ria K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-27", "description": "So after eating at Juliana's and Grimaldis on consecutive days the verdict is in. The pizza is just about identical in both restaurants. I ordered a pepperoni pizza from each place and they were pretty much the same thing. They were both very good. They are both not as delicious as Difaras pizza. I would recommend both places but I wouldnt wait in line for an hour at Grimaldis. That's for tourists. It's not the greatest thing ever. Don't get me wrong it's very good. I would go to either place if I was in the area. Grimaldis gets swarmed by tourists. Juliana's doesn't as much. I think the pizzas are both delicious. They aren't the best but very good. The guy next to me from London (obviously) and I both finished a small pie.  Mine had pepperoni. I was very stuffed. I swear in Grimaldis I was like one of the five or six people from America in the place. Nothing wrong with that but just makes you feel like your at Disney world or something. It's a major tourist attraction. Great places for pizza in Ny!", "author": "Anthony P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-23", "description": "Known as one of the first pizza place in nyc, I just had to try this place.  I don't think i can ever forget my first impression of this place.  The waiter that greeted us at the door was this big guy who talked like he was in a Russian mafia. The Music in the restaurant made me feel  like I'm in a euro rave/techno scene. \n\nWe ordered a small pizza but it was plenty for two. The pizza was decent and I liked how the crust tasted.  \n\nI would recommend this place for the interesting atmosphere and decent pizza.", "author": "Ken L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}