{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-01", "description": "I just don't understand all the hype.\n\nWaited in line for about 30 minutes thinking, \"It'll be worth it, otherwise no one will be in this line for this long.\"  Boy was I wrong!  Pizza came out fast and steaming hot but really, it wasn't anything special.  I've had better.  The lady next to me was trying for a first time and said the same thing.  I don't get why this place is so popular.", "author": "Amy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-21", "description": "Great pizza but don't forget to bring cash, cash only!! I also loved that they were the only place by the Brooklyn Bridge that was open late.", "author": "Anda P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-04", "description": "Great place for pizza! Price is reasonable and you can choose the toppings as many as you want. Staffs were kind. You better go earlier to avoid waiting line.", "author": "Sang-Won K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-06", "description": "Went here after a business meeting, so it was early enough where we didn't have to wait in the long lines that can form outside this place. \n\nI now see what all the fuss it about. It's damn good pizza. For 2 people,  you should order the small (6 slices total). I recommend the pepperoni and sausage. The dough is excellent and it's really cooked to perfection. Pure Pizza Pleasure!\n\nI do wonder what this building used to be. Very high ceilings! Something to Google!", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-06", "description": "$20 for a small with half pepperoni and half mushrooms. Baked nicely and has just the right amount of sauce. We picked it up and as we did, they gave us a free small pizza that someone forgot to pick up. Awesome!", "author": "Tes Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-13", "description": "They moved to the corner, last I came was Dec 2010 and they were still at their original location further down the block. The new place is much bigger, two levels, so definitely more seating. Looked like there may be a 3rd level too.....not sure. \n\nSome of us decided to stay local over this Memorial day weekend. Walked over the Brooklyn bridge and went to grab lunch at Grimaldi's. We waited in line for about an hour and 30 minutes. It was a hot day but the frozen yogurt truck had (very strategically) parked in front of the place! Well ....if you're going to be out in the sun/heat for a while, grab a frozen yogurt to keep you cool. Pretty soon many followed suit \u0026 grabbed some fro yo to stay cool. \n\nWhen we finally got seated, ordered our cold cold drinks and by this time naturally we were famished! So ordered two large pies margarita \u0026 pepperoni. Food came out fairly quick \u0026 needless to say.....we inhaled it!\n\nI still think that this is the BEST NY style pizza ever \u0026 despite the fact that it is also a very touristy spot, many locals come here. Every once in a while I venture out to Brooklyn \u0026 get my fix Grimladi's.", "author": "Maly A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-29", "description": "GO NEXT DOOR TO JULIANA'S. \n\nMy boyfriend and I went to Grimaldi's on a Wednesday afternoon and were greeted by the rudest staff I've ever encountered. After we were sat upstairs in a half empty dining room, we waited ten minutes for someone to greet us. Service staff all over the dining room were clearing tables and no one checked in with us. My boyfriend and I are both in the service industry and we know that this would be completely unacceptable in any other restaurant that actually cared for its guests.\n\nWe decided to leave and go to the smaller place next door that offered the same product. After being greeted by our warm and generous server, lisa marie, and then eating what was probably the best thin crust pizza we told Lisa about our terrible experience at grimaldis. She informed us that the owners of Juliana's are actually the original grimaldis and that they sold they're restaurant name in '98. \n\nPoint of this story is, Juliana's is actually the ORIGINAL grimaldis pizza and they will treated you ten thousand times better than the assholes next door.", "author": "Jessie G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-29", "description": "2nd time I've been . Made to wait outside in the cold, lightly raining . When we eventually got inside (15 minute wait) there were multiple free tables . They just want to make it appear desirable by having people queueing outside .\n\nService was unfriendly throughout the whole experience . Pizza was soggy in the middle second time round .", "author": "Richard S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-08", "description": "I have been going here for years. Definitely must come here at least once to try. Unfortunately, my opinion has changed throughout the years. They use generic ingredients. So many places in NYC can be found that uses better ingredients, and just as nice. Last time I went, my meal was rushed, and they huffed when I was still looking at the menu. I know they are busy but they treat their customers like animals.", "author": "Alexia G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-06", "description": "The one star is for the service and not the pizza. We ordered a large pie with meatball and sausage. The pizza is one of the best I've had, just didn't have time to enjoy it because the jerk off waiter just didn't give a shit about service. How many times can you ignore the customers? He even acknowledged that he was ignoring us. All he cared about was taking pictures with customers like he was a star, breaking news for you bro. We came for the pizza and not you. Damn shame this guy ruined our dinner.", "author": "Tu H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-21", "description": "This place prolly doesn't need another review but I just love this place so much!\nWe waited on line for about 30 mins but that's b/c the hoster will call to the line for smaller parties so if your party is smaller than 4, you might get a spot faster, but you have to listen for it. \nThis place really does have great tasting pizza, but I'm just not sure of the price. My friend and I got the small regular pizza w/ pepperoni and sweet red peppers topping and we DEVOURED it. \nhttp://www.yelp.com/biz_photos/2ggi1luerd3Mf_C82JvCYg?select=-GM7s0D80R_M1z9rTLwrCA\n\nBut next time, we'll ask for more tomato sauce cuz there was hardly any.\n\nWe got seated at the end of a long commune table which we thought at first would be bad but turned out to be very convenient so that we weren't sandwiched between two strangers. They were mostly male waiters when we were there and some of them put on this tough guy face. For example, we asked for more water, and this guy didn't respond verbally for acknowledgement, but he did come back w/ our waters, but it did leave us hanging for a bit on whether he pretended to not hear us and wondering if we should ask another waiter. but thankfully we didn't have to. \n\nThere is one unisex bathroom and while waiting on line, you can chat w/ the guy who handles the brick oven pizza. That guy only let me take one pic of the oven, but didn't say a word to my friend when she took several, but my friend is italian and gorgeous so maybe that's why? lols\n\nWe paid our check and headed out for dessert at The Brooklyn Ice Cream Factory located a few blocks down.", "author": "Ophelia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-11", "description": "Yelpers got it right again.   Truly one of the best pizzerias in NYC.  I have been here three times with my family and waited from five minutes (in the rain) to more than an hour.   And each time, it was worth the wait.    My six year old son, who usually tops out at one and a half slices had four slicesby himself!      Located right under the brooklyn Bridge in almost a post card perfect setting, this iconic restaurant lives up to the hype.  \n\n       We had the classic pie with homemade mozzalla, the second with pepperoni and  the third with peppers.     The classic pie stands out because all the quality ingredients on the thin crust lightly burnt from  the brick oven can be individually tasted in your palet.   The pepperoni pizza, though very good, overpowers the rest of the flavors and is a bit imbalanced.  The pie with the peppers was full flavored and just right.    \n\n      I'm a bit torn because I'm a big fan of Totonnos and I must say that Grimaldi's gives it a good run for the money.   ( Only if the damn lines weren't so long!)", "author": "Hank K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-06", "description": "I don't want to hear another word about Grimaldi's being \"overrated\". This was far and  away the best pizza I've ever had. So good I've had to go back and edit my other pizza reviews accordingly. \n\nSure. I have been eating crap all along, but it still doesn't detract on how great my pizza was. Maybe it's because they gave me the garlic I've been looking for all my life. Punch you in the mouth garlic... I'm going to be smelling you for days garlic... Don't worry, though. There's gum for that.\n\nThe four of us ordered a half and half. Garlic, sausage, ricotta and plain. If we had ordered all plain, I may not be writing such a rave review. It was pretty good... just not great.  But if you love garlic... Whoa. Just whoa. \n\nIt's not a tourist trap by any means. 30 bucks to feed 4 people is a pretty sweet deal. Okay. There's a line to get in, but it moves fast and it wasn't too long despite it being such a beautiful spring day. And try to get seated upstairs. It's not nearly as cramped as it looks downstairs.\n\nThe Cash only, no slice policy isn't a big deal either. There's an ATM, and just buy a whole pie you cheap bastard. It's worth it.", "author": "Karen S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-09", "description": "I don't enjoy thin pizza. The crust is usually burnt.", "author": "Correy K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-09", "description": "This place is so overrated. Waited 30mins or so, the individual I was with, ordered a 2 topping pizza.\nIt was probably the worst pizza I've ever had. The crust was so thin, the little amount of sauce that was over the pizza made it  so soggy, it was difficult to pick up. I took a bite and that's all I could manage and I love pizza! Who doesn't. \nIt's been over 6 years and I still won't return. Don't believe all the hype!", "author": "Marina C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-12", "description": "CLASSIC TOURIST TRAP!\n\nI'm among the minority who just doesn't get the appeal of this place.  The pizza is mediocre.  I've had much better in NY and elsewhere.  The flavor is fair and the crust is nice and crisp at the edge but rather bread-like underneath the sauce.  I'd give the place 3 stars for the pizza... but having to wait 45 min for mediocre food and then get crammed into a sardine can knocks it down to 2 stars.  Also, one bathroom for the entire restaurant is a problem especially with young children... when you have to wait in a long line.  GIVE ME A BREAK!", "author": "Lee K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-14", "description": "Yum yum yum! this is definitely worth the wait. We came on a weekday afternoon and waited about half an hour. The large pizza is ginormous! You can choose between the white or red sauce, or you can half it, which I recommend. The red sauce is more flavorful, but the white sauce has these bits of garlic that is makes it taste so so delicious! What makes the pizza kinda of expensive is the toppings. Each topping you add is comes with a price. \n\nIf I ever visit New York again, I would definitely come here for another tasty visit.", "author": "Julie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-27", "description": "BF has been asking about going to Grimaldi's ever since we started dating 4 months ago. I've only been to the Garden City location, so I was up for the trip to Brooklyn. We managed to get there at 11:45am (Grimaldi's opens their doors at 12pm on the dot!) and were probably the 5th couple on line. I read that they recently moved to a new location just a few stores down, and their new space is much bigger than its last. I recommend getting there at noon to be seated promptly without much of a wait. \n\nBF and I ordered two small pizzas (yes I know... but we packed half of each to go!). We got one white and one regular with pepperoni, onions, mushrooms, and extra basil. Both pizzas were delicious. The white came out first and smelled divine! I love the smell of garlic and basil. Everything is so good when it's fresh out of the oven! \n\nService was friendly and prompt, and the pizza is great (and I'm not really a big fan of pizza, lol). Yes, it's considered a tourist trap, but hey, everyone should play tourist every now and then and discover your own city! \n\nAfter lunch we headed down to the pier to take some photos with the Brooklyn Bridge. We didn't get any ice cream at the Brooklyn Ice Cream Factory since it was pretty cold and windy out, but next time!", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-11", "description": "In response to Mike M.'s review, this place is NOT a tourist trap!\n\nFACT:  According to big hitters like Food Network and Zagat, this pizzeria has always been ranked in the top 5, if not the Best in the Nation.  The line that stretches all the way out to Old Fulton St. confirms it.  \n\nThe only thing that remotely warrants a deduction in stars is probably the \"CASH ONLY\" policy, or the ridiculously long wait.  Other than that, the pies here are SoooOOooo Good!\n\nFirst off, how can you knock a pizza that's cooked in a Coal Brick Oven?  C.B.O.s produces a nicely crisp and charred pizza that gas and wood ovens can't even compare.  Grimaldi's ratches it up a notch by setting the oven at a whopping 900 degrees, resulting in a crunchier crust.\n\nSecondly, they use fresh San Marzano tomatoes.  The best sauce tomatoes on earth.  Giving you a more potent, sweeter taste than your regular roma tomato.\n\nLastly, The mozzarrella is made fresh daily.  It's produced specifically for their oven.  As a result, you get perfectly melted cheese on your pie!!!\n\nAnd if that still doesn't convince you, I can go on and on about their dough and fresh toppings.\n\nOn my last visit, I made a rookie mistake.  I ordered too many toppings, which made the crust a little chewier and a tad soggier than usual.  The moisture from the toppings just seeps into your crust.  Add in the condensation on the bottom and you got a recipe for a soggy crust.  Grimaldi's motto \"less is always more\"!  Sucks because I knew better!  This was not my first visit.  The problem was, I wanted every topping!  Definitely not the way to go.\n\nThe pizzas here are ordered by the entire pie only.  Small (6 slices) and large (8 slices).  Sorry, you can't order by the slice.  I ordered a large pizza w/ pepperoni, sausage, sundried tomatoes and mushrooms.  It's the balance of the bagel-like crust: crispy, yet chewy, the sweet tomatoes, the stringy cheese, and the savory toppings that made my eyes roll back into my head.  Again, it was my fault that my second and third piece got a bit soggy..  If you can see my photo, my pizza was piled on with toppings.  I've ordered a Margherita before, and that sucker was like Naples in my mouth!  OMFG, no dish on earth is better than the perfect margherita!!!  Period.\n\nGrimaldi's is an institution.  You have to visit here at least once in your lifetime.  Don't make the mistake of ordering more than two or three toppings.  I know I know, it's hard to resist.  Especially after standing over an hour in line, you want to to get your money's worth and pile everything on.  Believe me, resist the urge and don't make that mistake.  Any more toppings, and you'll find it lack luster.  I always say, the best thing about the pizza is the crust.  Lose that crunchiness, and the best thing you can get is mediocrity.", "author": "Jimmy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-26", "description": "Food was very good.  Waited for 15 or 20 minutes and got a small table for two.  Jimmy was at the door and service was exactly what I would expect.  Wasn't even $30 for two!!!", "author": "David M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}