{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-03", "description": "Try and remember the best pizza you've ever had... now if it wasn't Grimaldi's, then FOHGET ABOUT IT because you don't know pizza until you know Grimaldi's. \n\nI went to New York for a little va-cay this past January, right in the middle of winter snowpocalypses, where we stayed with some good friends who showed us around the city and suggested Grimaldi's as a must-eat. So in the freezing cold, we trekked from train to snow to slush to nearly getting run over for a view of the Brooklyn bridge and a huge line of frozen, salivating popsicles with the same pizza stricken agenda. This is definitely a tourist spot for visitors, but also a local favorite to New York natives, so expect a long line in apparently any weather condition.\n\nOnce your party is nearing the front of the line, they'll jot you down by how many is in your party so be sure you're all there during headcount 'cause they don't like it when maybe you say 4 yet you've only got 2 in line. When they take your party down, they call availability based on seat openings in a table, so when the next available party of 4 is announced, if that's you, [since apparently that was us] you have to frantically jump up for joy and skip on in or merely speak up and say \"that's us.\" Don't sn00ze or you WILL lose.\n\nAs soon as you're seated, everything is quick, menus / order / drinks and then as if a light from the heavens shines brightly on your table... bam, your perfect pizza pie is hot, fresh, in your face and ready to be seriously devoured. One bite, and your taste buds are singing like Andrea Bocelli.\n\nWe ordered a small, classic cheese pepperoni w/ basil for about 20$. Yes, it's not cheap, but yes, it was well worth it and it was pretty big. The pepperoni was sooo good, oh man--cute round little thick cuts, chewy with just enough crunch... and the cheese, the cheeeeeeese with fresh pieces of mozzarella nicely melted all over! Brick-oven style pizza at its absolute finest.\n\nAs soon as I overcame the mouthgasm and the food porn was over, I sat back and took a look at the surroundings--a classic New York Italian setting ballparking circa mid 1940s--lined up red and white tables, picture frames up on the walls and the songs of Sinatra, Nat King Cole and the like singing in your ears; I fell in even more love with the place.\n\nThe entire experience was fun, tasty and very pleasant. I'd like to go back to New York, if not move there completely, and Grimaldi's has definitely made a transcontinental patron out of me.", "author": "Danna A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-09", "description": "We arrived here 10 minutes before the restaurant opened and there was already a sizeable line. There was a bicycle race going on that day so hundreds of cyclists were zooming past us as we queued, yelling out things like, 'Wow, will you look at that line!' and 'It IS worth the wait, people!' and 'Trust me, people; it is NOT worth the wait!' About 30 minutes later we found out that it was worth the wait: the pizza was delicious and definitely the best we had in NYC. Good value too. We ordered a 'small' to share and it was freaking enormous.", "author": "Gertrude X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "Ahhhhhh I love this pizzaaaaa. And I also like sitting up-top and watching from above how them make their pizzas. Pretty cool. The only thing that sucks is that they don't serve alcohol....", "author": "Stephan N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-07", "description": "Really don't understand what the fuss is about. The wait is definitely not worth the runny pizza that we had to eat between a dozen other strangers. If you're looking for a chain pizzeria, you might as well order from Papa John's and save yourself the 2 hours of standing in line.", "author": "Deeana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-21", "description": "This is the most important part of the review:  The sauce was so freaking good.  Sauce is so important.\n\nThis place is so freaking good.  The line was about 20 minutes long (then again, we got there at around 3pm).  I wanted to eat here every single day and I was only in NY for 2.5 days.  It's something to do with the sauce.  It's such a delicious explosion in your mouth!  It's not just tourists that come here...it seems like locals and everyone who's heard of this place wanted some.  The service was quick and easy.  The place is pretty much a classy hole in the wall.  YUM YUM YUM.  I still think about it!!", "author": "Kristin O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-06", "description": "Much better than their other locations! Truly delicious thin crust pizza. We got the margarita, and all of the components complemented each other very well. We especially enjoyed the crust. Be prepared for a long wait.", "author": "Shelby T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-08", "description": "The sauce is where it's at. I enjoyed the crust and the place smelled like you'd expect a coal oven pizza place should...amazing! Good atmosphere too. I recommend it, but be prepared to wait a while in line.", "author": "John P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-15", "description": "Grimaldi's does have pretty god pizza. It is also a little over-rated. The choices of pizza are pretty standard: pepperoni, sausage, pepperoni and sausage.\n\nFortunately, though there is a ridiculous wait, my bud and I got lucky and we practically walked in as the line formed behind us down the street. \n\nUnfortunately, we got a table stuck in the corner that the servers barely seemed to notice.\n\nI'm not going to tell you that I have had better pizza that often, but baking home-made pizza would be pretty close to Grimaldi's except for the classic brick-oven.\n\nWould I wait in line at Grimaldi's a second time for the pizza? Probably not. Would I suggest going to anyone who likes pizza? Yes. Was I one of the tourists frustrating the New York locals who might not have gotten their pizza at the snap of their fingers? Yes.", "author": "Chris S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-20", "description": "Tasty pizza but not the best in NYC as some claim. It does match real Italian pizza but for me, this wasn't worth waiting on the line.", "author": "Yuka Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-27", "description": "As for great pizza is concerned, this place has one of the best. Highly recommended by a buddy, we hit this joint up before we took a leisurely stroll across Brooklyn Bridge. The line was no joke just like any good place in NY, but it was worth it. If you are a fan of thin crust pizza, you have to check it out. Cash Only.", "author": "Mac S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-30", "description": "4 stars for the pizza.\n1 star for the asshole owner and his piss poor line management skills.\n\nWe were prepared to wait in line, but when we experienced the lack of line management we grew tired, and then just pissed off.  As patrons exited the owner insisted on filling open tables with groups of 4.  Fine by me, I get it, tables of 4 = more money.  But when he started yelling at groups of 4 in line that consisted of 2 pairs of couples that want to join in on a table together to be seated according to where they were in line, he just didn't make any sense.  Quite the contrary, he showed what an illogical dick he can be. \n\nOh, and you want to know the big secret to this place?  Salt.  The dough is loaded with it.  The cheese and other ingredients are good too, but really it is the simplicity of seasoning that brings people here in droves.  \n\nNext time in town, I'm going to give Lombardi's a spin.", "author": "Darin E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "The pizza was great. We went around 1pm and there was a line, so plan a little waiting time. It's also cash only, but they do have an ATM inside.", "author": "Anna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-10", "description": "This is the best pizza Ive ever had IN MY LIFE. The only reason I gave them four stars was because of the wait. The wait was about 2 hours standing in line. Then when you get to the front of the line there is another 30 minutes wait. Apparently if you are a party of three and there is no table of three open they search through the line to fill for tables of four, or two..etc...Just hope your that magic number for what they need..", "author": "Becca T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-01", "description": "The pizza is delicious but the wait in line is obnoxious! I brought some out of town visitors here this past weekend. There was a roped off section for the line in front of the restaurant like we were waiting to go inside a nightclub! We waited about 20-25 minutes to get seated inside. The wait may have been caused by a large tour bus of people dining earlier. \n\nWe ordered (1) large 18\" pizza ($14) with 1/2 pepperoni ($2). Unfortunately, they charge you $2 regardless if you order 1/2 toppings or whole pizza toppings! The pizza is awesome because of the fresh ingredients. The crust is thin, crispy and airy. The sauce is just right.  I like the plain pizza with the fresh mozzarella and basil. I also had a glass of the house white wine ($4). I wish Grimaldi's would get with the times and start taking credit cards (I'll add a star once they do)!", "author": "Mika Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-31", "description": "Good pizza but nothing special anymore. Once a nice restaurant with world famous pizza, I was shocked by the direction Grimaldi's has gone. The second floor had blasting 90's music like an arcade. We couldn't hear our friends sitting across the table. The waiters were inattentive and when our pizza came, it was rudely plopped down on the table. To top that off, it was burnt. The quality of the pizza seems to have gone down but is still made with quality ingredients.", "author": "Nick G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-17", "description": "sad to say but since they moved they've changed!", "author": "Jonathan T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-29", "description": "You can probably see the line at Grimaldi's from outer space. I kind of feel like this place is a combination of hype and decent pizza. Its not a place that I'm willing to wait an hour for again.. thats for sure! Its not that the pizza isn't that great.. its just not an orgasm in my mouth experience that I was expecting after biking over to Brooklyn and battling the long line. You could say its like going to Venice and at least feeding the pigeons once for that ever cliched \"covered with pigeons in Venice\" picture although everyone hates those damn rats with wings!\n\nThe pizza itself was decent.. good flavors and toppings although the crust wasn't crispy all the way through - which is one of my main ways of judging pizza. Also, the bathroom line is just as long as the line outside.. its almost a crime to have only one bathroom in such a busy place! Plus the bathroom was alarmingly close to the pizza dough which are resting in cases on top of each other.. I guess all that bacteria dies in the final heat of the brick oven?", "author": "Henry W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-19", "description": "Alright, so I get it- a lot of places in NY are cash only. I accept that... but a broken ATM and no help in terms of pointing me in the right direction for a bank/ ATM!? Ridiculous. \n\nIt was crowded and the staff was hardly friendly. Maybe it's a CA vs NY thing... are we just happier people? Does NY need to borrow some sun? Either way, the pizza crust was thin and it was pretty good, but the toppings were skimpy (he ordered ham, and we might've found 5 little chunks on the entire pizza)... my suggestion is order pepperoni so you can actually SEE your toppings... and taste them too. The other toppings we asked for were onions (they were there), mushrooms (hardly there) and olives (way too much). Oh and the dough on the center of the pizza was undercooked, raw, chewy, yucky, but overall I guess I can see why people like this place? I guess...", "author": "Sau y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-10", "description": "Everyone said if you want good pizza in New York go to Grimaldi's so we did.  I heard there is always long lines so after getting a tip from a friend to go weekday afternoons at about 3 or 4, we did, and sure enough, there was a small line but we were seated in about 15 min.  The place is small and you sit really close to people but it is worth it all, I think it was the best pizza I had in my life.  There are no slices and cash only.", "author": "Emmalee G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-30", "description": "Grimaldi's is definitely in the running for top NYC pizza. Went here over the weekend for lunch. Stood outside in line (it's a cute block!) for an hour, was surprised to then be seated and have to wait another 30 minutes before they took our order. And once we gave an order, it was yet another hour before we were served our plain cheese pizza! So be prepared for a long wait, I recommend eating before you go so you're not overly hungry by the time the food arrives. Or order for take-out. \n\nIt's good - the crust is chewy and delicious, and the pizza is flavorful and easy going down. My significant other and I ordered a large pizza for the two of us, and we ate nearly all of it. I would put it right in line with Lombardi's - they taste very similar - but a step down from Luzzo's which I still think is the best in NYC. Try them all and let me know what you think!", "author": "Wendy L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}