{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-21", "description": "So so so good! Classic NY pizza.  Its a great place to take the family.  Reasonable prices and amazing pizza!", "author": "Sara R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-03", "description": "I would probably rate 4.5 stars if I could. We went there on a Monday and got there about 1pm. At that time the line was only 10 people and we waited about 5-10 min. The pizza itself was excellent. We ordered pepperoni and sausage, and it came out pretty fast. You could taste the subtle difference in the crust from the coal oven and their mozzarella cheese was excellent. Pizza was not greasy at all. Relatively speaking we ate at Lombardis 2 days before and although we thought that was good too, me and my friend both thought Grimaldis was better, not to mention for the same pizza Grimaldis is about half the price. Probably the only better pizza I've eaten is in Italy, however with that being said I do want to say that this is still just pizza. I did think it was excellent but its not a huge out of this world experience that you'd miss out on, its just pizza and the difference from ny style pizza where I live isn't extremely different. In other words for me I don't think it would be worth waiting 2 hours to get in there, if that was the case after eating there and reading the other reviews i would eat at the other Grimaldis in the Flatiron area if you can only go to the original at a peak time where the line might be really long. We did walk across the Brooklyn bridge there and back, definitely do that if you go there. Cash only too.", "author": "Darren D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-03", "description": "I must say Grimaldi's is the best Pizza in NYC. I like it better than Lombardi's. The service does lack, reminiscent of the Soup Nazi, as one person wrote. Go for the food, not for the ambiance. \u0026 Yes save room for the Ice Cream Factory later", "author": "Antonia E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-07", "description": "ABSOLUTELY DELICIOUS! My mouth entered heaven. This pizza is hands down the best pizza I ever had in my entire life. I did not expect much  but seeing all the people lined up outside was ridiculous. I never saw a pizzeria that packed. Inside is a comfy home like setting. The employees were also very friendly. I love it!", "author": "Kathy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-18", "description": "Visiting my friend in NY she said I had to try there pizza.  She is a big time foodie so I trusteed her.  We got there and we had to wait for a table, so that was a good sign that people love this place.  There pizza was so cheesy and good!  We were boring and got just plain old pepperoni.  I think it was hands down the best NY pizza restaurant.  Ok, so maybe I haven't been to many pizza places in NY...but I know good pizza when I eat it.", "author": "Dana Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-21", "description": "Grimaldi's is pretty decent pizza. It is nowhere near the top of NYC pizza places. It has a good location, and that's probably good enough for a lot of people. But if you want really good pizza, my recommendation is Lucali.", "author": "Keith P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-20", "description": "My first NY pizza! Lucky for us there was no line today and we barely had to wait. We ordered a mushroom, onion and sausage pizza and it was pretty darn good. Oh the sauce! And the fresh mozzarella cheese. You just can't get them like that in California - not that I have found so far. However, according to my friend, they were off this day and they have been better. I will definitely come back to Grimaldi's when I visit NYC again.", "author": "Vicki F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-11", "description": "Sassy macho service. The place gets by on its great oven and good ingredients, but any idiot can throw good ingredients in a great oven and have a pretty good pizza. Massively overrated.", "author": "Nina P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "We were in denial about the wait. If it had been raining or if it were cold, and if we were not in a parking garage w/ a minumum, I doubt we'd have perservered. But we did and WOW!!, GLAD we did. So worth the wait. Simple sauce, lovely fresh cheese, fresh basil, bad a$$ crust, that's what makes the pizza worth the wait. Bring your patience, enjoy your company and have a great time!", "author": "Cindy N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-25", "description": "Over-rated. After waiting on line for a pizza that long, I would have expected better. The pizza felt like it came off of an assembly line. I went with several friends when we tried it, we all agreed that Di Fara's was far better. The crust had a decent texture, the sauce was not flavorful, and the cheese left something to be desired as well. If you're going to wait for pizza this long, there are better choices.", "author": "Matt J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-23", "description": "Does my review or any other matter given the hype? Decent pizza that was great a long time ago.", "author": "S. D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-15", "description": "OMG. I come from Seattle, and I came here because I heard this place was good, actually the best in NYC good. I got here, and the line was out of the building, and down the sidewalk. We waited for maybe twenty minutes. We walk in and really quickly a very nice person who worked there got us some seats. I have to say, my first bite, was like I died and went to heaven. The crust, was as crunchy as crunchy stuff. The tomato sauce, was perfect, and the cheese was as good as it gets. Grimaldi's is defiantly the best pizza I have ever had. Will I come back? Yes, I am hungry.", "author": "Jacob K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-09", "description": "This is the best pizza in NYC.  We usually get sausage, mushroom, garlic, and extra cheese. It is delicious and the toppings are fresh. Make sure to get there by around 12:00. Otherwise you will be waiting a long time.", "author": "F D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-09", "description": "The pizza is wonderful.  The atmosphere is authentic.  When I was there, a large italian man was counting piles of his cash in the corner.  I'd recommend a walk over the Brooklyn Bridge from Manhattan before going underneath to eat at Grimaldis.  Whether just visiting or a reminder of why you live in NYC, that's the perfect afternoon outing.", "author": "Stephen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-04-30", "description": "Grimaldi's has a reputation for excellent pizza and it's well deserved. I stopped by with a friend for an early 5pm dinner and beat the evening rush. The lines to get in can get pretty long, which is not surprising given Grimaldi's consistently high ratings. Still, we had to wait for about 45 minutes for our pizza to arrive which is way too long in my opinion. Sure the pizza's great, but so is the pizza at Lombardi's and John's, and neither place requires such a long wait. If you're in Brooklyn, and the line's not too long, then definitely stop by for a pie. It's excellent for sure. However, I'd still give the edge to Lombardi's and John's for equally good pizza and quicker service.", "author": "M L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-09", "description": "i dream about grimaldi's pies. the best pizza i 've had yet.  then again, i'm from san diego, so even the microwaved slices  from the joints on times square are better than *most* of the stuff they pass off as pizza out here. \n\nwe didn't wait too long to be seated. 20 minutes? despite the fact we were sandwiched between the window/a young couple on their second date and the the waitstaff getting annoyed with us for being indecisive, it was a wonderful and delicious experience.", "author": "lora a."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-10", "description": "They make a good pizza no doubt about that. Thin crust is the way to go. But their downfall is that they've gotten a little snotty to say over the years. The wait to get in is ridiculous at times. They do not accept credit cards, everything has to be in cash, they even have an atm in the doorway. They don't deliever, you can take out and they give you these strange bags instead of boxes. They only have a limited number of toppings, nothing special, out of the ordinary. Kinda sad, cause the location in long island does more. More toppings, expands out to other things like dessert and salads and etc. \nThe last few times I've gone, after waiting outside for 30 min, the pizza was a little bit more burnt than usual, and was getting soggy faster than I had remembered. They are letting themselves go in a little, letting their egos get too big. They make pizza, good pizza, but not THAT good. Try the location in long island or hoboken, NJ, they seem to be a little bit nicer there.", "author": "Jen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-14", "description": "I have been to all of the major pizza joints in the city and this is by far my favorite.  Though I had to wait an hour for a table, the pizza was worth the wait.  The coal oven makes a really crispy crust, and the crust stayed crispy during our meal.\n\nGrimaldi's location, under the Brooklyn Bridge can't be any better.  Walking across the bridge from Manhattan really works up an appetite.  Walking back across the bridge helps burn off the slices one just devoured.\n\nI have to admit the tables are a bit too close together, but the closeness helps you make friends with the people around you.", "author": "J T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-27", "description": "It was good pizza. NOT great. Not the same pizza you get in Italy. It was definitely NY Style pizza. I went on a Tuesday which is ideal, because I would not be happy if I waited an hour on Saturday night. I once had pizza from Harry's Big Tomato or Luna in CT, and these were both far better. Try Lombardi's in Manhattan.", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-22", "description": "So i finally finally got to try this place out after hearing about it for years!!  The pizza here is very very good... i would dare say possibly the best i've ever had.   However, the place does get extremely crowded and they try to squeeze you into ridiculously small tables...soo i would have to give it a 4 star for the poor ambience", "author": "Jeff L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}