{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-30", "description": "After eating every single meal at restaurants everyday for 4 weeks during my business trip, I thought I was really fed up of eating out for the next few weeks. I don't even wanna know how much weight I've gained, urgh!!! However, my undying foodieness in me unfortunately resurfaced again when my friend suggested we go to her favorite pizzeria \"Grimaldi's\" not too long after my return. Grimaldi's has been on my bookmark list for years!! How can I say no?? \"Ok, I'm sold! Let's do it!\"\n\nSo we finally arrived in front of Grimaldi at 5:20pm and the line was insanely long just as I had expected. We were told by the grumpy old Italian guy that the wait is about an hour but it didn't deter us. We expected that anyway and besides, if people are willing to wait that long, the pizza must be so good, right?? To make the most of our waiting time, we bought a soft-serve from the ice cream truck parked next to Grimaldi's, which was a nice treat on a hot sunny day like yesterday.\n\nWe were seated after 40 minutes, but it took 30 minutes for our pizza to arrive from the time of order. We orded half white pizza and half margherita with pepperoni, mushrooms, and roasted red peppers. While taking our order, the Interista waiter noticed my Juve iPhone cover and started making small talk with me about football. The same grumpy old guy quickly came over to our table and scolded him for wasting time talking to me and told me not to talk to him!! Dang, these guys really mean business!! Considering the large number of poor hungry crowd waiting outside, I guess it's a necessary measure to keep things rolling efficiently as Atif mentioned. I'm willing to forgive them for their lack of customer service for this very reason.\n\nWhen the pizza finally arrived, we got so excited and wolfed down these sooty-bottomed thin-crusted pizza pie in no time!! WIth the right amount of crispiness, chewiness, and gooeyness, their pizza lived up to the reputation.  Now I know why people are willing to wait an hour for this!! Surprisingly, I preferred the white pizza over the red one. The white pizza was fantastic, so crispy and tasty, loved the chopped garlic which added a nice extra flavor. The red sauce pizza was too soggy, it was a real disappointment!! I loved the overall flavor but the juice from the roasted red peppers made it soggy and didn't preserve the crispiness!! Never add roasted red peppers again!!!!  They should remove them from the topping options!!!\n\nOverall, I must say I loved the pizza! However, it was so good that I ended up overeating again and felt gross later. I should've stopped after 3 large slices of pizza!!! Now I really don't wanna eat out for a while!!! LOL", "author": "Jewel Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-27", "description": "Wow! Best pizza in the world! \n\nService is what you can expect from Brooklyn but the food makes up for it. \n\nPepperoni, mushroom, mozzarella, basil pizza... to die for ....\n\nMust stop by if you are in NY.", "author": "D S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-22", "description": "Long lines and impatient hungry growling stomach equal out to pizza being average. \nSeems like they rely on their reputation to get you in the door then the food falls short because they have lots of patrons.  Thanks Gramaldis I don't think I will be back.", "author": "Sergio C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "Must try.  Yes, the lines are long, but it is worth it.  The sauce and the cheese---especially the cheese---are phenomenal.  Is it as good as Italy?  No.  But it's still some damn good pizza.\n\nFavorite toppings are the pepperoni, extra mozz, fresh garlic.  We also ordered one of the antipasto platters and wound up throwing some of the leftover roasted red peppers onto the pizza on a whim.  It was really good, so next time I think I'll order the pizza with red peppers too.", "author": "Jaime R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-23", "description": "Grimaldi's is probably one of those places you've heard about. Its probably a place you've heard two things about. It takes hours to get in and its the best pizza in New York.\n\nWell one of these is a lie.\n\nActually, they're both a little off. Yes you will have to queue, but it really is \"pick your moment\". We turned up and by chance there was no queue at all. Five minutes after we arrived we were the head of a queue of fifteen. If you arrive any time between 5pm and 8pm you can expect a delay getting in.\n\nBut the staff will try their best. Often going in smaller groups is better. As a group of two we were seated in five minutes (As we didn't mind sitting at the bar).\n\nThe place is small ish and isn't air conditioned but the tall bar and open plan cooking/preparation area makes it a nice place to be all the same. The portions are what you'd expect from any American eatery and it is well made.\n\nMy criticisms would be, there is a limited number of options for toppings and to be honest, there are better pizzerias, even just in brooklyn.\n\nI had a fantastic time here and for tourists this place is easy to find and easy to love. But i can't help shake the feeling that every resident in the area just shakes their head as they travel up the road to a best kept secret of Brooklyn.\n\nCan't fault them at their craft but that nagging suspicion keeps them from obtaining the elusive fifth star.", "author": "Ben H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-03", "description": "I went here after trying Lombardi's, and was so disappointed. There was a wait, but barely at dinner time. The pizza price is much more affordable than Lombardi's, but the quality isn't there. The sauce was so bland. The toppings (pepperoni, sausage) was bland also. And the cheese was sort of plastic tasting. Didn't have the pull effect. Not worth it. We also had the cannoli, in which I didn't like. Especially, the service wasn't great either. I'll spurge and go to Lombardi's next time...", "author": "Tien N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-02", "description": "Pizza was great thin crust typical from Brooklyn. Service was OK and the place is cash only which is an inconvenience.", "author": "Rodrigo M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-23", "description": "Actually 2.5 stars.\n\nAfter walking across the Brooklyn Bridge in freezing weather, this pizza place was the closest one that we could find. With 4 stars and 3000+ reviews, why not? Right?\n\nWrong. We were seated immediately, but the waiter didn't come by for about 10-15 minutes. By that time, I actually had to flag down one of the workers two times for them to take our order. Note that they weren't super busy, either.\n\nNow onto the pizza itself.. it was sort of disappointing. We ordered the small pizza for two people with basil and mozzarella. It wasn't very special at all, and the pizza turned cold REALLY FAST. The cheese was kind of plastic-y after a minute. Not enjoyable.\n\nDefinitely an overhyped place. Oh, and cash only + whole pizzas only.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-08", "description": "Stood in line for twenty minutes and it was worth the wait! We were a party of 5 and ordered one large and two smalls - far too much food. The small is not small! White sauce is a must try. The crust was just as tasty as the sauce and toppings. Service was excellent!", "author": "Maria I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-21", "description": "All I can say right now is DISAPPOINTING. Let me start off by saying I was born and raised in Brooklyn and have heard the numerous stories of how Grimaldi's pizza should be the best. \n\nThe atmosphere was nice but way too loud. I couldn't hear my girlfriend to the point of where we had to lean to each other's ears to hear and I'm usually very loud. It took 15 minutes to bring us a menu and the place was not busy. We never had our water refilled until we asked at the end. \n\nThe pizza was good but we got it cold. When we ordered extra cheese it seemed it could've used a little more. So we had a stale cold pizza. (Still ate all of it. Not paying this much for nothing) \n\nWhich brings me to my next point. We ordered a canolli and a Spumoni Trufflel for dessert. The latter was gross and when we asked a waiter (balding guy with a Albanian accent) to take it back he got rude. Our actual waiter was nicer but not very attentive to our table so service is still low. \n\nOver all, pizza eh. Service bleh. Not coming back. I'd rather go to a local pizzeria.", "author": "Neil T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-15", "description": "What a treat after the long walk across the bridge!  BUT..we want pizza and beer. Liquor license STILL pending. Pizza was good. Took a water tact back to Manhatten", "author": "Kelly S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-24", "description": "Gotta say the pizza here is awesome! We had a large pie with half pepperoni and full sweet peppers and it was delicious. The crust was baked to perfection, just the right crunch to it, and not super doughy. We had a little wait to get inside, it's much like waiting for a night club than a pizzeria, but well worth the wait! Great food, for a great price! We will definitely go back again.", "author": "Carisa R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-14", "description": "I walked in to ask how long the wait was, The man working there told me to get out. From the big homing I thought the service was bad. Then, I thought they were trying to do their job. We then got seated and did not receive a greeting from our waiter. He told us \" are you ready to order\" we had replied to let us know if he can give us a minute. He seemed so rude from the beginning. After finally choosing what we wanted to order, the waiter did not come back for another 20 mins. He did not ask if we wanted more drinks instead he just took our cups. It seemed as if all they were interested in was getting their customers out as quickly as possible. \n\nHonestly, the pizza was good after a 45-60 min wait, but the service was horrible. We came from Los angels to try this pizza and like I said, the food was good, but their service was horrible. If you're from California, please wait and go visit the el Segundo location.\n\nIn conclusion, you can get some pizza from next door. They serve beer and you'll be as happy. You won't have to wait as much and you'll be off to explore the city a lot quicker and happier.", "author": "Jaime C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-09", "description": "The pizza is simple, light and tasty here at Grimaldi's. There's really nothing \"special\" in terms of dazzled up enhancements at this joint but I think the simplicity of the pizza and the way they prepare it really just speaks for itself. It's something you must try at least once in your lifetime and somehow even though it won't blow your mind after you eat it for the first time, you can't help but to think about the pizza long after you had it. Weird.. but you just do. simply for the freshness and simplicity of what a pizza really should be like. I'm craving for a pie now as I write this actually.", "author": "Shannon Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-10", "description": "OK... I'm a New Yorker for over 15 yrs and Finally came to Grimaldi's, WAIT in line and try their FAMOUS Pizza.\n\nWent with my GF Pao L. since we both took Monday off after a crazy Easter weekend.  Decided to go on a GF Date , catch up and do things that we haven't done in NYC (well, mostly for me).  After a Fail attempt to go to BK Botanical garden (Realizing that it was closed on MONDAY) we took the train AGAIN and head to Brooklyn Bridge.  \n\nThe OLD Grimaldi's MOVED to the NEXT Corner street (where the line was visible next to the old place) And my GF checked while I was in line if Take out was the same line as to dine in (YES, EVERYTHING is in ONE line!).  But it was pretty quick.  Less than 30 minutes.\n\nThere is one of the staff (OLD ITALIAN GUY) taking attendance to see how many people and if you are taking out, MAKE SURE you say \"TAKE OUT\".  By the time we got by the door he pointed us to head right inside and place an order.  We order a Small Regular Pizza (6 Thin slices) that was $ 12.00 and 2 bottles of Poland Spring water.  Total came out $ 17.50.  Paid Cash and told us to wait right outside the door.  Within 10 minutes we got the order (Wrapped up in a flat paper bag instead of a Box).  \n\nWe sat by the Water where the NEW Park was renovated, plenty of Benches and Pretty view (Make sure is not raining or Windy).  It was so relaxed, refreshed with the pizza was a perfect combination.  This pizza was totally worth the wait. IT does taste different when is Baked from the Brick Oven.  Tasty Cheese and strong flavor of Basil.\n\n6 slices was perfect for 2 people (3 of each).  I got so guilty that by the time I went to my Kettlebell Kickboxing class (an hour later) i burned it all off!. Next time will come back and adding extra toppings.\n\nThey have other locations but this one is FAMOUS!, Also the view of NYC from here is BELLISIMO!", "author": "Helena H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-12", "description": "Since moving to New York I have been on a quest to find the best pizza.  I have only been to a few places thus  far but I can not imagine anything being better than Grimaldi's.  Last Saturday while waiting in line for 45 minutes to get into the restaurant I kept my expectations low because of the bad food experiences I have had as of late.   \n\nWe ordered a large pizza with pepperoni, sausage, onion, and extra  grated cheese.  When it arrived, it looked pretty amazing. It tasted even better.  The people next to us asked how it was and my first thought and response was, \"It is magical.\"   And let me tell you it is.   I am in love with this pizza and had a day dream about it just earlier today.", "author": "LeRue C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-15", "description": "The previous reviews speaks for itself. The pizza here is amazing! Sometimes waiting takes forever but worth it!", "author": "Nora A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-28", "description": "Came here on a Saturday night. Line were long which was expected since almost all the yelpers said the same. Best part was while waiting half way till the entrance they needed a party of 3-4 and that's exactly how many people we got. So we jumped waaaayyy ahead. Yes the other people ahead had a party of more than 4 so they weren't too happy when they saw me and my friends jumped to the front. So my actual wait was cut short of about another 20mins. \n\nAnyway the place was small and the seats were old. They were worn out and our table weren't as clean. I understand they were busy so I let the cleanliness slide. We ordered two small pizzas; one had a whole pie of Italian sausage, and the second one had half meatballs and half mushrooms. Their sodas were bottle sodas so no fountain drinks. Also no Alcohol yet, on the menu it says they alcohol license is pending. Its 3 dollars  for just one bottle of soda. CASH ONLY! No take-out, No delivery, and no reservation. Pizza were GREAT! The crust weren't burned and doughy. It was soft and thin. The sauce, cheese, and topping ratio was perfect. Service was terrible. Took over 20 mins to get our waiter to take our order then another 20 mins or more just to get our pizza. Here now we knew, the people there were waiting in front of us caught up to us so they sat down at the table behind us and ordered. They got their pizza a few mins before ours did. See how we knew we waited for that long to order and get our pizzas. Luckily the pizza was worth it. It also took what seem like forever to get our check too.\n\nOverall we left the place with happy tummy but with disappointed faces from the waiter service.", "author": "Emily O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-02", "description": "Since the last time I came here, which was 4 years ago, Grimaldi's has gotten a lot bigger and popular.  Four years ago, it was a little shop in the middle of the block.  Now, Grimaldi's moved to this white castle at the corner of Front Street.  The place expanded to two floors.\n\nWith two friends of mine, we waited in line for hours just for a couple of slices of pizza.  When you finally get a table, you might as well order three whole pies, one for each person, because the slices are so thin and you are starving from waiting so long.  Once you place your order, be prepare to wait another hour or so for your pizza, because they make each pie from scratch.  You are so hungry that you might start eating the peppers from the table.  Finally the pizza come and you take the first bite, and it is not that amazing.  It's just regular pizza with fresh mozzarella and fresh basil.  Grimaldi's famous tomato sauce does not taste that different from a regular sauce.  Although, the slices were very crunchy due to the fact that the pie has a thin crust and bottom.  The whole pie cost $16 for the large pie (18 in.).  It is $2 extra for extra mozzarella or sauce, or basil.  \n\nService was decent.  The waiters were really busy trying to serve all the tables that we were forgotten at times.  The check took a while to get to us as well.\n\nPersonally, the pizza was not that special for me to wait in line and pay more than double of what I would pay at Two Bros.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-12", "description": "Having read previous yelp reviews, I was prepared for the line outside of Grimaldis at 11am on a Saturday. My mother, aunt, and I happily got into line, prepared for the wait.\n\nThen we got to the front. The guy at the door asked how many and we said 3. He then proceeded to seat three different groups of four who were behind us in the line. Ok, I thought to myself, maybe they have some tables that only seat three people and they're waiting to seat us at one of those. Nope. They finally sat us at a four person table. The wait would have been about 15 minutes shorter had we been seated in the order that we were in line.\n\nOnce we were in the incredibly crowded upstairs, we waited again until our waiter finally came over. We ordered our drinks and pizza and he came back with the drinks pretty quick. Don't expect any free refills, the drinks her come in bottles. \n\nAnd then we waited again. Tables that were seated after us got their pizzas and we continued to wait. FINALLY our pizza came and I would describe it as ok. Honestly, I've had better pizza in Delaware as well as in NYC. \n\nNot once after the pizza came did our waiter return to check on us. My mom had the audacity to ask the waiter of the table next to us for more water (as he refilled his tables water) and he literally gave her the talk to the hand gesture. Are you kidding me? \n\nThen we waited some more with our empty pizza pan for our check. Eventually our waiter came and asked us if we were waiting for more pizza. Seriously? How would we be waiting for more pizza when you have literally not come near our table? \n\nThen we sat with the bill. I honestly think that the guy was just waiting for us to give up and leave cash on the table so that he wouldn't have to bring us change and get a bigger tip. \n\nIf the pizza were truly amazing, it might be worth it to wait in a line and suffer the terrible service. But it's not. Go somewhere else, anywhere else. Go next door. I haven't been, but I can't imagine it's worse.", "author": "Heather B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}