{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-28", "description": "Great pizza, nonexistent service. That's really about it. Don't even think about a salad. Yummy cannoli.\n\nNOTE: If you come with a party of just 2, they WILL seat you (closely) with 2 others at a table. I don't know if this is a NYC thing or not (we are from Oregon) but I was kind of surprised. One night alone away from the teenager and we have to share a table with 2 others who were obviously on a romantic date...kind of awkward and uncomfortable.\n\nAsked for water...never came. My husband got up and got the water pitcher himself. \nSent money for bill...waited, waited...20 minutes later we had to ask for the change and it was thrown onto the table. Maybe the waiters are paid a super good wage so no need to worry about tips or customer service.", "author": "Rose N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-24", "description": "Yes ..you have to wait a long time, \n\nYes the service is not very friendly \n\nYes it hot outside and u just have to wait for ages on the curb\n\nYes its quite far \n\nBut the food is greaaat ! ...i mean ..i havenot eaten pizza like that anywhere else ! For ppl who eat just chicken,  a small pointer, you would not get chicken based pizza but the margerita pizza is simply yum... desert is nothing to write home about but order enough pizza to satiate you hunger.", "author": "Manash B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-22", "description": "So I'm from New York and that means that I'm extremely particular about a few things ... definitely at the top of the list is pizza.\n\nThis is THE BEST pizza out there ... end of story.\n\nFresh ingredients crafted into delicious pies.\n\nThe only drawbacks to this haven are the long lines to get in and the fact that you can not buy slices ... other than that it's totally delicious.", "author": "Mike J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-03", "description": "So far the only pizza that I've had since being here the past 2 days. Got a small half regular with pepperoni and sausage and half white pizza (4 different cheeses no sauce) didn't think I would have like it but it was one of the best pizzas I've ever had!!! The small actually looked more like a large in according to what we usually get in Cali. We ate the whole pizza it was that good...next time I come back I will definitely come back!!!! Stood in line for about 30 mins but worth the wait... Oh yeah, they don't sell by the slice and they don't take any cards. Cash only.", "author": "Kalei K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-28", "description": "A friend of mine likes to show just how connected he is by saying that he knows of some sort of back entrance to get into Grimaldi's.  At any normal eating hour, there's a line around the block here, full of a combination of tourists and locals.  But the locals always come to Grimaldi's as a special occasion because the tourists line up.  \n\nAnd while the pizza would kick the butt of anything outside of New York, I ate at several better pizzerias while in the city.\n\nBut there's something great (or not so great) about an institution where you'll be seated neck and neck at long tables with English douchebags who joke about putting roofies in cocktails one moment and the next find yourself in the great company of friendly Brooklyn natives the next.\n\nThe pizza itself features the greatness/crispiness a coal oven can offer, but the most distinctive quality is the use of Buffalo Mozzarella.  I tend to prefer the standard mozzarella used by Di Fara's, John's and various random Brooklyn pizzerias.", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-02", "description": "To wait over an hour in line for pizza that can best be described as \"meh\"? Not worth it. We got half white, have margherita and we weren't particularly pleased with either. \n\nOn the white side of the pizza, the cheese and garlic congealed into a sort of gluey paste with a similar texture to hardened fluff. Texture aside, the flavor wasn't there either. It was bland and flat. \n\nThe margherita side was substantially better, but still mediocre. It would have been ok, but the sauce let it down a little. It was just too sweet. It was rich and bold in very good ways, but I couldn't get over the sweetness. It was as if they dumped a cup of sugar into it instead of salt.\n\nThe crust was the best part. Crunchy on the charred edges, but also had the right amount of chew. \n\nThe restaurant itself is bustling and brimming to the point of chaos, but not quite. They've definitely done it enough that they are able to stay  relatively controlled, but barely.\n\nLong story short, never gonna be my first choice for pizza.", "author": "Evan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-19", "description": "Line move pretty fast.  Friendly service for the amount of people they put through.  Great food, great crust, must do in NY.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-16", "description": "I came to this place with my aunt while on vacation to NYC. She has been here before and mentioned to me this is a place I have got to try. We walked over the Brooklyn Bridge to get here so we worked up quite an appetite! Walking in-the atmosphere, decoration and layout was very captivating. Its very unique and I like that there was an upstairs that was a little more private. It was really cool to be able to look over to see over the whole restaurant. But I felt a little cramped upstairs. I felt like I could elbow the people behind or beside me while eating. I'm not particularly a pizza person but the pizza at Grimaldi's exceeded my expectations. It was so authentic and full of flavor! There were so many choices of toppings! We were very pleased with our pizza. We were however disappointed with the way our leftovers were packaged. There were two slices left and our waiter put them both in foil paper which made them stick together and not to mention the oils and sauce from the pizza leaked all over the place. BUT that is just minor. Since I have been back home to Kansas, I occasionally get a craving for Grimaldi's and will DEFINITELY visit this restaurant again when I return to New York!", "author": "Kali M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-06", "description": "This has to be one of the most overrated \"Classic New York\" establishments. Grimaldi's has become nationally famous for their \"amazing\" pizza. It's been located in Brooklyn for many generations. Although I was born and raised in the Greater New York City area, I had never been until recently. A friend of mine and I decided to see what the fuss was about. I'm sad to say that it was not worth the walk in the freezing weather nor the calories. First off, it's cash only. Second, they don't sell alcohol. Everyone knows that the best drinks to have with pizza are beer and coca-cola. Instead, we were given an \"interesting menu' that featured an entire section dedicated to Snapple. I haven't seen that much variety since the vending machine in my elementary school cafeteria. Now let's get to the pizza. One word: OVERRATED!!!!! The pizza lacked flavor. My friend and I had to drench it in garlic powder and chili flakes in order to make it worth eating. Second of all, the center was too wet. I had sauce and cheese splattered all over my pants. Grimaldi's  used to be a quintessential New York experience/ a nice reward after a walk across the Brooklyn Bridge. Now, it's an overhyped, crowded place run by weird russians with subpar food/ no beer. MAJOR THUMBS DOWN. Save your money and head over to Lombardi's in Soho instead. You won't have to haul your butts to brooklyn and you'll eat pizza that's WAY better!", "author": "Samantha S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-24", "description": "REALLY disappointed! I've driven by loads of times and seen the lines, so I had to see what the hype was all about. I've lived in NY my entire life and had more than my share of pizza. Grimaldi's was very much below average. Soggy crust, absolutely tasteless sauce, rubbery cheese. Overall, a serious disappointment. I'm going to assume that most of the folks waiting in line are tourists. Very sad that they will come away thinking that Grimaldi's is NYC's best pizza.", "author": "Marc N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-17", "description": "My husband and I, huge pizza lovers, trekked out to Brooklyn to try Grimaldi's. The pizza was good, but we both agreed that we've had better. Not worth waiting the long lines.", "author": "Merav B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-23", "description": "Now I understand what everyone means when they say you need to try a NYC Pizza! Waited about 15 minutes to get seated. The line isn't inside the restaurant, but you start by lining up outside. Is it worth the wait? I would say it is and it's a culinary experience that one should do when being in NYC. It's definitely a place to go after walking the Brooklyn Bridge!! \n\nGrimaldi uses fresh mozzarella and fresh basil on their pies, very flavorful and aromatic!! We ordered a pepperoni, sausage and mushroom pie. It came out piping hot with a thin crispy smoky crust. I read other reviews which said that the crust was soggy. The crust on our pie was definitely NOT soggy!! All the ingredients are fresh and all the pies are baked in their brick coal oven, which is the reason why the pie's crust has that smoky flavor. There is definitely a difference between NYC pizza and all the other pizzas that I have eaten throughout my life in California. Between the two of us, we devoured the large pizza!! Haha. I made sure to enjoy every savory bite!! \n\nThe service was great. Even though they were busy, they didn't lack in their service. Our server was attentive and checked on us from time to time. One main thing is that this establishment only accepts CASH!! \n\nI will be back next time when I'm in NYC!!", "author": "Lulu W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-20", "description": "this place is around the corner from my house go here all the time for the spinach and mushroom large pie soooo good and their caesar salad is very tasty also", "author": "Marina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-22", "description": "Great charcoal fired pizza. The small size is adequate for two people unless you're really starving. Get something standard and enjoy. Oh and remember... you're not there for the service, but for the food. (All told the service is okay, but certainly not a high point). Take a few minutes and stand just inside the entrance watching them make a pizza. From throwing the mozzarella slices at the dough, to kneading and tossing manually, to masterfully navigating pizzas through the huge oven with only one door, you'll learn a lot and gain sincere appreciation for the art. These guys know what they are doing. Worth the wait. To work off the grease and cheese you'll enjoy so much, walk back to lower Manhattan over the Brooklyn Bridge.", "author": "Ron T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-11", "description": "They treat you like they don't want you to be there and they don't care. They just throw the pizza on the table and leave. Terrible service; definitely not good for a date or a business meeting.", "author": "Selcuk A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-05", "description": "These guys make the best pizza in NYC.\n\nThe tricky part is the line. You either have dinner before 5 pm or go there with jay-z and beyonce. ( they were there a couple of days ago).", "author": "Edward R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-12", "description": "I don't know what all the hype is about. After waiting about 25 minutes in line outside, we were seated and placed our order for a small onion pizza. Then the wait began, a 45 minute wait.... for a small pizza. We were told numerous times that it would just a another minute. The service was meh... the pizza was meh... This is an hour and a half of my life wasted!!!", "author": "Jillian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-04", "description": "I consider myself something of a pizza aficionado, but had never made the great pizza pilgrimage across the Brooklyn Bridge to check out Grimaldi's.  Shocking, I know; scandalous, even.  Often proclaimed \"the best pizza evah,\" this is one of those great culinary legends of New York that one must try (Magnolia Bakery, Peter Luger's, etc.)  And like Peter Luger's, it ain't all that.\n\nLook, this is unquestionably good pizza, but no, it's not the best ever.  Lombardi's and Keste both offer a more chewy, flavorful crust and the toppings here were just alright.  All things being equal, I would pick either one of those places above Grimaldi's, but then you have to factor in the schlep across the bridge and the ridiculously long wait.  The entire experience took over 2 hours (not counting schlep time) and after 55 minutes spent waiting on line just to get in the damn place, the pizza would have to be at least 55% better than its competitors to be worth my time (call it the Shake Shack factor).  And it's not.", "author": "Grant C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-27", "description": "Being born and living my whole life in Brooklyn i had never tried Grimaldi's, until last month, and all i could ask myself was \"how the heck did i not try this pizza sooner?\" \nI had heard so many stories about this place, i had even seen it on TV and i knew it was notorious for it's crazy lines outside So one day, one of the hottest days of the summer, my boyfriend and i decided to give it a shot. \nWe pulled up and right away i noticed the long line of people waiting in line sweating profusely trying to block the suns rays with the umbrella's purchased in the store next to Grimaldi's. So we jumped on the line and started to sweat along with all the other hungry folks waiting to sink their teeth into their brick oven creation. Even though the line seemed quite scary, we only waited about 20 minutes. We were lead into a fairly large room with many tables lined up next to one another and sat at a table. \nThe waiter came over to us and asked for our order, we ordered our large cheese pizza and 2 drinks. After we ordered, i excused myself to the restroom and while waiting for my turn i noticed the men making the pizzas. Let me tell you, they do not stop! Not for a minute! They are making pizza after pizza after pizza. It is pretty amazing. \nWhen i got back to our table, the pizza was just brought out to us. Let me say that this is the best brick oven pizza i have ever tasted and living in Brooklyn, NY i have tried many! The sauce is perfect,  the fresh mozzarella is great and the crust is cooked to perfection. I was able to effortlessly eat 4 slices and no bellyache afterward. \nIf you are intimidated by the line, don't be! It's worth the wait!", "author": "Nikk A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-19", "description": "Took a trip to the big city and needed a reason to cross the Brooklyn bridge... other than the novelty of seeing the city skyline and the bridge its self. As one reviewer said before... the subway ride did seem a tiny bit sketchy but I'm sure most of the people on it were harmless. My one girlfriend being a bit more dolled up didn't help though (crazy southern California girls). \n\nBrooklyn Pizza\nBrooklyn Beer\nBrooklyn Men (Handsome in the dinning area) \n\nThe line:\nWas yes, long. Waited a good hour and a half. Their system for seating people is great though. Filling in all the seats at the tables. If you're a party of 3 you get a table with 3 seats and not wasting a seat someone else in line could be in. So expect to wait at the FRONT of the line for a bit longer if there's more than 2 of you. \n\nPizza:\nIt was good and hot when it came to the table and till my first bite. But it really had to be the fact that the dinning area is kept cool and the AC was probably above our heads... chilled the pizza way way too quickly for my liking. Maybe if we ordered to go it would have been warmer longer because it'd be covered?\n\nOrdered: Half pepperoni-mushroom and half margarita (regular). The crust was nice and thin and complemented the toppings nicely. We agreed that maybe the regular could have had pepperoni on it too. Their edges were nice a crispy. Nothing was too strong tasting, though it could have been. \n\nTried the cannoli... I'm not sure but are they suppose to be crispy like that? Filling just tasted like a light frosting. I didn't care for it too much, but we were game to try something new. \n\nEnjoyable pizza. I'd go back. Maybe next visit we'll get lucky and beat the crowd.", "author": "Jazmine C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}