{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-11", "description": "If I was on Family Feud and the question was \"Name A Place with A Bouncer,\" I imagine \"pizza place\" would not be among the top 5 answers on the board. I'd like to think I'd do well with \"strip club\" or \"dive bar\".\n\nBut if any of those 100 people surveyed had ever waited in that roped off line at Grimaldi's, then \"pizza place\" wouldn't be such a crazy guess. I don't know if I would call Crazy Chris (as he introduced himself to us later) a bouncer per se because I don't think he necessarily ID's anybody or stops people from coming in if they're wearing sneakers. But he had that gruff attitude that made you wonder if he'd eventually pick you to sit at a table and enjoy their famous pizza.\n\nWe had anticipated the line at this popular destination in DUMBO literally under the Brooklyn Bridge and so weren't too fussy to wait about 35 minutes for a table. But it was intimidating every time Crazy Chris would throw open that door, point at a few unsuspecting lunchers and pull them inside. I knew he wasn't all brute because once in a while he would send a wink to one of the pretty girls in the queue. Very charming.\n\nOnce we were chosen and beckoned inside, the vibe changed. It was warm and welcoming and people seemed happy. A very different atmosphere from what you'd expect at a club or bar. We were shown a table that was practically a communal table. The girls sitting next to us, already deep into their pepperoni pie, barely noticed that we even sat down. I guess we weren't as charming (or intimidating) as Crazy Chris.\n\nOur waiter arrived rather quickly and we placed a simple order for a small pie with sausage and mushrooms. This was the first of two pizza excursions for me today, so I had to be careful and eat light. Plus, the small 16-inch pie was actually big enough for three, in my opinion. At $12 for all that pizza, it seemed to be the best deal I've discovered so far.\n\nMy first observation was that it was a bit soggy. All the sauce fell to the middle, as it tends to do with coal oven pies. And the pizza was far from a piece of artwork. This is old school pizza, established before we cared about pretty food. If there is any food pornography going on here, it's dirty, smutty, disorganized. But that's how some people like it - their food and their porn.\n\nPutting the visuals aside, I went in for my first bite. It was definitely flavorful. I wasn't crazy about the sausage (I even found a piece of cartilage or something), but the cheese and the tomato sauce were well proportioned and delicious. The basil was not overwhelming, but you could taste the herb. The dough was soft and fluffy, if lacking the intense char that I anticipate from coal oven pizza.\n\nThe pizza was definitely worthwhile. I  realized this is what many people want from traditional New York pizza, especially visitors from elsewhere in the states. They want fresh, cheesy inexpensive pizza that tastes good. And that's what this is. I feel like my parents would much prefer this to the tomato-y gourmet pies at Lombardi's.\n\nGrimaldi's is constantly regarded as one of the best. It's old-fashioned and does the job. I think most visitors to New York looking for flavorful, well-made pizza would be more than happy to wait in line and experience the pizza under the Brooklyn Bridge. Just make sure you don't cross Crazy Chris - otherwise you might be turned away hungry.\n\n-eatthisny", "author": "Brian H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-27", "description": "Don't come here for good service, good value, or if you want a quick meal without a wait.\n\nBut with all of those points aside this place is somewhat of an institution to pizza in NY.  Do yourself a favor and order a regular pizza and the white pizza.  The ingredients are top notch and you can't go wrong with any choice but just be sure to try as many different ones as you can!\n\nAfterwards be sure to take a stroll down to the water, the views at night are beautiful.", "author": "Hamilton W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-16", "description": "Pizza was pretty damn good but the service, restaurant and pretty much anything else you expect when paying for food was worse than lousy.\n\nThe man who took orders gave the impression he barely spoke English except when it came to giving you the exact amount you owed and giving you some change pretty swiftly. Smiling apparently isn't a requisite of customer service anymore, and the entire restaurant just gives the ambiance of grease. Sure, it's a pizza joint but does EVERYTHING need to be covered with an oily film that makes you feel like you need to douse yourself in disinfectant upon leaving - and this is on a sunny day!\n\nThat said, the pizza is very very good. The crust was perfectly cooked, the ingredients were delectable and the cheese they use as a base has a special twist and kick to it. \n\nAll I'm saying is that if I'm going to pay for your pizza AND you're  to ask a five-star rating, SOME level of service (even a smile) would be appreciated.", "author": "Jess T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-26", "description": "ok i'm ready for the haters of this review... i think this place is a tourist trap and there's better pizza out there in brooklyn.  that's all.", "author": "Kerry Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-10", "description": "Awesome pizza! Nice crisp crust. You don't need to add many toppings, it's great by itself or with a few. Make sure to eat it there!", "author": "Vivian P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-06", "description": "I LOVE THIS PIZZA. \nBeautiful view, Delicious Pizza, Fun Experience. \nI'm not going to knock it because tourists have discovered it (I am one, after all; I don't live in New York).  This is one of the few touristy places that hit the jackpot.  You'll have to wait if you show up at prime time, which here may be most of the day, but it is worth it.", "author": "Edward P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-14", "description": "Amazing Pizza - worth the wait in line - probably the best pie I had while visiting NY \n\nI wish we could duplicate this kind of quality in California", "author": "Sam A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-24", "description": "Let me just first say, I'm a native New Yorker and had many enjoyable experience at Grimaldi's before. This past Sunday, however, I encountered a most unfortunate incident that prompts me to post this, my first review ever on yelp. \n\nI arrived and wait online a half hour before the restaurant opened, which I did not mind at all.  My mom cannot stand for long due to her arthritis and was waiting inside the car, along with my brother. As opening time approaches, they joined me on line. There were about 12 people ahead of us and as they slowly enter, we soon find ourselves in front of the line. \n\nThe \"usher guy\" (usually I would use the word gentleman, but in this case, the term does no apply) motions for us to to go in. I was the first one to walk toward the door when unexpectedly the he literally stiffs arm me, stop me in my track, and I even stumbled back a step, and he simply said something to the effect of  \"they come in first\". As I turn my head I see a tour group of around 20 to 30 people skipping the line and went straight in. \n\nMy first thought is we might not be able to get a table, what is my mother going to do, she simply can't stand for much longer. Although we did get in right behind the tour group, I just can't help feeling mistreated. I may not agree with the policy of allowing tour groups to skip the line, but that is not my gripe. \n\nIt was the way the \"usher guy\" smugly stopped us, brushes us aside and treat us with little consideration or respect. Is it so much to asked for to spend five seconds to explain the situation and not put his hand to us. What if it was my mom who he pushed aside, she could have easily fallen. I would not expect this kind of treatment from the bouncer of the most exclusive club in the city.\n\nI, for one will no longer be patronize your establishment, and I know even if was able to convince all my friends and family to do the same, I won't put a dent in your business.\n\nBut this is New York City; many of us are not from here, but we manage to carve out a niche in the city to call home. And I will spend my hard earned money at places where they still remember what that means, and not treat people like disposable cattle. \n\nGrimaldi's, SHAME ON YOU!", "author": "Tsz Chung C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-07", "description": "This place has to be my first review on yelp. Went to grimaldi's with my boyfriend at the time. Pizza is amazing but the staff... not so much. I get it.. the place gets crowded. But one of the waiters was trying to get by and spilled my water all over my food..table and myself. Just proceeded to go with no care in the world. I was soo pissed but didnt think it was worth to say anything. Demanded that my boyfriend doesnt leave a tip. The waiter ran after us yelling at us for not leaving a tip. I pointed at my drenched self and told him that he spilled water all over my food and myself. He proceeded YELLLLING at us. I couldnt freaking believe it. At that point..the least you could do is apologize and and tell us to have a good night. Nope. Continued yelling...to the point where someone else had to come outside to shut him the hell up and he apologized on his behalf. I wish I could have done a lord dissick move and shoved $2 in his mouth to stfu.", "author": "Sha P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-22", "description": "Pretty good pizza but the cheese was bland. They used real mozz cheese with no salt. This lets the pepperoni's salt and the sauce's salt try to make up for what's lacking in the cheese. Good thing we ordered a pepperoni or else just a cheese pizza would have been pretty bland. Anyways not a bad place. Service was slack.", "author": "Christine H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-20", "description": "reminds me of the pizzas from italy =) thin crust and flavorful.  \n\nsince everyone else has pretty much said everything there is to say, some things to keep in mind\n\n- cash only\n- you cannot order slices (whole pizzas only!)\n- you will have to wait in line\n\ndelish and something to hit up if you're in brooklyn", "author": "Angela D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-18", "description": "Grimaldi's hands down made my trip to New York City.  It was my first time to NYC and this is what I dreamed a really New York pizza was like.  The crispy crust was something I wish I could replicate, but I guess I'll just have to wait until my next trip.\nThe line to get in looks daunting, but it is so worth the wait!  Now only if they would have one in Seattle...", "author": "Carol W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-13", "description": "Sidlamirg! That's how bass-ackwards this is. \n\nOne of my friends has driven me to points of near insanity over the years, because he constantly describes any experience with \"I've had better.\" New restaurant? \"I've had better.\" Camping trip? \"I've had better.\"  Great flick on the big screen? \"I've had better.\" \n\nWell, I'm stealing his phrase for Grimaldi's. Don't hate me New York, but really, I've had better. I'll wait in line for many things - but pizza? It was great, sure, but not grand. Service was shabby, it was nearly impossible to dive into our table space, and going to the bathroom was another wait-in-line mission combined with some kitchen obstacle hurdling. \n\nIf I'm going to pay (cash) this much for pizza, I'll be a Luzzo's - where the servers actually attend to your needs, and the pizza margherita is a full circle of deliciousness, and I don't have to be ushered like herded cattle.", "author": "Mo S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-12", "description": "This pizzeria is a shadow of its former self. Good, but not great. For the real deal, go down the block to Juliana's.", "author": "Josh P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-30", "description": "Of course we'd heard about Grimaldi's forever; wanted to try it but never fancied waiting outside on a very long line.  Got the opportunity a few weeks ago by showing up on the early side on a weeknight, and so found a much shorter line than usual, so we were happy.\n\nNot so terribly happy when we got our pizza, though.  Don't get me wrong, it wasn't bad - but hey, it was not great, certainly not the be-all and end-all of pizza as we had been expecting from all the hype.\n\nFor me, great crust is the holy grail of pizza, and this was NOT great crust.  In fact, it was pretty bad - undercooked, flavorless, soggy and mushy; had to eat it with a knife and fork - unforgiveable.  Sauce and cheese were ok, nothing at all special.  Ordered ham on my pizza (I know, sounds weird, but I wasn't in the mood for the grease of sausage or pepperoni, and they didn't offer chicken).  I was expecting some nice slices of flavorful ham; what I got were a few teensy cubes of run-of-the-mill boiled ham sprinkled over the top.  That led me to believe Grimaldi's just doesn't care about their toppings.\n\nFor my money and to my palate, this place is just coasting on their fame, offering a mediocre, ho-hum product that certainly does NOT live up to the hype and is DEFINITELY not worth waiting around on the sidewalk for hours.  Go somewhere else - venture deeper into Brooklyn to DiFara or L\u0026B Spumoni Gardens if you want really excellent pizza.", "author": "marie m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-30", "description": "Being a woman from Chicago and pizza flows thru my veins I can say that the pizza wasn't too bad here!\nI ordered the small 1/2 cheese [wish it had more cheese] 1/2 sausage was cooked perfect.\nThe sauce was the perfect amount so that the crust was still crispy on the underneath, the cheese was great I still would had prefer more and don't get me started on the sausage it was Perfect'o!!!! There is nothing worse than having sliced sausage why do that they never did that in the old country it was crumbled come on people and thank you Grimaldi's for making my day!\n\nOh yes 2 other very important things you must know about this place:\n\n1) CASH ONLY CASH ONLY CASH ONLY CASH ONLY CASH ONLY\n2) LONG LINES LONG LINES LONG LINES LONG LINES", "author": "Flyinlow .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-25", "description": "The best pizza I've had was in Venice, Italy.  The pizza at Grimaldis although not as good, is worth having and is probably as good as pizza gets outside of Italy.\n\nBeware: The line and wait to get in during busy hours at their Brooklyn location can be quite lengthy.  On average about 45 minutes.\n\nIf you are not willing to wait that long but are willing to sacrifice atmosphere, then head on over to their locaiton at the Limelight Marketplace in Chelsea.", "author": "Jodel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-20", "description": "Waiting in line 5-10 outside is a chance to see Manhattan from a perfect view [famous for wedding photos]. No slices, No Deliveries you will notice on the door. \n\nThe pizza is one of the best coal oven fresh mozzarella pizzas around with a fresh basil touch. sharing a pizza with strangers is quite common here. gr8 place.", "author": "Mark T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-22", "description": "The pizza was tasty - definitely ranked highly in terms of the best pizza I've had in the country - but the customer service just killed the whole experience for me. I know, I know - \"New York attitude.\" I honestly didn't expect friendliness, but I was surprised at how short the employee taking our takeout order was and how genuinely annoyed some of the staff behind the counter seemed when surveying the crowd in the restaurant. Um, sorry you have customers, dudes? Don't worry, I'll get pizza elsewhere when I'm back in New York and save you the trouble of my money.", "author": "Rae M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-18", "description": "I'll keep it simple: the pizza is excellent but be prepared to stand in line atleast for an hour and another 30 minutes before you get your food. Service is just ok. Ambiance is none. It's a cash only place. They do not sell pizza by the slice. The medium is 6 pieces and the large is 8 pieces. The medium is pretty big and would suffice for 2 people. The take out line and the line to get a table is the same. So you really don't save any time if you decide to take out. The pizza is def.  worth the wait. I'll go again!!!", "author": "Shruti K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}