{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-17", "description": "Delicious pizza!  Can't really go wrong!  \n\nWait...you can?\n\nOhhhh, you must be talking about the wait!\n\nI once waited an hour for a table.  It was someone's birthday and if it wasn't her birthday I'm not sure I would have waited.  I brought an out-of-towner when I went last week (the responsibilities of being a New Yorker!) and luckily we only had to wait 5 minutes!  It was also a Tuesday at 2:30pm.  \n\nBut waiting aside, the pizza is delicious.  I thought that the large would be too much for the two of us, but we gobbled it down.  I wish they served salad though.  Nothing fancy or anything but I love some salad with delicious thin-crust pizza.", "author": "Dana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "Great pizza, best I've ever had but no pizza is worth a 2 hour wait from the line to the first bite.", "author": "Jamie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-14", "description": "Everything I kept hearing about this historic place, made me wonder about several things.  Insane wait times, people disappointed, this is the best pie in NYC, etc.. etc.. Luckily for my arrival, there was NO line when I went, and I was seated immediatly and it was relatively busy, but nothing that too chaotic.  Is this the right place?!?!?!?\n\nThe menu is straightforward, cash only, but also fairly inexpensive.  The option for cheap carafs of wine and some Brooklyn brewery beer on the list makes it a nice addition.  The place is large, and has the standard, red and white checkered cloth tables.  The place is also crammed with tourists from everywhere and anywhere.\n\nWe figured if we were to judge the pizza, we would go for the basic.  Plain, cheese, mozzarella and perhaps some basil.  We ordered, had a drink, waited a little and it arrived.  The pizzas are either small or large, if you are dining for two get a small it is more than susbstantial.\n\nI am honestly going to say I don't know what I think about what I was tasting.  The dough was actually very bready, really unique.  Nothing was crisp or burnt.  However, I was expecting some flavor from the cheese, and it was rather bland.  Now Mozeralla is pretty neutral to begin with, but there wasn't much still going on here, the tomato sauce seemed almost ordinary.  It was still tasty without question but could they have thrown more than one or two measly basil leaves on the pie?  One slice seemed to find a stragler topping, it seemed to be pepperoni or perhaps Italian sauasage.  Grabbing a chomp away from my dining companion who doesn't like pepperoni, it was very nicely spiced, nothing like pepperoni or sausage toppings you find on commercial pizza at all.\n\nI am not convinced this is the best pizza to be had in the NYC area, and if I would have waited eons to get in to taste it I probably would have been really dissapointed.\n\nIt's probably only a once in a lifetime thing for me, so I am done.  If I could go in again with little effort, I would try another pie with more toppings.  But wait more than 5 - 10 minutes to get in?  I think there's plenty of other places worth trying so I wouldn't do that.", "author": "Ethan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-18", "description": "This was a tough one. I wanted to LOVE this place. After all, the ratings are amazing and the line is down the street. But..... I just didn't. The service was grotesque. I mean it was seriously awful. The place is filthy, like dust and dirt EVERYWHERE. Don't get me wrong, the pizza was good, but I've had tons better! The whole atmosphere of the place felt like the restaurant was doing us some huge favor just by existing. Where really, they should be grateful to their customers who have to wait in line 30 minutes and then make sure they have enough cash because they refuse to take credit cards. It's 2013, and you are super busy. They could afford to take cc. Anyways, it's a thing you should probably do once in your life while at the Brooklyn Bridge, but don't have crazy high expectations.", "author": "Ashley G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-14", "description": "My friend's 13 year old son saw something about Grimaldi's on TV, so when they visited NY, he wanted to go. I live in Brooklyn but had never tried it so I took them. \n\nWe went during late afternoon on a Friday, hoping there might be less of a wait than on the weekend. Upon arrival, we asked an employee inside how long the wait might be since we had an appointment later. He looked at the line and said 30 minutes. It ended up being one hour and fifteen, by which time of course, we were starving. \n\nMost frustrating was toward the end of our wait, they seemed to stop taking people inside completely for a good 20 minutes, yet people kept coming out. By the time they started bringing us in again, the place was close to empty! It turns out they do some sort of re-stoking of the ovens a little before 5PM so they can't talk orders until that's done. \n\nReally? How about respecting the people on line and A) Including that in your 30 minute estimate B) Coming outside and explaining this, since we don't know it until we sit down and see that notice on the menu, and C) Maybe pass around some nibbles of appetizers or SOMETHING to the folks outside who are providing free advertising by forming a line outside your shop? \n\nWelcome to NY folks, where when a business becomes hot, the customers are the last thing they worry about any more, and Grimaldi's has happily jumped on the bandwagon.\n\nOnce inside, we had a surly, nasty server who was apparently a manager as well. He was in no hurry to take our order as the room filled up and despite being one of the first ones seated in the room, visiting tables in order of arrival was an extremely low priority for him. As was moving faster than he does when he gets out of bed in the morning. \n\nWhen the pizza finally came, sure it was good. But at that point a cardboard box would have tasted good also - we were starving and pissed off and wanting to eat and get out of there. \n\nListen folks: There have been tons of brick oven pizza places in New York for decades, but for some reason this place generated some publicity which inspires tourists to trek out to an obscure corner of Brooklyn for it. Save the train fare and difficult to navigate walking route and go to one of the Manhattan establishments, whose pizza is just as good, and you might NOT get the surly service and \"we don't really need you\" attitude this places dishes up far more generously than the pizza. Grimaldi's pizza is good, but the service sucks and they have an attitude and eventually they'll see that reflected in their sales figures. Until then, Google \"brick oven pizza in New York\". Skip the Grimaldi's results and try some of these.\n\nhttp://www.sanmarzanonyc.com/\n\nhttp://ordergoodfellas.com/\n\nhttp://www.alfornopizzeria77.com/\n\nand the best of all\n\nhttp://www.johnsbrickovenpizza.com/", "author": "J B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-19", "description": "To be honest, I think the name is the only thing that carries this place. I have had much better pizza in Brooklyn. Don't waste your time waiting 20 minutes on the line for authentic Brooklyn pizza when there's much better options.", "author": "Russ H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-04", "description": "This place is only for tourists.  If you want real New York pizza you are better off grabbing a $1 slice than something from Grimaldi's.", "author": "James H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-28", "description": "Love the pizza here!! This is a must when you visit! You won't regret it. AND I think it's better than Lombardi's.\n\nMy first experience here was unlike most reviewers'. There was no line, no wait. My friends and I walked right in. How? Come on a cold cold winter evening around 4p. This place was empty, warm and cozy! Based on my first time here, my rating is solely based on the pizza and the great service. The pizza - perfectly, crispy thin crust, delicious sauce, and fresh fresh cheese! The manager here is always so attentive too - walking from table to table talking and joking around. \n\nI've come back here multiple times after this, and most days, there has been a wait. And I have learned that this place has been a bit inconsistent at times - our pizza has been slightly burnt before, our order has been messed up before, and we've ordered too many toppings before. From all this, I have learned to just stick with the margarita pizza here. It is to die for. \n\nIf you're visiting and aren't coming back any time soon, just stay in the long line and wait. It's worth it. If you live in Manhattan, come back in the winter.", "author": "Elaine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-28", "description": "Seems like they've moved to a bigger and better location. What hasn't changed is the line that stretches down the block! Waits can be anywhere up to an HOUR but the benefit of dining with only one other person is being able to skip ahead of the big groups. \n\nA large pizza is surprisingly reasonable at $18. \n\nOverall, I'd say it's only worth enjoying if you come when there aren't any lines, which isn't to say never.\n__\nApril '12 Health Score - B", "author": "Dennis L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-12", "description": "For my visit to NYC, I was determined to find some great NY pizza.  This was the spot.  \n\nThe pizza was just flavorful with every bite.  They use really, really fresh ingredients, they use liberal amounts of basil, and their cheese is delicious.   Their crust is pretty special too.  I enjoyed every bite.  \n\nMy friend and I finished a large between the two of us, but we probably would have been okay with a small pizza.  I ordered my pizza with sundried tomatoes, garlic, and pepperoni.  You probably don't need any of those ingredients....next time I'd just get a basic margherita.  I think the crust, tomato sauce, basil, and cheese are so flavorful, that you will be satisfied.\n\nThe wait is what everyone talks about.  We came 15 minutes prior to it opening on a thursday in July and there were about 8 people in line ahead of us.  But I hear that wait times can be upwards of an hour if you come at a busier time.   Plan ahead if possible, because this place is worth a stop.  It's located in DUMBO and it's within a few feet of the brooklyn and manhattan bridges. Eat your food, walk down water st for some awesome desserts, and take some great pictures of the bridges.  Great way to spend an afternoon!", "author": "Ken C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-05", "description": "Good pizza not the best l\u0026b Spumoni and difara  bk and new park pizza in queens top the list of best pizzas this isn't saucy or cheesy but tastes bttr to stay but it's cool if u wanna hangout under the Brooklyn bridge and get some pizza and enjoy the view", "author": "B L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-16", "description": "Pizza is at its best over here. You can really say that it is a great pizza just by tasting the cheese on it. It is cooked in an original fire oven and the crust is delicious. They accept only cash. It is a problem as people have to head out to the ATM before coming to the place. The wait queues are huge and usually it is easier to get tables for smaller parties. Weekends get really crowded at this place. It is a must eat place in NewYork.", "author": "Sree Sagar R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-18", "description": "High rated, so want to try. Long line, that's good sign. \nSat down \u0026 ran to bathroom that was beyond Dirty, it was disgusting \u0026 if that doesn't tell U about the cleanliness of the kitchen, nothing will. The ATM on 2nd \nFloor was broken \u0026 had to walk up to 3rd floor. Poor lighting \u0026 dangerous. Family of 6 walked up to 3rd floor because they were lost \u0026 no one took them to table on 2nd floor. I told them to be careful going down \u0026 showed them right way. My point is  How little they cared about customers in a number of ways. \nThe Food was at best, MEDIOCRE. \nNothing you couldn't get at any neighborhood average pizza parlor. HONEST!", "author": "Ron R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-15", "description": "My friends and I got there on Saturday morning a little before it opened and there was still a long line.  We only waited for about 30 minutes which wasn't bad and I don't think I would have waited for any longer.\n\nThe pizza was great.  We got one with onions and then another with pepperoni.  I enjoyed the one with pepperoni better b/c the sauce on this pizza is a bit sweet for my liking so the saltiness of the pepperoni counteracted the sweetness.  \n\nWe had a bottle of the red house wine which was delicious and offered us a pleasant alcohol buzz along with our pizza buzz.  The wine complemented the pizza very well.\n\nThis place is good, but I don't think it's \"wait in line for 1-2 hours\" good.  I mean if you have that sorta time and are really craving pizza then go for it.  I'm glad I got to try it, but wouldn't feel overwhelmed in going back if the line was too long.  There are plenty of pizza places that are just as good - especially in NY.", "author": "Serena T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-10", "description": "So there are a lot of things that change people's lives, and this happens to be one of those things that changed the lives of some New Yorkers I talked to. I figured I should try it, so a few friends and I ventured over. First of all, if you are able and strong enough, do cross the Brooklyn Bridge by foot. The view is amazing, the wind and sun are friendly, and do stay away from the bike lanes because they WILL run you over. \n\nThere was a lengthy line when we arrived, but I do think we didn't stay in line for longer than 1.5 hours. Considering that I've waited around this time in plenty of situations here in California, this was no biggie. Of course it didn't help that it was unbelievably hot and there's no shade. Oh and I was wearing black. And jeans. And a turtleneck. I am such an idiot sometimes. \n\nAnyway, we finally got in and it was very crowded. The restaurant is small, and everyone sits pretty close to each other. There were only about three waiters for the whole place, and our waiter was pretty crappy. We didn't even get our water until we were about 25 minutes in, and it felt like a lifetime before we even got our pizza. We ordered a large pizza with mushrooms, garlic and sausage. \n\nSo the million-dollar question: was it life-changing? No. It felt like a regular pizza for me. But this is an unfair question to ask me, because I think Pizza Hut can be heavenly as well. I would not go to Grimaldi's again though. The pizza was great, but I've already forgotten how it tasted.\n\nIf you want a slice of real New York pizza though, don't go here. Go to a corner in the city and get it from a cart. Those are just as good for me.", "author": "Caroline P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-13", "description": "Delicious:\nBest. Ever. Pizza. \n$18 for a large pie. \n\nNot Delicious:\nNothing.\n\nMiscellaneous:\nWent at 2pm on a Monday - no line.", "author": "Christopher O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-29", "description": "Grimaldi's is kind of a diva of a pizza place...it's kind of like housing in Santa Barbara, CA where you have an ocean view. Except the difference between Santa Barbara realtors  and Grimaldi's is that they won't rip you off for it (the prices are pretty fair), but what you won't get with your pie is a nice dining atmosphere. \n\nThe dining room is small, cramped, and unless you have a party of four or more, be ready to share a table with strangers. The walls are old and hang outdated, dusty pictures. If you're the unfortunate soul to sit next to the kitchen, watch your head, you might get elbowed! \n\nThere's one bathroom and you better wait next to the door because otherwise you'll be holding it for a long time and while you're waiting expect to be poked and prodded by the staff because you're in their way. \n\nI didn't believe that the line was outrageously long to place an order (to and in house dining is the same line) until I saw the sign next door to rent a chair for $3 with a $20 deposit. \n\nWhat I like about this place is that it's like a marriage...it works, so why put in the work to make sure its tip top and modern? The place is simple - cash only, no reservations, first come first serve. \n\nThe olives are kalamata and I was happy to see capers and anchovies on the menu.  Cheese is the base for most pies, sauces is topped off on the end. \n\nBring a sweater, it's worth the wait.", "author": "Kimberly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-19", "description": "Wow. Some of the best pizza I've ever had in my life. The crust is crispy on bottom and soft in the middle, balanced perfectly. Also I don't know what's in their cheese but it's not like any mozzarella I've ever tasted, it has an amazing flavor! Very fast and friendly service as well. I'll definitely be back. Also they only accept cash.", "author": "Erhan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-22", "description": "The staff are super friendly. I was waiting in line and could already smell their pizza from the outside. The crust was good and everything made fresh!", "author": "Shayya S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-21", "description": "I love the pizza, but waiting 1hr for it is beyond ridiculous. 30 mins outside and 20 inside and it's still not rdy. I'm typing from there as I look around there are tables filled with ppl...no food. Half the restaurant has ppl still waiting on food. Di fara's cooks way faster.", "author": "Lara B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}