{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "My traveling buddy from Australia was eager to try this upon reading rave reviews about this place. As we went during winter time, the wait wasn' t too bad compared to summer.\n\nSecondly, if you're grabbing takeaway, it's much quicker. Overall, I've had better pizza. But the secret is the ingredients and cheese that they used, were fresh with good quality ingredients. Also how they cook it in a charcoal oven. That's what makes it a pizza that can't be missed! \n\nService is efficient and quick, except for the long line to get to your table. Also, this place only accepts cash. Not unusual for a place that's been around for such a long time.", "author": "Jessica Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-11", "description": "Grimaldi's is good, but definitely overhyped. The way people were talking about it I was expecting the food to be life changing and it was just kind of blah. For me the main issue was the sauce which didn't have a very robust flavor and was a little too watery. Not too much flavor in the crust either, though it was nice and crisp. Probably wouldn't spend that much money for one of their pies again. You can definitely tell the ingredients they use are fresh though, so at least there's that.", "author": "Devin B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-20", "description": "How do I say this in a nice way? Grimaldi's is that place that was oh so delicious the first time you went and you keep going back to it trying to chase that high but it's never quite as good as the first time. The pizza is okay, certainly better than your typical dollar slice, but it's not holy grail by any means. The cannoli is decent, but again, nothing to write home about. None of it is worth anything longer than a 15-minute wait in line, that's for sure. After I went the last time, I decided that I needed to take it off my list of must-go places I always recommend to friends visiting New York for the first time.", "author": "Tina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-19", "description": "Grimaldi's in Brooklyn is an experience like no other Grimaldi's. I've been to locations in Nevada, but it doesn't compare. Not only is the food on another level here, but the vibe is too! \n\nCash only, if you were wondering!\n\nFirst off, it's by the foot of the Brooklyn Bridge. The entrance is right on the corner. Depending on the time of day, there will be a line wrapped around the building. We happened to walk up before the rush. There was a guy with menus greeting us with a smile and brought us in to be seated. If you are a party of 2, please be prepared to share your table as they seat 4. This spot gets busy, so sharing your table comes with the territory. Most places in NY are like that. We got seated at a window seat, and a nice couple with a lot of camera equipment got seated with us. \n\nWe ordered our drinks and pizza. Within minutes, our order was on the table. The cheese is out of this world here. It stretches and stretches and then stretches. You run out of arm before you do stretchy, yummy cheese, The toppings were the freshest and the crust was completely wonderful. The slices are so big and thin (I LOVE NY STYLE PIZZA), you need to fold it to eat it right. Please put your knife and fork down. Consume this slice with respect!!\n\nAs we sat there talking about how much we were enjoying our vacation, there was a small line forming outside. Maybe 5 or so groups. We decided that it was time for the bill and to skedaddle. By the time we paid and walked out, the line was probably 40 people deep. Our timing was perfect!\n\nTil next time Brooklyn Grimaldi's!", "author": "Kris J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-17", "description": "Service never was the Grimaldi's strongest point but I never minded it - it was always part of experience and its ambience. But today it was too much - the way they treated us - two women (one of them my mother - elderly lady in her early 70s), and my 4 years old son was completely unacceptable!\n\nWe decided for a pizza to go but we were not sure if it was possible to get one. So, I went to ask a manager  in the entrance. I waited until he finished to chat with some ladies in a line. When the ladies got in, I asked if it's possible to buy pizza to go. He told me to go in a line and went inside. I waited for him again thinking that he didn't understand my question. My mother and son were exhausted, so we wouldn't have waited if they didn't sell pizzas to go. \nWhen he returned a guy in his early 30s (with a group of friends) approached him asking the same - to get pizza to go. The manager told him that he'd make an exception for him and explained in details whom he should asked for pizza inside.\n\nDuring this conversation the manager saw me standing next to the guy. When I told him that we wanted to get pizza to go as well, he repeated to go in a line. Then, my patience ended - he saw that we were two women, one of them in her 70s (I'm also in my 40s), with a 4-year boy, and he insisted us to wait in a line while he let young guys to buy pizza to go without waiting! It was outrageous and we left, of course. There are many other pizzerias, but I still puzzled what the manager wanted to prove behaving like this!?\n\nThe most pathetic part was that the manager was Italian, though elderly but with all his Mediterranean charm. If I hadn't known Italians, I might have thought that's a way Italians treat signoras e bambino... Or that is Grimandi's way?", "author": "Audra P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-19", "description": "I give it 3.5.\n\nReally good pizza place to go after you cross the Brooklyn bridge from Manhattan.  We ordered a small pizza and we were surprised at how big their small pizza is. \n\nWe put salami, mushrooms, olives and sausage in our pizza and it was amazing. The ingredients are so fresh and hot out of the oven. \n\nThe restaurant has a quaint vibe which I find it really appealing. However, I was a little disappointed with their service. The host was a little grumpy, they forgot one of our orders and the servers seem a little unenthusiastic about what they do. \n\nI would still recommend this place but I would not expect exceptional service.", "author": "Christian Darren B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-15", "description": "As a first time tourist traveling from Toronto to New York, I was always told \"New York Pizza's are the best, make sure to try one in Brooklyn\", so with that catch phrase built into my mind I walked into Grimaldi's (after waiting in a small line outside) with full excitement that I would be treated to the best pizza of my life! \n\nNow the pizza itself wasn't terrible, I actually fell in love with the cheese they used in there's, there was just something about it, but besides that the pizza was not the very best I've ever had before. I've actually had the pleasure of trying some amazing napoletana pizza back in Toronto and that still stands on a silver platter as the best I've ever had. \n\nSome things that also were a bit strange to me for being such a high traffic restaurant was that they only took cash, not sure why, but the owner really needs to re-look into that policy. It's the 21st century now, offer the ability for your customers to use plastic... I also would have liked the ability to put something else on my pizza besides chili or garlic flakes. I think offering chili oil would compliment the pizza's quite well personally. \n\nOverall I would consider going back to this restaurant, but most likely would do a bit more research next time to find another new location to try. I wasn't convinced this is the best that Brooklyn has to offer.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-19", "description": "Despite this place being quite famous, my boyfriend and I were seated within a 5 minute wait despite coming in at peak lunch time hours. We were seated quickly and served quickly as well. The waiters were friendly and helpful. The pizza was quite yummy! \n\nA downside is that prices are bit steep for what it is. Charging for each topping seems a little bit much. While I can appreciate that the place is a long standing institution, it seems a little excessive. Being a \"cash\" only place despite its great business is also quite annoying. When the waiters say \"don't worry, ATM machines are on every floor,\" they fail to mention the near $5 transaction fee for pulling cash out of the ATM. It also seems a little too convenient that the \"CASH ONLY\" signs are only visible when the guests enter.", "author": "Esther K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-30", "description": "My boyfriend's only wish for our whole New York trip was to try New York style pizza, New York based pizza, pizza, pizza, PIZZA! \n\nOn our last day, we came to Grimaldi's for breakfast! There was a line outside (as expected) but it went by pretty fast.  They fill up all the seats on the first level then they slowly fill up the second level. We got seated upstairs, nice view of the restaurant below. We ordered their meat lovers pizza and paired it with sodas. There was a perfect amount of cheese, not too greasy, the crust wasn't too dough-y, generous amount of meat. \n\nThe servers are quick, but I observed that some of them seem to make you feel they just want to rush your eating experience. The building has a lot of character and history, which I absolutely love! Their pizzas are made in coal brick ovens. The location is perfect too. While waiting or after you devour their pizza, you can explore Dumbo, take photos by the Brooklyn Bridge, or take the ferry over to Manhattan! There are soooo many things to do in this area.\n\nThey are CASH ONLY! I believe I saw an ATM machine on the first level in the back.", "author": "Steffi G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-18", "description": "I waited for an hour or so just to get inside and eat.\nGood thing we can see the beautiful Brooklyn Bridge while waiting.\nAlso thanks to the ice cream shop near this place.\nI expect a lot from this place for the waiting, but it turns out to be an okay pizza.\nThe pizzas are good but definitely not a WOW.", "author": "Candice L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-25", "description": "In a battle of flavor and dough quality, this spot beats it's neighbor hands down.  If service and ambiance are important to you, at the expense of the food, you may prefer another place.\n\nThis pizza was really good.  One of the better coal oven pizzas in NYC.  The sauce was ok, but the dough was excellent and that's what really matters.  I expected to be let down by this place, but that wasn't the case.  Often times in my pizza travels I'll visit a place that get's by on yesteryears reputation and the pizza is often average at best.  This place is actually turning out some decent product.\n\nI tried just one pie, a margherita with pepperoni.  The dough had flavor and texture and I found myself continuing to go back to eat more crust way past the point of feeling full.", "author": "Grandpie A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-31", "description": "First and LAST time there! Very poor service and the pizza wasn't that great AND our waiter was nowhere to be found 99% of the time! Two tables who sat after us were served their pizza before us, my husband had to ask another waiter where our pizza was because ours was chatting it up with another one like he was on his own personal time. The pizzas was ready but our useless waiter didn't bother to get them. One of the pizzas was wrong and we had to wait but that was fine because we were eating the warm one. Our useless waiter never came back to the table to ask us if we wanted additional drinks, check on the table or \"how is the food\". Another waiter asked us if we were done and packed our leftovers. I was so ready to go and asked the other waiter about our check, he told the useless one and he (useless waiter) pointed to the check on the counter...What? He couldn't even gives us the check so he got no tip. He was upset with my husband and actually had the audacity to ask about a tip. Hubby replied, \" We tip for good service \" then walked away. Useless started yelling but he didn't get a reaction from none of us but you can tell he wanted us to act ignorant like he was. Useless said before we left, \"I'll remember you\"...SO and Good because he is definitely imprinted in our minds as the \"Useless One\".", "author": "Bear S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "The pizza is great, the cannolis were great. This is not our first time at Grimaldi's, but since we don't live in NY it's been many years since visiting and we were not disappointed on this return trip. We made it a point to walk the bridge and eat here and it was everything we expected. Our service was good and pizza was just as we expected - crisp and tasty. We can't wait to come back!", "author": "Heather M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "First time here and it's well worth the wait. Good pizza and good service. If you are in NY make sure to make it to this place if you like pizza.", "author": "Bill And Karen S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-04", "description": "Took a little long. Brought our pizza to a different table. Not the best slice in NY but pretty decent.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "My boyfriend and I came here on a lovely Saturday evening after walking across the Brooklyn Bridge. We got there at around 6p and they were cleaning out their brick oven, meaning no pizza for an hour. I was expecting the line to be super long, but it wasn't! Turns out the line in the pizza place next door had a longer line that day. We went up to the hostess and asked if we could place an order for pick up later. She said yes, so we ordered for pick up at 8p and went rock climbing in the park nearby. When we got back to pick up the pizza, there's a sign outside that says \"SAME LINE FOR PICK UP\", so we lucked out on not having to wait in that line just to order pizza for pick up. \n\nIf it's not too hot outside and the line is too long for dine in, it's definitely recommended to order for pick up and eat at the park that's right next to the Shake Shack. \n\nThe pizza crust was amazing! I love how crispy it is (on the first few bites). We got a small pizza (6 big slices) with Italian sausage, onions, and mushrooms and couldn't finish them all. My boyfriend is a semi health freak, so kudos to him for coming out and eat pizza with me!!", "author": "ChingWa C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "Overrated, horrible service/staff and disgusting food. I came bc of the hype it has, however I dont think its worth it. There are better places. I was online with a friend for more than 45 mins. I went in, ordered a margarita pie, order came wrong. Second try it comes and I find hair!!!! HAIR. Ew, I look over to the kitchen. No hygiene whats so ever, all types of hair exposed (no hats, aprons, gloves). And I still had to pay for my pizza, how ridiculous. Waste of time and money, honestly you can find better spots on here for pizza!", "author": "E A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-22", "description": "The first time I came here was over 6 years ago at the old location. My most recent visit happened on an early Sunday afternoon with friends during our self-created pizza tour. \n \nBecause it was early and the new location is way more spacious, there was no waiting time to get a table.\n\nAmbience: New location is three floor and quite spacious. Crowd ranges from young to old including many tourists. If you sit near the glass on the second floor you are able to watch them make the pizza which is pretty cool.\n\nPizza: We had the margherita and just like the first time I had it, I was not impressed.  Maybe I should had gotten some toppings, but in the past I also had their white pizza and it was just ok.  It was good, but to me just not worth the hype.\n\nService: Nothing out of this world but not bad.", "author": "Rosemary V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-22", "description": "Yes this place may be a tourist trap and it trapped us. We waited in line for about 15 minutes while we waited we chatted with various people. Some said this is the best pizza some told us about other locations that were better for NY pizza. Since we were NY virgins we had to try this pizza. \nWe loved this pizza!! It was a thin crust pizza with the toppings we wanted and I must say... Our view of pizza will be changed forever. The fellow at the door was super friendly, the building was interesting and the pizza MMMMMM. I would recommend this location for a pizza. \nAll other pizza places near us pale in comparison to this place. \nBathrooms were clean service was soooo friendly. Go and judge for yourself.", "author": "Teresa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "I've had a lot of pizza in my life and Grimaldi's ranks up there with the best.  On my visit I got a pepperoni, sausage and basil pizza.  The tables were small, but the pizza was damn good. If you make your way to NYC head over to Brooklyn for a legit pizza.  \n\nA few tips:\n- Go early\n- Bring cash\n- Buy more than you need and always add basil.", "author": "Jonathan Z."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}