{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-06", "description": "THE BEST PIZZA THAT I'VE TASTED IN BROOKLYN!!! Me and my fiance went there for the 4th of July. We had a Large pizza with ham and wine. The pizza was fresh and hot. We almost finished the whole pie. The red house wine was nice and sweet. The waiters were very fast and provided GREAT service. The line was worth the wait! Me and my fiance are definitely coming back here on our dates.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-02", "description": "MR. GRIMALDI IS A PRICK!\nSo yes, the famed pizza is worth the 45 minute wait in line. But what about customer service?\nMy brother and I entered the restaurant- I was sporting an Obama '08 shirt, and he an \"I hated Bush before it was cool\" one- both purchased at the I Love Brooklyn street fair the day before.\nAfter not being helped to a table, we saw one for 2 available, so we went to go sit down. Suddenly an old man approaches my brother, telling him to get up. He asked my brother, \"Why are you wearing that shirt? You hate Bush?\" and we both answered \"Yes!\" \nMaybe due to mafia connections, Mr. Grimaldi was very defensive of the current administration, and he wanted us to leave, telling us this was a \"Bush county\". Are you kidding me?? this is Brooklyn! I wanted to yell back. Ask everyone eating your food what they think about Bush, and I wouldn't be surprised if most sided with my brother and I. \n \nWithout trying to offend him too much (he was actually quite intimidating) I told him this was an infringement on our right to free speech, which Bush tries to limit, but someone like Obama (pointing to my shirt) tries to salvage. I also told him how much I like his Pizza, and that is why we came, not to make a scene.\nAt this point he gave us one of the worst tables in the restaurant, and I not only felt discriminated against, and extremely uncomfortable, but I was afraid they might spit in our food or something.\n\nIn the end, the Pizza was ostensibly okay, but I think I am through with this place. There are plenty of places with amazing Pizza, where you don't have to worry about a possible hit put on your head....", "author": "Jessica T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-05", "description": "Grew up in jersey, moved to ny for school and then nyc to live for a few years.....had taken pizza for granted before i moved west for a couple of years......moved back to the city a couple years ago and have been checking out all the local neighborhood pizzeria's.....if i passed by a place i would grab a slice even if I had food already or was headed to dinner somewhere......all about pizza.\n\nFinally made my way to Grimaldi's in bklyn late one rainy night when there was no crazy line........figured the place was overrated....had to be...especially since it is basically a chain nowadays with spots in texas in new mex?........can't speak for other places but as far as this one goes it DESERVES THE HYPE........pizza was perfect....so good I had to go back the next day and get another pie (live UES -thx zipcar).....wow.  I say it is tied with my favorite spot in Pennington NJ - Vitos which makes a square Brooklyn Style pizza in honor of I'm guessing grimalidi's.  Try this pizza.\n\nAlso very cool atmosphere.....not hipster or anything....just real.  when i went there were no tourists so i don't know about prime time.....", "author": "Tony S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-29", "description": "Old-school Brooklyn pizzeria in Dumbo. Get ready to wait though, because this place is super popular. I always bring out of town guests here - you have the Brooklyn Bridge, the Promenade, Jacques Torres down the street....what more could you ask for? The crust is perfect - chewy, thin, never greasy. The ambience is down-home Brooklyn and always authentic!", "author": "Christy V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-07", "description": "Anyone else not impressed by Grimaldi's? My first dining experience at Grimaldi's, I was just glad to have walked in from the blistering cold. No line, no wait. The pizza was all right... bland, nothing special. Frequented again today and waited about 30 minutes in line. Again, nothing special. I like that they use fresh ingredients, but I prefer my pizza to be more flavorful. However, the crust was good enough for me to eat, for someone who doesn't usually eat crust. I'll take Lucia's Pizza in Flushing over this any day.", "author": "M M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-20", "description": "We went here on a very cold Thursday night in December.  It was probably around 7:30 PM.  We did not have to wait to get seated (party of 2).  It wasn't what we expected in that you may have to share a table with other people.  Not a big deal just not something we had never experienced.  As another reviewer mentioned, you kind of have to catch a waitperson's eye to get your order taken.  Once our order was taken the pizza was ready in less than 10 minutes.  It was very good.  I'm glad I didn't wait in a terribly long line though.  The pizza was very good but not \"wait in line for an hour\" good.  Of course most people don't go just for the food alone.  The staff was nice and it is definitely an experience you should try if you're from out of town.  Just plan your visit strategically to avoid the line. Cash Only!  No credit cards accepted.", "author": "Steve M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-02", "description": "Worth every second of the wait!    The best pizza I've had since I've been in NYC, which is why this place gets 5 stars.  Great sauce, basil, fresh toppings and an absolutely perfect crust.  . . .", "author": "Utaukwa A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-29", "description": "I have to agree with my dear friend Becca S. on her review of Grimaldi's.  I just don't believe that the consumables yielded at this restaurant are worth the 2 1/2 hour wait in line.\n\nI opted to go to Grimaldi's with my girlfriend and her cousin this past Sunday evening.  I arrived at Grimaldi's to be greeted by a line of approximately 110 waiting pedestrians (this was @ 7:46pm).  Although the patrons on the line were extremely friendly and talkative, the wait itself was unbearable.  Fortunately, Brooklyn Ice Cream Factory was a mere 250 feet await and thus was able to get some Ice Cream during this tumultuous wait.  The ice cream was fantastic,  but I'll save that for the actual Brooklyn Ice Cream Factory review!  \n\nSo...  At about 10:01pm, we were finally let into the restaurant and were seated at our table.  The decor of the restaurant can best be described as modest!  The ambiance itself resembled that of the Pizzeria owned by Charles' mother in Charles in Charge (80's sitcom).  The restaurant was decorated with various placed photographs of celebrity restaurant patrons.  Tables were furnished with old school red and white checkered table clothes, which added to the modest decor.  Although the individual wooden chairs were anything but sturdy, it did the job and definitely helped set the atmosphere.  Despite the overload of patrons cramped into the restaurant, the vibe of the restaurant felt comforting and low key.  This greatly aided in the dining experience.\n\nWe opted to order the 18\" large pie with Sausage, Ham, Sun Dried Tomatoes, and Mushrooms.  The Pizza was presented to us within 10 minutes of ordering.  At first glance, the steam generated by the finished product made the presentation of the Pizza even more appetizing than its reputation.  The phermonal smells generated by the heated Pizza will make even the most strict dieter's mouth water.\n\nThe Taste...  Truth be told, for waiting in excess of 2 hours in line, I would've expected more of Grimaldi's finished product.  At first bite, it was evident that the Pizza was overwhelmed by the surmounting amount of Fresh Mozzarella used in the application.  The contrast between the 1/4 cm crust vs. the 1/2 cm layer of Mozzarella distorted the texture of the crispy dough bedding.  Another item that was discovered at first consumption was that the sauce contained a watery texture that was also flavorless.  The sauce used in the application could've been reduced in a sauce pot further with the application of a salt, pepper, and parsley to add to the taste.  Although the ingredients used in the application provided the mild saltiness expected of a Pizza, the overall contrast from the bland sauce and inadequate amount of dough provided a disdain for what was highly anticipated with open arms.  After having consumed about 3 slices, it was deemed that the pizza failed to live up to its reputation.\n\nI left Grimaldi's wondering whether the homage paid to this establishment was well worth my 4 hours spent traveling, waiting, and dining at this establishment.  Although it was well worth the experience in having said I ate at Grimaldi's, the end result of having consumed Grimaldi's by product failed to live up to the reputation of being New York's Best Pizza.  I think I'll stick with the 5 minute drive and head to L \u0026 B Spumoni Gardens whenever I have a pizza kick.  At least the entire endeavor will only cost me about $2.25 a square, save $15 on gas money spent traveling, and about 3 1/2 hours of my time!!!", "author": "C M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "Wow so I finally gave in to all the hype and came here to eat after walking the Brooklyn bridge. With all the hype surrounding this place, I was hoping that the food would be able to live up to it's reputation. It didn't disappoint! The crust was perfectly toasted and the cheese tasted fresh and yummy. The only setback was the service which was mediocre at best. I didn't have to wait for a seat which was a plus but as soon as I sat down, a line formed. It's worth the wait people!", "author": "Kevin Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-12-06", "description": "After several failed attempts to eat here due to massive lines, we finally made it in with no wait (ridiculous cold weather helped).  The pizza is really good -- very thin (almost too thin; the ends droop a bit) but really tasty.  Not too pricey either.\n\nThey undercharged us by $20, and my friend pointed it out to them.  They increased the bill and didn't even say thank you for pointing it out, which struck me as a bit crap, but whatever.\n\nJoe's on Bleecker is better.", "author": "Joe Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-26", "description": "as others have mentioned, i expected more from this place.  our pizza was good but it wasn't great.  it wasn't the best i've ever eaten.  i loved the fresh mozzarella but the bottom of our pizza was burnt so it had that bitter burnt taste.  nothing i hate more than burnt pizza.  our server was good.  not overly friendly but not unavailable either.  i think i'll try other places for pizza in new york before i come back to this place.", "author": "Mojojojo Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-26", "description": "as a native Los Angeleno, I never thought i'd acquire the most serious tan of 2010 standing in a pizza-line in Brooklyn.  90 minutes in, i was convinced i myself had been in grimaldi's coal burning oven. word to the wise: wear sunblock. i'm serious.\n\nokay, so the pizza was delicious.  we ordered a large pie with extra basil.  when trying \"good pizza\" i don't believe in throwing a bunch of toppings on it until i know how i feel about the basic version.  and suffice it to say that grimalidi's did an excellent job.  easily top 5 of my life... probably top 3.   prepare for a long wait and a slight burning sensation if you go during daylight.  the service is hurried and the line sucks, but i'm a big believer that good things come to those who wait.  enjoy.", "author": "Brooklyn M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-09", "description": "How you feel about Grimaldi's depends on your NY pizza experience. If you're from out of town, and that can be anywhere from Westchester to the former West Berlin, go ahead. Tourists love long lines in obscure, picturesque neighborhoods. They love to find, at the business end of that line, tasty, authentic, inexpensive native food from the area they're visiting. Cash-only adds to the charm.\nSo, all you list-checkers, go, and you won't be disappointed. And I will do the same thing in Prague or Bucktown, and I'll feel like it was worth it.\nNow, in my real identity as a former New Yorker who grew up in Bay Ridge, Brooklyn, would I go back? Occasionally. Forget the scene, the tourists, the line, the fauxthenticity. The question is, what does it taste like? I am honest enough to admit two things:\n*Slices of mozzarrella, which Grimaldi's uses, are better than that mass of shredded stuff which forms a greasy blanket on too many Brooklyn neighborhood slices.\n*Brick oven makes a slightly crisper crust than standard NY pizza ovens.\nThe sauce? A little too simple for my taste, and the pizza could have used more. I loved the big slices of fresh basil they put on each slice of plain. A very nice touch. Service was better than I expected. Although the tables turn quickly, when they saw we were lingering, they did not push us out. Half carafe of house wine was drinkable, and the price is reasonable.", "author": "Anne B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-01", "description": "Leave it to the tourists.   I would never wait one hour in line for this Pizza.", "author": "fayza a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-01", "description": "Hands down best pizza in NY! The two of us stuffed our faces with all 6 pieces.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-18", "description": "Here are the facts nice and simple: \n\nPros:\n\nGreat Pizza, probably the best in NYC but I would have to try every Pizza joint in NY to make such a claim. I would say its one of the best Pizza's I have ever had. 5 Stars for the Pizza. \n\nCons: \n\nLong lines of people waiting to be seated. Expect to wait around 30 - 60 mins to be seated. \n\nSlow service, probably due to the amount of people that go there. But any time I went there I was never satisfied with the service. The wait staff is really not customer friendly. And I have been in the restaurant industry for a while and I have worked myself as a waiter and I know very well what good or bad service is. These waiters just don't seem to care at all. They better thank their lucky stars that this place has such a huge rep. and due to the amount of people that go there they probably make some decent tips, cause if these guys worked in my restaurant they would not last a day.  \n\nOwner and waiters rush to get you out the door once you have finished your Pizza. And God forbid you order a coffee or an espresso (which really sucks by the way) they are just gonna tell you straight up: Finish your damn coffee and go!! ( This was told to me by the owner the last time I went there). I'd understand if I knew the guy or if he was joking but he said it with the most serious intentions ever. \n\nPersonally if I wanna go to a place that claims to have the best Pizza in NY the least I expect is to enjoy my time there, relax and not get rushed. But that is not the case here. \n\nAnd this has been my experience any time I go to Grimaldi's. I am giving it 3 Stars just cause of the good Pizza served in this place, otherwise it would get 1 star for everything else.", "author": "Ari S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-28", "description": "With a reputation as one of the top pizzas in New York--and, therefore, the world--Grimaldi's enticed us to brave the 35 degree walk across the Brooklyn Bridge and into the Heights.  70 minutes in line later, our family of four ordered three large pies and an antipasto and finished everything.  If you go hungry, order big.  The famous crushed tomato sauce is all it's cracked up to be, but can't compete with the flavors of charcoal and salt in the crust.  The fresh mozzarella was a bit rubbery.  Other ingredients, including the thick slices of pepperoni, were top flight, but, overall, Patsy's and Lombardi's are both better choices to represent America on the world stage of great pizza.", "author": "Patrick G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-14", "description": "Solid pizza and a solid experience. Is it the best pizza in NY? Hell no! You will be disappointed if you waited too long in line for it. But that being said, I am glad I have tried it at least once in my life.  The service is excellent and the pizza looks amazing. This is certainly not dominos pizza....", "author": "Hudson K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-17", "description": "The first time I went to Grimaldi's, it was early on a Monday night in January. There was no wait at 6:30 p.m. and the restaurant was virtually empty. The pizza was delicious and we were so happy that we'd made the trek over the Brooklyn Bridge for this pizza that we'd heard such great things about!\n\nThe second time was a warm Saturday evening in May. The line snaked down the block. I thought to myself, \"Was this pizza really so good that I'm willing to wait in this line to eat it again?\" But my parents were with me and we'd already walked across the bridge, so we just decided to wait in the line, which, surprisingly, moved quickly. We waited less than an hour to be seated.\n\nAnd the answer to my question was \"Yes.\" \n\nThis pizza is ridiculously delicious. By far, the best I've ever had. \n\nI live in D.C. now and miss it so much.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-20", "description": "I  LOVE PIZZA so we ate at was Grimaldi's under the Brooklyn Bridge. What makes these pizza so special is that it's cooked in a coal brick oven. They don't serve pizza by the slice so you have to order a whole pie and choose the ingredients you like. The pizzas are made with fresh slices of mozzarella cheese and the black olives here are whole olives and have that bitter salty taste to it that you don't see at other pizza places. The wait to eat just to get into the restaurant on average is 60 minutes to 90 minutes as the line usually stretches a half-a-block long. Once inside and after ordering you have to wait another 20 to 30 minutes for the pizza to cook. So you definitely build up an appetite once the pizza is ready to serve. You do taste difference with the pizza cooked in coal brick oven. The dough is chewy and it has a hint of that coal taste to it. One thing you have to be aware of it is that you have to eat the pizza while it's hot otherwise the pizza dough will no longer taste good as it's gets cold and chewy.", "author": "Darvish B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}