{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-20", "description": "This is a great place to take a date. Why you might ask? I usually get a take out pizza here and then go down to the water front to eat it. Right after the pizza, the Brooklyn Ice Cream Factory hits the desert spot. there is great scenery. But all in all, the pizza is fantabulous. \n\nOnly problem I had was the being seated or waiting to take out is a bit of a wait.", "author": "Kyle M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-23", "description": "I've eaten pizza in almost every city I've visited and I still don't understand what the fuss is about NY pizza even though I spent my entire childhood here.  Is there supposed to be a magic oven?  Yea, it has good toppings.  Yea, it's thin sliced (which you may or may not like).   But what am I supposed to be tasting that I could not experience at any other gourmet pizza restaurant?  \n\nNonetheless, the vibe at the restaurant is unique, as Grimaldi himself was there speaking non-coherent English to me as I sat down.  It's also nice that you get to choose your own ensemble of toppings.\n\nFYI: BRING YOUR CASH!! They don't accept credit cards.", "author": "John P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-13", "description": "Stumbled into this place on the way to the Brooklyn Bridge.  As we were walking by we noticed the long line waiting outside, and a mafia-looking old man (complete with white hair and black turtleneck) signaling the next ppl in line to come in.  \"Must be good\", we thought, and off we went to the bridge to take some pictures.  We came back later, and decided the wait must be worth it.  The ppl standing behind us in line mentioned that the the line that day was actually not that long, that in the summer time, the line goes around the corner, so it should only be about 30 mins, but that it's worth it since it's \"the best pizza in NY\".  Thanks to the big clock in the building across the street, we kept track of the wait time.  40 mins later, we were at the front of the line, not bad.  Except that the mafia man kept skipping the tables-for-2 for larger groups.  So 55 mins later, we finally got sat in a large table for 8, sandwiched between a party of 4 and another party of 2. \n\nWe ordered a \"small\" pizza after browsing around and noticing everyone seems to have ordered a \"large\" that seems way too big.  Turns out, the \"small\" here is like a \"large\" in other places.  The thin crust was delish, perfectly toasted.  The pizza had a lot of flavor.  We noticed that most ppl just ordered the plain regular (tomato, mozzarella, basil) without adding toppings.  We later found out that would have been better, as it's flavorful enough as is.  Surprising to us, we actually finished the whole pizza. \n\nService is OK.  They took our order quickly and the pizza came a few minutes later.  The waiters didn't seem particularly friendly, just busy.  The mafia man seemed to be the owner, and though he seemed scary, he was friendly towards kids and occasionally dropped by some tables to greet patrons.  We were wondering what the long line next to the pizza-making area was for, as everyone seemed to just be watching pizzas tossed and made, and ppl were barely moving.  Turns out, it was the bathroom line as they only have one.  Best pizza in NY?  Can't tell, since we're not locals so we can't compare.  But it was great tasting overall.", "author": "Maria K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-22", "description": "Please avoid this place. There is no reason to pay money for a place that treat you like you are only a dollar to them. We waited in line for more than one hour because we had a baby. The guy in the entrance decided that because we have a baby we must have a high chair(although we didn't need one since the baby was a sleep). He let so many couples who were behind us on line to enter ahead of us just because we \"needed\" a chair and they didn't. Then, we went inside  to another waiting area just to realize that there plenty of high chairs waiting there. Then, the guy told us to wait inside and thar he will call,  just to being ignored again for 20 minutes. Finally, we got a table, but was ignored for more than 20 minutes before someone came to give us water and to take the reservation. At this point, it's was after 10pm Sunday after the rush hour and still there was he service. We complained to the supervisor on the 2nd floor about the service and the guy fron fhe entrence and he told us and that the guy in the entrance is confused and not good for the job anymore and that they feel sorry for him and that's why he is still there. Seriously, this is an answer we received. Obviously, this place don't care about you as a client since this is the worst explanation ever. The Pizza was ok, nothing to tell about. Bottom line, there are so many good places in NYC, so why go to a place that hate kids, only care about your money and treating you really bad? Very disappointeing!!!", "author": "The R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-24", "description": "As I had feared before waiting in line for one hour, there is a disproportionate amount of hype that surrounds Grimaldi's.  Yeah, it's tasty, but I was expecting delicious, mouth orgasm pizza.  I've had much better pizza elsewhere; particularly at pizzerias that I did not wait one hour to be seated.\n\nThe pizza has paper-thin crust, which is not my first choice and comes with ZERO toppings, except for a small amount of cheese.  The mozzarella is sparingly placed on the crust in thin slices.  Grimaldi's lost major points here, since I would have had to order extra cheese just  to have a reasonable amount.  Because of this cheese dearth the toppings were not affixed to the pizza and often slid off when I picked it up for consumption.  Also, the crust on three of the slices was too burnt - and I like it a little on the burnt side.\n\nThe antipasti is the redeeming quality here.  It was fresh and delicious.  There was a crusty sliced bread with thick slices of mozzarella, salami and roasted red peppers.  No complaints about that.\n\nJust like Pinks (the hot dog stand in LA) Grimaldi's has an intransigent fan base that fully endorses their overrated product.  I would only condone eating here if you can get seated in less than 15 minutes, and even that seems too long for the quality.  Try it, but don't expect too much and know what you're getting yourself into.", "author": "Rafael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-19", "description": "Grimaldi's is great!  The experience of walking over the Brooklyn Bridge and eating pizza is a necessity when visiting NYC.  You have to line up outside on the side walk.  The line can get long quick so make sure you get their early or be prepared to wait.  Don't plan on a quiet dinner as you the tables are very close together.  Other parties will be just as close as your own, which in my opinion is great.  NYC definitely has a rich mix of cultures and you are bound to sit next to someone interesting.", "author": "Cooper G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-14", "description": "i live in brooklyn..i gotta try the grimaldi.\n\nsaturday 4pm - the owner said the waiting line was 20 mins. we end up waiting for 45mins. a next door gift shop rent a chair for those people who are waiting on the line. $3 per chair. LOL!\n\nthe pizza is very thin and tasty - which is similar to the pizza from lombardi in SOHO.\n\nI would never wait the line again to eat this pizza. However, now the brooklyn bridge park is opened - we will do \"TAKE OUT\" next time and eat at the park!\n\nwe order 2 pizza with 4 toppics total - paid about $45.\n\nFood - 4 stars\nService - 2.5 stars (they just want you to leave..what do you expect with the people line out side...)\nMood - just very very casula non-fancy place. pizza place! 2.5 stars", "author": "Grace C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-28", "description": "The owner...i'm assuming since he stood around by the front door...sat us. His waiter...or son or nephew do to resemblance...was our server and he was slow and uncaring of his patrons. For the most part, he played around at the front and text on his phone...except while he standing around eating! After bring my friend and myself the wrong beer and totally forgetting my wife's coke, he was weird and entered the creeper zone after over flirting with the two young women sat behind us. It was so crazy how many times he told them how beautiful they were in his pseudo italian voice. Ive been all over Italy and he isn't quite the real deal. He then tried to over sell  the house wine...' You've heard of bordeaux. It similar to that' assuming that no one knows that that is not a type of wine but a place where wine comes from. Gimmick!!! It sounds fancy but anyone can get an expensive bottle or a bottle for less than $15 at almost any liquor store! As far as the pizza...it was mediocre...i'm not saying that its bad but its average. Its not special! Go to John's by Time Square for a better experience or grab a local pizza place if your looking to equate to Geraldi's. location 4/5...pizza 3/5...service 1/5...experience 1/5...waste of time 5/5...unless you live in Dumbo...don't waste your time on the travel!!!", "author": "Jonathan E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-07", "description": "I have been here a couple of times-the long lines and rude boss( I assume) yelling away at people on the line haven't stopped me ever from bringing in family or friends who want a bite at \"Brooklyn\" style pizza. But the last time I went there might literally be the last. We asked specifically for a vegetarian( mushroom, onions and olives) pizza and instead got a pizza with everything we asked for and MORE.. They happily decided to add in anchovies and not tell us... And when we figured out from the \"weird\"  taste and brought it up with the waiter, he matter of factly said they would replace it.. No apologies nothing.. I was appalled at their behavior and the fact that they showed no remorse. If any of us had had a food allergy and they made such a mistake it would have been a lot worse! We all make errors and I understand that but being so nonchalant about it is just disrespectful. Sorry Grimaldi's you have gotten too big for your shoes!", "author": "Preethi B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-07", "description": "Grimaldi's pizza is the best! The delicate and crunchy thin crust, the fresh ingredients and very little oil really make it oh-so scrumptious. The food is superb. Now, if I was running things there would be several aspects of Grimaldi's Brooklyn that I would change. First, the decor. Yeah I get it, the place has a rich history. That's great and with all the money they make they should be able to update the decor and make it PRETTIER while keeping all the memorabilia. It's very...plain and old. During the warmer months especially the lines get quite long. I went here for the third time a few weeks ago, and a friend of mine and I still had to wait about 40 minutes. So, all in all, Grimaldi's is the kind of place you have to try at least once in your life.", "author": "Valerie I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-27", "description": "We waited in line for an hour to taste Grimaldi's famous pizza. Their \"crack sauce\" should only be referred to as such, because no sober person could possibly find this flavorful. The crust is soggy and the servers are rude. I'll stick to Pizza Hut, thank you.", "author": "Tina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-06", "description": "Unreal pizza \u0026 salads\n\nThe best ever, we loved it\n\nThe place smells like no other restaurant thanks to the coal fired oven\n\nTHANX", "author": "S. B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-06", "description": "In a city/state/borough seemingly populated by as many pizzerias as people, Grimaldi's serves fresh pizza ingredients...and fresh hosts.  \n\nI waited on line with the significant other for over an hour.  I didn't care at the time, since Grimaldi's popularity (and hype) precedes itself.\n\nWhen I finally got in front of the line, the host -- an elderly man sporting a black shirt and pants, black fedora, and white suspenders a la Billie Jean -- began flashing numbers with his hands like he was some crazed stock broker at the NYSE...except at the line of waiting people.  At first, I couldn't  tell who he was pointing out, as people quickly scrambled inside like they were panic-stricken cattle.  I saw him give me (or maybe the people in front or behind me) a peace sign.  When I hesitated, he screamed, \"What does this look like?!!? Am I holding up 2 fingers or what?!!!?  \n\nWhen I grabbed my s.o. to run inside, he yelled after us, \"You're killing me here!!!!\"  \n\nMaybe he was angry that it was no longer the 1980s.  \n\nThe servers were alright.  Pizza came out fairly quickly, although I don't usually enjoy eating burnt, black crust on my pizza.  Like I said, the ingredients were fresh, but it was nothing special.  \n\nIn summation: mediocre/decent pizza, but sh*t service.  If you want to eat good pizza, skip Grimaldi's.  There are literally hundreds of other (better) substitutes.", "author": "Jay C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-09", "description": "Although Grimaldi's is known for it's tasty Brooklyn style pizza, I came here to rave its service. The host/manager/maitre d  dude (old dude with glasses) was extremely attentive to the customers inside the restaurant but especially to those waiting on line outside. I was outside in 85-90 degree weather  in the sun and he moved the line so everyone could be in the shade and even brought out more cups for water. Food good, service amazing!!", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-23", "description": "BEST PIZZA I'VE EVER EATTEN, hands down. Yes, I've been to Italy for the absolute authentic grub, and I grew up eating all kinds of pizza, from gourmet restaurants to $0.99 pizzas I found at my local grocery store freezer when I was ballin' on a budget during undergrad.  Upon my first bite at Grimaldi's, I was highly impressed, and by the time I finished off the crust on my first slice, all other pizzas were wiped clean from my memory.  \n\nThis place first came to my attention when I saw a friend post a pic of it on her Facebook status.  Even with a blurry cell phone pic, I asked her \"What the? Where the? How the? That looks hella goooood!\"  I knew this had to be a place to check out.\n\nFirst time I went was a weekday around 1:30pm or so.  The line was around a 35min wait, which is reasonable from what I've experienced on future visits.  The only bad thing was standing in the heat.  NYC's heat wave was nipping at our heels this particular week, and we were all suffering.  To relieve us the friendly hostess scooted the line up as much as possible as to efficiently use the shade from the tree, haha.  The novelty shop next door lets you rent chairs if you really can't stand up any longer, and here's a tip: it's well conditioned in there so rotate shifts with whoever you are with so you don't get heat stroke!\n\nFinally getting our name called, I walked into a large room with the walls adorned with badges of honor that any prestigious NYC restaurant has earned.  This usually consists of certificates of recognition from Zagat or CitySearch, and of course, signed photos with celebrities who've visited.  If you're going with only one person, as I did on my first and second visit, you're seated across from your eating partner, sitting right next to other people who are also sitting across from their friends.  It's close enough to be considered elbow to elbow by some people, but as a 6'0 male, I was still pretty comfortable. It actually adds a nice intimacy to the experience.  I started chatting to the lady next to me who was from Texas with her son.  A new friend who I'll never speak to or see again! But if you get too excited after taking your first bite, you can easily knock over your neighbor's pizza.  On my other visit, I came with two others, so we were sat along the wall where other groups of 3 or larger are placed. \n \nI looked at the menu ahead of time, and my brother and I decided that if we were to wait this long for a pizza, we might as well order the big shebang.  From the wise words of Redman, \"If you're going to be a monkey, be a gorilla.\" And that we were.  We ordered the large, and pretty much ordered half the toppings menu.  We added Pepperoni, Sausage, Ham, Garlic, Olive, Onions, and Sun Dried Tomatoes.  After promptly taking our order, the pizza came out quite fast.  Coming out fresh, and not too hot, it was ready to be eaten ASAP.  I love thin crust pizzas, and this slice fit the bill.  You can use the fork and knife to eat those first few bites, because with that many toppings, the slice is bound to flop over.  But this is easily handled by folding the slice as other natives do.  The toppings are fresh and delicious and the cheese has melted perfectly as shown by the drapes of cheese that connect the slice to the rest of the pie as you place it on your plate.  The crust is the best part.  There definitely is something in the NYC water b/c the crust was thin, crispy on the outside, but somehow maintained a chewy, moist inside.  Best pizza crust I've ever had! I love how the cheese and toppings don't slide off the crust as well. Bite after bite, I couldn't stop, and neither could my brother.\nI thought that a large and all those toppings would be enough to have a slice or two leftover to give to my girlfriend, but we polished that pan off mad quickly.  Loved this place so much I came back one a week for the next 3 weeks.  \n\nOn the proceeding visits, I eased up on the toppings and it actually tasted even better since my taste buds were not overwhelmed.  My only gripe(very very minor!) was how salty the olives were.  My brother is a huge olive/artichoke type of person and he too said these were too salty.  \n\nThis place is legit.  It's set a bar (a very high one) for all pizzas to be eaten from here on out.", "author": "Ry V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-12", "description": "It's good pizza but not worth the hour or so wait.  It's a little overrated in my opinion.", "author": "Mike F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-25", "description": "who are all these people giving the plethora of stars?  famine victims?  post-operative taste-bud-ilectomy patients? paid spokespeople?  \n\nyou get to wait a long time exposed to the elements.  you must solve 7 riddles posed by the ogre before entering the portal.  then you must survive the torture ritual of sticking to the table and the floor.  \n\nall for what, you ask?\n\na total sog-fest of a pie.  how dough can be shoveled into the fiery depths of hades and emerge soaking wet is a total mystery to me.  i think this place is just in such a rush to rotate suckers in and out that they don't bother to cook the pie.  they don't even bother to fake it either.  they know enough people will rave anyway, rather than admit they got screwed waiting an hour for a tray of mush.\n\ngo somewhere, anywhere, else.", "author": "donna s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-15", "description": "Yummmmmm!!! This place has some of the best pizza in Brooklyn. Astonishing view as well, just by the Brooklyn Bridge;)", "author": "Greg F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-02", "description": "The pizza was delicious. I didn't appreciate the long line, the 45 minute wait for the pizza, and the expired diet coke. The price is acceptable. Give this place a try but don't set high expectations.", "author": "Benjamin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-22", "description": "finally made it to the new location a few weeks ago after several experiences at the old one. the psychosomatic effect of not having to wait in line made the pizza better than ever. (disclaimer; since the days of waiting outside i have abolished waiting for food in nyc, this is not russia in the 80's and most of the time its not worth it so i have stopped.) service is still gruff at best and the menu is the exact same size i'm pretty sure, but if you do one thing really well its probably worth more than doing many things poorly. anyway, great simple, classic brick oven pizza, rivals any in the city in my opinion.", "author": "John B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}