{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-16", "description": "I feel like I may get ripped apart for saying this, but I honestly think that Grimaldi's Pizza is... just okay. Maybe it was the insane hype. Maybe it was the insane wait. Maybe I'm insane because I don't really love pizza as much as I probably should. But after I took that first bite, I vividly remember thinking to myself: \"Hmm... not bad. Pretty good. Not worth the wait.\"\n\nIt was Saturday @ 4pm and the wait was almost an hour and a half. The worst part is that you're standing in line the entire time -- it's not like you can go grab some ice cream and come back in time for your name to be called. The line is filled with two kinds of people: (1) Grimaldi's virgins who are skeptical that this pizza could be THAT delicious to warrant this kind of a wait, and (2) Grimaldi's veterans who are more than happy to zealously assure you that it is worth the wait. Try it out. Go in line and just casually say to your friend: \"Wow, I wonder if this pizza is really that good.\" I bet you that within a few seconds, somebody will turn around (typically a fat guy wearing a Yankees cap) and enthusiastically proclaim: \"Oh yeah, it really is!\" Thanks fat Yankee fan.\n\nAnyway, after an hour and a half, we finally get seated. 3 people squeezed into a small 2-seater. It's really funny how awesome the owner thinks he is -- I mean, granted he does have an uber-successful business, so I guess it's expected. He walks around in his stereotypical Italian track jacket with the largest smile in all of Brooklyn, making all of his underlings shamefully wear tacky Grimaldi's t-shirts written in a \"Godfather\" font. It's pretty awesome and hilarious at the same time, but for the wrong reasons.\n\nWe ordered a large pepperoni, mushroom, \u0026 onion, as well as a small sausage, roasted peppers, \u0026 sun-dried tomatoes. The pizzas come out hot and crispy, not too cheesy, and smelling great. I do notice a lot more charred crust than at most pizza joints, but that's up to you if you get turned-off by that or not. I don't.\n\nLike I said before, the pizza is good, but it's not \"close your eyes while chewing\" good. And especially not \"wait almost 2 hours in the blistering cold\" good. I mean, is it better than most pizzas I've had? Yeah, I could probably say that with a fair amount of certainty. But it definitely does not warrant the hype and frenzy that it has attracted. \n\nI am glad I got to try it at least once in my life. But honestly, there's really no need for a second round.", "author": "Roy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-17", "description": "I was disappointed. Line was outta control so I was expecting something GREAT! Once we were inside the pizza came quickly but it was nothing exciting. Cheese was nasty, crust slightly burnt and the sauce had no redeeming qualities. There has to be better New York pizza out there.", "author": "Janean K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-28", "description": "Went with a group of girlfriends in December.  They were not busy and we were not greeted warmly.  We had to ask to be waited on.  We had to get up and ask for everything...including our menu.  Our server was more interested in talking to his co-worker than helping us.  Our Pizza was awful!!  The crust was dry and hard and it just didn't have any flavor.  I will never go back. Bad experience and a huge disappointment!!  Don't waist your time or money!!", "author": "Captain A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-14", "description": "Call me what you like, a hater, a nay sayer....First time I went to Grimaldi's was about 15 years ago, it was amazing....on my most recent visit, about 3 months ago - the product is seriously not what it used to be.\n\nYes I think they have a good pizza, best in brooklyn FAR FROM IT\nit's simply not what it used to be....but my word wont affect the lines, or their success - people will still follow the reputation", "author": "Rich C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "I visited Grimaldi's with a friend of mine almost a year ago. We had to wait for about an hour to get seated but the pizza was definitely worth the wait! The best I ever tried!", "author": "Iryna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "The pizza here we great as advertised.  The servers were a little rude and service wasn't that great.  However, I would come again just for the pizza.", "author": "Migs U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-23", "description": "I have never been more infuriated with a wait staff!! I hated this place. absolutely hated. I came here with two friends on a weekday for dinner. I saw this place had over 2,000 reviews and four stars and thought \"wow, this place must be crazy good.\" WRONG. SO WRONG. \n\nWe were able to be seated right away which was great, except we were stuck in a tiny corner and it was like doing a triathlon trying to make it to our seats. They smoosh all the tables together so you're essentially dining with the people sitting next to you.\n\nThey don't have any specialty pizzas which is a bummer. We got a large pizza with sundried tomatoes and extra garlic. The cheese on the pizza was really chewy and not good. I also wanted parmesan cheese, so I asked a waiter to bring some. He said ok. 5 minutes later. Still no cheese. I called over the owner and asked for some cheese. 5 min later. still no cheese. I called over our actual waiter. 5 min later. FINALLY. GLORIOUS CHEESE. By that time the pizza was really cold and now covered in parmesan cheese.\n\nFinally, (this is the part that really pissed me off) we got our check and one friend didn't have cash so she paid with her card and we just paid her with our cash. When our waiter came over he saw the credit card on the table and said \"cash only.\" and when we didn't immediately switch out the card for some cash he screamed at us \"CASH ONLY!!\" and clapped his hands in our faces to make sure we heard him.\n\nI have never met such a rude waitstaff before. NEVER RETURNING.", "author": "Maureen D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-04", "description": "I was warned through a friend about the wait but he added \"great pizza\" to that and it strengthened my will to wait in line along with what seemed like a hundred other people. The hardest part isn't standing in line but its smelling the pizza from the coal oven while you stand there. When you get closer you are teased even more by seeing the people eat their delicious pizza through the windows. I only waited an hour which wasn't bad, I've waiting longer for less before, so we were seated and waited about 15 minutes for our waiter to take our order and he dropped off some waters. We ordered their classic pizza topped off with some italian sausage for protein. The pizza come out and we devoured it in seconds. The crust was unbelievably awesome and the ingredients were just full of flavor. Their mozzarella cheese was different than any other I've tried but it complimented everything that it was holding onto. Grimaldi's is something everyone dropping by NYC has to try. Just hop on the subway and go to Grimaldi's!", "author": "Erwin E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-30", "description": "Not sure what's really going on between Grimaldi's, their neighbor, and the city, but we were again very disappointed to find that this iconic pizza restaurant was still waiting for a beer/wine license. Even great pizza taste flat and doughy without a good beer - and as much as they push it, the local brewed root beer just doesn't cut it.... hope you get that license soon.", "author": "Dennis F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-29", "description": "Not worth the wait in line. Decent Pizza, but has become to touristy with its fame.", "author": "David S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-21", "description": "New location, same great pizza! Everyone liked what they had here, I favored a vegetarian slice with mozzarella, tomato sauce, ricotta and mushrooms. It is close to the Brooklyn waterfront, very nice location and we got ice cream afterwards, too. My only gripe with Grimaldi's is that they don't offer even 1 single healthy option. I know that it is hard to have a bigger menu especially when you want to perfect just a few things and not devote time to others.... but someone in our party has high pressure and diabetes, Grimaldi's: if you can offer just 1 salad or low carb / low salt option I would be here much more often.... you still make the best pizza in NY, I look forward to taking my family here again!", "author": "Abigail M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-04", "description": "WAS IN LINE FOR LIKE AN HOUR! I felt like i was at Disneyland lining up for a new ride that just opened, holy moly...  good thing i had my laptop to kill some time on the sidewalk... and we also took turns chilling in line while the other took snapshots of the brooklyn bridge and such.   any how, the pizza was Good, but also not the best... definately wouldn't wait for an hour again, just did it since this was the hype and mentioned as a thing to do..so its checked off :)    Good Pizza!\n\nwhat we got?\nbrooklyn lager\nlarge pizza, half pepporoni half combination of toppings", "author": "Kenneth V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-24", "description": "After much hype, I had to come to the famous Grimaldi's in Brooklyn to try. There are many tips on how to approach this but if I had to give a quick 3 tip rule on the way to enjoy this place, this is what I would do:\n\n1) Make Sure the weather is Sunny and Awesome\n2) Walk the Brooklyn Bridge to get some exercise and outdoorsy Fun.\n3) Order To Go on the Phone as you walk over the Bridge, and then as you get there, go in and pick it up. Then take it down to the pier, sit on the grass and enjoy the Beauty and awesome weather! \n\nThat is my plan to avoiding the long lines as there will ALWAYS be long lines. 1 Hour plus is average is what I hear.I'm sure there may be other tricks/ideas to get passed the long lines, but this is how I would do it every single time. I can't pace up enjoying that outdoor space! I don't know if you can always just go straight in and pick it up but I think it should be able to. We had a friend already in who brought it out after he ate so we didn't wait that long. But the weather and location of that pizza parlor is just amazing. Had a great time outside on the grass, enjoying the view and company of my friends while rolling on the grass and laying out in the warm sun. Only regret was I didn't bring a football or frisbee! The pizza itself was above average. Made from scratch, thing, and had great flavor profile. We got the pepperoni which came with pepperoni, basil, a somewhat sweet tomato profile and some mozarella cheese. They definitely put it together by themselves as it had its own aesthetic, look and appeal which gives it their own character.  The pizza isn't going to be the best you ever had, but its still pretty darn good ; ) \n\nSUMMARY:\nFor great pizza, in a great location, with many things to do...this is the place to be.", "author": "Jimmy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-01", "description": "Great food and atmosphere. Stopped here yesterday to try a legendary slice. Got the pepperoni and sausage and thoroughly enjoyed every bite. Highly recommend a Brooklyn Lager to wash it down.", "author": "Judson R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-22", "description": "grimaldis, oh hot diggity damn, i stood out in the mf'in cold for 23 minutes but idgaf cause when i entered the establishment I automatically felt like a regal lord coming home to his 6 bitches after a long day hunting ducks. the pizza, however, tasted about as far away as I can possbily imagine from a raw duck. that shit was meltin in my mouth..... GARRGHHGH fuckin good ass pizza sauce was saucy and cheese was cheesy. The place has two floors and even tho I almost tripped and fell down the steps cause that lighting about as dark as teddi, i would fall down a flight of stairs for that pizza any day. place is 2 floors and i got to look out at all of the peasants on the street while i ate my wonderful meal which made me feel like a kingly king. i highly suggest visiting cause after ur taste buds will be whylin", "author": "Ilan A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-12", "description": "They were being racist. It was only our table and another. The other table came in later than us and they received their pizza first. They ordered more than us and we only ordered one. We had to wait a really long time, the waiters paid no attention to us and in the end, they gave us a cold pizza with little cheese, little tomato and the pizza was super thin. The table next to us had theirs all hot and freshly baked. You could see that their cheese melted but ours was cold and hard. Please do not discriminate your customers. I do not believe this is how a restaurant should be run.", "author": "Emily C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-23", "description": "I had low expectations of this place since it's so touristy, but the pizza was really incredible.  4 people shared two fresh, huge pies.  And we didn't have to wait very long at all.  Eat, and then walk it off across the Brooklyn Bridge!", "author": "Hannah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-30", "description": "I read the reviews, expected long lines, but still didn't expect the line that I saw! I was leaving after giving up when I decided to ask if there was seating for 1 at the bar since I was alone..and that worked. I ordered a pizza w/fresh garlic and a beer..it was pretty satisfying. I like how you can watch the guys work on the dough and make the pizzas by the window. I walked this meal off by making it across the Brooklyn Bridge..another great to-do list item!", "author": "Vaishali S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-30", "description": "The only thing good about Grimaldi's is I inadvertently skipped the line and walked to the back to order a pie. I had no idea I was supposed to wait in line for a pie and saved an hour by doing so. Boy am I glad I didn't wait in line. The pie was hardly worthy of the 10 minutes I did wait..\nI've been to all the supposed best places in Brooklyn, the Bronx...if there are any, Queens, Staten Island, Manhattan, LI and especially Connecticut where Pepe's, Modern Apizza and Sally's put Grimaldi's to shame. $15 for $2 or $3 worth of bland, tasteless ingredients. What a con they have going.", "author": "bob m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-25", "description": "The middle is soggy especially if you order a lot of toppings, but sauce is soo delicious.  And I love that instead of shredded cheese they use slabs of mozzarella.  I literally admired a chewy, drippy thick string of melted mozzarella before I devoured the bite.   Crust isn't so thin that it becomes a cracker (like many NY style pizzas) \n\nWe ordered 2 small pizzas for 4 of us (3 slices each) and they did not last 15 minutes!!!!  \n\nThe owner played accordion for the patrons.  Great atmosphere! Great pizza!!!", "author": "Kathleen B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}