{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-18", "description": "Not worth it if there's a long line full of tourist's, but the food is actually really good. The one in Dumbo is a nice place to take friends from out of town who want to feel like they're getting an \"authentic\" New York experience.", "author": "Carina F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-20", "description": "Its amazing... Its worth the wait once in a while if you can find a line that isn't around the block, but chances are you wont. However, go anyway... if its your first time you'll be blown away. Its just delicious. I consider myself a pizza expert/snob/connoisseur and I will not comment on whether or not its better than Lombardi's. They are both amazing. Both worth going to. I only leave out one start for the hassle it is to get to Brooklyn (although I've heard they opened a NYC location?) and the excessive line that almost unavoidable. \nWhatever it still rules.", "author": "Lindsay Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-17", "description": "My 2nd time visit, and they lived up to their rep. \n\nArrived shortly after they opened on a Sunday, about 45 minutes wait for party of 4, and the line moved quickly. Sat down and our pies arrived in bout 15minutes after. All pies are made fresh by your personalized toppings. Tasty brick oven, crisp thin crust just how NY pizza should be. We ordered one with pepperoni and Italian sausage, perfect for meat eater; another with mushroom and sun dried tomatoes, both are delicious topped with fresh basil. Afterall its down to their cheese and tomato sauce, any pies is amazing with or without the toppings\n\nThe waiters are friendly and the host went from table to table to greet and chat with the customer. \nThe space is cozy, so big party isnot suggested. So invite A friend or your love one to enjoy this local joint, then few walks away to the Brooklyn Ice Cream Factory, and you may enjoy the great view of Manhattan water front or take a walk through the Brooklyn Bridge.", "author": "David Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-17", "description": "This tourist trap has some ok pizza, but it's vastly overrated.  The crust is bland, the cheese is tasteless, the pepperoni is cut from the cheap pepperoni sticks, and the tomato sauce doesn't taste tomatoey--it tastes like a red, salty, pasty mess.  \n\nThe combination is definitely edible, but only because each of the ingredients mysteriously masks the deficiencies of the others.  Salt and texture can go a long way to making something mediocre taste better than it is, in other words.  Add that to the line and cash-only and you're better off looking for an alternative.  \n\nSpeaking of alternatives, let me recommend two:  1) Paulie Gee's (Greenpoint) and 2) Best Pizza (Williamsburg), both of which are relatively close to Grimaldi's, geographically.  The former serves Rome-inspired innovations which are absolutely delicious (may I recommend the Delboy, Monte Cristo, and Cherry Jones--though they're all amazing).  The latter is also definitely its own animal: Roman-like, but also serves thick-slice as well, both amazing.  But less known is that Best Pizza also serves probably the best meatball subs and chicken parms in the 5 boroughs (and I'm truly not kidding).  \n\nBoth of these institutions deserve much more fame than they presently possess and are infinitely better choices than Grimaldi's.", "author": "Justin D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-05", "description": "We went to this place based on recommendations from many friends.  We were told to expect a line out the door and an hour wait but when we arrived at 7:30PM on a Friday, the place was empty.  It was nice to get seated quickly but we were the only two people sitting upstairs.  The pizza was excellent, tasted great, nothing bad to say.  I got the cannoli for dessert and it was delicious, but when we left the restaurant there was this cute ice cream parlor under the bridge which I would do next time. I would go back definitely.", "author": "Lana M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-01", "description": "The pizza is delicious. It was done just right and I enjoyed every bite. I also ordered the Olde Brooklyn Root Beer, which came in the glass bottle. I kept the bottle as a souvenir since it has an image of the Brooklyn Bridge on it. There was a line outside the restaurant, but it was very organized and I did not have to wait too long for a group of three to get a table. The restaurant was very busy when I was there, but the service was fast. I highly recommend eating at Grimaldi's Pizza and then enjoying a walk over the Brooklyn Bridge after, which is what I did.", "author": "Sarah D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-10", "description": "This is one of the greatest PIZZA I have ever eaten.  Guys and Gals awesome you must try out.  And send your review.  I bet you would love it.  Just do IT.", "author": "Kazi H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "I was very skeptical about this place. After tasting jordanos pizza in chicago it is difficult to find better. Although not as good, it is definitely a must go when in new york. Fresh veggies and that touch of basil make the pizza one of a kind. MUST GO!", "author": "Gladys G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-21", "description": "From a tourist standpoint, I just have to give this place 5 stars.\nI was lucky to only have to wait about 20 minutes outside on a Sunday evening to be seated. I was only going to be in Brooklyn for 2 days and had to at least get a pie!! Luckily this place was only a few blocks from my hotel, and after the reputation I've heard about from Grimaldis's I couldn't pass it up. I had a wonderful experience. I ordered a regular pizza and shared with my husband over a few beers and some laughs. At first I didn't think we could tackle a whole pizza but somehow we made it work. There's just no pizza like NY pizza. Amidst all of the hype, this place is worth the trip and the wait. There wouldn't be such a line outside if the food wasn't worth it!! If I lived in the area I'd be ordering for take out all the time. Thanks Grimaldi's for upping the bar... now I just can't bring myself to eat any pizza out here in California.", "author": "Erin D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-07", "description": "Very delicious coal fired pizza. The line is no joke, but the pizza is crispy and flavorful! Bring cash as this place doesn't accept any plastic. If you happen to forget to bring cash, there is an ATM in the bar next door. Enjoy!", "author": "Chris K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-12", "description": "Not sure what the hype is about here but I thought it was just ok. Nothing too special and not really sure if it's even worth the wait. There is ALWAYS a line, I suggest going with no party bigger then 4. Pizza here tastes like any other nyc thin crusted pizza, but worth giving it a shot once.", "author": "Christine T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-21", "description": "Does my review even matter here? Does Grimaldi's REALLY need another fan??  \n\nI don't care! I LOVE IT!! \n\nI must say, I went into this pizza joint (after a nearly 45-minute wait on the sidewalk outside - on a summer day, no less) as a skeptic.  People rant and rave about this pizzeria all the time.  It's almost like I put off the taste test for 2 years because I was tired of hearing about it all the time!  But boy am I grateful for this taste test, as the pizza is more than another Brooklyn brick oven: It's real. It's tradition. It's New York.  \n\nAlso helps that you can get a cold Brooklyn Lager for $3.  : ) \n\nBrought my parents here and it was another Italian challenge (see my Luna Rossa review) that passed the test. We were lucky to have a big group who, after ordering lots of \"halves\", was able to taste a variety of different pizza and toppings.  My favorite are the olives - same flavor and quality that my own grandfather generously lays atop his homemade Molese focaccia.\n\nTop (and digest!) your meal with a walk across the Brooklyn bridge.  And be proud to be a New Yorker.  = )", "author": "Stephanie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-18", "description": "Great pizza. Absolutely not worth waiting in one of those insane weekend lines full of tourists. Go on a weekday.", "author": "Josue E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-02", "description": "Waited 2 hours to eat on disposable plates with disposable forks and knife it's a disappointment beyond belief!! This place is not the same. Even the menu is bad the selection is bad. My biggest mistake was thinking it's the same good place and not reading the reviews before coming. The host and older man is rude. Another older guy handled the waiting list he was a bit more personable. But clearly they have no communication. Service is worst. I will not recommend this place to anyone as I will not be coming back here either . It's a total waste of time and money.", "author": "M.C. G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-18", "description": "Got here 30 minutes before opening during Monday lunch, and was 2nd in line. The restaurant filled up immediately and promptly at 11:30am. I would definitely recommend doing this. We got seated next to the window, and looked out to see a very long line still waiting for their slice of this New York tradition. It's not the kind of place you can just stroll in and order a slice. A \"NO SLICES, CASH ONLY\" sign greets you at the door. I love making conversation with tourists and locals alike while enjoying a prime view of the pizza making process while in line for the bathroom.", "author": "Tuwie N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-23", "description": "Over Hyped? Not a chance - Best Pie in NYC\n\nThe Pros - Fresh, Simple and Delicious, Excellent Value, Family Legacy \nThe Disappointment - Be prepared to wait in a Standing Room Only line outside \nThe Details - As a well traveled \"eater\" I always make time to get across the Brooklyn bridge and visit this gem of an establishment whenever I'm in New York. These pies set the standard for thin crust pizza. Regardless if you are a \"deep dish\" person, thin crust or someplace in between do yourself a favor and get up to Brooklyn, you'll be greeted by the generational owner who holds court out front and ensures the growing line remains orderly efficiently processed. Once inside, be prepared for a simple menu and flurry of manual processes that have been employed the same way for going on 100 years.  Be sure to use the restroom, as it will require you to walk near the brick oven and open kitchen. Bring your cash, but don't fret you with great pies for under $20, it's a deal in pricey eats town. -now if only I could have a Grimaldi's and an Uno's in the same 24 hours... that would be culinary conundrum!", "author": "Eric D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-26", "description": "Simply one of the best pizza's in NYC. Coal fired oven can not be beat. The fresh ingredients really make a difference and the sauce was so simple and tasty. If you are ever in Brooklyn heights under the bridge check this place out you won't be sorry.", "author": "Michael H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-06", "description": "Any business that has the following signs in front of their restaurant:\n-NO Credit Cards\n-ONLY CASH\n-TAKE OUT WAIT IN LINE WITH EVERYONE ELSE\n\n...and the owner/host starts his welcome by:\n-'First off, close the damn door'\n\n....has an inherent structural problem. The problem is, it is too famous for its own good and has lost the humblness of service.\n\nSo back to the place:\n-Cheap, cheap pizza. \n-Is is good? Yes its good. Is it the best. Probably not. \n-My guess is that the mozzarella is local and not the best quality. Good quality mozzarella is milky and this one is not.\n\nIn the city of sheeps, following the herd and lining up outside a restaurant when its freezing cold, it is more a statement about New Yorkers than Grimaldi's.\n\nSo I would go for a good pizza, that cost half as much as everywere else. I would not go with the presumption of eating the best pizza in NYC.\n\nI will finish my review as follows. Better pizzas I have tried:\n-Franny's\n-Lucali\n-Keste\n-Olio e piu\n-Celeste\n-Emporio\n-Napoil 45", "author": "Daniele D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-03", "description": "If you come here, expect long wait time. I came here on a Sunday early afternoon and waited for over 40 minutes to get a table.\n\nFood: The pizza was pretty good. However, they didn't use a lot of toppings. The cheese was pretty good and fresh.\n\nInterior: They were playing Frank Sinatra and it was great. The place is definitely very cramped and not much room to move.\n\nI would most likely not come back because of the long wait time.", "author": "Janet L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-03", "description": "Good pizza, but was a little let down after hearing all the great reviews.", "author": "Lori S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}