{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-22", "description": "There is always a line at Grimaldi's, I went on weekdays for lunch on both occasions and had to wait for about 30-45mins.  The first time I had Grimaldi's I thought the pizza was phenomenal. Fresh mozzarella cheese right out of the coal brick oven served right to your table with toppings of your choice that range from $2-$4 per topping. The first bite is the best, on to the second and third, then you are so caught up trying to eat as much as you can before it turns cold that you forget why Grimaldi's is so good in the first place. Personally,  after my second visit I came to realize that Grimaldi's pizza was good but only lasted up to the 3rd bite then it loses it's yumminess, because the pizza turns cold so quickly that the mozzarella becomes a bit chewy. I would still recommend those who haven't try it to see for themselves, but in truth there are other pizzerias in NYC that are just as good if not better. \n\nWhile you are there, don't miss the Brooklyn ice cream factory for some desert,  and the beautiful view of the city and the Brooklyn bridge.", "author": "Kristy H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-15", "description": "Came here after the Yelp event last night and once again, it was a huge disappointment (although thankfully there was no line this time). It was still soggy and extremely salty. So much so that I couldn't eat part of it. Plus, the house red wine sucks. Boooo Grimaldi's, boooo. I'm bitter.", "author": "Mariana C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-08", "description": "grimaldi's is awesome, but if you're only going to go to one pizza place, go to lombardi's. unless you're more interested in location, in which case grimaldi's totally wins. \n\nalso, especially if you have people in town, the most lovely new york evening starts in manhattan, and then involves walking over the brooklyn bridge, eating amazing pizza at grimaldi's (although you will wait an incredibly long time and you will be kinda rushed through), then sauntering over to the brooklyn ice cream factory for an ice cream cone, sitting on the patio overlooking the river and the skyline, enjoying the scenery, and digesting the copious amounts of dairy you will now have in your system.", "author": "Jenny K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-22", "description": "best pizza every travel channel never lets me down the pizza is so fresh and the flavor is unreal it makes me never want to order take out pizza every again the beer was they gave was also delicious in Italian brewed beer very good\n\nvery long lines when we left the trick is to go right when they open theres no line at all first thing they open so plan it that way it a lot easier", "author": "Ryan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-07", "description": "if all pizzas were rated on the same scale of 1 - 10, Grimaldi's would be about a +8, and pizza hut/round table/dominos would be a -20.  little caesars would be about a -75.\n\nthere is nothing extraordinary about the combinations (you actually make your own), no flashy \"bbq garlic chicken with pepperoni and cheese stuffed in extra thick crust\" type of pies.  Grimaldi's is just an example of how using pure, fresh, quality ingredients and authentic cooking methods can produce some really good food.", "author": "stefanie h."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-20", "description": "the mystery is over(RATED) \nno i don't want to sound like a snob after all I can't personally make a better pizza....\n\nthis place gets 3.5 STARS\n\npizza was good, but I feel that Joe's is still my favorite minus the line, 1hr trip, and manages to sell by the slice  \n\nhowever, if you live in brooklyn or downtown manhattan it's a great choice for pizza hands down.  especially given the view of the city and both bridges (manhattan and brooklyn) while taking a stroll to work that pizza off.  \n\nbetween four girls we had two of the classic LG pies each at a shy $14.  our total bill worked out to $44 including tax and tip.  Not bad at all.  \n\nthe pizza sauce was good but the reason I like Joe's better is because their sauce is sweet and it's just a personal preference.  Anyways I don't regret the trip but it just won't be the first on my list of NY style pizza spots", "author": "Crista Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-01", "description": "Despite the wait, the pizza is really good. They turn your pizza around pretty quickly. It's a very no-frill dining experience that leaves you little to complain about.", "author": "Mindy Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-23", "description": "I like walking from the train to Grimald's. The Brooklyn bridge is beautiful and the pizza is pretty good. I personally order the large for myself... but I eat like 8 people. :) It is fresh ingredients and the brick oven has been there since it opened! MMMMmmmMMMm", "author": "Nie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-22", "description": "it's all about the cheese! i'm not quite sure what kind they use (while eating under the moonlight of the Brooklyn bridge, my friends argued their claims of ricotta, mozzarella, and various other cheeses to no avail), but i really think that's what makes the pizza. the dough is also tasty; i am usually a very picky crust eater, and i actually enjoyed the crust by itself. it was crunchy but not too thin and just downright delicious.\n\nwe ordered a pepperoni, olive, mushroom and it was divine. olives were a bit on the salty side, but that didn't stop us from eating two gigantic slices each. yummm pizza!", "author": "Joelle K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-09", "description": "my best pizza experience in NYC! been there 4 times and still can't get enough.\n\n-perfectly crispy crust, just the right amount of carbon on the bottom\n-FRESH basil and mozzarella (i've only had the margherita)\n-usually 1 hr. or more wait, but with a beautiful view of manhattan and the brooklyn bridge outside, it's a pleasant time. just bring some good company.\n-i have visited with many particular friends (+ my mother, who has perhaps the most discerning palate i know), and they all love this place.\n-yes, the atmosphere is cramped, but service is pretty quick by the time you get inside.\n-a can't miss on your NYC pizza travels! just make sure to bring cash.", "author": "Amanda A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-19", "description": "As far as pizza goes in NYC, Grims is pretty good. It isn't the best pizza the city has to offer, but it is by no means the worst, either. \n\nDuring a perfect dining experience here, you will only be slightly annoyed at their service. At worst, you will be seriously ticked. The lines are long and parties are often seated in a seemingly arbitrary order. The staff is rude and in serious need of an attitude check. The inside of the restaurant, should you make it this far, is dirty and cramped.\n\nAlthough the food is good, I'm not sure if that is enough to make a visit here a worthwhile endeavor. There are plenty of other pizzerias that bake a great pie without the stress.", "author": "Lawrence D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-14", "description": "Totally not worth the wait! Rude service and they do not accept credit cards. After 45 min waiting pizza was terrible. Don't believe the hype! Sincerely,  I never go there again.", "author": "Jason M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-06", "description": "Right off from Brooklyn Bridge, the pizzeria was really crowded when we went there. The pizza were super good if you like the thin crust types. You can also customize different toppings from the menu. Every single pizza is freshly hand-made when you order, and it doesn't take long for the order to come. The only bad thing was having too many people sitting close by and people constantly walking around.  It is a must-go place if you visit nyc and love pizza.", "author": "May C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-24", "description": "Best pizza in NYC... unless they are in a rush and it's slightly undercooked. The mozzarella cheese they use is superb. Waiting in line is not so bad on a nice day and the excitement building up as you near the gates of heaven is palpable.", "author": "Cenk S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-09", "description": "This place is awesome! and their pizza is to die for. All the haters need to stop bc there is a reason that this place has a line out the door. When I come here I am in pizza heaven so dont listen to the negative reviews and give this NYC staple a chance - you will NOT regret it!", "author": "Olga T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-17", "description": "Why can't this exist in California? Why?!  to get pizza like this in the Bay Area, you have to go to fancy places that charge a lot.  Grimaldi's serves very good thin crust, brick oven northern Italian style pizza; simple, not too many toppings and cheese, for cheap!  Why can't we have that here?  Totally worth the wait, then walk over the Brooklyn bridge when you are done, perfect afternoon.", "author": "Bucky M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-08", "description": "Classic NYC, smoky flavored, thin crust pizza, baked in a coal fired brick oven.  Pizza is made with their own sauce, as well as fresh mozzarella and basil.  Grimaldi's is in DUMBO, just over the Brooklyn Bridge, and can easily serve as a jumping off point for a great walk (or bike ride) into the city, and a view of the new Waterfalls exhibit on display through the fall. \n\nAnd don't forget that Jacques Torres chocolate factory is nearby, and the Brooklyn Ice Cream Factory on the Pier.\n\nFor more information, go to:  www.thefoodbully.blogspot.com", "author": "food bully t."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-17", "description": "Went to Grimaldi's yesterday around 4:45 for late lunch/snack. Walked right in no line. Stood at the fromt of the restaurant and waited to be sat. Finally someone offered us a table. Sat at a nice corner table in the back of the restaurant. Then NO ONE came to the table to offer water, to say  \"Hey, I am your server, I will be right with you.\" NOTHING, it was like we were invisible. Waited about 10 minutes. So we left. The table next to us also got up and left about 5 minutes before we decided too. I am glad they are doing so well that they can afford to have 2 tables just walk out and leave. Will NEVER go back. Piss poor service.", "author": "Chris G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-14", "description": "I truly don't get the hype about this place, and quite frankly i'm a New Yorker and their pizza is mediocre at best.  But due to high expectations and the level of volume and influx of new customers they have to serve on a daily basis is overwhelming enough.  Therefore, they lack in attention to detail and its quantity over quality.  Our pizza was very bland, and lacked a lot of flavor.  But I understand their business model and why it works because they get many tourists from all over the world for a one time dining experience.  With the incredible amount of wait time and rude service from the old man at the door, needless to say, I will not be returning at all.  And, I truly i understand their ego and the rudeness because regardless their business will flourish and the customers/tourists will always be there.  But I doubt true locals will though, just my opinion.", "author": "chris p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-08", "description": "This was my second stop for pizza when I came to New York, and the pizza was mightily good.  We ordered two large, which was a little sad, seeing as there was only four of us, but we do eat a lot, but then again, the pizzas could have been a little bit bigger.  \n\nOne pizza has pepperoni and red peppers, definitely a good combination, and the other pizza had Italian sausage and mushrooms (if you have read any of my other posts about pizzerias, then you will notice this is not the first time I have had this combination).  The Italian sausage and mushrooms pizza was really good, definitely one of the better ones I have had, top 5 at least.\n\nWe went around 5ish on a weekday, where we pretty much walked right in with no wait in sight, which was lucky for us.  The service was kind of bad, the waiters were pretty rude, and seemed to be rushing you out the door as you were still finishing off that last slice.  Even the owner came and started to take away dishes when we were still eating off of them.  But this all made sense as we left and found the block long line waiting outside.  \n\nSo if you go, and you probably should since the pizza was great, just a little bit of rude service (normal to New York I suppose), go earlier in the day, during off food hours so you don't have to stand in a monster line that looked like it could take an hour or two, or just make sure you are starving when you get to the restaurant around dinner time.", "author": "Alex C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}