{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-17", "description": "still the same delicious pizza as can be. i'd say that this and angelo's coal oven pizzeria in the city are the best in nyc. my friends and i shared another large pepperoni and mushroom pizza and a lovely carafe of the house red wine. all gone in an instant and we were perfectly stuffed. i just love the fresh ingredients used here and the crust is to die for!!\n\nthe one thing that i don't like is how they stuff everyone in here. which can be understandable since there's always a long line out the door. i just wasn't comfortable sitting with my purse on my lap and crammed with my bags.\n\nother than that, the wait is more than worth it. a delicious pizza that's steaming hot when it arrives at your table, the fresh, white as white can be mozzarella and basil along with whatever topping(s) you decide to get, mmmmmm.\n\nwarning: cash only!!!", "author": "Pamela s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "I am so weary of tourist traps.  Especially when I see a line up of NO New Yorkers.  Nevertheless, as I was gobbling up, I truthfully thought it was the best pie I've ever had!  I'm just not sure if this had anything to do with the fact that I had just ridden my bike down from the UWS.....", "author": "Carol W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-07", "description": "The pizza is okay, but I don't think they're the best in the city, especially not for waiting an hour in line. It was a little floppy, the kind of pizza where you HAVE to eat it with a knife and fork. I personally like my crust a little crispier. I think I prefer Patsy's instead.", "author": "Carolyn C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-11", "description": "Well, I guess we lucked out, we went for a late lunch, walked right in and got a table- no wait at all.  The pizza was great, but I don't see what all the hype is about.  The service and atmosphere were nothing special- it's just a pizza shop!  Somehow we wound up spending around $75 buck-a-roos on a pizza, some wine, and dessert.  I'm glad we had the opportunity to experience the well-known Grimaldi's, but if I were hungry and there was a line I wouldn't be heart broken about choosing a new place.", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-26", "description": "If it's your first time visiting NYC, then I suggest you start off at the Manhattan end of Brooklyn bridge and walk across to Brooklyn (about half an hour), circle down towards the pier (DUMBO area) and you'll come across one of my favorite pizzerias in the Big Apple.  Grimald's has been around forever and its appeal hasn't waned.  People know to get in line the moment they arrive to get waved in as tables open up.  It's a bit cramped inside as they try to fit as many tables and as many people as they can but that's all what the NY experience is about.  One thing to note is that even if you do take out, you still have to get in line and wait with people who are also dining in.", "author": "grace c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-04-14", "description": "I went here with two friends at about 10:45pm one Saturday night because as a resident of NYC, I felt an obligation to try what is mythed to be some of the best pizza in the entire city. I was not the least bit disappointed. We didn't have to wait in any line, which was a nice perk, but at the same time the service was far too rushed (they were closing so I can forgive them). The pizza was absolutely delicious! There's really no reason for me to try to describe it... every part of pizza down to the crust was absolutely delicious. Even if it is a tourist draw, it's definitely worth one try at the very least. As far as I'm concerned at this point, this is the best pizza in NYC!", "author": "Adam W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-26", "description": "BEST pizza ever!! Great crust, solid sauce and well balanced between sauce and cheese.  I only go to Grimaldi's about once a year when I have guests in town- its followed by a trip to the ice cream shop and a walk over the Brooklyn Bridge. This place is totally a tourist trap and you have to wait in line for 45 minutes or so (on the weekends)... again, it is worth the wait but if you are a local, its pretty hard to convince yourself to wait in a line for pizza considering you like in a city of great pizza.", "author": "S G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-18", "description": "Grimaldi's is where to go for pizza in New York.  Every time we go to NYC we make the trip to Brooklyn, and go to Grimaldi's for the best pizza I've ever had.  \n\nYes, there will likely be a line.  You can avoid this by going early (before noon on weekdays), but even if you do have to wait, the pizza is worth it.  I still remember my first bite of a Grimaldi's pie, and it was like heaven.  The consistency of the crust is perfect.  The sauce is delicious.  The fresh cheese is good and stringy, without being too rubbery.  The peperoni is tasty and has just started to crisp when it comes out of the oven.\n\nWe stick with the basic peperoni usually, because it is so good we haven't felt a need to branch out.  The simplicity makes it pure, not to mention putting it on a fair playing field for comparison elsewhere.\n\nIf you like pizza, just go and try Grimaldi's at least once when you have the chance.  I understand that people like different styles of pie, and I can appreciate everything from deep-dish to thin-crust, but out of all of them, this is my favourite.  Some will call the crust soggy.  It isn't, that's just the nature of these thin crust coal oven pizzas.  They aren't like the bready, thick, stiff pizza you get from the corner take-out franchise at home.  I can't call myself an expert in NY style pizza, but of the ones I've tried, Grimaldi's is the one I still dream about.  Lombardi's was close, but if I had to chose one for my last meal, Grimaldi's gets my vote.  Make an event out of it.  Go early, have a fantastic meal, maybe go around the corner and pick up some gourmet chocolates (for much later), and walk back to Manhattan across the Brooklyn Bridge.  You'll appreciate the exercise after stuffing your face, and it's a good way to immortalize the best pizza to be found.", "author": "OJ B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-24", "description": "delicious. always a long wait, so plan ahead. basic family friendly environment", "author": "prim r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-08", "description": "great pizza and a good location--fun to walk over the BK bridge beforehand to work up an appetite", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-07", "description": "Love their brick oven pizza. Personally I think it's better than Lombardi's. I always order it with extra crushed tomato and sausage. It takes a while but definitely worth it. I always do take outs though cause it's much faster than lining up.", "author": "missesame c."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-10", "description": "Went for the first time since they changed locations...did you change pizza recipes also?! It's not the same...the cheese is rubbery and the pizza is bland. I had to dump half the jar of peppers on my pizza to eat it. Crust is still great...but what the heck happened here!? Hopefully I went on an off night because this USED to be my favorite pizza in NY.", "author": "Hamsmash C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-14", "description": "We're huge fans of the Grimaldi's in Tucson, so this was a must stop on our trip to NY.  We waited about 45 minutes to get in.  The pizza was almost as good as Tucson.   (Same good crust--different sauces.)  In some ways it was the quintessential Brooklyn experience--a bit rude, very crowded, with no chance to relax or linger.  It was worth a stop, but now it's crossed off the bucket list and there's no need to go back.", "author": "Marlys S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-21", "description": "I was there on July 4th and the line was about 25 minutes. The pizza is as good as everyone describes. The service is fast and kind enough to point out other highlights of the area. It is worth the wait", "author": "cal p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-06", "description": "You definitely dont want to go here with a large group, b/c the larger the group the longer the wait. I've been here twice and both times waiting close to an hour.  Rain or Shine, there will be a line.  In fact, one of the times I went, it was pouring out.. and we stubbornly waited in the line thinking ppl would gradually leave, but disappointingly that was not the case.  But, on to the good stuff, once you get in, your gotta get smashed into a cramped area.. where you'll have the privlidge to eat the yumminess Grimaldi's is known for.  Huge pizza pie for approx 20 bucks.. the servce is pretty scarce esp since there are so many groups jammed in the small place. Quick tip- Gramalids has a sister location in Hackensck, NJ owned by a family member, and its almost identical to the menu at Grimaldis and tastes identical as well. No wait, no lines, and comfortable seating- it's called Brooklyns Brick Oven pizza.  Check it out!", "author": "Maria H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-03", "description": "I ate here maybe 3 years ago and it was good. Last night it was disgusting. The wait staff was nice and were quick, so I give it two stars, but what the hell happened to the pizza? The cheese was flavorless and the black olives we ordered were way too salty. And I have an insanely high salt tolerance. I felt really bad that I made my friend wait all that time to eat that nasty pizza. I got what I deserved when I tripped on the Manhattan bridge on the way home.", "author": "Leah H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2005-06-28", "description": "Consistently voted the best pizza in NY - it lived up to the hype.  We trekked over to Brooklyn to try a pie, and I loved the thin crust, chewy-ness of their pizza - perfect balance of crust, sauce, and cheese.  Very casual environment - the tables are smushed together.  Not much in terms of ambience, but you won't care because you will be too busy stuffing your face with food.  Awesome and worth the trip there!", "author": "Christina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-27", "description": "I liked it alot. We crossed the Brooklyn Bridge on Foot  to go here. i think frank sinatra used to frequent Grimaldi's as well, and i really enjoyed the sinatra memorabelia.  we had our favorite: thin crust with pineapple, olives, ricotta, peperoni, and sausage. its a mouthful, but it is soooooo good.", "author": "sarah C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-10-20", "description": "Each time my friends and I head out to New York, we never pass up an opportunity to try a new pizza restaurant (mostly because New York pizza is second to none). Unlike some of the others who had longer wait periods, we went around 7PM on a weekday (being tourists and all) stopped in, and had a table within 5 minutes. The thin crust pizza was amazing!, in the sense that it was so amazingly thin, but the place is so hyped up, in reviews in tourist guides/online/other people, that expectations ran high. Others have mentioned that the pizza had a crispy crust; however, I remembered mine to be a little too soggy to be enjoyable. Of course, I'd give the place another try in case the particular ingredients (tomatoes, feta cheese, and sausages) yielded to the sogginess.", "author": "Angela C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-12", "description": "The pizza here tastes unlike any pizza I've ever had. You can tell that every single ingredient they use is as fresh as it can get. The crust was perfect. Not greasy at all. The only thing I didn't like was how the cheese got really thick and rubbery pretty fast when it started to cool off. You've gotta eat this stuff quick to get the best of it. My friend had also eaten here the night before when we ate here and several times within that month. If I lived near here I'd do the same...maybe. :)", "author": "Kristen R."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}