{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-04", "description": "This was a must on my brother's \"tour of New York.\"  It entailed him kicking me out of bed 10 to try to get there by 11:30.  Thank goodness I'm a lagger.  We got there at 11:50ish to line of 30 some-odd people in high 20 degree whether in front of a still closed store.  Yep, 12:00 on Saturdays people.\n\nBut then again, maybe we should have arrived a few minutes early. When they finally opened the door, our group of three was the first to be barred by a velvet rope from going inside.  We did indeed have to wait for everyone who JUST went in to get seated, pick what they want, order, wait for their pizza and eat it.  It was fantastic.  Like 40 minutes in the cold fantastic.  It definitely didn't make us feel better that a tour bus pulled up and the door man (yes, a door man), lets them into the restaurant like a bunch of VIPs to a club - they weren't even hot!\n\nI was hungry, cold and bitter.  I got even more bitter when people were leaving, but in 2s.  So the doorman proceeded to parties of 2 in behind us in line.  When we finally got in, you can bet I took my sweet ass time inside.\n\nThe pizza and black cherry soda was somewhat redeeming though.  We ordered a large pepperoni and a large ham and mushroom (yea 3 people to 2 large pizzas, ENJOY THE COLD OUT THERE!).  My relationships with pizza usually involves Pizza Hut, Papa Johns or CPK, so I'm not exceptionally picky about my pizza, so maybe I don't know what to look for in good pizza, but I wasn't blown away or anything.  It was good, and the pepperoni was definitely better than ham and mushrooms...but I don't know.  It was a long way to travel and a long wait for pizza that was good, but I wasn't completely convinced that it was worth it.\n\nBut I appreciate that it's family own, been there forever and everything is made right in front of you.  The tables were fairly close together so with a lot of people seated in the restaurant, happy to be out of cold, it was a very happy atmosphere.  They also package your extra slices tight and it travels well (all the way back from NY to DC).\n\nI will probably never go back during winter to experience this again, but will consider going again any other time.\n\nPS, the takeout and eat-in line is the same line, so don't try to think you're outsmarting anyone.  It seems you can call ahead to order a pizza to go to get around that though.", "author": "Melody C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-13", "description": "After a beautiful crisp afternoon walk on the Brooklyn Bridge, there is nothing better than to head to Grimaldi's for pizza. Since the sis and I went on a weekday, I want to say Wednesday, there was no wait and we shared a small pizza pie on the bar. The waiters, hosts, and servers had what seemed like Brooklyn attitude swag going on and didn't smile once, but nonetheless gave great service and they were good on the eyes so that was nice. The wait for the pizza to come out was worth it. We got a hot pie fresh out of the coal-oven! Def one of the best thin slice(s) of pizza I've ever had.", "author": "Lisandra M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "I tried Grimaldi's when i first visited NY \u0026 im happy my bf took me here! You get to put ur own toppings! I think i had sun dried tomatoes, sausage \u0026 something else.. It was soo good!! Nothing compared to california pizza hahaha", "author": "Jo C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-30", "description": "Good pizza ......\n\nwaiting on some line for an hour  to eat pizza in New York is the biggest turnoff ever and I mean it. \nI may have given this place 5 stars or at least 4 if there wasn't a line. Hey people WAKE UP, there are thousands of pizzerias in NYC and be assured there are several much better without a 5 minute line not a 1 hour line. Thumbs down here. \n\nThis is pizza guys its not  Kobe steak...", "author": "Aunt J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-09", "description": "I realize Grimaldi's is a tourist trap and all, and that the decor and service is a little funky. I had every intention to come out of my meal thinking \"Glad I crossed that off the bucket list--now I don't have to go back.\" But seriously - that pizza I ate last weekend was amazing. AMAZING. Amazing enough that I will have to go back on my next trip to New York (which is a shame considering how many restaurants are now on my \"must eat\" list every time I visit). \n\nDid 1/2 the pizza as cheese, and the other 1/2 sausage \u0026 pepper. Still dreaming about it.", "author": "K. D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-10", "description": "OMG OMG OMG...This is some amazing pizza!!!!\n\nThe wait may seem scary as the group I was with approached the long line. However, do not fret. The wait was less than 30 minutes, and that is saying something. After all, some folks wait for 1 hour for the Cheesecake Factory in the Suburbs. \n\nThis is my \"close second\" pizza as my love of Pizza Villa in Merced, CA still lives on. \n\nPeople may say that a person needs to travel the world, have a child, and contribute to their favorite charity before they die. I would add to that bucket list to eat at Grimaldi's once. It's truly awesome.", "author": "Gina W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-08", "description": "So good!!! Possibly the best pizza i've ever had. Waited only 10 minutes to get in. Had to go find cash to pay for food, but otherwise awesone!", "author": "Food E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-20", "description": "If you are a real New Yorker, you will find out that there are plenty of better pizza places in New York. The pizza does not live up to its hype. It may if you are a tourist or perhaps have no idea what New York Pizza should taste like. The pizza here... It may be real Italian style pizza, but New Yorkers don't want that crap. We want the real New York Pizza. The pizza here? Bleh. I was here with a friend and she said the crust tasted like Saltine crackers. I believed the crust tasted like Saltine crackers dipped in Soy Sauce. Just unbearable. And people enjoy this?\n\nThe environment was just cheap. The tablecloths are not changed or washed, so the mess that the previous people at your table left will be your mess. \n\n\nThe service here wasn't great. But it's expected of a restaurant as packed as this one. However, the wait staff doesn't seem to be fond of children. I saw a young boy try to be cute and pay for the bill. One waiter patted him on the head like a pet and another waiter told him to wait and basically ignored him. \n\nWould I ever wait half an hour for this pizza again? No. Would I ever go here again? No.\n\nI believe that Dominoes, Pizza Hut and Papa Johns makes better pizza then this. Save your money and time and go elsewhere.", "author": "Kenneth P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-19", "description": "I've been waiting to come eat at this place for almost five years now, and today I finally came. FINALLY. \n\nThe line looks daunting outside, even at around 1:45pm on a Tuesday when you'd think there would be less of a lunch rush, but yes, it will still be there. No worries, though, because they get people in and out pretty efficiently. I think we got seated after waiting only about 15-20 minutes. \n\nWe got two large pies for four of us -- both pies were the regular cheese pizzas. They use fresh mozzarella on the plain pizzas, with a sweet, slightly tangy tomato sauce and some basil. Simple. Understated. Yummy. That's what this pizza is. \n\nI must say, though, that I think this place is slightly overhyped. My friend and I agreed today that we think that the Patsy's at University Place near Union Square has pizza that is comparable to the pizza we had here at Grimaldi's. Some of you will be pissed that I even suggest this, but my friend agrees, so I know it's not just me! Might I even dare say that the crust is slightly crispier and doesn't get soggy as quickly at Patsy's as it does here? \n\nI like the open kitchen here and how you can watch those pizza guys flip and turn out pizza dough, artfully throw on toppings, and push the pizzas into a large brick oven in less than 2 minutes each. They are efficient here, no doubt. Don't take pictures of them doing the pizzas, though, otherwise they will get mad (I got away with taking one before they asked me to take away my camera, so check out my photos!). \n\nI'll be back here for pizza when I want to be near the Brooklyn Bridge (great place to walk off the pizza) or have visitors who want to marvel at NYC pizza.", "author": "Yvonne W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-15", "description": "Pizza was out 5 min after ordering. It is Monday at 2 pm...  Good but not insane to get the 5th star.", "author": "jason s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-18", "description": "My profile picture is a shot of their pizza.  I like it.  It's delicious.  If you haven't been there, let me save you the trouble.  It's worth it.\n\nHere are cons:\nIt's in Brooklyn.\nYou're gonna be waiting in line just to get in the place.\nThe center of the pizza is soggy 70% of the times I've been there.  \n\nIf you're willing to endure those things, you're gonna love it.  Toppings are fresh and the sauce is zesty.\n\nSpecial Hints: You gotta ask for the oregano and parmesan cheese.  They don't have it on the table.", "author": "Cliff K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-09", "description": "The pizza was good, but not much better than any other NYC pizza. The staff were not great (our group was passed over in line for another group behind us, and we had to chase down the waiter to get more water), and the hour long wait to get in at 3:00 was a bit much.", "author": "Graham B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-02", "description": "I haven't been to Grimaldis in years, and on labor day we ended up walking across the Brooklyn Bridge and down towards the water and Grimaldis, the line was short, maybe 20 people, thats short for here.  So we decided to wait.  And btw they moved next door to the original location, its bigger that the old place but no liquor license.  The pizza was good, not as good as i remember it though.  Don't get me wrong...its GOOD., really good ...but its not worth an hour wait and Cash only.", "author": "Cary L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-07", "description": "Definitely come on a weekday! For two, wait time 5 minutes!! The location is prime, and their pizza is AWESOME, I honestly can say, I've never had a better pizza. Wow its gooood. Everything is so stinkin good and fresh about their pizza! Cash only", "author": "Angel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-12", "description": "Some of the best pizza I've had. Husband and I inhaled two small pies - a white and margherita.  I'm not a huge fan of white pizza, but it was really good. I still preferred the margherita pie though - just a personal preference.  We actually ended up here after being told there was a 2 hour wait at Lucali's.  Only had to wait about 10 minutes to get inside. Waited about another 10-15 minutes for our pies, but it was pretty worth it. Crust is perfectly crisp and sauce is light and just right! :) Would definitely revisit one day.", "author": "Marie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-25", "description": "I love love love the pizza here!!!!  I took the subway here and it was a couple blocks away ... didn't feel too safe, but whatever, i wanted that pizza!  So my friend and I sorta, kinda, ran to the restaurant and when I got inside it was packed.  Luckily as I was walking in a party was getting up, *phew*, I didn't have to wait for a table.  So we sat down and ordered our pizza and it came out with the quickness.  SOOOO ooey and gooey.  It was DELICIOUS!!  They only accept cash, which kinda sucks, but whatever.  The pizza is TOOOO good to let that stop you.  Also, the service is OK, kinda slow, but whatever -- honestly, the pizza is just that good to me =)\n\nI can't wait to go back to NY.  I think I'll make my taxi driver make a stop here before dropping me off at my final destination =X.", "author": "Pia V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-13", "description": "The only pizzeria where It felt like I was going to a late night club.  \n\nThere is a long line waiting to get in and they ask how you how many are in your party.  After waiting a bit, the bouncer picks us 4 to go in next instead of the 2 ahead of us.  Feeling like VIP we go inside and get squeezed onto a table sandwiched in by other tables and guests.\n\nYou cannot order per slice in this place, You have to order by Pies.  We ordered 1 pie and it just wasn't enough.  The toppings were great and we loved the cheese, and decided to get extra mozzarella cheese in the next pie.  YOU HAVE TO Get EXTRA Mozzarella Cheese on your pie if your not lactose intolerant to experience one of the best pizza I ever had.  I felt that getting that extra cheese made the pie soo much better.  \n\nI will definitely come back to this place for more pizza, unless I get rejected by their bouncer.", "author": "Daniel F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-27", "description": "Really great pizza. The sauce is perfection. The cheese is also outstanding as well as the crust. The giant dude managing the line was fun to watch- like a pizza bouncer. Great pizza and friendly service in a slightly chaotic space.", "author": "Michael R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "Wow! That's a great pizza. We went on a Tuesday at 3.30pm so there were no lines and pizza came out within 20mins or less. The service wasn't amazing, but they took your order and got your food to you. The pizza was pretty great and really, you go there for food, not service", "author": "Kate N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-28", "description": "Many great pizza options.  Grabbed a slice of heaven at grimaldi's  Will definatley go back, if they are open when we return to Brooklyn.", "author": "Neil G."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}