{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-03", "description": "Best. Pizza. In. NYC. Period.\n\nI heard about the wait - but lucked out as it only took about 30 mins to get seated, even on a Saturday night.  I think it also helped that I was only with one other person.\n\nWe sat upstairs, over looking the lower dining room.  It's a no fuss place - simple menu.\n\nOrdered a large pie and it was served quickly.  Light, airy dough, just enough sauce and toppings.  Perfect balance of flavors.\n\nOn the loud side - but the price can't be beat.  For one topping, large pie and a soda/bottle of water - $20.", "author": "Alexis B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-01", "description": "Leron's Lesson: Classic pizza served hot and fresh and meant to be shared with friends.\n\nFull Review: After living in New York for about 20 years, I finally had my first slice at Grimaldi's last week. As embarrassing as it was to write that sentence, I was even more embarrassed when I took my first bite of the delicious pizza! \n\nSince they switched locations, there is ample seating space and plenty of classic booths for you to take advantage of. The service was fast \u0026 attentive which made the experience all the more desirable. I definitely wont wait another 20 years to eat here again.", "author": "Leron G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-01-12", "description": "I had a bad experience at the Grimaldi's at Kips Bay that my friends urged me to give this place another try.  They hoped I would have a better experience in the main branch in Brooklyn.  Not being a great fan of outside-Manhattan boroughs, I went for the sake of good food.  \n\nNeedless to say, I was greatly disappointed.  I went with friends for dinner.  The place was half empty and we were given a table on the 2nd floor.  Customer Service was pretty okay.  Waiters came when we signaled and they gave us what we wanted. \n\nThe most unsatisfying part was the pizza.  I don't understand what's so great about their pizza.  Nothing is good about it.  Our pizza came soggy, which is not something I like since I can't roll up the pizza and eat it without getting my fingers wet.  \n\nI suggest Lombardi would be a better option.", "author": "Kei Ling W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-28", "description": "I had some family that came from Canada and they wanted to try out this place.\nWe came around 9:30pm when the lines died down. We still had to wait a good 30mins for the pizza.\nEventually when we did get our pizza,I felt cheated.\nThere was very little sauce on the pizza and the cheese was meh  and the crust was bad. However, the few slices that did have basil on it was good.\nWe actually ordered 3 different pies of disappointment. Afterwards, I had to take them to L\u0026B to cheer them up from the disappointment.\n\nMaybe at some point in time, this place was serious about making a good pizza but not that night for sure.", "author": "Sandy N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-28", "description": "The pizza is pretty good, but I wouldn't say it's more exceptional than any other brick oven pizzeria like John's, 800 Degrees, etc.\nThe owner/manager of this location likes to present himself as some sort of Soprano like figure which is hilarious. They have moved into a bigger location right down the street, which helps the wait time in line, but like I said, I wouldn't wait longer than 10-15mins max for this pizza. Plenty of other equally good options in NYC.\nOh yeah, don't get the calzone. It's bad.", "author": "Mista H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-05", "description": "IT'S NOT NOT NOT WORTH THE WAIT!!!!\n\nIf you're reading this PLEASE do yourself a favor and don't bother to wait in line for this place! We were told it would be a half an hour wait (just a ploy to get us to stay ONE AND A HALF HOURS) in line in the freezing cold. Then we get in there and have to wait ages for our pizzas which came out BURNT!!! Yes BURNT! But we were SO hungry we ate it anyway. Obviously after that long of a wait you need the bathroom by the time you get there... NO toilet paper in the women's toilets and the manager didn't care one bit when I told him. And then.... oh yes it gets much worse... their FOOD HYGIENE is NON EXISTENT!!!!  I watched while the pizza chef put raw sausage meat on the pizza then wiped his hands on his dirty apron and then picked up fresh tomatoes and cheese and THEN answered a call on his cell phone and NEVER washed his hands once. DISGUSTING!!! And then lastly the bill... two large and one medium pizza and three soft drinks and it was almost $90!!!! Total rip off, DON'T GO!", "author": "Imogen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-28", "description": "The pizza was fine, it certainly is not my favorite pizza but good nonetheless. Chris, the gregarious bartender / host / waiter is hilarious and very accommodating. \n\n***Tip*** If you don't want to wait an hour in line for a table. (Not kidding about the wait either) then see if there is room at the bar to sit. They serve food there too.", "author": "Carlos L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-19", "description": "I want to give this place a awesome review. I love businesses that are basically a tourist attraction. I love it even more when they are actually awesome!\n\nParents were in town and they wanted to try it out - I guess they have been on TV before? Grimaldi's, not my parents. So they wanted to try it - As did I. \n\nSo being a proper yelper I educated myself before coming. I wanted to know what to expect. Long lines? Ok no big deal. Borderline shotty service. Ok, as long as the Pizza is good. \n\nWe got there and waited 20 or so minutes which wasn't that bad at all - Got seated and waited longer for a waiter to take our order. I kind of expected that. \n\nto the point - You will wait in a long line  - You will probably have shitty service - The Pizza is good. \n\nA note to Grimaldi's management and ownership. I know you're Grimaldi's and you can basically treat people like they are waiting at the DMV. But if you have the opportunity to make the best possible, well rounded experience to people that are looking for that great neighborhood pizza place that everyone wants to come to...then do it. HAVE GREAT SERVICE. \n\nPlease fix your busted ass menu. Its 2013 and your website across the top is broken up. If you are reading this. I will do it for free. \n\nWell - Maybe all that is the charm of the place. \n\n4 Stars because I will come back and will suggest it. Only for people that need a place to eat while they are walking around Dumbo. \n\nI'm just being a negative Nancy...I guess it wasn't all that bad.", "author": "Kevin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "On my trip to NYC I decided to have dinner with family at Grimaldi's after visiting the Brooklyn bridge.   And boy was the line super long and out the door down the block.  This must say something about the pizza if people are willing to wait in a line that long. Luckily the line moved at a steady rate and we were able to sit at the bar since we were only a party of 2.  Con- their liquor license is pending.  Other than that our pizza tasted amazing despite the kitchen running out of grilled chicken.  We had pepperoni, ham, basil, ricotta, and mozzarella cheese.   All fresh and piping hot when served at our table. Grimaldi's is my all time favorite pizza place.", "author": "Francis P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-23", "description": "All I could say is if your lookin for pizza in Brooklyn I recommend this place. It's a tourist spot for people craving for NY pizza! Expect long lines and long wait time they also take long cooking your pizza because it's cooked old style brick and coal. But it's worth it for the experience. When you walk inside it's smells like coal mixed with pizza smell it's not that typical smell you would get from other pizza places. The servers are all happy dancing to the beat of whatever music there playing 80's type of music. The desert was so good especially the cannoli. Stop by and try it for first timers, you will not regret the wait!", "author": "Aye Jay B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-02", "description": "I remember waiting on line here with my parents back when I was young, and it was worth it every time.\n\nRecently had it again and damn, not much has changed. Great pizza, can't beat Grimaldi's.", "author": "Eugene L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-14", "description": "I've heard so many good things about NY pizza, maybe too many, because I was slightly disappointed by Grimaldi's. Sure, there were good things: the large pizza I had was HUGE, probably approaching 18 inches in diameter. And the people there, both the staff and fellow diners, were really friendly and talktative. \n\nBut I found the pizza below-par. The base didn't seem to be fully cooked and the toppings okay but underwhelming. There was also the wait: although I was shown to a table immediately, the pizza took 30 minutes to arrive, much longer than I'm used to. Further, at close to $28 for pizza, two toppings and tip, I'd say the value was questionable, even despite the pizza's size. \n\nSo my quest for the legendary NY pizza continues. I've already had better pizza (with crispy yet light bases and fresher toppings) elsewhere in Brooklyn, so my optimism is undimmed. Grimaldi's however I found to be okay but not spectacular.", "author": "Peter S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-23", "description": "Worst service. Sat near the entrance and heard a old guy(probably the owner) called these customers that came in \"stupid f***\" behind their back. That was very rude and disrespectful. Overated pizza. Ordered a small pizza with chicken and mushroom and barely tasted the chicken. Burnt crust and soggy pizza overall. What was worst was the cash only policy. Went over to the ATM and charged me $5 for ATM fee. That is ridicolous and was not worth it. Never coming back again.", "author": "Joong S. P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-02", "description": "Pros\n- Close to Brooklyn Bridge park\n- Pizza\n- Lots of choices in toppings\n- Relatively affordable\n\nCons\n- I heard the wait can be bad\n- Only sell whole pies\n\nGrimaldi's was really good. The wait wasn't as long as I thought it would be. It was a rainy weekday and we had to wait in a line outside the restaurant. It was weird when we got inside and there were all these empty tables. The staff were pretty attentive and helpful in recommending what to eat/toppings. However, it wasn't as mind-blowing as I expected it to be. I'd probably opt to try Di Fara(sp?) if I came back.", "author": "Andrew S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "Best pizza in Brooklyn, in New York and maybe even the world.  The wait outside is stupid, the cash only policy is a pain in the butt, the no-fountain soft drinks is annoying....but this place is always crowded for one reason only.  The pizza is ridiculously good.\n\nI've been trying to find another pizza joint that has better tasting sauce-crust combination and just haven't been able to find it.  If you're near the brooklyn bridge in future, check this place out.  Put up with the wait, it's worth it.  In my hometown, people wait two hours to eat at Outback Steakhouse.  I think an hour wait to eat at the best pizza place on the planet is a pretty good deal.", "author": "Dennis S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-20", "description": "This ACTUALLY gets 10 stars out of 5 but I have no way of showing that on this review haha.\n\nWent here on a weekday for a late lunch and there wasn't really a line but there was a steady stream of people coming in and out.  Ordered the plain cheese/basil/tomato pizza for my friend and I to share and it was literally out in 5 minutes, maybe even less.  I think that the word 'perfection' was invented after someone took a bite of this pizza.  That is the only way I can describe it.\n\nLOVE IT!\n\nIf I could teleport, I would get Grimaldi's for lunch every day!", "author": "Aditi G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "This is probably the best pizza in New York. The only thing I have to criticize is the plastic knifes, forks and plates. I don't think restaurants should use these as it contributes to a fast food atmosphere. Besides, it is not environmentally friendly. Nevertheless 5 stars!", "author": "K P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-25", "description": "My friend and I went to Grimaldi's on a Wednesday and arrived at noon, before the lunch rush. We were seated right away (upstairs) and had our drink and food order taken as we were famished. It took about five minutes to receive our drinks. As we\nanxiously waited for our famous pizza, guests started trickling in and a line started forming outside. We noticed some tables  that were seated after us were getting their food orders and brushed it off... We noticed everyone was getting their pizza except for us. Forty minutes later we asked our server the status on our pizza and finally received it. No apology, just the pizza. The pizza was good, but not the best I've had. I would return to Grimaldi's, but I wouldn't go out of my way for their pizza.", "author": "Chiyon Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-09", "description": "Situated under the Brooklyn Bridge and touted as the #1 Pizzaria in the entire city, I knew that I had to give this famous New York staple a try. My friends and I were actually so excited about trying it that we decided to walk across the Brooklyn Bridge from Battery Park to get there. Once on the Brooklyn side, it was a little bit tricky to track the restaurant down on foot. However, after a time, we finally found it and noticed the relatively long line waiting to get their hands (and mouths) around a slice of Grimaldi's famous pizza. We were only a small party of 3, but it took about 45 minutes to finally be seated. 45 minutes may have seemed a long time to wait, but our gruff, no-nonsense host commented that it is usually a longer wait so we were thankful to finally be inside and seated, out of the wind and cold.\n\nThis place was packed, with tiny tables that could accomodate only maybe half of a 4 person party. However, I suppose beggers can't be choosy. However, when a group of 3 Japanese girls were seated next to us at a 2-top they tried their best to squeeze in but couldn't manage to comfortably sit around the table. When they asked the host if they could move, he barked \"SIT DOWN OR GET OUT\". I was shocked to see a restaurant, especially one of Grimaldi's fame, could possibly treat their customers this way and still be in business. But as the case may be, they simply didn't care. There would always be people who would be happy to take those seats and sit down for dinner. It's a sad reality but there was simply no incentive for the restaurant to treat their customers amicably.\n\nWe decided to order 2 large pies, one with pepperoni and sausage and the other with mushrooms and ricotta cheese. Made fresh and fired in an authentic brick oven, our pizza piping hot and smelled deliciously of fresh basil. The dough however, was a bit soggy from the tomato sauce and would droop and fall apart as we tried to bite into it. I usually like to add gratuitous amounts of shredded or grated parmesan to my pizza, but here at Grimaldi's, parmesan came with an extra charge so I decided to forgo my usual endulgence.\n\nThough tasty, I didn't really feel that this was the best pizza that I had ever enjoyed. Besides the hype (which I found out later to be largely due to their reputation as a tourist trap), I felt that Grimaldi's served better than average pizza, but certainly not the best. It's worth trying, but go for the pizza and not for the service. Just remember that, if you raise any sort of fuss, prepare to be pushed around and barked at because they are definitely not in the business of non-sense there. Your mileage may vary.\n\nFood: 7/10\n\nService: 4/10\n\nPrice: $$\n\nAtmosphere: 6/10", "author": "Joe M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-03", "description": "Delicious food,always a treat after a day with the kids at Coney Island! From the pies to the sandwiches,heroes or otherwise, always fresh and staff are great!", "author": "Doug P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}