{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-28", "description": "I can tell this place has amazing quality pizza but the one we ordered was just SO DRYYY. I believe it was the white pizza. Next time I'm in New York I'll have to go back and try some other things. Wish I tried the cannoli! The ambiance was cool, two stories. Employees were nonchalant, nothing memorable. Overall decent experience but disappointing pizza.", "author": "Nadine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-02", "description": "Awesome pizza, low key joint. \n\nCame here on the recommendation of a Brooklyner (is that the word?!). \n\nThe venue is a bit dingy, old school decor, chilled out atmosphere, flies everywhere... But I kind of liked it! One small gripe is that we were sat on what was essentially a 4 person table with two strangers. A little bit cosy, but it suited the place. \n\nThere's no liquor, so I had a coffee, it was a decent coffee. The pizza was awesome too. We shared a large pizza between two (small would have been enough...) and it was delicious. The basil was really a beautiful extra touch. \n\nGenuinely come here if get the chance!!", "author": "Rich G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "We stopped by since the line for Juliana's was insane. I'll be honest, I was ready to NOT like this place... the host was more of a director - ushering you to a table quickly and running off without much warmth or friendliness. When seated, I found paper plates and plastic utensils, a no credit card policy, 0 appetizer and side dish options aside from an antipasto jumble, and run-of-the-mill bottled soft drink options. (Liquor license pending!) But here's where they shine: the warmth and aroma from the oven perfumes the air as you wait for your pie to come to you. And if you do like I did - order a white pizza with chicken, sun-dried tomato and extra basil - you're going to have your mind BLOWN. This place hit the spot perfectly. Bravo!", "author": "Tiffany K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-07", "description": "Really good pizza! We got this recommendation from a friend to try it out. We first walked the Brooklyn Bridge, normal tourist stuff. Then afterwards we walked down to  Grimaldi's, which was about a block or 2 down the street. We had to wait in line, even if you wanted to order take out-it was that busy! But once we got inside \u0026 seated, we ordered \u0026 the food got to the table pretty quick! Grimaldi's is almost like a landmark after walking the Brooklyn Bridge. Not sure why the rating is so low. For sure a must!", "author": "Emily M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-23", "description": "All in all I would say the pizza was good. Not the best pizza I have ever had, but certainly not the worst either. There are plenty of options and the pizzas are big enough to share with the family. I really enjoyed the white pizza. It gave a different spin on the traditional pizza. \n\nMy only gripe about this place is that it is cash only. So be prepared to pay the ATM fees if you don't have cash on hand.", "author": "Brandi D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-10", "description": "Tourist trap.\n\nPlenty of much better options in New York. Pizza here is \"good\" compared to pizza outside of NYC, but pales in comparison to even some other local pizza places. If you are a New Yorker, don't bother, you will be greatly disappointed with the pizza here.", "author": "Dan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-29", "description": "the flavours are nice and the pizza is pretty well-made. I'm not sure what happened, but one slice out of two pizzas was completely burnt on the bottom. i prefer a chewier crust (stronger flour), but that's just personal preference.\n\nI'm not sure I'd wait in line at this place, but the pizza is okay.", "author": "Channing F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-18", "description": "While the pizza here at Grimaldi's is certainly good pizza by most standards, the waits no longer make any sense because next door at Juliana's is the original and is significantly better.", "author": "Tunaidi A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-11", "description": "Pizza is fantastic! Service, not so much. Bring cash or be subject to the ATM with a $5 fee. They don't accept debit or credit cards.", "author": "Bianca C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-28", "description": "Authentic Italian pizza. Thin crust, nice toppings..\n\nAfter a walk under Brooklyn bridge we decided on pizza; a group of 10 people were accommodated nicely, three pizza and drinks were reasonably priced served with a smile.. Would eat there again.", "author": "Henry M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-14", "description": "We have eaten a lot of pizza since we've moved to NYC and this is hands down the WORST, by far. It was the most tasteless pizza I have ever eaten. When I went to get a second slice I couldn't even eat half because it was already soggy and just completely unappealing. The bottom was way too charred too. My husband and I can usually finish a small pizza between the 2 of us, but we only ate about a slice and a half each. We were going to eat next door at Julianas but they didn't have a table open and we had never been to Grimaldi's so we thought we'd give it a try. Next time we will definitely wait.\n\nThe restaurant looks old, unorganized, dirty and junky. We ate on Chinet paper plates with plastic forks and knives and drank out of plastic cups. The big guy sitting inside \"seating\" people seemed very unfriendly. I couldn't  wait to get out of there. I wouldn't recommend this place to my dog.  I couldn't even get a glass of wine or a beer because they don't have a liquor license.  This place might be good if they had a complete overhaul of the restaurant and their recipes", "author": "LindseyandJimmy W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-23", "description": "Tourist pizza. It's good to try. But if you are a real Brooklyner, which 3/4 of the crowd isn't, why risk stepping out of your box, play it safe and go. You got nothing to loose.", "author": "Ck M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-09", "description": "Pizza was delicious! Not greasy- which I hate if greasy! Brick oven. Only issue is the long wait! Line to get in super long and after we ordered super long wait for one large cheese pizza. However would go back.", "author": "Lisa G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-10", "description": "The pizza as always has been great. However two big issues happened at my visit today:\n\n1. When I ordered two pizzas they only brought one out and told me the second was coming shortly. After ask 3 times and several minutes later the waiter told me that they has screwed up my pizza and that they had to redo it. Which really means i forgot to put in the second pizza so wait until i fix my mess. \n\n2. I wasn't the only table they screwed. The table right next to me got their pizza and after confirming if indeed that was their order they started to eat only to realize it wasn't. So they had to wait even more. The original table that had order their pizza had to wait even longer for the repeat to get to them and the waiters didn't even apologize for the mistake. The restaurant wasn't as packed as it usually is which is no longer excuse for this kind of service. \n\nA lot can be said about the staff. Terrible service and to top it off a lot of attitude. New York has a lot of great pizza restaurants, and while I really like the pizza here i think this may be my last visit given the bad experience with the service. \n\nWhy waste so much time in line for this? not worth it.", "author": "Rodolfo B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-04", "description": "Came here back in the summer of 2016 based off a recommendation from a friend. Well I came in the summer on a Saturday afternoon, the line was down the block. It was at least a 2 hour wait, so this time around back in NY in Feb 2017 and decided to come on a late Saturday night. This time the coast was clear... it was following my birthday, so I was anticipating my friends would be setting me up as we went to some restaurants. I decided to order the small white pizza which was a pretty decent size. It included olive oil, garlic and basil... and my friends ordered the pepperoni small pizza with mushrooms and onions... My white pizza was delish; piping hot, chewy and gooey!!! Excellent thin crust white pizza seasoned well; not to overboard. Classic authentic NY Pizza; My friends said the small pizza was chewy and gooey as well. I had a feeling they were going to set me up lol. Our hostess brought me a Cannoli for my birthday. Appreciate the love Girmaldi's. It was worth the hype and possibly the 2 hour wait last year. Glad I came... Definitely would be back next time I am in Brooklyn. Also remember that they only accept cash, so get some ahead of time so you won't have to pay any extra ATM fees.", "author": "Gerard T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "After a walk around Brooklyn, this is the perfect place to stop for lunch. As it's slogan suggests, it is just under the bridge and it's location makes it a rather popular place. There is usually a line but it's not too bad if you get there close to it's open at 11:30. We waited about 30 mins for a table for 3. The service is quick and friendly. The pizza is HEAVEN. I loved the fresh chewy mozzarella and the moist crust. Definitely coming back next time I'm in town. I liked this more than most NYC pies I've had.", "author": "Jane S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-13", "description": "Came here on a rainy night on a weekday and we were seated immediately. Our order was taken promptly and we received our food in less than ten minutes. I have nothing to add that hasn't been said. I really didn't have high hopes for the pizza and I was completely blown away. Would it be worth the wait that I've seen on a summer weekend? probably not but the price, service and quality were great. We also ran into some celebrity my friend recognized that was chatting up the people eating.Cash only restaurant with a ton of ATMs. Our group of 3 ordered two large pizzas and dessert - we had leftovers but would recommend getting 2 pizzas for a group of three or four. \n\nWould definitely come back on a cold night when there isn't a line.", "author": "Laksen R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-12", "description": "Believe all the great things the yelpers say about this place. It's absolutely true! Great service. It was our last day in NYC, and we ate so much in the morning. Good thing we worked up an appetite walking across the Brooklyn Bridge. We told our server we only wanted one pizza (5 of us) because we weren't even hungry. We just came to see what the hype was about. He laughed and was totally understanding. He even rearrange our seats so that we were comfortable. Cash only.\n\nFresh mozarella on amazingly good New York style pizza. Perfect brick oven crust. Pizza will never taste the same from hereon. I will miss NYC just for this reason.", "author": "Em T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-09", "description": "It's Kewl that it's a brick oven, but pizza gets toward the  colder side after eating a slice or two. Bottom of pizza in a bunch of areas was burnt, which is what I've heard abt brick style ovens and if u wan half pizza with one item, u still pay the $2-3ea. Got half cheese and half pep. The cheese side was just eh, and the pep side hardly had any pep. Pep comes with basil. All their sodas are bottled, so u get a glass with ice and a $0.79 bottle of soda. The good thing is the large is only $2 more. Other than that it is always kewl to do it for the experience BUT, I wouldn't run out and recommend it to people. The crust is kind of crunchy. I found, so far, Joe's pizza near BaoHaus has BOMB cheese pizza and super crispy...yum yum yum!!", "author": "Austin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "The best pizza ever! They don't sell it by pieces, but you can easily share whole pie for 2 people because it's very thin. The best one is original Margarita and I recommend to take it to go, sit in Brooklyn bridge park on the grass and enjoy an amazing food and view. The only minus it is always crowded, but even that can be as plus because it's only says that it is good.", "author": "Nikolina P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}