{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-06", "description": "The pizza really is as good as the hype. I have dined in once...but we got there 15 mins after opening time and we had to wait still for 10-15 mins. The middle of the pie doesn't go soggy when you dine in (versus take out) though so it was worth it!", "author": "William H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-29", "description": "It's been a week since I've had it and I still can't stop thinking about it. Having lived in Brooklyn basically my whole life, I can't believe I've never experienced the amazingness that is Grimaldi's Pizza. What really impressed me was that every individual component of the pizza could probably stand alone and be exceptional. Fresh mozz: perfect texture and consistency, Tomato Sauce: good balance of sweet and tart, Dough: not too thin and baked to the perfect crispiness, and just enough basil to give the taste buds some variation. Pepperoni was kick ass too... drool", "author": "Nancy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-23", "description": "Don't let the naysayers get the best of your experience here, some of these reviews are downright hilarious.... Let's get some things straight right off the bat here:\n\n1. You don't go to Grimaldi's expecting a quick bite.\n\n2. You don't go to Grimaldi's for the amazing waitstaff.\n\n3. You don't go to Grimaldi's when it's 100°F and 100% humidity.\n\nIf you find yourself in conflict with these long-held maxims, don't blame the establishment for your woes.\n\nNow, as far as the pizza in concerned, let me first say that as a born and raised New Yorker with Italian heritage (and a family in the food business for 100+ years), I can confidently proclaim Grimaldi's to have the best pizza in town save the $35/pie joints like DiFara (but who wants to spend that kind of money on something as basic as pizza, anyway?). I see people bring up the crust most often, but for me it's the sauce (not that the crust isn't amazing, it is): perfectly spicy, not too puree and not too chunky. Fresh mozzarella, and a touch of basil. A simple, perfectly cooked pie every time and at a reasonable price.\n\nNow, will you find me waiting in line every week whenever I want my pizza fix? Of course not, and I even live in the neighborhood. But when I have friends in town, and I want them to experience some amazing, classically prepared New York style pizza, yes, I bring them to Grimaldi's, we wait in line as part of the experience, talk with the tourists who've come for the same reason, and savor the moment when the anticipation becomes enjoyment. Better yet, if you can time it right, just call in for a pick-up, which I've found takes around 45-minutes, skip the line (but I believe they do charge a fee for the privilege) and enjoy your pie in Brooklyn Bridge Park.\n\nThere, now stop complaining that you had to deal with the inconvenience of other people wanting the same excellent pizza that you did - all that means is that it was worth the hype...", "author": "Mark V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-14", "description": "I'll admit right off the bat that it's a little irresponsible for me to review this place since I went five or six years ago. Let me contextualize this as a warning for people visiting New York looking for the quintessential \"NY Pizza experience.\"\n\nTo put it bluntly, if this is the best NY has to offer, then NY Pizza is unbelievably overrated. Grimaldis was one of the most underwhelming travel foodie experiences I ever had.\n\nI guess if you're from California and like to think of yourself as metropolitan and kind of worship the NYC \"vibe\" then it might reflect well on your personality to drool superlatives about how this was the most wonderful experience you've ever had. You can tell people how great it was and show off your new handbag. If you have taste buds and are realistic you might be disappointed.\n\nDid we order wrong? I don't know... Ok, I don't remember. I don't even think we had to wait that long. Went at the right time of day, on a weekday. We were hungry and this pizza was utterly meh. It was cooked right... I like thin crust when it's done right. It was just utterly underwhelming in flavor.\n\nAll I know is, years later, I remain disappointed and completely dubious about the hype surrounding the great \"NY pizza\". I've had pizza I liked better in LA. I've had CHAIN RESTAURANT pizza I liked better. \n\nIt really comes down to taste, doesn't it? I'm not going to tell you not to go. Maybe I ordered wrong, maybe it was a bad day. It can't have this reputation for nothing. Can it?", "author": "creige a."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-07-02", "description": "I came with high expectations. Instead I found a tourist trap. Got there just before 12pm on a Sunday. There was a life waiting outside. It turns out there was a tourist group that had been seated before they opened and we now had to wait for them to clear out. Fine. There was a man outside getting a headcount. This was encouraging. As the tourists came out people were let in. I wanted my pie to go, but still had to wait in line with everyone else. Fine. Eventually I got to the front. For whatever reason, they seated six groups of varying sizes before I could place my order to go. Annoying, but I'll deal if this is as good as it's hyped up to be. I finally get inside and place my order. The lady who took it was very nice, so these stars are for her. Got my pizza and ate a few slices as I drove home. So disappointing. The dough was chewy and lacked any kind of char. It was comparable to a 2Bros dollar slice. Cheese was rubbery and only added to the chewiness. I ordered a half white half regular and both were subpar. The sauce on the regular was incredibly weak and not well spread. I remember the location in flatiron being slightly better. Pick any random pizza place within 20 miles and it'll be better.", "author": "Wade C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-29", "description": "My ultimate favorite pizza in New York. Heck, anywhere! I have never turned away because of the wait (and I usually wait, sometimes ridiculously long). I bring everyone here: old friends, new friends, dates, out of towners... and I'm yet to hear any dissatisfaction (well maybe about the wait). \nThe place inside is small but it is vibrating with energy and laughter and just pure joy (that they're finally sitting at a table!)! You'll probably end up talking to your neighbors because you're bound to get so up close and personal with them proximity-wise. The waiters (all men, which I may have a tiny bit of a problem with) are super nice, especially the host who's managing the lines, keeps the people outside entertained.\nAnd the pizza! oh what magic. I always get one red one white with the goal of deciding which one is better and I STILL have not been able to choose! So I keep getting both. Now of course depending how many people I'm with, the number of pies varies. 2 however is the minimum. I think I've tried most toppings and my favorite has got to be a classic, extra cheese/mushroom, though I like the pepperoni also. I like that they keep the toppings to a limited traditional selection rather than the oh-so-popular \"creative\" items like pineapple (?!) and ceasar salad... The pie is super thin, the sauce is homemade heaven, or is the cheese that good? and the fresh basil is just the needed touch, and altogether it is out of this world! \nOk, I think I made my point. \nAnd a must for me is a walk across the bridge (preferably after to walk off the carbs), which actually most often is negated anyway because I stop at the Ice Cream Factory down the street.", "author": "Zhanna P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-16", "description": "Wow. Best pizza I had in NYC. I didnt know how I would feel about trying NYC pizza because I'm from Chicago, but it was great! YUM!", "author": "Liliana S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-15", "description": "Ahh, I want some Grimaldi's right now. Similar to Lombardi's style pizza. It's a little cramped in there but a plus: we (group of 9) didn't wait in line for more than 20 minutes.  The music is really random which I found amusing (one minute it sounds like music you'd hear at a bat mitzvah the next its salsa). But yeah, anyway, I will definitely be coming back in the future!", "author": "noelia d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-11", "description": "So touristy and yet... so good.  I love these places with pictures of famous people on the wall.  The line was outrageous, the place is set up like a mess hall and yet I still had a great time.  The pizza is worth it.  Plan to wait outside forever and plan to enjoy the fact that you did so.  Basically, it's not just a pizza, it's an experience so be prepared.", "author": "Christian H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-11", "description": "Well I've never waited in line for two hours for a restaurant before... and I probably never will again. They don't take reservations, so best to try to talk your tourist friend out of it. The antipasto and bread were underwhelming. The wine was bad. The pizza was good, but I wouldn't wait in line for it, not even for 15 minutes. It was dinner time on a Sunday night. We were practically sitting in our neighbors lap. This may be some people's idea of a fun night out... but it's not mine.", "author": "Phoebe O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-13", "description": "I got lucky and went to Grimaldi's randomly on a Wednesday afternoon, so there was no line and we got a table right away. Given the fact that I was told multiple times that this was the best pizza in all of New York/Brooklyn, I was somewhat skeptical. How good could it really be? But it was perfect. I would describe their regular pie as more of a margarita slice, with fresh basil and mozzarella. Their sauce was incredible and the crust had the perfect crunch. They don't sell by the slice, and being a smaller portions eater I wasn't sure how much I could eat. But it was so good I had about 3 slices. Go, and if you can, go during a weekday afternoon so you don't get bombarded with tourists.", "author": "Ivy F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-12", "description": "Before going to NYC, I did some googling about walking over the Brooklyn Bridge. 90% of things I read mentioned going to Grimaldi's either before of after the walk, like having their pizza is just an automatic part of the process. Who am I to go against the grain? \n\nAfter crossing the bridge into Brooklyn we walked down to Grimaldi's and waited for maybe 10-15 minutes (around 3:30 on a Thursday) before getting a table. We ordered a large half regular half pepperoni. The pizza was good...really good. But after hearing so much hype, I didn't quite feel like it measured up. If it was just a random place we happened to wander into, I might rave about the pizza more....and when there's such high expectations it's hard to live up to that. \n\nService was quick and nice enough, although the only person who could really be considered friendly was the man working the front door and seating people.", "author": "Amy B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-02-14", "description": "Seriously this place is way over-rated and a tourist trap.  After walking with a friend in the freezing cold for 10 minutes out of the way from the subway, we made it with no lines.  The servers are friendly and all, but the actual pizza is not good at all.  Fresh from the brick oven, yes but with burnt charcoal on the bottom I tried to keep peeling off but the crust is too thin.  The pepperoni and olives toppings were way too salty and it's mini pepps not the reg sized ones.  They blasted the A/C even though it was 10 degrees outside so the pizza was cold in 5 minutes. The portion size is decent but it's not cheap. Medium $14, Large $16.  You can get better pizza from Dominoes which is actually good for less and order in.  Sorry Grim's you need to put clean out the charcoal waste in the oven, it's hazardous to our health.", "author": "Mellie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-17", "description": "Pizza is excellent NY Coal Oven Pizza, but everytime I go I regret it because the experience is RUINED by the HORRIBLE SERVICE! The old man maitreD is rude and obnoxious and not interested at all in getting diners in the door. After a long wait even though half the tables are empty, once in good luck getting a server to recognize your presence - in a small restaurant, last night I was ignored for 20 minutes before I had to get up and demand to be served. And then they act like we're being a bother for interupting them not doing anything. And not once in all my visits have I ever had a server return to see if I need anything else or a refill on my drink. Needless to say, they won't get a tip from me.", "author": "Steve L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-24", "description": "So I am not sure I am giving the 4 full stars to grimaldis or the days experience.. dont get me wrong the pizza was fabuuu but im more leaning towards once a summer type of experience... walking over brooklyn bridge from NYC and waiting in line for a pizza pie and beer and then heading down the street to homemade ice cream factory/shop .. and then walking back over the bridge.. now that is a 4 star day!! hahaha :)", "author": "Lisa Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-21", "description": "This place vies with John's, Lombardi's, Patsy's and DiFara's for being my favorite pizza. It's so hard to choose! I think Grimaldi's is a little better than Johns and on par with Patsy's and Lombardi's. DiFara's pizza is so different that you really can't compare the two. Try to get here early, especially in the summer. One thing that my girlfriend and I like to do if it's too crowded is to get the pie to go and then eat it on the Fulton Ferry Pier. Same view as the River Cafe for a lot less money! If you do get this pizza to go try to eat it as soon as you can, it makes a big difference. My favorite toppings here are sausage and onion..yummm.", "author": "Neilson A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-14", "description": "Grimaldi's was my introduction to the ever expanding world of brick oven pizza which I judge all others by. To date it still in my mind the best brick oven pizza. All of the ingredients are of good quality and the wait has almost always been worth it.  I'm garlic lover so fresh garlic on top always makes the pie here.  After you have the pizza walk down the pier for some old school ice cream at the Brooklyn Ice Cream factory.", "author": "Scott C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-10-03", "description": "Finally made it Grimaldi's last week and went in expecting a lot and came out happy. The pizza was great with their fresh basil and mozzarella cheese, so it's not your typical by the slice NY style pizza. It was busy but it was also a Friday night, and we had to wait on line for about 30 minutes for 2 people. Well worth it though and I definitely plan to go again.", "author": "Rajiv D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-01", "description": "Yeah, it's damn good. It personifies the New York pie. There are definite differences between Di Fara's and Grimaldi's and Totannos and so on but this is probably the pie that says New York style out of all of them. Having my friends from out-of-town swing by Grimaldi's for take out pies and bringing them to my work in Brooklyn was so awesome. I wish that could happen every other day.", "author": "carl g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-15", "description": "So here's my little adventure to Grimaldis\n\nSOme friends and I decided to take a scenic walk across the Brooklyn Bridge to get the sights and the experience. Let's say it was a loooooon ass walk. Got to the BK and found out it was there was some more walking to the pizza place. We got there and saw the longest line I ever seen for a restuarant. If u want to eat here, plan ahead and get here early! Waited inline for an hour while listening to the heavy itlaian accepts aroudn us. I love italian accents. FInally got in and orderd a piiza and a calzone. Still with the pizza, the calzone isnt all that. Supposedly this is thw worl'd best pizza, but it didint blow me away. Yeah it tasted fresh and the crust was crisp due to the coal ovens, but nothing spectacular. I do like the atmosphere, a true italian joint. It was lively, Sinatra was playing. The hosts was real nice. Overall its a good place to check out just to say you \"eaten the world's best\"", "author": "Rex P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}