{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "First time eating here and didn't disappoint. We walked over the Brooklyn Bridge, not knowing how far of a walk it was, but I didn't feel guilty about the calories. Hahah. We split a large pepperoni pizza.  Soooo good. Love the cheese, crust and everything about it! We will be back!", "author": "Valerie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "Great place to eat at after walking the Brooklyn Bridge. Got there about 11:10am and was the second person in line. By the time 11:30 rolled around the line was wrapped around the building. The pizza came quick and the service was good and quick. It's a small menu but the ingredients are fresh. We sat upstairs as there was a tour group that had the 1st level reserved for 11:30. There is no AC in the building and it's cash only.", "author": "Dan V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-04", "description": "I've had my fair share of pizza. My parents had a successful pizzeria and my god parents still have the best pizza I've ever had in my life. This place is infamous and maybe because this guy won all those championships in Vegas I expected more but his pizza is good none the less! Delicious, fresh and tastes good with a lot flavor.\n\nWe devoured the pepperoni. Small is 8 slices but it's a big small. $18 done. Enjoy.", "author": "Renee R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-27", "description": "Came here with my coworkers during our office outing.  We did a pizza tour with the \"A Slice of Brooklyn\" company and Grimaldi's was one of the pizzerias we went to.  \n\nWe learned some crazy history about this place...and that there are numerous locations.  The most famous location is the one under the Brooklyn Bridge at 1 Front Street (next door from its original location).  \n\nJust an FYI, Grimaldi's does NOT take reservations and the lines can get quite long and extend far up Old Fulton Street.  This place is cash only and does NOT sell by the slices.  Which is fine by me :D  The pizzas are known for being cooked in a coal-fired brick oven.  The pizzas are more crisp, lighter than what you'd expect and you can taste the coal in the pizza. Yum!  \n\nWe got the Margherita pie.  A traditional pizza with extra famous sauce and fresh basil.  We also had a choice of Stewart's soda: black cherry, orange creme or root beer.  We were not disappointed with this pie...and there were no leftovers!  We pretty much inhaled it.\n\nWe were seated right away since we were there early.  No lines had even formed at that time.  Thankfully, we were part of the tour where we didn't have to wait on line.  If I went on my own...I wouldn't want to wait on a long line.  Though, I wouldn't ever for any restaurant -- that's just a preference thing.  The pizza's good...but not wait in line for an hour good.  \n\nI would try this place at least one time in your life :) I got to experience it and had a great time.", "author": "Cat D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-18", "description": "I'm a Brooklyn native- born and raised and I enjoy Grimaldi's pizza. My boyfriend and I wanted to take a pie and eat it on the grass nearby. There is a sign on a plate that says \"Take away same line.\" The line was long and we didn't see another line for take out so we got on line hoping it wouldn't take too long. As we got closer I noticed people walking in and waiting in a separate line. I asked the woman who was seating others if I had to wait in line to order a pie to go. She replied with \"You're supposed to.\" The people who were standing on a separate line were waiting for their orders meanwhile my boyfriend and I stupidly stood in line. I asked if we could order a pie to go and she allowed us to order inside. At that point we waited 20 minutes already and were almost next in line. After ordering the pesto pie we had to wait an addition 25 minutes for it. We enjoyed our pizza however I would suggest having a second line for those who'd like to order to go. I don't think there are that many. Most of the people in line want to sit and eat inside. I prefer the Grimaldi's in Coney Island. I think it's bigger and not as crowded.", "author": "Lauren C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-07", "description": "Visited Grimaldi's Pizza from Yelp's recommendation. After walking through the Brooklyn Bridge, we all got hungry. It was a cash only pizzeria and we made sure we have cash. We ordered a white chicken cheese pizza with basil. But wow, it was a pretty tasty and very cheesy pizza. Definitely recommend when you're in town with cash.Will try pepperoni next time.", "author": "Arnel A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-13", "description": "I have eaten here several times and honestly it is worth the hype it is delicious straight forward fresh pizza.\n\nThe line can be long but it's worth the wait. Please note the line for to go and dine in is the same I don't know if it changes but they do have a sign on the door that says that. So please don't be an a$$hole and try to just jump the line or get a head.\n\nI ordered and got my amazing delicious pizza in 15 minutes. The place was super busy both floors were full. Staff is also super friendly and try to accommodate you as best as they can.", "author": "Gabby S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-26", "description": "I'm a huge fan of Brooklyn Bridge Park so when I visit the park you can't help but notice the crowds lined up just to get a table inside this restaurant. My girlfriend was visiting from out of town and wanted to go, she googled all the hot spots and this came up on her radar. I was shocked, when we arrived there were no lines. \n\nWe were seated quickly. We ordered pepperoni pizza. I was looking for more, with over 100 years of coal fired brick-oven pizza-making traditions, I expected so much more however I found this pizza was no different than any other slice of pizza that I experienced throughout the city. \n\nThe customer service was awesome and the atmosphere was friendly, patrons at a neighboring table were from Brazil. Definitely a tourist hot spot.", "author": "Letty C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-08", "description": "After a fun day of exploring DUMBO, my friends and I came here for dinner. The line was LONG (goes out the door) but moves at a relatively reasonable pace. \n\nThe service is great. The pizza was meh for the price we paid for and the time we waited in line. I was hoping that this place would live up to its hype...but I honestly won't be coming back here again for food when I'm in the area.", "author": "Joan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-24", "description": "I only added one topping (Onions). When the bill came I noticed he added three item which I did not order (Red Peppers, Sausage, and Pepperoni).Further more he also added 20% Gratuity meanwhile it says Gratuity not included.", "author": "Karen Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "Planning our trip to NYC, I knew I HAD to have Brooklyn style pizza. A friend recommended this place and it was one of my favorite restaurants. \nWe were tired and hungry after touring the city all morning and this place put the smiles back on our faces. \n\nThe five of us had the antipasti, a large pizza with pepperoni and jalapeños, and another large pizza with extra sauce and extra cheese. I think the pictures almost look as delicious as they were.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-14", "description": "Not up to par with the saying \"New York has the best pizza.\" But, it was still worth the money and worth trying out. \n\nI have gone to a different location, but since I was in DUMBO, I had to check it out while bringing my boyfriend on a tour of NYC. Everytime I am in DUMBO, I always see long lines outside of Grimaldi's, people waiting to be seated. We went at around 3 PM on a weekend and had to wait on line, but it wasn't too long. I didn't know there was an upstairs too!!\n\nWe ordered a large pizza with half cheese and half meatballs. The pizza was definitely really fresh and the mozarella was scrumptious. I wish they put more mozzarella though. The meatballs, however, weren't fully spreaded, there were more on some slices than the others. But it was still good. The crust was on the thinner side, although I prefer thicker crusts. \n\nThe service was good as well. Waiters were nice and the food came quick. \n\nYou can't order slices, which blows but I believe everyone can eat at least 3 slices!!! We actually walked the Brooklyn Bridge twice because of how full we were! This place is also cash only!!", "author": "Alison W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-09", "description": "We got a regular pizza with some garlic on it. Pizza was ok, not crispy even when we asked for \"EXTRA CRISPY\".  The taste was generally fairly mild. The sauce didnt have much tang or sweetness to it. Don't get me wrong its decent pizza, but nothing to write home about in NYC where there are tons of better establishments.  This place is purely coasting on its brand.\n\nWe also ordered the calzone. It was undercooked and soggy. Liquid just ooozed out.  They overcharged us and said they would correct it, but didnt until we asked.  We looked at the bill and it was just riddled with mistakes.  \n\nTo top it off, their own staff pissed all over the toilet seat.  If it wasn't for the semi decent pizza, I'd give this place a 1 star.  F this, im not coming back.", "author": "Jason C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-08", "description": "I paid a visit to Grimaldi's after my walk on the Brooklyn bridge followed by enjoying the night views of Manhattan from DUMBO.  All I had on my mind was pizza the whole time!  Grimaldi's was close by the waterfront and therefore seemed like the right spot to grab a bite.  The establishment itself gave off a homey vibe which was pleasing.  I ordered basic cheese pizza and I was underwhelmed.  The cheese was decent, however the sauce was bland.  I would recommend another pizza establishment, if you really want to fill your cravings for Brooklyn style pizza.", "author": "Zishan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-06", "description": "As a NY area native and former longtime NYC resident, Grimaldi's never really hit my radar as something to do as a local. On a recent visit home, though, we decided to play tourist and visit some \"famous\" NY pizza establishments. This is the original location so there is a lot of history to the building and the area. It's also a good place to stop after walking across the Brooklyn Bridge on a nice day. \n\nIt's all sit down and you have to order full pies (no slices). We split a small pie between 2 of us and it was a good amount of food; each of us was just slightly stuffed. The pie was freshly made for us and was pretty delicious. We got half pepperoni and half sausage and each was tasty! The crust had good flavor and was a good balance between chewy and crunchy, the sauce was slightly sweet with a nice flavor, and the cheese was not applied overly liberally and complemented everything well. \n\nAmbience feels a bit like a pizza factory - you choose a table that is pre-set with a menu and plate. Surprisingly, we encountered no line at noon on a Friday, but did notice a line start to form toward the end of our meal. We did not wait super long for our food which was nice, too. Cash only. \n\nAlthough I would not say this is the best pizza I've ever had (I'm actually sort of realizing that there probably isn't one singular \"best\" pizza in NYC - I like different things about each of my faves!), it was tasty, fresh and a reasonably good representation of NY style pizza. Overall a solid experience!", "author": "Christine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-23", "description": "OMG!!!  Run here and try this pizza!  I can never get enough.... EVER!!!  We had the regular pizza and a pepperoni!  They are both so delish but I think the regular cheese is my favorite!  The crust is so delish, the sauce is so flavorful, the cheese is out of this world heavenly!\n\nEvery time I come to the city to visit my daughter we come to Grimaldi's!  Ugh... I'm dreaming of when I will be back in August!  \n\nSeriously get here and try this place!!!", "author": "Allison C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "This was my first experience of having NY pizza and it was a really good experience. Unlike some of the other reviews, my service was immediate and I received my food quite quickly.\n\nThe pizza looked delicious and the taste followed through. Grimaldi's was also quite pricey and cash only.", "author": "Benjamin P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-02", "description": "Last Friday - June 1st, we wanted to get pizza for lunch before walking the Brooklyn Bridge with my family.  My sister had bookmarked Grimaldi's on yelp for sometime now, so since we were already in the area we decided to eat here.\n\nLine was fairly short when we arrived - about 6 people in front of us.  We didn't wait very long until we got seated - no more than 15 mins wait for party of 10.  There are two floors in the restaurant and we were seated upstairs.\n\nWe ordered 3 large pizzas.  \n\n1 Lrg reg pizza with pepperoni, mushrooms and garlic - it's super garlicky so if you don't like garlic don't order it with garlic.. but I do!! This was my favorite from our order.   It was so delicious!  \n\n1 lrg pizza with white sauce, chicken, sundried tomatoes and basils -  this was was good too but I though it lack white sauce.  I can barely taste it.  \n\n1 lrg pizza with ham, sweet red peppers and garlic.  - my sister wanted this pizza but I didn't really enjoy it maybe because I don't like sweet red bell peppers on my pizza. \n\nService was great.  Friendly and attentive.  The only reason we knocked out 1 star is that they don't serve alcohol.  Needs beer when eating pizza!!\n\nThey don't serve by the slice, and cash only.  They have ATM on the 2nd floor by the waiting area if you need to withdraw cash.  \n\nIf you're on your way to the Brooklyn Bridge or after walking the bridge, I definitely recommend this pizza place!", "author": "Junaline G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-04", "description": "Honestly, the bad reviews of this place are just the kind of negativity you don't need in your life. \n\nTLDR: The pizza is great. Bottom line. \nCould there be some improvements? Yes. \n\nFirst with the negative to get it out of the way. The service is incredibly slow. I agree with other reviews that  they keep the service slow so as to increase the line outside and keep the place looking desirable. There's no reason you should have to wait for 30+ minutes for a pizza after you've already stood outside in December cold weather waiting for a table for two for over an hour. That being said, the pizzas are made fresh to order and the place was completely packed (not an empty seat in the house) so I mean there is only so much they could do. \n\nThere is no alcohol or beer which is a real shame. Pizza+beer= match made in heaven. Get your life together and get a freaking liquor license. \n\nNow for the good. The pizza is amazing. I left with little cuts on the roof of my mouth from the perfectly crisp crust. The sauce is flavorful and not too sweet. They must pick their basil from god's herb garden because it is so pleasantly potent and delightful. The pepperoni tastes like you're back in Italy and the fresh mozzarella is unparalleled. For that, I'll wait two hours every time I'm back in the big apple. Work it off after by walking across the Brooklyn bridge as the restaurant is directly beneath it.", "author": "Kimberly T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-10", "description": "Brick oven pizza. Had half cheese half pepperoni. Delicious! Ambience is nice. Didn't have to wait long for the pizza either which is a plus", "author": "Carl S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}