{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "As soon as me and my friends arrived there was a line wrapping around the building, but boy was it worth the wait. The pizza was thin, the ingredients fresh, and the quantity just right. Definitely a must try, would recommend to any pizza lover. \n\nCons: cash only, long waits, okay friendly service", "author": "Joseph G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-07", "description": "It had been a long time since I last had pizza at Grimaldi's.   In fact it was prior to their move from the old building halfway down the block from the bank building on the corner it now occupies.   I remembered that pizza, the long lines to get in,  the atmosphere, family style seating and jug wine fondly.   In those days I would challenge any dissenters that it was one of the top three pies to be had in NYC.  I had often driven past the new location and thought that it was a nice step up and I have to go back soon.  For a multitude of reasons it took until last night.\nI could not have been more disappointed.  First the staff was rude and condescending.  When we walked in they looked at us and when we asked where to sit they just pointed and grunted.   I wasn't expecting more so I wasn't immediately turned off.   We ended up sitting at the counter.   It was then the disappointment of the new location began to sink in.   There was nothing special about the fitout of the space.  In fact it looked amateurish.  Still not turned off hoping for the pizza I remembered.\nIt never came, it was a pale shadow of the former glory of a pizza.   The flavors were nothing special and was mishandled in the short trip from oven to counter so that all of the toppings slid to one side.  There was no jug wine as in the past, with the menu printed caveat that a license was in process.   How long does it take?  They have been in the location for well over a decade if not two.  The drinks were bottled soft drinks as if I was in a bodega. \nThe final indignation was when I asked where we could pay (for what was really overpriced) and was look at and asked, \"you need change?\".   Rest assured I found a way to find enough cash to make sure I didn't need to make change, in a sum that reflected my dissatisfaction.   What we were given to take home in a bag that was as flimsy as the slices themselves was left for a homeless person who might relish the calories.   \nIt was my last trip to Grimaldi's.  What a shame, the neighborhood is better but the pizza is not.\n\nPoor representation of NYC pizza.", "author": "Bob K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-11", "description": "Very good pizza.  Worth the treck.  Individual pizza is on the larger side which is nice.   Reasonable value!", "author": "Jamie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-06", "description": "I have been here five times, so I think I can leave a fair review on Grimaldi. Customer service sucks, but food is great. Pricewise? Sucks. I went here with a friend today. A staff member acted very rude (took a silver plate while eating without saying anything). They included service tips, but we refused to pay. They said \" its okay, but dont come back again.\" I was at loss of any words. If you dont mind rude servers, you might want to try though I dont recommend it.", "author": "Josh Junsuk K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-15", "description": "If this is New York's best pizza, then it's a bit of a letdown.  Don't get me wrong, the pizza is good, the ingredients are fresh and the place is very presentable.  But the taste did not blow me away.  There have been times where dominos pizza tasted better.  Maybe that says something about me, who knows... Either way, it's good, but not great and if you're looking for something really outstanding then perhaps you should try another place. Not sure which place...my search goes on", "author": "Oleg I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-06", "description": "One word: OVERRATED.\n\nI don't understand the hype AT ALL.\n\nWait was 20 mins during lunch time on a weekday. We ordered a large pizza that was supposed to feed 3-4 people. We weren't starving by any means but between my gf and I, we were able to finish it no problem.\n\nThe pizza was $14 plus $3 for each additional topping which they're pretty stingy with.\n\nWe had to go try another pizza place to make up for the \"NY style\" pizza we wanted to have.\n\nI will not be returning here, there's just simply better pizza and better prices elsewhere.", "author": "Ivan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-30", "description": "this is a straightforward review:\n\nGrimaldi's has good pizza but is nothing spectacular. that being said, would I recommend you to try it? Yes - it has a lot of publicity and is regarded by many as one of the best pizza places.\n\nWould I go there again? Probably not because it is not worth the wait.", "author": "Ali B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-18", "description": "Lives up to the hype! All my friends who live in Brooklyn/New York swear by this place. Although I may have enjoyed it more since there was no wait at all (rainy night on a Sunday at around 7:30). Good service and they let us get a table before the rest of our party arrived.\n\nWe got two large pies, one sausage/mushroom and one sundried tomato/onion. The latter was okay, the former was probably some of the best pizza I've had. I love the blistered crust (though it can get kind of scratchy in your mouth) and the sausage was so juicy and was a perfect combo with the mushrooms. The cheese is thick and very fresh tasting, and the sauce was perfect. It can be soggy but I actually liked it that way as well. Very reasonably priced too considering the size and quantity (2 large pizzas for 4 people was perfect). I'll be back the next time I'm in Brooklyn.", "author": "Elaine W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-04", "description": "The problem with any restaurant that becomes an establishment is that it is bound to decline in quality in some aspects relative to other restaurants.  For example: the service was okay.  Our waiter was polite, but inattentive.  He took our order, brought our drinks and food, and the check (no check-ins).  \n\nThe pizza is good.  Better than most pizzas in the city.  However, the cost in my opinion isn't equivalent to what I felt I should receive.  For example: our pie was $22 for a large pie for 3 people (it recommends that it can feed 3-4 people).  Maybe I eat too much, but in my opinion it isn't enough food which means for 3 people you should be prepared to spend about $35 - $40 on pizza (about $11 - $14 per person plus tip) .  To provide some contrast, I go to my guy down the block  and get two specialty slice for $8 and I'm full.  So in short, I feel the pricing could be better. \n\nI recommend this place only if you tie it to an experience.  For example: walking across the Brooklyn Bridge with some friends or going on a date, and then stopping off at this place for a bite.  However, if you come here and you do not live in the area just to get the pizza, I recommend you save your time.", "author": "Jason K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-16", "description": "Went to the new location. Came around 4 on a cloudy Sunday. Line was not long.  Got in within 15 minutes. Since it was kind of nice out, were actually planning to take out and eat at the park but it is the same line!!! which is not making much sense at all.\n\nWe did see the inside since I had to use the restrooms and it was left unchanged from the old bar before.  Restroom was so dirty and had no toilet paper.\n\nI don't get that Grimaldi feel anymore... quite disappointed...", "author": "Agustin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-17", "description": "I wish half stars were an option b/c I'd give 3 and a half. My boyfriend prob would give 5 though. \nI'm not a huge huge fan of pizza so with that said, it's pretty good. The crust is to thin for me, and it was a bit burnt. Dont get sausage, it was flavorless. But the pepporoni is awesome and then there is the MOZZERELA. OMG. i would eat this by its self. I will be back, and ask for extra mozzerela with the amazing flavorful basil they put on top.\nCons... they were out of the only wine I'd drink there, out of black cherry soda, waiter was meh, out of the way to get to by subway , cash only , and it was really hot in there.\n The owner came by and was really nice.\nits a cool little spot with great pizza, itd def go back", "author": "Ashley J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-16", "description": "Getting hungry just thinking about it - it was good! But I think I also figured out why it tasted quite so good - the long line!\n\nWhat's also awesome about this place is that even though it's hella famous, it's still really cheap. And they're able to seat big groups well.\n\nSo for those of us who like to brag about eating at famous places, hate to spend exorbitant amounts of money on food, and are too, uh, laid-back for planning reservations - this is the place.", "author": "Valeria F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-02", "description": "I thought Grimaldi's was going to WOW me with their pizza. After all, people were lined up to get in here. If you have a small party of two, the Grimaldi worker will let you cut in front of the line and get in...just be sure you pay attention.\n\nWhy two stars?! Well the pizza was thin (as authentic as it would be in Italy, right?), tomato was decent but not too thick or rich and the cheese was alright. I think the weekly pizza I get at LA NY Pizza in Downtown LA tasted better.\n\nYou CAN'T buy pizza by the slice and it's CASH only. if you're not a big pizza fan, skip the line and pizza and head on over the Brooklyn Bridge for a nice stroll.", "author": "Mary C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "I love this place! The best pizza in NY! The restaurant is too busy and noisy but the pizza is so good I don't  mind at all! Friendly waiters and staff. I would definitely recommend this particular location, it's  the original and the best!", "author": "Dee L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-30", "description": "Gotta be honest, the crazy wait in line, not really worth it.  I was here on vacation and my friend had told me about some popular pizza joint across the Brooklyn Bridge so I\"m thinking like a dinky little joint where you just order pizza and eat it elsewhere, not expecting a restaurant with crazy long @$$ line haha.  \nDon't get me wrong the food was pretty good, even though the water wasn't cold and it was just sooo hot and humid.  One of the guys in line was just soaked through his shirt, looked like he walked out of a pool with his clothes on, no lie. \nThough it was cool to try something so popular in New York, I definitely feel it's a tourist trap, and for something not even really worth that much. I would have been much happier getting Domino's or Papa John's and NOT wait that long. haha. no bombdotcom.\n\nAlso, when I went, Grimaldi's didn't accept credit cards. X_X", "author": "Amy Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-27", "description": "Tried the marguerite pizza that they are famous for. Needed to sprinkle some garlic salt and oregano seasoning to give it some added flavour.\nCrust is nicely done but the sauce and cheese don't have much of a taste, plain I would say..", "author": "K M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-23", "description": "I went to Grimaldi's on a Sunday afternoon with Katie M. and Alex Z., who both live in Brooklyn.  It was the first visit for all of us, and after weighing all the factors, I'd guess it was the last.\n\nThe experience was just kind of a pain in the ass.  First, there was the forty minute wait in the freezing cold, during which we got the starting end of a light snow.  I expected to wait, though, and I understand that some things are worth waiting for.  But the annoyance did not end at the door.  Once we were herded in, the table service was terrible.  We were largely ignored, and the food took forever to come out.  We thought it was strange that our antipasto was taking a half hour (we ordered it because we were starving and figured it shouldn't take too long to slap a few meats and olives onto a plate), but we stopped wondering when our pizza came.  Our server apologized and said he had completely forgotten that we ordered the antipasto and gave us the option of ordering it then.  We said never mind.\n\nNow that the complaints are out of the way, I did like some things about this place.  The atmosphere was great.  Casual, old school, no slickness, and only a little bit of institutional pretension.  The music suited the place - Sinatra and the like.  When \"That's Amore\" came on, Alex noted, \"They must get sick of this song.\"  I had a Brooklyn Lager (mostly while waiting for, rather than with my pizza), and it was a nice refreshing beer to start my Sunday.\n\nThe pizza was great.  We got a medium red pizza - a classic Margherita with sausage on half - and a small white with mushroom.  The crust was excellent, with a pleasant yeasty flavor and a beautiful crunch to the crust, with a lot of flop in the middle.  The red pie was nice, though I thought a little more acid in the sauce would have gone a long way.  The basil was good, and the herby sausage was a lovely topping.  The small white pizza was almost as big as the medium, with six large slices.  The white pizza came with garlic and melted cheese, and it was pungent and flavorful, with a key assist from the earthy mushrooms.\n\nI wouldn't say, though, that Grimaldi's pizza was the best I've had, and I wouldn't go through the same amount of hassle to visit again.  That said, the crust was exceptional and I am glad I went.  If you want famous New York pizza, this is not a bad spot to get it.  Just be prepared for the attending headache.", "author": "Steph C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-13", "description": "Well I was disappointed, several times.  First when I started to go in and saw a big paper sign \"CASH ONLY\" and \"NO SLICES\".  But I really wanted to try the pizza so I went to an ATM and returned.  \n\nThe gentleman at the door was very stern but I guess that comes with dealing with tourists daily, I understand.  When he said \"stand here\" he meant \"stand right here\". I was solo and it was clear he was not going to waste a two-top on me.  Addressing me and a fellow solo patron beside me we were told \"you two can sit together and split the check\".  I was for it but fellow patron was there for take-out (to go).  So I waited...and waited.  And watched group after group be ushered in till finally the place was full and a line was forming outside.  This was Thursday night, 10/9.\n\nFinally a single patron left and I was allowed at the bar.  Let me say that this place could use a little cleaning and straightening up.  Oh and warning...no wine or beer at this location.  No red wine with pizza?  Yes it's important to me but I already had too much time invested to turn back now.  Shoulda checked Yelp first!\n\nSo I ordered the small white pizza with mushrooms, onions and tomatoes.  Note this is enough for two people!  And waited some more.  The word dinghy came to mind.  This may be blasphemous to such a storied institution but the place looked rundown.  It's amazing how critical one can be when hungry and craving wine.  Pictures of actors and actresses needed dusting.  The bar was sticky even after wipe-down.  \n\nAfter 20 minutes my pizza arrived piping hot with the crusts crispy.  It was so hot I had to wait after burning my tongue first bite.  I added a little  black pepper but that was it.  The mozzarella was fresh and creamy, onions, tomatoes and mushrooms still firm and plentiful.  The whole pie was garlicky, crispy and luscious except for in the middle where it was still a little doughy.  I wolfed down two pieces via fork and took the rest to go, to the delight of the hotel staff.  \n\nSince I had a 25 minute walk, I ducked into the restroom before I left and was thoroughly disgusted.  It was downright dirty and there was leakage or water on the floor with toilet paper all over the place.  I did not use the facilities.  The line was 20 people long when I left.\n\nI would not recommend going here to sit down and eat.  If you must try it, get it to go!  I thought I had better pizza at the corner of Smith and Atlantic AND they had wine.  \n\nTo be clear, it was not the pizza I had issue with, it was the attitude and the condition of the place.", "author": "Lisa V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-23", "description": "I have been to grimaldis a dozen times before and it is a toss up between patsys on 59th street but will have to say overall  that grimaldis is way better and the customer service there is way better", "author": "Alfred L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-19", "description": "A two-hour long wait for pizza?! I assumed Grimaldi's would be the BEST pizza I ever ate. My friends and I ordered two pizzas (one by way of recommendations from our server) and we all agreed they were good, but definitely not worth the wait. \n\nOur server also lagged on refilling our glasses with water.", "author": "Austin C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}