{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-27", "description": "AWESOME pizza!  Unfortunately, cash only and they don't sell by the slice (whole pie only) - plus the guy who \"manages\" the line outside has a really bad attitude.  I stopped going after a few times because the novelty wore off, but it's most definitely worth the wait!!", "author": "Vick S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-27", "description": "Cynical New Yorkers say this place is just okay. But that's what they say about anything that becomes too famous. It's actually quite good and definitely worth checking out at least once.", "author": "Paul O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-23", "description": "Adding to the general consensus here...had a great pizza in DUMBO on my visit to NYC; didn't have to wait too long in line (20 min tops), well worth the wait for good pizza which is woefully absent in DC.  Can't wait to get back again!", "author": "Cis D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-08", "description": "This place is not worthed. You have to wait outdoor for an hour or more and another 30 mins to get your pizza. The pizza is just plain like you can get from regular pizza place in nyc. The floor is filthy and the waiter is rude if you dont spend much money. The bathroom line is another 30 mins. You probably need to spend about 2 and a half hour for a 30 mins meal time. I will look like an dumbass if I come back here again.", "author": "Anthony T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-17", "description": "One day my friend and I decided to go to Grimaldi's since I have never tried it before. We waited in the rain for about over an hour just to be seated. I must say I have had better pizza than this. I recommend Artichoke! Very tasty and crunchy! Now, back to Grimaldi's...Grimaldi's pizza was really not all that. I recommend ARTICHOKE!", "author": "Ana S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-04", "description": "I used to love this place when I lived in Brooklyn Heights 10 years ago. Now the quality has declined and it's a crowded tourist trap/become a chain with multiple locations. The pizza is still good, but not like it was not and worth the wait (which used to be much shorter) anymore", "author": "Anika S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-04", "description": "Grimaldi's makes good pizza, I wont lie. The location near Brooklyn Bridge Park also makes it a great spot to take visiting friends to impress with the views after you finish your pizza. The line however, is another story, it does get quite long and waits can be up to 2 hours, during peak times. The interior is nothing special, but with the amount of people that go through their doors, its not the kind of place you want to hang around in and soak in the atmosphere. Overall however, you need to have gone to Grimaldi's at least once in your life.", "author": "Stanley M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-09", "description": "Great pizza. Only waited 30 mins. We had the pepperoni and a white pizza. They were both fantastic. The pizza came out very quickly after we ordered it. It was about a ten minute walk from the subway.", "author": "Matt L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-01", "description": "It's pretty good! I came from Washington, DC and tried it out. Its good but didn't really WOW me. So if there's no line i'll eat there but if there was a line its no big deal if you missed out", "author": "Hassen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-05", "description": "Thin and sweet crust. Delightful. I had the veggie pie and it was amazing. A big fan.", "author": "Melissa L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-16", "description": "So. Good.  \n\nI've been here a few times now, and on my most recent trip I remembered how good it is.  \n\nThe pizza comes out piping hot, and it tastes so FRESH.  Also, a big plus, I feel good when I'm done eating it!  Unlike some pizzas when afterward I just feel sick (grease guilt I suppose).  \n\nBe ready for the line, although I got there on a weekday at 11:30 and walked right in, so for a weekday trip that seems like a solution.", "author": "Kimberly P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-30", "description": "One of the Best Pizzas I Have Ever Tasted!!! They have a variety of delicious pizzas to choose from and the service is GREAT! The only small negative is the 30-60 minute wait to dine in or carry out, however it is totally worth the wait.", "author": "Jack B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-09", "description": "Over hyped. I didn't think the pizza was that great for the long wait prior to entering the store and then for the long wait as they baked the pies fresh. It almost felt like waiting in a movie premiere line, then leaving it to wait in the food stands. Kind of pointless. But that being said, if you are a tourist and interested in going to a NY staple, this is your place. I am guilty as charged since I did come once when I was visiting many years ago! It's like going to time square... you just have to do it!", "author": "Annie W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-28", "description": "Not sure what the fuss is all about.  Pizza was fine but not stellar.  Service was great.  Fun atmosphere.  I wouldn't wait on line for an hour for this restaurant.", "author": "Joan M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-21", "description": "Your best bet is to save the time you'd wait on the line here and instead travel out to Totonno's in Coney Island. The pizza here at Grimaldi's is good, but not the best, and the quality suffers because of the quantity. It's an assembly line. \nI went for the first time in over 10 years this weekend. And after waiting for them to open for a good 30 minutes, they ushered an entire busload of tourist in ahead of everyone that was waiting online. Not cool.", "author": "David O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-20", "description": "This pizza is as good as it gets. I struggle to describe what exactly about the pizza makes it so great. But when you start eating, you definitely want to slow down and enjoy every bite.\n\nThe lines outside are outrageous. We had to wait about 45 minutes before we got in but that is par for the course.\n\nThe seating inside is cramped and you can't order slices, you have to order whole pizza's", "author": "Janak S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-23", "description": "I had surprise take out from here and it was great!!  The line is always long so maybe go here for an early dinner or late lunch.  But I love it!", "author": "A B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-17", "description": "Best pizza I've had in NYC.  I haven't been to that many, but still one of the best pizzas I've had here.  There is a trick to ordering pizzas here - don't go overboard with the toppings.  NYC pizzas are thin crust and are known for that crispy crust - if you get too many toppings - the crust won't be crispy anymore.  Limit the toppings to 2 or 3 and you'll be good.  We got pepperoni and mushrooms and the last slice was still crispy 30 minutes after the pizza came to our table.  \n\n1.  The sauce - excellent!  It doesn't taste like tomato paste.  It doesn't taste overly sweet.  You can taste the herbs in the sauce.  You can taste the garlic that went into the sauce.  The sauce has a good amount of kick too.  Great sauce!\n2.  The cheese - go and get extra cheese.  Otherwise you won't get enough.\n3.  The toppings - pepperoni was great, mushrooms were awesome.  You can tell the quality of a pizza place if they use canned mushrooms or fresh ones.  They use fresh mushrooms here.  Also, go get some extra garlic - adds so much flavor!", "author": "Venk R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-03-17", "description": "I don't understand the hype.  Our pizza was half mushroom-sausage, and half pepperoni-roasted-pepper, and garlic over the whole thing.  The toppings were good, I liked the mozarella and the visible pieces of basil.  The edge of the crust was burnt (brown is ok, black is not), and the whole middle of the pizza crust was unpleasantly soggy.\n\nEven if it weren't for the hour long wait (at 3pm on a Saturday), the crowded seating, and the tourists, I wouldn't return.  My friend and I agree that Costco pizza is better.  At least they're never burnt or soggy.", "author": "Jane L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-12", "description": "Awesome brick oven pizza.  Difficult to reach by subway but worth the walk.", "author": "Warren M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}