{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-18", "description": "Was excited to try Grimaldi's with my wife and sister. The actual experience was terrible. Our pizza was burnt, came out after other people's who had sat down way after us, and they forgot to bring out one of the items we ordered. Then we sat there waiting for the check forever. Never going back and I suggest anyone reading this will not go either", "author": "Eitan H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-19", "description": "Walked in to face such an anxious and angry hostess. She must have landed a wrong kind of job, poor thing. Tried to speak to her \"manager\", who might have been her cover up. The place suffers from the lack of customer service. Experience and pizza are overrated. Would not even give 1 star, if that was an option.", "author": "Anna H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-16", "description": "Still my favorite pizza place. I've been to the locations in New York and Vegas and love them all. Please open one in LA! We need a good New York pizza joint.", "author": "Cristina T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-07", "description": "More like 3.5 and I just had pizza.\n\nIt was my last day in New York and I was walking around exploring Brooklyn with a friend on a Sunday afternoon when we saw a crowd of people from afar. There was a line that must have been two hours long at two places that were next to each other, so we decided to order a pizza from each and compare them. I was trying to eat as much pizza as I possibly could while I was in New York so I was all in. \n\nWe got margarita at each and honestly they tasted almost identical. I mean I'm sure some people reading this might be rolling their eyes and say one is waaay better, but it was virtually the same pizza. I mean there were some subtle differences, like one had a slightly sweeter sauce, which my friend said she preferred if she had to pick one. I was indifferent. \n\nI honestly don't remember which was which, but it didn't matter much to me, both were good but I can't say it better than some the wood fire pizza I've had in LA. \n\nNow this totally isn't their fault at all, but I completely regret going here because it was more New York style pizza I missed out on, which I can't get in Los Angeles. It in all sincerity bothers me every time I think about it. \n\nAlso i have to say, had waited in that line I would have been utterly disappointed. I just don't understand waiting in a line that long for anything, much less food. I mean that not their fault either, maybe that's why there is place next door. \n\nBut to sum it up, it's solid wood fire pizza and so is the place next door, but neither wowed me or seemed definitively better than their competitor. So much so that I'm posting this review for them too.", "author": "Joe F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-04", "description": "I don't recommend! Place is crowded, waiters are hard to find, pizza is not as it should be!\nFrom outside it looks like very interesting Italian pizza place and you really wish to give it a try. Expect truly Italian pizza but instead you get a huge over cooked pizza dough with just a tiny bit of a fillings. Pizza dough with tomato sauce cost around 21$ but add each topping 2-4$. Our pizza cost 46$ (ham, chicken, tomatoes, cheese, basil). Looks tasty but not tasty at all.\nPlace inside looks interesting, but I also didn't like they serve disposable dishes.\nHave a feeling that they just try to earn as much money on tourists as they can and don't care about guests.\nI think lots of tourist feel the same.", "author": "Wonder W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-08", "description": "Came at a very random time, 4:30 on a Sunday and so the two of us only had to wait about 20 minutes before we were seated upstairs. It was dark, they were paper plates and plastic forks, and the server took our order very quickly. Pizza came out maybe 15 minutes later, hot and fresh. \n\nI'm no pizza connoisseur, I can just tell you what I think tastes good and bad. The pizza was good, I can say that much. We got mushrooms, onions, olives, and pepperoni on half. I'm a fan of the pitted whole olives. And the crust. The large size was perfect for the two of us as well. \n\nHowever, I feel the need to mention that they add tip for you, about 20%, no matter the size of the party. I personally did not feel the service warranted a 20% tip. I disapprove.", "author": "Myles C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-30", "description": "Had the WORST EXPERIENCE EVER!! \n\nI went to this place JUST because there was a huge line at juliane's. When we got our seat near the entrance, we felt that it was pretty hot and there was no proper air conditioning. We asked the waiter,  \"it's so hot in here, is the AC even on ?\". He gave a grump reply as \"Yes. \" and just took off. When he came back again, we asked \"is there any spots which will have some cool AC? Coz it's really hot in here\". He goes like, \"Cool spots eh? Go around and find for yourself \". We were so shocked seeing that kind of a behavior. We later had to go upstairs and find a spot which was \"bearable\".\n\nNow, coming to the pizza - I liked the way it looked; thin and crispy. But it tasted all salty ! I have had pretty bad pizzas before, but those had a lot of cheese and no veggies or un cooked veggies etc. But none of them were THIS salty. Man even I can make better pizzas than this. \n\nI know this place is like really really old and I cant expect good air conditioning, but this kind of attitude towards customers especially tourists like me was just SO bad.", "author": "Hari K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-29", "description": "The reviews for this place is real. Simple, fresh and amazing. \n\nWe got to Grimaldi's when it opened, we were seated immediately. \n\nService was good. Make sure you bring cash, they do not accept credit card. If you forget, they have a ATM in the restaurant", "author": "Tai D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-28", "description": "We took the subway over to Brooklyn during our trip to New York. My boyfriend is a Grimaldi's fan and wanted to eat at the original location.\n\nWe went for lunch and we were seated right away. The building was old but cozy. We sat on the second level and could overlook the pizza being made downstairs.\n\nThe one thing I was very disappointed about was no alcohol. I was really looking forward to a frosty beer with my pizza but the waiter said they were still waiting for an alcohol permit three years later. How long has this business been running here?\n\nThe pizza was good, not great. I have honestly had better pizza at the franchise locations.", "author": "Becky K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-07", "description": "Can we get an AC installed up in this place? \n\nPhase 1:\nWe walk into this buzzing joint. Hoping we can get attention and get seated..... no? Okay so we walk over to the man sitting by the door doing some sort of book keeping. He says,\"go to the second floor\".\n\nWe get to the second floor and the gentleman asks who sent you? Emm okay.. the \"guy\" downstairs. \n\nPhase 2:\nWe ordered the pizza from a simll menu quick and easy. \n\nPhase 3 (Pizza time):\nPizza etiquette, serve me the first slice mr. I'm starting to think pizza etiquette is a Chicagon\n thing.  \n\nFirst bite into the slice and I just didn't want to stop. That sauce (on the sweeter side) and cheese was excellent. Crust was alright.\n\nWas it worth it? I would say so. Why did I give it a 3 rating? Overall experience was very poor. \n\nPrice was great. Comparing to other places I would say the dollar goes the furthest here.", "author": "Zain A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-12", "description": "Great place for some pizza!  Nice simple and what better way to get authentic Brooklyn style pizza than in Brooklyn and under the Brooklyn bridge.  I'm pretty sure that is as authentic as it gets!  We went around three had no wait and got our food fast!  It was delicious!  I've been before in the evening and it took forever due to the crazy amount of crowds so just a heads up.", "author": "Keith H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-25", "description": "Stopped by here before closing the other night. It was empty and no line to get in. We ordered a margarita pie and it came out quickly. Since they had just recently re-opened from being shut down, there was paper plates, plastic utensils and plastic solo cups. Their liquor license is also pending as it says on their menu. I thought the pizza was great, however, my boyfriend thought it was just okay and didn't live up to the hype, he even said that Juliana's, the place on the same block was better. Also their menu is very limited, no pastas or other entrees. Not sure if it was always like that or because they just reopened.", "author": "Nicole K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "Grimaldi's under the Brooklyn Bridge is a New York institution.  This is where I take my guests when they come to visit New York.  Now, if what you want is the original Grimaldi's, then you should come here.  Why?  The original Grimaldi's was sold off to the current owner of Grimaldi's and the original person who opened up the historic Grimaldi's is actually next door now at Juliana's Pizza.\n\nI take my guests here because the pizza is essentially the same at both places and they all know the Grimaldi name.  Some of my guests have done their research and know about Juliana's, so for those guests, I take them to Juliana.  Everyone else is happy to go to Grimaldi's.\n\nAs long as you come here realizing it's a tourist spot, you'll have a good time.  It's a place for tourists, but it is not a tourist trap.  They actually make very good food here.  Don't be intimidated by the line since it moves quickly and is part of the experience.\n\nThe pizza itself is wonderful.  Nice thin crust with a bouncy cornicione on the edge.  The tomato sauce is nicely fresh tasting and acidic.  They use good sliced mozzarella.  And the pepperoni is made with natural casing so it \"cups\" up and the edges burn a bit in the oven.  The \"cupping\" of sliced pepperoni is a sign of good quality pepperoni.  I would suggest you either stick with the plain cheese pie or add pepperoni.  Or add one ingredient of your choice.  These pizzas don't hold up to adding too many ingredients on top.\n\nSurprisingly, the thing my guests tend to enjoy the most is the spumoni gelato truffle.  I have no idea how they cut this thing so thin so cleanly and I have no idea how they make these so delicious.  It's a perfect ending to the meal and should not be missed.\n\nIs this where I would go if I'm craving pizza?  No.  But this is where I would go if you have guests in town and want to show them a good time.", "author": "Henry M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-24", "description": "This place was okay. The food was pretty good, the crust was a little chewy for me. However it was not bad, the reason for the 3 stars is it had a really bad smell. Like wet paint mixed with mildew or something. Though I got over that after about 10 minutes. The seating situation is ridiculous. We sat upstairs there was a large party table behind me, we were back to back with them. But the problem was there was a table to get to behind me and the person behind me. So I had to sit at a awkward angle and so close to the table for the server to get to them and for people to get out. It is a horrible arrangement. I almost want to give it a 2 star because I was so annoyed of people bumping into me and making me squeeze into no space for them to get by.", "author": "Jackie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "From City Plaza over the Brooklyn Bridge and to Grimaldi's I go. I have to say that the walk was well worth it..\n\nThe pizza crust was thin and cooked to perfection. The sauce and combination of meats and cheese...delicious. \n\nThe staff was very friendly and  the restaurant and bathrooms were clean.", "author": "Richard S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-26", "description": "Great pizza! Long wait, but not too bad if in good company. Cheese is tasty and love that they add basil. Paper plates plastic cups. Bevarage are all bottles. Dont expect anything fancy. But overall, homey and good ambience.", "author": "Martha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-30", "description": "Was worth the half hour wait outside. got pepperoni and Sausage it was very tasty and thin . Worth the wait , will go again", "author": "Regg C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-23", "description": "I get Grimaldi's is a staple in DUMBO however, having traveled to Italy and being spoiled by the food in my area, I was underwhelmed by my experience.  For starters, it's housed in one of the oldest buildings in Brooklyn and the cobwebs and dust will attest to its age.  Some may say it adds to the charm, I may have been able to overlook this if the pizza would have been better.  But if I can see dust and cobwebs in the restaurant, what does the area where the pizza is made look like?! \nI had a couple friends who are transplants from New York recommend Grimaldi's and now I can say I've had it and would recommend they return as it may not be what they remember.   I think it's just the nostalgia they may be holding on to.", "author": "Karen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Arrived here for a late dinner around 8:20PM. Line was not at all long like usually. We waited 5 to10 minutes before the big host let us in and sat us in the corner adjacent to the ladies room.\n\nThe service got to our table kind of inappropriately as we were waiting just for water for what seemed like 10 minutes. When we finally were introduced to our handsome gentleman, we found out he was actually taking care of us as well as hold up a conversation, though it be short.\n\nMy advice is get to know your waiter and maybe he will comp the dessert the way my waiter did. I want to thank u so much for this sweet gesture, M! \n\nSo good.\n\nI always get black cherry soda because I don't know where else has this which is close by me...\n\nI got large pizza with toppings, extra cheese, n extra sauce! Always worth the 6 bucks for the extras.\n\nToppings are all 3 each and they have oven roasted peppers as their topping.  \n\nWarning: I highly recommend; it can only be found at Grimaldi's!\n\nWow! What a pizza!", "author": "Marie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Came in on a Wednesday night it was pretty empty got to sit anywhere I wanted \nSplit a pie with a coworker we got mushrooms garlic and pepperoni it was delicious \n\nWe specifically asked for it well done it was cooked to perfection not too flimsy at the end and not to burnt of a crust, just perfect\n\nWould strongly highly recommend !!!", "author": "Hugh D."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}