{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-31", "description": "Coal Brick Oven Pizza is our #1 choice and this restaurant got it just perfect! Smoky taste in the crust, delicious sauce and incredibly fresh toppings made my day. Was there first time and will be coming back a lot. Thank you for making this pizza, you guys RRRRock!", "author": "Ledempire.net D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-18", "description": "I was told by several people to go to Grimaldi's for a NY slice... and they lived up to expectations. Sausage and mushroom and capers pizza with a nice cold root beer :) and it was good at room temp the morning after, too!", "author": "Anna K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-02", "description": "This is more a 3.5 but not a 4 star. \n\nWe ordered a white pizza with mushrooms and a red pizza with pepperoni and sausage. Red pizza was good, the white pizza had a lot of mushrooms but lacked a little flavor/salt. Waited about 35 minutes for pizzas to come out. Crust was hot and crispy. Only issue we had was having to swat away flies while we were eating. It was a hot and humid day so it was probably hard to keep the flies from flying inside. The wait to get seated was not bad and glad we went for the experience. Will need to try Juliana's to compare.", "author": "d r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "I am from Chicago so I was pretty skeptical trying New York styled pizza because I love deep dish and crispy thin pies but my husband absolutely loves pizza so when we saw how many reviews this place had, it was a must try. A few days earlier we had eaten at Lombardi's and it was good but not great so I was even more skeptical to come try another pizza spot in NY. I was pleasantly surprised by this place. We got a small pizza between my husband and I with half jalapenos and half regular. The sauce was really flavorful and I loved the touch of fresh basil. \n\nI would recommend this place for someone who likes thin pizza that isn't crispy.", "author": "Tina D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-08", "description": "Excellent food! One of the best pizzas we have ever tried. Warning: there may be a wait line!", "author": "Kevin H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-29", "description": "Food was delicious. Restaurant has no air conditioning. They only accept cash. the crust was cooked perfectly and was not burnt at all. Some coal fired places I've been too tend to burn the crust.", "author": "Fausto S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "DELICIOUS PIZZA. but I will warn you if you order black olives on your pizza beware they are pretty salty. Only giving four stars because there is literally no salad or anything like it on the menu. So if you are gluten free or just don't like pizza that much, don't come here. If you do eat pizza then it's a great place for a group and the wait is worth it! CASH ONLY!", "author": "Sam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "So when you think of Brooklyn and food, you think pizza...And what better place to come than to check out Grimaldi's. I conquered the walk across the Brooklyn Bridge so I decided to reward myself with a nice slice of pizza! Or 2....Maybe 3, you'll never know ;)\n\nThere was a line out the door, But that is when you know the food is good and the wait went by quickly. I was with my former college roommate and Since there was only 2 of us they sat us at the bar and we shared a pepperoni pizza. It was declious!!!!! I lived It. We devoured It! The pizza was cooked to perfection and the cheese was gooey and melted and a great texture. \n\nThe place is cash only and very crowded, but the service was quick and friendly. I definitely recommend this place and would gladly come back!!!!", "author": "Nikki V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-27", "description": "The pizza was awesome... crust was fresh :) 1 large is good for 4 people. \n1 star less because center of the pizza was little uncooked \u0026 it was a sunny day but the 2nd floor of the restaurant was a little hot \u0026 stuffy :(", "author": "Avani K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-22", "description": "Coasting on Reputation \nMy son and I stopped in, not the first visit for either of us, because the pizza is good and we were in the neighborhood. \nThey were more than 5 minutes late opening, and though far from busy on a Thursday morning, they crammed all the patrons into one SMALL corner.  Once they brought out the food, server did not come back to inquire about food, refills or anything. We even had to wait for them to notice we were finished and needed the check.  \nSo while the pizza was good, it was not good enough to make up for lackluster service.    \nIf you still plan to go, take cash; they don't take credit cards.", "author": "Diane G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "You just have to!! \nWe made a return visit to Grimaldi's while over in Brooklyn, we hadn't intentionally set out to come back..... but that smell lured us to keep walking and there we were.... right out the front! \n\nThere was a shorter line than normal, although it was afternoon not evening and oh lord...... when we ordered the basic pizza and took that bite - it was amazing! You can't beat a meal of Grimaldi's pizza with a coke to top it off. After walking across the bridge I am pretty sure the calories even out also!", "author": "Linda A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "There's a reason this is a pizza fan's destination. They say when we arrived a tour bus was getting ready to come in and take over the first floor. Nice business if you can get it. And they get it. This is one of those pizzerias that when you eat it and go back to your home state....you don't eat pizza for quite some time. Unless you are from Chicago and that is a discussion for another day. And don't forget: CASH ONLY", "author": "Tony W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-23", "description": "I was EXTRA excited to have this pizza because a friend from across country recommended it.\n\nDo you ever watch a movie everyone hypes up \u0026 says it's amazing but it ends up being....just \"ok\"? Well that was my experience here. We can't always believe the hype. \n\nI live in Oakland \u0026 there's a spot nearby who has better pizza. Of course theirs is $5 more, but this place could have done something more about their sauce \u0026 also more about the basil they didn't throw in the pizza we got. *cough, WE DID GET ENOUGH BASIL, cough*\n\nTheir crust was great! And I usually don't eat crust, but I devoured theirs to the end. It was their lack of basil (which is simple) \u0026 their way to stand out amongst thousands of other pizzerias in the broad state of New York who is known for pizza. We even had to wait 30 minutes for this pizza! \n\nIf this was a Tinder find, I would say, \"I like you, but not enough for a second date.\"", "author": "Janelli B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-23", "description": "I still love the pizza here! I've been going to Grimaldi's for a very long time. The lines are long and it's always packed. It's definitely a tourist attraction. The staff are wonderful and the pizza delicious! However, sometimes because it's so packed the pizza gets a little under cooked. Nonetheless, I would still come here whenever I'm in in dumbo!", "author": "Hyman S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-05", "description": "They lost their touch. I had to \"shoo\" flies away from the food and off of me the entire stay. The plastic plates and utensils were a turn off to. Something has changed since the last time I been here. The pizza wasn't as good as I remembered it :/", "author": "Meea R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-30", "description": "I've heard it's the best pizza in Brooklyn , but Hell NO I refuse to wait in this insane line for an hour !!!! so every time I'm in dumbo I'm checking the line and hallelujah no line today , probably cause it was too cold. \nWe've ordered the large pizzas with extra topping and waited patiently to try the best pizza in New York .\nTo be honest , nothing is amazing about this pizza , Just a regular slices with yummie cheese and thin crust but that's all ! Nothing special about it . It was good but over rated for sure .", "author": "Shani A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-26", "description": "We waited for a table for a long time\nThey always have a lot customer \nBut I feel pizza is so so\nNothing really special \nIt just really near Brooklyn bridge", "author": "ViVi C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-19", "description": "This was the most disappointing meal we had on our trip. I noticed on Yelp and Trip Advisor there were mixed reviews for this restaurant - from those who raved to those who said to avoid at all costs. And I wish I had listened to the latter.\n\nFirst of all, the lack of line up should have tipped me off. It was around dinner time on a Tuesday, and the restaurant was maybe half full, even though there were supposedly hour long waits during peak hours. We looked upstairs as well as downstairs, so we had a pretty good look around the restaurant.\n\nSecond of all, service was definitely lacking. No one brings you to a table once you enter, or even acknowledges you until you ask for assistance. For a place that seems to cater to tourists, that's a red flag.\n\nOnce we were seated, the waiter was impatient with our questions. Yes, we're tourists, but if I need clarification on the menu, I should be able to ask without any attitude. He made us feel rushed, even though there were plenty of staff for a half-full restaurant.\n\nWhen our pizza came, we asked the waiter who brought it to take a picture for us. He made no eye contact and blatantly said, \"I'll get your server to do it\" and ran off. We ended up waving down our server to take a picture as he clearly did not pass on the message.\n\nWe ordered a small pizza to share between the 3 of us, and 2 drinks. We got a standard red pizza with 2 toppings, which are an additional charge per topping. The pizza was okay. Not amazing, nothing special. The pizza by the slice my mom had near our hotel in Manhattan was better. The bottom wasn't crispy and the toppings were not abundant. It came out to maybe $20 for the pizza and $3 for each drink, for a final bill of around $26.\n\nNow, here's what got me to the 1 star rating. Upon paying for the bill, we noticed and expressed that it was a bit more expensive than expected. The cashier and waiter, awaiting payment, did not say anything. Looking closely, we saw a $5 charge although we didn't get anything that was $5. So, we asked what the $5 charge at the bottom was for. With lots of attitude and impatience, the cashier explained it was a service charge. They said that at the bottom of the menu they reserve the right to add a service charge. He said, and I quote, \"We get a lot of tourists here, we add a service charge.\" This makes no sense whatsoever. I asked how the service charge was calculated - a percentage of the check? He rudely said it depended on the size of the party. From my calculation, $5 on a $26 bill is almost a 20% service fee. Ridiculous - especially because we had felt that the service was so lacking, they barely deserved a tip. The small print at the bottom of the menu did have the disclaimer, so we just paid and left. Just because an establishment decides to impose a service charge does not mean that they can treat their customers poorly. Searching Yelp reviews after this experience, I noted that many reviews said that this service fee is possibly illegal, as it is only allowed for large parties. We were a table of 3. Grimaldi's is clearly taking advantage of tourists who don't know the rules and laws. I would never eat here again and tell anybody who plans to visit Brooklyn the same.\n\nLuckily, just next door, there is a good alternative - next time I'll go for Juliana's, which was also recommended.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-10", "description": "This place came highly recommended from several friends and it did not disappoint. The pepperoni pizza came out piping hot, with fresh basil and melty mozzarella. And the pepperoni were curled up on the edges, just how I love it! It was totally worth the wait.", "author": "melissa p."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-24", "description": "The place is so overrated. Food is terrible as well as a service. Even the line outside is fake. The personnel don't let people to come inside, just to make an impression that they're so busy. When I got inside, half of the tables were empty. Perhaps they do not have enough stuff to cover the whole place. And also they don't take credit cards, CASH ONLY, which is very inconvenient.", "author": "Tata P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}