{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-02", "description": "I took the subway from Manhatten to Brooklyn and the ride wasn't as bad as i thought it would be.  However, we were freeezing while lining up outside of the restaurant.  The line was very very very long but it kind of went by fast even though my toes were frozen.  Come on a nice day when it isn't that cold because u will be waiting outside in line.  We ordered a small pizza which fed the three of us.  The pizza was okay...just your usual pizza nothing that fascinating.", "author": "jennie t."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-24", "description": "Long Lines and Cash Only. That's a sign of one of the top 10 pizza joints in NY.  I recommend adding capers and olives to your pie.   As good as Grimaldi is, Di fara's is still the best pizza in NY.   It's better to just order a pie and have it at the promenade.", "author": "waisum t."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-09", "description": "Long wait, No slices, no CC, but THAT is a damn good pie.\n\n\n\n(we had some customer service issues, but it ended well...owner comped our meal.)", "author": "Andrea S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-19", "description": "3.5 stars.\n\nCame here for only the 2nd time in...6 years??  Shared the antipasto platter, a large pizza with garlic and basil (recommended by T), and a medium pizza with sausage and mushroom.\n\nThe antipasto came with 4 slices of mozzarella, 4 slices of salami, 4 large green olives, and some roasted sweet red bell peppers.  The platter was yummy, especially with the mozzarella and peppers heaped over the crunchy toasted bread served with it.\n\nThe garlic and basil pizza was pretty good, but either it was too garlicky or I felt the garlic was a little....rancid?? But the sauce was tasty, the cheese melted and gooey but not too thick, and tasty very thin crust.  The sausage and mushroom pizza came out watery (??) which proves to me (again) that the thinner the pizza crust, the better the pizza tastes with LESS toppings to weigh it down.  \n\nI also had a cannoli, which came with chocolate sprinkles and plenty of cream! Yummy!!\n\nWe waited about 40 minutes outside on a Sunday night, finally being seated around 8:45pm...and when we left, there was still people waiting to be seated at almost 10pm.  Pizza was good, but I've now had better.  But it's still a fun place to come check out!", "author": "Junkfoodie Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-18", "description": "The pizza's all right. Given that (a) this place is in New York, and (b) it bills itself as being some of the best pizza in an already pizzalicious town, I thought I'd be more impressed. I've had much better pizza at Pepe's and Sally's in New Haven.\n\nI ordered a plain cheese pie, which for me is the true test of how good a joint can cook a pizza. The sauce: great. The crust: just OK--good consistency, but not very tasty. The cheese: fine. The spices: fine. But it wasn't excellent. It didn't leave me drooling for more. What leaves me drooling for more (aside from the New Haven venues) is Ben's near the 4th St./Washington Square stop in Manhattan. Now THAT is killer pizza.\n\nI would go to Grimaldi's again. I just wouldn't rave about it.", "author": "Kathryn B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-01", "description": "Pretty disappointing and not worth the wait.  The other reviewers were right on when they said the pizza is soggy.  While ordering too many toppings may add to the sogginess, I think it is the watery tomato sauce that really did the pizza in.  If (when) you get stuck waiting for the one bathroom, keep an eye on the guys making the pizza because it explains why the toppings are clumped in a random pile.  The dough and crust was great, but unfortunately it was charred on most of the pizzas we saw.  This place was probably great once, but now it is just coasting on the name.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-06", "description": "The pizza is truly some of the best ot there. I went on a cold and rainy Saturday afternoon about 2 hrs after opening and had to wait about 40 minutes. The wait was worth it, as the food was divine. Great atmosphere, hole in the wall location. I split the antipasto and a large Margherita. The antipasto is not very large, but is very good and features fresh ingredients. The pizza was excellent, oozing with quality ingredients, and the 1000 degree coal oven cooks the crust just right. The service is fine, I know people complain but i got my food very fast with a smile. 2 people, Antipasto, Large Pie, and Drinks came out to 35 with tip. Great food, and price. Fabulous Experience", "author": "Joe D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-10", "description": "Yeah, yeah I know-everyone loves it, its out of this world, etc etc. \n\nRegarding the Grimaldi's itself-I totally agree. BUT, why I really love this place is how you can make a fab afternoon of it, especially if you have someone in from out of town. \n\nSample amazing NYC day for you and a gal (or guy, slightly altered plan though) from out of town, or just needing a little staycation:\n-Go to Century 21 and stock up on lovely discounted couture lingerie.\n-Get out the camera and walk across the Brooklyn Bridge\n-Spend a few minutes walking in circles trying to find Grimaldi's\n-Get in the line and make a friend-asap\n-Offer to trade off waiting in line with this friends group, to which they will likely say \"Sure, we will hold your spot.\"\n-You and your pal ask the people in the front how long they have been waiting so you can gauge how much time you have to essentially let someone stand in line for you, while you find the nearest bar and get the afternoon party started (We went to the place right on the corner, which had really awesome infused martini special-wild blueberry gin? Hello.\n-Come and check in with your 'friends' after like 30 min, then spend another 10 finishing up your drink(s)\n-Get back in line, showering thanks on the poor saps that stood there for 45 min.\n-Get called it, sit down, immediately start flirting with the very funny waiters and pizza chefs (they should be called that-they rock)\n-Order a carafe of wine, and a small pizza if you are 2 ladies sharing (its HUGE). I had mushrooms and anchovies on my half and had one piece left.\n-Save some room for the dessert-the tarfuto, tartuto sp? is this delish icecream roll with chocolate and vanilla covered in a dark chocolate shell with a little touch of raspberry jam, and the canoli was great too.\n-Have cash, dont take cc's, and don't take pics of the chefs. While the waiters hijacked our camera and took numerous pics of themselves, the chefs don't dig it. \n-If you can, walk back over the bridge. If not, the train is a few blocks away.\n=All the makings of a great day", "author": "Meredith M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-08", "description": "You shouldn't pass up the opportunity to eat at Grimaldi's! They make some delicious pizza! What you should know -- you wait outside in a line until they can fit you at a table you'll likely share with others, you must pay in cash, you order by the whole pizza. With that being said, it's definitely worth it!", "author": "Laura L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-15", "description": "awesome pizza. i've only been to italy once over 10 years ago but im goin to go out on a limb and say italian pizza tasted like this....or just dream that it did.", "author": "aron w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-26", "description": "Great pizza and low prices considering it is a\" must\" for tourists. Get pepperoni (amazing) and don't bother with the somewhat bland white pizza. The line was about 40 feet long, but it only took 30 min to get through it. Have some ice cream from the adjacent candy factory while you wait. One of my favorite meals in NYC. Great service too.", "author": "Zack F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-11", "description": "the priority list for good pie is as follows:\n1. oven\n2. dough\n3. sauce\n4. cheese\n5. atmosphere\n6. toppings\n\ngrimaldi's has a great oven.  their dough is good.  their sauce and cheese are also good but the tourists kill it with that \"brooklyn bridge walk.\"  the toppings are good.  i will forgive the shitty atmosphere because the business was there before the tour groups started braving it over the bridge. so i should give it a 3.5 star but the pie is good (4 star)", "author": "Diego G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-18", "description": "This is what pizza should be! If you can put up with the tourists and the lines it is worth it. I would have given it a higher rating but they play games with the line. It gets me ticked off when after waiting 30 minutes, some guy and his family cut the line claiming they are a friend of someone and a Robert Loggia, wannabe , let's them cut in front of everyone. Not cool!!!!!!", "author": "R L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-09", "description": "Grimaldi's is just plain awesome. On every trip to NYC, I will make sure to wait in line for the best pizza on earth. Very simple place in a rundown building, but the prices are low and the quality of the food is very high.", "author": "Allan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-06", "description": "Definitely one of the best pizzas I have had. I think what makes the pizza so great is that the mozzarella is so fresh. I probably could have eaten a whole pizza by myself.. :) The wait was over an hour, but it was worth it.", "author": "Candice K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-05", "description": "we werent planning on stopping here to eat but ended up here and glad we did! walked the brooklyn bridge from manhattan and asked some policemen where a good place to eat was and they suggested grimaldi's. cant believe the two of us ate the whole pizza it was sooo good! we'll be back!", "author": "Lisa A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-02", "description": "The pizza was good, not amazing. Definitely not worth the hour + line. I live in NY so don't care that much about killing some time. But if you're a tourist, please don't waste a few hours on this. You can find better pizza (and atmosphere) at a number of places in NY that don't torture you with this line (which applies whether you are eating in or doing take out). Motorino, Lombardis or Totonnos are all better options for pizza. If you have to eat here for some reason, if it's nice out, get a pizza to go and eat out on the park by the water.", "author": "Elena S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-18", "description": "Some of the best pizza I've eaten.\n\nReally thin crust.  Really fresh ingredients.  A bit light on the sauce, so if you like sauce dripping down your chin, this isn't the place.  \n\nThey pack you in like sardines here.", "author": "J J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-17", "description": "Very good brick oven pizza. It's freshly made to order, right out of the oven, and the slightly charred taste is fantastic. The wait is long but not so bad for parties of two or small groups. I have been here twice and was able to get seats within 10 minutes. Waitstaffs are very friendly and the owner is here seating customers sometimes. Coming back to try the white pizza next time.", "author": "CS L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-10", "description": "Pizza was yummy but nasty old man at the front wasn't so friendly. He pretty much scolded my table for inviting one last minute friend in to join our table. His exact words were \"If you do that again, I won't let you back in this place ever again\"! No pizza is worth that attitude. Okay i get it buddy, your pizza is famous but quit being so nasty.", "author": "Jenny A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}