{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-19", "description": "Grimaldi's, you did it again you devils you.\n\nNot as long of a line but just as friendly of a wait. Chatted with some people waiting ahead of us, and took a photo with the kind (and flirty!) older gentleman who seated us. \n\nThe pizza was as delicious as ever. The two out-of-staters who I dragged along felt that they had finally had the quintessential New York pizza. Followed that up with the most luscious cannoli a girl could dream of. (ha...) And we all understood why New Yorkers and out-of-towners will always choose Grimaldi's.", "author": "Sabeen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-18", "description": "We got here about 40 mins before it opened. The website says 11:30 but they really start letting people in at 12. I highly recommend being one of the first ones to go in. When you leave, you'll see how ridiculous the line gets and if you're starving, it will be a LONG ASS WAIT.\n\nA recommendation: Less is more.\n\n3 of went and we ordered 2 large pies. Half of 1 pie, I put olives, sausage, mushrooms, and basil. The other half, there was red peppers and mushrooms. The last pie had mozzarella, basil, and sausage.\n\nThe best were the ones with the least toppings. The problem with their olives was that it was way too salty. And with all those toppings, it made the crust soggy and you really come here for the CRUST.\n\nThe crust is amazing. Perfectly thing, perfectly crispy, and has the right amount of char. It's just AMAZING!!\n\nI definitely want to come back again, and again.\n\nBeware, it ruins pizza forever!", "author": "Cindy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-26", "description": "So, after hearing/reading the 2 hour horror stories, and \"terrible waiters\" stories, we decided it was something we had to do, and we would see if it was worth the repeat. Got in line 8 minutes after the place opened, and the line was already halfway down the block.  Despite this, the wait wasn't bad, we were in and had ordered 40 minutes since we got in line. Most of the people waiting in line this day were tourists, and we followed the advice or ordering everything as soon as you sit down and the waiter comes by (in fact, this seems the norm, as I noticed the waiter asked all the neighboring tables if they were ready to order pizza once he went by.)  The day we went, the waiters didn't seem rude, they seemed, well busy.  The pizza did live up to expectations, we had a large with peperoni and mushrooms, the ingredients were fresh, the cheese was great, pepperoni not greasy at all, and the mushrooms were fresh! extra star for that! (I hate when places use can mushrooms...ew).  \n\nSo try to go off hours if you want to hit up Grimaldi's, expect to do some waiting (I guess it wouldn't be the Grimaldi's experience if you didn't) and be prepared to know what you want to order the moment you sit down.  They are busy, busy, busy, but the pizza is very good!", "author": "Cecilia H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-21", "description": "Looking for \"New York Pizza\"? You'll find it here.\n\nSo there are usually lines outside the door at this place - it's for a reason. Grimaldi's in Brooklyn is one of the well-known, guide-tapped landmarks of New York. They have some pretty awesome pizza when you eat it fresh from the oven, especially on a semi-chilly day. The warm, gooey cheese and coal brick fired dough has no other match in the area. My favorite is the white pizza with extra garlic.\n\nOn a really nice day, order take out and trot over to one of the nearby parks (Empire Fulton or Brooklyn Bridge)...", "author": "Olivia R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-17", "description": "Come on a weekday or prepare to wait.  And the wait ain't worth it.  20-30 minutes is the max I'd ever wait.  This is a fun place before or after walking the Brooklyn Bridge if you're playing tourist in the city.  If you want to pick up your pizza, you're pretty SOL, as when we were there, the \"to go\" line is the same as the line for the customers waiting to be seated.  Don't get me wrong, the pizza is good, it's just that the wait isn't worth it.  We ordered coke, and the bottles were unexpectedly big and that made me happy.", "author": "AJ T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-25", "description": "This is what New York pizza tastes like! Delicious! The line was so long... my friends and I ordered take out instead and ate outside of the restaurant. I forgot which one we got but I'm sure they're all good!", "author": "Rosanna T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-03", "description": "This is very good pizza. The cheese (especially the cheese) and crust get top marks as does the atmosphere of this crowded, happy dining room.\n\nNow that that's out of the way...and I feel I shouldn't say this but I'm going to...there was a bite, maybe two, somewhere in there, and not in every slice and not even in every bite of the slice in question, wherein the sauce fell flat in an unsalted, canned tomato paste (dare I say \"Hunt's\") kind of way.\n\nBut, again, it was just a bite. Or two.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-24", "description": "Other than dining at Le Bernardin, coming here was perhaps the only other reason I really wanted to come to NY this winter. (Ok, I may be exaggerating, but not by much) After a disappointing outing at Lombardi's last time I was in city in '06, I felt it was time to search for a new coal-oven pizza joint. Enter Grimald's in D.U.M.B.O. (Down Under the Manhattan Bridge Overpass)\n\nWe came in on a Wednesday around noon, and luckily didn't stumble upon any long lines out the door other diners have been accustomed to. We ordered an antipasto platter and a large pie with mushroom and pepperoni.\n\nThe antipasto was decent and tasty, but of course it's not the reason that we trekked out from Manhattan to D.U.M.B.O. \nThe came the pizza, and one bite of it made the whole trip out here worth it: super thin crust, tomato sauce and cheese oozing like a lava flow topped with basil and the mushrooms and pepperoni. Alas, the pizza of my dreams. \nOf course as I write this, I'm both happy and sad. Happy at how amazing that pizza was, but sad also that no West Coast pizzeria (at least not one I've been to) can compare to it :(", "author": "Adrian W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-22", "description": "when an establishment is cash only, it usually means one of two things:  1) the food is awesome, so good that it commands that you eat on their terms or 2) the business is a front for some money laundering scheme, and they don't really care about the food or the service.\n\nthere's no doubt that grimaldi's is the former.  awesome pizza.  the cheese was incredible, the tomatoes sweet, the crust was so chewy, perfectly thin.. on top of it all, it was pretty cheap.  $14 for a plain large, $12 for a small with most toppings about $2 each.\n\nso how does it compare to lombardi's?  my husband thought grimaldi's is superior by far, i'm still undecided. but either way, grimaldi's was a slice of heaven. so good that i was full by 2 slices, but ate a 3rd.\n\n4:00pm does seem like the best time to go, we not only didn't have to wait for a table, but our pizza was ready in less than 15 minutes and we found a parking right in the front!", "author": "Waynele Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-19", "description": "There were a couple of times I have driven here and immediately drive away in defeat after having seeing the line continue on for miles and miles. It made me wonder if Lucali's and Di Fara's have met their match. Have I discovered a contender for the best pizza in New York City?\n\nNo, actually. Quite disappointingly, it tasted like any normal pizza I have eaten previously. The pizza looked pretty and inviting, but it had no substance, no taste. As far as fresh ingredients go (assuming they do use fresh ingredients), why bother if the pizza is going to taste like a rubber eraser? Why all the of stress of driving here, finding parking, and waiting in a line until I developed bad knees, when I could step out of the house and walk across the street to get something just as good, if not better?\n\nDon't get me wrong, it isn't a bad pizza. It's far from a bad pizza, but It's if like Brad Pitt married Jennifer Aniston instead of Angelina Jolie. Both equal, but one more equal than the other. \n\nWould I recommend it? Yes. Would I go here again and pay, with money? Most likely not. Once is enough.", "author": "Caleb P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-06", "description": "This is my 2nd favorite slice.\nFull Moon slice on Arthur Avenue in the Bronx is number one.\nGrimaldis is all about the pizza. In, out, poor, quick service, with no refills.  The turnover is fast as it should be.\nNothing compares.  It's all in the homemade plum tomato sauce.", "author": "Calvin P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-06", "description": "Not worth the line, but good. There were roughly 80 people ahead of us.\nIt tasted fresh, good crust. The mozzarella was richer tasting than the average pie. I'd go back, but wouldn't wait more than 10 minutes.", "author": "Grant M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-15", "description": "Looking back through my Yelp reviews, i can't believe i missed Grimaldi's, my favorite pizza ever. I used to live in Brooklyn Heights, so Grimaldis was just a hop, skip and a jump away. The lines have gotten a little crazier over the years, and since i have lately been coming back to NY at holiday times, getting in has been a little impossible lately. The week after last Christmas we waited in line for 45 minutes before giving up due to near frostbite. \n\nGreat brick-oven pizza. I always get it plain, just the sauce, cheese and basil. All of the individual ingredients are so tasty. I'm getting cravings just thinking about it. \n\nIf the lines get too much, Fascati's over on Montagues is really good non-brick oven style pizza.", "author": "Kaitlin F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-13", "description": "BEST pizza in NYC!\nThat said, I've tried loads of different pizzerias here in this city and Grimaldi's beats them all without even batting an eye!  The sauce is superb, cheese is fresh and delicious and the mushrooms and pepperonis really rock.  I hate how far it is and I despise waiting an hour to get in, but it's so worth it.  \n\nGreat pizza, decent wine, and ice cream on the river afterwards = a beautiful evening!", "author": "Vanessa J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-29", "description": "On my last visit to the Big apple, my sister took me here... she told me about this GREAT pizza place.... EVERYBODY... whos anybody goes here... \n\ni guess thats true... cuz im not a huge fan of pizza and yes... i waited in line... for about an hour and thirty mins... i was tired... cranky.. and seriously not happy about waiting in line... in the sun...\n\nbut anywhoo~ so yeah.. we ate here... i guess i thought it was okay... a\n\nso the question is... would i ever wait in that long line.. in the HEAT... ever again?... \n\nprolly not. sorry Grimaldi's~  :)", "author": "Eunji y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-09", "description": "On a recent visit to the Big Apple with my brother to visit my best friend and to see the US Open Tennis my best friend Rick told us that it is a must that we walk across the Brooklyn Bridge to have the best pizza in NYC. I cannot lie, and my belly will back me up on this one, I love pizza! New York is known for having great pizza and my friend swears by it so all I have to do is walk across a bridge to have \"the best pizza of my life\", this is a no brainer.\n\nAfter walking a long ass ways, taking pics  along the  way and working up a huge appetite we get to Grimaldi's at 3 pm only to find a long line of people waiting for pizza, I felt like I was at a club waiting to get in. A little thing you probably don't know about me is, I HATE waiting in line, no matter how many cute girls or how great the music is inside. We were already there so we had no option but to wait in line. About 30 minutes later the \"bouncer\" tells us we can come inside, the three of us are seated at a table that would be tight for two people, I will survive, it just felt great to have a cold beer and take a load off.\n\nThe place is super load and surprisingly busy for almost 4 pm. Rick wanted only cheese on his pizza and my brother and I wanted the works so we halved a large and let the eating begin!\n\nI must say the pizza is good, not the best in NYC as I was drunk two nights before and had a pizza just as good in the West Village, forget the name but it was good except for the drunk guy that said he should slap my brother and I for no reason. He backed off when I told him I don't think that would be a very smart thing for him to do :) \n\nAnywho back to Grimaldi's, good pizza, not the best, not worth another trip across the bridge, however if you happen to be over there or someone is willing to drive you at least one way or you can take a boat across then go for it. However don't fall into the hype that this is the best pizza in NYC.", "author": "Bobby B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-04", "description": "Under the Bklyn Bridge, it's the van Gogh of NY pizza.  The colors \u0026 flavors swirl together in glorious harmony, as the fresh mozzarella \u0026 tangy tomato sauce dance away from each other \u0026 then back together like little wisps of cirrus clouds.  The cannoli are filled to order with light, sweetened ricotta, dipped in chocolate sprinkles with a dusting of powdered sugar.  Walk back across the bridge.", "author": "Bradley H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-11", "description": "Honestly, the pizza here was not worth the 1 hour wait in the pouring rain. I can eat better pizza at different, less crowded locations. We were seated in the upper level, and the tables were tightly packed. After ordering our thin crusted pizza, we had to wait a while until we were received it. The pizza was decent. Also, one of the stalls in the ladies room in the firsts floor does not lock, so be cautious!", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-12", "description": "The real deal.\n\nGrimaldi's will make you realize how crappy most of the pizza you've ever had is.  It's not a feat of creativity, just quality.   Everything is cooked fresh and served hot.  Yes, you can only order whole pies, but you'll be amazed how much you can put away when you're dealing with perfect proportions of chesse/sauce/dough and no low-grade fillers.\n\nThe decor?  A little cheesy (pardon the pun) with a mishmash of posters and photos.  But you will be focused on your food.\n\nAnyone who likes NY pizza has to go here.  Then walk it off along the water under the Brooklyn Bridge.", "author": "Romo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-23", "description": "Lucky me. I found the best pizza place in NY by chance.\n\nI went came here about 5 years ago with a group, and I most thankfully chose having some of that good ol' NY pizza over seeing Stomp (c'mon, Stomp travels, NY pizza doesn't). I am SOOOOO glad I chose the pizza, if I could give them more stars I would! Here's the lowdown:\n\n**Appearance. I felt like I was in one of those cute Italian family-style restaurants, world's better than that Buca di \"Hell-No\" (craptascular Italian restaurant named Buca Di Beppo) we have here in Cali.\n\n**The waiters are hella fine! Goddamn. I haven't been there in a while, are they still wearing the black tanks and slacks?? Great service guys, if you're ever in the Bay you know where to find me ; )\n\n**The food!!! I had the foodgasmically good vegetarian pizza, topped with sun-dried tomatoes, feta cheese (I believe it was feta, it's been a while), basil leaves, and pesto...omfg...and I washed it all down with a bottle of Olde Brooklyn, which happens to be the best root beer I've ever had. \n\n**It was classy without being pretentious, it's like they know they have some of the best pizza on the planet, but they let the pizza do the talking. I've never been to a pizza place that offered you a knife and fork to eat the pizza. Wow. The pizza was worthy of being eaten with a fork and knife. Cali pizza, on the other hand, is not worthy of such an honor. I took a picture of the food before I ate it, that way I'd never forget =)\n\nGrimaldi's was the perfect accent to a fun trip to the East. I have a soft spot for the East Coast now, absolutely loved it there, and I can't wait to go back sometime  = )", "author": "Adaku T."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}