{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-24", "description": "The cheese is delivered daily after made locally.  The tomatoes are straight from Italy. The 900 degree coal oven heats to perfection.  \n\nWhat Grimaldi's teaches those who wait patiently that they never knew anything about pizza.  I've eaten pizza. In Italy. I was still uneducated and under prepared.  I thought deep dish was the way to go.  In my carnivorous mind, meat was a must.  Grimaldi's doesn't need either (but they do have toppings if you are so moved). \n\nI honestly think it is better (sometimes faster) to carry out a pie and set up shop on a Thursday night watching a movie under the Brooklyn Bridge.  Come inside once for the sheer chaos of it all and watch them build the simple yet simply delicious circles to my heart.", "author": "Liz M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-02", "description": "Good thin crust pizza.  Went late and they didn't have all of the toppings I wanted, but I enjoyed what I ended up with.  Pick your toppings and sauce, really your fault if you don't like it!", "author": "Loren W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-06-01", "description": "Racist doorman.\nHe asked how many were in our party?\nWe replied 2.\nHe said \"I'll be right back\". (walks inside to check vacancy)\n\nHe came back out asked the 2 WHITE ladies (behind us) how many?\nThey said 2.\nHe said come right inside.\n\nWe said YO we were NEXT.\nHe said your right I didnt see you guys there in the front.\n\nFood sucked.\nParking sucked.\nDoorman sucked.\nService sucked.\n\nIt's like Joe's Shanghai.. EAT AND GET THE DUK OUT.\n\nCASH ONLY.\n\nYour seated next to some random people.\n\nYour sitting next to a bunch of tourists that keep posing with their pies..that  is annoying when they keep asking you \"will you please take a picture of me with my pizza?\"", "author": "Kwame J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-19", "description": "Awesome pizza! The line is worth every minute! I'm not usually a pizza person but this place has the right balance of cheese and sauce! The crust burnt in all the right places and gives it the awesome brick oven place! Def a great place to go for the best pizza in NYC!!", "author": "Jen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-12", "description": "I'm from California so I would say: \"HELLA GOOD\"\nAnd a New Yorker would say: \"MAD WICKED\"", "author": "Nick H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-18", "description": "PRO's:\n- Good pizza\n- Friendly owner or whoever the gent is who runs it\n\nCON's:\n- not very close to subway station, at least as far as I'm aware \n- cash only\n- no liquor license. What's better than beer and pizza?\n- not all of the olives on my pizza were pitted. Bit in and hurt my teeth more than once.", "author": "B R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-01", "description": "The pizza was great and we got there early so no lines.  My only disappointment was they had no liquor license.  After shopping all day it would have been nice to have wine with the  pizza. Maybe thats why it was not crowded.", "author": "Christy R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-27", "description": "Save your time, money, and taste buds. Anyone who rated this place highly is buying into the hype and prob justifying the wait time to themselves, I know I was tempted to do so. But honestly, and I'm not the only one who thinks so, the pizza, the thing u actually come here and wait for, is pretty whack. I'm not picky about pizza and even I could tell it sucked. The sauce has zero depth, tastes like a can of tomato paste, and the cheese is just plopped on in blocks, barely melted and definitely not cooked in. The service here is also so awful. I mean I know they're trying to be quick in and out but we were completely ignored. When asking a waiter if he could snap a quick pic for us his literal response was \"I CANNOT\" said loudly, while walking away and never even looked us in the face. When asking for the check we waited for about 15 min (which u would think they would hurry this along considering the absurd line outside). Lucky for them my friends wanted to be honest, good people and left the appropriate amount with a crappy tip. I was so pissed at the service, the food, the wait, the hype, everything I wanted to dine and dash! Not really, but in theory, hell yes. This review won't do anything and ppl will continue to wait for \"the ny pizza experience\" but ugh, so, unbelievably, not worth it.", "author": "G L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-05", "description": "The line was not so fun, on a hot sunny day in Brooklyn. We waited about 45 minutes, and were starved. The inside was pretty small, not pretty, just seemed like a shabby local joint. you cant take pictures of the pizza making, there is ONE TOILET and the line, well everyone can see who needs to use the loo, embarrassing ~! \n\nWe ordered the Mushroom, Pepperoni, \u0026 Olives ; and also Italian sausage with mushrooms on two small tomato, basil, \u0026 mozzarella came out to be $38. Pretty pricey for OKAY tasting pizza. The crust was crispy but the pizza itself was soggy due to the fresh tomato sauce. Olives were extra salty. I liked the pepperoni.  The basil was mostly burnt, which was sad because i was really excited about fresh basil on my pizza. And most of the pizza was burnt ... :/", "author": "Linda L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-23", "description": "Got the margherita with extra mozz. This place is in an awesome location and the food is on-point. Definitely a must-do, but I find Lombardi's to be better due to their amazing sauce.", "author": "Hyanna C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-23", "description": "Not terrible, but among NYC's finest ? Not a prayer. Not really thin crust, certainly not thick crust, it's sort of a mutant crust, but worse it has not distinctive flavor. Although when my wife went back to the bathroom, where she said the wait was \"much warmer\" than the kind of shivvery dining room where we had been eating, she said the aroma of the fresh dough was overwhelming and mouth-watering 'Too bad it doesn't cook up that way. Don't get me wrong, this is not a bad pizza place, but were it not for the reputation and wanting to do this once with my family, this is not the kind of pizza that would warrant even a five minute wait. \n\nBeyond the crust and, in fact directly above it, was a sauce that was not poured out of the can, but definitely on the diluted side and, again, lacking in any particular herbed flavor. The best I could say is that the tomato sauce is generic home-made--tomato-ey, but not distinctive. You'll get better flavor, I believe, at John's, where the crust is truly thin and the sauce is verifiably flavorful. The cheese--definitely fresh, not manufactured or pre-shredded, nicely placed on the pizza, but not so fresh and dairy-ready that you'd say OMG, or \"Accidenti\" if you're feeling a bit italiano, I'm sorry, I came ready to be impressed, and left not so much as disappointed as just nothing--neither knocked off my socks, nor cut off below the knees. What you leave with is that \"just-had-pizza\" feeling instead of a \"just-had-fantastic-pizza\" feeling.\n\nFrank Pepe's, which I hate to credit for anything because it is in New Haven, not New York, has it all over this place. Genuinely thin crust, charred here or there but not too much and yet not too little, flavorful yeasty and chewy (Grimaldi's is NOT chewy, you just have to chew it; therre's a big difference), tomato sauce that tastes like a summer garden, herbs and spices you can still taste the next morning, and anchovies that are fresh. Did I tell you? Grimaldi's anchovies taste, and certainly are, those out-of-the-pizza-store-can variety which always border on spoiled but because they are so heavily salted--and nothing more--stay this side of bacteria central.\n\nI really am sorry about this. We got there 45 minutes before opening, were second on line, and after waiting till noon (Grimaldi's says it opens at 11:30 on Sundays, but at the restaurant itself they have a noon opening), saw a bus drive up and unload a few dozen tourists who walked right through the line and were ushered into the restaurant. What's the Italian word for chutzpah? I guess it's also chutzpah, but faccia tosta fits here. \n\nThe bottom line is I won't go back. Once for a New Yorker--I suppose I was several decades late, but nobody I knew in high school ever wanted to go there--is enough. If I want to take tourists somewhere, and that's the only reason to go to Grimaldi's, I'll take them to John's, which is far and away better than all the places raved here, but that's only because it's not trendy enough, I think.", "author": "Mickey D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-11", "description": "Nothing to knock here, and really, nothing to extol either. The prices are pretty spot on for what you get, and it is good pizza, it really is, it just shouldn't be mentioned in the same breath as some of the other institutions of pizza we have here in NYC and Brooklyn. I can't really put my foot on exactly what it lacks, but overall I'd say the flavor of each bite isn't on par with something like Lucali.  \n\nThe location is fantastic, and if you go, just go for one large pizza with minimal toppings, skip the drinks, and walk around dumbo afterward to burn off a few of the calories. Then go get Brooklyn Ice Cream right around the corner and enjoy being alive.", "author": "ryan k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-11", "description": "This place is a must visit when in Brooklyn. We stopped by for lunch on a Wednesday afternoon, so it was pretty quiet.  I get the feeling it gets super busy though, as they have an area set up out the front for queues.  Its just near the Brooklyn Bridge and is in a fairly large 2 story location.  We got seated straight away and the service was pretty good.  We ordered a \"small\" pizza and it came out very quickly.  The pizza was really fresh and was absolutely delicious.  I didn't think i would be able to finish it all, but i did, somehow.  I just couldn't stop eating!!  Definately a must do when in Brooklyn!!", "author": "Leisha T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-15", "description": "Grimaldi's is one of those tourist destination places that everyone wants to checkout...\nI've eaten here six times over the last two years and two out of those six times I got a soggy pizza crust....So it's been a hit or miss for me...It's a pretty good pizza, but not the best in NYC.\nEach time I came here was due to friends visiting from abroad, and after walking the Brooklyn Bridge it's just a nice place to stop by and get some pizza. \nOne thing I like about Grimaldi's is the fresh mozzarella cheese.\nBeware the waiting line, the fastest I've gotten in was after 30mins waiting, and that was on a rainy day :)", "author": "Michael A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-20", "description": "Is it a good pizza? It's OK. Is it worth queuing up for? No.\nIf it's on your list of things to check off - a walk over the Brooklyn Bridge (that was really good, what a beautiful old bridge) and a pizza at Grimaldi's then do it. If you are making a special trip to come here for \"the best pizza in NYC\" than forget it, there are plenty of places that are better.", "author": "Peter O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-07", "description": "Okay, I really can't say this isn't amazing pizza, because it is.  However, I would not wait on line for this pie.  It is great to go when it isn't too busy, but if not, no way would I go here.  One thing that is pretty irritating, is that the wait for take out is just as long as the wait for dine in.  As a resident of Brooklyn Heights, Grimaldi's really drives away any possible neighborhood fans.", "author": "Jenna J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-30", "description": "Not sure I was up for a pizza with unseasoned sauce (you season yourself there), maybe that's to please old people that are salt-intolerant, not sure -- but it was a good pizza otherwise and friendly staff", "author": "Marty E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-07", "description": "I'm particular about my pizza and I am not a fan of the texture of Grimaldi's crust 100%. It's ok and fun with friends, but not entirely worth the wait. It's also a bit overpriced for what it is. It's a nice area to walk around and there are several bakeries nearby. I would go with friends, but not on my own.", "author": "Nathan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-01", "description": "Grimaldi's is well served by their PR person - while the pizza is good, the wait isn't.  This is Brooklyn, and it's hard to throw a rock in any direction without hitting a pizzeria that serves pizza (and more) that is not less than equal to Grimaldi's but without the wait...Come to Bensonhurst or Gravesend...", "author": "Freddie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-01", "description": "Yeah, that's grimaldi's, famous for being one of the best pizzas in ny. And it is! A beautiful house in a beautiful place and great pizza. What else do you want?", "author": "Isabel S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}