{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-14", "description": "There's obviously been a lot of hype partly because of Michelle Obama... but it probably deserves it. My friend and I came on a Sunday at 5:10 PM, and there was a line about 25 people long. After waiting 45 minutes or so, and much sweating, the line got to us. I ordered a small regular pizza with pepperoni, sausage, mushrooms, and ricotta. The service was so-so: I had to flag down a waiter to refill my water, and it took over 45 minutes to make our pizza. However, when it finally came, it was one of the best pizzas I've ever had. Using fresh mozzarella really makes a huge difference in taste and texture. The other ingredients were also quite fresh.\n\nNote that the pizza is quite large and a bit floppy towards the center, so it may be difficult to pick up a slice. What I ultimately did was to eat the center with a fork and knife, and then pick it up.\n\nI would like to come here again, though preferably on a cloudy day.\n\n88/100", "author": "Tony J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-07", "description": "Took a trip out to NYC and of course I had to eat a NY Pizza. Apparently, found this place on yelp as highly rated. Came in around 3pm and seated right away. The man at the door was quit friendly and guided us to have a seat upstairs.  Sat down, not even given a minute to look at the menu the server was VERY RUDE! In a rudely manner way 'READY TO ORDER'. My friend asked what's popular and he just said 'PEPPERONI'. Already, disgusted with the service!  Not too sure if that's the character of the place but it totally turned me off.\n\nOrdered a small pan of PEPPERONI pizza. I gotta admit it was good; cheesy and crispy crust. The small was more than enough for a party of two. Took home a doggie bag with 2 slices left. Cheap, spent about $20.\n\nOverall, good pizza but would not return just because the servers were very rude. Over rated pizza joint.", "author": "Rogeline M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-22", "description": "Who would stand on line for Pizza? Apparently some people do. \n\nLuckily, I wasn't one of those people when I showed up here for a mid day lunch.\nMy friend always talked about this place and when the chance came, i decided to have a go at it.\n\nWe ordered one large pie to share. \nI really enjoyed the tomato sauce. It wasn't too tomato-y like you'd find on reg pizza. It was light. \nThe crust was thin and just right.\n\nI am not a die-hard pizza fan and I mean giving pizza a 5-star rating to me seems unnecessary. It was good pizza. \nI can't say I ever had \"great\" pizza...I mean it's pizza. It's like saying I had a great hotdog...it's an hotdog. It can either be bad or good.", "author": "Kemi A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-02", "description": "My friend was visiting me in New York and we arrived early to this fine establishment (ha!) at 11:30am on Saturday- got seated right away. Wow, I thought to myself, lucky us! Haha oh boy, on the contrary...anyways let's keep going.\n\nOrdered, food came out pretty quick. \n\nFood: Pizza was pizza. I mean, what's so special? It's tomato sauce with cheese and basil, extra $2 for mushrooms lol. It was ok.\nTHE WAITER (identified as: tall man with a short ponytail) WHO WAS SO RUDE, WASN'T. \n\nHere we go: (fasten your seatbelts for this- it might get turbulent, or maybe you'll be laughing so hard at this waiter, that you'll fall off your chair)\n\nMy friend and I paid for our meal using a $20 bill and we were waiting for change...after awhile nothing was coming back to us, so we went to go talk to the waiter. \n\nWe explained to our waiter nicely that we had paid with a $20 bill and we wanted to know where our change was or if it was coming. He disagreed, saying \"why would I give you change if you left exact change?\" \n\nNow ok- you're thinking maybe we might've mistaken ourselves and maybe we got confused. But hello!!! Freaking counting exact change is a lot more tedious than putting a $20 bill down. Who the heck is going to confuse putting a $20 bill down versus putting down exact change???? (This just shows you how stupid our waiter was)\n\nWe replied that we had not used exact change, we had used a $20 bill. He went on to say \"no, you're wrong.\" Huh? Excuse me??? In what era did it become ok for waiters to say such comments to customers? And at such a highly rated place? Please, someone enlighten me.\n\nHe wouldn't give us our change back, even after we insisted that we were 100% sure of our actions. He adamantly refused. Then, (ok- listen up kids) he. told. us. to. leave. angrily. \n\nReally. You're asking a customer to leave, and you're at fault? ABSURD. It's almost comical at this point. \n\nI asked for his name (ponytail man) so I could go to the manager and he said \"my name is irrelevant\". What? Excuse me? I was half expecting the \"What Would You Do?\" camera and crew to jump out. I mean, I would've loved to meet John Quinones. \n\nAnyways, how is your name irrelevant? Your name is what I need so the manager can fire you!!! (THE WAITER HAS A PONYTAIL IF ANYONE IS READING- or maybe he chopped it off out of embarrassment)\n\nHe left silently and we had to follow him downstairs to get our change because he FINALLY realized he was wrong. \n\nThis scumbag. Did not apologize. Not one ounce of \"oops I was a douche-bag\". \n\nWe even tipped him what we would've before the incident. Still no apology or thanks. Ungrateful. I might've forgiven him if he was apologetic, but he was a rude rude rude man.\n\nSeriously?\nYou should be ashamed of yourself- waiter with a (short) ponytail. Rude rude rude. \n\nI guess restaurants aren't going by the phrase \"customer first\" anymore. More like \"customer's wrong\".\n\nPlease. \n\nEdit- \nI'm home in West Chester now after a day in NYC. What a horrible experience to have. Worst restaurant experience EVER in my entire life. And I hope, for the rest of my life.\n\nIf people running this place don't think their customers are important, I don't think you should support them. The pizza wasn't even that good. Never EVER going back and never recommending this place to anyone. Steer clear, tourists- I'm doing you a favor. You're welcome. :)\n\nTake your money elsewhere...not worth the rude treatment. And people get in line and WAIT for this??? Hahaha that's so extremely sad for those poor folks. I just remember passing by a lady with a yoga mat on the way there and she recommended that we go to the place next door. I wish I had heeded her advice. \n\nI still can't believe a waiter would tell a customer \"you're wrong\" and \"leave\". What a complete disaster. Good thing he didn't tell me his name or else it would be right smack in this review about 100 times. Maybe he's not so dumb...\n\nBut you can still identify him by his short ponytail! Enjoy!", "author": "Dana L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-17", "description": "The front of house staff are rude and poorly organized.  Don't go if you have any plans for the rest of the night.\n\nWe were next in line for two and then they seated a party of 14 ahead of us. So we asked if we could order while we waited to be seated before the party of 14 ordered. They said no and suggested we order take out. We went to order take out and then suddenly the pizza making time, which was previously quoted as 15 minutes became 45 minutes. And then to boot they seated another party of 2 in a seat we asked if we could be seated in.\n\nWe asked for a refund and went down the street. The pizza is supposed to be great, but I'll have to try it another time and possibly at another location of theirs.", "author": "H Dan I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-11", "description": "When thinking about the titans of New York City pizza one of the first places you hear about is Grimaldis. I have to say this pizza was really good but only if you know what toppings to put on it. So the pizza is very hit or miss but if you get that perfect blend of toppings then the pizza goes to an insane level of deliciousness. I got pepperoni and roasted peppers and those two just were so good with the already fresh and made to order pizza with super flavorful mozzarella cheese in the pizza. I advise people to come here on weekdays since there usually is a line to get into the restaurant so be prepared for that !", "author": "Nabidul I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-05", "description": "I went to Grimaldi's with three other friends saturday night. We waited outside in line for five minutes before getting a table on the second floor. Foodies be aware this is a cash only and you need to order a pie (6 or 8 slices). You probably need three or four people to finish the pie. The pizza was nothing special definitely not Worth of a line outside.\n\nI came back to Grimaldi's the follow saturday evening in hopes of getting a better experience. Nope. Waited for 45 minutes. I tried the white pizza. It was saltier and worse than the regular pizza with tomato sauce.", "author": "Troy L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-08", "description": "I should have known better when I received an initial snobby attitude from the guy up front... We called in an order for a pizza and swung by to pick it up. They have a large sign that says take out = wait on line so to double check, I went up \u0026 mentioned that I called in a pizza and asked if I still had to wait on line. I received a grumpy yes.\n\nOkay.. on the line for 15 minutes. The same guy comes down the lines asking \"how many\". When he got to me, I said, I ordered for pick up. \"Go up to see if your order is ready\". WELLLLL I said - you just told me to wait on the line. \"No i didnt. Go up to see if your order is ready\". The man was rude and un-apologetic. I said NO, i JUST talked to you.. and proceeded to run up to the front. As I went up, the man threw some words my direction commenting on my \"unnecessary attitude\". \n\nI'm sorry - I'm in the wrong because you mis-directed me (and implied that I was lying) and now I paid $20 for a cold pizza???\n\nWhen I did get to try the pizza, it left me unimpressed. Very average for a \"high-end pizzeria\". Sorry but to deal with rude service, a long line, and $$$... ? I will pass on coming back here.", "author": "Carol H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-09", "description": "I liked the place. I thought the pizza was really good and the prices were good, too. Two friends and I walked in on a Tuesday afternoon for lunch and we did not have to wait at all.\n\nWe were staying in Manhattan and thought it would be fun to take the ferry over, which drops you off 100 yards from the restaurant. \n\nAfter eating our lunch, we walked back to Manhattan over the Brooklyn Bridge, which was really fun and part of the experience.", "author": "Lou H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-05", "description": "Julianna's is better!!!\n\nWe live in DUMBO and I suppose had to try Grimaldi's just because of the hype. We picked a night when there wasn't a line and went in.\n\n1. I don't get it. The pizza is pretty good but not worth waiting in that typical line for.\n\n2. The service was shoddy.\n\n3. The menu is sparse and toppings limited. \n\nNow that we've gone we never need to again.", "author": "Peter C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-02", "description": "Waited 20 minutes to get in which wasn't that bad for a holiday weekend. Waited 40+ minutes for very average pizza. Sauce has no flavor, very stingy in the toppings for the price. Beverage choices are bottled sodas and juices. No beer to take the edge off if such a long wait. Obviously don't need to go back.", "author": "Eileen G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-17", "description": "If Grimaldi's weren't scenically located by the waterfront, it would be a tourist trap. As it is, it's a tourist trap by the docks. The wait for my group of 7 was probably about 30 minutes, not intolerable if you're with friends. It's mostly frequented by tourists who surely hop back on the GrayLine bus satisfied by the admittedly well-done thin crust pies. \n\nMore on this now: the crust is chewy and well done, but not burnt (our 3 pies were pretty consistent). I can't verify if the tomato sauce is made from San Marzano tomatoes by taste alone, but I thought it was at least adequate though probably tapped from cans. Gobs of gooey cheese sprinkled with a bit of seasoning completes the margherita pie. The toppings they have are good, but excluding Southern Italian staples like artichokes keeps Grimaldi's squarely in the traditional New York pizza bracket.\n\nThe guys here are mildly cheeky and old-school, fluent in the expected Brooklyn paisano-speak tourists crave. However, this does not excuse, for instance, bringing us the wrong carafe of wine, never bringing the antipasti, and subsequently charging us for the undelivered dish. Sorry guys, even popular places can't get by on reputation alone.\n\nOn pizza quality, Grimaldi's outshines the even more touristy Lombardi's, matches Totonno's, but for me falls short of the no-nonsense, no-pretense experience at John's on Bleecker (same simple offerings, same great quality, but more neighborhood-specific character).", "author": "Yan T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-16", "description": "OK. YES, the pizza is good and YES, they are very popular on Yelp with a line out the door but, NO, this does not warrant their employees being so rude throughout our dining experience.\n\nGrimaldi's serves up some seriously good pizza. The crust is thin and the mozarella cheese...oh my, it was so creamy and stringy..just as it should be. The pie definitely held up to all the ingredients without getting too soggy and the price isn't bad either ($20 for a large that served 3 people!) and I can see why the establishment competes with Lombardi's! I would say both restaurants are different but, both great. HOWEVER, I would chose Lombardi's over Grimaldis soley on customer service. \n\nThroughout our service these are some of the comments we've received from the employers:\n\n1. We told them that the bathrooms were really dirty with trash piled up and on the floor..just an FYI from a customer\n \nThe response: \"Well what do you want me to do? there are 100s of customers, I can't clean it. I have better things to do!\"\n\n2. We were seated at a table of 4 (party of 3) and so, we put our bags in the empty chair.\n\nThe response: \"Move your bags, I need this chair.\" \n\nUMM HAVE YOU HEARD OF ASKING NICELY!?\n\n3. We just finished our meal, our drinks were still full and their was a table next to us that finished way before us just chit chatting.\n\nThe response: \"Hey I have a line out the door, can you girls hurry it up.\"\n\nOK.. REALLY!? I get it. Grimaldis is so popular and no matter what anyone says, one 3-star review can't really bring down the beast but, just cause you have this type of popularity doesn't mean you can talk to you customers like trash. We're still paying customers, there is no need for rudeness. All of the things above we would have been HAPPY to overlook and accomodate if it was said with just a twinge of politeness or mannerisms in mind. Going beyond, customer service, would you talk to anyone like this!? \n\nFOOD: 4.5-5 stars\nSERVICE: SHIT. GO TO LOMBARDIS.", "author": "Stephanie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-12", "description": "Yes the pizza is good but I don't understand the hype. I stopped by during the summer on a Saturday afternoon and the line was ridiculous. Down-the-block type of thing. I think it's safe to assume at least 50 people waiting out front. Reminded me of the cake boss bakery in Hoboken, NJ but worse! I didn't want to wait on line of course, so we left and went to Adrienne's which is in Financial District, just a few minutes away across the BK Bridge. \n\nI was invited here again yesterday. **SIGH** I was relunctant to go but it was a Tuesday afternoon, so I figured I'd take my chances. We arrived at 6pm and horray..... NO LINE! I was happy that I'd finally get to try this pizza everyone raves about and waits hours on line for. I thought I'd develop some sort of magical powers. We ordered the pepperoni. Yes, pizza was good and better than average but nothing out of this world. I wouldn't wait on line for this stuff. The place is CASH ONLY and service is not great. Oh yeah, no super powers either :-/", "author": "Yanill P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-02", "description": "My boyfriend I went to for dinner. We were told that last order was made at 10:25 which we order around 10:20 pizza was made pretty fast, but by 10:40 they were putting up the chairs and brought the check without asking us if we needed anything else. Supposedly restaurant closes at 11:00pm.\nWe felt that they were kicking us out... first time and never again.", "author": "Betty C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-20", "description": "Arrived at 12PM and a line was already forming outside. Wait time was originally 1 hour, but was shortened to 30 minutes since people gave up and left. Restaurant itself is of a decent size, but tables are side by side, as if you were dining with the people sitting next to you; definitely a bit cramped. \n\nThe boyfriend and I ordered a large pizza with pepperoni, sausage, mushrooms, and olives. The olives were definitely a no-go, they were super salty, to the point where its becomes bitter. We eventually picked them off since it was unbearable! Aside from that, the pizza was really good.\n\nStaff was nice, but in a rushy way.", "author": "Samantha C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-18", "description": "Hands down the best pizza I have ever had, anywhere!\n\nWords can not describe how much I enjoy their pizza... or maybe I can... between my fiance and his coworker, the three of us were able to polish off two LARGE pizzas on our own. We were stuffed to the brim, but oh soooo happy! I love this place. The service is awesome, the food is awesome, and the ambiance is awesome. I always get the Margherita Pizza with extra basil, but all of their pizzas are great!\n\nIf you are headed here during the weekend, just make sure you get there before they open, the lines get kind of crazy, and you can definitely see why. Love, love, love!!!", "author": "Margaret L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-18", "description": "Finally got to try this place after hearing everyone and their mother rave about it.\n\nI honestly don't have too much to say about this place - it's tiny, there's a line out the door, and the pizza is pretty great all at a cheap price - think a large pie for $14.   My boyfriend and I shared the large with Italian sausage, and there was not a slice left on the plate.\n\nAll in all, a good no-frills NYC staple.  Take your visiting friends and family.", "author": "Laura M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-23", "description": "I liked the pizza dough and by being able to try a nyc pizza experience. The downfall was the fact that the pizza became soggy by the time we were done with it and we didn't even load it with toppings. Also there was no ac so it was super hot inside. I had better pizza elsewhere...", "author": "Deah S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-21", "description": "Horrible customer service\nWas told the wait would be 30 mins but ended up being over an hour.\nAsked the waiter for more water and he never came back.\nHe never checked on us during the meal. \nPizza is just pizza,  not worth the wait and service!", "author": "Ariel C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}