{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-10", "description": "The ONE and ONLY Grimaldi's.  Possibly the best pizza I have ever had.  Aside from the insanely long line and long wait, the pizza is tops.  The ingredients are fresh and that's something you can taste.  The sauce is light and the cheese delicious.  The thin crust is always a plus with me.  I try to take out to avoid the lines but its always best eaten fresh.  And don't mind the elbow mashing.", "author": "Donald E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-21", "description": "I've been here once.  Not bad.  I haven't tried any of the other famous Brooklyn places, so I have nothing to compare it too, but being someone who's been eating Papa John's and Domino's Grimaldi's is definitely a step up.", "author": "Thugnificent M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-12", "description": "We went here on a Saturday evening with Hannah's parents and our friend Heather. Before going to Grimaldi's you have to understand that it is an experience... waiting in line, being crammed next to people you don't know, and  your waiter being short with you. It's all part of the Grimaldi's experience. I think the best part of our dinner there was that they made a cheeseless pizza for Hannah, and in my opinion is was better than the pizza we got with cheese.", "author": "Hannah R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-15", "description": "Don't miss the BEST pizza in all of metro New York.  While you are there, grab the pizza to go (if it is a nice day) and sit outside along the water which overlooks the best view of downtown.", "author": "Jackie R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-13", "description": "We came for the pizza, but not again.\n\nThe low rating isn't about the food, because I will admit that it is very good thin-crust pizza, but a big part of food reviews is the service, to which end Grimaldi's sorely needs to improve. On a cold January night, my friend and I walked across the Brooklyn Bridge and waited in 41 degrees chills for 1.5 hours, only to get disrespected by the old white-haired owner. The wait outside is long and he was pushing people to step behind a crack in the step. He got a little rough and I don't think it was necessary for him to use his hands to push people, he could've just asked us to, since the line wasn't rowdy (we were too cold). \n\nIf there's one thing that irks me, it's when random strangers touch and shove me. I got annoyed and said he shouldnt be pushing people. Then he yelled at us loudly and rudely in a menacing way that we need to step back, and to not worry about who was behind us, but just to keep ourselves in check. WTF. I really regret not saying anything to him then, or getting out of line, but by then, it was already 50 minutes the wait and I was too stunned that a restaurant owner would treat their customers like that.\n\nSo the owner is an a-hole who ruined the experience and taste for me. I know I can't stop people from going here, the hour+ long wait says something about the food, but for me, Grimaldi's has let its popularity get to its head and the shitty service doesn't warrant a pizza.", "author": "janice l."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-05", "description": "girmaldi's, the pizza that made the brooklyn bridge famous--hey, i just found out that they have 2 in texas!\n\nbut sure its worth the wait in the sea of tourist (just be sure to wear you fanny pack floaties cause you can drown if not careful!). the pizza is paper thin and with burnt edges.\n\nRemember if theres a line of people, make sure to follow and conform to the crowd!", "author": "Ishmael V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-31", "description": "they dont even deserve this star. when my grilfriend told about thisplase i thought it would be awesome, but i got disappointed.\n \nfirst this place s aweful.\n\nsecond croweded and not enought place\n\nThird they charge for the service, the getting tips why they charge for the sevice.\n\n4th the people who are serving are in a rush and they want the costumers to leave early forn that place.\n\n5th they use cheap toppings such as pepperoni, sausage, mozzarella, and other toppings. they charge a lot of money for cheap toppings this is stupid\n\n6th the owner or whoever that guy is, is rude and look like that he doesn not like the people. at least he should nice whit the people because we are giving him our money to make him rich. \n\nthey dont delivery, they dont have parking, the sevice is slow, the people who eat pretend tehy enjoy the food. but the true is that they hate taht pizza. when i was there a saw one couple who pretented to enjoy the pizza, the guy was acting likeif he enjoys the pizza. \n and one more thing sorry if my grammar is bad, but this is how they sould descrived.", "author": "Juan Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-20", "description": "Best pizza in NYC hands down! Although it is a bit too touristy and the lines are usually huge. They do have a quick turnaround so you end up waiting in line for about 30 mins.", "author": "YumyTummy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-31", "description": "My favorite pizza place!  Too bad I live 3,000 miles away. =(\n\nBut, delicious, thin crust pizza.  Fresh ingredients-sauce, crust, cheese, basil.  All good!\n\nCon:  the line and the wait.  It takes a while to get inside.  Pizza place is small.\n\nDefinitely the best NY pizza I've had.  Yum!", "author": "Joyce Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-13", "description": "Straight out of the brick oven into my mouth. Melting mozzarella cheese, fresh basil, tomato sauce. So delicious. This place is super busy solely due to its awesome pizza (the interior design, ambience, the long wait time, cramped seating are all forgiveable). Located literally right under the Brooklyn bridge.", "author": "Yoonah L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-23", "description": "Oh, lookey here, another pizza pie joint. Even betta, it's in Brooklyn! Fugheddaboudit! What a bunch of assholes here. Even worse than those Italian guys wearing an F.B.I. shirt or getting a Ford Mustang just to have that Italian badge on, but not as bad as those Gotti boys with a fake tan and a hairdo that look's like Enola Gay dropped another H-bomb. I'm talking about the cameriere at the damn joint. Why must it talk 2 hours to make pizza after waiting in line for an hour? Why do places like this must have an attitude? So a joint like this gets customers, they have to treat customers like shit? What a bunch of stronzo's working here, right? Fuckin' deal with it, cuz this is New York. It's a place where assholes from all over the world come to live. We're the international hub for assholes everywhere. We hate everybody here, but if one of us goes down, we stick like glue and then we hate each other all over again. Grimaldi's known for it's brick oven and it takes time to get the wood burning. This is an ideal place to order in advance for take-out and dine in if you're willing to drink with friends and family for a long time, cuz they will not give two shits about you, ya know whattamean, oh!\n\nOverall, you finook, go here if you're waiting for the water taxi to take your ass to Ikea, but if you want something else, go to Lombardi's. America's first pizzeria. \n\nOne", "author": "Heavy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-04", "description": "falling in line for at least half an hour and enduring the pizza nazi is something to endure in order to eat at this place.\n\nits good, its worth the trip and the crust is the heavenliest i have had.\n\nmmm.", "author": "Stella S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-25", "description": "last trip to NY, took some rookies with me...  what was one of the things they wanted to do?  instead of club / bar / lounge hopping, they wanted to do pizza hopping...  officially, I'm pizza'ed out until at least, 2011, I'm not even kidding with you...  \n\nknowing full well how ridiculous the lines were going to be at grimaldi's, on the way over, I called and placed a to-go order...  yes, i'm that incredibly intelligent, or I'm that incredibly obsessed with food i know how to plan ahead...  once we arrived, sure enough, even though it had started to rain, there was an insane line outside...  secretly, deep down inside, grimaldi's has never been my favorite pizza spot, but i didn't want to ruin it for the others who have never tried it...  don't get me wrong, their pies are amazing, easily in my top 3 favorite, not just in NY but the continental united states of America...  (okay fine, and Canada as well)  \n\ningredients still fresh, dough cooked to perfection, I can see how it would be peoples #1 favorite pizza in NY, it's just not mine...  there's just something missing, can't quite put my finger on it, it's just a smidge off of my personal favorite...  again, please, don't get me wrong, I inhaled the slices like the world was coming to an end, their pizza is amazing, and you owe it to yourselves to give it a shot, it's just not my favorite pizza is all I'm saying...  \n\nso while we were outside devouring the pizza, every single person in the group all agreed that it was the second best pizza they had in NY, and not one of them could articulate exactly what made the other place slightly better, albeit, not by very much...  \n\nthis review isn't quite fair to grimaldi's though, because i do want people to try their pizza because as they say, different stroke for different folks...  maybe this will be your favorite pie...", "author": "Tristan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-12", "description": "grimaldi's will always be good. i love it! \nwe had a crazy day... started off in central park (saw luke perry!!!!) then headed down to brooklyn for a fantabulous pizza lunch then went back uptown to the met for a private tour.\nseeing luke perry - grimaldi's pizza - private tour of the met OMG... goes down in the books as one of the greatest days!\n\nwe shared a LARGE pizza. is that typical? 2 people sharing a large and FINISHING it? lol.... the line wasn't too bad, the inside was PACKED. i don't remember it being like that in the past, i felt bad having to shove my ass so close to our neighbor's pizza. service was quick, efficient and friendly.\n\ni LOVE it! LOOOOOVE IT! can't wait to go back!", "author": "Esther A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-06", "description": "Before walking over the Brooklyn bridge on frigid day, me and a group of gfs decided to have a \"pie\" at Grimaldi's.  Place was jam packed with folks stuffing their pie holes.  We sat down and ordered a couple of pizzas and as soon as they hit the table we ladies threw down.  Till this day, I still salivate thinking about that pizza.", "author": "Myra R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-12", "description": "pizza expires after 5 minutes so the 1st slice is fantastic but slice #2 and beyond evolve into jeno's.  a good invention would be to serve pizza on a mini coal plate (like fajitas or korean bbq) to preserve the unique crunch that you wait oh-so long for.  \n\noverall a good experience.  the crust and cheese were definitely the highlights.  the wait is ok if you are mentally prepared for it.  my only complaint is that it was too cold inside and the beer was NOT cold enough.  maybe they got their temp controls mixed up....", "author": "Wincheng L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-10", "description": "This was the first NY pizza place that i went to when i visited NY back in like 2007? We had to wait in line for the place. From what i can remember it wasn't too long. maybe like 30 min. or so. The place is small and crowded. when you sit down at a table, the next table is pretty much attached to you. The pizza portions were good. It's not TOO expensive, but it's a well known NY pizza place so it's a little more expensive then a normal pizza place. i would recommend visitors to try this place out when you're in NY or even people how live in NY and have never tried this place out. We just got the supreme pizza and it was delicious.  :) GO GO GO!", "author": "Susan Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-15", "description": "The pizza is famous and so is the wait.  Pizza had fresh ingredients, and it's nifty that you get to see the pizza technicians make the pies. Second time I tried this place and I always enjoyed the first hot piping slice. It gets too cold too fast though. And really soggy.  Homemade sausage and fresh mushrooms lacked character for me. I liked it to be more flavorful.  Waited out in the cold for about 45 minutes. It's not worth it.", "author": "Kiet L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-03", "description": "Grimaldi's? Despite the line of tourists eager for the experience outside it just isn't that good. If you want to try the pie - really - call ahead - don't wait in the long ass line. Call ahead, go inside, pick up the pizza and take it to the nearby Brooklyn Bridge Park. Then prepare to be let down. The last two times I've had it the crust has been thick and chewy, the sauce has been weak, and overall the experience has been a let down. Also you have to order a whole pie here - no slices. If you're in the area (and you came on an A/C train) don't go down the hill - stay in Brooklyn Heights and enjoy a slice at Fascati's.", "author": "Carl C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-25", "description": "Living in San Francisco, Amici's was advertised as \"East Coast Pizza\" ... whatever. I'm still more of a Chicago-style pizza fan, but New York certainly holds it own. We had one of the meat combinations here and I thought it was good. Nothing spectacular. Certainly Di Fara's was better.\n\nWhat I really disliked about this place was that I wanted to take a picture (as I do at all eateries) of them making a pizza. One of the guys (wearing the white chef's suit and hat) pointed at me and said \"No pictures!\" \n\nFine, I put my camera away and go back to the table. \n\nAbout a minute later, the same guy behind the counter POSED for another customer's picture. WTF.\n\nThe difference? The only thing I can think of is that I'm Asian and the othe customer is white.\n\nThe owner seemed like a nice, happy guy. And I didn't experience any other issues with anybody else working there. And I see plenty of pictures, on the internet, inside Grimaldi's. There are plenty of other places to go for pizza and plenty of other places to spend my money.", "author": "Andrew C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}