{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-15", "description": "We did a head-to-head comparison of Grimaldi's and Lombardi's over the river. Yes folks, we take our job as pizza connoisseurs very seriously. We had left Lombardi's quite satisfied the night before. That was until we sat down and started eating here (after a 60+ minute wait, of course.) The wait is a pain, but I rate this place higher. We ordered the same pizza: with sausage, onions, and mushrooms. The crust was thinner (point to L as I prefer a slightly thicker crust), but the sausage here was much tastier. And at $26 for a large, it was $6 less than the medium we ordered at L. Grimaldi's is the clear winner.", "author": "Eme L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-13", "description": "I feel like I shouldn't even write a review because there are too many already, but whatever, best pizza in New York.  Stand in line, no slices, no credit cards, whatever, eat your heart away.  Plain pizza, toppings, white pizza, black cherry soda - this is what heaven is.  Always a favorite.", "author": "Pamela R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-04", "description": "Rated the best in Brooklyn, I don't see why, This place is good but not the best. \n\nFresh ingredients yes and good crust but, overall I have had better.", "author": "Gary D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-30", "description": "I work up the street from G's so we get it at the office all the time. I bet I've had more Grimaldi's than the people who work there. I crave the stuff, but SOMETIMES THEY USE CANNED INGREDIENTS AND THE PIZZA TASTES LIKE POOEY. \n\nThat said, their pizza isn't exactly New York pizza to me. It's more Italian. It's quite fancy and beautiful to look at. The cheese and sauce are evenly distributed, and not lain on top of one another like a street slice. \n\nIf you go there, go in the middle of the day (weekday) when it's bad weather outside. there's almost never a line when that's the case, and you'll get special attention from the very lovely waitstaff. I've accused katz' of not being authentic, but Grimaldi's DEFINITELY is. They live in a time warp. They almost have no idea how booming their business is. It's like they were just pumped the president showed up to feed his kids pizza so they could get a picture of him. \n\nEating there makes the pizza better. Take out isn't so great. It's just not the same as sitting at those picnic tables and sharing a carafe of wine with a loved one. Now I'm hungry.", "author": "Cookie Breath S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-29", "description": "First and last time!   The staff is unfriendly.  The pizza was bland, hardly any sauce.  It didn't taste fresh. The crust lacked flavor. It was the texture of stale bread.  Some other couple had completely burned crust,  literally covered in blackness.  Maybe we were fortunate.", "author": "Majd A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-05", "description": "The pizza here was great.  So great that I even got their Tshirt :)\n\nLuckily there was no line when we went (that was a Friday evening) and we were able to get started right away.  My wife and I had the pizza with extra cheese and basil, and it was fabulous.  I only hope we went with more people so that we could enjoy different types of pizza.\n\nAnd thanks to yelp, we didn't forget to go to the Brooklyn Ice Cream Factory after our meal, too ;)", "author": "Durif M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-10", "description": "Now I know why this place is called the #1 pizza place in NY. \n\nUnlike normal pizza you would order from home or fast food chains, Grimaldis makes it own pizza from scratch.  The types of cheese and sauce they use are special and different that you just want to keep on eating this pizza. \n\nThere's no set pizza here. You make your own by adding different toppings, and everything including the dough is made it just for you and your friends. \n\nWhen the pizza comes out of the oven and gets stationed in front, you can't stop by drool over the pizza, because it's hot, fresh, and delicious! =D \n\nIf you are going to Brooklyn, make a stop there and try the pizza!", "author": "Janice K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-01", "description": "We made the trip across the Brooklyn bridge, waited in the long line, and waited forever for our pies to show up. Once they did, we soon discovered that this place lives mostly off of the hype surrounding it.  Don't get me wrong, the pizzas are better than Dominos, but they are no better than the random pizza place we found wandering around town late one night at a place with absolutely no wait. The view of manhattan from right down the street are truly breathtaking, however.", "author": "Shawn Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "Waited about an hour in line on a sunday evening and it was worth it. The mozzarella is so fresh and piled on thick, the crust is so crispy and thin, and the basil adds a nice touch. The pizza took a while to come out but no complaints.", "author": "Cherry P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-29", "description": "A bit of a trek,\nBut worth it for the skyline.\nClassic NY joint.\n\n(Part of Best NY PIzza: The Haiku Series)", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-10", "description": "Terrible terrible service. We tried to catch the attention of a waiter and he just ignored us. Even if he wasn't our tables waiter he could have let us know he would send our waiter over instead of ignoring us.", "author": "Senshi T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-01", "description": "Delicious NYC style pizza served under the Brooklyn bridge... does it get any better than that? The crazy long lines are off-putting however, and somewhat cuts into the romantic allure of this place. We called in and ordered and pizza, picked it up, and ate it across the bridge in NYC. If the streets weren't covered in snow, we would have eaten it on the bridge. I recommend doing the take-out route (took us 10 minutes) if you have little patience for waiting in line. We ordered a half margherita and half pepperoni pizza. We tried Saluggi's, Rosarios, and Mezzaluna in NYC during the same week and I thought Grimaldi's was the quintessential NYC pizza.  Let's not even talk about Arinell's here in SF. The mozzarella is delicious as is the tomato sauce. The thin crust was perfect and had a smoky taste from the coal-oven.", "author": "Annie Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-19", "description": "I have good memories from this Restaurant.... The pizza was good... has a nice homemade taste. :)", "author": "Sehar H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-05", "description": "Ok, I originally hail from NE Penn. We may not have much up there, but what we do have is a huge ethnic population. That huge ethnic population can make food that puts most restaurants I've been to in their place (note, most). This is especially evident when I went to what it supposed to not only be the best pizza in New York, but in the country. \n\nThe pizza is good, bordering on great, but I went in with the expectation to be floored, and I most certainly was not. It was fairly standard brick oven pizza with a simple sauce and mozzarella cheese. Nothing to write home about, but apparently something to write here about. Overall, I would go back to NEPA and eat in Old Forge or, my personal favorite and what is quite possibly the greatest concoction of cheese, dough and sauce on the planet, Jerry's Pizza.\n\nI didn't have any trouble with a wait. We went on a weekday, stopped in at a bar around the corner, ordered a Brooklyn Brown, called Grimaldis, picked it up in 20 minutes and ate our pizza in Brooklyn Bridge Park, which may be the reason I gave it so many stars. Quick service, decent pizza and a sunny day in dumbo.", "author": "Wallspro S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-09-27", "description": "I don't get it. The pizza was not only not good, it was bad. I don't mind the wait and rude waiters if the pizza is going to be a mind blowing experience, but it was terrible. Thin crust pizza with flavorless sauce and yes they use real mozzarella cheese but it had no flavor and not enough salt.\n\nTourist. Trap.", "author": "Nicole W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-01", "description": "Grimaldi's is worth a visit, but probably only one. \n\nThe pizza is pretty good, but its far from the most amazing that I've had and is certainly not worth the ridiculous wait. We were lucky and got seated within 15 of arriving, but when we left there was a line down to the end of the block (outside, in the cold - this just seems like madness to me).\n\nThe coal-burning wood-fired oven is the real deal and the pizza is crispy, thin, and made with proper fresh mozzarella. But, honestly, that's true of lots of pizza places that don't have huge lines out the door.", "author": "Miranda S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-26", "description": "Very good pizza.....BUT tourist mentality. Rush you in and out waiters. Unfriendly staff...You could find delicious pizza all over town..This is New York City!  Won't be back and P.S I live a short walk away and an original New Yorker.", "author": "Jerry V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-27", "description": "So one day my girlfriend and I were bored and I convinced her to walk across the Brooklyn Bridge, and I remembered there was a well known pizza shop around there. Long story short we decided to get a pie, ended up waiting an hour for an undercooked pie with subpar sausage. I mean really...as soon as I took a bite I could taste that it wasn't cooked properly, and a cross section of the extremely thin pie showed striations reminiscent of the earth's layers - cooked, sorta cooked, and kinda raw. Completely overhyped, also the $5 atm fee next door to this cash only restaurant is downright usurious. Plenty of other great pizza shops in New York, no reason to wait on line for this one.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-14", "description": "Hey, Grimaldi's pizza is great. But the line isn't. If you're not a tourist, want pizza for dinner and don't want to wait on line, find another pizza place. There's a new one in town anyway. It's down the street from Peter Luger's called Patricia's at 35 Broadway. It's not Grimaldi's, but it's goood.\n\nHonestly, Grimaldi's is good. I mean, better than 90% of the pizza joints in NYC. It could be fun to wait on line, bring a fun game...cat's cradle, remember that? whatever, a game, Nintendo DS, PlayStation, etc...be creative with the date you bring with a list of 20 off-beat questions.", "author": "Kiai K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-25", "description": "Three stars because the sauce was good.  But waiting 35 minutes for the pizza to get to the table?  One small, plain pizza?  Especially when your specialty is pizza, they should be coming out of the ovens  on a regukar basis. The service here is really bad.  As a native New Yorker I know there are far better places than this tourist trap.", "author": "Susan K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}