{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-13", "description": "Hands down the best New York pizza I've ever had.  Ingredients are all clearly quite top notch, the flavor is just perfect.\n\nLess pleasant is the wait.  Be prepared to wait outside a long time to get seated.  I've been a few times and the only time I ever managed to get seated easily was on a rainy day in the middle of the afternoon on a weekday.\n\nNote that I have not less this deter me, and when I'm really feeling in the mood for some truly great NY-style pizza, this is where I go every time.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-07", "description": "Lombardi's was my favorite pizza joint until I tried Grimaldi's... utterly delicious! The lines are ridiculous but if you can go on a slow day, definitely worth trekking out to Brooklyn.\n\nMy 'fave pizza' rankings to date is below:\n\n1) Grimaldi's\n2) Lombardi's\n3) Little Italy on 33rd or 32nd street (Fresh Mozzarella slice) \n3) John's / Bleecker Street\n5) Joe's \n6) Pizza 33 (Fresh Mozzarella slice) \n7) Mozzarelli's (Yeah... kinda random, but they have whole wheat crusts!)\n7) Bravo Pizza (Fresh Mozzarella slice) \n7) Patsy's", "author": "Grace S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-03", "description": "My first time in going here was on Memorial Day Wkend and forgot to think that maybe this place is in all Tourist books of 2008.  Because the line was almost around the corner of the block.   So decided \"yeah... I just cant wait on this line just for pizza\".\n\nSo I was able to go two weeks ago on a Friday evening.  There was still a line but not as bad and it seems that it is easier to get seating if you are a party of two.\n\nSo we finally got in (after a 20 min wait) and my gawd, do they pack in the people like sardines.  Definly no frills kind of joint and the waiters seemed annoyed at each other for blocking their paths to get to the customers.\n\nSo we order our pizza with Schnapples and it was okay..  The pizza overall seemed soggy but the crust was still crunchy.  I guess it was maybe the extra sauce.  \n\nIt was definitly worth the wait if you want a pizza that you cant get around the corner but compared to totonnes..... I just doesnt beat it.", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-10", "description": "I can't really comment on how this pizza compares to other NYC places. But I can say, as a NY style pizza non-believer, this place made me a convert.  Even with the 1.5 hour wait. Even with the cramped tables.  Even with the botched drink order.\n\nThis pizza was AMAZING. Delicious. Especially the basil leaves on top!  While I don't know I'd do the whole wait thing again, I'm glad I went.  I now know I like NY style pizza!", "author": "Courtney S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-29", "description": "Of all the pizza places I have been to in NYC, Grimaldi's is always my favorite.\n\n. . . Food . . .\nMy usual standby is a pizza with pepperoni, ricotta and roasted red peppers. It is amazing every time and although I don't live in New York anymore I try to go back to Grimaldi's whenever I can.\n\n. . . Service/Atmosphere . . .\nThe only reason I am giving this four stars instead of five is because the process of getting the pizza into my stomach takes some work. I usually try to go at off-times because the line can get pretty ridiculous. They do move people quickly though, which is good when you are standing outside but can make you feel rushed when you are the one trying to eat your pizza. The waiters are not particularly friendly, in fact some years ago I went with a group during a slow time and our waiter was quite unpleasant. We had barely had a chance to take our coats off when he came by to get our order. When I said we weren't quite ready he said \"It's easy. Pepperoni or sausage.\" Really, it's not that easy. So we rushed to get our order together and then he took his sweet time coming back to us.\n\nThe pizza is good enough for me to forgive the unpleasant waiters.", "author": "Ramune R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-18", "description": "Wasn't what I expected, but after walking the Brooklyn bridge it was a good pizza for the price! Make sure u have your cash ready.", "author": "Dennis C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-17", "description": "I'm not a huge fan of pizza, and therefore I have never had any inkling of desire to wait in line at Grimaldi's.  But last night we had a visitor from out of town and it was getting pretty late, so we thought we'd give it a shot.  We only had to queue up for about ten minutes or so, which is practically nothing, no matter what restaurant you visit -- and we made all that time up inside with the lightning fast arrival of our pizza.\n\nThe crust on that pizza was pretty darn near perfection: the perfection ratio of chew to crisp to char.  I also loved how fresh the cheese and tomato sauce tasted -- even though, in general, the tomato sauce was thinner than I like it.\n\nOne of my favorite parts of the trip, though, was getting to watch them make the pizzas while waiting in line for the restroom!", "author": "Kathleen B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-03", "description": "As a native New Yorker, the amount of time I had to wait for the pizza was not attractive at all. There was no wait when I got there, but they made me outside for 45min before sitting anyone. It seemed like they wanted to create an unnecessary line. The pizza itself was very good, but unfortunately, I happened to sit right under the AC, which made my pizza really cold. I guess my experience was not the best one here...", "author": "John J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-02", "description": "Wanted a unique Brooklyn pizza experience and got one.  Great location near the Brooklyn Bridge, easy to get to via subway.\n\nOur wait was only about 20 minutes at lunch time.  Service was OK, timely but not really attentive (the only reason for the four stars).  The two pizzas we ordered were hot and delicious.  The sausage combo had excellent flavor and balance, while the \"white\" had a great ricotta taste.\n\nThe only downside is that I'll have to wait until my next visit to NYC to try it again.", "author": "TJ M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-07", "description": "Seriously overrated.  The only reason to go to Grimaldi's is if you're in Dumbo anyway and need a quick and reasonably priced dinner.\n\nThe pizza just isn't that great.  (For a famous pizzeria that really *is* that great, try Di Fara in Brooklyn or Pepe's in New Haven.)  It's bland, not always crispy, and not nearly salty enough to be considered New York style.  It's passable, and consistent, but nothing here screams \"good pizza\" except maybe to tourists.  (Which explains why this place is full of them.)  There are dozens of better pizzerias in New York.", "author": "Mike E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-11", "description": "As noted by dozens of other reviewers, Grimaldi's pizza is outstanding. Creating hot, fresh, and mouth watering assortments of brick oven pizza, I have been a loyal customer since 2000. The only caveat is that the line to get in can be long, but the staff keeps it moving and it is definitely worth the wait. If you are visiting New York or just want some delicious pizza then here is my Grimaldi's routine (complete with dessert, sweeping views of Lower Manhattan, and a walk across the iconic Brooklyn Bridge). Come hungry, with a good walking shoes on, and a camera to capture a uniquely New York City experience.\n\n1) Take the A or C train towards Brooklyn and get off at High Street/Brooklyn Bridge stop\n- Exit near intersection of Henry St and Cranberry St\n- Start out going North on Henry St towards Middagh St\n- Turn left onto Old Fulton St towards Grimaldi's\n\n2) Enjoy an outstanding pie at Grimaldi's (waiting in line if necessary)\n\n3) Walk to the Brooklyn Ice Cream Factory, towards the water, for dessert. They have simple ice cream flavors, excellent hot fudge, and a killer banana split.\n\n4) Enjoy your dessert indoors or overlooking the East River\n\n5) Backtrack towards the Brooklyn Bridge pedestrian entrance, passing Grimaldi's. The entrance is slightly under the bridge and dark so if you are antsy then do this trip around lunchtime.\n\n6) Walk across the Brooklyn Bridge towards the beautiful landscape of Lower Manhattan, where a 4,5,6 \u0026 J,M,Z is at the end. (Bring a jacket because it can get a bit windy in the evening and chilly on the bridge, depending on the time of the year)\n\nI have made this trip numerous times throughout the year and it never fails to impress my friends or myself. It is great to do with friends, a lover, or with your family. It will be a Grimaldi's experience that you will never forget!", "author": "Dia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-14", "description": "Hordes of hungry people lined up along the sidewalk against the backdrop of the Brooklyn Bridge. The door swung open with a deliberate forcefulness. A muscular arm shot out from the door beckoning seductively towards the crowd.\n\nThinking about my two week trip to New York, the one image that stands out most in my mind of New York food is the manager of Grimaldi's waving in more eager customers. I never intended for food to be the main drive of my trip to the Big Apple, but if food was my religion, this would be my pilgrimage.\n\nGrimaldi's, redefined pizza for me. Waiting in line in Brooklyn for more than an hour, I thought that Grimaldi's must be overrated. After all, this was the first restaurant I had ever seen awarded an extraordinary Zagat rating. Upon insistence that I try the plain pizza, I ordered one with no toppings. A good pizza dough and great tomato sauce really do make the pizza. But having discovered that, there was no reason why I could not add some sausage and onions to my next pizza that only improved on the original. Grimaldi's is worth the wait, trust me on that.", "author": "Aaron C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-22", "description": "Food Road Trip: New York City, Day 2\n\nFull Disclosure: I love tomato sauce pizza. It's one of my favorite food in the whole world. \n\nGrimaldi's was on Chris K.'s list of places to eat while in New York so we walked from Chinatown across the Brooklyn Bridge to get here. We had heard about the lines so we decided to go in the afternoon. No lines so we were seated right away. The place is pretty small and they pack the tables and chairs so there's not much space. I'm from California so I'm not use to sitting so close to my fellow diners. I wasn't hungry when we sat down, because we had just eaten noodles in Chinatown about 2 hrs before. Only two of us (Chris K. and I) were up for the pizza so we got the small 16 inch pizza. We had half cheese and half pepperoni. \n\nI thought I was only going to eat 1 slice and have to take the rest to go, but we finished it between the two of us. 3 slices per person. I prefer thin crust pizza so this hit the spot. I have never tasted a crust like this one before slightly salty, crunchy and a bit chewy at the same time. The tomato sauce was sweet \u0026 sour and complimented the mozzarella cheese and crust quite nicely.  The first slice was heavenly. The cheese was stringy and pulled from the crust. The cheese pizza was simple but tasted so good. I hope Chris K. will put up a picture of it. I don't think California has a pizza place quite like this which is a shame. I like this style of pizza. My only complaint is that the since it is fresh mozzarella medallions, when the pizza cools down the texture of the cheese is not as smooth. Next time I go to New York City, I will definitely come back here.", "author": "Andy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-22", "description": "Just absolutely delicious. I think this one takes the cake!\n\nI was there with a party of 6 and there was no line.  I stumbled in close to last order on a Wednesday night after a Barge Music concert right down the block. I guess that was around 10pm? 11pm? I settled in, had a Heineken and ordered pizza with meat.\n\nThe dough was delicious, thin, crispy on the outside and chewy on the inside. And more importantly, the cheese to sauce ratio was perfect. I prefer saucy pizzas, because the cheese taste is overwhelming. There wasn't any of that here. The cheese was thin and gooey, nothing like the hard chewey cheese you find encasing most pizzas in most places. \n\nI had a grilled cheese sandwich dinner before the concert, but that didn't stop me from scarfing down 3 slices or so of the medium pie.\n\nThe restaurant looks like a dime a dozen Pizzaria with pictures all along the walls. The service was fine and they have the staple beers on hand... nothing fancy. Go there for the pizza and come out a happy (wo)man.  \n\nThey did sort of kick us out past midnight (HAHAHA - understandably so) after they cleaned up. They put up all the chairs and started shutting all the gates down... yeah... They were very nice, though.", "author": "Umi F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-04", "description": "Grimaldi's is not so much a pizza joint as it is a time machine... If you grew up in NYC  in the 60's you understand what I just said, if you didn't you will have to take my word for it. Their was a time when almost every neighborhood pizza shop was this good, that was before the heretics and infidels came and put things like pineapple or buffalo chicken on pizza... but I regress.", "author": "Alan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-10", "description": "GO! Enough said about this place. \n\nTwo Problems:\n1. You will have to wait in line for a very long time, but it's worth it.\n2. You can't order slices, only whole pies.\n\nOne Solution:\nJust bring some friends along.", "author": "Christine J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "Excellent pizza and worth the wait to get in, although 10-15 minutes on a Saturday in August isn't bad. Friendly service and the best NYC pizza I've had. Highly recommend checking it out!", "author": "David M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-29", "description": "Finally. We tried going here in the summer and the line was down the block. We definitely weren't waiting on that. Last night we happened to be in the city and were planning on going to 99 Miles to Philly but when we got there it was packed. Heading back to Queens, hubby suggest we try Grimaldis. It was late about 9:30pm so I figured it would be worth a shot . We got there at 10:15pm and yahhhh no line. Maybe because it's Halloween weekend or it was cold who knows. Trying to find a parking is stupid but we got lucky because someone from my hubby's fam was out there and happened to know the people that own the place. Hookup! We waited outside for 5 mins. The seating is definitely packed and not my preferred way to eat but I didn't even care. I was so hungry and excited to try this pizza. It came fairly quickly, maybe 15 mins. On arrival it was a beautiful looking pizza. Thin crust, done well not burnt, fresh tomatoes and mozz and a few pieces of basil. My first taste- It wasn't an explosion of flavor like I expected. But it was good. I liked the fresh flavors of the mozz, sauce and hint of basil. The crust was the right texture and just crisp enough. I must say I enjoyed it thoroughly. And yes hubby and I ate the whole pie. And he's not the type to eat more than 1 slice in a sitting. I would definitely come back on an off night when there's a chance of a small line. I don't think I would wait 2 hrs on a line for this though. Solid pizza.", "author": "Suriyati B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-10", "description": "The pizza was great, the wait and service was not.  The wait at 3:30pm on a Saturday was 1 hour 30 minutes. Once we got seated we waited another 10 minutes. The waiter only came by once or twice during the whole meal.  The pizza was great though. Some of the best NY style pizza I have ever had. We tried the white pizza and regular pizza and both were great.\n\nMake sure you bring cash because that's all they take.", "author": "Joe F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-22", "description": "The last pizza kingdom I needed to visit. Quite the trek, but luckily there was no wait. The pie was solid, but my only complaint was that it was not well done. The perfect pizza, is crispy with some black on the bottom and edges. Every other pie that came out was like that, ours was not. Everything else was solid.\n\nHad a calzone as well, in order to do a good side by side comparison with John's. Not too bad, but not John's. Neither was the pizza. \n\nReal good, but if you live in Manhattan there is no reason to trek out there.  John's, Lombardis, or the local hidden gems are better and closer.", "author": "Michael S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}