{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-01", "description": "Waited about 45 minutes (outside) for take out pizza that made me wish I had Dominos instead. Ordered a small (which wasnt small in the least but, but great for the price) sausage pizza. It was average. I may go again.", "author": "Ariel E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-20", "description": "Its ok tasting. The great thing about NY is ordering by the slice but you can only order pies here and they only accept cash. It is in a new location and for the crowd it gets it's still so tiny. Expensive and a tourist site. Not worth it as a local. Better smaller pizzerias at better prices. People were pretty rude. Just b/c it's NYC doesn't mean it's rude. Great thing about Brooklyn from other boroughs is it's more personal and we take great pride in our neighborhoods. This pizzeria, very commercial and disconnected. Overall, pizza is OK, kinda fresh, and I didnt get enough cheese and the dough was kinda bland.", "author": "Connie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-25", "description": "I feel like John's Pizza in the Theater District is better, but hell this was up there. Also, this building was in the movie \"She's Gotta Have It\" so if you're on a date you can have a reason to bring up the cheesy one-liners from the movie. \"Eyo baby you so fine I could drink a whole gallon of yo' bathwater\"", "author": "David H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-10", "description": "Let's cut to the chase.\nWaited 45min outside, would have waited longer if we didn't meet another couple and made it a 4 person table. \nWaited an hour for my pizza. When it finally came i was more mad than hungry and.. the crust was burnt! Damn you for burning my favorite part!!!!! \nService was okay. I just hate it when a place gets so popular the waiters seriously thinks it excusable to have patrons wait an hour and when ask they respond with \"That's how it is\" WTF? Be professional, Lie to me that you'll check it at least. I should not have to tip you for that kind of BS response. Pretend to check my goddamn pizza and lie about how much longer i would have to wait! \nIt gave me a inkling of how good this pizza could have been but what a let down. Pizza is a simple thing, That's why people love it, With all that wait, bullshit and in the end i get pizza that's soggy at the tip and burnt at the crust. I definitely had better. Surprisingly... one of them is their Manhattan location. For shame Brooklyn you have failed me here.", "author": "Kei Y W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-27", "description": "Carol S. RAVES about this place so I knew I had to try it and see what all the hype was about.  Grimaldi's is solid... but I didn't think it was amaaazing.  Not sure if it's worth the wait.  We came on a Friday at 2pm and there was still a crazy long line!  We waited about 45 minutes before getting seated.  Once we got seated though, from the time we ordered to the time our pizza arrived was super fast!\n\nWe got one large pepperoni, mushroom, and extra cheese pizza and one medium simple cheese pizza.  You have to eat these right away when they're piping hot!  Wait 5 minutes, and the appeal is not the same.  All the ingredients are super fresh, and if you order pepperoni you'll notice that these are not your traditional large round kind either.  They're about the size of a nickel, layered all over the pizza.  The slices were so large that I couldn't fold it without toppings sliding off, so I had to use a knife and fork.  The crust was super thin, but I wish it was crispier (like the crust at Bleecker Street Pizza).  The crust here was just too soggy for my liking.  The cheese is fresh mozzarella - it's the chewy, rubbery kind instead of the melty kind... if that makes any sense.  I'm the type that prefers the melting, oozing cheese.  There are also hints of fresh basil throughout the pizza... but I could barely taste it.  Overall, something seemed lacking about this pizza - in the end, I thought it was kind of bland and unmemorable.\n\nThere's this friendly, jolly man with a head speckled of white who was greeting all the guests, both coming and going - he was so nice that I couldn't help but ask him, \"are you Mister Grimaldi?\" as I walked out the door.  He laughed a jolly laugh and said, \"nope!  I'm just the manager\".  I couldn't help myself, I just had to ask!", "author": "Angela C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-28", "description": "If you are waiting in a long line outside of Grimaldi's for a table and you are considering this may not be worth it, just have someone hold your place and walk inside for a moment. The smell of pizza will hit you right in the face and you will know you are doing the right thing. \n\nI love the set up here, the oven is right in the dining room for all to watch. Because of this you can really take in the aroma of fresh baked pizza pies. It can be torturous as you wait for yours. I wanted to put this place to the test as we had Lombardi's just a few days prior. So I ordered the same exact pie to be fair. I also had the benefit of watching them make a pie up and close. \n\nThe fresh mozzarella is sliced and generously spread out on the pie in a circular fashion, from the edges of the pie towards the center. As I watched this master pizza maker, I couldn't help but think of a black jack dealer. Rather than cards, he was speed dealing mozzarella slices. Raw crumbled sweet Italian sausage was added next on top of each slice. I'm not sure of the reasoning, perhaps the heat of the bubbling melted cheese will help make sure the sausage is cooked all the way through. After the toppings were added, sauce was the last ingredient put on the pie. Rather than spread out evenly it was dolloped on more like a topping. \n\nBecause of how hot their coal oven is, this thin crusted pizza cooked very fast. I think the texture of the dough was the best, I've had. It had just a little bit of chew to it, so it was soft around the edges. Perhaps this pie could have stayed in the oven just a few minutes longer to pick up more of the charcoal smoke flavor, but it tasted great anyway. \n\nThe roasted red peppers were good and well marinated. I found the black olives very strong, they weren't your usual black olives. More like a Kalamata olive. They kind of overpowered the pizza in my opinion, but to each their own. We ended up taking them off. The pepperoni was of high quality and perfect. The sausage was also good, but I prefer the sliced sausage at Lombardi's. When you have crumbled sausage, you run the risk of getting a chunk of gristle. While this happened once or twice it didn't ruin my enjoyment of the pizza by any means. Also I wasn't too big a fan of baking the whole leaf basil. The basil got charred and shriveled up as it cooked. As a result, I think it lost it's flavor a bit. I think shredded is better than whole leaf basil. When you shred it, it covers more surface area of the pie, so you get a taste of it in each bite. \n\nI am nitpicking a bit, because if I only had to eat this pizza the rest of my life, I would be happy. So the complaints are more observations, rather than complaints. I give Lombardi's a slight edge, but Grimaldi's makes a great pie, and is worthy of 5 stars.", "author": "Dave G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-03", "description": "Over-rated, over-priced - I waited over an hour in 30 degree weather.  I got a pizza wh's crust was overly charred and that was soggy in the middle.  Unacceptable. \n\nAnd, in case you were wondering, yes I did eat the whole thing, thank-you-very-much.  What's that gotta do with it??\n\n(P.S. the anitpasti plate was amazing, not wait an hour in butt fuck cold weather in front of an annoyingly smug family of smokers amazing, but still it almost made up for the disappointing pie).", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-05", "description": "This place does NOT live up to the hype. Do not wait an hour then wait 20-30 min for your pizza. You will not be wow'ed.  I was wondering why no one came out with a happy smile on their face, because a NY slice of pizza would just be so much better.", "author": "Ilona P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-03", "description": "Best pizza in New York....the cheese oozes from the pizza and crust has that nice crunch to it.\n\nThe downfall of this place is the ambiance and the wait.  I'm pretty sure making the money they do they can at least open up a bigger place, instead of bumping elbows with everybody.  The ambiance is pretty garbage.  They really need to step and get someone to modernize that place.  The wait sucks balls. Really if you valued your customers and want more money......help your customers out by again opening a bigger place and not having them wait for hours in the cold. Just Saying.\n\nBottom line: Great Pizza, Horrible wait", "author": "Chris L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-03", "description": "Good pizza, stretchy cheese, kind of italian style but not as good as some similar Chicago places. Mostly just overrated for the ridiculous line..", "author": "Chad C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-02", "description": "I can proudly say I've been a New Yorker for 7 years, yet in the same breath, I can ashamedly say that until a week ago, I had never, in all that time, had a slice of the famed Grimaldi's pizza in DUMBO. And it wasn't because the line stretches around the corner at all hours. And it wasn't because I was a Manhattanite that dare not trek all the way to Brooklyn, let alone for a pie (they don't do slices, not to mention reservations, delivery, nor credit cards). And it wasn't because I don't love a great pizza. Honestly, it was because, well...I never really got around to it.\n\nAs a New Yorker, one has a laundry list of things one MUST experience (damn cultural guilt), which somehow continues to grow exponentially every day. It is our responsibility, after all, to take advantage of all that is placed at our finger tips, yes? This overload of stimuli is what attracts some and, at the same time, deflects others, from this little big city. (I am of the former breed, if you couldn't tell already.)\n\nThus, how appropriate that after living in \"the city\" (Manhattan, for those not familiar with the elitist lingo) for 7 years, it is when I become a Brooklynite (can I call myself that after moving there just under a month ago? I say yes.) - it is when this happens that I finally sink my teeth into that doughy goodness that is Grimaldi's. Consequently, it doesn't hurt that it's a 10-minute walk from my door to theirs.\n\nNow I am one that is consistently critical of hype and hoopla, especially when it concerns food. (Insert my eye roll here, thinking of my wasted time in dramatic lines at Magnolia's for an awful cupcake and Shake Shack for an \"eh, I've had better\" burger.)\n\nHowever, Grimaldi's does not fall into this overrated category of food expereince. On the contrary, it's probably better than you can ever imagine. And do you want to hear the kicker? I did not even have to wait in line! (Gasp. I know, the envy is nearly palpable.) I must have gone at one of those extremely rare off-peak hours/minutes/seconds and my eager, hungry party of three strolled right in to a table by the window. I'm fearful to divulge what day and time this was, as I do not want to lose my edge. But, okay, twist my arm. It was a Saturday evening post-10 pm.\n\nTo make a long story short (as I now have an official craving and we know delivery is not an option) it was the best damn pizza I've ever had. We ordered two pies, naturally, to try their two different types: Regular, which comes with saucy crushed tomatoes, mozzarella, and fresh basil; and White, which simply boasts extra mozzarella, garlic, and fresh basil (sans sauce, hence, white). To the regular we added onions, and to the white, ham and mushrooms. Excellent additions if I do say so myself. If I had one criticism, it would be that they skimped on the fresh basil, of which I can't get enough. Nonetheless, each pie was deliciously unique, tapping into two completely different palates. I could not decide which to savor as my last bite. I think I may have shoved both into my mouth at the same time; it's only fair.\n\nWith the perfect balance of flavor (thanks to fresh ingredients), the perfect pizza crust (doughy and bubbly with the slightest crunch), and the perfect company (my two favs: my mama and m'lady), I left an overly satisfied customer, ready to do it again...and wait in line a million times over.", "author": "Rebecca K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-08", "description": "The guy in the front are so disgusting and rude! (Middle age Caucasian not American for sure) I should have taken his name but I was so mad at that  moment. I will never eat at this place I don't care how good the pizza is. After standing in line for a hour and waiting 30 mins for my pizza.I asked the gentleman if he can ask the guys to clean the slicer before he cuts my pizza because I'm a vegetarian. He looked at me and said to me \"ARE YOU FREAKING KIDDING ME?\" I said yes please and he told me \"NO I CANT\" I cancelled my pizza and he said \"GOOD\". How rude and disgusting", "author": "Nina H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-10", "description": "During the summer time, grab a couple of friends, order a pie to take out, grab a couple of Brooklyn Lagers and post up behind the Brooklyn Ice Cream Company.  Or if you can find a space on the pier, go for that.\n\nEnjoy your pie, your ice cold brew and your friends with one of the best views in the five boroughs - the East River with Downtown and the Brooklyn Bridge in the background.\n\nThank me later.", "author": "Tony N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-25", "description": "Take\nTourists\nAcross the\nBridge to stand in \nLine and then celebrate with some ice cream.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-10", "description": "Long wait. Great pizza. Great cheese. Totally worth it. Been here several times. Always bring out of town visitors here. It isn't my favorite pizza, but it's a good trip - Brooklyn Bridge walking then Grimaldi's!\n\nAbsolutely not a tourist trap like what's his name said...it sounds like what he was looking for is some crappy tourist place. If that's what you want, go to Dominos or Times Square", "author": "Emily F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-30", "description": "The line was long but we weren't waiting for more than 30 minutes. The pizza was so good. SO GOOD. Definitely worth the wait. The only downside was the cramped quarters and the noise level. Other than that, I can't wait to come back to the city for some more Grimaldi's!", "author": "Daina R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-05", "description": "I must say I wasn't too impressed with this place. Everyone else has glowing reviews. \n\nShort and sweet here's my experience: \n1. Line was long but we got called out of the line so that was a plus! We only had to wait about 15 instead of 1hr.\n2. Their dark cherry cola was good, but they didn't make it.\n3. Pizza was nothing to write home about, crust was kinda burned. We got pepperoni, mushroom with extra cheese. The best part was definitely the cheese! Very fresh and good.\n4. Some people next to us seemed to be on a first date and all they could talk about was our drinks, and the girl kept making dumb comments but that didn't really have anything to do with the food..was actually kinda funny.\n5. only take cash, no cc!\n6. the waiter bumped into me as he walked by, we were on an end table..and didn't really notice. \nIf you have a big party, you are gonna have to wait long.", "author": "C M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-18", "description": "Good pie! We really lucked out and didn't have to wait for a table! The pizza was huge, yummy and came out fast. The staff were efficient and took care of us while we were there. \n\nEasy walk from the subway with a short hop to the water to see the city. Love this place!!! Wish we could have gotten another pie to go to bring back to the hotel but didn't want our pizza to get stolen on the subway!", "author": "Dannelle A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-24", "description": "Wanted to experience authentic NYC thin crust oven baked pizza.\nI thought it was probably the best pizza I've ever had, but I can't say it wow'd me.  I must have had high expectation going in after reading all the other Yelper's +ve experience.\n\nPepperoni, Mushroom, Sun dried Tomato, Sausage.  Try something other than what I ordered and maybe you will get a better experience than I did.\n\nEfficient service \u0026 tables turn really fast.", "author": "Wil L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-05", "description": "I don't understand how this place got a reputation for good pizza. I got suckered in, did the 1.5 hr wait, left so disappointed. Not worth your time or money. Stay clear.... I promise you won't regret it", "author": "Giovanny D."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}