{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-24", "description": "Came here on a Tuesday  right with two other people when it opened and got seated right away. Within 30 minutes, every table was pretty much seated with people. \n\nWe ordered two small regular pizzas, which has 6 slices(1 slice is HUGE). One with ham \u0026 oven roasted sweet red peppers and the other with mushroom \u0026 sausage. The sweet red peppers were delicious! \n\nThe three of us did not finish both pizzas so we took the 3 leftover slices to go and i ate a slice on my flight back to LA. Even though it was cold...the ham \u0026 sweet red peppers were so good and saved me from starving on the plane(definitely did not want to pay $4 to the airline to feed me HALF a PBJ sandwich).", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-24", "description": "There are so many reviews of this place I'll keep it simple: It's been a year since my last visit to Grimaldi's, but I have to say, if one uses the Margherita Pizza as their litmus test as I do (since it's usually a constant selection across all pizza restaurants) -- Grimaldi's has not been beat (yet)...\n\nPrepare to wait -- but it's Worth it!", "author": "Art K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-24", "description": "Best pizza in New York!! Just be patient.. The line is super long (20-30 min wait) it was all worth it!", "author": "Jasmine C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-22", "description": "1 hour wait forgetaboutit Paulie ,pizza is only good hot really sucks an egg when its cold . the only Italian working there is the tomatoes from the can , learn how to speak russian and you can really communicate,I really cannot believe the reviews on this place these people must suffer from mass hypnosis, UYou want chracter and great authentic brick oven go to totonnos in Coney Island me I am a L\u0026 B Spumoni Gardens guy Come  on Sal and Paulie lets go get some real pizza at half the price", "author": "Jon Henry Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-23", "description": "Good pizza- however, not worth the wait. I am constantly amazed at the amount of tourists who are willing to stand in line during less-than-ideal climates for a pizza from Grimaldi's. It's okay pizza, by far not the best.", "author": "Miguel H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-06", "description": "I'm very sad that this place has gone downhill over the years. I've been coming here for at least 7 years and it's been on a steady decline, yet I still keep coming back, hoping that they will redeem themselves and serve me that piping hot, perfectly crisp pie that I remember.\n\nThe crust has gotten thicker over the years and can either come out soggy and chewy or black and burnt. The generous topping of fresh basil has been replaced with a 2-3 browning leaves. Major disappointment and no longer worth the wait. Not to mention, the service is non existent.", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-25", "description": "New Yorkers love lines!!  They wait in line for everything.  It's something I don't see much on the west side of the country.  We got there at around 11:30pm and there was already a line out the door.  We had no idea that the restaurant had not opened yet so when the line started moving fast, I was so excited!!  BUT we had one missing person and I heard that they do not let you in without everyone there.  We told the guy that our friend was walking from the subway, which she technically was but she was a bit lost, and he let us in.  \n\nEven though they filled the entire restaurant in a span of ten minutes, I was wondering how long the wait would be for our pizzas since there wasn't a staggered ordering structure going on.  Nonetheless, our small pizza with pepperoni, mushrooms, and extra mozzarella came out in a jiffy.  As for the actual taste, I thought it was a bit bland.  My friend who has come quite a number of times said that there have been days when the pizza is just okay, and days when it is the most spectacular thing in the world.  Today was an okay day.  The pepperonis were delicious and tried to compensate for the lack of taste elsewhere but just couldn't.  The cheese is not so much stringy as it is just plops of fresh mozz, which you may or may not prefer.  Maybe we should've come later in the day so that the pizza guys would have time to warm-up.\n\nThere's only one bathroom so if you want to go, you have to wait in line right by the pizza makers and the oven.  They don't let you take pictures but I was watching them carefully and the ingredients are just amazingly fresh.  It's a bare bones type of pizza.  The table of four next to us ordered three large pizzas -- omg.  Americans.  They only finished two though thank goodness.   With all the hype, I admit I was disappointed.  I do hope to come again on one of their \"on\" days.", "author": "Shannon L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-07", "description": "Best pizza in NYC, don't wait in line, call ahead grab it to go and have picnic at the park with the view of manhattan. Sun dried tomatoes, pepperoni, sausage, and red peppers, are my favorite toppings. You can't go wrong.", "author": "Mack C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-28", "description": "This is the perfect place to eat before or after crossing the Brooklyn Bridge. Their pizza was huge and absolutely delicious, but I was disappointed to find that the cheese had hardened by the time I'd reached for my second slice.", "author": "Grace L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-01", "description": "I have experienced pizza nirvana, and its name is Grimaldi's. It did not come without hardship and peril. This is my tale.\n\nIt was a cold winter day when we brave three decided to walk across the bridge to Brooklyn in search of the perfect pie. My cousin and sister had their youth, but I was turning 30 soon, and time was cruelly catching up to me. My body was frozen, but I was a driven man. Day turned to night. Onward we trekked.\n\nWe arrived to find a line outside, and an imposing sight it was to behold - all those poor  souls in the same spot for the same purpose. While others turned away upon seeing such a line, we had come too far and so to the back of the line we went.\n\nIt was torture. We could smell the raging oven, and in those brief moments when the door opened we could hear a wonderful cacophony of hearty laughs and constant bustle. We were close enough to see the diners smiling as they enjoyed pizza after pizza after pizza. We tried to look away, but the light drew us in and we couldn't help but stare. It was torture.\n\nThe line was growing longer. We were weak from the walk. I couldn't feel my face. Never had we felt so far from sunny California. And just as we reached the depth of our hunger and despair, hope and opportunity pierced the dark night as the maître d' called out, \"Is there a party of 4 in the line?\"\n\nImmediately I thrust my frozen hand to the sky and shouted, \"Party of 3 right here!\"\n\nHe smiled and waved us in. To the shocked chagrin of the 9 couples still waiting in front of us, we waddled out of line and through the door. Victory! We had arrived.\n\nWe were seated at a small table in a crowded room. Once the feeling began to return to our extremities, it didn't take us long to decide - pepperoni and sausage, with olives on half.\n\nThough others went knife and fork, my primal instincts kicked in and I grabbed a slice with my hand. I didn't know what I was missing out on until the first bite - the freshness and wonderful consistency of the mozzarella, the bold olives, the spice and zest of the sausage and pepperoni, the wonderful light notes from the basil, tomato sauce that actually tasted alive and like tomatoes, all on a smokey thin crisp crust. It was constructed like a piece of art - everything in perfectly wonderful proportion to everything else, all coming together into an amazing creation yet distinct enough that they all stood on their own. It was a revolutionary moment to realize what pizza could actually become.\n\nOur plates were spotless by the time we were done, and we left in a dazed state of bliss. Was it worth walking across the bridge and standing outside in the cold for an hour? Absolutely. Now that I've experienced Grimaldi's, I can understand why people are so passionate about it. This tale can't end. I will return.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-10", "description": "ohmygod this is the best pizza in the world!!!!  there will be lines out the door but that is what you get when you get the best pizza in the world.   awesomeawesomeawesome!!!!!!!!!!!!!!", "author": "Dear B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-20", "description": "A couple of things to know: \n\n1. You WILL wait in a long line no matter what time you come here \n2. Bring some water or drinks, if its a hot day you will get thirsty \n3. The chances of you getting seating are slim to none, best bet is to walk over to the park and pop a squat on the grass (but this is only practical if its warm out)\n\n\nWith that said this is fun to take out of town guests here because you get to walk over the brooklyn bridge especially if its nice out and out of towners seemed to always want to check this place out. However the wait time is a bit ridiculous so you'll have to warn your guests in advance... it could be worth the wait or weight... (get it? you know because pizza can be fattening... oh nm) lolz", "author": "Esther K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-26", "description": "Very slow service...servers don't respond or treat u well...will never ever come again...its pathetic..wait for pizza is almost 3 hrs in the restaurant...", "author": "Nihal S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-02", "description": "Came around 1 pm on a weekday for lunch, the line had maybe a dozen people before us. After a 15-20 minute wait, we were let in and went upstairs to finally try this famous pizza. We ordered a small pie with mushrooms, garlic, and meatballs. The pizza was cheesy and saucy (I like!) and the toppings were good, albeit a little sweet (meatballs). Dumped on lots of red pepper and a little garlic powder. I was expecting the pizza to have more of a thin crispy crust, it was a leeettlee too thick and doughy for my taste. However overall the pizza was good and tasted fresh. Don't know if I would come back again now that I got the \"experience,\" however would love to try Juliana's next door (from the original Grimaldis'!)", "author": "Sonia V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "For me, Grimaldi's is better than Lombardi's but the wait for Grimaldi's is worst. Both places are cash only which is kind of inconvenient. However I will say, when I waited in line at Grimaldi's it was only a 20-30 minute wait! The man who organizes the line is very friendly (given the circumstances) and lets you know approximate wait times once you get closer to the door. We split a pizza that had roasted red peppers and sausage. They use fresh mozzarella and basil leaves which I always appreciate. The chew to the pizza was very good and flavors balanced very well. It was a tasty pizza but for me it's hard to differentiate great pizza. Once  pizza is done right, it's all very good to me. \n\nMy one gripe has nothing to do with Grimald's but with Brooklyn Soda Works. It really sucks and isn't artisanal at all. The soda is terrible. They give you your own bottle and the soda is barely fizzy. I had root beer, for 4 dollars I'm expecting the root beer to taste better than Mug or A\u0026W brand but it didn't. I love root beer and this tasted like dollar general root beer that someone opened, took a sip, and put it back on the shelf without the cap. Totally disappointing with the pizza.", "author": "Lucy Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-18", "description": "Before moving from Brooklyn to Midtown East, we had to make a trip to Grimaldi's to experience what some people consider the best pizza in NY.. We arrived around 8:30 on a Wednesday night and the line was extremely long ~2 hour wait (as expected)..\n\nWe used some great advice and called in a pickup order from the line (plain cheese pizza) and walked around the corner for a bev.. 30 minutes and a pale ale later, we picked up our pie (in a bag as opposed to a box) and walked over to the park overlooking the water and an amazing skyline.. \n\nThe pizza itself was on the good side of standard: great crust, fresh tomato sauce and excellent mozzarella.. but was lacking something to put it over the top..", "author": "Diana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "this is by far the best pizza in NY, well Brooklyn! Well worth the wait, although we got lucky and waitied 20 min. the pizza was Hella Good. i would definatly recommend coming here. i would love to come back here and eat again on my next visit. Im a thick crust lover myself, but the thin was very Good. Two thumbs Up!!", "author": "Cerena G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-22", "description": "The pizza was very good and we did not have to wait as we arrived around 11:00 pm. The most disappointing part was no wine or beer (menu says liquor license pending) which is odd because the space seems like a nicer spot to sit and have a drink vs. Juliana's which has wine and beer but felt a bit too classy after we had a few beers earlier. Ultimately Juliana's wins the dumbo pizza war for me but I am glad I have tried both and recommend pizza fans do the same.", "author": "Ross W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-07", "description": "I am no NYer but I had my fair share of NY pizza and also all around the world.  This place is hands down amazing.  Everything is super duper fresh and made to order.  Considering everything is put together by hand and made from scratch food comes out pretty quickly and without any flaws.  \n\nThis place blows my mind.  This is a place where pizza dreams is made of. \n\nBring your greens....CASH that is!  No CC accepted.", "author": "Cindy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-09", "description": "Phenomenal pizza ! The cheese, the crust, the toppings, the sauce is all delicious. Yes, the wait is long and inside is very jammed but its worth it.\nI was lucky enough to sit next to the owner himself. He was very kind and offered free dessert !", "author": "Danielle A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}