{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-27", "description": "I was really excited to go back to Grimaldi's and was really surprised when there was no line when we arrived a little after 5 pm on a Friday. It seems like this place is not what it used to be. \n\nThe pizza was average although you could tell the cheese they use was very good quality.  I would have liked the crust a little more well done. It just didn't live up to my memory of when I came a few years ago. \n\nThe service was even more disappointing than the pizza. At times it was hard to find anyone to fill up our water glasses. And the check took forever. \n\nI am sad to say the next time I walk the Brooklyn Bridge I will skip this place.", "author": "Anisa A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-07", "description": "Their mozzarella cheese on their regular pizza is so fresh!  There is a line to this pizza spot, but it is bearable when you go there during off peak hours.\n\nTotally affordable for a great, tasty, thin-crust pizza!  \n\nService was good, cash only and you can't order slices!", "author": "Tiffany D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-24", "description": "NO LIQUOR AVAILABLE.  We walked in eager to try this place and was informed by a group of workers that they don't have a liquor license.  Sorry we wanted to enjoy pizza with some nice wine.", "author": "Ron L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-02", "description": "Nice place with Nice food! Was told it was some of the Best pizzas in NY. I Think it was great, but nothing i would have to have When i go to NY.", "author": "Sofie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-05", "description": "if you want to eat quality pizza in a historic setting, this is the place for you. nice \"clean\" (taste wise) pizza made with fresh mozzarella and high quality tomato sauce (believe they use imported san marzano tomatoes). it is chewy thin crust pizza and for me this is the pizza you want to make or idealize when you are attempting to make pizza at home. yes, generally making your own pizza sounds like a great idea, but it usually doesn't turn out well (maybe it's just me). please also note a small is 14\" and if you aren't too hungry, could easily feed 3 people. I went at a random time in the very late afternoon when there wasn't a huge line so I barely waited 10 minutes. however, I probably wouldn't be able to bear a 1 hour plus wait but totally justified if  bringing out of towners or you are dying to cross this off your pizza to do list. overall, quality place and the water front setting is amazing. cash only and probably mob protected :) go to the Brooklyn ice cream factory afterwards for some great ice cream.", "author": "Peter M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-24", "description": "I had finished with my wedding dress shopping at Kleinfeld's and I was starving because of course I didn't eat anything before my bridal appt. As we were walking, the scent of pizza filled the air and we followed our noses to a nearby famous pizzeria. We had a hard time trying to find the entrance and so we had to go through a clothing store to get to the pizzeria.\n\nThe regular pizza was more than enough for the 2 of us, we got mushrooms, onions and sausage on the pizza. I was surprised we had to ask for crushed red pepper flakes and parmesan cheese. The pizza was pretty good. I especially liked the crust. I don't know if this place lived up to its hype.", "author": "Julia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "We went to the Brooklyn location for lunch time pie. Our wait was about 15 minuets. Once we were seated, our waiter arrived quickly to take our drink orders. We ordered the small mushroom pizza. It was more than enough for two people to share. The crust was NY thin, but not cracker thin. It was cooked just right. The sauce and cheese were perfect. This place is nothing fancy, but if you want good NY pizza, the sign outside says it all: \"Furgetaboutit.\"", "author": "David M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-05", "description": "Well I was  a little skeptical considering I really love HOMESLICE in Austin. The pie could have used a little more sauce. The sliced mozzeralla seemed to do better justice than the shredded mozzarella everyone uses. Crust was ok- a little thick. Not crispy -almost soggy. The pepperoni pie was delicious. The meatball/italian sausage had plenty of meat! The manager was very nice and welcoming!!", "author": "Henry L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-25", "description": "The pizza here was recommended but I was a little disappointed by my experience. Perhaps if I lived in Brooklyn and wanted a restaurant with short wait lines, I would have a different appreciation. This is a no frills restaurant. The flatware is paper plates and plastic forks and you must pay in cash (which is painted on all the walls). The pizza was pretty good, I loved the cheese but the sauce could have been sweeter. The building is cool-it used to be a bank. This is authentic NY pizza but it's not #1. At least that's what my boyfriend from NJ says.", "author": "Elizabeth P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "My daughter \u0026 I visited New York earlier this year in January. We decided stop in to try this pizza before we walked the Brooklyn bridge!! I will say first the hospitality of Mo \u0026 Larry was fantastic from beginning  to end..\u0026 the pizza was phenomenal!! It was absolutely the best pizza I've ever had...", "author": "Chaundra C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "For as long as I've been coming to Dumbo and The Brooklyn Bridge Park, I've never joined the long line in front of the Famous Pizza Shop.... until now! My Wife \u0026 I really wanted some Pizza after enjoying PhotoVille. The line was no at long as usual so we decided to finally see what the hype was about. We stood on line for no longer than a few minutes before the next party of 2 (us!) was called in. We sat on the lower level at a Table on the other side of a wall where the Oven was. My Wife had the view of the Kitchen where the Pizzas were being made and she was in awe. I liked the fact that there was so much history in the Grimaldi's as well as a sense that everyone who worked there must've worked there for years. There's also no delivery \u0026 no Alcohol! Way to stick to old school rules! The look on everyone's face waiting for their Pizza was one of the most amusing parts of my time here. Oh! \u0026 The Pizza? AH-MAZING! The crust! The cheese! Everything about was amazing! So worth the hype!", "author": "Heaven G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-19", "description": "Gotta say that Grimaldi's makes a very good pizza.\nThe pie is thin with natural tomato sauce. And they have a few toppings options to customize your pizza. I always choose sausage with something.\nThe place is an old house, with lots of seats on both floors. Still, there's a 99% chance of lines outside. \nThe place became a touristic attraction as well; you don't see many residents here. Probably because it's near the pier, with a breathtaking view of Manhattan.\nIt's a great place to visit though.\nEven if there's a line, you'll eat in 30 minutes or less. The service is very fast. \nJust an advice: bring cash!!!", "author": "Augusto G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-14", "description": "The lines outside were daunting and long, but there was surprisingly a good amount of space inside so the line moved fairly quickly.  \n\nThe 5 of us got seated on the second floor and ordered a large regular pizza with chicken, sweet peppers, and olives... and the pizza was just ok for me - I was looking forward to some New York Pizza, and I guess I was expecting more of a thin / crunchy crust vs thicker one, I didn't taste much of the sauce or cheese, and nothing really stood out.   It could have been the combination of ingredients we got which overpowered the basics, but I still think basics should stand out on their own and the other things compliment it vs overpower it.\n\nServers were nice, but water refills were rare, they never checked on whether we liked our pizza and they seemed to go out of their way to scold the kids we were with quite a bit, which I found quite odd.\n\nThe menu also said you could get toppings for a half a pizza or a whole pizza, but I didn't realize that if you ordered half one combo, and half another combo, that you'd be charged full price for it as if you got a whole pizza of all the ingredients... so it came to about $26 for a mediocre pizza.. and they don't take Credit card.  I wish I had known that in advance - I only had $40 on me, so I used it to pay for the bill and then was surprised that the server never came back to give me my change and just pocketed the rest?  Not cool.  Hope I have a better NYC pizza experience before I leave!", "author": "Jen M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-18", "description": "We were excited to have New York Pizza.... service was mediocre pizza was good although I found the olives a bit saltier than I enjoy. Overall was interesting but they missed the mark.", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-09", "description": "This was by far the worst pizza I've tasted.  I went with my family here and we waited on line for 30 minutes for pizza that had no taste.  We ordered a large pie with chicken and the chicken itself tasted like they boiled it and put it on pizza.  There was no taste or seasoning to the sauce or chicken.  Huge Disappointment!!!\n\nI don't understand why there is always a long line every time I go in this area.  Needless to say I won't be returning. \n\nThe couple that was sitting next to me ordered a white pie and I must say it did look good, but I won't take the chance of tasting another nasty pizza.", "author": "Medesa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "Still my fave pepperoni pie...it's consistently delicious and reasonably priced compared to places with comparable quality.  \n\nIt's been years since I've eaten at the restaurant...and I've never eaten at the current location, only the original one a few doors down.  I mean, who wants to stand in line?  (The lines can get very long, as it's somewhat of a tourist destination.)  The hub and I place our order via phone, drive over (we live just a couple nabes away) and quickly whisk the delicious pie(s) home.  \n\nOften, out-of-town guests request Grimaldi's, and this is the best way to do it.  Grab the pies and enjoy them at home where it's relaxing and you have your own stock of beverages.  Always a crowd-pleaser.\n\nNote:  It's cash-only.", "author": "Kirsti H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-28", "description": "With my most recent visit Id figured it was time for a quick update. \nNew location the place now looks better , bigger \u0026 certainly more space for seating this does not make the wait times any easier but certainly helps since the new location is two floors. \nOf all the times I have been here I gotta say never really had to experience those crazy long lines maybe it's the time's I've come or days but no matter what day \u0026 time u stop by u are likely to have to wait even if it's for a short time since this place seems to always be packed. \nAs for the pizza what can I say , it's delicious extra cheese is always a must along with , ham , pepperoni or Italian sausage a combo of these or on their own has always proven to be delicious. \nGotta love the freshness \u0026 taste of the fresh mozzarella on that nice thin Brick oven crust yumm  so good really hard to come here \u0026 not eat a whole pie at least that's always the case w me \u0026 my company.  \nAside from the wait time which we know can be crazy , service has always been good quick \u0026 easy.\nPrices can't go wrong very affordable.\nI decide to up the stars in my review because I have been coming here for years \u0026 have yet to be disappointed always a plus in my book when the food is delicious \u0026 keeps u coming back.", "author": "Ginette P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-23", "description": "Throughout my entire New York trip I was looking forward to coming to Grimaldi's to try their famous pizzas. \n\nI was extremely excited and couldn't wait to sit down and enjoy their famous pizza. My mom, sister, brother and I went inside and waited patiently for our table. But some worker there rudely ushered us out saying that we need to make a line, so we decided to lean against the wall to form a line. Then this idiot came out again and told a different group that they can come in now. WAIT A SECOND, we were first so was this some sort of discrimination? I was like, no I'm not going to let this rude man destroy my wanting to try Grimaldi's so we waited and then we got our table. \n\nInside it is extremely stuffy and not very ventilated. We sat down and ordered a plain mozarella, basil, and sauce pizza. I wanted to try this particular pizza to see how great Grimaldi's truly was. \n\nOur pizza came and I was so excited to take my first bite.................only to be severely disappointed and sad. Their sauce is bland and mediocre, tastes like it came out straight from the tomato can. Their cheese was extremely rubbery and unflavorful. Not enough basil to balance out the pizza. Also their pizza dough had a slight taste of garlic which was delightful only to be masked by the intensity of the salt used in their dough. It was a miracle for me to actually taste the garlic in their dough because the pizza crust/dough was extremely salty. The pizza in general was the worst I've ever had and I was greatly saddened because I came all the way to Brooklyn JUST to try Grimaldi's. \n\nCustomer service was shit and so was the pizza. \n\n#TeamLombardi for the win. Lombardi's is WAY BETTER. The atmosphere is better, the customer service is extremely welcoming, and the pizza is out of this world. Grimaldi's isn't worth it. Extremely disappointed but I guess I at least tried it right?", "author": "Irene L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-20", "description": "Good pizza, TERRIBLE serivce. \nThe line was really short today so we decided to give it a try. We had a small.pizza with two toppings for $21. It was a good pizza, but that's what I expected for a $21 pizza. \nHowever, the greeter in the front was extremely rude. When we walked in he reacted as if I was trying to rob the place and didn't let me talk to the lady taking my order. When I came back to pick up, he was rude AGAIN and asked me why I walked past the line. YO bro I was just in there 10 minutes ago placing an order. \nI would not go back due to the service, but if you don't mind that, go ahead, it's a decent pizza.", "author": "Peter G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "Waited in a HUGE line and I thought \"will it really be worth all of this\" well let me tell you it was!  Fresh,  Oven Brick pizza, superb location and great atmosphere.  Was a great way to Spend Mother's Day... Pizza with the Family surrounded by amazing Brooklyn scenic views. \nTip : Only can get pizza by the pie,  no slices here.", "author": "Ralph D."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}