{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-08-28", "description": "Grimaldi's is great stuff, their pepperoni is a cut or two above the usual stuff you get around the City.  It has some real spice to it and adds great flavor to the pies.  Grimaldi's is brick oven pizza and probably the best example of that craft in the City (the Garden City location for some reason, while still very good and heads and tails above most Long Island pizzerias, just isn't the same.  I think you just have to eat this stuff in Brooklyn though many people say that the difference in pizza dough and bagels in the City is because of the water!).  Pies come out very fast which is good because after the long wait to get in, and the frontal assault on your senses from the aroma of pies wafting all around you while you wait, you don't want to have to wait long for your pie to arrive.  The menu/place-mat is a personal favorite because it is probably one of the few eateries in the City which has the word injunction on it (remember I'm an attorney!) as it discusses the history of the restaurant (used to be Patsy's but that is another whole long story...read the place-mat).\r\n\r\nFinal caveat...save some room.  Just steps away are two other great spots for dessert.  The Brooklyn ice cream factory and around the corner..the original Jacques Torres chocolate factory.", "author": "Stewart W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-02-07", "description": "I couldn't even call this place 'overrated' with a straight face. It was just bad. Possibly the worst pizza I've had in New York.\n\nThe wait was modest on a cold, rainy Thursday night and I was fine with the seating option. The house wine was pleasant enough and the carafe was large enough to swim in. An auspicious start, I thought. Ha. We ordered pepperoni with basil and roasted red peppers and of course, the center of the pie was very soggy.. The crust was also burnt and since it was toothsome, I made some allowances for that particular style of pizza. But the pie had no flavor.The fresh mozz could have been rubber. And is there any salt or garlic in the sauce at all? Could the crust possibly taste of more than charred cardboard? Really? Am I being punked? Where's my real pizza? Call me a whaambulance quick cause I hate this $20-odd pie and I am about to cry.\n\nDi Fara is much better.\nNick's in Forest Hills is much better.\nHeck, even San Remo in Ditmas Park is better.\nDon't make me compare this place to Papa John's because really, you don't want to know.", "author": "Alexis L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-31", "description": "Ok...so Grimaldi's is definitely the best pizza I have ever had in my life.  The crushed tomatoes were a little too crushed, but the amazing crust and their perfectly seasoned sauce is absolutely to die for.  All toppings I had were good...definitely loved the pepperoni and the sausage wasn't bad either.  The mozzarella was extra yummy.  Seems like a lot of places use fresh mozzarella now, but it doesn't have flavor...this place has figured out how to get both.  So the wait is insanely long for this place and since it was  my first time it was absolutely worth it...especially if you have friends and can take turns buying hot chocolate from Jaques Torres around the corner (liquid chocolate baby!).  If i were to go here again, which I definitely will, I will order ahead and do pick up.  Highly suggest that if you aren't too picky about having some straight out of the oven pizza goodness.", "author": "kate d."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-23", "description": "Some of the best pizza ever. We're from Vegas, we Yelped it, and it was well worth the wait in line. Simple and superb! Service was good despite being very busy. If you are visiting New York, it is definitely worth the trip.", "author": "Jacob D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-12", "description": "So far, this is my favorite NYC style pizza joint that I've been to. The pizza, specifically the crust is AMAZING! Yes, it is worth the 2 hour wait in line! The crust is that good. It has this wonderful watery-doughy taste that I can't quite put into words. I has the right amount of flakiness and chewiness. The sauce doesn't fight for attention and compliments the crust's need to be experienced in your mouth. God, my mouth is watering as I type this. I can imagine the flavor of that amazing crust just filling my mouth with its goodness right now. Yes, the crust is that good. Thanks for the good times Grimaldi's!", "author": "Ro D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-20", "description": "The fact that this was the best thin crust pizza i've ever had!  I gave this local pizzaria a high 5!  I wouldn't necessarily say that eating these pizza's was \"life changing\" (as my brother had told me)...it was definitely a party in my mouth.  The four of us ordered 2 smalls (margarita and pepperoni/sausage)  DELISH!!!  The crust remained crispy till the last bite!  Be sure to fold your pizza slice in half like a taco, or they will surely know you are not local. If you do not like to wait, be sure to be in front of the door before they open for lunch before 11:30AM (Sunday's before 12PM)", "author": "Lillian T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-07", "description": "Every visitor I've ever had is brought here. The best pizza, guaranteed. And you know what? I think I'm usually there around 7 or later, and I've never really waited in line. I don't know where that luck comes from, but I tell you it's possible!", "author": "Steve M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-05", "description": "Fist time that I stop in this place and still thinking what is the great about it?. it is just simple pizzas that you can find in the corner of any street in NYC and you don't need to wait outside, which is ridiculous. Service is not that good, meal is simple in a bad maintained restaurant.", "author": "Carlos A. G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-18", "description": "Not understanding the hype about Grimaldi's. Yes, it's fresh toppings and excellent mozzarella, but it's not like it's made of gold. Two Boots is comparable IMO. It is above-average pizza, but really not worth the 1+hr long wait, inattentive staff, and unclean tables.", "author": "Bezel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-07", "description": "best freaking pizzas of my life, w/ ny style attitude in the form of a grumpy old Italian man that likes to yell \"Where ya goin?\" to you in a grumpy voice. \n\nLines are extremely long. Very long...like winding long\n\nfresh mozzarella cheese, really thing crusted", "author": "Sofi P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-14", "description": "I was told about this place by a co worker who said you HAVE TO go to Grimaldi's if you go to NY. So, after a long walk on the Brooklyn bridge in triple digits heat, we finally made it to the place which wasn't even open but the line had already started forming. So, we waited another 45 minutes and got in. My brother and I ordered olives and extra cheese. I liked it a lot, but my brother kept on talking about Giordano's. But then he likes Chicago style better than NY style. Great place!", "author": "Khalid S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-03", "description": "By far the best pizza in New York City. Yes, the line may be up to an hour and a half long, but sometimes you might get lucky waiting only 5 minutes. \nTips for avoiding a long wait:\n-smaller tables, 2 seat tabletops have greater turnover\n-go at an odd hour, e.g. 4 pm - try to avoid the coal changing time.\nThe mozzarella and thin crust are amazing. There isn't as much sauce as other places (such as Lombardi's), but that's how I like my pizza personally. It has just the right amount.\nThe large is only $2 more than the small, so definitely recommend that - it is enough for 2 people.\nMy favorite toppings are: italian sausage, onions, red peppers, sundried tomatoes. Remember, you can have different toppings on each half! I just realized this recently, and helps satisfy everyone eating.\nThe service: I've had mixed experiences. Waitstaff is never exactly friendly, but they are pretty attentive and speedy. They want you to sit, order, eat, and hurry out for quicker turnover.\nIf you go as a party of two, prepare to be seated awfully close to people, as there is not much space between tables. Also, there is not much space on the table to accommodate for the pizza (and stand), your plate, condiments, and drinks.\nBut knowing all this prior to going to Grimaldi's for the first time will put the hype into perspective and allow you to have a 5-star experience.", "author": "Hannah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-05-23", "description": "amazing pizza - it is fatabulous - it is so good there is always a two hour long wait to get in\ndefinitly GGGGOOOOO", "author": "lauren c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-26", "description": "Damn good pizza...and luckily there was virtually no line. It's worth a trip out here if you are visiting NYC", "author": "Scott M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-21", "description": "Over-rated.  I was dragged here recently by friends who were visiting from out of town.  Each time, it is more disappointing than the last.  The wait is simply too long for pizza that is soggy on the bottom and for a staff that gets offended when we ask for Pepper Flakes and Oregano.  Sorry guys, but I will avoid.", "author": "Kathy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-13", "description": "I've tried all the so called best pizzas in NYC--Toninos, Johns, Lombardi's etc--and this is my favorite. The line moves quickly, especially for parties of two. I like going on July 4th, devouring a pie then waddling out and watching the fireworks. And strolling the Brooklyn Bridge to Grimaldi's is a great cheap date or fun for out of town visitors. No 5th star because they sometimes under cook my pizza and if you ask for well done you risk extreme char.", "author": "Paul K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-15", "description": "Pinnacle of Perfection -- Not sure you can even call this pizza, lest you create confusion by lumping it together with \"everything else\" ... you've got your neighborhood slice joints (\"2 slices and a coke for $5!\"), your cut-above slice joints (i.e., \"Joe's Pizza\"), and then you have this amazingly beautiful ... something ... from Grimaldi's.  Would eat here every day if I didn't have to spend my whole life in line.", "author": "Richard K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-29", "description": "Went here on Wednesday around 5pm and no wait! My friend who's been here before said we should order a large pizza. I was like, wha?? can we finish that?? she said no problem! it's thin crust and won't fill you up. Service is pretty non-existent, but we got our pizza fast. So good! My friend said they probably soak their mozzarella cheese to get that flavor. The sauce was amazing, even the pepperoni seemed custom-made. We were able to finish the pizza and weren't too full to get ice cream later on!", "author": "Shenny S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-01", "description": "The best pizza i've ever had.  Better than DiFara's, Better than Lombardi's, and easily better than Two Boots.  \n\nThe line is long, but the pizza is worth the wait.  Do it.", "author": "Pedro M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-14", "description": "We walked across the Brooklyn Bridge and then waited in line for an hour... so when we finally sat down to eat I was starving and ready to be blown away by this renowned place. I hate to say it... but I wasn't. \nDon't get me wrong... the pizza was delicious... but not wait-in-a-line-that-goes-halfway-down-the-block-for-an-hour kind of delicious. \nThe pizza is thin and coal brick oven cooked. The pizza makers are very orgnanized and have a great system to get the pies made and on your table fast. \nThe service was nothing more than taking your order and putting your pizza on your table. I didn't think any of the wait staff had much personality. \nThe host was nice and did a good job at keeping people updated on how long it was going to take to get a table, although peoples impatience seemed to ge on his nerves alot. Understandable but I'd think by now he'd be used to it. \nCute inside... but the sign outside is hideous... you'd think this cash cow could afford a power washer to clean it up!\nA definite place to put on your list so you can see first hand what all the hype is about - just don't be surprised if you're like me and don't quite get what the big deal is.", "author": "Kristen F."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}