{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-10", "description": "4 stars because Grimaldi's was the first pizza of it's kind before Patsy's before Nick's.  and all of the others who came after it. This is the location that all of the tourists go to but there are other locations of Grimaldi's that are less crowded and just as good. \nI give it 4 stars and not 5 because at one time they had Italians making the pizza but now they do not. It is okay to teach non Italians to make pizza but they do not have the passion. I am not Italian but just telling the truth.\n It is still great pizza but not as great as some of the others who still have the founders and owners making the pizza. Grimaldi's is now  a chain with locations in Hoboken , NJ, Long Island, Douglaston  Queens, Las Vegas Nevada, Texas and Arizona.", "author": "Pinky And The B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-16", "description": "Delicious! Best pizza ever IMO. Did not even mind the 1.5 hour wait, it was totally worth it!\n\nThe ONLY thing that kept me away from giving the full five stars was the interior... not that it's too old or anything, but the Air Condition was on so high at 10pm at night mid-September, (and we sat right under the vent), that our pizza got cold before we could enjoy the second slice.\n\nIt was kind of a bummer because the first slice was like HEAVEN. Hopefully there can be some kind of improvements?\n\nWill definitely go back. MUST HAVE IN NY.", "author": "Trevor L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-19", "description": "Their pizza is awesome, and I'm glad I was able to try it after living here for a while, but I would not put up with the long line again for the pizza. This is why I'm giving the place two stars. \n\nThe restaurant is completely packed once you finally get in, and because of this you don't get great service. I'm not even sure if they offered free refills because our waiter sure never asked us if we wanted more soda. I think the drinks were also about $2, which is ridiculous for an 8oz. glass.  It also took forty minutes to get our pizza after we ordered, which is, apparently, the average wait time on a regular night. \n\nIf you're trying to impress some out-of-towners, or you just need to kill two hours, this place may be worth it, but if you're just a fan of pizza I'd recommend going somewhere else. There are so many amazing restaurants in Brooklyn that won't take up your entire night, or break the bank.", "author": "Kasey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-18", "description": "Grimaldi's is great!! They serve solid pizza and the location is really cool. It's great, unless you have to wait 2 hours like you sometimes do. In my opinion, it is not at all worth that kind of wait. But I've been on off hours and gotten a table immediately. In that case, the meal is satisfying and worth the trip. One note - it seems like they lost their liquor license! The booze is now scratched out on their menu but I know I've had drinks there in the past.", "author": "Elizabeth E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-26", "description": "I never got to try the old location, and hence the old oven.  In my opinion I am a victim of the hype machine.  The pizza was average.", "author": "Jozef M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-24", "description": "Very overrated. I went one time and it was in the old location. I remember the pizza was expensive and really nothing special. I have had better pizza at patsy's in east harlem, lombardis, original rays(which is now closed) and a bunch of other places. Its decent pizza but its definitely not worth going out of your way for. I don't understand why people would wait online for this stuff. Probably tourists.", "author": "Robert S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "If you're in new york for one day only, this is the place to have pizza. It's pretty much perfect. This is definitely and absolutely the place to go if you need a story to take back to your friends back in Parma.", "author": "Blair W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-09", "description": "The line wasn't that long when we got there, once we got in, we were seating at the first table which is right in front of the door, didn't like that but didn't feel like waiting for another table. Our waiter was ok, didn't smile or anything just asked what we wanted. while we were waiting for our pizza, my boyfriend kept noticing that the employees kept looking at us, even the owner (i think he was the owner) kept looking at us. I guess they don't like interracial couples. \n\nOur pizza came, it was ok nothing special, one thing i didn't like about out pizza was that the last two slices the crust was burned, like black burned, but that what you get with brick oven pizza. Overall i don't think we will come back, we will try the one in Manhattan, maybe that one will be better.", "author": "Lea S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-12", "description": "Me and my friends heard about this place and the hype about it so we went to try it out. I thought the line meant hours waiting in line, but when i got there like at 9 pm, the line was only 45 minutes.\n\nSo, there is this old man at the door that calls you in. Me and my friends were a group of three and so he called us in to be seated, skipping the 15 people ahead of us.  Me and my friends thought it was too good to be true, after waiting in the line, so we lingered, not being able to tell if he wanted us to come in or not.  He ended up clapping his hands at us to hurry up!!! So I thought that was kind of weird/rude.  He also never smiled.\nThe tables are super close to each other and the tablecloths were dirty, but maybe it is what is to be expected at a busy place like this.  If you order a soda, the soda comes in the bottle and they give you a glass of ice.  I just got water (which they don't refill for you automatically; you have to ask for it!).  \n\nWe ordered the large pizza, half cheese, and half pepperoni and olives.\nSome of our crust was black and burnt, but I really liked the basil. Maybe it was because I like basil, i don't know. But I didn't like the pepperoni or the olives at all.  The pepperoni was wayyyyyy tooooooo salty!  My friend liked it.  I thought the olives were super strong, but my friend like that also.  My other friend enjoyed her cheese only half, saying that it was reallllyy good.\n\nThe personalities you see here at the family-owned restaurant are big.  While inside the old man ended up joking around and smiling with his staff.  Our waiter was nice, but did not have a big personality as the other waiter who came to our table to talk with us.  There is also a little boy that is working.  He was so adorable! \n\nSo all in all, I was underwhelmed, but the pizza did not leave me feeling disgusting, which was good! I enjoyed the ice cream I got across the street at the Brooklyn Ice Cream Factory (I recommend the coffee flavor).", "author": "Tiffany P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-31", "description": "I can't believe I waited in line for this place! Big tourist trap and I fell for it!! Our pizza crust was burnt!! I don't understand how it has all these good reviews maybe the owners write them....", "author": "Mo N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-27", "description": "Best Pizza in the world. I mean WOW!!!. Its not too expensive and they only accept cash which kinda sucks but I mean the pizza is !!!!!!", "author": "Adam P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-23", "description": "After eating at Grimaldi's old location (now Juliana) at least 4 times, I was very disappointed with my last visit at the new location.  I've read that when they relocated the famous brick oven could not be moved.  I was willing to ignore that fact and decided to wait 45 minutes on the line.  Boy was I wrong.  You would think after waiting on line for 45 minutes everything would taste delicious.  The pizza was very average something I could have experienced at a local Neapolitan joint.  The pizza was nothing like what I've had in the past.  The couple next to me drove down to Brooklyn from Philly just to get a slice and they felt robbed.  They didn't even bother taking what was left to go.  Folks are creating long lines because of what they use to serve not what they offer to customers now.", "author": "Mike N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-26", "description": "The walk over the bridge to Brooklyn, the line I waited on for 30 minutes to get inside, the close (but cozy) table settings.... \n\nALL WORTH IT! The pizza is incredible!!! I can't even describe.... simply the best! Definitely have to make it at least once (then twice, three times.....). \n\nOnce you're in, the service is great and the the pizza comes pretty quick. Hot fresh unbelieveable pizza... There's an ATM inside just in case you forget that it is cash only. \n\nSo far, my favorite pizza place in the city... even if I have to run over the bridge to eat it! (at least I burn the calories on the way back)", "author": "Kelly E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-06", "description": "The line was long but moved quickly. They don't offer slices. Pie only. Also no credit cards. This place is cash only. One of the best pizzas in the city. We had also ordered a pepperoni cazone. I didn't like cazone at all. It was too cheesy and pepperoni was hardly any. The pizza on the other hand was delicious.", "author": "Shweta S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-17", "description": "Yeah!!  Old-fashioned pizza parlor style place!  I know that it's super touristy, so I always refused to come here when I lived literally one block away.  Now that I don't live there any longer, I felt justified in coming here for dinner this week.  \n\nThe pizza was really good-- and unlike other pizza I've had in New York.  It's the cheese that I noticed right away-- this isn't shredded mozzarella cheese that browns on top and gets ooey... it's pure white, fresh mozzarella cheese of a very high grade.  And it is fantastic.\n\nIf there are just two people, get a small pizza-- it's HUGE!  The \"small\" is actually about the size of a normal medium to large pizza.  My friend and I got a small pizza with sausage and mushrooms, and I was just so utterly impressed by the fresh ingredients.  Also, you can buy wine by the carafe here, which I LOVE doing.  Delicious pizza, carafe of house red, thirty bucks for two people?  With an awesome old-school ambiance?  Sold.\n\nNB:  Cash only (grr) and NO SLICES.", "author": "J. K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-10", "description": "No wait annnnndddd...\nAmazing service -- our server even read my besty and my ID's and saw we were OG california girls... the rest of our time there, the soundtrack was California themed (think Beach Boys)\n\nLOVE this place!", "author": "Kat R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-07", "description": "I fell for the hype and waited in the long line to try the famous Grimaldi's pizza.  \n\nIt was ... OK.  It wasn't the best I ever had.  The first couple bites were good, but then it seemed to get really soggy on me.  The taste didn't seem to justify the 45 min. wait.  \n\nThe vibe is pretty cool though.  As a first time New Yorker, I'd recommend going just for the ambience.  There's a long line and an old Itialian man that comes out and points at people in the line and motions for them to come in.  You walk in and it's exposed brick, lots of Italy memorabilia, and the view of the famous wood burning oven.   Overall- it's a  nice, New York, Italian experience.", "author": "Danielle C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-17", "description": "Loved Grimaldis!!\n\nWe went on a Monday and got to the place at 10:45am, thinking it open at 11! When we got there we saw it didn't open until 11:30 (oh well) but already there were two families waiting so we decided to wait behind them!  Boy were we glad we did!! By the time it was 11:10, we had a huge line behind us!\n\nThe place is small, so I don't recommend bringing large parties.  Also be prepared to sit next to strangers! We ordered a large pizza half pepperoni and half with just cheese.  I have to say it was really good! My husband and I ate the whole thing!!  \n\nFor NY pizza, I have to say this is the best place =0)", "author": "Mel N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-29", "description": "This was the punch in the face I was looking for in New York.\n\nSeriously LEGIT pizza here. We didn't mess around and got the classic cheese pizza. The crust was crispy. Mozzarella was fresh. Sauce was lick your fingers tasty. $12 for a small. (feeds 3-4)\n\nBest part....when you walk in, the mob bosses of all mob bosses (of pizza joints) greeted us at the door. Felt like I needed to kiss his godfather ring....", "author": "Michelle T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "Be able prepared to wait but also be prepared for one of the best pizzas ever.  Waited just under an hour but worth the wait.  Ordered 2 large pizzas, one cheese and one with sausage, pepperoni \u0026 ham.  Both were outstanding.  Crust to-2-die-4, amazing sauces, and topping were perfect.  Order 4 different desserts and each was excellent.  Next time we are visit NYC this is on the \"got to b there\" list.", "author": "Marvin Z."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}