{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-02", "description": "Zero value to customers. Line extends out on the streets and you've to wait approx 55 mins to get in. Once you're in, a wait of 10 mins to give your order to the waiter who looks like he'd rather be doing anything else in the world. Extremely hot inside the place in the peak of summer. \nYou wait 40 mins for a pizza while watching others who came after you eating theirs.\nWe walked out. The waiter showed a highly bad attitude even to the minute we walked.", "author": "Nidhi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "Worth the wait! Food speaks for itself! Chris w/ the pizza socks \u0026 Jimmy at the front door are the $hit! They made this experience fun \u0026 authentic! Thanks guys! Keep kicking ass!", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-14", "description": "This was such a great place to get pizza. I was with a group of 20 and they sat us down super quickly at the beginning of lunchtime. They were super friendly and made us feel really comfortable. Try to go at the beginning of noon or else there's gonna be a huge line and a long wait.", "author": "Martha T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-27", "description": "This Grimaldi's had amazing pizza. MUCH much better than the one we have in El Segundo in Cali. The crust was perfectly cooked and very thin and everything was super fresh. The service was great as well, all the waiters are very nice and friendly. The only thing I would change is more toppings as there weren't many to choose from and I normally get a lot of veggies, and more appetizers. Otherwise, it was a pretty worthwhile experience.", "author": "Krissi G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-22", "description": "Thinking what would be a good experience, ended up being a bad experience from the get-go. The big/bad bouncer was soo rude when I just asked him a simple question to go to the ATM. He didn't seem too inviting for my brother and I to enter. I don't understand why the pizzeria needs a big dumb bouncer? It's more so needed in high end bars/clubs. (by the way there's a police precinct a few blocks away) When we were seated down on the table no warm welcome, no smile, no nothing!! Waiter didn't even bother asking us what we needed. We find out when we receive our bill that it wasn't adding up to what we ordered. We were charged $9 more in total! I figured what's the point of causing a scene since we won't be returning back. The pizza dough was raw, the bathrooms were so filthy, crap stains on the toilet, sink valve handle missing for both hot \u0026 cold. Did I just enter a pizza sweat shop?", "author": "Captain R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-01", "description": "Went Sunday there was a line but not too bad for party of 2. They give you disposable forks, knives and plates to make it easier to keep up with crowd.\nNow being a true NEw Yorker who was doing the tourist thing, I'll say the pizza is overrated. It's a perfect location so if you're sightseeing go to say you went. I haven't tried julianas which is right next store so I can't tell you if it's better. There's also a couple other food options. If you're a real New Yorker who's just curious, don't go out of your way. The staff was friendly. Felt a little rushed but what do you expect with lines outside the door.", "author": "Emily R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-25", "description": "I can't explain the long line to enter in this place. The quality of the pizza is poor: the cheese is not mozzarella and the souce is clearly from concentrated tomato. Everything is served on disposable plates with plastic forks. In addition no credit cards accepted just cash. \nThis is a tourist trap. New Yorkers, avoid it.", "author": "Giulio G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-28", "description": "Authentic fresh pizza! The line is long to get inside but well worth it! No beer or alcohol, just a true pizza experience. Only complain is the anti-pasta is not a full anti pasta. There were tomato's, mozerella cheese ( kinda rubbery), salami, and 4 green olives. Not as robust as a normal anti-pasta. Overall I would recommend going for the pizza!", "author": "Kristine C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-23", "description": "In my time in New York, I only got to go to two pizza places - Grimaldi in Brooklyn and John's of Times Square.  I would go back to John's for pizza before going to Grimaldi's.\n\nOrder:\n1 large pizza - meat lover's.\n1 large pizza - mozzarella, ricotta, extra grated cheese.\n1 Spumoni Truffle\n\nDetails:\nCrust was thicker than Itallian (comparing with Via Tavere or Ragazzi here in Vancouver) but similar in terms of being soggy in the middle.  Outside of the middle though, I found the crust kind of tough/chewy.  By no means is the pizza a bad pizza - it is good but, I've had better (like John's).  3 stars.\n\nSpumoni Truffle was good - not too sweet due to the dark chocolate coating.  3 stars.\n\nSummary:\nIn my next NYC trip, I will visit other pizzerias before going to Grimaldi's again.", "author": "Maria T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-26", "description": "When in NY, you have to have NY pizza. Since I was staying in Brooklyn, the famous Grimaldi's seemed like the right spot. Since it was a little late on a weeknight, they were able to get us in quickly. Our server was very friendly and attentive and quickly got us situated with menus and drinks.\n\nWe shared a small white pizza with chicken. Note--it looked like a very large to-go order (at least 20 pizzas) came in before us, so we did wait quite a while. But when it came out, the pizza was perfection--perfect crust and nice and salty. I was only going to have two slices, but ended up eating the third (walked back to the hotel to help offset the extra calories). Definitely hit the spot as far as cravings.\n\nOne thing to note--cash only, so be prepared! :)", "author": "Briana S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-08", "description": "How sad, another one of New York City's landmark, traditional institutions gone down hill.  Grimaldi's used to be in the same breath as Katz Deli, Corner Bistro, Brooklyn Bridge, and the Empire State Building as things to do when visiting NYC.  However, it like many others have fallen.  \n\nMany don't realize how truly good Grimaldi's used to be.  When I first visited NYC more than 10 years ago and I had Grimaldi's for the first time, I was blown away.  The thing I noticed most was how amazing the toppings tasted.  The crisp pepperoni, flavorful basil, naturally sweet tomato sauce.  Coming from California, I had no idea what true fresh Italian mozzarella was until eating at Grimaldi's.  I remember it being so good that I would order a pie to go, and continue eating on the subway home.  This was the place of legends.  The stories of Frank Sinatra flying over an order overnight to Las Vegas seemed believable.\n\nAfter moving to NYC, you can tell the quality fading with the years going by.  Naive at the time I had no idea what was going on, until I learned the original owners had sold their store and brand.  The new owners then closed down the original store, moved over a few buildings into a bigger space (to make more money of course).  I thought this would be good, fewer long lines.  Nope, I was wrong.  Brought my family there when they came to visit, and I was surprised at how very average it tasted - was I at Round Table Pizza?  The ingredients were bland, crust doughy, family type atmosphere were all gone.  Were they skimping on the quality to turn a profit?  I have to assume so.\n\nThankfully the original owners reopened the original location with the original ovens but under a different name Julianas, now one of the best pizza places in NY.  Grimaldi's will still have their long lines because of their reputation and their mentions in various travel guides, etc (a la Magnolia Bakery).  But sadly those days of have an amazing meal experience at Grimaldi's are over.\n\n\nFYI here is my own personal rating system and ranking list of some other pizza joints in NYC\n\n5=worth a trip, something you'll crave\n4=worth getting but only if you're already in the area\n3=only worth it if it's free/discounted, not worth paying full price\n2=would not even eat it if free, waste of stomach space\n1=the place should shut down\n\nThe places are listed as best/better first if they share the same rating (I.e. Di Faras better than Julianas, etc.)\n\n5's (whole pie) - Di Faras, Juliana's, Keste, Emily, L \u0026 B Spumoni\n5's (by the slice) - Artichoke, Prince St, Joes\n4's (whole pie) - Don Antonio, Robertas, Barboncino, Table 87, Lombaris, Patsys Pizzeria, Speedy Romeo\n4's (by the slice) - Roma's, Go 99, Two Brothers\n3's - Johns Pizzeria, Grimaldi's, B Side\n2's - Two Boots Pizza, Lucalis\n1's - none so far", "author": "Thomas V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-31", "description": "This is the worst pizza place in NY that I've been. We've been waiting for an hour for our order, but it did not arrive. Sure they have a lot of customers but they need to be mindful of their service. It's suprisingly unfortunate.", "author": "Jeleica U."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-03", "description": "Overpriced dough! Thin or thick! \n\n$20 white pizza?  Come on!  Good to have couple slices when hungry but never meant to be main course", "author": "Gary K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "I order small but it is big And soooooooo good.\nOh. Very fast coming my order! I like it!", "author": "Eunjung P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-31", "description": "The pizza at Grimaldi's is amazing - we were not disappointed. We had to wait about 30 minutes or so to get in but it was worth it. We ordered margarita pizza.  This was our second trip to this location - the first being from the Brooklyn pizza tour - this time we went on our own and walks just a few blocks to take pictures of the bridge. I recommend this - it's my favorite pizza in New York - second favorite check out Prince Street pizza.", "author": "Tonnia R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-26", "description": "Seated immediately with no wait.  It smelled bad in the room - old and chemical like vs yummy.  We decided to leave right away.  Juliana's next door was a better option.", "author": "Mrs S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-24", "description": "Never had anything like this place , love Cali but this pizza is definitely worth moving to NY for", "author": "Liz T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Just tell me about this line it's totally worth it for good pizza taking our friends here for the first time in NY and it was bomb the pizza is so good wait for 20min it's not too long the waitress is nice making sure we get in early. Lovely place good foods and it's definitely the best pizza place I definitely come back soon.", "author": "Miley L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "GREAT pizza.. great flavor. And to mention, the cream soda was amazing. Long wait but can be shorter if you are a party of 2. As endlessly mentioned, bring cash with you if you want to avoid ATM fees from this located inside. Definitely a must visit place, if you're in search of the best pizza in NY", "author": "Xavier H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Easily one of New York's top and most celebrated pizza restaurants. Grimaldi's never fails to make a list of \"Best Pizza in America\" and \"Best Pizza in NYC\". And it typically resides well towards the top of those lists as well.\n\nOne of the cool features of this restaurant is it sits practically right under the Brooklyn Bridge and is the perfect place to go for a meal after making the walk across the bridge. Be sure to exit the Brooklyn Bridge from the very first exit on the Brooklyn side and it will be a very short walk from the bridge exit to the restaurant.\n\nExpect a wait but if you go during the week and try to time it away from meal times it shouldn't be too bad. There will be a line que outside the restaurant with somebody out there to put you on the list and mark how many are in your party. Make sure your whole party is there or they will not put you on the list.\n\nThe pizza is classic thin crust NYC style pizza and yeah it's good. For the classic NYC pizza experience Grimaldi's deserves a spot on your list. There are multiple Grimaldi's locations now but be sure to do the Brooklyn original for the true experience.", "author": "John K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}