{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-27", "description": "It's good but not amazing.\n\nIt's definitely overrated because of the Grimaldi's bouncer/godfather guarding the door and the hype that surrounds it. After over 1500 reviews were written about this place, what can I really say?", "author": "Brian K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-07", "description": "As good as you've been told. Too bad about the wait! In good weather take it to the park, eat on the grass", "author": "Mr. M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-11", "description": "The best pizza, hands down. \n\nIt was well worth the 1 - 1 1/2 hour wait! The crust is perfectly thin, crispy and chewy. The sauce is subtly good and all the toppings mingle together in perfect harmony. \n\nGo walk across the Brooklyn bridge after you're done with your meal! Make a day of it!", "author": "Grace L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-07", "description": "I was disappointed with this place. I didn't mind the wait, and the pizza wasn't bad, but the service was. The waiter wasn't interested in us, maybe even annoyed at us for some reason. Perhaps because I asked him to explain the menu, which he didn't. They don't have a liquor license so we couldn't have a beer. This also wasn't explained so we ordered coke and lemonade which arrived in bottles with some warm glasses filled with ice. So we drink straight from the bottle. \nThe pizza was nice but not great. Many other places will have similar or better pizza than this restaurant. \nService with a smile would be nice to (or even if they looked at you)", "author": "Shaun V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-08", "description": "This one's a historic place. I always get a pie here every time I walk across the Brooklyn Bridge. There is almost always a line here. The host was very friendly, seated us as soon as he had a table available. It is an \"all guy\" run establishment, waiters are no nonsense and efficient. Pizza is pretty good, it is not the best pizza I've ever had but was pretty close.", "author": "Pawan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-10", "description": "pizza is always a good backup meal, but not the most creative. It's always there regardless of the time \u0026 location. I grew up eating loads of pies, so a variations in flavor and style starts to dilute 20 years down the line...  \n\nin short, great pizza, fast service, long ass wait. 4 star worthy. \n\nfor all you @ work, trying to kill time...\n\nGrimaldi's offers an authentic italian feel, no not the jersey shore fist pump feel, but the loud, talks with the hands, and a bit pushy type of the italian. SERVICE here was quick, you tell them what you want and they deliver, no muss to fuss. Pizza's take about 30 minutes to prepare, but drinks quick and aplenty. \n\nPIZZA, they have a variety of pies, we opt to custom ours with 4 toppings which cost about.. 15-18 dollars. The ingredients were fresh, loads of cheese, and the tomato sauce was very tasty. In short, it was pretty damn good.\n\nthe WAIT is pretty ridiculous, a lady who walked by the line suggested going to the restaurant down the block. She said it was just as good with no wait. I would have dashed there if i hadn't invested 20 minutes of my life already. Luckily, we got pulled from the line and was seated right away. :)\n\nin all, 4 star worth, a must try.", "author": "Alex C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-03", "description": "Came at 2pm on a Monday and waited 50 minutes for a table.  I've never waited 50 minutes for a table.  The first thing you notice is the amount of rules you're subject to when eating here: no slices, no credit cards, no baby carriages (wait... what?), a system for assigning tables that makes no sense to anyone but the maitre d.\n\nWe sat down and ordered our drinks and pizzas.  We decided on one white and one regular.  Since it was nearly 3pm and none of us had eaten that day, we were ready for a massive pizza binge, taste be damned.  The pizzas arrived looking like a good New York pizza should: thin crust, grease pooling on the top.\n\nMy overall opinion is that it's over hyped.  It's good, but it's not as good as its own reputation.  The white pizza was good, but I felt like a little more garlic would've been nice.  The regular pie was unremarkable, except for the occasionally burnt crust.  The pizzas were served very quickly, but the bill took for ever to come... is this how they build the line?  Anyway, it's unquestionably legit New York Pizza, but it's not the best I've had.  This place must be published in tons of tourist books, because almost no one in the line was speaking English.", "author": "Gabe A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-19", "description": "So the pizza was ok......... thankfully i didnt have to wait  in the  long line.....\n\nsmall place, slow service ok pizza..... \n\ncould you beat that??? um yea!", "author": "Gisselle P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-03", "description": "Call ahead and order this pizza to go. Eat in Brooklyn Bridge Park", "author": "Trip T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-02", "description": "Been here not so long after I moved to NY, because of its fame. Their pizza is really tasty, it's a thin dough which I like. But the waiting...there were three of us and it was dinner time on Thursday or Friday. We were in the line for 1.5 hours to be seated, and really there's nothing else around to kill the time!!! It's ok to try if you insist, but I don't know if it's worth the time.", "author": "Kristina R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-16", "description": "I hadn't been here in years and my boyfriend was never here, so one Friday night we decided to drive here and give it a go. After finally getting to Brooklyn at about 9:30 after taking a lovely unexpected detour (we got lost!) we had to search for parking. My dad warned us that parking could be tough and he was right. We drove around for almost 20 minutes before finding a spot blocks away. If you plan on driving just beware to give yourself extra time to park. \nAfter walking for another 10 blocks we finally got there! The location is beautiful with the Brooklyn bridge in the background. We were surprised to see how long the line was at almost 10 at night. I was so hungry and really wanted to get a seat quickly. Thankfully I was enjoying taking pictures of the skyline so I didn't mind the wait. We only waited about 10 minutes ad them were seated. They don't go in order of the line, the go with party size. If a table for you party amount is ready they will take you in regardless you spot in line.\nWe ordered a pizza half plain half pepperoni and fresh garlic. It took a little time to get it out to our table but it was packed in there so we were expecting that. Then finally, after our whole exclusion getting there, we got our pizza! It was delicious! The Alice's were cooked perfectly, the plain slices were a perfect balance of cheese and sauce and the toppings on the other were so good. Definitely worth the hype and our trek! The slices were actually really big for brick oven and I was filled to content after we were done. Make sure to walk around the park when you ate done, it's do beautiful at night!", "author": "Alyssa F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-03", "description": "Why I came here?\nWe originally wanted to go to D'Fara's but they were closed.  Grimaldi's was the next pizza joint that we hadn't tried yet.  Lombardi's was out of the picture since it failed to impress me the first time.\n\nHow was the wait?\nWe waited for a very long time.  It was about an hour long.  Luckily the weather was nice that night and we were in good company so that made the wait bearable.  \n\nThe service?\nThe service was good.  Our waiter was very entertaining and patient with us when we were ordering our multiple pies.  \n\nThe pizza?\nGrimaldi's cooks their pizza in a coal fired brick oven which gives their pizza a nice charred smokey flavor.  The crust was thin and crispy, their ingredients very fresh and their cheese was very cheesy.  We ordered 4 pizzas, all of them were pretty tasty except the cheese on white sauce.  We actually meant to order just a plain cheese with tomato sauce but made a mistake.  Oh well.  We were pretty stuffed and after the meal is done, you walk outside and you get to see amazing views of the Brooklyn Bridge and the water.", "author": "Elaine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-05", "description": "Best pizza in my opinion is New York style, and the best New York style in my opinion is Grimaldi's under the Brooklyn Bridge!\n\nI just can't give it 5 stars just because although the pizza is delicious, I don't find the whole experience enjoyable.\n\n1. It can get quite touristy. \n2. The line, yea at times it's worth it- but how many times could I endure that line in a year? Hmmmm\n3. The space inside is SO tight, you might be confused as to which table belongs to your party\n\nBuuuut like I've said the pizza is GREAT. My favorite is just the plain pizza with extra basil- Also waiting in line the for restroom while watching the cooks rapidly toss toppings on to the pizza dough and throw 'em to the oven, it could get very entertaining.\n\nMy best recommendation would be to go in as small of a party that you can. You'll be seated way faster. Also eat that pizza quickly! Because it's so thin, it has a tendency to get pretty cool by the 2nd or the 3rd slice.", "author": "Ahris K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-27", "description": "Very disappointed , We heard some much good thing about this place. We had to check it out since we were visiting NY. Thank god there was no wait when we arrived. We ordered their Signature Pizza,  the Margarita. It was a little dry and had no flavor. I had better and it was pricey for a non meat pizza.", "author": "Nanci Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-17", "description": "pizza was mediocre, not worth going. people werent nice unless you knew them and the atmosphere was boring and nothing comfortable. took forever to get the check, both of their atms didnt work and neither did the two closest on the street. the line wasnt bad they get you in and out but they could use a lesson or two on how to treat customers.", "author": "Molli W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-24", "description": "Grimaldi's brick oven pizza is located right under the Brooklyn Bridge, so it's a prime tourist spot. Pictures of Sinatra hang on the wall, and the long picnic tables often cram parties together in the tight room. You'll wait in a long line outside, and then you'll wait again inside for pizza. Don't expect a big menu here either. There's pizza, soda, and beer. I mean let's be honest, why are you at Grimaldi's if you don't want pizza?\n\nOne of the best pizzerias in New York, no doubt about it.", "author": "Mark K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-05", "description": "Waited in line with my boyfriend for a while with very high expectations for this famous pizzeria. There is much hype about this place! \n\nWe were seated and first were a little disappointing that the menu was not as extensive as the Grimaldi's in Douglaston, NY and Garden City, NY. We ended up ordering a cheese pizza and were once again disappointed by the lack of flavor and seasoning. \nWe live closer to the other locations, so we have frequented them more and find that the flavor of the pizza is much better at the Douglaston and Garden City locations. Their menus offer more options such as salads and more toppings, like meatball, which is one of our favorites. \n\nThe location in Brooklyn is nice despite the lack of parking. One can walk the Brooklyn Bridge or visit Pier 11 and indulge in some ice cream from the Brooklyn Ice Cream Factory.\n\nNeedless to say, we were very excited to travel into Brooklyn to have some of the famous Grimaldi's pizza from the \"original\" location, but Queens and Nassau residents are definitely better off saving themselves the trip into Brooklyn and going to their local Grimaldi's.", "author": "T M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-15", "description": "I have been here twice--once to the old location and once to the current location. No lines, probably because it was the dead of winter. The pizza was good but I don't really understand the hype of the place. It's cute, not too expensive, and a good place to just hang out but I didnt think it was anything too amazing. Worth trying out though since everyone is always talking about it.", "author": "Hasiba H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-14", "description": "Had Grimaldis in the city but had to try the original. Wait wasnt bad but wanted to order to go and eat at the nearby park.  Ordered quickly and had the pizza in 5minutes.  Fresh and yummy. Only cash.", "author": "Edwin P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-30", "description": "I wouldn't have waited any more than 20 minutes for this place. That being said, we didn't really have to wait so yey.\n\nI love pizza, I always want it for some reason. So I was pretty excited to try this place out. It was good, but I think they needed to work on the consistency of the crust. We ordered half regular and half white with mushrooms, sausage, pepperoni and extra cheese and that half was a bit soggy. \n\nI still ate it, the crust wasn't a big deal. It was delicious but the pizza got cold fast so the stretchy cheese part only really happened with my first slice. Bummer, but I like cold pizza too so it all worked out.", "author": "Deanna L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}