{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-07", "description": "Grimaldi's made my NYC trip so memorable. It's got to be the best New York style pizza I've ever had. NO WAIT, correction, hands down BEST PIZZA EVER.  Everytime i have pizza now, I compare it to Grimaldi's, nothing comes close. \n\nMaybe it's the hour long line outside we stood in the freezing cold waiting to get in, or maybe it's some special mozzarella they use, the pizza is thin, and the cheese is stringggg---gyyyy. it's delicious. We ordered a large pizza, got full, then had to get a 2nd one JUST because 1. it was a long wait, and 2. we knew we were too busy scarfing down the first one, we wanted to actually remember how it tasted like the 2nd time around. So, take my advice, savor every bite, and if it's winter, bundle up buddy! It's going to be a long worthwhile wait!", "author": "Joanna S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-15", "description": "BEST. PIZZA. EVER. \n\nWe knew we would be walking around the Brooklyn bridge around mid-day, so we wanted something near for lunch.  Grimaldi's had popped up when I did a search of food places nearby, so we figured we'd give it a shot. It is a beautiful building on the corner, with lots of smiling faces exiting the doors with take outs and leftovers. \n\nWhen we saw there was a line, I ended up waiting while my friend went to shoot photos down by the water.  The wait wasn't bad, about 15 minutes around lunch time. It was quite warm outside, being that it was mid-day during summer, but there was a tree providing shade for much of the wait. When I got called to go in, my friend was able to walk over from the water, and got there within a couple minutes, so it's convenient for those who like to go wander if they aren't patient enough to wait in line. \n\nWe were seated on the second floor over-looking the prep/work area, which was great for taking photos. It was fun watching all the pizza's being made, and trying to see if we could spot ours before it was cooked. \n\nThe only reason I give this place 4 stars is because of the service. After being seated, we had to wait 10 minutes before anyone came to get our drink order. Additionally, when we needed refills of water, we would have to go track down our server, who was wandering all over the place.  He had quite the personality, so my amusement was greater than my patience level slightly decresing.\n\nWe ordered a small pizza, more than enough for 2 people. It came with 6 huge slices, and was $12. Each topping was $2, even if the additional topping(s) is only used on a portion of the pizza.  You can taste the \"fire\" from the coal brick oven on the crust, and the ingredients were so incredibly fresh. Each bite was an explosion of herbs, spices, and the taste of fresh mozzarella.  The crust was nice and crunchy, with the rest of the slice of a softer consistancy, but not soggy. \n\nThe pizza was so good we ended up coming back again a couple days later for dinner. They do not do individual slices, but the pizzas are so fairly priced, that I didn't even mind buying a whole one.  They are a cash only establishment, so be sure to come with some. I wish we had a place in California that came close to the taste Grimaldi's produces, but I will have to wait until next time I venture out to the east coast!", "author": "Claire R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-08", "description": "This is one of the first pizza places I went to when I moved to New York. They have very thin crusted NY style pizza, which is my favorite. The ingredients are fresh and tasty. My favorite is the margarita pizza.\n\nTo be completely honest, it is good pizza, but it's not mind blowing. You'll remember it, but it won't be the best pizza you've ever had. There are better places around with less of a crowd. So with that being said, don't wait in line for this place, come on a day where it's not packed. Your time is more valuable than an 8/10 rated pizza.", "author": "Jamie T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-23", "description": "Pizza was a lot bigger than expected and wasn't greasy at all but I found it to be not as tasty as some of the other slices I've  tried in the city. I really think it was the sauce, it just tasted a bit bland to me. \n\nIt also took at least 30 mins, probably 45, for our small pizza to come. The place was packed but I still didn't understand why it would take so long given how fast those pizzas cook. \n\nOverall it wasn't worth the effort to me given how quickly you can get great slices in NYC.", "author": "Tyson M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-30", "description": "I finally made it past the line last Friday night with my friends. We got seated upstairs and got a medium pizza of mushrooms and chicken. \n\nTIP! \nIts cash only people! \nThe ATM, for those who do not have cash available charges like $4 to withdraw. Plan ahead people. \n\nThe pizza was good. Big slices. Could've used more chicken on those slices though. \nThe line is not needed since there are plenty of empty tables upstairs. I learned that the location use to be a club back in the day. \n\nI can't lie I like the location next door better. \n\nBouncer was hilarious and let us all know all the dirt of the waitstaff. Plus it was super refreshing to hear him mention the most sexist things. \"We don't hire women because they take maturity and call out when they have their periods\". \n\nBut this guy had some game. We all stood outside awaiting one of group and saw this guy scoop up 3 asian girl tourists and convinced them to get in a car with him.", "author": "Ingrid A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-23", "description": "This place has AMAZING pizza! Fresh mozzarella cheese and basil! Been here 2 years ago. HAD to come back again!!", "author": "Jill A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-28", "description": "Pizza is good, but their service is spotty. Also, I have a beef with their shady practice of adding a \"service charge\" to the check, while neglecting neglect to inform their customers that it is equivalent to the tip. Their checks are handwritten and the service charge is just scribbled onto it, so it is very likely that a customer would miss it and double-tip. Very shady.", "author": "Nimish A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-01", "description": "We stood in a line that wrapped the exterior building. So of course my expectations were high and I was starving!!! 2hours later we get seated for four in a tight little corner of the restaurant, place is kinda old and dirty looking which slightly turned me off. We ordered one white sauce and one red sauce pizza and I wasn't really impressed which was disappointing since we waited so long and heard such good reviews. Slice of New York in Cali is better tbh.", "author": "La D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-12", "description": "Great pizza but know that you have to wait in the queue for a while. Service is OK! Carry cash, they don't take card..", "author": "Syed S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-21", "description": "Maybe 2 1/2 stars?\n\nYou have to look at this place for 2 reasons:\n\n1) the food \n2) the experience \n\nFOOD: the pizza here is really good. Great... No... Really good. Keep it simple and don't over do the toppings; it spoils the pie. I usually get pepperoni or just a regular pie. FYI - they don't do slices. You can do a 1/2 1/2 pizza for toppings.\n\nMy visiting friends always want to load up their pizza like Pappa Johns and usually end up eating all my Pepperoni because they like it more... I hate that LoL.\n\nEXPERIENCE: the new building is cute; much better than the old small place. But, in my view, the history of it all is lost because they relocated. \n\nThey also removed alcohol from their menu the last time I went... If you're a drinker.\n\nI ONLY go here with visiting tourist. I would never come here on my own. It's not worth it to wait 1 hour in line for pizza that's just GOOD. The reason you go here is because you've walked the Brooklyn Bridge and this is another known tourist spot.\n\nThere is better (lesser known) pizza in NYC [see other reviews*]. There is also a Grimaldi's in Manhattan that is a branch of this one that is essentially the same in the old LimeLight Church = more NYC history.\n\nI think that's a better option since you get pizza AND history... If you really have to say you had Grimaldi's Pizza.\n\n\n*i went on a Pizza Tour of New York one summer as a self experiment. I got fat; but are a lot of good pizza pies. LoL", "author": "Hilario W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-26", "description": "I'm not sure if my family got here early or what, but the line wasn't very long, which was good. We waited about 30 minutes and we were seated. You have to order pizzas by the pie. I think their prices changed from a small (16$ to 14$) and a large (18$ to 16$) so that's pretty cool. They told us we had to wait 30 minutes for our pizza, so we did. It was hot when we got it and it was pretty good - but it's totally overrated. I feel like, if I was a tourist, sure that's some good pizza. Honestly, I think I've tasted better. The location is so pretty though. Right next to the bridge and yeah! Just walk around the pier if you don't want to be in a crowded area because the place is pretty small.", "author": "Andrey T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-22", "description": "We were here last week, and thoroughly enjoyed their pizzas. We wanted to try the white cheese pizza but found the waiters were not friendly/ helpful at all! We were disappointed at their hospitality and abruptness.", "author": "Sonja L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-30", "description": "I mean DAMMIT- if this pizza was in Seattle, it would have to be 24/7.  The crust, the toppings...so damn good- in a cool little building.  Still love it.", "author": "Knathan R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-10", "description": "We were most happy getting a table without any wait tonight. The don't take reservations. \nThe pizza was pretty good and was served in appropriate time.\nThe really bad thing was that they are somehow suffering from a severe form of wrong calculation not able to put it right even in a 2nd try. Beware!", "author": "Oliver J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "We took a family trip here and really loved it. The original Grimaldi's is in a spectacular location right under the Brooklyn Bridge on the Brooklyn side with amazing views of lower Manhattan just outside the door. \n\nWhen I think about New York sytle pizza, this is how I picture it. The pizza is hand made with super fresh, delicious ingredients in a coal-fired brick oven. Coal was used instead of wood during the depression and yields a slightly smokey flavor. \n\nWe tried two pizzas. One had delicious Italian sausage with a hint of fennel and onions. They use a nice, fresh mozzarella and plenty of delicious marinara. The pizza has a nice, thin slightly blackened crust with areas that are really crispy and bubbly form the oven's very high heat. Its a nearly perfect New York pizza. My only complaint is that I really prefer pizza that is crispy all the way to the center. These are slightly soggy in the middle.\n\nI will say that the service was not very good. It was very difficult to get food ordered and to even more difficult to get the waiter's attention later. \n\nOverall, however, I highly recommend it for both the pizza and the experience. Go get an ice cream at the Brooklyn Ice Cream Factory next door afterward.", "author": "Clay K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-25", "description": "Well I eventually got the opportunity to go to grimaldis pizza tonight, being an old family owned restaurant the pizza was great!\n\nThe service on the other hand was slow and almost as if we didn't exist. The worst thing was that when we ordered our drinks at the start of the night, hot bottles of coke were served with a glass of ice to cool it down. This didn't impress me much because by the time I finished my first glass the ice had melted and I had to ask for more.\n\nThe atmosphere was good and we did enjoy the meal, but I won't be in any rush to get back or won't be recommending it to any friends.", "author": "Matthew H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-20", "description": "One of the best NY pizzas ever! My friend and I walked across the Brooklyn bridge, got lost for a bit, but finally found the renowned Grimaldi's! :)\n\nIt's this tiny little hole-in-the-wall type setting and it gets pretty packed in there! We waited in line outside and after about 30 minutes (which I heard is actually not a bad wait time), we were seated at a 4-seater table next to a random couple. Nice...double-date with a stranger. What better way to talk about where you're from and other great places to try in the city? ;)\n\nThe ingredients are fresh and you KNOW it's going to be just-out-of-the-oven because you see the chefs creating each masterpiece behind the plexiglass (or maybe it was actually glass). Either way, they're truly artists working on a craft, b/c the pies they make are works of art for your taste buds!!!\n\nSupposedly, the next stop you should go to is the ice cream place down the street, but I was way too full and too tired from crossing the bridge. HAHA. If you can, though, make your way across that bridge! It's a breath-taking view.", "author": "Tina L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-16", "description": "Am I the only one who thinks this is very mediocre Pizza. I mean seriously New York has a lot of pizza joints and this doesn't really make the cut for me.", "author": "Ali Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "Grimaldi's does have a line of tourists and locals, usually a wait of 1 hour.  The wait is always long, but their pizza is worth it.  Fresh mozzarella, fresh basil and slightly blackened, and crispy crust.  \n\nYou must try Grimaldi's. If you have the energy to walk across the Brooklyn Bridge towards the Manhattan skyline, you'll have an afternoon/evening worth remembering.", "author": "Gaby L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-10", "description": "With a bazillion reviews already tallied up for this place, I think I'll cut this one short. \n\nThe line outside- ALL hype!\nPizza definitely made with fresh ingredients and I appreciate the quality, but it's mostly hype! I can think of 30+ pizza places making pizza just like this (and better) so I'm not about to call this the best pizza I ever had in my life.  Aside from that, you would think this place could afford real wine on their menu. If I ask for a bottle of Chardonnay, please don't bring me the \"blended to taste like it\" version. Half the waiters dont speak English, the other half talk like they're from Queensbridge projects so it's useless. Once you place your order, dont expect anything else. You'll get your food/drink and you wont see your waiter anymore (unless you stand in the aisle and flag him down) until its check time. Expect noise, expect tourists, expect to see fools eating pizza with a fork!! \n\nIf I'm in the area again, I *might* do takeout if the line isn't down the block, but never dining-in again. Meh, I say Go if you've never been...get your curiosity subdued. Cash Only.", "author": "Marlena S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}