{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-09", "description": "Your New York experience will be incomplete without a trip to Grimaldi's authentic New York style pizza \nNostalgic ambience under the Brooklyn Bridge with classic warm Brooklyn personalities\nAfter your wonderful pizza experience \nbe sure to walk it off across the Brooklyn Bridge to the city and take in the amazing view\nA memorable evening you will never forget\nSay hi to all my new friends at Grimaldi's\nMelissa\nMalibu, California", "author": "Steve K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "I'm always down for Grimaldi's pizza.  Great pizza....you won't be disappointed with anything you order here. My favorites are the white pizza, pepperoni and margherita. Though if you order anchovies in your pizza....know that the anchovies are extremely salty.  \n\nGood ole' New York style pizza dough, warm \u0026 friendly service, a good place for good eats!", "author": "Issy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "Great pizza.   We had two.   One with pepperoni mush and olive.   Note the olives are more Mediterranean but still really good.   The second was pepperoni, sausage, and sweet peppers.   We walked right in and got a table.   It was busy but not bad.    Cash only and no alcohol at this point.    The thin crust pizzas were delish.   I don't think you could go wrong going here for a standard NY style pizza.", "author": "Scott A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "One thing to be aware of is that Grimaldi's is Cash only. Also, be prepared to wait in a line, because yes, the pizza is THAT Good! We stood outside in line for about 30-45minutes (with a party of five people). I went to another Pizza place in New York, and it didn't even begin to compare to Grimaldi's. We got a small pizza, and for travelers with no fridge/microwave in their hotel room, that's what I would recommend. In fact, we still had two pieces leftover which we ate later for a snack. I got the White Pizza with add-ons of Ricotta, Sweet peppers, and Meatballs. It was delicious! \nWhen I come back to NY, I will definitely be coming back to Grimaldi's!!", "author": "Sedona S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-17", "description": "Claimed to have a liquor license one month away when I visited last October. They still don't have one.\n\nThis restaurant lies to your face.\n\nThey also lied about why they got shutdown by the department of health.  They claim it's a permit issue, but in fact they have mouse droppings everywhere. https://ny.eater.com/2018/1/17/16900786/grimaldis-dumbo-temporarily-closed-department-of-health\n\nThe pizza is also way better at Juliana's next door.", "author": "David L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-17", "description": "yummy yummy pizza!!! almost always have to wait for a table. service is good! highly recommend if you're around brooklyn bridge park. great place for casual date night or with a group of friends. Cash only", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-25", "description": "Hands down one of the better pies I've had, whether in NYC or anywhere else. \n\nFAIR WARNING: Grimaldi's is not inexpensive AND it's cash only AND there are no slices. Whole pies only. Come prepared. \n\nHad the traditional pie. No toppings. The two slices I had left passed a most important test and tasted just as good the next day, after a short bake in the toaster oven.", "author": "John W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-28", "description": "The thirty minute wait outside the restaurant was worth it. As we were inches away from the entrance, we realized the cash only sign and thought we weren't going to be seated. Turns out it has ATM machines - of course! \n\nWe ordered the large plain pizza and given its hype, the first bite is underwhelming. It isn't the best pizza you've ever had but each bite of the pizza does get better than the last. The crust is the perfect consistency of thin and chewy and the sauce is just the right amount of flavorful. When in Brooklyn, I would stop by again.", "author": "Ally N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-12", "description": "Like others I was not impressed. The crust was the best part of the pizza. Pizza itself lacked flavor and sauce. Not bad but not great and not worth a very long wait.", "author": "Sabrina F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-21", "description": "Meh it wasn't good. Over hyped full of tourist. We ordered the white pizza which was what they are famous for. Ordered mushroom and chicken. It was classic NY pizza-thin slice. Wasn't saucy, but flavorful. Mainly a dry pizza. We just ate the essentials and left. 30 for a pizza and one coke definitely not worth it. Glad we tried it but won't be coming back or recommending it. TRY ARTICHOKE PIZZA. MUCH saucier and delicious. As I was eating this pizza I was thinking about artichoke pizza. Yummmm", "author": "Steven B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-07", "description": "Ordered a small regular pizza for two. Was so yummy n filling ! The wait is totally worth it ! Veg pizza - tomato, mozzarella, basil, jalapeño and onions - oh so yum !", "author": "Chetana K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "I'm surprised with the bad reviews. Our service was good, we didn't have any sort of wait and the pizza was good too. It may have been the best we had while we were in town. The crust was just slightly charred giving it a really nice flavor, we just got regular pizza but I thought that the sauce to cheese ratio was good.", "author": "Renee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "The best pizza I can recall eating (apart from Naples, Italy) is in Brooklyn. I lived in Manhattan from 1993 until 2001. After a fun day at the beach, we would drive out of the way to Patsy's Pizza under the Brooklyn Bridge. If we didn't arrive early, we might be on line outside for well over an hour. Many years ago, they changed their name to Grimaldi's. Even though I have visited NY since moving away, this was my first time to Grimaldi's since 2001. Our Aibnb was in Brooklyn so a stop here was a no-brainer.\n\nIt appears that there are lots of locations now.  We visited the spot under the Brooklyn Bridge. It's a block from the gorgeous Manhattan skyline and with stunning views of the Brooklyn Bridge. No liquor license. They used to play Sinatra. The night we visited, they played 80s pop. I love the genre but Sinatra was a better choice. We enjoyed a large pepperoni pizza and gave our leftovers to a hungry man on the street. \n\nCash only!", "author": "Amy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-09", "description": "The line is long despite the fact that the new location is more spacious than the old one but the wait is well worth it. The crust is too burnt for my liking but the toppings are delicious, you can't find the same flavor anywhere else, they must be exclusively made for Grimaldi's. Highly recommended.", "author": "Ralph M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-07", "description": "This is a great ny slice...had plain cheese pizza.  Loved it.  Can't go wrong here, under the Brooklyn Bridge.", "author": "Kunjal P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-12", "description": "Overrated and not the best pizza in Brooklyn. In my opinion \u0026 Pizza is better. Also the staff is extremely rude and nasty. I really don't know why people stand in line for this pizza. It's mediocre compared to other restaurants in NYC.", "author": "Arielle D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "Fantastic pizza and an old school location. You'll have to wait in a long line outside and some people say Jillian's next door is better pizza but I can't imagine it's much better tha Grimaldi's. It is definitely the kind of place to bring visiting tourists. You can't buy pizza by the slice, you have to get a whole pie, either small (6 slice) or large (8 slices) and toppings are kinda expensive. But the pizza is pretty great. I personally like bigger crusts but that's just my taste.", "author": "Peter S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-23", "description": "This place is awesome - located in the heart of DUMBO and its pretty much a historic landmark for pizza in Brooklyn.  Pizza is delicious.  I'm not about the long lines and wait, so I try to avoid dinner hours and make it out for lunch, otherwise its too busy.", "author": "Sabrina S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-31", "description": "Subpar pizza + terrible service = one star review from me \n\nThe service was awful as our waiter seemed to be intoxicated as he was stumbling around and took our orders multiple times because he kept forgetting to write it down. Furthermore, when we finally received our pizza it was borderline warm and tasted no better than papa johns. It took another 15-20 minutes to get the rest of our order on the table and the drinks came at the end of the meal. If you want to try great New York pizza go anywhere but here!", "author": "Dajzhane R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-23", "description": "Before heading out to NYC, I polled my friends and coworkers about their \"must-dos and eats.\" My +1 said, \"You HAVE to go to Grimaldi's and eat a slice of pizza underneath the Brooklyn Bridge.\"\n\nSo that's what I did.\n\nThere was a little bit of a line on a late Thursday evening, but not too bad. Smaller parties (1-2) were literally seated within a few minutes.\n\nThe doorman guy/host was super friendly with n00bies and regulars alike. He chatted me up, telling me that my +1 was a smart guy, and asked if I wanted a pic so I could send it to him and make him jealous. So pic he took and pic I sent. :)\n\nTheir website says a Personal Size pizza is available, but I was told they only have Small and Large. I ordered a small cheese with fresh basil.\n\nNote that it's CASH ONLY.\n\nThe pizza came out quickly and piping hot. These guys don't mess around!\n\nWhile it looked beautiful and was pretty huge (enough for 2-3 people), it was, sadly, pretty bland flavor-wise. I thought it was perhaps my choice of toppings, but the guy next to me - with a sausage pie - had the same problem. We both tried to remedy the situation by using the seasoning salt on the table. (And I guess New Yorkers don't keep parmesean around?) Also, I was a bit dismayed that the mozarella started to toughen relatively quickly, which was unappetizing. The crust was great, though.\n\nWas it the BEST pizza I had on NYC? Sadly, it takes the last/#3 spot behind Bleecker Street (my #2, but technically not NY-style) and NY Pizza Suprema (my #1). I offered the leftovers to my AirBnB hosts, who gladly ate it, but had the same verdict.\n\nStill, I'd give Grimaldi's another try on a return trip.. maybe I just need to order something different.", "author": "Jennifer P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}