{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-14", "description": "One of my favorite nice weather things to do is walk across the Brooklyn Bridge from the Manhattan side and have Lunch/Dinner at Grimaldi's on the Brooklyn side!", "author": "Robert W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-07", "description": "Came on a Wednesday evening in January around 6pm and they had several empty tables. The pizza came quickly, and it was piping hot (they are made in a 1000F degree coal oven and brought right to your table) yet it wasn't dripping oil or cheese like many other hot pizzas. I quite liked how even the plain pizza had basil. I'm not a fan of deep dish, I prefer slightly thinner, yet not limp crusts and Grimaldi's mastered it. Perfect crust, perfect fresh mozzarella and basil, perfect pizza, perfect location. I went there with high expectations after reading all the hype and I wasn't disappointed one bit.", "author": "Vineet S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-06", "description": "this just in...no line at grimaldi's last night at 10pm.  maybe because it was flippin' freezin' or maybe close to closing time.  i only dream of just walking into this fine establishment.  last night was a dream come true.", "author": "Sharlene C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-11", "description": "Hands down the best pizza. If you don't like the service don't come to New York. Worth the wait, which will be much shorter than you think, every time. This place has been my favorite and my brother's favorite for years. Don't hesitate to try it.", "author": "shady l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-10", "description": "5 stars for the pizza, zero stars for the time it takes to get pizza here so it's the best pizza I've ever had in NY the 2 times I've been there so I'm giving this place 4 stars so I have a love/hate relationship with Grimaldi's, the wait for pizza is a joke and a half here, this place is a tourist trap, I was just by myself and it was like an hour and a half or so to get a table and they don't take reservations so be prepared to wait a long time here. The pizza I had was a small pepperoni with mushrooms and it was soooo good!, another thing I didn't like though is how they only serve bottled soda but meanwhile I saw a soda fountain there so I'm assuming it was broken or they just don't use it anymore for some stupid reason, please serve fountain soda Grimaldi's!!, drinking fountain soda is part of the restaurant experience!. The total cost was like 24 or 25 bucks and change for the pizza, 2 cokes and tip, expensive but you get what you pay for and what do you expect if it's a tourist trap but they got great pizza!.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-27", "description": "It's good... and a must for the first time NYer .... but does it meet the hype of \"best pizza in NYC\"? well, let's put it this way. if this is the best pizza NY has to offer, stuff yourself with something else... NYC has so much more to offer.... PS. they don't sell pizza by the slice...", "author": "B O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-31", "description": "being from new haven, ct, i am a very tough pizza critic, graimaldis is outstanding!!!  new haven has two of the country's best pizzeria's and sometimes ill get the craving and get in the car to drive to grimaldis! super fresh ingredients leads to a super fresh tasting pizza. watch when you go, adn you should be able to get in fine, obviously if you go on a friday or saturday at 6, youre screwed.", "author": "John R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-20", "description": "It's taken me a little over 2 years to finally make it to Grimaldi's.  My friend and I decided to make it a Brooklyn outing day by walking the BK bridge and eating at Grimaldi's.  I've passed by Grimaldi's several times during my time in NY, but having always seen a line, never wanted to wait.  This day, however, I was dedicated.  The line was maybe 15-20 ppl long but it moved surprisingly fast.  Within 30 minutes we had a table.  It's a pretty tiny place inside, so think eating in Chinatown elbow to elbow with random strangers.  My friend and I ordered a small pizza with sausage and mushrooms.  I had high hopes and they were quickly deflated.  The pizza crust wasn't even that thin and it was soggy/runny.  I'm a pretty easy person to please when it comes to pizza as long as it's made right.  I'm not a fan of the runny/watery pizza that you have to eat with a knife and fork because you can't even pick it up.  That is what we were served at Grimaldi's.  Two thumbs down in my book.  Though it wasn't the worst pizza I've ever had in my life, it definitely didn't live up to the hype.  For great thin-crust pizza, I would say head to Luzzo's, Posto, or Lombardi's.", "author": "Grace y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-18", "description": "Waited for an hour and a half one evening just to sample this pizza.  It was great.  We tried the pepperoni and ricotta pizza as well as ordered two carafes of wine and it was surprisingly affordable.  I've had better pizza, but that was in Naples.", "author": "Ali A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-06", "description": "One of the best pizzaria in the western hemesphere the line you will wait on is worth it and should also bottle and sell there smell", "author": "joseph p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2005-10-07", "description": "If loving Grimaldi's is wrong, I don't wanna be right.  A lot of New Yorker's will tell you that their fave pizza joints are in Little Italy.  They are wrong.  Grimaldi's consistently provides the tastiest pizza. Worth the trip!", "author": "AC W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-20", "description": "I waited in line for about 2hours to get into this place but it was well worth the wait i hear the line gets insane on the weekends around dinner and lunch hour so take that into consideration if your going around the holiday time.. i was with some colleagues from the west coast and none of us had been before so we were not in the Know if you get my meaning.  we were all starving so we ordered an everything pizza =0D. if youve been there you know your paying for each additional topping that goes on and if your looking for budget meal I don't suggest that, Anyhow the Pie was to die for everything was amazingly delish it was like  a dance of heaven in my mouth. they have a small beer selection that fits great with pizza make sure to load up on the cashola they do not take credit cards. the location is perfect you eat and can take a walk down to the water and see the view of the Bklyn bridge and the city view is awesome at night, great place to take colleagues or clients who dont have time to see and do much but they get a view of some pretty amazing things and the best pizza in town.", "author": "Angela Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-06", "description": "delicious thin crust pie's. the way a pizza should be served and directly under the brooklyn bridge. what a treat!!!", "author": "Chris N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-29", "description": "Pretty good food. My girlfriend tried to convince me not to go since she seemed to have a vendetta against the place after waiting two hours or something to be seated but i decided to go anyways since it was a Friday afternoon and I thought it would be less crowded. It was and we were seated immediately. I was quite satisfied and preceded to order another small pizza after devouring the large. It was on par with the good pizza places in NY like John's and Lombardi. Prolly not worth the wait but definitely would stop if Im in the area and it is not too crowded.", "author": "Jeremy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-18", "description": "Best pizza I've ever had, it's true. Sure, there's a long line, but that's part of the experience.", "author": "Annie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-03-17", "description": "Grimaldi's, formerly known as Patsy's, is sheer perfection.  The only way to make it better is to bring a fresh white truffle, and shave it onto the hot-off-the-oven pizza.  I think I might have an org..m just thinking about it.", "author": "Anonymous M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-28", "description": "I don't know much about New York pizza, but I do know what I like to eat.  And I like to eat here.  My friend and I came here for a late lunch at 2pm, and we still had to wait 45 minutes just to get in the door.  The scarier part was that when we left an hour later, the line was just as long.  The food is worth it, though.  My friend and I finished a large pizza, with room to spare for the Brooklyn Ice Cream Factory just down the street.  Another cool thing about this place is that the chefs are behind this glass window so you can watch them make your pizza after you order it.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-27", "description": "We took a friend from Los Angeles here about 4 years ago and she STILL raves about Grimaldi's so that should tell people something. THe lines can be a pain but hey it is worth the wait. Enjoy!", "author": "Tommy Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-07", "description": "One of the best Pizza places in NY..the one hour wait was totally worth...should try the ice cream factory at the end of the street after this stop...", "author": "Legacykey K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-26", "description": "Two friends and I must have waited over an hour in the rain for our first taste of Grimaldi's.  Honestly, I have to say this place is a bit overrated.  The sauce was fresh and tasty, however, the crust was very dry, overly chewy, and too thin for my tastes.  Given the all of the hype, I expected more.  Truth be told, I've had better pizza in Manhattan... I eat a lot of pizza!", "author": "Matthew L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}