{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-27", "description": "Clearly you guys are tourists and/or never had good Brooklyn style pizza. I checked this place out for having so many reviews but realized it's just a tourist trap (right under the Brooklyn bridge). Location location location. I understand there are many ways of making pizza but once you've had Brooklyn pizza, it's difficult to settle for anything else. I gave 2 stars because their pizza looked very appetizing. Their fresh toppings were actually tasty. But let me tell you something, \"uniforms and jerseys\" don't win sports games. Anyone who knows pizza knows it's in the sauce. Find a place that makes their own sauce with their own seasonings and you won't ever need toppings. I usually stay away from L\u0026B's but they top this place any day.", "author": "Vinny B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-01", "description": "True pizza landmark located in Downtown Brooklyn right off Brooklyn Bridge. Small place sells heavenly pies (no sliceies sarved). You can flush it down with some Brooklyn Ale of your choice. They've got some good selection. Heard Spike Lee is a regural there, come by perhaps you'll get lucky...;-)", "author": "rlit"}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-13", "description": "A pie and a beer at Grimaldi's is the best life has to offer.", "author": "Joseph H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-25", "description": "I have been here a couple of times. The first time I came to this place was a couple of years ago when I learned that this place might be going out of business due to a dispute with the landlord (later resolved apparently). Well considering myself somewhat of a connoisseur of pizza I couldn't let the famous Grimaldi's close without giving them a shot. Well like I said I've been a few times now and no, in my opinion it is not the best pizza in New York. It is some damn good margherita  pizza though SOME of the best I've ever had. Ok the service, it's ok the waiters are really busy I mean the line is always out the door. I've generally gotten my order in a timely fashion once seated. I do like this place though (now moved two doors down to the old bank on the corner). If I have visitors come from out of town this is one place I have taken them, as it is a pretty damn good representation of New York pizza. If the weathers not too bad go and suffer the wait the pizza and the experience is worth it.", "author": "James B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-16", "description": "The pizza is indeed delicious, but given that I'm the type of person who would almost always rather eat something acceptable immediately than wait an hour for something great, this place isn't really for me. Go once, just to say you did, but after that, you can find plenty of pizza of reasonably comparable quality elsewhere without having to deal with the hassle of this old-people-and-tourists trap.", "author": "Galvin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-30", "description": "Probably 3.5 stars for the pizza.  They have thin crust brick oven pizza and it comes out hot and best eaten right there on the spot.  2 stars for the wait.  I hate waiting in line and if you're like me, you will hate this place unless you come at the off peak times probably around 10pm before it closes or around 4pm.  This place is definitely a tourist trap and half the people in line were obviously tourists with huge cameras and so happy to to be there waiting in line and taking pictures constantly.  We got there around 12pm and we waited an hour and half to get inside and then another 30 minutes after we placed our order to eat.  By the time, we finally got to eat, I was expecting it better really be good and it was just good.  The pepperoni pizza was my favorite and the sausage and mushroom pizza was pretty good.  This place is cash only and you can only buy pies.  A large pie feeds about 2 if you are hungry but it will be enough for about 3 people.  There is absolutely no way I will come back if I have to wait more than 30 minutes because there are plenty of other pizzerias that taste good enough in the city where you don't have to wait that long.", "author": "Andrew K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-23", "description": "Massive disappointment... I don't know why people trek to Brooklyn and wait hours on line for Grimaldi's when there is much better pizza and much faster service in NYC. We waited on like for about an hour for a takeout pie (Italian sausage and mushrooms) on Saturday. Angelo's Pizza in Midtown and Lombardi's downtown offer the same genre of pie, but MUCH more flavorful sauce and toppings. There was literally nothing remarkable about Grimaldi's pizza whatsoever. The best part was the crust, but I assure you that Angelo's crust is no worse. And if you want something a little more exotic and flavorful than Angelo's, try Pizza by Certe, which has amazingly flavorful toppings and combos.", "author": "Olga G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-05", "description": "Pizza Margherita (regular) was awesome! Make sure you get the post pizza cannoli...possibly the best I've had. Be prepared to wait...took us(2) 1 hr 45 min at 3:30 pm.", "author": "The Big Babboon I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-04-16", "description": "Excellent pizza, insulting service. My party made the mistake of ordering dessert (a passable cannoli) after we had finished our pizza. What happens if you linger, for any reason, after they have arrogantly whisked your plates away is that you are immediately of no use to them as clients. Grimaldi's business model is: get them in, get them fed, get them out. \n\nSo after about 2 minutes into our cannoli, our (Serbian?) waiter shoved new place settings and silverware in front of us as if the next party was already seated. Their tables are small so there isn't a whole lot of room to maneuver at this point. A minute later, he dropped our check in front of us. We were miffed but were intent on enjoying dessert. A minute after that he dropped 2 large menus in front of us. At this point there is no room whatsoever. We reluctantly gave him a credit card at this point but made it known to the manager that the service was a joke. \n\nI live here. I am used to rushed service but Grimaldi's is ridiculous.", "author": "Jones M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-29", "description": "Well, the pizza isn't bad at all. However, it is in no way worth the hype/wait. It's a 'thing' and that's why people do it, plain and simple. It's super cheap though, and that's a plus. Maybe if there were no line, I would eat there again.", "author": "Miranda R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-26", "description": "o noez!! TWO STARS!! Grimaldi's!!\n\ngasp all you want.   it was a big disappointment after waiting 45 minutes in line.\n\nsure they use fresh ingredients, but $15+ is much too expensive for a rather bland pie that I could easily eat all by myself.", "author": "Julia S. J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-07", "description": "Ahhhh this pizza is so good. They make it right where you can see it. The only downside I can say is that you usually have to wait in line foreverrrr. This is one of the best pizzas I have ever had. I come back to California and am so sad I can't get pizza anywhere near as good.", "author": "sigourney w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-23", "description": "I came here because my boyfriend loves pizza. This is no joke that this pizza is amazingly delicious. The coal oven gives it a distinguish taste that no other pizzeria can compare to it. I would like to add that the owner looks like he's from an Italian mafia or something. Service was kind of slow. It took awhile for someone to come by our table. The music was LOUD! Don't expect any Italian music... it was hip hop/ slow oldies. And the place was packed so this place isn't ideal for a date or even groups. It's so crowded. The pizza came out pretty fast. BRING CASH. NO SLICES. There was a line til closing time... Take out and dine in is the same line. We spent about 30 bucks for two people. You either pick regular pizza or white pizza. Pretty easy menu to order and create your own pizza pretty much. Enjoy!", "author": "Cali H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-12-29", "description": "The pizza was merely ok, and the line was idiotic. If you must go go with 4 people, if you can't find 4 people don't go or recruit 2 extras when you get there. The old man apparently doesn't think much of parties of 2 and there ability to spend money. I would have felt the need to tip more, but our server was bad too. So if you must go, go with 4 people and be ready for ok pizza. There is better in town.", "author": "Ben B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-24", "description": "OH how the mighty have fallen.....\nI love pizza and until recently I LOVED Grimaldi's. I live 5 blocks from this place and slowly but surely they have gone from being respected to repulsive.\nEveryone knows to expect to wait in line to eat at this place, as it is no doubt a tourist trap. For the past 6 years I have been happy to wait when eating in. Now, I am also happy to jump down there to pick up a pie as they do not deliver. HOWEVER, they recently made the decision to not allow patrons to call for take out and ON TOP of that, if you do want take out....they make you wait in the same line as the fine folks waiting to actually sit down. HOW UPSURD.\nThat would mean take out people from the neighborhood would have to wait in excess of 40 minutes to just ORDER a pie to go?\nI expressed my confusion on the issue to the what used to be nice man that stands outside to manage the line. He literally got in my face (one eye closed) and asked what the problem was. Is it really neccisary to get in a woman's face like that after she has been a faithful customer for over 7 years? \nGood God Grimaldi's.....get a grip.\nSeems like you made the choice to support the bridge and tunnel crowd filing off of tour busses rather than the neighborhood that has supported YOU for so long. \nPerhaps they are under new management, because the pizza has started tasting less fantastic of late, and the outside is starting to look super shabby....then again, perhaps it's just greed and laziness which is the death wish for any respectable business. \nGood Luck Grimaldi's, I'm sure you will be  here for years to come as long as your \"pizza tour\" keeps em' coming in like cattle. \nI'm just disgusted and won't be going back any time soon.", "author": "Jill M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-29", "description": "Food was decent. Line was pretty long and I Don't get the hype", "author": "mendy l."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-24", "description": "I think Grimaldi's is completely over rated coming from a native NY'er. I've definitely had better pizza in Long Island and Manhattan. Because the wait is so long, the first bite of the pizza is delicious... any other bite following that is just okay... I would give it a higher rating if the line wasnt so long. But overall... i think it was just okay.", "author": "Lulu C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-28", "description": "I am not going to base my criticisms on the loud large hell on wheels pumping trashy techno beats with drunken russian teenagers trying their best to strike a slutty pose in front of their camera guy. I was so happy to go inside and didn't mind that the inside was just as loud as the outside. The place is small, service is fast and the pizza is yummy. Fresh toppings, decent sauce, good cheese and good prices means I will be coming back, not the best pie in NY but a very good one.", "author": "Simon P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-06", "description": "The Big G in DUMBO!  Love it!  My college friends and I have a summer ritual of walking over the brooklyn bridge both ways, after devouring mad pies at the Big G!  Looking forward to this summer's pizza run!", "author": "O S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-11", "description": "really good white pie. tried half white pie half margherita. if i were to go back i would get a full white pie. one pizza fed my friend and i which was perfect because you can only order whole pizza's. the only bad thing was we had to wait around 45 minutes in the hot hot brookyln sun..but that's expected anyways.\n\nnow the dilemma...grimaldi's or lombardi's?", "author": "Ely K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}