{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2006-08-19", "description": "Fantastic pizza.  Why the two word review?  I just simply can't describe how good it is.  It's interesting though...the cheese is UNDER the tomato sauce.  Location is terrific, right next to the Brooklyn Bridge.  \n\nAnyone within driving distance of NY owes it to themselves to make their way in for Grimaldi's.  It's well worth a trip; and, if you pair it up with the Brooklyn Ice Cream Factory and a walk across the bridge, makes quite a day.", "author": "Zach S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-26", "description": "Pretty damn good!  I'd definitely come here again.  It's not perfection, but it's pretty close.  I'm Californian, so I'm not exactly a NY pizza connoisseur, but I really enjoyed the pizza here.  Great thin crust, perfectly melted mozzarella, and excellent sundried tomatoes and mushrooms.  It simply tasted like quality.  And they serve it in just a few minutes.  They're ultra fast!\n\nComplaints?  I just have a few.  Long lines outside, although it moves quickly.  The dough is slightly soggy/mushy, not crisp.  This was more of a problem with my friends' pizza, and less with my own which I think was cooked for longer.  I also thought the price was slightly high.  $4 for sundried tomatoes toppings?  Sure tasted damn good though!", "author": "William C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-08", "description": "This is the best pizza I've ever had.\n\nMy friends took me here on my first trip to NYC.  The line was huge; we had to wait about an hour to get in; but it was totally worth it.\n\nThe crust was so good!  Perfectly crispy on the outside and soft on the inside.  All of the toppings were amazing too.\n\nI was only in NYC for a weekend, so we didn't have time to visit any other pizza places, but I can't wait to go back and try some others.  It's hard for me to imagine that there is better pizza than this, though.", "author": "Michael F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-11-04", "description": "While quite delicious, I can't say I'd give this place 5 stars.  For me, I'd reserve 5 stars for perfection.  It's true, the ingredients on the pizza are incredibly fresh, paired with a nice crispy thin crust.  I love the flavor of the cheese.  I think they made the crust a tad too thin, because my pizza was a little soggy.  We ordered a sweet roasted pepper pizza with pepperoni.  Tasty, but I think next time I'd rather have garlic, extra basil (it normally comes with basil, but isn't well distributed), and sun dried tomato.  Mmmm my favorite combo. \n\nIt's also cash only and the wait can be long if you go during peak hours.  \n\nWould I go here again?  Not that there's anything wrong with it, but for the wait, I'd rather go elsewhere.  To the people who say waiting is part of the experience, well it ain't part of mine!", "author": "Scuba K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "Is it the best pizza I've ever had?  No.\n\nIs it extraordinarily good pizza worth writing home about?  No.\n\nIs it very good pizza?  Absolutely.\n\nIs it worth the long lines?  Hmmm, yes, but only once or twice a year (or when you can get your out of town visitors to pick up the tab).", "author": "Andy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-03", "description": "When my friend mentioned that we'd be eating pizza after our afternoon out at the Brooklyn Flea and that it would be a 45-minute wait, I couldn't help but think she was exaggerating. Really? 45 minutes? She must be preparing me for a worst-case scenario.\n\nTurns out thats a good-case scenario at Grimaldi's. The wind was icy cold that Saturday afternoon we made the choice to brave the line. But once we\ngot the coveted wave to get inside, we immediately settled into our cozy booth and had amnesia about the line. \n\nI can honestly say it was probably the best pizza I've had. Everything about it was perfect - from the thin crust to the fresh mozzarella and sauce, even the saltiness of the pepperoni was right on. Not sure how other pizzas will measure up after this.", "author": "Natasha L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-28", "description": "The one star review is meant to rate the whole Grimaldi's experience with its particular relevance to actual New Yorkers and not easy-to-impress out-of-towners looking for the \"best\" pizza in the city. Actually, the whole experience probably rates 1 star, but the pizza isn't *that* bad in its own right, maybe a 3 star maximum, but here, like at Di Fara's, it does make sense to consider what you have to go through to get it.\n\nGrimaldi's is truly a victim of its own success. If you're willing to wait an hour or more to get into this place, as some previous reviewers apparently were, you're a tool. Go somewhere else (like around the corner). Not to be crude (OK, to be crude), you aren't going to bust a nut over this pizza. And what's so wonderful about standing in line for food? What is this, the Soviet Union? It's fucking pizza, not Fabergé egg omelets served on a Tsaress' naked bosom. And what's so wonderful about being mechanically crammed into a tiny restaurant with shoulder-to-shoulder tables? What is this, Communist China?\n\nThe problem with being from New York and wanting to try out the famous Grimaldi's is you'll never want to stand in the line, because you know you can always come back. Desperate tourists have no choice. Do yourself a favor and show up at least 15 minutes before the place opens (noon) and secure yourself a place in the first seating. If you must come here. But don't expect superior pizza or any service to speak of. I did see the owner (?) wearing a top hat and talking to certain tables. I believe I overheard him bragging that he knows Jimmy Kimmel. I guess Jimmy doesn't have to stand in line (but can he save their lease?). But the priority is clearly volume at this place. Also, if you're used to custom fancy pizzas with silly names, Grimaldi's makes you pick your own toppings. You start with a $14 basic large pie and the price quickly inflates with the toppings at $2 each. Maybe you should bring your own.\n\nThe sauce is good but the medium-thick crust gets soggy in the middle, which is probably what makes the thing cool off so quickly. You might just eat half and take the rest with you to heat up at home where you won't feel like one of the anchovies. The other ingredients (fresh mozzarella, basil, mushrooms, olives for us) were of decent quality, but I was not in any particular way blown away by the pizza here. To be clear, it's an OK product, but it hardly warrants all the fanfare and attention and certainly not an embarrassing wait in line followed by an uncomfortable seating experience with perfunctory service and a long wait for your food (and single unisex bathroom!). New York has plenty of other top quality pizza restaurants where you needn't suffer such indignities.\n\nIf you do come here, you're just coming because it's \"famous,\" so at least accept that. They may be losing their lease soon if you need better cover for a visit. Get your \"famous\" Grimaldi's while it lasts!", "author": "Steven S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "Top 10 in the city. Go when the line of tourists isn't out the door.", "author": "Moonlight G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-07", "description": "The pizza is good but because of the wait  I expected awesomeness. My wife and I stood in line for a very long time to get in this place. Once we were inside, we were hit with the fact that their sitting arrangement is terrible. You are seated next to other people at the same table that happens to be a very tiny table, unless you are lucky enough to sit at the bar. I say this is an experience you must try once in your lifetime but that's about it so I'm giving it 3 stars because of the wait and the seating arrangement.", "author": "Orlando A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "I went here last weekend with a friend after some of my coworkers recommended the place to us. We went on a Sunday around noon so naturally there was a line. We waited in line for roughly 20 minutes and about 12 minutes for the pizza. Fortunately, they had water at the front door. I was slightly aggravated by the process, because the host/seating person said that dinning in and ordering to go is the same line. This of course didn't make much sense because I could have easily placed my order when I arrived and pizza would've been done before I reached the door. Since I've been living in NYC for a few weeks I've learned to always keep cash and sure enough it was cash only. I didn't see anything that said it was cash only until I saw the menu at the front. When I placed the order for my pizza there was no one ordering so that frustrated me even more. I felt rushed through the ordering process and there really wasn't a system for to go orders. My friend and I had to wait outside for our pizza. When the employee walked outside, he went in a different direction and I had to flag him down. He was told to give the pizza next door even though it was our pizza.\n\nOnto to the actual pizza. The pizza itself is one of the best pizza's I've ever had. There was no separate layer for sauce and cheese. The sauce and cheese was mixed around so it was kind of a mess, but it had a unique taste. The pizza was very thin and crispy. I've been to a few other pizza restaurants in midtown Manhattan and Grimaldi's definitely beat them out. \n\nI recommend going to Grimaldi's when it's not busy. I hate giving poor reviews because of service, but my experience with the service wasn't good by any means. The pizza is definitely worth waiting 30 minutes for.", "author": "Farrell T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-05", "description": "It's great, but a little too much of a tourist scene for me. I prefer Verde Coal Oven in Bushwick. Pizza is just as good, and it's not so much of a wait...", "author": "Alex S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-07", "description": "Don't believe the hype.  I grew up in Brooklyn and only heard of this place a few years ago from tourists who flocked there and waited in lines for what they thought was the best NY pizza.  Finally I decided to wait in line to see what all the fuss is about.  It's nothing special.  It's not even NY pizza.  I can't believe tourists are going here thinking they are getting a NY slice.  They don't even sell pizza by the slice and you can't get more Un-New York than that. It wasn't bad, the ingredients were fresh, but they were stingy with the sauce, the cheese was too thick and my crust was burnt.  I am glad I went so now I can tell every visitor I come across not to waste their time.  You can go to a pizzeria on any corner in NY and get a great slice, or better yet just look for Rays", "author": "Ty M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-09", "description": "I thought the address was on Old Fulton St?\n\nI love thin crust, and I usually love it on the crispy side.  A previous visit would have been rated a 6 out of 5 stars, but last night they were a little disappointing.  \n\nThe pizza came quickly, obviously had good quality ingredients and fresh taste, but the crust was really really chewy... almost like it had been made and baked earlier in the day, then topped and heated up when I ordered.  The mozzarella wasn't even thoroughly melted...\n\nI was also charged more on the bill than the menu listed.  It was only $1 difference, but inaccuracy loses points.  I didn't make a stink over it, but it came off the tip (sorry, I felt bad doing that).\n\nI'll give them another try, since I've had such a great experience in the past... and hopefully I can add stars to this review.\n\nService was friendly and quick.  A first-try of this restaurant would have been 1 or 2 stars based on this experience, I'll give 3 because I do want to go back and give them another shot.", "author": "Bruce W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-02-03", "description": "I went here after talking to some friends from California...boy I shoulda known! \n\nAfter waiting 30 minutes (during off hours!) in hot, humid summer weather, we get this soggy soggy crust pizza. People you can have a coal fired, wood fired, cedar chip fired or hamster powered belt driven oven bellows powered oven, and have it as a bragging right but PLEASE use it and COOK your crust!!!! \n\nI'd even dare take half a star off for this review for the fact we had to trek it out to Brooklyn for this stuff. All apologies to you tourists and non-native New Yorkers who gave this place 4+ stars.", "author": "Frank C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-23", "description": "Pretty good old-fashioned style pizza.", "author": "I G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-03", "description": "A 30 minute wait at 3pm, a twosome sat at the same table as another twosome, no alcohol and a luke warm pizza. Do not waste your time.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-09", "description": "Grimaldi's is your baseline for New York Pizza!\n\nYour baseline first pizza is a Pepperoni with Basil and extra crushed tomatoes!  \nInsider tip:\nto look like a regular you need to order your pizza as your being seated (go baseline- large for 2-3, two large 4-5)\nSuperthin crust, pepperoni's that curl up on the edges , fresh basil leaves and sauce.  Eat it quick its best piping hot with some garlic powder.\n\n2nd best pizza in america for taste, Best Pizza experience in the US and an absolute must for any serious (and I hate this term,) \"foodie\" you cant talk pizza unless you've been!", "author": "Mark W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-17", "description": "Too long of wait (1 hour). Tourist trap. Pizza is decent, but Lombardi's much much better.", "author": "Tyler C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-02", "description": "Waiting in line for a half  hour takes Grimaldi's from a four star pizza joint to a three star pizza joint. I went  just to say see what all the fuss was about, and I was not wowed.  \n\nI would def. venture to Patsy's in Harlem or wait in line at Lambordi's before I'd go to Grimaldi's.", "author": "Noodle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-29", "description": "I'll admit it, I came here about five times before I actually went in and tried it. I circled the area a bunch of times trying to look for parking (and I never found a spot, not once), but today I passed by and saw there was no line so I just parked in the nearby lot that gives you a discount ($8 for three hours) if you're eating at Grimaldi's. \nWe ordered a regular large pie, and it came out pretty quickly. The service is very fast, and the place is constantly packed and it's definitely not romantic. But the pizza was amazing. We finished the pie in 20 minutes, and I kept on examining the slice to figure out what exactly made this pizza so good. I don't know if it was the cheese or the light sauce or the way it's placed on the pizza or the crust. Whatever it is, it's good. I don't know if it's worth waiting on a long line for, but it definitely is really good.", "author": "Heather C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}