{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-21", "description": "Pizza and beer are one of lifes pleasures! But eating and drinking it here is the best! The building looks like this old rustic American made building from the very beginning of New York! It sits right under the Brooklyn bridge in Brooklyn.  You walk in and you see the cooks making the pizza right then and there.  I loved everything about this place! They even had an awesome white pizza that was delicious! I cant wait to go back! And by the way, taking the subway there was so easy! 2 block walk from the subway exit!", "author": "Michael S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-09", "description": "Grimaldi's was recommended to us, therefore I read NO reviews and trusted the friend.  SO glad I did.  Went with a family of four on a hot and humid Sunday afternoon.  There was a line out the door!  But, the bar upstairs was selling $2. beers and $5 frozen margarita's, and yes, we could drink them in line!  (do this if you want to drink; beer will cost more inside, but skip the icy margarita in a tiny cup).\nThe line went quick and before ya knew it we were sitting down to a Margarita Pizza that was to die for.  One teenager liked John's Pizzeria's Margarita Pizza better, but the rest of us aren't sure - both were delicious.\nComparing Grimaldi's with John's, I would pick Grimald's establishment just because they have two toilets in the woman's bathroom compared to the one in John's.   Both are large restaurants and need facilities to match.", "author": "Betsy W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-20", "description": "I was pretty excited to get some Grimaldi's pizza. It's like that one place you wanted to go for years but never had a chance to. Unfortunately, we were not very impressed with our visit on almost every level from food to service. \n\nFirst, i think the old 'hole in the wall' style establishment suited Grimaldi's image a lot better. Now it just looks more like a regular restaurant. It lost it's old school appeal when you know the old man can kick you out for complaining or causing any problems. Obviously, the desire to have more room and make more money makes absolute sense. We are all humans after all. \n\nMaybe the new locations is still work in progress and they are still trying to figure things out, but the service was just appalling. We were seated on the second floor and there were two eastern european looking waiters (most probably polish guys) serving all the tables. There are some waiters who are exceptionally good at running multiple tables at the same time. These guys definitely did not belong to this group. The wait was ridiculous; the waiter would disappear for long periods of time. He was also helping a family next to us and apparently messed up their order and when they pointed out to him he didn't have the right skills to handle the situation (why argue with the customers?). Our pizzas finally came. One of them was warm, the other one was already getting cold. Both were OK; I bet they would be better if they were hot straight from the oven. My friend who was with us that night, Brooklyn born and raised, suggesting coming and check the place out a few month later and give them another chance. My advice to the owners - make sure your waiters are up to the level of the goodwill of  the place. Will be back some time later to check on you:)", "author": "Namik G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-24", "description": "Fresh, thin, crispy, cheesy pizza is found at Grimaldi's. We worked up an appetite by walking on the Brooklyn Bridge so we were hungry but of course, when we got there, there was a line. It looked short at first and the guy who comes out to let people in, said it was only a 15 minute wait but Hubby knew better. We actually waited for about 30-40 minutes before we were seated. The place is small and the owner/manger who was working the door are very strict who walks in.\n\nWe ordered one small pepperoni which is 16\" $14 and one small white pizza for also $14. I have to tell ya, the first bite and the first slice was delicious. The thin crispiness of the over bricked crust, the fresh tomatoes sauce and mozzarella cheese with the pepperoni was just amazing. I love how it tasted. The white pizza was just as good with the fresh garlicky tastes and the fresh cheeses. Both pizzas also had some fresh basil on it which gave a great compliment to the the pizzas. The cheese was stringy at the first time just as I like it. \n\nI have to emphasize on the first bite/slice because once it gets cool, it doesn't have that wow factor anymore but still good.\n\nThe service was quick and prompt but can't not say they were friendly. \n\nNote: when you are in line, make sure to stay within the rope.", "author": "Jeannie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-07", "description": "-1 star for the wait and the sorta unfriendly attitude of the host. Otherwise, the pizza is really good here.", "author": "Maya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-27", "description": "After years of promising myself I'd make to Grimaldi's, I finally sucked it up and stood in line to wait for my turn at what I've heard from many a source is one of the best pizzas around. After watching the World Cup in the Archway, my friend and I meandered over in the general direction of Grimaldi's and decided to go for it when the line didn't appear as long as usual. It still ended up being a 1/2 hour wait (and it appears that the best number to come with is 4 - plenty of 2-people parties were skipped while we were waiting, including ourselves), but we eventually got ourselves seated in the middle of a table for 8. I didn't care much about sitting with strangers; it's plenty loud enough in the restaurant with people chatting and the music on that you still feel like you have a modicum of privacy in your conversation.\n\nNow, to the food: the pizza's pretty standard; they use a margherita pizza (mozzarella, tomato sauce, and basil) as a base, and you can add toppings from there. We ended up getting half a large pie plain, with the other half having pepperoni. It took a little longer for the pizza to show up, as we came during the 5-7 PM block where they clean out the oven, but once it came out we devoured it pretty quickly. The crust is thin - not as thin as I've had at other places, but thin enough that you don't get stuffed on the crust. You can taste the freshness of the slices of mozzarella that are laid onto the pie, and the tomato sauce and basil round out a very fresh-tasting, very satisfying pizza. The pepperoni was pretty standard; what really makes the pie stand out is the fresh mozzarella that goes on the pizza. I don't think I've had a pie that quite tasted as fresh, even if it's been made fresh right in front of me (like a Fascati's, for example).\n\nPrice is very reasonable - $14 (if I recall) for a plain pie, with additional $1-2 each for various toppings. You definitely want to try and visit at a time when the line isn't too long....when we came out, the line stretched almost down to the pier, so if you come during prime dinner hours, you are going to be starving by the time you make it in. Cash only as well - your plastic won't buy you any love here. This was fantastic pizza and well worth the accolades - and the wait.", "author": "Asuka N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-08", "description": "All right, I'm loyal to my Chicago deep dish, but I have to say that this hands down my favorite thin crust pizza that I have ever had. It is tricky to find, but well worth it!", "author": "Patrick K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-10", "description": "FINALLY did the Grimaldi's and Brooklyn Bridge thing after four years of living in NYC, and I've gotta say I probably won't do it again.\n\nNot to say that the pizza wasn't good, but it definitely wasn't mind-blowing. Our group waited in line for approximately 45minutes on a Monday night (we began waiting around 7:15-ish) before we got our tiny table crammed close to its neighboring tables.\n\nI was surprised to see that the prices are reasonable, since it's such a famous/busy establishment. A small pizza (6slices) is $12, and a large (8slices) is $14; most of the additional toppings were $2 each.\n\nWe ordered a large with mushrooms and sausage, which was just enough to feed our group of three. As I've said, the pizza is good, but not amazing. I do love the gooey cheese though, but overall the pizza was maybe even a little.. bland?\n\nOverall, the whole Grimaldi's thing is probably an experience you have to do at least once in NYC just to be tourist-y. Because of the wait, I personally would probably never go back just to grab pizza, but only to bring out-of-towners or other Grimaldi's virgins.\n\n**CASH ONLY**\n**NO SLICES**", "author": "Alice C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-05", "description": "Greatest pizza in NYC, hands down.  No competition, don't buy reviews from people that jock Lombardi's.  Lombardi's = reproduction, just like your local TGI Friday's.  \n\nBtw - don't expect much more than good pizza here.  The rest of menu and drinks selection is 'meh'.\n\nCrowds suck, though.  big time.", "author": "bo b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-16", "description": "I've been all over NYC searching for the best pie. this place is defiantly at the top o the list it isn't just hype.", "author": "j n."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-01", "description": "I was here last week with my wife. She truly wanted Grimaldis but every time we are in Dumbos the long line never gave me the appetite to wait. So, as a Brooklyn native, I've said why not, let's wait this time to see what the hype is all about. The line went quickly, especially if you are a couple it's a lot easier to get in than with a group. We were seated within 30 mins of waiting outside, not bad. We've ordered a large pie with meatballs topping. It took about 20 minutes to get it but this is expected and not bad of a wait. I've expected something remarkable on my first bite of the pizza, and I was disappointed. I had better pizza in Bay Ridge, Bensonhurst and Gravesend areas. I guess I've wanted for the dough to be thinner and crunchier, not doughy and burnt. It was a good meal just nothing over the top. I'll leave this spot for the tourists. PS. The prices are decent for a Dumbo location.", "author": "I I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-07", "description": "One Word: Yum\n\nI was on a first date last night who took me to Grimaldi's under the Brooklyn Bridge. I've been to the Hoboken, NJ Grimaldi's before, but never the original. \n\nIt was seriously delicious. We ordered a pepperoni pie to go, sprinkled extra cheese and red pepper flakes on top, and took a walk to the river. Sitting and eating the a Grimaldi's pie by the water was a fabulous first date! Loved every minute ... and every bite.", "author": "Beth G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-26", "description": "I have been to Grimaldi's four times and the pizza has been either excellent (twice) or just ok (twice). On excellent days the sauce, cheese and crust are perfect. The crust is very thin but somehow its crunchy on the outside and soft and chewy on the inside. On the ok days the sauce has been bland and the crust has been dry. I would tell my friends to go for the experience, pray for the excellent pie and enjoy the rehabilitated DUMBO pier area and park.", "author": "John C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-29", "description": "awesome pizza. the wait to eat in is long and probably not worth it unless its under 30 minutes. the way to do it is to call in a take out order and pick it up and bring it to brooklyn bridge park across the street and eat it there! you will not regret making a trip to eat this pizza!", "author": "Molly Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-19", "description": "This pizza is awesomely good. Worth the 2-3 hour wait. I recommend it to all. I am not so fond of crusts but this is good!! Not so doughy and the taste wow. Since I turned vegan, I ordered it without cheese and it was still great!", "author": "Canny F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-05", "description": "The line is long, but it moved ok, however I was there on a weekday around 1pm. Lots of tourists in line.  They do not take anything except cash.  The pizza itself was good.  We ordered two small and had a whole pie for leftovers. They are big!  Our waiter was very nice but he was very busy and not very attentive.  One of our pies had a nice crunchy crust, they other did not.  Overall it was good pizza.  Not the greatest I've ever had.", "author": "Bebe D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-06", "description": "Looking for the best NYC pizza? Apparently there is a big debate at which pizza place is better: Lombardi's vs. Grimaldis. After going to both I don't understand the confusion...Lombardi's is way better. \n\nThe service here was HORRIBLE and the atmosphere stunk. The pizza was okay. If you do go stick to the peperoni. But better yet, just go to Lombardi's in SOHO. It's way better in every way.", "author": "Lindsay K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-27", "description": "I would like to preface this review by commenting on the obvious; this is my first review. I was inspired to actually post a review because of a recent visit to this once glorious institution. I would also like to mention that I live to eat, eating, exploring new restaurants, and bars is probably my favorite thing to do. I use yelp on a weekly basis because I find that it is perhaps the most accurate barometer of the overall experience. If you see a restaurant with 4 1/2 stars and 100+ reviews, especially if its in Greenpoint, Williamsburg, or Astoria there is a good chance the food is going to be pretty awesome. \n\nNow on to what used to be my favorite slice in Brooklyn besides L\u0026B (which doesn't count because that belongs in a different category altogether). I haven't been here in about a year and a half, and yeah I remember it wasn't the same as the old spot down the block, but the pizza almost made me cry. The dough was soggy, the cheese was cold, and it just tasted bad. I live in Staten Island, and quite frankly I could have gotten a better slice from any pizza joint on my crappy island. I remember the first time I waited an hour and a half to get a pie from Grimaldi's; which I really hate to do for any restaurant. My eyes rolled into the back of my head, I heard angels sing, it was a feat to respect; and now Grimaldi's is dead! Juliana is rolling in her grave because her son's life work, and their family name is attached to that tourist trap, commercialized, abomination of a once great beacon of Brooklyn food glory. OH, and to top off my horrid experience once my wife and I finished our soggy pizza-like atrocity, I went and sat down on the second floor bench while I waited for my wife to use the restroom. As I wait for her, a family came up the stairs with who I assume is the new owner, and he says to me, \" are you finished, because I need the bench\". I said sure and got up. And then he proceeded to point the family over to the bench so that they could have a seat. Thanks buddy! I guess now that I paid my check, I no longer need to be comfortable. The service, food, and overall feel of what used to be my favorite pizza joint is horrendous. As someone who was born and raised in Brooklyn, it almost makes me ashamed to think of this place with the admiration that I used to. I think this just about sums up my first review, and I think it's pretty simple to see where the inspiration comes from. I hope Grimaldi's lost liqueur license expedites it demise, but if serving alcohol to minors didn't its crappy service, food, and atmosphere will soon enough.", "author": "Michael K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-11", "description": "I didn't know what to expect from all the hype Grimaldi's has been receiving, but I had to go with hype because it was really good.\nThe best part of Grimaldi's pizza was the fresh toppings. The pepperoni we had on our pie tasted very gourmet-ish and the sun dried tomatoes and sweet peppers were soooo flavorful. Although, for a brick oven pizza I was really expecting the crust on the bottom to be more crunchy. I guess the tomato sauce made it kinda soggy. \n\nAs for the line...yes it was long...but make sure you have friends to stand in line for you while you look for parking ;)", "author": "Mallory P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-29", "description": "A long wait that's well worth it. Delish! And a Brooklyn institution.", "author": "Mandi O."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}