{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-09", "description": "I had heard such amazing reviews about this place - almost like it was a bucket-list item. So I went with such great expectations and eagerly joined the line behind 20 other equally eager diners. My friend and I wanted to find out how long the average wait is and he approached the guy at the door. He was pretty brusque and gave us a 45-minute figure. Alright, not a problem. Amazing, out-of-the-world pizza inside! \n\n40 minutes passed and we were duly seated upstairs. As I walked in, I was surprised because several tables were free. Once seated, it took forever for the waiter to attend to us and that became the trend for the evening. And the staff were so indifferent and unhelpful that it ruined the evening for me. I wonder if it marred my taste bud judgement, but the pizza was really a disappointment. (Note: I'm vegetarian). Or maybe the deciding factor is your predisposition towards the baked/ charred flavor. The only saving grace for me was the Coney Island cream soda. \n\nBut after all the hype and excitement and expectation, the soda couldn't save the day - not even close!", "author": "Surabhi V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-09", "description": "I live in NY and have always avoided coming here because I heard how awful the lines were.  I don't care how good anything is, I am not waiting on a line for over an hour.\n\nWith that being said, I finally went with a visiting friend in January.  The lines were OK, still out the door, but I only needed to wait about 15 minutes.\n\nI was so excited because I heard how amazing this pizza was...unfortunately, the pizza was not nearly as good as I was lead on to believe.  The pizza was good, but not crispy (soggy actually).  The toppings were OK, but nothing special.  I am so happy I didn't wait online for over an hour because I would have been very pissed.\n\nI think at some point this place was awesome, but perhaps the more famous it got the more it compromised itself.  The problem is, the myth of this place is so powerful and ingrained in NYC folklore that perhaps it added to the taste like a seasoning would.\n\nI wouldn't stop anyone from trying this place, but I'd at least try to lower their expectations.  At least that way, they can decide if it's worth the line.", "author": "John S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-30", "description": "Wait time is atrocious. I went here by myself and never got called after an hour of waiting in line. The owner, Ernie, just kept asking for parties of 3+. I ended up just ordering a small pizza to go. I don't care how good the pizza is if you can never get to it.", "author": "David K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-16", "description": "LEGIT. luckily we didnt have to wait in line as it rained today AND we went rite after the lunch and before the dinner rush. pizza came out real quick. the combination of the light crisp dough, fresh tomato marinara sauce, and the oozing mozarella cheese is what makes their pizza a winner. \n\nive never been here until today and heard about this place for years. i can honestly say ppl are NOT bs-ing when they say this place is indeed worth the wait and the walk across brooklyn bridge. i loved it so much, we took an entire pie home. for a girl who watches her figure, i can say that i DID NOT feel guilty giving into the extra slice as the fresh ingredients made the pizza taste somewhat healthy - if that makes any sense. \n\nas cali governator says...ILL BE BACK!", "author": "Michelle K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-21", "description": "pizza in new york on a sunday afternoon? YES!\n\nthe wait was long, but not RIDICULOUSLY long. mind you, it WAS only 4:30pm when we got in line. we were inside by 5:30, though it seemed like the line didn't move for a good 30 minutes or so. when we did get inside, there were many empty tables and it was quiet and tame compared to the bustling crowd outside. hm. i wonder why. maybe they wanted to keep it nice and peaceful inside, which was honestly cool. but really? make all those people outside wait pointlessly long?\n\nmy sister and i got a large regular pizza with pepperoni, italian sausage and fresh garlic (we finished the entire thing). our pizza was goooooood. the mozzarella was nice and fresh and there wasn't too much cheese or sauce to the point where it was heavy. the pizza ingredients were balanced really well, without there being too much of anything. it was a bit salty, but i'm guessing it's because of the pepperoni. the garlic added a nice kick. the crust was thin but not TOO thin. it wasn't as crispy as i would have liked though the bottom was BURNT. that's probably the worst thing about the whole experience -- not even the long line but the BURNT CRUST. normally i will eat every single bit of my crust, but in this case, the bottom was so burnt that it was black, charred and inedible. sigh. i should be giving this place 3 stars because of this, but i enjoyed my pizza so much i'll still give it 4 stars! worth a try if you're in the area and have some time to spare :) though i wish i had also tried lombardi's!", "author": "Beatriz U."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-20", "description": "I was a frequent patron of Grimaldi's Pizza. returned recently with 4 friends and was extremely disappointed. The pizza and quality ingredients have gone way down hill. There was barely any tomato sauce on the pizza , like maybe half a teaspoon on a large pie. The cheese was not fresh mozzarella but cheap packaged mozzarella cheese and way too much of it on the pie, as well as way too much low,grade parmesan cheese which made the pizza too salty.The crust was mediocre. i get better crust and pizza at my local slice stand. By the way Grimaldis does not  serve beer or wine since they do not have a license. I am really sorry to report this. it was a beloved place to me and now has turned into a tourist trap living on it's past great reputation. I do want to mention the server was very friendly and efficient.\n\nPlease don't review this business if you received a freebie for writing this review, or if you're connected in any way to the owner or employees.", "author": "Endecott P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-22", "description": "I'm not a huge pizza critic but I enjoyed the thin crust. I came here with some of my friends from Egypt who wanted to taste American style pizza.\n\nEven though they got my order wrong, the service was prompt. The pizza full of flavor and not too heavy.", "author": "Oliver S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-23", "description": "I've been coming here since I've known what pizza is.\nI was here tonight, for the first time since they moved locations.\n\nThe new space is huge, and really nice- i like the addition of tv screens all over, i dont think the last location had that.\n\nthe pizza is still amazing, thanks to their coal burning over -  though service seemed a little slower given all the extra space. i tried the calzone tonight for the first time- the small is huge, and filled with delicious ricotta and melted mozzarella. In the spirit of the warm weather, the brooklyn ice cream factory is up by the pier and makes for an amazing dessert.\n\nI dont come here as often as the other brooklyn pizzerias (l\u0026b, totonnos, and difara) because they're closer, and honestly this piace doesnt crack my top 3.", "author": "Harlan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "Did a loooong line but it moved quickly. Pizza was very good. Fresh simple ingredients and a very friendly staff. Ordered a small sausage and onion pie and a small mushromm, garlic amd basil. Both pizzas were great and dessert did not dissappoint. We had a cannoli and amaretto nut babies, incredible! \n\nIm not a pizza guy but Grimaldis is up there with the best Ive tried.", "author": "Esteban P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-12", "description": "Had a small jalapeño and sausage pizza between the two of us in our party. The mozzarella was not too gooey but still delicious. We were satisfied with the large size of the pizza (despite ordering a small) and it certainly tasted great. Our waiter never made eye contact and seemed standoffish. However, one of the other busboys/waiters packaged my leftovers and was better. Also the toilet seat in the women's bathroom was broken and one of the lights was out. A bit surprising given the notoriety of this establishment. Nevertheless, we found the pizza to be tasty and there is no line on one of the coldest days of the year to date!", "author": "Antonia I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-15", "description": "It was okay. Nothing special but the history and the name makes it worth going. The staff was nice which I was surprised by, but the service was slow.", "author": "Bill J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-19", "description": "NYC FOODAPOLOOZA STOP #21\nthis was reg's choice of best pizza in nyc (i already declared mine). i can definitely see the appeal because the actual slices of mozzarella took this pizza to a whole other level. again, the ingredients were high quality and it was definitely one of the best i've ever had. so, why did it get 2nd place in my book? the crust...as soft as it was, the one from bleecker street was my preference. grimaldi's is more of a thin crust, which i like, but i prefer fluff in the center, i guess. like i said, conduct your own taste test and see for yourself.", "author": "Marjie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-21", "description": "Grimaldi's has now moved to 1 Front St.  It's literally right next door, but I thought I would point this out for people coming up from the bottom of the hill.  \n\nOpening night at new locations hardly ever work out perfectly and Grimaldi's was no exception.  I have never been around so many angry cutomers at a restaurant my entire life.  First of all, I think Grimaldi's new spot is about twice the size of the old spot, yet the oven is still the same size as it was at the smaller location.  Next, I'm not sure if the workers are supposed to be somewhat rude on purpose (for ambiance?) or they really just do not like their job.  We lucked out and arrived as they were cleaning the ovens and knew that there was going to be an extra long wait for our pizzas (they say it on the menu).  But we definitely did not expect to spend a total of 3.5 hours at the restaurant.  1 hour in the freezing cold to get seated, another hour and a half for our food and about an hour to eat and pay our bill.  Pretty much filled up our entire night.  \n\nOn the way out, I noticed that the oven can handle about 4 pizzas, so let's do some math here.  There are maybe about 30 or so tables in this place.  Every table orders about 2 pies.  So 60 pizzas.  Every batch in the oven takes about 15-20 minutes.  So when you have a 45 min window where you are taking orders from seated guests and no pies coming out, you have pretty much put yourself in a pretty big f'ing hole.  If you want a barometer on how long we waited, the 3 of us pretty much fell asleep while waiting for our food.  Waiting about an hour in 25 degree weather will drain you more than you can imagine.  \n\nOnto the pies.  They were very, very good.  We ordered one plain and one pepperoni and my only complaint is that I wish they had a little bit more sauce on them.  I was going to ask for a side of sauce but seeing how service was that night, I probably wouldn't have gotten it until after our pies were either finished or cold.  \n\nSo why the 4 stars.  The 4 stars is based on the pizza alone.  It is really very good and wins in my taste test versus Lombardi's.  The service could use some work but I understand that it was opening night, so I'll give them the benefit of the doubt.  However, they should consider adding another oven, offering take out orders (and not hanging up on people after saying NO), and let people enjoy their experience.  Being a pizza junkie, I wanted a picture of the oven and instead I got a picture of some guy waving his hand in my face instead.  \n\nWould I come back to this place, probably not.  The pizza is very good, but time is money, and the time invested here just doesn't justify the pizza.", "author": "JP T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "We came here about four in the afternoon, which is a good time, because we didn't have to wait in a long line. I like the white pizza most!!! It's really good.", "author": "Peggy Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-26", "description": "This is one of the 2 best pizzas I've ever had in my life. The actual place under the Brooklyn bridge is not very customer friendly but they have franchisees throughout the country that have the same pizza profile and are more service oriented.", "author": "Roman G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-03", "description": "Kudos to Grimaldi's for building such a strong brand and presence in NYC tour guide books - clearly the only reasons there's ALWAYS a line out the door (I should know - I live a couple of blocks away.)\nUsed to be a huge fan and have watched in horror as the sad thing that happens to most culinary successes in this city happened - a complete slide downhill.\nThis pizza truly does NOT taste good anymore by any objective standard. I gave 2 stars instead of 1 because takeaway takes 10-15 minutes despite the lines. I'll gladly take advantage of the speed again when the product gets better!", "author": "Ron R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-02", "description": "As we stood out in the cold with the other 50 some people, we wondered if the wait would be worth it. As we waited patiently I noticed the door man looked like an old school mobster with his fedora, sharp suit and long black wool coat. \n\nFast forward 45 min. later to us finally walking into this magical pie heaven. We sat, we ordered we waited about 15 min. and then our glorious pie was presented in front of us. Steaming with melted mozzarella and crispy pepperoni. Our eyes lit up and soon our stomachs expanded. So I ask myself was it worth the wait? I would have waited longer.\n\nOur server, decor and music was classic. By far the best pizza I've ever eaten. This entire experience was definitely one of the highlights of our trip.", "author": "Kelly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-08", "description": "Came here spring break of 2006 and it was on our list of places to hit up again. We came here on a Monday around noon and there was a line outside, but we only waited about 15 minutes. The pizza is pretty awesome - it tastes fresh and it's a perfect balance of topping to crust. We ordered half mushroom/garlic, and half mushroom/pepperoni/olive.\n\nThe meat eaters thought the pepperoni was really good - it is cut thicker than your pizza hut pepperoni. The one draw back were the olives - they were your \"real\" olives, but they were SUPER salty. SUPER. The olive lover in our group was not especially pleased and a lot of the olives ended up being picked off.\n\nWe ordered a large pizza which fed four of us just fine, as we were planning to graze throughout the day.", "author": "Christina K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-22", "description": "Real fresh and not heavy. The pizza was surprisingly great.", "author": "Tami T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-12", "description": "My friends and I completed a four pizzeria bike tour in Brooklyn this past summer.  We met under the Brooklyn Bridge at Grimaldis, and then rode our bikes to Di Fara, Totonnos, and then L \u0026 B Spumoni Gardens.  Grimaldi's was the first stop, and it did not disappoint. \n\nI have heard from a lot of people that Grimaldi's is overrated and not worth the wait.  I disagree.  I think its reputation as a solid choice for NY to pizza is an accurate one, and I enjoyed the plain pie I had from the shop.  The line was a bit long, but it moved quickly.  I tried to call in my to-go order (which I know you can secretly do), but they did not pick up the phone. All in all, it took under an hour to get the pizza.  \n\nWhat I liked about the pie was the quality of the cheese, the ratio of sauce to cheese, and the crust--it was cripsy but not overdone.  \n\nI think tourists should make the journey and locals should continue to eat it, at least until Juliana's opens next door...", "author": "Ian A."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}