{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-29", "description": "Maybe this place used to be good... Fooled me.  Waiters couldn't care less about you.  Calzones all ricotta... Long wait time.  Cash only.  Don't bother", "author": "Zachary T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-11", "description": "I don't think this review will be much for anyone who reads this. I've been there twice, the service is absolutely terrible. Since this is a potentially mafia owned place, I don't think they give a damn about serving people, the waiters were rather standing chitchatting. For sake of the taste of the pizza, I'm so generously offer a two star", "author": "H. Huxley L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-15", "description": "MY MOST FAVORITE PIZZA EVAR!!!\n\nMy friends and family have called me a traitor because I'm supposed to have an allegiance to Chicago-style deep dish (anyway, deep dish was invented by some guy from TEXAS!)...this pizza perfection is achieved using a coal brick oven, turning the dough into a great balance of tension between chewiness and slightly charred crunch. (But I must admit that the last time I went was a little *too* chewy and gave me a sore jaw the next day). You can see them assembling the pies in plain view, using the simplest but most delicious ingredients - fresh buffalo mozzarella, basil, and a balanced tomato sauce. Their sausage is also excellent - tasting exactly how Italian sausage is supposed to taste like, complete with caraway seeds. Sublime simplicity!\n\nPlan your trip accordingly because the wait can be really crazy, in addition to the 20 or so minutes cooking time. Last time I went was a Saturday night around 8 pm and we waited about an hour in line. I've also been many times during the week and mid-day when I have had little to no wait.  If you're going to have a large party, expect longer waits. Oh and it's cash only, though there's an ATM inside the restaurant. Don't forget to hit up the Brooklyn Ice Cream Factory after your meal!\n\nIt's always nice to have a quality pizza experience without the need to slip into stretchy pants afterwards. Sorry, Chicago. You are the Second City, once again.", "author": "Steph P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-11", "description": "What we ate: Large pizza with ricotta\n\nMy mom was in town for the first time in a couple of years and wanted to revisit her favorite pizza place from her prior visit - Grimaldis. Now I love some Grimaldis but after standing in line for about an hour a few years ago in below freezing weather I had sworn off the Brooklyn location, especially during peak hours. Plus with the new one opened much more conveniently in Chelsea why trek out to Brooklyn if I don't have to (sorry BK fans). But can a girl will do when her mom is in town and wants the same one she had before... so off to Brooklyn we went. \n\nWe arrived around 8 pm on a Saturday night (did I mention I especially want to avoid peak hours...) and joined the expected line trailed down the street towards the water front. As we had come from the east river ferry, we were perplexed to find several minutes later that the line went straight past the entrance we expected and curved around the street corner up ahead. Only then did we see that the original location of Grimaldis was boarded up and had newspaper clippings explaining the current ownership situation. I wont bore you with the details here but it is an interesting story of 2 talented pizza makers and 1 location. Short version is that the Grimaldis my mom had visited a few years before had now moved to a new store front just 1 spot up the road.\n\nThe new location was much more modern and spacious. It has 2 levels with high ceilings plus bar seating so there is a lot more room to sit and move around. They had music in the background, the servers seemed a bit more friendly (though it could also be my time in NYC has gotten me more used to gruff service), and the general atmosphere was more relaxed than before. \n\nThough there were 3 of us, no one was particularly hungry so we settled on 1 large pizza to share. I am a big fan of ricotta cheese on pizza but I don't like it at many places - Grimaldis happens to be my favorite though. So for my sake and the sake of simple ordering we got a large traditional pie with ricotta cheese. It came pretty quickly and was almost just like the pies at the prior Grimaldis. The only difference I noticed was that the crust wasn't a charred as before, and I have to say I actually prefer a little less char and a little more chew to my crust. So I was pleased! \n\nIs it still worth the hour long wait in a line outside, probably. Will I try to new/original pizza join that will be re/opening in the recent grimaldis store front, probably. Will I still visit the grimaldis in Chelsea before trekking to Brooklyn unless someone very special makes a special request, definitely. Either way ill be back at grimaldis for more ricotta pizza soon.", "author": "Christina H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "Best pizza in NY. Thin crust and you can eat a whole pie and not feel full.", "author": "Domenic B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-21", "description": "When I arrived, the line outside did seem a bit too long for my taste. However, within 15-20 minutes, the line began moving pretty fast. So with a party of 4, we were seated in about 30-45 minutes.\n\nInside, it was standard fare. We sat down, and immediately knew what we wanted (two plain cheese pizzas). \n\nThey were brought out pretty quickly, and the service was good.\n\nNow to the pizza....I think the main problem was that I had incredibly high expectations for the pizza here. That's not to say it was bad, because it wasn't, the pizza was delicious. I was just expecting something out of this world.\n\nIt's also worth noting that the prices were perfectly reasonable, I was impressed by this.\n\nOverall, I would have no problem returning here with someone for their first time. However, I can find pizza in Manhattan that is plenty delicious, but without the wait involved.", "author": "Jerry M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-25", "description": "I'm not one to bash places or be completely negative but after hearing all the wonderful things about this place, I was dumbfounded.\n\n I kept hearing about this \"place under the brooklyn bridge\" that supposedly had the BEST pizza in NYC. My friend and I ventured all the way to NYC for a day trip and resolved to get us some Grimaldi's. I'm a loyal Lombardi's lover and I only eat Pizza when I'm in NYC and I only eat Lombardi's... until this particular day.\n\nWe waited in a line like elementary school kids as some cranky older italian guy picked people at random by pairs or in strange numbers, splitting parties up, adding strangers together etc... My friend and I were about 3/4 to the door from the back of the line up, he pointed at us and some girl who was by herself and rushed us in, had us sit down together as we were telling him we were not a trio. He finally listened, snapped his fingers at my friend and literally said \"C'mahn, whattya doin'?\" as he angrily trudged us up the stairs, sat us, tossed menus at us and walked away. Right away we were put off. So, the waiter comes over after about 15 minutes, we order a regular margarita pizza. The pizza comes and I kid you not, I've had better at papa johns on a decent night. The cheese was tough and tasteless, like they melted those nasty craft mozzarella cheese sticks on the pizza, the sauce was overly sweet and the crust and dough was chewy. We each ate 2 slices and decided to give the rest to the first homeless person we saw (which we later decided against as that would have been cruel). The waiter never checked on us not even once after giving us the pizza. So after 25 or so minutes of looking at our terrible pizza, we flagged another waiter down, got the check and booked. \n\n Terrible service, terrible food. Don't do it.", "author": "Paul S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-01-31", "description": "Pretty much the only reason I head into Brooklyn is to take people to try the pizza at this place. Thin crust, lots of cheese (even a couple freshies of mozzarella thrown in for good measure), fresh basil scattered all over (so precious these leaves) and tasty toppings. \n\nA large pie would feed 3 ladies pretty nicely, averaging at 2.6 slices per person. For 2 hungry growing gentlemen, they might manage a large themselves at 4 slices/dude. A double date would probably require two small pies, or a large and a small, depending on how hungry everyone is... or if they have plans to grab ice cream the nearby Brooklyn Ice Cream Factory. \n\nUsually pretty crowded so try to come during the off hours. Very much an eat and leave spot. So good though...mmm....", "author": "Pam S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-05", "description": "I'm a pizza fanatic. It's all fresh and ingredients good. Just didn't have any flavor on the regular pie which is the only thing I am judging. Completely tasteless. Didn't stop me from eating 4 slices. Just didn't compare to let's say difaras", "author": "douglas h."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-01", "description": "I've read about it, seen plenty of reviews about it and seen the long ass lines as I've passed it by. Now I'm wondering, really, why?? I have been to countless pizza shops, with less clout, that blew the doors off this place. If the reviews weren't for the food then I don't know what, there wasn't anything else unique about it. I had gotten a small  regular pie, nothing special, but still... Don't understand why this place is so popular, I certainly wasn't wowwed.", "author": "David C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-09", "description": "It's not the same anymore! :(\n\nI've eaten here plenty of times - when friends come to town, or a random weekday coming home from work.  The last time I was there was before the move.  I took my parents to the old location and man, the pizza was pretty good.  Not John's good, but pretty good!  I'd say 4 out of 5 stars for pretty good pizza on a (late) Friday night.  Service was fast and the servers were very friendly.\n\nFast forward to the move to the new location on 1 Front Street.  They moved virtually next door to the old bank/bar on the corner.  There was a small line.  No problem!  There's always a line.  Gotta wait for a seat, right?  Wrong!  We were put upstairs where there were, I kid you not, 6 tables open.  Maybe they were short-staffed upstairs?  Nope.  It took the server 15 minutes to acknowledge we were there.  Yes, I timed 15 minutes! :(\n\nOk, maybe the service dropped off the face of the planet but the pizza made the restaurant, right?  I wish... like I said before, it's not the same.  Cue sad face. :( The pizza didn't have the crispness or the taste of the previous location.\n\nThe combination of the wait for no reason, the slow service and the different pizza cannot justify another visit to this new Grimaldi's.  Someone turn back time and give me the old pizzeria!", "author": "Jeremy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-10", "description": "\"In Napoli where love is king...\nWhen boy meets girl here's what they say:\n\nWhen the moon hits your eye like a big pizza pie\nThat's amore!!!!\"\n\nI am not going to lie....before I went to NYC for the first time in my life a few weeks ago I had about six separate people all tell me, \"Sarah, you have to go to Grimaldi's under the Brooklyn Bridge!!! IT IS THE BEST PIZZA EVER!!!\" Being this hyped up, my boyfriend and I had to go, so after a long long trek from the staten island ferry, across the brooklyn bridge and then finally to Grimaldi's we were quite hungry and tired and only arrived to a LONG LINE outside of the place!!\n\nMan o man were we sad to see that line, but we said hey, we walked all this way we owe it to ourselves so we stood in line.....tables of 4 got seated before tables of 2 which made us sad....but one hour later (YES WE WAITED AN HOUR JUST TO BE SEATED FOR PIZZA!!!!) we finally got our table and ordered a pizza and beer to celebrate.\n\nWhat toppings did we get? Well first, let me tell you we, being me and my boyfriend, two people total finished a large pizza on our own pretty easily, partially because of how incredibly tasty and fresh the pizza was, and partially because it is a thin crust pizza so you don't get as full from all of the crust. Our pizza galore was covered with cheese, capers, garlic and the sweet red peppers. Had we known there was powdered garlic on our table we would have gotten olives instead or onions, but oh well!!! There wasn't that much garlic on our pizza but it still tasted amazingly!!!!! And the capers and sweet red peppers (which we paid extra for) were to die for!!!! \n\nAnd to top off our experience, the power went out while we were there!! But all of the waiters said, \"Don't worry we can still make pizzas because they are baked in the oven naturally!!!\" And then everyone continued to devour their pizzas in the dark!! Which only proves how amazing this pizza truly is, even if it is cash only.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-16", "description": "Okay, I want to start off that this place deserves a 5-star review on the pizza alone.  However our server mistakenly rang up our order as a \"to-go,\" leaving us questioning where our pie was 30 minutes after having sat down. And after the looong wait, and me being starving, and them only giving us a sorry, I had to knock off one star. I will say that they did get the new pizza out within 10 minutes of having recognized their mistake. But with my husband being a restaurant manager, I've learned to expect a little more than just a \"sorry\" after a pretty big goof. But they've got people waiting in line for them, most of them tourists like us. So I imagine only a sorry is sufficient for them.\n\nHere's the deal:\n\n- The wait is long. I think it's worth it. If you don't like lines just to be seated, then don't come here. \n- It's a hole in the wall joint in Brooklyn steps from the bridge. If you expect upscale bathrooms, you'll be sorely underwhelmed.\n- This place is a machine. They take your order, pizza is (in our case, should have been) ready in about 10-15 minutes, you eat, you're out. (Keep in mind, there's some other person waiting for the pizza.  Don't just sit there and act like a schmuck for hours.)\n- This isn't Domino's or Pizza Hut. So don't come here looking for a 3 for $15 special. Is it a little pricier than what I'm used to? Absolutely.  But is it worth it? H-ll yes!!\n\nThis is one of the best NY style pizzas I've ever had, with the exception of Village Pizza here in LA. The bread is good, the sauce is alright--not too powerful to overwhelm the pizza, but enough flavor to get the right taste. The pepperoni and mushrooms were fresh and perfect. The mozzarella wasn't loaded on the pizza, but covered just the right amount. I think the toppings individually aren't much to brag about. But when they come together in the pie, they work their magic on your taste buds.\n\nWhen I visit NY again, I will be back. \n\nN.B. I have never tried Lombardi's. So I can't compare the two.", "author": "Danielle G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-19", "description": "For a girl who generally doesn't \"do\" lines, I sure waited in lots of them on my last trip to NYC.  And I have to say, I think waiting in line at Grimaldi's was worth it.  It definitely helped that I waited with three of my favorite people and yes, it helped that it was one of the most beautiful evenings in a while... it even helped that the sassy Italian man seating folks provided entertainment by yelling at patrons with their heads up their rears (\"How many d'ya have?  D'ya want pizza or not?  Get in here, then!\").  Time flies when you're having fun.\n\nThe four of us shared a large pie with basil, garlic and roasted red peppers.  I'm used to waiting (and waiting) for freshly made pizzas, but I guess the places I visit usually don't have a coal-fired inferno at the ready for their pies.  Food and drinks came out quickly, pizza was savored and devoured (2 wonderful slices each) and we made it outta there for about $10 per person.  A steal for the taste and the experience.\n\nI wanted to get some dessert to fuel our walk home on the Brooklyn Bridge, but nobody wanted to erase the taste of that pizza from our mouths.  Just as well.  Plenty of Mister Softee across the bridge.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-03", "description": "Read reviews and decided to give it a go.  Went on Tuesday lunch only had 5 min wait.  We ordered a large Pizza with Pepperoni  and anchovies - which is way more than the two of us could handle. \n\nThe Pizza base was very nice  - however as many people have all ready stated if this the best then NYC then it is sad state of affairs for the Pizza.\n\n\nThis place is living on some reputation which it does not deserve. The rudeness and surliness of the staff is totally unacceptable and even if I was in the area would not return, which is sad as the Pizza is OK (but not bow down and worship as some reviewers would state ) . In these times of financial hardship I would rather give my custom to someone who appreciates my business and  not a restaurant which is riding  on the coat tails of a Travel program and does give a damn about the customers (after all why should they care - with their long lines every day ) from all of us stupid enough to try", "author": "Phil W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-06", "description": "Went in September with my good friend from upstate, her sister, and husband. Waited about 45min which was expected. We got one pie w/garlic, onions, and mushrooms. The other with sausage and pepperoni. Yummy, the meat one was my fav! Delish. Just go, trust me it's worth the trip. A lot of ppl take the pie to go during the summer and eat in the park nearby. We dined in and didn't feel rushed while there like some one else mentioned. Decent service, nothing to complain about. I went to Roberta's before this and the difference I would say is variety at Roberta's. They have more unique pies there where as in Grimaldi's, bacon isn't even an option as a topping. lol. Still good though! Just think more traditional in terms of what you get.", "author": "Christine P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-30", "description": "After waiting for nearly an hour on a Saturday evening, it started pouring but good thing my friend brought an umbrella beforehand from a nearby gift shop. Hoping lines would get shorter after the rain, unfortunately, it didn't. Boo! I thought it must definitely be worth it. To my disappointment, this place was not what I expected. Living in NYC my entire life, I felt like this was just something simple. I could have definitely gotten better pizza elsewhere.\n\nOverall, this is definitely a \"must go to tourist spot.\" Prices were decent and the restaurant itself was large and roomy.", "author": "Sally M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-11", "description": "Yes, I am very late to try Grimaldi's, sorry jeez! I've heard many mixed reviews about this place, which is why I have been so hesitant to try it.  On top of that, every time I'm around the DUMBO area the weather is warm and everyone is hopping on the ridiculous line and I'm not the type to wait 2 hours for a slice of pizza.  So fortunately for me I didn't have to wait because the weather was cold.  To my surprise, their pizza was pleasantly delightful. I think the rich flavor of the tomato sauce beats Lombardi's any day. I would definitely come back, but only if there isn't a wait.  Do I need to keep emphasizing that? lol", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "Wow! Great New York thin crust, crispy pizza. Nothing special or gimmicky. Just good food and kind service.  Had nothing but pizza. It was excellent! Stood in line for 35 minutes. Well worth the wait!!  Line was long and moved quickly.", "author": "Virginia H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-18", "description": "We had to try this pizza that everyone has been raving about. We expected long lines so we got there an hour 1/2 before they opened on a Saturday, weren't even the first in line. Right as the doors opened a foodie tour bus pulled up and got VIP treatment right through the door. ( have to find that tour ) we just made it in the door thank goodness but I felt for the other not so lucky folks that were just behind us waiting almost as long. (It was at the old location) which was much smaller. But lucky you you'll still get to wait in line at the new place too.\nThe pizza is cooked in their famous brick ovens. You can smell the delicious aroma from outside. We ordered and within minutes had our 2 pizza pies out on the table. Rumor is they never shut down the ovens. I think the cheese pie is classic and the way to go. My husband had both pepperoni and the cheese slices and thought they were equally perfect. \nIt's a must try pizza place even if it is just for the experience.", "author": "Tracey F."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}