{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-07", "description": "I've heard a lot of good things about this place and it came recommended. I usually see a long line outside of this place too. I went there on a Saturday in the afternoon. I'm thinking that perhaps they had an off day. In any case, I wasn't impressed. The pizza was overpriced and oily. It actually hurt my stomach after eating it so I won't be back. They have nothing on Di Fara. Sorry.", "author": "tanichea b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-23", "description": "Enjoyed pizza very much and wasn't even hungry.  Is it the best ever?  Can't really answer that yet.  If you are coming from Minneapolis, then yes, definitely.  Be careful with that bathroom lock though if you don't want me walking in on you, or maybe you do?", "author": "Surly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-02", "description": "I originally went to Grimaldi's as a tourist back in 2005...and it stole my heart...this is seriously the best pizza I've ever had, period. I no longer live in NYC, but when i come visit, I always have to make sure I make time to come here at least once. There is nothing like it anywhere in the world and it's worth the wait. Actually the line typically moves fairly fast, and it's always a good idea to hit up the Brooklyn ice cream factory at the end of the street.", "author": "George M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-24", "description": "If you're open to something a bit different than your typical NYC style pizza then this  place is totally worth it! It's one of my faves (next to Lombardis and My little pizzeria and Mi Famiglia). The fresh mozzarella , the basil, and yummy sauce on thin crust is delicious. Not too pricey either,  it's about the same  price range as any other pie would be in NYC. The long  line waiting is worth it. I always find it a wonderful treat to eat at Grimaldis :)", "author": "Erin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-13", "description": "Let me start by saying this is the first time I waited in line for a pizza, moreover this restaurant was cash only so we planed ahead to carried appropriate amount to cash. And was it worth the wait, we orderd large pizza with garlic, tomatoes, jalapeño and onion and it was easily the best pizza I ever had, though this place is super crowded all the time service was pretty good. If you live/visiting nyc area you should visit this place.", "author": "Amit D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-18", "description": "This is by far the best pizza I've had since I've lived in Manhattan.  Very rarely do I venture outside of Manhattan to eat, and this place is well worth the 40-minute commute from the Upper East Side.\n\nI do not go on sunny summer days though - doing so is a rookie mistake as the line snakes the whole way around the block.  You'll go hungry waiting in this line.\n\nInstead, I go on a cold rainy day where the wait is less than 10 minutes.  I went yesterday (a cold and rainy Sunday) with a group of 5 people, and we were seated within 15 minutes.  \n\nWe ordered two pizzas, a few drinks, and a beer, and the total was a very reasonable $50 (with tip).  Our food came out VERY fast, and it seemed like there were more waitstaff than patrons.\n\nThe owner/manager came by when our check came and checked in personally to make sure everything was OK.  He did this to every single table!  Not a bad gesture for a tiny pizza shop.\n\nI docked this place a star for two reasons:\n(1) You really can't go unless it's a dreary day otherwise you'll spend half of your afternoon waiting in a line.  For pizza.\n(2) The dining area is VERY cramped, and waitstaff has to move tables around constantly to get people seated on the other sides of the tables.  It's a bit annoying when you're dining and the waitstaff is moving tables around and people's asses are hovering over your fresh pizza.\n\nIf, for whatever reason you're dying for pizza on a hot summer day, do this:\n1.  Go visit the Brooklyn Flea\n2.  Before you go to the Flea Market, call and order a pie from Grimaldis.\n3.  When you're done at the Flea, head over to Grimaldi's, get your pizza to go, and sit across from the Flea Market on the curb and eat your pizza.  You'll spare yourself the wait in that line.", "author": "Allan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-01", "description": "After reading all the hype, we walked over to Grimaldi's and waited outside in the fairly long line (around 8pm) until we were seated. The pizza was definitely unique from everything I've ever tried before (I'm a big pizza fan). It wasn't mind blowing but it was definitely a very delicious pizza and a unique taste. Worth the wait if you have the time and warm clothes.", "author": "Abtin A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-24", "description": "Super yummy busy but the wait totally kills it! It was a 3 hour wait!! The staff was great however i wouldn't not wait that long again. Prices are very reasonable and food was delicious. I love ranch with pizza and they have no ranch, bummer!", "author": "L D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-12-05", "description": "Back when this place was Patsy's, my mind was blown...it was incredible. A gang of my sister's friends walked across brooklyn bridge and over to this place on an early fall evening. We hunkered down for some of the best pizza I had ever had, up to that point in my life.\n\nFlash forward to today. It is Grimaldi's. The lines stretch out the door and the place moves people through like a well oiled machine. Our pizza was good, but for some reason the crust was soggy and it wasn't what I had remembered. Or maybe I've experienced better pizza since then. Who's to say?", "author": "Lindley E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-28", "description": "Extremely (if not excessively) long lines for this popular pizza place seem to be the norm rather then the exception. I was treated to the same pleasure when I visited.\n\nWas the wait worth it? I would say, so so. The piping hot mozzarella was absolutely delicious on our pizzas. However, once the pizza cooled down (and it cooled down pretty fast), it was mediocre. It's not that the pizza was bad, it just isn't what it's hyped up to be. Nor is it really worth the one hour wait.\n\nNevertheless, it was worth the visit just to say that one has visited the most popular pizza destination in NYC.", "author": "Camille K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-17", "description": "After seeing the ratings, I was anticipating amazing pizza.  Sooo disappointed, Yelp... soooo disappointed.\n\nWent here with my boyfriend during my trip to Brooklyn.  The place is very tight and cramped, as I expect most places in NY to be, but manageable nonetheless.  I recalled seeing the owner reprimand one of his bus boys right in front of me as he seated us.  Very unprofessional.\n\nWe decided to go with a small pepperoni and mushroom pizza, followed by a 20 oz bottle of Sprite for myself.  Wait, $4 for a Sprite?!  I've paid less at Disneyland, son!  The pizza was NOT GOOD AT ALL.  Pizza was very wet and tasted gross as it cooled off.  Maybe I'm not New Yorker enough, but I definitely did not dig the pizza sauce.  I hate tomatoes, so maybe I'm biased, too.  I prefer sauce that does not appear to be so marinara-y in texture; I like it smooth, deep red, and vibrant, not mushy and translucent red.  Bleh.  My boyfriend tried to reason that maybe we just created a bad combo...  how do you mess up the classic combo of pepperoni and mushroom???  Nonsense!  We both agreed at the end of the meal that the pizza wasn't very good at all.\n\nThis place, to my surprise, was not filled with locals, but was a total tourist hotspot.  Shoulda known. \n\nI'm trying out Jon's or Bleeker's next time around.  Or better yet, I'll keep it local and hit up Gina's in Newport Beach/Costa Mesa... or... don't hurt me... Round Table.  Mmmmm.\n\nAnd no single slices?  BOO.", "author": "Angeline D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-17", "description": "Great pizza, thin crust, fresh ingredients, small pepperonis, but will I go back....?\n\nJust throwing in my two cents, which when added to everyone elses can actually buy you a small pie from Grimaldi's. \n\nLets get down to it, Grimaldi's make one of the best pizzas in NY. Besides the fact that they don't sell per slice, they make a very traditional NYC type of pizza (thin crust, a standard set of toppings). My memories of Difara is too foggy for me to make a direct comparison, and Artichoke pizza is almost a Chicago style deep dish w/ the amount of cheese and artichoke they put on it. And frankly, not everyone is a foodie like all the fine folks here on Yelp and actually like artichoke, so I can't make a direct comparison of Grimaldi's w/ Artichoke.\n\nThe closest pizza slice that I can think of is Naples 45 in Grand Central. Their ingredients are very close to Grimaldi's in terms of freshness, and they both use tiny pepperoni's. \n\nSo even though I gave it 4 stars, will I go back? Unlikely. There's just too many restaurants in the area for me to go back all the time for it. And at the end of the day, its only pizza.", "author": "Jack N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-08", "description": "Grimaldi's is exactly what you want from a Brooklyn Pizza Place. Amazing pizza, decent service, but mainly amazing pizza, and calzones. You can tell the ingredients are fresh. Their smalls are not small, they are quite large, which isn't a bad thing. I definitely recommend this place.", "author": "Steven L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-21", "description": "A perfect pizza pie!\n\nDifferent from other pizza joints, they don't sell by the slice.. but they don't need to, I can eat the whole thing by myself. \n \nThe gooey cheese, and crunchy bottom... ::drool::\n\nThe lines can get pretty horrendous, so I'd say go around 10pm, and you can get a seat right away and still have time to go out afterward. But if you're visiting, and you can only  make it in the afternoon, trust me, it's definitely worth the wait! \n\nPizza makes me happy.", "author": "kat c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-03", "description": "Whatever you decide to get, add on a small cheese pizza with pepperoni and sausage. Holy CRAP! I don't like sausage and I'm so-so on some types of pepperoni, but these guys must put crack in both because it was divine! We also go a white pizza which was good, but didn't compare to the supreme awesomeness that was our sausage and pepperoni pizza. \nWant to skip the lines? Order them to go (you can just walk in, only one person though, it's cramped in there as it is) and bring them down to the promenade and watch people have their wedding photos taken, pigeons try to steal your pizza and little kids running around screaming. Top it all of with some amazing ice cream and you've got yourself one heck of a Saturday.", "author": "Amanda Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-16", "description": "Lunch ($10-15) (single visit)\n\nFood: 4\nService: 3\nDecor: 3\nOther: 2\n\nMultiple friends from Brooklyn crooned to me that this was the best pizza EVARRRRRR.  I came here with a friend and it was pretty good.  Probably not the best I've ever had in my life, but pretty good.\n\nI don't know if it's worth the long wait and the cramped eating space though.  Decor would have gotten two stars, except that they had some cool Sinatra memorabilia decorating the walls.  The service was fine, but the place is set up to churn out pizza-full people, not a pleasant dining experience.\n\nI also find the cash-only for the rather pricey pizza to be something of a turn-off.", "author": "Ben J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-16", "description": "Loved Grimaldi's. I don't think it's just about the pizza though. It's more about the environment, the NY feel and it's convenient location by the BK Bridge. As a tourist, the visit to Grimaldis really gave me a good sense of NY history/ people/ culture. \n\nThe pizza itself was great: fresh, full of flavor with a crispy thin crust. If you are indecisive, they will also let you split one pizza and have different toppings on the two sides.", "author": "kat a."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-12", "description": "Overrated.\n\nExpecting to experience the best pizza of our lives, we waited for an hour in the steaming heat at 2 pm. Maybe it was our mistake to expect so much, but after all the hype and waiting, could you blame us? \n\nAt Grimaldi's, you customize your pizza by ordering all the toppings. After much deliberation, we settled on pepperoni, bell peppers, olives and extra mozzarella. The crust was burnt on the edges and the pepperoni was rubbery. Perhaps I was full from finishing a milkshake from Brooklyn Ice Cream Factory while in line, but I wasn't that impressed with the freshness or taste of the pizza. I was, however, impressed with how many loyal customers and tourists they're able to attract and keep.", "author": "Lillian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-12", "description": "Haven't been here in over a year and am STILL yearning for it. \n\nDo yourself a favor: on one of those fabulous, warm-ish, crisp in the air fall days in NY, walk over the Brooklyn Bridge, and end up at Grimaldi's. Don't forget to bring cash - they don't take no fancy-schmancy credit cards, getouttaheah wit that. Get yourself in line, chat with the owner who always works the line (if you need a definition for \"working the line\", go here, watch and learn), and get your fabulous, coal-fired pizza on, carbon be damned. Fresh ingredients, perfectly thin crust. Awesome blend of flavors. Best pizza sauce ever. Make my mouth water just to think about it! \n\nLots of cool old black and white photographs on the wall. Check 'em out if you get a spot next to the wall. Old blue eyes himself used to eat here. \n\nOne of those meals where nobody talks - just eats. Which is good 'cause they make it clear they gotta turn tables so if you really want to linger over this pizza, order it to go and go sit in that park next to the bridge. And when you're done, you can walk off your meal by walking back over the bridge. Great flavor, happy tummy, and the opportunity to lose the calories. What else do you want?", "author": "Sarah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-16", "description": "The lure of Grimaldi's should be sampled at least once in life.  Does it spark nostalgia for days of the past? Maybe.  The combo of a walk over the Brooklyn Bridge and Grimaldi's Pizza is probably a tale as old as time.  For that it should be done if ever in New York.  \nIt is a great pizza because of the fact that they bring it out fresh from the oven, where it only spends a scanty two minutes total.  Would other places receive the \"best pizza\" award if you got it fresh from the oven?  Probably.  So as for the pizza itself I think the ingredients are pretty fresh, not the highest quality out there.  It seems to lack a certain something to it, that you will start to notice when you get down the the last slices.  The pizza that was so awesome while hot and fresh, turns into something you get from the street corner at around 3 pm.\nAlso the line is crazy, why anyone would stand in it I don't understand.  Come early and be first (or third in our case)!  Which reminds me, how is it that we were third to get seated but everyone else in the place gets their pizza before us?", "author": "Dave L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}