{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-06", "description": "I've been to Lombardi's and Lucali and plan on trying more pizza joints in the near future (in my search for the perfect slice), and Grimaldi's was the first place I tried. I walked from Downtown Brooklyn past the promenade (and fruit named streets) last summer and discovered a growing line of people standing in front of the tiny storefront. There's just something magical about their pizza. I ordered a white pie with garlic and a regular pizza w/ sausage, figuring my husband and I could have leftovers (and we were STARVING, hence the over-ordering). The cheese is heavenly and you could see them slicing up the meat + giant hunks of mozzarella. There's no magical hour/time to arrive. \n\nThe only tip I have is to try and keep your party small (say 3 people or less), you'll get seated faster.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-14", "description": "We went on a Thursday around noon and walked right up with no line. They had a greeter/host that met us outside and promptly brought is to a table!!\n\nAwesome prices for lunch and great ambiance! Definitely walked off my calories on the bridge ;)", "author": "Hanna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-20", "description": "BEST PIZZA I HAVE EVER HAD!\n\nGot here right before the dinner crowd and was seated right away. The atmosphere was just how I pictured a typical Brooklyn pizzeria; busy, loud, and wonderful. \n\nIf you want the best pizza NY has to offer, come here! \n\noh and p.s. if you're coming from the city, take a subway to Brooklyn and walk the Brooklyn Bridge back to NYC after dinner for a romantic stroll and breathtaking views.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-25", "description": "Grimaldi's is considered by many to be the best pizza in NY.  Regardless, it is at the very least great pizza!  Many tourists and people from lower east side walk across the brooklyn bridge over to Grimaldi's (fun date).  There is almost always a line out the door to be seated.  Last time I was there Obama was in town and the secret service showed up for some pizza.  Being the secret service they decided to try and cut the line...boy was that a mistake. They got sent straight to the back!!\n\nIn short:\n\nGrimaldi's is both an essential NYC experience and great pizza", "author": "Asher M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-18", "description": "White pizza with extra garlic, pepperoni, mushrooms and spinach....HEAVEN! house red wine was pretty good too. So worth the hour wait! And after dinner, the view of the Brooklyn Bridge at sunset was breathtaking!\nI would fly to NYC just for Grimaldi's", "author": "Melelina I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-22", "description": "We always get here half an hour before they open. Since the New York Times review, the lines get ridiculous around 1pm- up to an hour wait. Their pizza is amazing but is not worth standing an hour or two in line.\n\nI had a mini college reunion here with two close friends from school. We squeezed into the tiny booths, elbows touching with the tourists next to us. We watch people prepare the dough, placing sauce and toppings on  and throw the pizza into the wood burning oven. One man whisks out the pie and tosses it onto the a perforated platter. A beefy man comes by with the silver platter and places it on the pizza stand next to us. The basil fragrance drifts over us, the red sauce is bubbling and the mozzarella is fresh. We all are salivating over how the slice will taste. \nWhen our pie comes, we dig in quickly. Trying to savor the multiple textures of crispy crust and gooey cheese and the sweet liquid tomato sauce before the blasting air conditioner turns the cheese to rubber. \n\nPro tip: go on a day when its not too hot outside, so they are not blasting the ac. \n\nLove this place. I like to space out my visits so each time is special.", "author": "Doreen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-10", "description": "Visited here when it was raining and it was 3pm on a Friday. We anticipated a long line. Luckily, the restaurant was half full and the we had an awesome waiter. The cheese was cheesy. The meat was meaty. The tomato sauce was tomato-y. OMG!! I'm drooling thinking about it. Definitely coming here again! And then we walked off our caloric intake on the Brooklyn Bridge.\n\nJust remember.. you're in NY so expect NY attitude. The guys aren't like peppy like me... CA born and bred girl.", "author": "Cat Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-20", "description": "Pretty good pizza spot. Line outside that took us about 45 minutes to get in, so expect a line when you do go. Friendly and welcoming staff. It took a long time to get our pizza after we ordered it (about 35 minutes), but the wait was absolutely worth it! They didn't allow you to buy by the slice. You have to buy a whole pie (idk if its always like that), AND it was CASH ONLY.", "author": "Jesse G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-29", "description": "Our waiter barely smiled, didn't greet us, and he never came over to check on us. I'm all for saving money and going green but at this place they use plastic silverware, plastic cups and plastic plates. PLASTIC PLASTIC PLASTIC. I normally wouldn't mind the effort to save time and money but I found myself fighting with the plastic knife to cut through my pizza. Other than the Wack ass server the pizza was good.", "author": "Katherynne S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-07", "description": "EHHHHHH not such good pizza... very disappointing.\n\nI came in to order take-out and got a glimpse of all the mediocre ingredients they used such as store-bought no-name brand mozz cheese.  Isn't this suppose to be a staple ingredient in pizza? HUH? \n\nanyways, I received the pizza- first few bites were \"okay\" but then it just went downhill... worst part was- awful aftertaste and overpriced.  Poor tourists...", "author": "Nicole A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-02", "description": "THE BEST THING I HAVE EVER HAD\n\nCASH ONLY\n\nif you are in the NY area and enjoy a good look at the Brooklyn bridge there is no excuse not to go here\n\nget anything because it will RULE", "author": "Adriana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "Wooow very romantic place and fabulous cheese pizza haha I know I should try other more elaborate but sometimes simple things are the best ones!!!", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-07", "description": "Mediocre pizza that didn't nearly live up to the hype and obnoxiously poor service.\n\nOn our trip to New York, I'd anticipated lots of good eats and was excited to check out Grimaldi's, which I had read hyped a \"Must do in NYC\"\n\nSo, we took a nice walk over the Brooklyn Bridge and had worked up quite an appetite by the time we arrived at Front Street and a line up of about a dozen people on a late thursday afternoon. Thirty minutes later and we're still lined up, despite the fact that several parties have left, and the mouth-watering wafting odor of coal-fired crust is piquing our appetite. Growing impatient, I notice (A) the disinterested staff seem more interested in chatting with their buddies and (B) everyone in the lineup seem to be tourists..\n\nFinally the door guy returns to the line looking for table of four to seat, tired of waiting: I grab the German couple behind us and suggest we sit together. The plan works and we're in, until as we ascend to the upstairs seating area, I inform the host that we are two couples and he rudely tells me we can't split the cheque.. Hey, that pushy New York stuff might work with the Euros, but I'm from East Van and I push back ... he reluctantly obliges as we enter the upstairs dinging room: and WHOA! I count at least a dozen four-tops and another dozen tables for two, set and empty.. with assorted staff loitering about, entirely non-busy... you'd think such underworked staff would be at least a little attentive but nothing doing - we had to call them over every time and grab out own condiments from neighbouring table..\n\nI'm not sure if lining us up like cattle outside the half full restaurant was a ploy to build hype or merely in the hope of getting us so hungry that we'd be ravenous for the mediocre pizza offering, but the crust was soggy in the middle and cost over $30 for a large with two toppings. It wasn't BAD mind you, but it certainly wasn't worth the price tag, poor service and half hour wait.. the only redeeming aspect of the visit was upon leaving and strolling a block west to admire the view from the carousel below the bridge.\n\nThe best pizza (I had) in New York was Bleeker Street Pizza in the West Village, served by the slice and superior in every possible way. I'd advise giving Grimaldi a pass.. I give it a one-star just to dilute the ridiculous amount of undeserved four and fives here on Yelp, otherwise Grimaldi's a two.", "author": "Peter X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-17", "description": "Delicious NY style pizza!\n\nWith 2,000+ reviews here there really isn't much I can add other than it's delicious and worth the wait!! Without the wait I would give this place 5 stars, but due to my hatred of standing in lines and crowds I'm giving it 4 stars.", "author": "Emily D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-15", "description": "$12 regular pizza, $18 regular white pizza with two toppings of Italian sausage and mushrooms.\n\nPhew, got there around 6pm and had an hour long wait in the cold of Brooklyn. The place is pretty cool, with artwork and a nice finish to the decor that makes it feel spacious but still cozy.\n\nThe pizza itself was actually a little bit of a disappointment, perhaps just a bad day or an insensitive palate or overhyped expectations. The pizza's ingredients tasted really fresh, and it was nice and hot out of the oven within say 10 minutes of ordering, which was great. The service was also pretty fast, which is no surprise for a place that was so busy.\n\nThat said, the components of the pizza just didn't come together for me. The mozzarella was fresh and had a nice melt to it, but was far too bland for me. Even the white pizza, with the garlic and herb seasoning tasted pretty bland without the toppings of mushroom and sausage, which really saved the pizza for me. The tomato sauce on the regular pizza was too little and didn't bring out much flavor. \n\nLast of all, the crust, for all that people keep raving about, really didn't appeal to me. It was blackened in some areas, and for the most part too hard and too much of it on the pizza. Was really looking forward to crust that had some crisp to the outside but still soft on the inside.\n\nFor the price and the wait, it just wasn't worth it for me. It was fresh, and tasted decent, but just not outstanding enough to warrant the hype and cost around it. Sorry Grimaldi's!", "author": "Carlin Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-09", "description": "A shadow of what it used to be. Pie is great, but since moving to this new location, service has gone from bad to horrible, now a B health rating, let tons of people cut, and SLOW. Really sad.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-19", "description": "Landed at Grimaldi's after a good walk across the Brooklyn Bridge.  Super touristy, crappy service, but good pizza.  Cash only...weird.  I'd probably opt for the place next door or another pizza joint around the corner next time...less crowded and maybe better service?  Not terrible, not great.", "author": "Patrick L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-19", "description": "I had high expectations for this pizza joint since everyone raves it as one of the best places for New York Style Pizza. I guess I'm not used the sogginess of a pizza, but I didn't like it that much. We ordered a large pizza with pepperoni, sausage, and mushroom. The pepperoni had a lot of flavor though.\n\nThe seating arrangement was extremely tight. The person managing the seating squeezed as many people as possible in one long table. So, we're basically sitting next to a stranger and hearing their conversations. Yeah, not my cup of tea.\n\nOverall, we spent $24 (including tip) for pizza. If I'm going back to NYC, I'll try another pizza joint that doesn't require standing in line. We only waited 10 minutes, but it is ridiculous to read how people stand in line for 2+ hours.", "author": "Jackie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-03", "description": "Heard lots of great reviews from people about this place.\nThere was a person at the door to greet you and maintain the line, kinda like a bouncer. He was super friendly and got us to our seat right away.\nAlthough the oven was being reheated, the pizza came out promptly. \nMany selections on toppings, gotta have that ricotta cheese. \nThe pie was a little sweet for me, and the price was a little higher than most, but you are paying for experience so it was well worth it.\nIt gets crowded pretty quick during dinner hours but the place is huge.", "author": "James S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-10", "description": "I happened to go on a weekday night when there was no line and I was pretty excited about checking out Grimaldi's due to the recommendations of friends.  \n\nThe staff was decent overall, but I noticed them being downright rude and impatient with other customers.  Not cool in my book.  I get the whole \"attitude\" thing and expected the service to be disengaged, but not straight up rude.  \n\nAnyways, my buddy and I ordered two different pizzas (Pepperoni and mushroom).  Both were mediocre at best as the pizzas weren't cooked properly and was burned on one side.  I was pretty bummed.  I was really hoping this place would  be awesome.\n\nThat being said, like most spots, I would give it another shot if there wasn't a line.  If I do, I'll be sure to update my review.", "author": "Manoj P."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}