{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-30", "description": "Shockingly disappointing. Two hour wait to get inside and then wait upstairs for another 90 minutes. No pizza is worth a 3 1/2 wait. \n\nAnd, the only thing worse than the horrific wait was the offensive, money-grubbing attitude of the owners. Do not fall for the overhype about the purported quality of the pizza. Our hometown pizza at First Class Pizza in Tustin completely outclassed this dump.", "author": "David B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-16", "description": "Brick oven pizza is always team winning and a sign of classic NY pizza. This Grimaldi's however is no better (or worse) than the one in Long Island that I had already been to..and it didn't have a line because..well it's in Long Island. Pizza was great but I've had it before elseswhere and for some reason I expected it to be twice as good since I had to wait 45 minutes for a table.\n\nOne concept that seems completely asinine, is that you have to wait on the same long line even if you just want to order for take out and they just do not pick up the phone if you try to call it in. I think the hype may get fulfilled by some, but not this girl because I've had my share of brick oven pizza and the food was great but the wait was not.", "author": "Samantha S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "I have found my favorite place for New York Style pizza...right here at Grimaldi's! Great experience!", "author": "Caren W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-05", "description": "PLAIN WHITE SAUCE PIE WILL JUST DO!\n\nAs much as I love meat, their pizzas are just too yummy that it doesn't need additional toppings!  I'm not a big fan of their red sauce pies... It's the garlic and basil that they put with the white sauce that makes the pizza taste like heaven! \n\nNow that they have a bigger space, the wait isn't bad!\n\nYes, you will have garlic breath afterwards.  So gents, make sure you bring those mints or gum!", "author": "Vitaliy I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-12", "description": "I would give this place 3.5 stars if possible.  There is obviously a lot of hype around this place, which is built mainly b/c of the crazy lines at the brooklyn location.\n\nThe pizza was ok...I've had better personally, but I think it is a matter of taste b/c they do something unique, which is that they use FRESH MOZZARELLA.  I personally didn't care for it because it wasn't scattered everywhere and had sort of a rubbery texture instead of creamy, but I think that depends on each person's individual taste buds b/c my friend who normally doesn't love pizza really liked it.\n\nSo to each their own.\n\nIf I was on a trip to new york, I would look at this location as a tourist spot b/c its famous and in a cool location under the bridge and next to an ice cream place, but I would try to go to a different grimadli's location or pizza place entirely.", "author": "Rubin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-14", "description": "The pizza is good and not too greasy and the ingredients are very fresh. The line is crazy but if you are ordering out you don't need to wait in line and don't forget this place is cash only.", "author": "Nadege L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "This is one of my favorite pizza places in Brooklyn and possibly all of NYC, make sure your cash is flowing because they don't take credit but you are going to get a good pizza pie and let me give you a little tip get to the amaretto ice cream it is amazing!", "author": "Marklin M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-05", "description": "Overhyped, overpriced tourist trap. Horrible customer service (what incentive do they have anyway? The pizza basically sells itself at this point). Never going back here again. \n\nIf you want real Brooklyn pizza, take your train a few more stops into Brooklyn and simply look around. Chances are it'll be better than this place.", "author": "Eugene B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "Amazing - super tasty and surprisingly light. My husband and I managed to polish off 99% of a large between the two of us. I'm holding off on 5 stars because I want to try Juliana's next door. My one criticism would be that the tomato sauce was a little sparse and could have come through more. But I'll definitely be back!", "author": "Natalie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-16", "description": "Went to Grimaldi's on a Wednesday around 6:45pm. The wait wasn't long for us. We got lucky I guess. The door guy took a liking to our daughter and we miraculously skipped over half the line and the long wait. I think that made the pizza taste even better! :) The interior reminded me of a small town pizzeria - kinda kitschy with the red checkered table cloth but in a cute endearing way. It also smelled fantastic inside! The smell of garlic and basil was like heaven! \n\nWe ordered a regular cheese pizza to see what the hype was about and a couple Brooklyn root beers. I had a good view of the pizza making area and enjoyed watching them make pies! They top all of them with Olive oil which was interesting. The pizza came quick and it was awesome. The fresh basil and the crust was what set this pizza apart from any other pie I've had. Crisp but still chewy mild tomato sauce and the cheese. Oh the cheese! The fresh mozzarella made the difference in this pie. I'm glad that we tried the \"best pizza in NY\". The only fail was the bathroom at this place, but really, who goes to a restaurant for the bathroom?", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-25", "description": "I love this place. \n\nAfter walking the Brooklyn Bridge from Manhattan, obviously we had to drop in at Grimaldi's. After waiting in line for maybe 5 minutes, we were taken upstairs and seated. \n\nVery fast and efficient service. The food was, as always, amazingly good. This place is just pure and simply about the pizza. They don't pretend to be anything else. They make amazing pizza and they make it amazingly well for cheap, too!\n\nDefinitely recommend a visit to Grimaldi's...only the NYC Grimaldi's though.", "author": "Terri B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-27", "description": "Loved this place. The wait wasn't too bad. The food was excellent. Didn't take as long as others have suggested. Try the Italian soda:)\n\nUnfortunately you lose 1 star because we felt rushed to leave as the line outside had increased.", "author": "Nishita V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-11", "description": "Good pizza. The fresh mozzarella and basil were a great change from the regular pizzas. I would recommend it if you're nearby, but I would not make a great detour for it...;)", "author": "Emma T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-15", "description": "This place is OK. I've had better Pizza in the local greasy spot. My and my friend went there late one Saturday. it was about an hour wait and once entered, we felt kind of rushed.\n\nWe had a regular small pizza and ate it within minutes. I also had a giant canoli as a dessert. it was way too big and sweet.\n\nIn all, i would go to this place again and would even go there for a first date, as it gets kind of intimate because you really got to get close to a person to hear what they are saying ..... lol and it is crowded", "author": "Alana D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-14", "description": "I have been hearing mixed reviews about this place, how great it is and how over-rated it is.  I can  confidently say that this place deserves the praise it gets.  The food was excellent.  My friends and I split 2 pies and it was more than enough to fill us all.  The pies were delicious.  The service was good too. Our waiter helped us split the slices from the pies.  \nI like the casual atmosphere this place has.  \n\nThe one gripe I had was the really long wait time for a group of 6.  The wait time is faster if you are in a smaller group.", "author": "Thomas F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-10", "description": "I really do not believe how a place like this, where the waiters treat you like if you were a piece of shit and the pizza is mediocre (just bread with a tasteless cheese and a spoon of salsa) could get so much good reviews. \nI guess the myth that the tourists have created around this place is hard to demolish, but come on people, there is WAAAAAAAY better pizza places in New York and with nice, decent people serving you, not rude douchebags.", "author": "Mariana G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-07", "description": "We stood in line like cattle waiting to get in. Fortunately there were only 2 of us. We got picked to sit after about 10-15 minutes. We got seated in the corner, nice and cozy. The waiter never looked our way. People were then seated next to us and then in the table next to them. We were seated first mind you. After about 10 minutes of receiving no service I finally caught the eye of a waiter who proceeded to tell me that he would be with me in a moment. He then proceeded to wait on the two neighboring tables and then box the leftovers of a third table. When he finished he finally arrived at our table acting like he was doing us a favor. \n\nHe took our drink orders and when he finally returned (after another 10 minutes or so) he took our pizza order. When the pizza finally arrived (another 20 minutes) he put it on our table and disappeared, NEVER TO RETURN! He never came back to ask if everything was ok, if we needed refills on drinks or anything. He didn't even bring our bill. I had to get it from someone else.\n\nPizza was soggy, not crisp. Way over-rated, and way too pricey.  Don't waste your time or money at this tourist trap.  I know we won't again. There are better places out there.", "author": "Dean S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-19", "description": "Such a great location near the park... I brought my husband and sister in law here on her visit to the city.  She wanted some authentic NY pizza, and we were not disappointed in our experience.  \n\nWe waited in line for maybe an hour and a half on a Saturday night, and our order took a while to get to our table, but the pizza was really yummy and the atmosphere was fun.  You can see them making the pizzas with their hands, the big brick oven, and all the fresh mozzarella behind a sneeze guard.  They also had a bar... I don't know if you have to wait in line for the bar top, but you did for take out, so probably for the bar, too...\n\nWe got two pizzas, and enjoyed both topping combos, but found the pepperoni to be quite greasy.  The antipasti was a nice start to calm our ravenous hunger after waiting in line and then another wait for a freshly baked pizza.  Beer, wine, and local sodas are the beverage list. A little pricey.  My husband still raves about the pizza. It was even more delicious cold the next day.  \n\nNo credit cards, no slices, no reservations, no delivery.", "author": "Renee B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-15", "description": "1) Go between 3-4:30 PM. Minimal line.\n\n2) If you're traveling with elderly people, take the B25 bus from the station. The sidewalks disappear and reappear down the hill, and i almost got run over yesterday while I was in the area.\n\n3) My dad loves this place. He hates pizza and never has it for dinner, but he loves the pizza at Grimaldi's. He even suggested going here for dinner on his second trip visiting me in NYC.\n\nRepeat: MY DAD WANTED TO GO HERE.\n\nI had to clean my ears. \n\nBut yes, the pizza here is very good. You can actually taste the freshness of the cheese, and they have the crust down to a science. Love it.", "author": "Elizabeth L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-28", "description": "Grimaldi's is over-hyped. My expectations were extremely high, and my experience was less than satisfying. Thankfully, I came on a Thursday afternoon around 3:30pm, when there was only one other party ahead in line. The wait was about 10 minutes, which was not bad at all, considering the stories I've heard about people trying to get seated.\n\nIt took the waiter over 15 minutes to take our order, which was only one large pizza. We ordered our pizza with sausage and mushrooms. When it came after 30 minutes, I was less than impressed. The pizza, quite frankly, was tasteless. The tomato sauce was bland, and the only flavor came from the crumbled sausage, which was one of the only decent aspects of the meal. While I liked the consistency and thinness of the crust, I expected the sweet charred flavor that the crust at Lombardi's has. This pizza had none.\n\nThe service was also sub-par. In addition for taking a long time to take our order, it also took them a long time to bring us the check. No one checked in on us to inquire about our meal or if we needed refills on drinks.\n\nI'm glad I waited so long to give Grimaldi's a try. I'm also disappointed that it was such a letdown. I don't think I'll be returning. If you want coal oven pizza, I suggest going to Lombardi's instead.  The food and service is immensely better, and let's face it - you'll be waiting in line regardless of whichever place you choose.", "author": "SukMon C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}