{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-08", "description": "wow, totally lucked out on this place it seems!  Our flight out of NYC was delayed, and so since we were taking the train to JFK, we decided to stop and grab some pizza from Grimaldi's.  Looking at those pictures of the wait, man, yeah, we lucked out cause we just waltzed in and found a table.\n\nI'm a single guy, so pizzas are a staple of my diet, and yet for all the pizza I've eaten, I've still found this place to be so unique!  The crust was thin and crispy and \"burnt\" so well that as a bread guy, I couldn't help but love it.  The chunks of cheese that are thrown on there as opposed to spread out over the whole pizza took some getting used to, but in the end, I liked that style better.  I'm not sure if it was the way the pepperonis were cut or if it was the pepperoni itself but that particular flavor was much more unique and flavorful.\n\nAnd top that meal off with a coke, gee whiz, what more can a man ask for?", "author": "Kevin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-07", "description": "Went last Sunday at about 8PM. Very small line and my party of 2 only waited for about 15 minutes. Decent wait and the seater was very energetic and attentive. I think we got lucky being it was pretty cold outside and it being Sunday night the wait wasn't so bad.\n\nWe got a half mushroom/half pepperoni pizza. It was good. The pizzas come out hot and fresh with lots of yummy cheese and toppings. I'm not a fan of their mini pepperonis as I like something a bit more flavorful. I think my boyfriend liked his mushroom okay (he is vegetarian). \n\nVery cozy atmosphere.\n\nPros: good pizza, good atmosphere, you can watch the pizza being made while you are waiting in line for the bathroom.\n\nCons: 1 BATHROOM. You will likely be in line for said bathroom and watch dozens of pizzas being made including yours to go back to your table once your done to eat said pizza.\n\nCash only. I had to walk down the street for cash as the two closest ATMs at the time were out of service.\n\nI would like to take my family here if they ever visit but I'm not sure if they would be okay with the wait.\n\nOne of the better pizzas I have have in the NYC area I guess.", "author": "Jennifer A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-19", "description": "Fantastic NY style pizza!  Highly recommended if you go to Brooklyn!  Pizza was very fresh tasting and authentic!  Be prepared to wait but its worth it.  Would love to go back again some day!  Also, I think I remember that they only take cash but that was in 2006...", "author": "Ben F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-08", "description": "Worth the wait! Grimaldis tops Lombardis for one reason only, price! I'll say that both places have the best pizza I've ever had (better than Italy!), but grimaldis is much cheaper. Maybe its because lombardis is in little Italy and grimaldis is in Brooklyn? Idk, but the trip over to Brooklyn is worth it. The thin crust and mozzarella cheese are to d-i-e for! A MUST for every new York visit!", "author": "Susana M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-28", "description": "Ya know when i was a boy and i imagined coming to the coolest city on earth i heard all the rumors about the NYC pizza and believed them....\n\nAs i grew i realized that sometimes the reality of a thing is surpassed by it's hype and more often than not the hype functions like a wave in a pool - the origin of the ripple is usually the first and last place to feel the it. \n\nAs the waves of \"NYC Pizza\" have spread over the globe - the places that started the trend are now being inundated with people from Omaha,Deluth/Armenia/Tunisia but are nothing ,more than an echo of the first thrill. Yes they are ok, but ultimately they are stuck in the \"NYC Pizza\" of 1982 and don't have more to offer....\n\nHey, yum for wood fired, stone, thin crust, bubbly pizza with good ingredients, but i will NOT WAIT in a 3hr (much less 20 min) line for something i can get all over the city....\n\nHey Ohama! who are you in line with?\nGo find the locals!!", "author": "Furyk C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-02", "description": "I never knew what good pizza was until I had Grimaldi's.  The BEST pizza I've ever had!  Fresh ingredients, tasty, not overly salty, just delicious!  Don't miss this if you're in Brooklyn!", "author": "Julia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-06", "description": "Best Pizza in the world - They don't accept cards or sell by the slice so, bring your cash and order a huge pizza and take the leftovers to go because just one slice is not enough. I love this place! The location is perfect for a Friday night date. Also, this place is great to bring your friends/family who are visiting NYC and are looking for some cheesy, freshly made pizza.", "author": "Cathya L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-31", "description": "I took my daughter to Grimaldi's for her first slice of New York pie on October 7. There was a drizzly rain falling, but the wait on line outside was short. She could have gotten a table before I had even parked the car. After I finally showed up and we were seated, we ordered a regular six slice pie with italian sausage and mushrooms, and two Olde Brooklyn root beers. I had never tried Olde Brooklyn sodas and am very impressed with the root beer. It's really good. The pie came out quickly and looked terrific. There was a little bit of moisture from the mushrooms and some of the basil was still a little green. It's amazing how good mushrooms taste when the water is cooked out of them. Unfortunately, my daughter ate her half of the pie, so I got only three slices. At this point, I don't want to eat pizza anywhere else in the city.", "author": "Philip C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-31", "description": "This place is worth the wait and is located in beautiful downtown DUMBO Brooklyn.  I would suggest ordering ahead and picking it up to eat in the beautiful park.  Grimaldi's is a NYC pizza mecca for a REASON.  Delicious as a word doesn't do it justice!", "author": "Jessica G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-15", "description": "I walked across the Brooklyn Bridge ONLY because I knew we were going to get pizza.\n\nAnd it was definitely worth the fucking walk.  Pizza is anorexic thin, just how I like my wimmen.  But seriously this pizza is crispy and the toppings/sauce/cheese are fresh to death.  The dough is amazing.  \n\nWould I come back? hell yeah, its too bad I live in Cali though.", "author": "Matt C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-05", "description": "Fresh, delicious, and very New York!  We waited for 30 minutes outside and it was well worth the wait! If we ever visit NYC again, we'll immediately head over the Brooklyn Bridge to eat at Grimaldi's. Yum-O!", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-08", "description": "The pizza is always extremely delicious except I am too lazy to go here even though I live really close by.  There is no delivery and the line is usually extremely long.\n\nI'm a fan of the pizza, but not the restaurant because the tables are so close together and everyone is squished.  If you feel like eating here be prepared to feel like you are eating in a crowded train during rush hour.", "author": "Jennie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-31", "description": "As a newcomer to NYC who has heard so much hype about Grimaldi's, I had to try it! Not knowing what to expect at all, I definitely was impressed with the place. My only gripe is the 30 minute wait that we had on a Friday afternoon at 2PM, but it's definitely expected since everyone and their mother comes here.\n\nWe ordered a regular small pizza with onion, mushroom, and italian sausage. Definitely delicious and fresh, since you can see them make the pizza and take it from the nice little coal-fired, brick oven. When they brought it out to us, it was piping hot (steam was coming from the top). The only issue we had was that by the last two slices, the cheese cooled to the point where it \"stuck\" the two pieces together and we had to \"pull it apart\". Oh well, that's inevitable! \n\nOnly gripe about this place would be the wait and the fact they don't take credit cards! :( \"Cash only\"", "author": "Andrew T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "Honestly, with all the hype, the first bite I took I wasn't that impressed.  Then I kept eating, and the reality went up to the expectations.  The other problem was I started with a slice of plain pizza, and I think their pizza really shines when you get some meat on there.\n\nThe pizza is fantastic.  It's the best I've had in the city, and I've been back at least 5-10 times.", "author": "Andrew F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-01", "description": "regret waiting on the  line for more than a hour. The pizza doesn't justify the long wait. You can find way better pizza in nyc! Service is terrible, they also add gratuity to the check without letting people know and expect us to add tips on top of it, great. This is a cash only place and far from being cheap ! DO NOT GO!!", "author": "Eleonore E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-24", "description": "Today I went to grab some Grimaldi's pizza with a friend. We arrive and there was a huge line, which is usual. What was quite unusual was the crowd of secret service agents lining up all over the street. We go in and are bags were searched and we were scanned with metal detectors etc. We figured there was probably a celebrity in there, but what kind of celebrity would summon THAT kind of security? My friend comments: \"It would be so awesome if all of a sudden Obama walks in\". We both have a laugh, thinking of the improbability of such a thing.\nFive minutes later, I hear a collective gasp. When I turn around, there she was... Michelle Obama. It was so exciting! \n\nBy the way, the pizza is the best NY pizza I've had so far. Smokey brick oven goodness with the freshest ingredients. And of course, Obama approved.", "author": "Liz R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-08", "description": "I have to give it to Grimaldi's, they definitely gave me a good \"New York Pizza\" dining experience.  Waited an hour in line for them, but oh was it worth it.  \n\nThe environment was like a huge party!  Italian music, Frank Sinatra, etc. was playing in the background.  The place was so lively and energetic.  We kept our pizzas relatively simple.  One being just pepperoni and mushrooms and the other being just sausage.  The pepperoni and mushrooms was simply perfect.  This was what I imagined thin crust pizza to taste like.  I really can't use any other word to describe this pizza, but \"perfect\".  Not only that it was darn cheap too!\n\nThe second sausage pizza wasn't as great though.  This was soggy and didn't have a good firm consistency.\n\nWould I go back to Grimaldi's?  Yes.  Would I wait in line for 1+ hours?  Yes.", "author": "Randy Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-30", "description": "Made my yearly trip out east not too long ago... Grimaldi's has made it to the must-do list...\n\nAs usual walked the bridge to work up an appetite \u0026 arrived at the door about 10 min prior to opening \u0026 the line wasn't too bad but did grow quickly.\n\nService was better this time around... Ended up sitting next to a retired couple from out of town who were doing the tourist thing. They were sweet so I did warn them that even the small was a sizable portion...\n\nThe pizza really does speak for itself.", "author": "Lydia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "Great pizza!!! Need I say more... Reason it's not a 5 starts, they don't serve alcohol (beers with a pizza just does it for me)! By the way the restaurant has such a great back story... Read the plaque on the outside!", "author": "Paris G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-23", "description": "I seriously waited more than an hour in the ridiculous line.  My friend and I devoured the pizza in less than 15 minutes.  It was that good. \n\n I tasted both Lombardi and Grimaldis'...I still don't know which one is better.  I just know the wait is shorter at Lombardis and both are really tasty and fresh!\n\nI don't know if I can ever eat any other pizza after I taste this!", "author": "H H."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}