{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-25", "description": "First time visiting NYC in a while so knew that I had to come here. After all the hype about this place, I'd have to say that the pizza was pretty darn delicious.\n\nWe waited in line for only about 20 minutes or so and got seated in the corner in the front of the restaurant. The food came pretty quickly and it was a lot for a good price.\n\nNow for the bad...the corner that we were seated in was FREEZING! And it didn't help that it was also rainy \u0026 cold that day as well. The A/C was blowing onto our heads and when our pizza came out, it got cold really fast because of the too strong air conditioning. Asked the waiter twice to turn it down but don't know if he did because it was pretty packed. But the pizza was still good...just hope you don't get seated at that front table by the window!", "author": "Stephanie I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-10", "description": "Being from Chicago and considering myself a pizza snob, I was skeptical about the hype behind this place... but after the first bite, I became a big fan of Grimaldi's and will definitely be back here next time I'm in NY.  It's not your typical NY style, it's the thin crispy, brick oven style that made me fall in love with Coalfire Pizza in Chicago.  Basically it's your authentic Italian style... plus I love that they use slices of fresh mozzarella instead of shredded to top the pizza... and the sauce to cheese to dough ratio is perfect.  Definitely check this place out if you're visiting the Brooklyn Bridge, it's right on the other side.  Love it.", "author": "Chirag P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-06", "description": "This place is living off its' reputation, in my opinion.\n\n     For all the hype, I was expecting one of the best pies of my entire life, and I left feeling cheated.  The best part of the experience was the walk over the Brooklyn Bridge at night, which I highly recommend everyone do at least once per year; the views of Manhattan lit up at night from high above the water are absolutely beautiful, and the sort of thing that makes women swoon.\n\n   Upon arriving at the restaurant, I was happy to find there was no line whatsoever, given that I had heard you might have to wait a hour just to get in.  So I was quickly seated, which was good.  I'm always impressed by a nice old fashioned brick oven, and Grimaldi's was no exception.  It took quite a while to get our pizza, which was a bit annoying considering they werent very busy.  Also, I know this is only a pizza joint, but the staff didnt seem very friendly/happy.  Not that I typically care about the staff as long as the food is good, but I was disappointed in the pizza too.  It LOOKED like a brick over fired pizza.... all the required details were there.\n\nThin Crust?  check\nSlightly blackened bottom? check\nMarinara sauce? check\nRoughshod bits of homemade mozz?  check\nFresh sprigs of Basil and/or Oregano? check\n\nIn fact, it LOOKED perfect.  So I was very disappointed to find that the taste was unremarkable and rather bland.  Having tried Lombardi's (the other pizza that shares with Grimaldis' the \"Best Pizza in NYC\" moniker) numerous times, I can honestly say Lombardi's pizza is head \u0026 shoulders above Grimaldi's.  So in closing, if you only have the ability to try 1 of the \"Best in NY\" pies, I highly recommend you go with Lombardi's in Nolita.  I wouldnt even bother with Grimaldi's.   You should still take that walk over the Brooklyn Bridge at night though.", "author": "K K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-04", "description": "Overrated.\n\nCame here on a saturday night around 7pm, and waited in line for an hour and a half before finally getting seated at 8:30. I'm not complaining about waiting in huge lines for really good food (I'm pretty accustomed to doing this), but Grimaldi's disappointed me. The pizza was good, but not great. It actually tasted quite plain to me. Definitely not worth the wait. I was really sad that I didn't like this pizza as much as I had hoped. \n\nOn the good side, the service was pleasant. Pizza came out really fast. The waiters were adorable with their New York accents and charming demeanor.", "author": "Yung P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-15", "description": "I love pizza.  After I was finish eating, I swear my pants were soaking wet because the food was orgasmic.  \n\nI ordered the margarita pizza and compared to other places in NY, this place is by far the best pizza I have ever had.  The tomato sauce was fresh and didn't taste like it came out of a tin can.  The amount of cheese on the pizza was perfect and the crust was chewy.  \n\nThe place was crowded.  We arrived at 7 pm on a Friday and thought we were going to have to wait, but instead, we were seated right away.  We had to share a table with three other couples.  The experience was have been much better if we had our own table or booth, but the food really made up for it.\n\nWould I come back?  That is a silly question.... actually, if I won the lottery tomorrow, I would hire the cooks to make me pizza every night... that is how much I love their pizza.", "author": "myiken n."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-30", "description": "Ridiculous long line full of tourists waiting for pizza. Are you kidding me??., it's a good pie but you wait inline for a pizza you really aren't from ny", "author": "bill l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-19", "description": "Good thin crust. Crazy lines. I would go during the afternoon on a weekday or take it as take out.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-27", "description": "Hands down, my favorite pizza place EVER!!! I wait for nothing! but YES I will wait on the sidewalk in the freezing cold or heat of the summer for Grimaldi's and you'll more than likely have to wait again if you have to use the restroom, but it's not too bad and you'll be able to watch the staff prep the pizzas and pull them from the brick oven. The price is right and it's so delicious if you're going to wait for a table you might as well order one pizza there and put in an order to take one to go. Warm it up in the oven at home and it still tastes great. If you're shy or anti social this is not the place for you, because yes - you will be practically sitting in your neighbors lap. I love the pepperoni and sausage toppings. My favorite place on the east coast :) I miss the happy little feeling I get when I'm in line and they call a party of 2 and you get to skip over a few larger parties to head inside to your table ;) Grimaldi's = a must!", "author": "Candace L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-30", "description": "\"No frills\" pizza isn't really my thang....\n\nThe only reason I tried Grimaldi's was because it's apparently \"famous.\" After having tried it, I don't really know why. Quick service (because they're trying to hustle people in and OUT) and mediocre food.\n\nI did finish off my half like it was nothing...but that's only because I had been waiting outside in the cold for over 2 hours. SO NOT WORTH THE WAIT!!!", "author": "Amber M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-09-03", "description": "Is it worth the wait? Yes. How long? Bring a book and some aspirin in case you get a hunger headache. But once inside enjoy the most amazing brick oven pizza. Don't go too crazy with the toppings because they do add up. Our favorite is diced tomato, green olives, onion and peppers. Yummy!!! (two snaps up). Coupled with a great red wine, it is a fancy feast to say the least (oh wow I'm a rapper!!!) Tables are nice and small so you can hold hands and make googly eyes at your man (or woman). There is an ATM because they do not I repeat DO NOT take credit/debit cards. Bring cash and an empty stomach.", "author": "Sabrina W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-28", "description": "Fantastic!  The pizza was really good.  Fun little spot under the brooklyn bridge.", "author": "Shelly H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-01-16", "description": "BLAHHH...\n\nOn EVERYTHING...\nThe service, the food, and the atmosphere.\n\nThe servers were RUDE.\nI think the fame went to their heads... to the point that they dont really care what you think.\nThe pizza was okay... not great.\nIn fact, I cant even remember what it really taste like...\n\nI was so disgusted over the fact that our server had an eggshell on his serving tray... which he tipped too far over... and accidentally DROPPED ON OUR PIZZA!!!\n\nWe tapped him to let him know...\nAfter which he simply reached over and picked it off our pizza... rolled his eyes... and walked away without saying a word!!\n\nKilled the whole experience.\n\nI dont mind waiting or paying for good food...\n\nBut Grimaldi's was as HUGE a disappointment...\n\nIm never going back.", "author": "Kimber C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-28", "description": "I thought this was the best pizza in NYC until I tried Di Fara and Lucali.  I live about a 10 minute walk from here and when I first moved to NYC about 1.5 years ago, I would eat at Grimaldi's every week.  I mean, the pizza is really 4 stars, I'd say, but if you've never had Di Fara or Lucali, well, you'd probably give it 5.\n\nBut I'm giving it 5.  You wanna know why?  Because in the summer, there is no better meal in NYC period than getting a fresh pepperoni pie from here and taking it out to Fulton Street Landing.  You sit down with a good friend, perhaps covertly pour some wine into a plastic cup.  Eat delicious pizza and soak in the gorgeous view of Lower Manhattan, Midtown, the bridges, and Lady Liberty..  That's NYC for you, folks.  Man I really wish it were summer now.  Winter go away!", "author": "Victor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-14", "description": "Grimaldi's never disappoints. i always bring guest here if they want that to experience that NY style pizza. The small itself can easily feed three people. I just love that crust, there is something about it; perfect consistency with that hint of oven taste. You must go to the one in BK, don't think all locations are the same. I went to the one in Manhattan and although it was good, it wasn't the same. The oven does matter when it comes to making pizza and the original one in BK makes a better pizza. Also, remember it cash only.", "author": "Jessica Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-11", "description": "I'm a simple gal; when I want pizza, I don't need it to be sprinkled with truffles or served on priceless china or accompanied with a vintage bottle of wine. I just want some bread, cheese, tomato sauce, and maybe a topping or two. Nothing crazy. That's why I love Grimaldi's: great pizza without all the frou-frou tendencies of other popular pizzerias.\n\nThe pizza here is always fantastic. With a thinner crust than what is conventional in the city, the pizza pies are filling without being overly so. The tomato sauce and cheese are ample without overpowering each other, and each time I got a pepperoni, the meat was fresh and baked into the pizza perfectly (none of that sliding pepperoni here!). The vegetables Grimaldi's uses, such as the mushrooms and onions, are fresh, not frozen, and similarly baked into the pie. Remember, though, that pizza is served by the pie, so it's best to go here with someone who has similar tastes to you, even if Grimaldi's does half-and-half pies.\n\nThe staff at Grimaldi's has always been ridiculously nice and attentive, and the interior reminds me of a mom-'n'-pop pizza joint, with checkered tablecloths and cushy booths. There's enough room for groups, though this place is extremely popular, so except a pretty long wait. As another Yelper mentioned, don't come here hungry, because by the time you get inside, you'll be famished. But trust me, it's well worth it.\n\nBathroom Grade: 6/10. Nothing spectacular, but it was clean and spacious, which is all I can really ask for.", "author": "Sylwia W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-19", "description": "One of the best pies in BROOKLYN, after DiFara's (I grew up on his slices). Sometimes Grimaldi's pies are a bit limp but the sauce is always heavenly and the toppings are divine.\n\nThere's definitely a wait, order by pies only, and cash only. If you order to go the waiter brings it out to your car. It's conveniently located to the right, after you get off the Brooklyn Bridge, a block pass the ramp getting on the BQE, which makes it irresistable not to stop by before heading home.", "author": "Michelle Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-07", "description": "I hate the word \"overrated.\"  For a critic, it's less about the object criticized than their bullshit reaction to others' reaction to said object.  That said . . .\n\nGrimaldi's is good pizza, no doubt.  But it isn't the best in NYC.  For my money, V\u0026T's up on 110th or so is the way to go.  But this is very good and picturesque and you can't beat that big damn bridge.", "author": "joe r."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-02", "description": "Everything was fresh on the pizza. I actually saw them making ours as I was waiting in line for the bathrrom.\n\nWe had:\nFresh olives, tomato, mozzarrella, basil, sausage\n\nThe olives were a little salty since I was used to the can kind. Overall, the pizza was good. Didn't blow me away, but I did enjoy the freshness.\n\nExpect a short wait since the place is popular and gets packed.", "author": "Anita C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-28", "description": "Let's start with the take-home message: Long lines are not always indicative of great pizza. \n\nAfter growing up in what I'm still convinced is the pizza capital of America (New Haven, CT), I moved to Brooklyn and learned that there was another place claiming the title of \"Best Pizza Evar!!1!\". This piqued my interest and my ever-present desire for good pizza, so I headed over to Grimaldi's.\n\nAbout an hour after arriving at Grimaldi's, I was still in line at Grimaldi's. My fault for going at 12:30 in the afternoon. Lines for good pizza are no problem for me; the venerable and delicious Pepe's in New Haven has an average line wait of about an hour in the early afternoon. With this many people, I assured myself that I was in for a treat.\n\nSo I made it in eventually and ordered a large (18\") pie with sausage and mushrooms. Pizza came out about 15 minutes later. Not bubbling hot like many cheaper places calling themselves pizzerias, which is good since no one wants to get burned with molten cheese. It was an enjoyable, stretchy temperature.\n\nNow for the pizza itself. The crust is thinner than most pizza you get in the city, and as a result is burned in many places along the edges. For the uninitiated, THIS IS NOT A BAD THING. Pizza of this nature tends to burn because of its thinness, and the crispy sections of the crust add to the overall taste. The crust was crispy on the outside and softer inside, and quite tasty. The sausage and mushrooms I ordered were good, but they were a bit sparse. Pizzas that are overloaded with toppings tend to get soggy so I can understand why they were a bit more conservative with toppings, but I didn't feel that I was getting my money's worth ($2 for each topping).\n\nThe pizza was alright, but I am not convinced that it was worth the wait. For pizza of this caliber, I would not wait in line for more than 15 minutes. Cost was average ($14 for a plain 18\" large, $2 per topping). Cash only, no delivery, no reservations, no slices. \n\nAll in all, the pizza was good, but far short of legendary. Unless I lived a little bit closer and there were no other options, I would not visit Grimaldi's again.", "author": "Eric M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-11-07", "description": "I was in Manhattan and took a subway into Brooklyn. After a short walk, I was in front of Grimaldi's and was seated almost immediately - which I understand is rare because it's usually packed. \n\nWe ordered a small pizza and in less than ten minutes the pizza was at our table. That small pizza had 6 large slices of pure goodness. That was the best pizza I've ever tasted and it was totally affordable. It came to less than 10 dollars a person.\n\nI had just tried some deep dish pizza in Chicago which was good. But it was nothing compared to the quality, freshness and flavor of Grimaldi's pizza. I don't know what they put in the sauce, I don't know where they get that fresh cheese and I don't know the secret to their perfect dough. But I do know that it was the best meal I had on my 6 day vacation! It was well worth the trip there!", "author": "Clara J."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}