{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-21", "description": "Growing up in NY I have never been here. Today was the day we tried it and it was good. The line was only half way down the block but it was kind of cold. Definitely worth standing in line for the experience. We ordered a small the menu said $12 but after we got done ordering our small it was well over $22. They only take cash and they don't sell slices, you have to buy a pie. If you getting it to go they make it right in front of you. Brick oven. And it's perfect. I honestly don't know why it taste so good but it's good and expensive but worth every penny. Most likely I will come here again.  But it will be in the warm weather months in case that like is long again.", "author": "Jatara I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-28", "description": "Walked from the BK Bridge park last night, excited to try a classic.  There was a chalkboard sign that indicated the line started in a roped off area outside...but it was late, the area was empty, and there was no staff outside.  \n\nWhen I walked inside, I was pretty heavily chastised and told to \"read the sign and go wait outside\".\n\nSorry, you expected me to stand outside in the dark in an empty corralling area where no staff is present without checking in inside first?\n\nI walked outside, and right into Juliana's next door.  Pizza was banging, and the staff used common sense/talked to me like I was a competent human being.", "author": "Jade O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-08", "description": "Don't eat here! Tourist trap. There wasn't a single local here...all foreign tourists. Pizza had a strange cheese on top that was abnormally white and not completely melted, sauce was nothing special, crust was ok but I've had better. No beer or wine here! Also, No credit cards accepted here though there's an ATM in the restaurant that will charge you $5 per transaction. Owners and employees are not Italian...appear to be all Russians which may speak to the inauthenticity of this pizza joint. \nSpend your money elsewhere I am sure there are 100 better pizza places in the city! \n\nViews outside were spectacular so save your money; take in the scenery but dine elsewhere!", "author": "Kristina L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-17", "description": "Zero Stars, truly. Glad to hear Grimaldi's closed for Health violations! I went 3 wks ago because Juliana's line was too long and it was 20 degrees outside. It was awful! They use plastic plates... no alcohol... Ridiculous. The tables, the floor were dirty and the bathrooms were worse. Disgusting experience. If people can't get into Juliana, just go home.", "author": "Desiree R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "If you work up an appetite after walking across the Brooklyn bridge like we did then Grimaldi's is a great solution! There was no wait. Plenty of tables at 5 on a Thursday. Sat upstairs. Service was quick. Pizza was amazing! My only complaint is that clearly this place needs a serious cleaning. Ew! So go for just the pizza and the location definitely not the decor.", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-20", "description": "Came here last night with 7 others after Beat The Bomb not too far away.  The pizza was on the money and the serves was superb!!!! Thanks Mimi for making my sisters birthday memorable!!!", "author": "Midda G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-06", "description": "I would have given this place a rating in the negative if possible. \n\nThe food was mediocre at best. The tomato sauce tasted as if someone just bought the cheapest can from a nearby grocery store and poured it all over the dough. If you wanted to see the cheese, you might as well bring a microscope. And they serve the food on a paper plate that looks like it's been recycled three times before. \n\nThe place looks extremely run down and lacks proper ventilation. I think the last time they vacuumed the place was during the 80's: dust in every damn corner of this decrepit place. \n\nI can tolerate mediocre food and lack of proper maintenance if the service is good. Well, bad news folks. This place has some of the shittiest customer service I've ever experienced. I had to use the restroom there and when I opened the door, one of their employees was inside doing who knows what (a little restroom tip: lock the FUCKING door!). I wouldn't have minded waiting outside but he told me to go use the ladies room because he was using the men's room. Don't ever tell your male customers to go use the ladies room or the ladies to use the men's room. \n\nWhen one guy came to pour water at our table, we asked for a small pie to go. He gave us a scathing look, said that he was not the waiter and promptly left. He could have directed one of the waiters to our table but nope! It took another 15 mins for a waiter to show up. Everyone there had a poor attitude and the service takes forever despite the fact that there were barely anybody inside when we were there. \n\nNeedless to say, I'm never going back to that hellhole and encourage everyone to steer clear as well.", "author": "Myo T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-18", "description": "If you are out of town, and visiting New York, you need to have Grimaldi's be one of your top dining destinations at least once.  I'm a huge fan of the flavor that coal ovens impart to pizza, and Grimaldi's has been going it for years.  Fresh ingredients are key to a great pizza, and here you get fresh mozzarella and fresh basil on each pie.  The char and crispiness of the crust is just a thing of beauty. The service here was quick and friendly, and with their new location, the available seating is a welcome addition.  \n\nIn order to have the best experience here, you will want to come at an off time, and not directly at lunch or dinner, unless you have the free time to wait.  Coming at an off time, I've been seated within five minutes each time I have visited.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-11", "description": "Summary.  The pizza is not worth the wait and frustration. \n\nPros \nGood pizza.  Good quality mozzarella \n\nCons\n1. No beer or cocktails\n2. Long frustrating wait\n3. Slow minimal table service.  \n4. Unfair seating practice. There were only two couples in front of us and we waited almost an hour. Large parties are sat ahead of smaller parties. You can be waiting for a half an hour for a two top and an 6-8 top will show up and they will seat them first!!! This happened twice while we waited.  A couple  walked in with out waiting despite \"no reservations.\" When we got in, multiple parties sit together anyways, so we wondered why they just didn't treat us three couples in the front of the line as a big \"group\".  The host was rude, gruff, disorganized and inefficient. Kept asking everyone in line \"how many people in your group?\" Buddy: Get a clipboard, make a list with names, organize yourself.  This experience was a disaster and I will not recommend it.", "author": "Adri P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-17", "description": "3.5 stars\nSimple menu, pizza was ok w pepperoni. U have to get a whole pizza, no individual slices. U have to pay $3 extra/topping which can get expensive if u like toppings. Plenty seating.", "author": "Grace C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-13", "description": "Way overrated. I get better pizza in jersey (hoboken/jersey city/bayonne) and service at a chucky cheese. Went on a Tuesday afternoon 2pm july 2016. I can understand the long wait (about 45min) but then waited additional 30min for drinks to be taken and order. Waiter didn't introduce himself. Chairs we sat in were old and one was chewed open. Took additional 30min to get food. Dude hosting the front was rude and rounded up hungry ppl waiting to get tbls like we were cattle. If u stressed out dude, go somewhere else to work.\n\nTotal of 1hr 45min from standing in line to getting pizza in mouth. \n\nNo much selection at all here. Julianna's next door has more to offer and nicer decor. To pay our bill was another fiasco. I was not full at all from the 3 thin slices i ate so went to shake shack, paid, waitied and then got food. Ate my entire shack stack at grimaldis still waiting for check...threw out my 2nd lunch bc grimaldis is wack and then FINALLY got the check. Lets just say...below avg tip. Better service at a mcDonalds.", "author": "Ceez A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "Love love love this place! Great place to hang out or take out if you want to hang out by the brooklyn bridge. Great atmosphere and great pizza!", "author": "Jaq L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-29", "description": "This place was ok. We had pizza 3 times on our trip and this was my least favorite. They do all ready add the tip on a hand written receipt and don't write what it is so beware it is in small print at the bottom of the menu.. had I not read reviews and knew what it was we would have double tipped for not great service. They also only accept cash and the waiter will stand there as if waiting for you to say keep the change...i feel like they are probably over tipped a lot here with this.", "author": "Allison R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "I've dined several times at their LA location, and was looking forward to coming to their Brooklyn location. \nAlthough the wait was an hour for a party of three, it's always worth the wait.", "author": "Zoe G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-20", "description": "In the area and friend wanted to try the pizza, long story short it was great pizza. Stopped by at lunchtime and was told to return at 11:30 when they open; neighboring restaurants also opened at that same time. Why wouldn't you open up a little earlier for the lunchtime crowd? If my competitors opened at 11:30 I'd open my doors at 11 or even 10:30 to get my business flowing before they did. Anyway, walk into the place was a promptly sat at a table. I've gotta say, the decor leaves a bit to be desired for such a noted place. We wanted some drinks but they don't serve alcohol so we were a bit disappointed in that. We were each going to order our own pizza but the server actually said we'd be able to split a small and it would be enough. I thought that was weird, he talked us out of a bigger sale, plus I've been to the other tourist traps and figured we'd need our own pie. When our small pie showed up it was definitely enough for both of us and I thought the price was very good. Again, the pizza itself was spectacular. I always find it comical that these \"old school\" places are cash only...but feel free to use that ATM in the corner and pay a $5 or $10 transaction fee to get your cash out and then pay us. We didn't get hit with the automatic gratuity, but after reading the comments here I find it total BS and would never knowingly frequent a business that makes up such terms as they see fit. \n\nObviously nothing to do with their business, but how out of towners are treated in that area, while we were leaving we were also graced with the presence of the boys in blue as well pulled away. Stopped and cited for seatbelt violations despite putting the seatbelts on as soon as we got ready to pull out. Really?!? With all the wrong going down in that city at that moment and you go one step lower than a jaywalking ticket to give out seatbelt citations? Thanks NYPD!", "author": "Jonathan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "This pizza is legendary. Plain and simple. Usually get the Margherita pie with pepperoni and italian sausage or a white pie with basil. So so good!", "author": "Philip M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-02", "description": "You would think, pizza is just pizza.  Heck no! Go to Grimaldi's in Garden City.  You will never want to have pizza from anywhere else again.\n\nWe had a small pizza which is enough for two - 6 slices each, which are decent size slices.\n\nYou did a 1/2 and 1/2 pizza\n- 1 side with meatballs which was simply delecious and the other side was Buffalo chicken which was very salty, probably due to the sauce.  I would def order the meatball topping again and skip on the buffalo chicken.\n\nLikes:\n- food comes out quick\n- service is good\n- tons of toppings to choose from\n\nI can't wait to come back here again!", "author": "Amador A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-29", "description": "There's a ton of great pizza joints in NYC and this one is just inside Brooklyn. Brick oven baked and made fresh within eyeshot, the ambiance is casual with paper plates and plastic utensils. Be prepared for a wait as well which you won't regret. But do bring cash. The only reason I didn't give 5 stars is because this is a cash only establishment.", "author": "Rick G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-05", "description": "- Way over rated.   \n\n- Don't go if you can help it. \n\nThey think their food is so good they can treat clients with little to no respect.   It's absolutely a joke how long we had to wait to order, then asking for water was another wait till we have time to get it drill. \n\n- The amusing part is they think their service is so good they decide on the tip they want to charge you.   Four people eating $36.00 shouldn't have to be forced to pay a $12.00 tip, should they?\n\n- And to make matters worst they don't believe in giving change.  I had to ask the arrogant bald jerk for change and I adjusted the tip accordingly.   \n\n-  Asking for a tip is one thing, but to simply take it is just outright bad business.   \n\nThe place next door called Juliana's had a long line but the service and decor looked so much better.  \n\nShame on you Grimaldi's.  This isn't the way to treat locals or out of town visitors as you give Brooklyn a bad name. \n\nPizza was fair.  Not enough tomato sauce.  Mozzarella on the antipasto was so hard you'd think you were eating calamari.  \n\nAgain, we would never come back for this mediocre food and piss poor service.", "author": "John S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-03", "description": "Avoid this place. Not worth our wait of 40 min at all.\nOverpriced! A small pizza with 4 toppings cost 26. The pizza crust came overcooked. The edge was burned, as well as half of the bottom side. Taste bland, maybe costco pizza is better option. All they offer is pizza. No other food at all. \nCash only? Fine! Add tip automatically to the bill for a party of 2? Are you kidding?\nJust go to the Juliana next door.", "author": "Xiaoyi Y."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}