{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-04", "description": "Ordered a pie for takeout. The lady in the front told me it was gonna take 25mins.-30mins. We came back after 30mins. to pick up. She said to wait another 5 minutes. We waited inside for another 15mins. I went back and asked how much longer we needed to wait. And she said coming right up. And the host standing by the door who heard everything said, you're part of the whole restaurant. I told him we waited 45mins total. As I turned back, the guy said to my back, \"you are at Grimaldi's, you are not at Joe's Pizza.\" Wow, so if you are waiting for pizza for 45 mins. and want to know how much longer you need to wait since you have another 5people waiting for pizza outside, I should just shut my mouth and wait?? Then why did you say 25-30mins. in the beginning? The worst service I ever got. And even after she said coming right up, it took another 10mins. Pretty sure, they forgot my order. Honestly, that guy made the pizza taste awful. Joe's pizza might have been better for us. I guess Grimaldi's so awesome, they don't care about their service. I always bring my friends and family here when they visit from another country because it's known for a must when you visit Dumbo but I will never come back here. I will give 0 star if I can. I am so upset that I didn't confront him right away or asked for a manager.", "author": "Jeesook K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "Get hyped for Grimaldi's!! The line may be long but it moves at a quick pace -- and once inside ready yourself for a beautiful symphony of pizza flavors that will serenade your taste buds!! \n\nWe split a large pizza between 3 hungry people and it was enough. We got the pepperoni topping along with the sweet pepper and let me just tell you that this is a combo worth repeating! The total came out to $25 but for a meal that fed 3 people I'd say it's more than worth it! \n\nYou can either eat in the restaurant which has a great atmosphere or take your pizza to go and eat in Brooklyn Bridge Park for stunning views of Manhattan's skyline. Definitely coming back soon!!", "author": "Christine W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-08", "description": "We actually wanted to go to Lucali after watching the new ugly delicious episode on Brooklyn pizzerias, on Netflix. We were hanging around that area at around 5 after attending music concert and were really looking forward to the pizza. Unfortunately we found out, Lucali wasn't open until 5:45 and we had to settle for something close by. We decided to go to Grimaldi's as we were intrigued by the interiors and the open kitchen! Also because it's a 26 year old restaurant and we were sure it has maintained its italian roots. Let me tell you, we weren't disappointed at all! We had to wait a little, but were seated immediately on being called out. I have heard they are very popular for their white pizza but we got the small half and half topping red sauce pizza. The crust was sooo good! Didn't give the burnt taste that most pizzerias end up serving. We were seated on the 1st floor and could see the open kitchen below. We were so impressed by the whole pizza making process. Each and every Pizza was hand tossed and made with love. Will come back again to try their white  pizza! \nSuggestion: The small pizzas are huge! I was full with just two slices. But if you're in for a food coma! Go for a large one! Cause why not! ;)", "author": "Ankita N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-03", "description": "Grimaldi's is Authentic Brooklyn All day...I hope that says it all. Foods is good and fresh but not to brag about. The wait and service, well again it's Brooklyn. Cash  Only! That was annoying. Interesting, none of the authentic spots in Brooklyn take Apple Pay or Cards. For a city they need to catch up with tech. Who carries cash?", "author": "Santiago M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Every time we make a trip to New York City we take some time to visit Grimadi's. This time was no different. After a nice walk on the Brooklyn Bridge in 20 degree weather my boyfriend and I were happy to walk into the warm familiarity of Grimaldi's. We were immediately welcomed and seated in the upstairs area with a lovely view of the bottom area. We ordered the small pepperoni pizza which was more than enough for both of us. Service was great as usual and the pizza some of the very best I've had in Brooklyn. We will visit again and again.", "author": "Isabel O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-26", "description": "Some of the worst and rudest service I've ever experienced. We walked in and tried to sit at the bar, only to be confronted by the manager... telling us the ways of service, and people can't sit at the bar? Why have chairs ? \nI love love Brooklyn but managers that act that way just because you are popular pizza spot make regulars not want to return. It's just pizza at the end of the day, in a diner setting. \n\nAlso, if you're a \"manager\" don't take up space by sitting at your own bar during service. Run some drinks maybe?\n\nWe left and walked right next door to Juliana's and enjoyed better pizza and professional service.", "author": "Max T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-04", "description": "The must-go restaurant whether you are a pizza lover or not! It absolutely deserves its fame!", "author": "Kaiqi Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-25", "description": "I thought Grimaldi's prices were reasonable, which is a rarity in NYC.  I went mid-afternoon and avoided a long line. Which is a good thing, because while the pizza is very good, it is not life-changing.   We have equally good pizza in Boston.  I went with the Sausage and pepperoni, which oddly enough, was almost better served cold the next day!   Now that's a special pizza that can pull that off!  \n\nThe downside to this place? Other than potentially long lines, Grimaldi's is cash only and does NOT serve slices.   \n\nAnyway, I recommend Grimaldi's if in the area in looking for a good pizza!  The one thing I can't decide: is it better than historic Lombardi's?   Honestly, they are very similar.   Can't go wrong either way, though Grimaldi's is a little easier on the wallet.", "author": "Jonathan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "First time here and I couldn't be more impressed by the attentive customer service here. The staff was so personable. I'm on vacation by myself first time ever in New York and this really was a highlight in my trip. BEST PIZZA HANDS DOWN!  Thank you to Jack and Jimmy ! You guys are awesome.", "author": "Aya F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-15", "description": "Simple:  pizza, soda, dessert.  Reasonable price.  Went on a Saturday for lunch only had to wait 5 mins.  Went with the basic pepperoni pizza. Good!", "author": "Mark M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "This has to be one of the best pizza places! I love how it's in dumbo AND it's an actual pizza spot. It's such a nice sit down place. And the sit down isn't even that fancy. Most people sit and eat for 15-30 mins tops! Even if there's a line outside - it moves so fast! My friend and I only waited 6 minutes? Deff less than 10 mins. Also, it's not that loud either and you can enjoy your food with your company. Beware - they only sell pies", "author": "Lilly T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "There was a line when we got at Grimaldi's and waited around 15 mins to get seated. Pizza was great. We had half white and half tomato pizza. Crust was thin and crunchy. Beware that tip is already included in the bill which we realized after we just left.", "author": "Rick C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-01", "description": "Just came here to the middle of nowhere at 10 pm. According to Google Grimaldi is supposed to be open until 11 pm. We came for nothing, door service was pretty harsh.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "Great place to come get pizza after walking the Brooklyn bridge! There was no line the night we came so we were seated right away at the bar.\n\nWe got a pepperoni pizza and I thought it was delicious. I like a crispy thin crust, with not too much sauce and melted cheese and that is exactly what I got. It was cash only so make sure to stop at an atm on the way and enjoy the pizza!", "author": "Alina V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-23", "description": "Everyone's heard of Grimaldi's, but I had never thought of going out of my way to try it. Well, my mom was visiting from out of town so I decided to take her on a walk across the Brooklyn bridge and then have Grimaldi's. \nAt 2pm on a weekday, there was still a bit of a line. We ended up waiting around 30 mins, and when we were finally ushered in, we were seated on the 2nd floor.\n\nThe decor is simple and all the utensils and plates were paper/plastic.  We added mushrooms to a large original, which already comes with tomato, basil and cheese. It was good- hot, juicy and flavorful. The bill for a large pizza and cappuccino came to $30. Considering the wait, price, and experience (paper plates, plastic forks and knives) I'm not sure I would go back again.", "author": "Esther S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "Good pizza if the line isn't too long, although not the best pizza I've ever had. I coincidentally happened to come here 10 minutes before it opened, so I was second in line. They had us line up outside and took note of how many people were in each party. \n\nI got a small pizza with pepperoni. It didn't take too long for me to get my pizza. Objectively, it was a very good pizza. Great flavor and dough. \n\nMy mistake was coming here alone. They do not serve slices, but I thought I could eat a personal pizza by myself, right? (I did so the night before at another pizza place for dinner.) Unfortunately, it was a lot more filling than I anticipated, so I was only able to eat half (I took the rest to go). For reference, I am twenty-something year old female, but I can usually eat a lot.\n\nAlso, there were multiple flies flying around the restaurant, and I had to shoo a fly away from my pizza a few times. An employee was swatting flies behind the bar, right in front of me, which was not the most appetizing thing for my experience. \n\nOverall, it was a good pizza and I wish I had come here with at least 1 other person. Two people could have shared the small pizza and been full. I think I would have had a better experience if I had come with a group and was able to eat a slice of a few different kinds of pizza.", "author": "April H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-14", "description": "We got a small regular pizza which tasted pretty great but it wasnt amazing enough for us to feel like it is worthwhile making the trek to brooklyn again to eat here the next time we are in NYC. Additionally the \"bouncer\" or the man out front who asks each group the size of their group and seats them was quite rude with us. He was asking my boyfriend and i to sit \"3 tables from the back\" which meant a table next to a couple who had their coats and bags on the chairs meant for our table. Since we had just walked into the restaurant, we had assumed that those coats were of their friends and they just went to the washroom or soemthing. So we were quite confused. Instead we thought we misunderstood the bouncer and saw two empty seats and placemats at the bar right in front of us that we thought were our seats instead. Not to mention although it was right in front of the door where there would be a cold draft, we didnt mind because we heard this place had great pizza and wouldnt have minded the discomfort for great food. At this point the bouncer quite rudely clapped his hands to grab our attention and yelled \"Hey!\" And condescendingly said \"i said 3 tables from the back\" and looked at the two chairs next to the couple I mentioned earlier. \nHave to mention that our table was actually 2 tables from the back and not 3 which also added to our initial confusion. \n\nI also would've expected a highly regarded restaurant like Grimaldis would've had clean washrooms and not washrooms where there's toilet paper strewn across the ground and half the toilet paper dispenser on the ground. Not to mention the entire place looked like it had a thin layer of dust. I was also not impressed with the paper plates. As a place that serves food, I would be worried about the cleanliness of the food that I am about to eat when the establishment is clearly not well kept or cleaned. Even if we didnt have such an unpleasant experience with the bouncer, I would've still had the same things to say about the cleanliness of this restaurant. \n\nFor a restaurant that served pizza that was relatively expensive to other restaurants and the amount of traffic they get, I'm sure they could spare some money to get the place cleaned. I believe our small regular was around $16 dollars which was just tomato sauce, cheese and basil leaves. Additional toppings started from $3 each.", "author": "Melody L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-05", "description": "I don't understand what all the fuss is about and people waiting in line. Their pizza was ehhh... nothing special. The worst experience about it all was the lady working in the front. She was rude and frustrated, I believe her name was Vanessa. \n\nWe walked in to order a to go pizza. She was rushing us and was super unhelpful. They didn't allow us to bring in our stroller and they don't have a changing table for babies with all their 3 story building. I had to change my baby on the benches in the stairwell while people were looking at me. Anyways I will never come back to the place. I wish I would of went to the place Nextdoor Julian's.", "author": "Sharon A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-05", "description": "Service is the worst service I've ever got. We came with our 13 months daughter and her stroller that is not allowed to get in by what the owner told us when we came. \n\nSo we decided to have a pizza to go cause hey this restaurant has a great name and some great reviews and even the long line to get in is impressive, but for me all of those are worth nothing if they are treating a customer very rudely.\n\nVennesa the lady that \"took care\" of us was so rude and impolite to us (me and my wife). From taking the order to getting it. When we got the large pizza we ordered, she didn't want to give us any Parmesan cheese (only some garlic and spicy pepper in a small container so I asked for some and she grabbed the small containers of my hands and put the Parmesan on top of the garlic small container. \n\nI asked for just one more small container of Parmesan (it's a large pizza) and she became even more rude: \"this is the last time you call me. \n\nWe wanted only to have a pizza and found ourselves in this uncomfortable situation so if I could they would've get from me even less than one star.", "author": "YS 2."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "Grimaldi's is so consistent and probably some of the best pie you can find in the city. Don't be afraid if there is a line outside, they move it along fairly quickly. \n\nOnce seated, you build your own pizza. You start by choosing the sauce then move on to the toppings. You can get as little or as much as you like, but they do each come with a price tag so be conscious of that. \n\nThe space is large in size but nothing about the interior impresses me. The service has never been bad but in true NY style, they aren't trying to be your buddy. \n\nA couple of things to note.\n\n1) They do not sell booze.\n2) It is cash only.\n3) They do not sell by the slice. You must buy the full pie. \n\nGo for some of the best pizza in NYC, go after a stroll through Brooklyn Bridge Park, go with a group and choose one topping each (unless you have a group of 20), but whatever you do, just go!", "author": "Zachary M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}