{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-19", "description": "If I can. I would give zero star because IT IS THE WORST pizza EVER!!!!\n\nNow, why is a worse? Simply put, the bottom of the pizza was BURN .with black color type of burn patches. You can taste the bitterness of the ASHES!!  lolz. It was SOGGY like the other ppl mentioned here. Mines was like dripping wet!It might be good before, or good sometimes, depending who fix your pizza.\n\nI wonder how can you make a pizza taste so horrible. Even though i had took few culinary sessions and made pizza myself before, but im not picky especially after being starved after 45 min of wait time.IT WAS SO WRONG!!  When I walking out the restaurant, I observe how the guy made the pizza, he simply put tomatoe sause after he put the cheese and the topping! So, that's dough, cheese, toppings then SAUCE!? then olive oil and then heat it up? No wonder my pizza is dripping tomato sauce kinda soggy.\n\nI didn't really care when I ask the waiter why is my pizza burn and soggy, he first gave explaintion that because the sausage needs to be cook 10 20 min on the pizza so that's why it's burn.  (Right, but my Italian sausage was pale white instead of slightly brown as other pizzeria shops and if they make the pizza fresh, the fact that they serve our pizza within 5 min after we order the pizza is not possible to get a good pizza.)Well. I then ask him why is it soggy, he gave me this i dun gave a damn type of look , guess what he said, he said then just DON'T come here EVER.\n\n\nIf you guys still wanna go there, have fun waiting 45 min for a burn and soggy pizza, and worst service ever! \nI left the place still hungry, not to waste the Money and time, I just ate their bland tasting toppings.\n\nWhen they are getting famous and rich, they hire a person who don't know how to make pizza, take your money, and say , next!", "author": "Calla J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-18", "description": "No reservation . If u come here just need wait the site...it is so famous place to eat pizza in New York !!!!!!!!!!!!!!!!!!!!!!!", "author": "Jingyu L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-02", "description": "I am a big big pizza lover, BIIGGGGG. so coming to new york and getting to try some coal oven pizza. I was coming with some gigantic expectations, maybe i expected to much?\n\nThe ingredients tasted fresh, and I really tasted the coal flavor in the crust, but the deal killer was how kind of soggy and flabby the crust was. \n\nYou know when you pick up the slice and it just sags to the floor along with all the toppings. Big No No for me.", "author": "Ant C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-03", "description": "The pizza and service was great. For some reason it just didn't agree with my stomach. But it might be worth still eating.", "author": "Theo J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-29", "description": "I have lived in the New York area for many years and tried Grimaldi's pizza for the first time this weekend.  Finally had to check out the hype and see if the reviews were accurate.  First you have to wait at least thirty minutes outside on the sidewalk to get a table, and then when seated wait another ten to fifteen minutes for service.  Pizza I thought was average at best, my local pizzeria spot is far better !!   What really makes it unworthy is the lousy service, the wait staff is the worst of the worst and the 'flies' flying around not so appealing.  Save your time and money and find a better pizza spot!!  As others have stated it's a tourist trap spot.  I say skip Grimaldi, not worth it.", "author": "Hetal P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-17", "description": "On our quest for the best NY pizza, we had to give Grimaldi's a try. We got there at around 7pm on Wednesday, 12/8 and didn't have to wait so I was very happy. It took a little bit of hard eye contact to get someone to take our order, but once everything was on the table, it was really good. We had a half white/half original pizza. The pizza was thin and cripsy, the sauce not being too sweet.\n\nTo round off our night, we saw some jerks almost get in a fight with the owner (old guy). Perfect welcoming to NY and Brooklyn.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-13", "description": "Definitely not the best, but it's pretty good pizza. I had my doubts since I knew a lot of tourists go here. But it's a good introduction to NY pizza. \n\nThe wait is long, which is always a good sign. I think we waited an hour on a Saturday afternoon, which isn't bad. Other places or time can have you waiting two hours. It's best not to go with more than three people to get a table faster. Groups with at least 5 people will have to wait longer. If you're doing take-out, it's faster but you'll still have to wait in the same line.\n\nOk, the pizza. The price wasn't too bad. For three people, one large regular pizza and three toppings, with drinks, it only came to about $30. It was about a 15-minute (?) wait for the pizza to arrive at the table. But anyway, the pizza was good, not greasy and full of flavor. I like the fact that they didn't pack it with too much toppings and there was perfect balance of all the flavors in my mouth. I had the regular pizza with sun dried tomatoes, mushroom, italian sausage and basil. I love the crust part though but it came out burnt and it was just too nasty to eat. I'd come here again soon but not anytime soon. \n\nOn a good, sunny day though, get the pizza to go out and have it at nearby Brooklyn Bridge Park.", "author": "Jaclyn A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-02", "description": "The pizza was good...now the bad news: the customer service was the worst I have ever experienced. The host was rude and gruff with everyone in line.  I tried to ask him for a menu 4 times and he ignored and shrugged me off every time.  Every employee is a man...no women, and their faces look like they've been to a funeral. No one smiled at all. Restaurant was hot. Their were flies landing on me and the pizza. As I walked out, no employee said a word to me. If I lived in Brooklyn, I would either order takeout, or go to Juliana's next to Grimaldi's. Customer service was -3 stars!", "author": "Paul S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-16", "description": "3.5 stars\n\nI came here to share a pizza with 3 other friends. I had tried Lombardi's a few months before, so I wanted to try something new. Unfortunately, I don't think this place compares to Lombardi's (although Grimaldi's is cheaper). \n\nWe got a mushroom and sausage pizza, which was pretty tasty in how fresh it was but also a little bland for my taste. I also thought the dough was not cooked all the way through or maybe too thin in the middle of the pizza. The crust was really good. I thought that 2 slices was definitely enough to make me full. \n\nWe didn't have to wait long for our pizza or to get seated, which is a plus compared to busy Lombardi's, but I feel like our server didn't pay much attention to us either.", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-08", "description": "Took the walk over the Brooklyn bridge then exited and headed for the water taxi's.  As we passed a corner, we saw people inside flipping pizza dough.  To my surprise, this was Grimaldi's!  They moved.  Not far.  But they did move.\n\nAmazingly, at 11:45 AM on a Thursday, there was no line.  We walked in and sat at the bar to enjoy a margarita pizza and a bottle of Chianti.\n\nI had heard of this place before.  But this was my first experience.  Enjoyed it!\n\nBe aware.. CASH ONLY", "author": "Tony P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-27", "description": "The first time I came to NYC a few months ago, I headed to Grimaldi's after several recommendations.  I didn't end up eating there because the line was ridiculous, so I headed next door.\n\nI'm visiting NYC again, so I decided to give Grimaldi's another chance.  I went on a Saturday night when it was threatening to rain, and I ended up waiting for less than 5 minutes.\n\nWe ordered a small pie for 2  and added pepperoni and ricotta.  We didn't have to wait too long for our pizza to get there.  While the crust was thin and crisp and I do like a little bit of char to my crust, I think ours was almost too charred in some spots.  Additionally, the mozzarella on our pizza was very chewy and thick and not gooey like you would expect it to be when just coming out of the oven.  Not sure if they let it sit too long before bringing it.  The other toppings and flavors were pretty good, but the mozzarella thing was disappointing.\n\nAnother disappointment is their insistence on being a cash only place.  Seriously, it's 2013 and you still refuse to take cash?\n\nOverall, my Grimaldi's experience was good, but not great.  If you want to get basically the same pizza (but better IMO), while avoiding the typical wait and cash only policy, go to Juliana's next door.", "author": "Tiffany C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-31", "description": "Great pizza joint but was it worth the 20 mins wait and an hour to travel there, probably not so much. It's similar to Lombardi. My group of 6 got two large pies of a white mozzarella with italian sausage and a pepperoni regular pizza. I thought the white with italian sausage was lacking some salt but the pepperoni pizza was delicious! But the one thing I really wanted more was cheese that actually cover more of the crust. There's a huge part of the pizza that lacks cheese which defeats the purpose of a pizza. Other than that, it was a great experience. Not itching to come back though.", "author": "Olivia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-06", "description": "Filled with various promising raves and reviews from my friends, we decided to walk across the Brooklyn Bridge on a beautiful Thursday for this gemstone. Arriving a few minutes shy to high noon, the fella and I were lucky enough to catch a short line. A few minutes later and we would have to wait at least an hour before we got seated! Not to worry, you can always chit chat with the other souls waiting in the cold with you (= \n\nAbout 15-20 minutes later, we were finally seated. The fella \u0026 I decided to go with the six sliced regular pizza (crushed tomatoes, mozzarella, \u0026 basil) with additional toppings of pepperoni, mushrooms, \u0026 Italian sausage ($2/each additional topping.) Minutes later, our anticipation was to come to an end! Thin crust, fresh ingredients, and the cheesiest of cheese...I should be happy, right? Well, I almost was. \n\nMaybe it was the all the hype or maybe this wasn't the type of pizza for my penchant. Although the fresh crust, tomatoes \u0026 cheese really made a noticeable taste difference, I just didn't feel that this was worth standing in line (and in the cold, mind you!) for. Nor, did I feel that this was the best pizza I've ever had. \n\nWorth the try, but that's about it. Next! \n\nP.S. It looks like they'll take customers by size of party over who's first in line, so be attentive and ready to grab a seat whenever available, otherwise you'll be waiting forever!", "author": "Vicki T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "We have been coming here since it was Grimaldi's.  Then again while it was \"Grimaldi's\".  And now it is Juliana's.  Don't be fooled by the tourist trap a couple of doors down.  This is where the locals go for some Patsy pizza.", "author": "Amy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-08", "description": "Delicious pizza! My husband and I devoured an entire pie with sausage, pepperoni, and ricotta cheese added to our red sauce. Amazing! The wait was long but not bad, I think it was worth my time. Plus you get a great view when you turn around and watch the beautiful sunset!", "author": "Hedder S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-07", "description": "I don't know what I have been eating my whole life, but it sure wasn't pizza!!!  This pizza is utterly amazing, mind blowing. Somehow got in with no line late at night. It is to die for. And I would wait an hour or two for it today!!! Yum!", "author": "Jamey M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-26", "description": "The pizza was decent but nothing special, especially not worth the 40 minute wait on line and another 40 minutes waiting for the pizza after placing the order.\n\nI would've given it a 4 star rating if it doesn't for the lack of service.  If the service was better and the food came out quicker I would definitely change my rating to a 4 star.", "author": "Jim J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-12", "description": "Came here for lunch with 3 other people. They seated us and as we were looking at the menu, they asked us kindly if we would like to move to a table that was more comfortable and spacious. I was already comfortable where we were, but whatever, we just moved. As I walked over to our new table, I noticed that it was in a corner. And all the tables surrounding us were ASIANS. WTF. I felt so segregated. Not only did I feel extremely uncomfortable from thinking that they moved us to sit here because we are Asian, but the so called \"more spacious\" table was in the corner of the room and it was WAYYYYYY more cramped than the comfortable, non-segregated table we were originally at. Also, our pizza had a giant burnt black bubble on it.", "author": "Lina C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-18", "description": "Who ever said this is best pizza, well does not know anything about pizza.\nI found this pizza to below average. Service downright terrible.\nBack in the day I used to live in Brooklyn in Bensohurst/Dyker Heights area and back then it used to be Italian area, any corner pizza shop was putting out 100% better pizza. \nThis place is nothing more then tourist trap, plus cash only really rubs me the wrong way.", "author": "Regina D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-29", "description": "moment of truth/disclaimer: maybe if i had reviewed this place right after finishing my meal there (almost 3 years ago now..) then the rating would have been higher by one star -- recently i had the joy of experiencing Roberta's Pizza and can't possibly see how Grimaldi's could compare\n\nthe ingredients are fresh and plenty, the pizza slice is standard new york size so for myself that means i finish 2 max -- Roberta's is a bit smaller, so it's more my style.\n\noverall, it's a brooklyn experience and more convenient to get to than Roberta's - and a more pleasant experience than dealing with crazy man at Di Fara's - so i guess it's got some wins", "author": "Donna K."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}