{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-11", "description": "Ok, walk over the brooklyn bridge (don't go all the way to Tillary St., there is a stairwell exit that will save you about an extra mile walk)!  Prepare to stand in line for about an hour-hour and a half and enjoy one of the best pizza's in NY.  The line is cool anyways, do like we did and get ice cream from the Brooklyn Ice Cream factory and eat it while you wait...also meet some of the cool people that have come from all over the world to try Grimaldis!  Once you get in you're seated usually next to strangers which is cool and you place your order.  They'll bring your pizza out and put it on the metal stand at your table (you have to utilize all the space on the small tables).  It truly is amazing, if you go use the bathroom you can watch them make them...it's like art.  They cook it at 900 degrees so it only takes about 3 minutes per pie. Prepare to take the subway train back to Manhattan because you'll be too full to walk back across the BB ha!  Also prices were amazing!", "author": "Bill B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-29", "description": "It was good but I was expecting more from a famous New York pizza joint. People will probably want to slap me but I found Pizza Suprema to be better. Regardless though, what I did enjoy was the freshness of the ingredients and the way that the pie would just fold up in your hands.", "author": "Jeffrey N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-04", "description": "It pains me to leave such withering feed back for a once great restaurant.  Our last experience was so horrible I have waited nearly 8 months to cool down so as not to be too scathing.....where do I start.  The evening started out well actually.  Due to heavy rains throughout the day and early evening there was not the usual line and wait.  We were seated immediately.  When does that ever happen?  We felt that we were in our own Seinfeld episode where everything was going our way - we only experienced that feeling for a nanosecond.  Though the whole restaurant was basically open we were seated in a dark corner under a malfunctioning speaker that was crackling and snapping.  The music was blaring - not the usual music but top 10 teen music that would have been tolerable if the volume/speaker crackling weren't so loud.  Our waiter was a total jerk.  We couldn't get over how obnoxious he was - he was 25-30 with dark curly hair.  We thought nobody could get away with treating customers the way he did unless he was the owners son.  The rest of the workers seemed aware of him and ignored him at the same time.  He was repeatedly rude to every customer who came in.  He actually yelled from the bar area at a few people (while he stood their with a self satisfied smirk on his face singing along .....\"you'd better run baby run faster than my bullet\".  We moved to a table that put some distance between us and the speaker so we could have a conversation.  Soon a small group of Asian business men sat next to us.  They had some problems reading the menu and asked a few questions.  There were so very polite.  One of the gentleman asked a question but due to the blaring music the obnoxious waiter actually screamed at him in the most scathing manner informing him \"We only speak English here buddy, if you want something you have to speak up and tell me straight\".  All four of the gentleman just stared at their thug waiter with dropped jaws.  If our food had not already arrived we would have left on the spot, the treatment was just that disturbing.  Our pizza suddenly became as tasteful as saw dust.  We felt stricken for the gentleman.  It was one of those rare moments when you are ashamed of being an American because your fear the victims will  think you too are in on and in agreement with such shocking behavior.  For a moment we thought there must be a hidden camera and this is all a joke.....maybe we are in a surprise Jersey Shore episode....We have come to Grimaldi's for years.  It was one of our favorites.  The service has hardly ever been good - with the exception of a delightful polish waiter that was around for years though we did not see him during our last visit.  In the past we came for the great pizza and found charm in a rather jaundiced way.  It pains us to say we will probably never go to Grimaldi's again nor bring our friends when visiting.  I can never in good conscience ever refer anyone to Grimaldi's again.  Even after 8 months my jaw clenches when I recall all the shocking details.  Grimaldi's really has an inflated measure of their worth if they imagine people should/would be treated in such a fashion.  If that belligerent customer distaining  twit worked in my restaurant I would spank him then give him the boot.  If this treatment continues, tourists will continue going for a while but the tide will eventually turn against Grimaldi's and a newer pizza darling will arise elsewhere providing gracious service along with wicked good pizza.  I sincerely hope it never comes to that.", "author": "Stripes T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-09", "description": "Out of my whole NYC trip, this is the place I wanted to go the most and I saved it for my last.  I read reviews of people saying eat here then walk over the Brooklyn bridge. Well I did the opposite, I got to Grimaldi's by walking oer the Brooklyn Bridge from Manhattan.  On to the review, luckily I got there around 7:30pm on a Sunday and there was no line.. the place was actually only 65% full.. and the environment was lively and good.. you can tell this is italian runed.  The pizza was definitely better than most.. it wasn't out of this world good but its something I will definitely recommend to others. My only annoyance was that when I paid my check.. I actually had to ask a waiter for my change.. I actually waited alone in an empty table for over 5 minutes while all the waiters were hanging out in the kitchen(mind you, this is a small place, so it wasn't like they were far from me, they were in plane eye sight) so after I figured they weren't going to come back I called one and told them I wanted my change.. which was $5.  and he actually brought me back $4.25.", "author": "Keian K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-04", "description": "lots of hype, heard about this place on various nyc tours.  felt it did not live up to it.   if you want thin crust pizza go to lombardi's instead.  not close to a subway station which i did not like.", "author": "Kiyo O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-07", "description": "Mostly hype, not all that great for what could be a ridiculous wait. I've had better all over NY/NJ. Once was enough. Decent experience...Bit of tourist trap.", "author": "Nomadic T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-01", "description": "Go to Julianna's instead!  We've been to Julianna's multiple times and loved it there.  My husband decided to try Grimaldi's to see what all the family rivalry was about.  What a mistake!  Our waiter barely acknowledged us.  He brought us half-full glasses of warm water then disappeared to spend the rest of our meal talking with his friends at another table.  Another waiter dropped our pizza on the table and disappeared.  Not a single server bothered to come to our table any other time.  The same held true for all of the tables around us.  The pizza was mediocre.  Great crust but skimpy toppings and no sauce to speak of.  To make things worse, while we were waiting for someone to finally bring our bill, I watched a busboy clear dirty dishes and glasses from a table with his fingers in the dirty glasses, brush the crumbs from the table, and without washing his hands, go straight for clean dishes and silverware which he had his filthy hands all over.  I have never seen a more sickening lack of sanitary practice in a restaurant.  Whatever you do, skip this place.  There are such better, and I would hope more sanitary pizza places in Brooklyn Heights.", "author": "Joanne L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-08", "description": "One word to describe it: OVERRATED.  We went on Sunday July 5. By 11:30 line was half a block long.\nWe would have been seated at 12:10 but group of tourists (about 30) just marched in right in front of us and we were told that wait would be another 30 minutes.  Yeah right. At least an hour. So I just placed an order for takeout and 40 minutes later I got my pie. There is the restaurant right next to Grimaldis with outside seating. So we got couple of drinks and ate pizza right there. We had more fun just seating outside, enjoying weather and drinking wine than eating pizza. It was just OK. Nothing special. We had better pizza with much friendlier service and no such a stupid wait.\nShake Shack is the only place that I can stay in line for 45 minutes. But it is in the park and baby has a great time.\nIf you live in the area there is no reason to go.", "author": "Vlad O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-10", "description": "the pizza was pretty good.  the line went pretty quickly.  i didn't find the staff particularly friendly.  would return though . . .", "author": "Heather C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-30", "description": "Come on......\"The best pizza in New York\"?  If you have to wait more than a 30 minutes on a nice day, it's not really worth it. The sauce is good and the pizza was tasty, but if you really are from New York and not a tourist, this place should not knock your socks off. If it does, you haven't eaten enough pizza in your life or you're just blinded by the hype.", "author": "ed e."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-19", "description": "Great NY Pizza! I went here today to get a large pie. I took it to go and the wait was 20 minutes, but if you eat it here its like 1-2 hours. It's waayyy better than Goodfella's and better than Lombardi's. There's also a great ice cream shop to go to down the block when you're done. They don't do pizza by the slice so you'll have to get a whole pie. It's soo worth it and not expensive.", "author": "Tiffany B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-09", "description": "BEST PIZZA in the WHOLE TRI STATE AREA!!!!!!!!!!!!!!!!!!!!!!!!!!!!! LONG WAIT but, worth it...", "author": "Deedee A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-15", "description": "We heard rave reviews about this AMAZING, life changing pizza place in Brooklyn.  So we decided to go.  We got at 3 in the afternoon and there was line down half the block.  we couldn't imagine what it would be like during peak hours.  After waiting about a half an hour we were sat at the end of a communal table, we were so happy we weren't squished in the middle of the table.  The good thing was that with the loud, cramped atmosphere the communal table wasn't super awkward.   When we got our pizza we were really excited.  As it turned out the pizza wasn't exactly life changing.  The middle of the pizza (point of the slice) was kind of thin, soggy and pointless to eat.  The rest of the pizza was pretty good though.  Overall we enjoyed the experience but didn't think it was life changing.", "author": "D A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-12", "description": "Lot's of tourists forming the line outside of Grimaldi's, but it is well worth the wait if you have the time.  Highly suggest going on one of the less touristy days (Monday or Tuesday).  Really is some of the best pizza in NYC.  Waiters could be characterized as \"rude\" but that's to be expected from a place like this.  Bangin!", "author": "Casey L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-19", "description": "I really like it!!!!!!!! But the server that we got was rude! He also seemed angry. I didn't like the motzerella cheese. I like the regular cheese. But it's still good", "author": "Ezra R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-30", "description": "I am a native of California and we don't have much in the way of fantastic pizza. We have chain restaurants, so with that being said, I fell in love with just about any pizza I got during my trip to NY. I came to Grimaldi's almost as soon as I got off the plane. I had heard great things about it and I was not disapointed. The pizza is great. It really is. The line wasn't terribly long but the restaurant is so tiny; you have to squeeze past other people and you have to sit super close to other diners. The ambience is nice, however. I liked Grimaldis so much, I went back again last night. The pizza was even better than it was the first time but the line was twice as long. I was tired so standing in line for so long annoyed me. I also got annoyed when the owner took smaller parties behind us first. There were 3 of us but they were calling in parties of 2 left and right so there were people who hadn't \"served their time\" getting in ahead of us. \n\nOverall, the pizza is great, the ingredients taste fresh, they use thicker sliced homemade pepperoni and fresh basil. I have no complaints about the quality of the food but I would not recommend takeout. The pizza WILL get soggy because it's thin crust.", "author": "Carmen W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-19", "description": "I tried to take my two small children there for lunch after a visit to Brooklyn Bridge park.  They wouldn't let us in with our umbrella stroller or wait in line with it.  So I had to hold the two of them in my arms for 40 minutes.  Having that much time I got to read the signs in the window calling it a \"family friendly\" restaurant.  Haha.  The staff was hostile to boot.  Then once inside the interior was filthy, and my daughter started screaming when she saw a cockroach under the table.  I think their \"B\" rating from the Health Department was only achieved through payoffs.  Mix the endless tour groups in on top of all that and I'd say run, don't walk, to any other pizzeria in Brooklyn.  Famous pizza, my ass.  Somebody should clue in the European tour operators that any random place in Brooklyn is more authentic than BS Grimaldi's.", "author": "Scott P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-12", "description": "The pizza is good, all right? But there should be a separate rating system on Yelp to denote when something is just too overrated. The pizza certainly deserves its four stars, but the experience of the place takes it down a notch. Main thing being that you'll wait forever with tourist families and over-zealous pizza religiosos to get in. If you come at the wrong time in the afternoon (think you're smart, eh?) then you'll catch the 2-hour downtime of the coal oven cleaning and you'll sit there without any table service (and be lucky you're sitting! People are just standing around outside rain or shine!). You know what? There's enough amazing pizza in this city to spare your family the hours of annoyance and just go get yourself a slice at any of the other fantastic 4+ star places -- dad will be grateful, mom will be grateful that dad's grateful, the kids couldn't care less, and grandpa wasn't going to understand anyway.", "author": "Mel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-12", "description": "I've been to hundreds of pizza joints in NYC, and this is definitely in the top 5.  The pizza is cooked in a brick oven.  There aren't too many of those left in NYC.  Because of the brick oven, the pizza is very fresh.  It's not too oily and tastes amazing.  Everytime I go to NYC (and I go often), I always stop by here.  It's a bit on the pricey side for pizza (hence the 4 stars), and because the pizza is cooked using a brick oven, the wait time is rather long.  However, the final product is so good, it's well worth it.", "author": "Neil S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-26", "description": "I finally had a chance to taste Grimaldi's pizza and I must say it is pretty good. The crust was thin and crunchy like a NY slice of pizza should be with just the right amount of cheese and tomato sauce. I don't like pizza with too much toppings on it because it takes away the authentic flavors of what a pizza should taste like. Anyway, I had mine with fresh garlic and it was just perfect. To wash it down, I had their home made root beer which was a bit too sweet for me but might be perfect for those with a sweet tooth. Personal space here does not exist as the seats are all right next to each other. Prepare to wait 30-45 min on a good day but it is definitely worth it.", "author": "sally w."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}