{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-11", "description": "Bouncer or host at the door is rude! But the place was recommended so we tried it anyway. \nCome prepared! Cash only - but they have an atm.\nPizza was good, but not as good as Chicago", "author": "Layda C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-21", "description": "Okay, so finally made my way under the Brooklyn Bridge to try this place. Two friends and I arrived and the line was backed up around the corner. We go over the host/bouncer/something  who was angrily smoking a cigarette next to the entrance to ask how this works - we wanted to take a pie to go. He directs us inside to be greeted by the waitress who couldn't more obviously show a hatred of her job. We ordered the original large pie. Waited around inside for a good five minutes or so, enjoying the old celebrity photographs on the walls, Sinatra, etc. The same man from the door came over and told us we need to stand outside to wait for the pizza to be ready - um... okay? After about 20 minutes it was ready. Carrying it out on a piece of cardboard wrapped in a giant size brown bag (pizza + 3 sodas, $26 later, by the way) we chowed down.\n\nConsidering the hype, the pizza was mediocre at best. Sauce was incredible, I'll give them that. However, the pizza was undercooked, greasy, and didn't fill us up at all. I'm a small guy and could've eaten all 8 slices by myself. As a native New Yorker, I'd call it \"a solid pie.\" I understand NYC tourists who consider Dominos \"good pizza\" probably compare trying this place to discovering fire. The staff was incredibly rude, but they can be and they know it, because no matter what tourists are always going to try it. \n\nOverall, was the pizza good? Yes. Something to go crazy over? No. Will I go back? Probably not.", "author": "Rob S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-10", "description": "OVERPRICE and ONLY CASH!?\nPlus ... PLASTIC PLATES\nThey have an ATM which charges a commission (minimum $5)Tips are already included and you don't have the option to choose.\nRude staff\n\nDo yourself a favor and don't go... Don't rely on yelp or trip advisor reviews.", "author": "Maria S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-22", "description": "So our plan to go to Grimaldi's for dinner ended up happening much later in the day then we anticipated so we had to get a few pizza's to go because they were about to close. They made them fairly quickly - probably because they wanted to leave soon! :)\n\nPizza was tasty. Liked the extra mozzerella on it, was surprised that the pepperoni was tiny. Would have liked to gotten there earlier because there were some other topping I would have tried but when exploring NYC the time gets away from you \u0026 dinner ends up being at almost 11 pm. \n\nWilldefinitely eat here again if back in the city.", "author": "Amy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-11", "description": "Happy 2012 NYC yelpers!\n\nWow you NYers are spoiled! Best pizza I ever had in my life! When I first visited NYC... my mission was to eat at Grimaldi's!\n\nYes there is a wait... but good things come to people who wait right? So worth it! NY city is one of my top cities visited where I spent a lot of time waiting in a line to eat. Yes I'm one of those crazy people waiting in a 1 hour line.\nI'll be in NY again in 3 weeks and Grimaldi's is on my hit list! Yes! Winning!\nLove the fresh ingredients, the small NY seating and being able to see them make pizza magic.\n\nFor those of you looking to eat NY pizza in NY... make it Grimaldi's! \n\nGrimaldi's I'll be seeing you shortly!\n\n- Miss Yelp 2012", "author": "Jewelyn T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-06", "description": "So far this is the best pizza I have tried in NYC! The pizza ingredients were fresh.  The wait time not so bad. The small size pizza was plenty for two. I was impressed. If in NYC must try the pizza here. Cash Only.", "author": "Monica A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-18", "description": "-------------CASH ONLY------------\nI've been here twice. On a very crowded Saturday and an empty Wednesday. Both times my friends and I ordered their regular pizza...BECAUSE ITS THE BOMB DIGGITY!!\nThe sausage topping is muy bueno but the chicken is whatever. It doesn't add any flavor to the pizza. We also got their desserts and I can't remember the names but we got coffee gelato with chocolate and some pistachio gelato with nuts. The coffee one was sooooooo yummy but the pistachio is meh. \nI will always come back BUT ONLY on a non touristy day.", "author": "Minn Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "Amazing NY pizza in Brooklyn.  Absolutely worth the wait!", "author": "Brian W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-10", "description": "After trekking over the Brooklyn bridge, we were rewarded by another awesome pizza place! I've dubbed this place \"pizza under the bridge\" as that's what we were referring it as throughout our trip. A small pizza is $12 w/ 6 slices and a large is $14 w/ 8 slices. Each additional topping is another $2. \n\nPros:\n- Big restaurant with two floors of seating (we were seated almost immediately at noon)\n- Pizza is big; giving you thin, fat slices that are easily folded\n- Coal-burning oven gives it that extra depth of flavor\n- Fast, friendly service\n- Large variety of toppings\n- Great price. A large w/ 2 toppings was more than enough for 2 people\n\nCons:\n- Cash only!\n- Our pizza crust was a bit burnt\n- No pizza by the slice\n\nWas this worth the adventure over the bridge? For us first-time visitors, it was absolutely worth it as we got to sight-see, explore, and take our time. For locals? Not sure since there are a ton of great pizza places everywhere as alternatives.", "author": "Kevin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-07", "description": "Good pizza. This place is crowded. Kids \u0026 groups are welcome. Parking is limited. But a good time. Do not forget to order the desserts: cappuccino gelato truffle and the coconut gelato truffle with mango sorbet center!!! Omg!!!\nNow all that said, food is good BUT the waiter service leaves much to be desired. They need to gave someone at or near the door to seat people. We wound up being sat by our server because we were there for so long, he was like grab that table over there. And as we enjoyed the truffles a pie was put at the wrong table and sat there for some time before they realized it was the wrong table...even though the customer was like this isn't ours. Seriously.", "author": "Lady M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-23", "description": "Grimaldi's knows it has good pizza and will not attempt to impress you in any other category. There are super long lines, it's cash only, the service isn't great, the cokes are in plastic bottles, and sometimes you have to sit at tables uncomfortably close to other patrons. We were at a 4 person table with 2 other people, and they had to get up every time we left the table. \n\nWe only had to wait less than 15 minutes because we were a party of 2. The idea of waiting over an hour for this pizza sounds pretty off base. I wouldn't even attempt to go here with a big party!\n\nBut don't get me wrong - this pizza was REALLY GOOD. That cheese was amazingly fresh! I am also from Texas where pizza like this doesn't really exist and I had a hard time believing that this truly was the best pizza in the land of great pizza. I'm just such an optimist.\n\nIt's a fun place, a bit touristy, and I totally get that you'll just have to try it out for yourself to know the truth....but, if you are not a fan of being inconvenienced, you'll probably hate it.", "author": "Lesley W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "I would have given this place only 3 stars, except we had no wait! Their was a lime, but we came only with 4 and they had a seat, vs the two groups that had 5/6. \n\nThis place was recommended by EVERYONE, but i was disappointed.... it was good pizza but that was just it. It wasn't spectacular or amazing,  like everyone had said. \n\nThe center of the pizza was still doughy, so that wasn't great... the outer half crust was how I liked it, crisp but not burnt or hard. We got a large with sausage and mushrooms and for the prices of $19, it was more expensive than most pizza joints in nyc. It is definitely worth a visit, but i would never make the trip again...", "author": "Janice C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-02", "description": "One of my favorite pizza places with a beautiful view. Best time to come is on a Saturday night around 10! No line and the food is served right away. Great service too. I wish there was better ventilation there - it's always so warm inside", "author": "Yevgeniya S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-31", "description": "I'll start this by saying that you're most likely going to wait in line just to get in..and thats OK. I've heard so many wonderful things about this place and their pizza. They have an original coal/brick over which is surprisingly hard to find. You taste the difference in the crust. I ordered a medium white style pizza. It's rare when you can taste every single ingredient on a slice of pizza where it blends properly. Grimaldi's does it very well and I wish the location was closer to me but it's always a treat going here.\n\nService is fast and the staff is pretty friendly. I want to try one of their meat pies but I'm sure everything on the menu is great. Everything is affordable/reasonably priced. Definitely recommend sitting in if you can, otherwise you can order to go.", "author": "Kris O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Definitely the best pizza we've had in NYC. Idk what it is about the pizza that is so good here. But it was definitely worth the small walk from the Brooklyn bridge", "author": "Elizabeth V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-28", "description": "Not a big deal. Who classified them #1 in New York? Average pizza. Almost no basil. Mozzarella didn't melt. We asked for extra ham and you could hardly see it. Wouldn't recommend it.", "author": "Michel M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-14", "description": "Wow, overrated! I had my first dinner in NYC here, and being a pizza lover, I was damn excited. It was about a 15 minute walk from my friend's apartment in Brooklyn Heights. I decided to stand in line while she came straight from work, but to my surprise and hers, there was no wait. We had the table right next to the door. I heard there's normally an hour wait, sometimes longer.\n\nWhile waiting to use the restroom (it's hot since its right next to the brick ovens!), I got to see the workers creating a masterpiece. Or so I thought. My friend was also running late, and they took her empty chair to another table. I was like umm, can I get another chair for her please? \n\nWe got a large pizza, my half was with pepperoni and mushrooms, her half no cheese, basil, and mushrooms. Our pizza came out within 15-20 minutes, and it was...COLD. also being in the corner table sucked since we were totally ignored by the rude workers here. the only nice person here was the manager or owner of the place that greets customers inside. Anyways, we ask for them to reheat it, and he walks away with other people's dishes. Since he never came back to take it, or maybe he took our reheat request as an insult, I asked the manager/owner if they could reheat it. He did so kindly. \n\nIt finally came back (I mean, another 15 minutes! We thought they either forgot or were totally pissed at us), and it had steam coming from it, like OTHER tables around us. Anyways, I felt the pizza was bland, and had to ask for parmesean cheese (which I thought was weird that they dont automatically offer it, or maybe I was the weird one that needed it?). I liked how you could see where they put the balls of mozzeralla cheese, but again, just so flavorless. The only flavor I got was the hints of basil they put on the pizza, and the pepperoni. The crust was just okay too, but I barely ate them. I also NEVER leave pizza behind, but we left some slices and didn't bother taking them to go.\n\nMy friend had been here several times before and has said no experience has ever been as bad as this, so maybe I was there on an OFF day. I thought I was lucky with no wait, but if I had to wait an hour for crummy pizza like this, FUH GET ABOUT IT!", "author": "Denise L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-31", "description": "What is this place, a nightclub? I came here familiar with the hype surrounding Grimaldis, but I definitely did not expect to spend 30 minutes in line (outside!!) of the restaurant listening to people argue about who was first. Trendy hipsters breezed by us, too cool for such a touristy destination, whispering \"you're not missing much. It's just pizza.\"\n\nI got a large mushroom and tomato with extra cheese. It was perfect. Like, literally perfect. Hot, crunchy crust and an inoffensive amount of basil. 22 for a large pie is pretty steep by my standards, but I would definitely go here again. Get there half an hour earlier than you planned. Take-out is kinda like at Katz Deli where you have to take a number.", "author": "Niomi M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "Such a great pizza place! Yes there was a long line to wait to get in but it goes super fast. They only take cash which is kind of a bummer so come prepared. They also don't have any alcohol either. I got the cheese pizza with chicken and mushrooms and it was AMAZING!", "author": "Whitney L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-22", "description": "OMG so this was my first time in NYC...and this was my first bite of New York Brick oven pizza. It was so delicious! I've never had any pizza like it. Being from the DMV area we don't get pizza like this. It's really fresh and they have the freshest mozzarella cheese. I loved it!!!! The food came out super fast too. We ordered 2 small size pizzas and it was huge! Not that it wasn't anything we didn't demolish :). Also the service was great, all the servers worked together by bringing things you needed or by clearing the table off for you as you finished. Friendly staff and an enjoyable experience for my first bite in New York! Make sure you bring CASH CASH CASH! THEY ONLY ACCEPT\nCASH! So enjoy!!!", "author": "Mo M."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}