{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-02", "description": "We came here at an off hour (3:00p on a rainy Sunday afternoon) so we only waited about 20 min for a table.\n\nThe pizza is good but it's nothing to write home about. I definitely would not wait in line for two hours for their pizza. \n\nAs much hype as this place gets, the prices are very reasonable: $12 for a small, $14 for a large (8 slices), and $2 for each topping.\n\nWe got a large with mushrooms, pepperoni, and Italian sausage. The ingredients were fresh and flavorful. The Italian sausage was delicious and added a little spice to our pie. \n\nWe also shared a canoli, which was absolutely delicious!!!  The shell was crispy and the cream was thick and decadent. I'd definitely order it to share!\n\nLast words: cash only!", "author": "Matt S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-27", "description": "Got in fairly fast because we were only a party of two. Pizza was amazing and atmosphere was nice. You can see them making the pizza which is very cool, would definitely go again.", "author": "Alexander A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "Definitely one of the best pizzas I've ever had. We tried both the standard pepperoni and a white pepperoni. I liked the standard (with sauce) better. The ingredients were so fresh and the crust was amazing!", "author": "Elyse N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-31", "description": "For a true taste of New York, our hosts on a recent visit took us to Grimaldi's. This coal-fired-oven pizzeria (I didn't even know that was a thing!) is tucked away almost under the Brooklyn Bridge, making it feel like a totally New York experience. The pizza was the crispy-chewy, fold-it-in-half kind that my Yonkers-raised partner has always bragged about ... and now I'm spoiled, too. After this, to say the local Papa John's just doesn't cut it, is an understatement.\n\nWe did find it odd that the beer and wine list on the menu had been covered over with opaque tape. Our server explained that they had forgotten to renew their liquor license. How does a restaurant forget to renew their liquor license? Tea and water it was, though not exactly the ideal beverages for pizza.", "author": "Eric P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-23", "description": "Pizza was fantastic.  Enjoyed the selections.  Come early to get seats otherwise you will be waiting, but it's well worth it.  The only draw back is that it's cash only, sorry.", "author": "Alvin V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-04-22", "description": "Our pizza came burnt, the olives were unbearably salty. The service was poor, the waiter only said \"its meant to be salty\" when we asked for a change of toppings (we did not demand a new pizza or refund. The pizza is not worth the money, please please please people, especially tourists, walk the extra 10 feet to juliannas and trust me you will NOT regret it at all. Juliannas is far better than this overrated place.", "author": "Mia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-14", "description": "Valentine's Day ... 2 degrees. No line. Great pizza. I'd say Patsy's in Manhattan is comparable. As of right now Grimaldis does NOT have the liquor license. This is an opportunity for families and non drinkers to get in on great pizza and shorter lines!", "author": "James K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-12", "description": "I've gotta say I went into this experience not thinking I was going to dig it that much because I'm not too big of a fan of New York style pizza and this place was hyped up a lot. I mean for crying out loud, I had to wait in the line out the door and down the street for over an hour to be seated, so I wasn't going to be pleased if it didn't live up to the hype, but let me tell you fellow Yelpers, this place can make a pie. Crust was great, really good sauce, cheese and toppings. I went for the \"small\" regular pizza with pepperoni, mushrooms and onions. The small is definitely big enough for 2-3 people to share depending on how hungry you are. I ate all of it except 1 piece because I had not ate all day, so I was hungry to the point that I had a headache.\n\nCool place inside and I was digging the Rolling Stones they were playing. The staff is friendly and funny. They love giving you a hard time if you ask for something and the guy at the bar was telling me jokes left and right.\n\nThis place definitely proved why people wait outside in line for over an hour. Do yourself a favor and treat yourself to this great za!", "author": "Joe L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-12", "description": "I would give it 4 1/2 stars. Although the pizza is wonderful and the price is relatively inexpensive I think the place is slightly hyped. I came here expecting the most amazing ever in New York but I think I had better. When it's hot it's really good but the pizza can get cold easily. Thin crust, good cheese.\n\nSeating can be very intimate since you're almost next to strangers if you don't come in a big party.  If you want to come just to try out the pizza without waiting come at odd times (I came at around 5:30pm on a Monday) so I didn't have to wait but by the time I left there was a long line outside.\n\nOverall good service, good food, a good place to dine. But probably not worth more than a 10-minute wait. The surrounding neighbor is gorgeous, being under the Brooklyn Bridge and all. Maybe this is why the place is overrated.\n\nBring cash and a few friends so you can get a variety of pizza. Rule of thumb: a small regular pizza (6 slices) is good enough for a party of two.", "author": "Hieu P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-29", "description": "Since the move this place has definitely took a landslide for the worst. The customer service always sucked. But the food always superseded that. So I dealt with it. Flash forward to today. It moved to a more spacious, 2 floor mansion as opposed to its former matchstick box location. The customer service has stayed the same, they know people come here no matter what so they don't care. But the pizza sure has taken a toll. \n\nMy last experience was pretty lame. I came here because my relatives from Puerto Rico love this place. So I got invited. They came with an entourage of about 8 plus me and 1 more. Can you believe they seated us in the cramped corner on the first floor just so that they won't have to open the more spacious 2nd floor? Really! \n\nEven the table behind me stood in awe at the face of discontent we had. This should never have had happened. \n\nWelcome to NYC!, know that New Yorkers rarely eat here now.", "author": "Alexis M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-27", "description": "THERE IS NO ALCOHOL!\nThey don't have an alcohol license so beware if you want to unwind and relax. You will have soccer playing on TV and white neon lights. Such a waste of a Saturday night and it ruined the opportunity to have a fun evening after a hard week's work. I wish they had had the decency to tell us upfront. \n\nAlso what looks like the owners are not friendly and it's the 2nd time I am being barked at to wait in line or get to my seat. The young waiters are adorable though.\n\nPizzas are good though. I love the ricotta cheese + ham + mushroom combo.\nBut a good pizza is not worth being talked down to and  not having a nice glass of wine.\n\nIt's my 2nd time and never going back there.", "author": "Mara B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-09", "description": "Very neat place to go. We got there at 2 pm and they had a line. Waited about 25 mins outside before we got a seat. Service was average. The pizza was great. We had a small and it was enough for both of us.", "author": "Patrick P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-03", "description": "We ordered a large tomato based pizza with mushrooms and meatballs.  The place had a very casual look and feel and had a lot of pictures displayed that the owner took with celebrities.  The pizza itself was not bad but some parts of crust was burnt badly.  The service was okay but it wasn't the best either.   I was able to try juliana's pizza to compare.   It is not an accurate comparison sincewe ordered a different type of pizza. For me,  I think I prefer juliana's then gimaldi's if I have to choose one.  I had a better experience there with their Atmosohere,  service and pizza. \n\nOverall experience: 3 stars\nFood: 3 stars\nService: 2.5 stars\nAtmosohere: 2.5 stars", "author": "Jeannie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-23", "description": "Grimaldi's was definitely good, I didn't think it was as amazing as people hype it up to be, but it is good. I like how it's thin and has a little char to it. We got the chicken and sausage large pizza, which has 8 slices, but we could've ate more. The price is decent, goes up on every topping you add.", "author": "Geeyoung L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "My favorite place to go for pizza ! Best pizza in Brooklyn. I travel from Westchester NY every Friday for girls night at grimaldis ! The place is so cute and comfortable with the bridge being so close for a nice walk after indulging in so much food. Our favorite waiter is Mimi (i think that's how you spell it) also manager Chris is awesome always remembers me and always says hello.", "author": "Michelle F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-25", "description": "We went here after walking the Brooklyn Bridge as many tourists do. Our overall experience was very positive. Despite a lineup, we got in fairly quickly. Our server was fast and efficient. The pizza was excellent. We just added garlic to the basic pizza (cheese, crushed tomatoes \u0026 basil), and it was a great combo. The pizza could have used more basil. Other than that it was a great dining experience.", "author": "Cliff N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-24", "description": "Aaaand Chicago style deep dish pizza is the winner of the pizza battle.\n\nCould be strictly a personal preference but the Pizza here was not satisfying at all. Got the normal pepperoni, mushroom, onion, pepper (OK pepper was really good) pizza so I can have a fair comparison with the deep dish that I have had before and pizza here didn't hit the spot. I like what they did with the basil though.\n\nGuys, if you use the restroom here be careful not to get hit by the door.", "author": "John H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-25", "description": "This was the first pizza place I came to when visiting New York a few weeks ago and it definitely did not disappoint. \nIt wasn't the best pizza that I had in New York, but it's worth a trip since it's almost a landmark pizza joint.\n\nThe crust was nice and thin, sticking to the traditional New York style. The sauce was good but a little bit too sweet for my liking. The cheese was fresh and delicious! Nothing kills the taste of pizza faster than overly processed cheese :/ . I just wanted a few more herbs in the sauce and this pizza would've been perfect for me, but then again, if you're into very simple flavors then this should tickle your fancy! Hah weird saying... Anyway don't get me wrong, I do enjoy simplicity in my food, but this needed just something... Oregano maybe?\n\nThe place is nice and clean and the service here was awesome! Even the prices are extremely affordable.", "author": "Sadia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-17", "description": "BE WARNED. This review is ONLY for the pizza. NOT the service. It would take me an hour to write a review in reference to the atmosphere and experience with staff.\n\nCame here on a Monday afternoon @ 1215pm. There was a line of about 30 outside already when they open at 1130am. We waited bout 30 minutes to get to a table where we were seated with strangers. I move forward to the pizza.\n\nOMG-delsh!!!! We went traditional and got a large plain pie. Yummy yummy yummy. Between 2 of us, we polished the entire pie. I love pizza and I love NY pizza. \n\nGrimaldi's was tasty, but Lombardi's still has my heart and my tummy. I would recommend Grimaldi's to anyone that loves pizza and enjoys a good wait :)", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-21", "description": "I have yet to try this place, but the line alone would suggest, it's worth the wait!", "author": "Elle L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}