{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-29", "description": "Best pizza I've ever had. even at 10pm weekday there is a 10-20 min line.", "author": "Sam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-19", "description": "Lines are for suckers. Wait till the late fall and you can walk right in. Also, what's with people dropping stars because of the long wait? Would you drop a star from el bulli because it's tough to get a seat? Come on, let's talk about food here. If waiting in line is the issue, then anything that's in demand would suck. \n\nAnyway, I didn't think this place could even come close to living up to its hype, but I was pleasantly surprised. The pizza was insanely good and cheap ($20 fed 3 people.)  The service was good. The ambiance was pretty much consistent with any other pizza place, which is to say, fairly non-existent, but who cares, it's pizza.", "author": "ross m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-01-09", "description": "Hmm Grimaldi's... I've been here a few times, the pizza is good but sometimes they might leave it on for a few seconds too long and crisp the bottom a little too much...\n\nBut beside that... the marinara sauce is great! The cheese is fresh! but shh =x I like Lombardi's better! \nThe decor isn't spectacular... and the waits will, keep you waiting. But get a pie, pile it up with toppings and be ready to digest some good ole pizza.\n\nbring your own box is you plan on driving a far distance because they pack your pizza in a bag!", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-05-24", "description": "Grimaldi's is another restaurant I tried based on a friend of a friend's recommendation, and it was fantastic! Tasty thin crust pizza and locally brewed beer on the menu...what more could you want in a pizzeria?\r\n\r\nAs the other reviews mention, this is definitely a no-frills, crowded restaurant, but that's part of the experience. Cop a feel on the brick wall as you're waiting in line for the restroom to get a sense of the heat that is generated to bake those excellent pies...\r\n\r\nThere's something about pizza crust in New York that just can't be duplicated here in the Bay Area...a buddy of mine says it's the water. Whatever it is, trek over to Brooklyn and grab a pie!", "author": "Art D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-24", "description": "Things I liked:\n\n1. The really grumpy old Italian guy who is in charge of the line/tables. Maybe I've watched a few too many episodes of Sopranos, but I could kind of see him smacking someone around for messing up an order, or comping a pizza to the local don. Anyway, it made me happy. \n2. The cheese. Fresh mozzarella..yum. \n3. The pizza comes out SO quickly. Which is nice, since you usually have to stand outside forever to get a table. \n\nThings I didn't like:\n1. The line and the waiting. \n2. The expectations! It was not the best pizza in New York. It was good pizza.. but one side of our crust was burnt, and I do not like burnt pizza. \n\nI'd go back..if the line is shorter. And I second the advice about the Brooklyn Ice cream Factory. Or maybe just skip to dessert...", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-21", "description": "Grimaldi's is the best pizza in New York, hands down. Don't let the long lines of people waiting on the sidewalk scare you. The wait time isn't THAT long (I usually get seated after 15-20 minutes) and those 15-20 minutes is so worth the delectable pizza that Grimaldi's offers.\n\nIn the first bite of of a slice of their 18\" pizza pie, you'll immediately notice the perfectly thin, crispy crust and the fresh mozzarella. I recommend getting the sun dried tomatoes with extra cheese. \n\nThis is the place to go to for a classic New York pizza experience. Grimaldi's is the quintessential New York pizza.", "author": "Michelle T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-25", "description": "Pizza is nothing if the crust is wreck -- Grimaldi's crust is so deliciously thin and perfectly seasoned that I could literally just order a pizza of plain crust and be happy - but why do that when you have so many toppings to choose from?? \n\nTake a walk over the bridge on a nice day, early, get to Grimaldi's (before it opens is best so you don't have to wait) and enjoy classic Frank Sinatra and great New York pizza.  After pizza...go to Brooklyn's Ice Cream Factory down the street -- quality day!!", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-25", "description": "Long lines will keep you wondering if you should stay. Don't bother the pizza is not the best and not worth the wait. unless you have nothing else to do and need a cheap bite.", "author": "M H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-29", "description": "What a let down!  I grew up just minutes away from Grimaldi's, back when it used to be Patsy's.  I had my second grade birthday party at this place.  They used to be so friendly!  My most recent experience was really awful.  I'm not sure if they're trying to go for the EXTREMELY rude \"soup nazi\" service as some sort of tourist trap, but I was not feeling it.  I walked in to pick up a pizza, which I had called for about 20 minutes early.  A young man said, \"Can I help you?\"  I said, \"Yes, I called and ordered a pizza.\"  He cut me off before I could even finish with a, \"Go wait in the line outside.\"  I hadn't been here in several years, as I've been living away from Brooklyn, so I assumed that they had changed things.  I waited outside in a LONG line, and as I neared the start of it, an older man asked \"How many?\"  I explained that I had called and ordered a pizza to go.  He said, \"Wait.\"  Then I waited some more as he sat two other people in front.  While waiting, I witnessed him being unbelievably rude to potential patrons, who asked quick questions.  He was so short and acted as if he did not have the time of day, telling everyone to, \"Go wait in line.\"  He asked me the same question again, \"How many?\"  I replied the same way, and then a third time this happened.  He paused again, until he told me to go inside and see the guy at the cash register.  Inside, I was told that I should have just walked in, told them I called, and go straight to the cash register...  Ummmm...WHAT?  I can't believe what this place has turned into.  It's so popular that they can treat people terribly.  I will not be coming back.  The pizza is still great, but not worth it.", "author": "Mary Liz C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-07-16", "description": "personal line waiting time: 1 hour, 30 minutes.\n\nIt was worth every dollar and every second in line. delicious, fast, filling, the way pizza should be made.", "author": "Jo H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-29", "description": "Pizza is good, but the wait is no joke. The long line really ruins it for me, honestly. There is ALWAYS a line. There is never a time when there are no lines for this place, which honestly makes me not want to go there.", "author": "Diana R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-14", "description": "WTF!!!\n\n...I really liked this place!\nBUT IF I HAVE TO PAY\n$85 FOR 3 PIZZA AND 4 SOFTDRINKS\nPLEASE TELL YOUR CUSTOMER\nTHAT YOU INCLUDE THE TIPP!!!!!!!!!!\n\nI don't know how many gets ripped off\nby paying DOBLE TIPP?????\n\nAND THEY MAKE PEOPLE WAITING IN A\nLINE OUTSIDE! AND EVERY WERE EMPTY\nTABLES!!!!\n\nOF CAUSE NO LINE WHERE YOU HAVE TO WAIT\nMINIMUM 30 MIN. IS BAD FOR A GRIMALDI IMAGE!?!?\n\nNOT COMMING BACK!", "author": "Erdna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-27", "description": "Take the walk across the Brooklyn Bridge and get your appetite warmed up for some fabulous pizza.  Come early as the wait can get rather long, but stick it out.  At least once in your life.  \n\nThe decor is still from the 70's and too many tables for too little space; so do not expect anything other than good pizza.  Is it the best?  That is hard to say, people look for different things in pizza.  I like to break it down by the elements, and they are all good here.  Is it number 1?  Ehhhhhhh, it is in the top 5 for sure, but I am still trying to sort my list out.", "author": "Chip S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-22", "description": "I took my second trip to NYC this past February and I have to say that this pizza joint wasn't even on my \"to visit\" list, but it was on one of my friends so we decided to make our journey.  \nWhen we got to the restaurant, I was not impressed by the line or the looks of the place, but I do love those \"hole in the wall\" type eateries.  After debating to wait in the line for a pizza pie, we decided to check it out. I did read about Grimaldi's thru Yelp so I just wanted to see what all of the buzz was about.....\nAfter waiting about 35 mins in line we finally got the \"go ahead\" to come in and take a seat.  Our party had 9 people and they accommodated us just right......\nThe vibe in the restaurant was great and the smell of the fresh pizza coming out of the brick oven was intoxicating.  They have a variety of special beers to wash down the taste including other non-alcoholic drinks.  The pizzas only come in pie sizes and they range from medium to xlarge. We ordered quite a few pizzas including a reg cheese, pepporoni, and a combination pizza...... I have to say that when we got the pizza, I was very hungry and did my best to eat it as slow as I could to enjoy the flavor.  The pizza was amazing and the best I ever had... Every ingredient that they use is at the cook station where they make the pizza in front of everyone.  The service was good, but not wonderful, but everything combined was worth it.  The prices are good too.\nFor any tourist, this is a must-eat restaurant!  Then you can walk the Brooklyn Bridge on the way back!", "author": "Jeremy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-17", "description": "Pizza is amazing.  Fun atmosphere.  The place gets packed, there is often a line out front.  Servers are great.", "author": "Dustin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-17", "description": "I had heard that the trek to Brooklyn was worth it for their pizza.  Specifically went just after lunch time to avoid crowds, tho there were still plenty of people.  The ground level was full so we were told to find the server on the second level to be seated.  He seated us promptly, but never bothered to come back to check on us for 5 minutes.  I did notice that he had a tendency to linger at certain tables, during the course of our meal.  There were only 5 other tables occupied on the second level.  Eventually we took it upon ourselves to grab menus from the bar, since he never brought them.  We then had to flag him down to order drinks, and our meal.\n\nWe ordered the classic pie; mozzarella, crushed tomato, and basil.  Sadly they were out of many of the drinks that we attempted to order.  The pizza arrived fairly quickly, and it was very tasty.  The crust was firm toward the crust and a bit floppy toward the center.  The crispness of the crust was good, but made it hard to fold the slice.  I've never had a classic pie before, figured that if there was to be a first time this was it.  I enjoyed the cleanness of the flavors, tho the basil was a bit skimpy and lucky to have one per slice.\n\nAs other haves mentioned, remember to have cash.  I'd make the trip again, but hopefully get a more attentive server.  Halfway thru the meal a second server arrived, and he was more prompt on checking all the tables.\n\nAnother slight issue was the bill, we were due at least 15 in change but it never arrived until we inquired about it.  A few wrinkles in the experience, but still a good pie.  Next time, gotta try some of their toppings.", "author": "zhon s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-15", "description": "I'm not a pizza person but I have a friend here and while visiting, this was labeled as a \"must have,\" and it was definitely worth the 1.5 hour wait. Once you are able to get a table, order yourself a Brooklyn Lager! Then order your pies to the flavors that you wish! Service is also great once you get inside! Only pizza I absolutely love wolfing down.", "author": "S C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-08", "description": "This may be the best pizza I've ever eaten - Got there at 430PM on a Monday and there was no wait :) washed it down with 2 Brooklyn Lagers and was sighing with delight after ever bite.", "author": "Sarah N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-20", "description": "Not as good as it once was. I don't know if it is the new oven they now have do their recent move, or the dough making process, but the crust is chewy and if you take a good look at the interior of the crust, you can clearly see it is sponge like and full of air. Don't get me wrong, it is still a \"good\" pizza, but certainly not the \"best\" or anything remotely close. There are far better places in NY then that of Grimaldi's. I have been a pizza freak for many years, and have eaten at al the \"hot\" spots in and around the tri state area, and west cost. This was my second visit to this establishment, the first time It at their original location (original oven). Also, I think the hype train is mainly due to the history of the name, and not so mush from people who know much other then having sampled basic gas oven pizza to compare it too. Service is good, food comes fast and the establishment is very nice and family friendly. Good for tourist is guess. I did notice the old location just a few doors way is now occupied by the \"original\" owners of Grimaldi's (Patsy Grimaldi) who is now in possession of the 100 year old brick oven. Although I can not comment on their pizza due to the fact I have never eaten there, I will definitely give em a shot next time I am in e area. As for Grimaldi's themselves, I don't think I will be going back because to me there is no -wow factor- to lure me back down to Dumbo other then the beautiful scenery. Good luck and good eats!", "author": "Ny's Finest .."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-07", "description": "Just a touristy place that you have to wait at least 1/2 hour to get in the front door. We ordered a regular pizza with chicken as a topping. Just OK: not great, not terrible. Crust was actually a bit burnt underneath in some spots. Sauce was not sweet enough. Would never wait in that line for this pizza again. Not worth it.", "author": "M S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}