{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-24", "description": "Granted, I'm from CA, so all food in NYC tastes like heaven to me, but WOW, this pizza is GOOD. Like my fellow yelpers, I was not thrilled about a 2 hour wait for pizza, nor did I like how crowded and loud it was (and I had to wait 30 minutes for the gross bathroom too), but I will say that it is the best pizza I've ever had. the fresh ingredients make a really huge difference.  The sauce was the best.  I'm going to call ahead a to-go order next time though...", "author": "Emily W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-04", "description": "I have a friend, a native New Yorker, who told me \"I went to Brooklyn once, and once was enough.\"  \n\nAfter the pain in the ass experience of visiting this place, I don't give a rat's ass how good the pizza is, it isn't worth the trouble to get there from Manhattan.  Maybe if you live in the neighborhood, I can see you saying it's your favorite, but to endure the hassle, then the interminable line, then the scruffy service, and finally get your sacred pie, and then you wait for another 35 minutes for a friggin cab to get back to Manhattan, at that point I say \"Bullsh!t.\"  There are so many other great pizza places, where they are pleased to have your business.  (Or at least you don't feel like you were just kneed in the crotch afterwards.)  \n\nAnother Yelp!er, Gabriel D., did an opportunity cost analysis of Grimaldi's that I love.  I'd add the cab fare to and from midtown to the total cost.  This is some freaking expensive pizza!  \n\nNow I say, \"I went to Grimaldi's once, and once was enough! \"", "author": "Bevy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-03-03", "description": "The pizza is ok.. just not THAT great. Especially for the FREAKIN LONG wait!! It's not worth it. I find their pizza too soggy for my taste. Lombardi's is SO much better and the wait is SO much shorter!\n\nThe only good thing about trekking this far is the Brooklyn Ice Cream Factory nearby. Now THAT'S worth it!", "author": "Catherine C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-13", "description": "So I tried this place on the fourth of July, AFTER the fireworks display (which was great by the way), the line was impossible around 8pm. We only had to wait 5 minutes after, we ate while the crowds disbursed and for the Brooklyn Bridge to open up again.\n\nI'm so happy to have found out what real pizza is supposed to be. Thin crust, coal oven, chewy, simple... We got ours with sundried tomatoes and extra basil. The boyfriend thinks no other pizza will ever compare, and he's picky, and he still talks about it.\n\nI've never been so close to other diners, but Christina J. is right, you don't really care when you're in there.\n\ntoo bad real pizza rarely exists on the left coast.", "author": "kate r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-16", "description": "I don't typically like pizza, but my friend dragged me here for (New York style?) pizza when I was in New York the other day.  I was incredibly impressed.  Her friends were already in line and so we got a table relatively quickly. \n\nThe atmosphere is definitely toward the younger crowd (Brooklyn Heights in general, perhaps).  The table is incredibly cramped for the five of us, but this added to the ambience of the restaurant.  People are here for the good food, not to have great dining.  We got three pies which actually satisfied all of us.  Normally, I don't like mushrooms or olives, but this pizza actually melded everything together so that my disliked foods didn't stand out.\n\nI liked folding the slice lengthwise to eat it.  Thin crust, which didn't border on my distaste of too much dough.  One of the best pizzas I ever had.\n\nHighly recommended.  Near the High Street subway station.", "author": "Jenn N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-16", "description": "My first visit to NYC would not be complete without eating at Grimaldi's. Luckily for our small party of 2, we were able to sit immediately. After we dodged the evil eyes from hoards of people in large groups, we were seated at our cozy small table. Knowing that we were going to have Italian fare later that evening, hubby and I decided on a small pizza with garlic, sausage, pepporini, roasted red peppers and olives (p.s. for next time: olives are kalamata). When the pizza arrived, we thought they had mistaken our order for what, in my opinion, would be considered Large. Nope, this was definitely the small! The pizza was UBER delicious.\n\nI'm a total fan of this place and will return return!", "author": "Talle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-19", "description": "LOOOOOOOOOOOVVVVVVEEEEEE and adore this pizza. I suggest to come to this pizzeria when you are in a \"noshing\" mood. If not then I would warn that you will evolved into the incredible hulk waiting on the long line. (but well worth it) \n\nThe description.. soft yet chewy dough with the freshest and best toppings. I had the all meat pizza with basil.. Talk about atkins/south beach diet friendly. Well and a peroni on the side gives it that extra boost plus the mana music sends you into a chill mood and you'll forget about the 1 by 1 square foot of personal space that is given to you, complements of the staff.  \n\nWill go again and will bring my brother every time. He's my entertainment while we car watch and gossip lol..", "author": "Natalie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-31", "description": "Pizza was undercooked, rude service, and on top of that they added tip on the check for a party of four and tried to LIE and say it was for sodas. After futher questioning they admitted it was for tip. When I asked why tip was automatically added for a party of four when their signs clearly say tip added for parties of 6 or more they became upset and asked us to leave. I usually don't like to complain about places but I just had to. Tourists beware!! Always know your bill.", "author": "Mark C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-06", "description": "I'll caveat his review by saying that it is based on a one time visit when I went when I was starving at 5pm since I hadn't eaten anything all day. It was pouring all day, so it helped us get in without any wait at all. Once in, we were seated cafeteria-style in the middle of a table next to other patrons. Minus points for being able to sneeze on the next person's pizza. Again, I was starving, so being in a grabbing distance from another person's pizza was also painful.\n\nThe service was slow. Had to come back and re-ask us for our order, and our drinks. Really? BUT -- the pizza was pretty darn tasty. The two of us split the small pizza. It was the perfect size with a thin crust, nice and crispy, delicious pepperoni, savory sausage, and the perfect amount of tomato sauce and mozzarella. DELICIOUS. I'm actually craving one now.", "author": "Tracy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-06", "description": "This place gets 5 stars because it is one of the best NY pizzas.  That being said, go for the experience, its a great date.  I'm going to tell you how:\nFind out what time the sun is setting that night.  Make sure the weather is nice\nGet off the 4/5/6 at Brooklyn Bridge approx 1 hour before sunset (more or less depending on your speed)\nWalk across the bridge (take photos, etc, the views are spectacular)\nWhen you get across the bridge, take a detour and walk to the water.\nAround this point, the sun should be setting.  You will have a spectacular view of the Statue of Liberty and all of Manhattan.  (Take pics, make out, whatever)\nAfter this, you are now ready for some Grimaldi's!  Go step on line, its probably long, as sunsets are a popular time to go.\nEat the pizza, forget about the line, order enough to take one home!\nIf you like dessert, you can get some ice cream next door (I went out of order and enjoyed a cone while sitting on line)\n\nCheers", "author": "Mike B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-22", "description": "Yummy pizza! I got the regular pizza with pepperoni. Two of us ate an entire large pizza. The crust was perfect. The right amount of crunch and chew. But I did feel like the pizza could use more sauce though. All of the ingredients were really fresh and tasty.\n\nService was a little lacking. Maybe because there was no one at the door to greet us,  we ended up with a take-out pizza when really we wanted to sit down and eat. It was nice that we didn't get in trouble for just sitting down and eating at the bar. Yup, I'm a tourist.\n\nThey only take cash.", "author": "April Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-07-15", "description": "I like my pizza thin, folded and simple. My best pizza is from Grimaldi's. All it had was sundried tomatoes and basil. I nearly lost it at the first bite---I was taken aback when something that simple had that much of an impact.\n\nSince the Brooklyn Bridge was closed, my girlfriend and I decided to watch the 4th of July fireworks near the bridge on the Brooklyn side. The line to Grimadli's was incredibly long. I was too grumpy to wait. I just wanted to claim a spot and sit down to wait 2 hours before the fireworks extravaganza begun. After the fireworks, we headed towards the train and saw that Grimaldi's line was quite short. We posted ourselves in line and 5 minutes later we were greeted and seated.\n\nThere was a 10-minute wait to use the comfort room but I must say that this was by far the coolest wait I've ever exprienced for a trip to the restroom. Because there's only one, you get to wait in line and watch the pizza guys do their magic. The brick oven, the dough spinning, the sauce pouring---it was great. And the aroma kicked my ass. If I hadn't killed half of that pizza, I would have walked 50 meters over to eat some frozen dairy at Ice Dream factory.\n\nI really need to try Lombardi's out. But Grimaldi's...damn you.", "author": "Jeffrey T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-06", "description": "Don't come to this place hungry!  By far the longest  line and wait for food.  We were in a line outside the pizzeria for about an hour and a half.  Now you ask me was it worth it?  Heck Yah!  It was some pretty damn good pizza!  There were 3 extremely famished people and we ordered 2 large pizzas, 1 pepperoni and mushroom, and 1 sausage and bell peppers.\n\nFavorite thing:\nPepperoni and Mushroom\n\nLeast Favorite thing:\nwaiting in line over an hour and being crammed into a table that clearly was only meant to fit 2 people.\n\n-1 star because the second pizza came out undercooked and the crust was still doughy", "author": "Flo T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-14", "description": "I don't think I've ever had better pizza.\n\nEat it while it's hot though!\n\n_C$", "author": "Caleb B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-14", "description": "So, after hearing all the hype I just had to go.  This was my second trip to DUMBO.  The first was on July 3rd.  Wasn't too inclined with the line that day.\n\nToday, the line was pretty short, about a 20 minute wait.  I get in, order a sausage pizza, nothing too special.  In fact, I think it took longer to get the pizza than to wait outside.  Must have been lucky.\n\nThe pizza was...alright.  Not spectacular or anything.  I've had better, in NYC and outside of it.  I wonder who the p.r. genius was that started this craze?  I thought of this on the way home.  Maybe it's the location or that it is a coal fired brick oven that is the attraction.  I'm not sure.  To me, pizza is pizza and if this is the best NYC has to offer, then maybe NYC should get better pizza places.  The pizza isn't horrible, it's good, just not great.\n\nIn other words...NOT IMPRESSED.\n\nIf you really want to go, go, but stand there like an idiot and wait in line for pizza that isn't worth the wait.  And it's expensive too, not surprisingly.  Plus, I didn't get any change back, not that it matters, I was going to leave it on the table as a tip anyway, but the fact that they didn't give me any change bothered me based on principle.", "author": "Justin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-27", "description": "The Pizza here is something that helps put NY pizza on the map. The perfect thin crust, the not too dark flavored cheese, and the awesome brooklyn soda. The best thing I ordered was the Canoli. It was handmade and tasted like one of the best things in the world. I have not had Canoli this good. I'll come back one day!", "author": "Andy N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-04", "description": "I wanted it to be so good.\n\nMaybe there's a hype-factory in the back, or maybe this kind of pizza just isn't for me.\n\nThe waiters were great \u0026 hour wait was fun because we played M.A.S.H., but pizza wasn't hot enough or crispy enough or flavorful enough to be worth it. Darn.", "author": "ALEXIS B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-04", "description": "After all the anticipation, forgoing breakfast one sunny saturday, and walking across the brooklyn bridge to sample this much-yelped pizza at the stroke of 11:30am... we were stoked!\n\n1st downer: it was closed! opens only at noon on weekends! But there was no queue at all, so we were wondering if it's all it's hyped up to be\n\nso walked around the waterfront to snap some pictures planning to be be back 10 mins before noon.\n\n2nd downer: at 10 mins to noon, there were already at least 60 people in line ahead of us. And it was the same queue for dine-in and take-out \u0026 most people opted for take out, but we still had to wait for their orders to go through slowwwly. Once the first batch of people got in, the rest had to wait till the quickest of them decide to leave. And on a hot sunny afternoon like this, nobody's gonna leave the A/C to be back in the sun.\n\nSo we patiently waited 1.5 hours to get in, and even the famed Brooklyn Ice-cream couldn't help curb our appetites (and sweaty brows) much.\n\n3rd downer: Our large extra-basil sausage pizza arrived. And our first thoughts were... MeH! Even the bland Angelos tasted about the same level as this... heck, i've had better pizzas delivered from Dominos! Definitely not worth the 1.5 hour wait. Ok, the staff looked super stressed by the weekend queue, but for a place touted to have NY's best pizza they should be well-used to handling that by now, right?\n\nThe basil was definitely insufficient, despite ordering extra basil, and the meat coverage was spotty. Also the crust was inconsistently baked (slightly undercooked at some spots, but sooty at others), which was still better than what the next table got... an overburnt sooty mess!\n\nOn the off chance that the cooks cook better during weekdays, we MaY be back... but after all that hype, I'd say go check out the other Pizzerias in Brooklyn if you're hungry.", "author": "Aaron C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-26", "description": "Believe the hype.. the pizza is as good as ive ever had..4 stars because no matter what you have a long wait to get seated..service on this occasion was well below avg.I will definitely go back when im in NYC", "author": "harold m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-07", "description": "I go to NY often but didn't have the chance to check out Grimaldi's until this past weekend. I'm glad I did! I did have to wait in line for about an hour but trust me, it was well worth the wait! The pie was outstanding the service was great and it was good to be a part of the whole experience. At first I didn't think there was any way my brother and I could finish the whole pie (small-6 slices) but we devoured it and were hungry for more (we should have gotten the large [8 slices]!) Luckily we walked off a lot of the pie by walking across the Brooklyn Bridge.\n\nWill definitely check out again when I'm back in NY, but hopefully the line won't be as long this time!\n\nLoved all the Sinatra pics btw!", "author": "Nasim N."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}