{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-27", "description": "How long would I wait for a slice of Grimaldi's pizza?  1 hour...TOPS!\n\nThere's nothing I hate more than waiting, but some things in life are worth waiting for.  Grimaldi's pizza is one of those things.  Some say it's the best pizza in New York city.  The combination of cheese and fresh ingredients on a thin crust makes my mouth water just think about it.  There have been nights where I didn't have to wait behind the velvet rope for a table and some nights where the wait was up to 45 minutes.\n\nOnce inside, the service is fast with some nights taking only 5 minutes to get my pizza!!  The place is small and gets packed tighter than the subway car I took to get here.  There is barely room on the table for the pizza, your plate and maybe a drink.\n\nAs a tourist myself, I would definitely recommend this place to other tourists.\n\nBATHROOM:  There's only 1 co-ed bathroom, so get in line a few minutes before you have to burst in case the wait is long.\n\nCASH ONLY!", "author": "Misty S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-18", "description": "Great pizza, amazing service, nice atmosphere. What would make it better? BEER! If you come alone (like I did) skip the line and head to the bar.", "author": "Barry F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-24", "description": "Call me crazy but I would never want to wait in line for more than, let's say, an hour for food, when I'm pretty sure a restaurant one street over is also making pizza. Unless you want to bask in the glow of saying you ate at Grimaldi's or you get a kick out of munching away while people outside look on longingly, I would 1) avoid the place like the plague anytime between 11:30-3 and 5-8, or 2) if you must go during those times, eyeball the line first and ask yourself whether you want to stand in the hot boiling sun for a few pies and sodas. Keep in mind that the service is not rude and sometimes even borders on friendly, but they do make a point of keeping things moving, so don't expect to spend a few hours catching up with friends. Also ... not to start a riot, but when we left at around 1 on a Sunday (and the line outside was ridiculous), there were several empty spots at the bar and tables which could have easily seated a two-person party. \n\nNow for the star of the show: this is not your overpuffed, Pizza Hut/Dominos deep pan pizza. Personally, I'm a huge fan of the thin crust, because I like eating more of the toppings than the actual dough. The mozzarella is delicious, though I wish they wouldn't skimp on the basil leaves. Get the italian sausage topping (or don't, if you're a vegetarian or just loathe sausage, but that means we can't be friends). Grimaldi's does one thing right - the dough should form huge bubbles near the crust. Wash it all down with a black cherry Olde Brooklyn Soda, grab some cash from the in-store ATM, and kindly open up a table for the next party.", "author": "Joy G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-11", "description": "Well let me start off with saying that the pizza was decent pretty fresh mozzarella n toppings I got a large pie half pepperoni n ham and half ham and meatballs well after we ordered our pizza it took them 1 full hour to bring it to us the waiter didn't even come to tell us that it was on our way or anything 1 hour later got the food some of the crust was burnt. Like I said pizza was alright the service sucked def not worth the wait", "author": "Marlon G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-27", "description": "So our group wanted to do the touristy and walk the bridge, ending with Grimaldi's. I think that's where the hype comes from. You walk so much that when you get you food, you think it tastes amazing.\n\nDon't get me wrong, the food isn't bad. The pizza is actually pretty delicious and flavorful, but the hype definitely contributes to my high expectations. The line, as expected, was very long and we were met with the same wait for our food.\n\nI like pizza, I really do. But I know there are a ton of smaller, less well-known places that can deliver as well. And without the wait. So overall, good pizza if you want to do the whole walk over the bridge deal.", "author": "Viola L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-01", "description": "After racking up a good appetite walking across the Brooklyn Bridge and almost getting run over by the vicious bicyclists there, I was ready to feast on some Grimaldi's on my recent trip to NYC. But of course this place had a line as long as a brontosaurus just like everywhere else in NYC that's good so my stomach just had to deal with the wait. We waited and waited and barely moved in line when these 2 guys come out of Grimaldi's w/ 2 boxes of pizza advising us to call in our order and do take out so we would only have to wait like 10-15 minutes instead of hours. So we tried it but the phone lines were so busy that it took us about 10 minutes to just place an order. They said it would be ready in 20 minutes but 20 minutes turned into probably 30-40 minutes until we finally got to leave w/ our pizza to have a picnic on the grass down by the Brooklyn Ice Cream Factory. \n\nEven though we had to wait longer than they told us to we got our pizza before the people in front of us were even allowed in the restaurant so I think the advice we got from those guys was good. Plus eating down by the dock on the grass was probably a lot more calm and peaceful than sitting inside Grimaldi's where it was packed, cramped and loud. We also got to people watch and enjoy the view of the Brooklyn Bridge.\n\nNow about the pizza, we got a large pizza with sundried tomatoes and sausage to share between the 3 of us and it was really worth the wait. Maybe cuz we were all starving but us 3 little Asian girls ate that whole darn pizza pie all by ourselves. I loved the thin crust, fresh basil, mozzarella and sausage. Yum yum yum. Don't forget to go have some ice cream at the Brooklyn Ice Cream Factory.", "author": "Angela H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-11", "description": "Yet another tourist trap. Neither this place nor Lombardi's impressed me with their versions of thin-crust pizzas. \n\nTo be honest, the only difference between these tourist traps and nationwide chains like Papa John's and Pizza Hut is that you're getting a lot less food for a lot more money. And time. Standing outside in the cold for an hour to get in? I'm sorry, but I took psychology 101 in college; I'm not going to fall into a cognitive dissonance trap the way every ignorant New Yorker or tourist will. Just because I waited and paid more doesn't automatically make the food better. There's a thing called objectivity, and it appears that a majority of the people that come here have lost it. \n\nThe pizzas are covered with a few chunks of mozzarella, and I'll take their word for it that it's fresh. This is supposed to be the big difference between them and major pizza chains. That and the insanely long line. Granted, Pizza Hut in New York is considerably worse than Pizza Hut in other cities, but really? This is supposedly the best pizza in New York, and by extension (because New Yorkers are delusional and think they're the greatest thing since sliced bread and Jesus combined) the world? FUGGEDABOUTIT! I prefer Pizza Hut's cheesy bites pizzas! The pizza here is foamy and airy. There's no substance to the carbs, and it's not even filling. It's mass produced pizza at its worst, and yet people line up for blocks to pay their hard-earned money for it. \n\nHonestly, it's pathetic. Stop letting reviews and word-of-mouth and lines change your perception, people. Eat and judge for yourself.", "author": "Dai L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-06", "description": "It was very good pizza! But I think based on the hype, we were hoping for something a bit more wow-ing, especially because it was our first food stop in NY. It's definitely worth checking out though but I would never wait in line for it and luckily we definitely didn't have to (but I think we also went around 4 pm on a Saturday). The service was fine but it's pretty much a pizza place so nothing more expected. We were on the 2nd floor and unfortunately seated near a VERY obnoxious group of teenagers celebrating some sort of group valentines day thing and we were tired and freezing from walking the Brooklyn Bridge there so overall, I just can't give it more than 3 stars.", "author": "Lindsay W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-28", "description": "I've always been a Lombardi's fanatic. I actually used to believe that no pizza could be better. Now, I know better. \n\nWe weren't really that hungry and ended up taking a lot of our pie home. Somehow, we didn't eat the rest of it for a few days. We popped it in the oven for a few minutes and sauteed some garlic in EVOO and had a small side of homemade ricotta...it was so good I wanted to cry.", "author": "Raquel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-11", "description": "Love the pizza here. Not the best though (Lombardi takes the spot).\n\nI order to go many times and they are fast with the orders- usually wait for about 20 minutes. I usually order the large pie for $14 and I add on sausages ($1.50), mushrooms ($1), and brocolli ($1). The prices are very reasonable. The pizza here taste really good, better than patsy but not better than Lombardi's. The crust is thin and the pizza sauce taste just right. \n\nI usually come here before closing to avoid the crowds (around 9:30pm). Service is good, quick and to the point. Bathrooms are clean. What's not to love about this place.", "author": "Luna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-20", "description": "Came here due to the high Yelp reviews. Once we arrived, there was a long line. We came by Saturday at around 3. Well we decided to keep walking around the neighborhood. Came across a park down the street overseeing Manhattan. At this point we decided to order carry out from this place. Basically, you tell them what you want on the pizza. I made the mistake of asking for an, \" American style\" and the lady responded by saying, \"we don't have that you make your own\" humm... Anyways we ordered a larger pepperoni with garlic pie and a small sausage, pepperoni, extra cheese. Antipasto which was good but should have just ordered the pizza alone. We also ordered a cannoli for dessert, ah yeah not next time.  I am sure if we were to dine in everything would have tasted better but not those two things. Totally recommend you order your pizza for carry out and enjoy the scenery if he line it too long and you have kids with you.", "author": "Gina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-01", "description": "As a Londoner, this place is by far the best Pizza to be had outside of Italy.\n\nIt is thin, crispy and has an authentic Italian American flavour to the decor, the ambience, and atmosphere. A family run feel, with lots of personal touches from the photos of Frank Sinatra that adorn the walls to the owner (I think it was him) who greets those that brave the cold and wait in line for a very long time to have the pizza.\n\nHighly recommended to all Brits (and others) who have no equivalence in the U.K (authentic Italian American pizzeria.)\n\nAmerican pizzas have options for random toppings, not commonly use in UK like 'Broccoli' which actually is not as bad as it sounds!\n\nThe base is crispy, thin and as fresh as you could ever want it.\n\nWhilst not dirt cheap, its also not expensive. I highly recommend for all visitors to NYC.\n\nDefinitely go to Grimaldis!", "author": "Ronnie Y. B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-07", "description": "Well worth the wait for the quality of the pizza.  It has a very old school New York vibe and the pizza is actually amazing.  I live close by and go here often.  I would not consider a tourist trap.  The only thing that is a bit disappointing is the lack of friendliness and attentiveness of the servers.  I would chose this over the next store \"Juliannos\" place.  I know it seems strange considering that the original owner owns that place but I really like the taste of the pizza better at this place.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-15", "description": "This place is so overrated that I can't even breathe. The pizza was, literally, just OK. \n\nAnd trust me, I've been eating New York pizza my whole life, AND had pizza in multiple Italian cities. \n\nLarge portion sizes yes, but large portions of mediocre pizza. Save your cash and your time.", "author": "Deedee M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-06", "description": "Superb NY pizza, from a deep dish loving Chi-town pizza lover. Margherita is great just as it is; simply delish.", "author": "L C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-11", "description": "Overall, pretty damn good NY pizza at Grimaldi's.  We didn't have to wait long at lunchtime on a Thursday, and once inside the service was swift (occasionally maybe a bit impersonal with how many people they shuffle through).\n\nBut the real reason you're out here -- the pizza -- is worth the trip.  For the two of us, a small pizza was plenty of food, and I'd save the large for a group of at least three or four.  Everything about it was foldable, delicious and mozzarella-dripping.\n\nGrimaldi's is a great example of an iconic NY eaterie that has made it big and scaled well to its popularity (unlike some other places).  We'd definitely come back.", "author": "Nate M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-03", "description": "Great tasting pizza!  The calzones are great too! Only downside is, there is usually wait on the weekends.  In my opinion, it's definitely worth the wait if you have time.  I would return!", "author": "Jeff T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-16", "description": "Pros: The pizza is delicious and the toppings are super fresh. Closest to real Italian pizza you can get outside of Italy. Love the soda selection. Prices are also decent.\n\nCons: The wait. Don't come here if you don't like waiting. I've been to Grimaldi's four times, and I don't think I've ever spent less than two hours from the back of the line to exiting after the meal. Not only is the line long, but service is slow and it takes forever to pay the bill. It's nearly impossible to get a waiter's attention. Last time I was there, I asked for water and never got it. One of the doors in the bathroom was broken last time I was there too, and there was no toilet paper in that stall. The pizza also always gets cold before I finish it. \n\nTips: Don't ask for ridiculous toppings that aren't on the menu. If it's not on the menu, it's insulting to ask for it.\nParties of 4 usually get called in ahead of parties of 2. \nTake-out is put in a paper bag, not a box.\n\nEven though it has its flaws, I always suggest Grimaldi's to my friends from out of town, because it's just great pizza.", "author": "Ronda R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-23", "description": "Second things first: its cramped, cash only and no slices. But, you came here for the pizza, which is pretty damn good.\n\nWe ordered two larges, one pepperoni and one sausage for the 4 of us. Price plus (generous) tip came out to $12 a person. (thats 4 slices and a drink a piece.) I would've been totally happy with just the 2 slices so 1 pizza can and will serve 4 people. The crust is thin but sturdy, sauce is light and flavorful, mozzarella is fresh and its topped with fresh basil. Pepperoni was better than the sausage but both were really good.\n\nWe got there about 1230 and had no trouble getting a seat, but as we left about 130, there was a line outside about 10-15 people deep.\n\nBottom line, its really good pizza for a really good price. Check it out.", "author": "Matt C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-19", "description": "ABSOLUTELY THE BEST NY PIZZA - hands down!!!\n\nMy friends weren't kidding about the line.  We went here for dinner and waited an hour and a half.  The line wrapped around the block.  I HATE LINES but it was well worth it!!!\n\nOnce we were seated the service was quick.  We ordered a white pie, pepperoni, and calzone.  The calzone was HUGE, it was the size of 1/2 an entire pizza and filled with loads of cheesy goodness.  Between 4 men and 2 women the food was plentiful!  I wanted to order a cannoli for dessert but I was way too full.  The white pie is unlike anything you can find in Cali.  I've tried other white pies here and their attempt is purely sad. No comparison.\n\nGrimaldi's in Vegas is pretty good too but I prefer the BK location.  It just feels more authentic to me! haha", "author": "Nikki C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}