{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-03", "description": "Finally, I had the pizza. There are always, always people waiting outside. I could not imagine waiting for hours for a pizza. So I went there around 2-3 pm. Without waiting. The price and pizza was ok. Those dessert are too sweet for me.", "author": "Joey Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-18", "description": "Great location under the Brooklyn Bridge! \n\nAs you step inside the pizzeria, it feels like you're stepping back in time. I love the ambiance and the olde style black cherry soda and cream sodas available. Service was even better! \n\nPizza was good, but not out of this world good. But it is definitely worth checking out. Then you can burn off the pizzas by walking on the BK bridge after. Only thing is why don't they have salads??", "author": "Drew K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-11", "description": "Very good pizza with very nice price. You have to stand on line for at least 30min which i didnt like. Pizza was amazing price was amazing but the waiting time sucks", "author": "Jung P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-09", "description": "45 minute wait on a sunday night for dinner (whether you're ordering in/out)!\n\nis it just hype OR is Grimaldi's thin crust pizza worthy of brooklyn? locals might say it's a tourist trap BUT i do think the WHITE PIZZA is worth some mention! (although i wouldn't wait a full 45 minutes for it)\n\n---white pizza w/ mushrooms \u0026 olives: LOVE the CHEWY sliced mozzarella \u0026 slightly charred crust!!! however the olives were a bit too salty... MMMmm! sad that most people probably stick to the tomato sauce pizza\n---tomato sauce pizza w/ sausage \u0026 pepperoni: not bad but nothing special\n\na small pizza has 6 slices VS a large has 8!\n\nNOTE: you pay per extra topping \u0026 its CASH ONLY", "author": "Jenny S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-08", "description": "Went to Grimaldi's based on its reputation as one of the pizza dynasty restaurants. I was not disappointed. The taste was fantastic. We went at a time with very few people (between lunch and dinner on a Saturday), so the service was fast. \n\nCouple things that could have been better: 1. there were some spots on the pizza that had no cheese or sauce - just toasted pizza crust. 2. the center of the pizza was still soft and floppy- woulda been great to have a better crunch in the middle, but that's more of a style thing", "author": "Namir S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-30", "description": "Yes - it's worth the hype.  All our family and friends in the area told us we had to eat here if we found ourselves in Brooklyn...well, as faith would have it we ended up taking a water taxi to DUMBO and walked to Grimaldi's just in time for lunch on a weekday.  The first floor was already full so we were seated on the 2nd floor.  We got a window seat which had a great view of the building interiors overlooking the 1st floor.  Service was curt...which I didn't like. I thought to myself this pizza better be good.  And it was!  Simple menu, reg or large with your choice of toppings.  The reg was perfect for two adults.  We also ordered the antipasto platter for our daughter.  She doesn't eat pizza yet so the appetizer which had fresh tomato slices, mozzarella, olives and salami (which we ate) was perfect for her. \n\nFood came out really fast.  I think we just came at the right time.  The pizza was perfectly balanced.  Crispy and chewy - Not too heavy on sauce or cheese.  And there is NO crust.  The pie makers here make it the real way in which they take the sauce and cheese almost all the way to the edge of the pie.  I love that - I hate when a slice is mostly doughy crust.   Service also got better once we were seated and the food began to arrive.  Even if guys try to act like bad asses, being around a friendly toddler will always get them to smile.  \n\nSo yes - believe the hype.  Enjoy the wait by bringing friends, a good read, or some tunes.  And reward yourself by stuffing your face!\n\nBaby tips to know: small dining area.  Break down your stroller to get into the restaurant.  They have a designated area to place them (near the stairs). No changing table in the bathroom.  If you (or the baby) prefer one, there a changing table in the park next to the Garden Cafe.", "author": "Lea G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "Best pizza in new York. Small restaurant the seating is really tight but it's NYC. Waiting time can get long. Worth the great food. Staff was quick at waiting tables.", "author": "Sahar L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-07", "description": "You can certainly do worse. It's better than any of the chains that people who come here in droves (tourists) are used to, but that's faint praise for a pizza place in the world capital of pizza. Service is also apathetic at best.\n\nIf all of the glowing reviews and hype about this place are coming from locals, they need to get out more. The hubris of this place billing ITSELF as \"the best pizza in New York\" is so transparently laughable once you taste what they serve that it deserves a docked star. Go to the Bronx.\n\nOh, and any sit-down restaurant that only accepts cash in 2014 is probably a front for something illegal. Knock that shit out. You are popular enough to afford the credit card fees.\n\nOverall, not impressed.", "author": "Brandon V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "It's a Sunday late afternoon and having a great time. The area is a great place to spend the day. the service was great and the food is amazing.", "author": "Robert W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "Very good pizza! Brick oven baked. Pizza is made on the spot fresh (not precooked and then warmed up. Take a pie to go and eat it on the nearby waterfront.", "author": "Vincent D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-30", "description": "We are long time Grimaldis' pizza lovers, both in New York and in Texas where we moved from - and I still love their pizza.  However, our last visit turned me off - probably forever.  Two negatives, one I am willing to assume was a mistake, the second practice unconscionable.\n\nFirst, the mistake ... we ordered antipasto and we never got it.  No big deal.  But then it showed up on the bill...still no big deal.  But then, as we were looking at the hand-scribbled, nearly illegible bill, I see \"SC\" and a charge for $11.95.  With more than 25 years in the restaurant business, I quickly determined that \"SC\" stood for service charge - which confused me greatly because on this occasion, we were only a party of four.\n\nWe spoke to our server who quickly removed the charge for the antipasto, but told us the \"SC\" was a service charge and servers were allowed to add on whatever they felt like to the bill!\n\nGiven that we eat regularly at Grimaldis and have never experienced a service charge, we took this to the manager who confirmed that, indeed, Grimaldis' servers are authorized to add whatever service charge they deem they deserve. \n\nWe left to go get ice cream at the Brooklyn Ice Cream Factory (best ice cream!!) and thought about and discussed the service charge.  In the end, I went back to Grimaldis and spoke to the old guy who I think is the owner.  He told me, and I quote, \"I let the servers put their service charge on because there are a lot of foreigners here and they don't understand about tipping.\"  I told him I thought it was a scam, that he was preying on tourists (which I am not), and the way the \"SC\" is scribbled on the bill, I know - after 25 years in the business - that many people who DO tip will miss that this is the gratuity and double tip.  \n\nIn the end, all he was concerned with was that our server forgot the antipasto (which he included in his \"SC\" calculation); he hauled the server downstairs and proceeded to yell at him in front of all the diners about forgetting the antipasto.\n\nGrimaldis is a cash only operation.  Service Charges are taxable to the business.  Businesses are required to let customers know - in advance of the service - if a service charge will be added to the bill.  Grimaldis' checks are old-school green, handwritten checks - no computer tracking, cash only ... I'm now very skeptical about Grimaldis' business practices and how legitimate they are...", "author": "Dawne M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-11", "description": "This place is just okay...the line outside of the door is ridiculous and the ATM upstairs has a $5 fee! There's a bit of a wait for the pie and there's no takeout options. But apparently they had to move to this location to expand, in order to meet the client demand....so they must be doing something right....meh. The beautiful pier/Fulton Ferry is around the corner with an amazing view. Also Brooklyn Icecream Factory is there.", "author": "Nancy I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-22", "description": "Not fan. As a Brooklyn native, I thought this was the spot to go to. It's nothing more than a tourist trap. Cash only so you know it's been laundering for years. The worst part is that I came in for take out, got bumped in the chest (I'm a female) by a delivery boy. Very uncomfortable and poorly directed set up. Not worth the trip and very disappointing.\n\nThey also have a B health rating so be aware.", "author": "M C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-23", "description": "I do want to give this place another shot since there seems to be so much hype around the pizza here! \n\nI took some friends that were visiting NYC here since I heard it was the best pizza in NYC. We pretty much got seated fairly quickly (maybe 20-30 minute wait?) and we ordered two pizzas. One small plain pizza, and one pizza with pepperoni, garlic pepperoni and sausage. \n\nI liked the plain pizza more but I wasn't all that into either pizza. I thought the crust was a little soft and didn't have much of a crisp (I would pick up my slice of pizza and the front would pretty much droop down). The sauce was tasty and so was the cheese but the crust was enough for me to drop it by 2 stars since I'd say that's the foundation to any good pizza.\n\nI'll try to give this place another shot sometime but based on my first experience I would just say the place is okay.", "author": "Randy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-29", "description": "Yes folks, Grimaldi's Pizza lives up to the hype.  At any given point there are huge lines outside the establishment waiting to be served Grimaldi's famous Pizza.  A huge reason the line's are so long besides the 5 star Pizza taste is because many tourist's that come to NY are being pitched to come eat there as part of their Brooklyn Bridge tour.\n\nThe Pizza itself is served only as a whole pie with many topping to choose from.  The Pizza is made in a thin crust style and almost feels like you're popping them in your mouth like chips.  Every bite is a good as the first bite.  I would recommend getting some red wine with your pizza.  \n\nThere is only one catch to this place and that is that they only accept cash.  Cash is king in this joint.  For any pizza lover, this is the place to experience thin crust Pizza heaven.", "author": "Freddy V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-10", "description": "Great pizza. My favorite part of Coney Island visit . If you don't want your pizza very well done , just ask them . Fresh ingredients, good service .", "author": "Michelle H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-23", "description": "Tip 1 is to go late, at 1030 pm there was no wait, we walked in and sat like we owned the place.\n\nTip 2 is order it with extra mozzarella, it's the perfect amount of cheese\n\n2 toppings on a large for $18 might be the best deal in NYC..pizza was pretty much greaseless, perfect crust and sauce..absolutely no complaints..\n\nLike Lombardi's you get the feel of it being a tourist trap but its far from overated in fact it's probably underated...Compared to Di Fara's it's so much less greasy but it's Polly-o mozzarella so not quite as tasty", "author": "Nick A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-26", "description": "Hands down the best pizza I have ever eaten!! Incredible toppings (it's the cheese!), flavorful sauce, non-greasy, and chewy/soft crust. Yes, the wait here is ridiculous but it'll give you more time to build up your appetite and enjoy the pizza even more. However, you can easily bypass the line on a busy evening if you only come with one other person and agree to sit at the bar. My friend and I did that and we only had to wait about 30 minutes on a Saturday night. The bar seating area was comfortable and spacious.\n\nThe price here is good too. Split a small original pizza for $12 between 2 and you'll definitely be full. Drinks(Soda/Snapple/Root beer) are only $2. Finding a nice dinner that's so delicious for about $10 a person in NYC- I'm sold! Definitely coming back to Grimaldi's. The line is worth the wait!!!\n\nOther notes: Cash only. Pizza not sold by slice!", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-04", "description": "BEWARE: Don't let a name fool you. The original Grimaldi's is located next door and named Juliana's. This occurred when Patsy Grimaldi sold his name to a new owner and couldn't claim It back so he opened a new pizzeria and named it Juliana's. Since the changes with ownership I feel that the quality of Grimaldi's has gone down. Due to being unaware of this fact most ppl still crowd over this place. Hope this review helps in enlightening your choice!", "author": "Farhana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-23", "description": "Grimaldi's coal brick oven pizzeria is nestled under the Brooklyn Bridge and isn't far from the water and Brooklyn Bridge Park. Be warned, though, if you're walking the bridge, because you end up having to trek pretty far inland before you're able to double back. Authentic, gourmet pizza is becoming easier to find, even outside New York, but Grimaldi's seems representative of a venerable New York tradition. Their barebones pizza-oriented menu complements their efficient, no-nonsense approach to service. It's cash-only, and they don't sell slices. The baseline pizza comes with crushed San Marzano tomatoes, fresh basil, and fresh mozzarella, which is excellent on its own. There are all kinds of toppings, but the prices won't allow for an affordable \"supreme.\" I feared a wait, but we sat down immediately at 5:30pm on a Monday.", "author": "David L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}