{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-13", "description": "My sister and her boyfriend and several other friends recommended Grimaldi's for pizza while in New York. Looking up the place online, I learned that there were several locations, including one in Manhattan which was closer to me, but I was told to come here anyway. I ended up here by accident on the day that I went. Not because I didn't want to go, but I ended up getting on the wrong subway and was close so I just went and explored the surrounding area. The line there was LONG! Crazy long!\n\nSo my friend stood in line as I went to look around the area and took pictures of the surrounding area, including the Brooklyn and Manhattan Bridges as well as of Brooklyn Bridge Park and the Statue of Liberty so that was nice. We then switched places so she could explore while I waited. \n\nIt was crazy because the area was crowded, but it was just for Grimaldi's. There were other restaurants which were like ghost towns there and we went to a bar prior to heading over just to have a drink before coming over (I didn't know it would be that crowded but oh well what can you do?). That bar was empty too. People only drink there it appeared but headed to Grimaldi's to eat. I even heard a staff member at that bar saying to her coworker that she hoped that she would make money that night. That's how empty it was there! Kind of sad.\n\nAfter 90 minutes of standing in line, we were called in. Smaller parties get in quicker so definitely do that! Also, the quarters are pretty close. There was maybe an inch between our table and the tables to the left and right of us. One party requested a more intimate area because they felt it was so close. To each their own. We ordered a small pizza, consisting of 6 slices, split in half. I had sausage and mushroom with cheese. The mozzarella cheese is fresh and good. Mushrooms and sausage was delicious as well. I even had an Italian beer to fill out my experience.\n\nSo why 3 stars? The wait. It was good, but NOT worth waiting 90 minutes for me. There is only one restroom to use and so we got to stand by the kitchen and watch them make the pizzas and calzones in front of my eyes. That was kind of cool to see the food being made. But it was crazy crowded and while I was full from the 3 slices (yes, we each completed our half of the pizza), the wait didn't justify it for me. It was a nice trip, but I think the place is a bit over-hyped. Maybe expand the place or something because I wouldn't go back for such a long wait. I had pretty good pizza in other more fast food type of joints in Manhattan for less money with less wait and it was pretty good. So it really has to wow me to make me come back because it was a HOT day waiting out there on the sidewalk like that.", "author": "Tony T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-01", "description": "I know this is a popular spot for pizza in NYC as evidenced by the 30-60 minutes waiting time that my friends and I had before we were seated.  We went on a Sunday in December of 2011 for lunch and the queue for tables was outside and at least 40 - 50 feet long.  \n\nThe place was packed and didn't help that we were seated in tight quarters in a corner.  But it seemed that the seating and arrangement of tables were very tight.  The table tops seemed smallish too.  Not exactly the easiest place to sit comfortably over a meal.\n\nThe pizza itself is good but does not live up to the hype.  I don't think it's worth waiting in line for a long time to eat their pizza, but I've never been the biggest fan of NY-style pizza to begin with.  This might be worth trying if you are a fan of such pizza, but otherwise, keep your expectations tempered about how good Grimaldi's pizza is.  Also, if you're claustrophobic or just have more girth than most people, you probably won't be comfortable eating in their dining room.", "author": "William L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-10", "description": "Worth its reputation. I like this pizza better than Lombardi's. Amazingly, there was no wait on Sunday evening around 6 pm and the waiter took our order right away. Good service, basic pretension-free decor, and appropriate prices for famous, wait-worthy pizza in a beautiful location on the water (though you can't see it from inside the restaurant). A good place to take out-of-towners looking for a New York pizza experience -- and you can check out gorgeous Brooklyn Bridge park before or after.", "author": "Sarah F. H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-17", "description": "Overall I was seriously disappointed.  I am happy i didn't have to wait in line, because that would of sent me over the edge.  The pizza is pretty standard if not below standard, the selection is minimal and the place just feels cheap.  There are so many better pizza places in the city that i would say skip grimaldi's.", "author": "Simon G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-10", "description": "Completely overrated.\n\nIt's good, but not good enough to be freezing outside waiting for an hour and a half. Definitely not worth it to be at the front of the line thinking that it's your turn but everyone else gets to go in front of you because they don't have a table of 2 yet. Then as we're seated, my boyfriend notes that the back row is all minorities. I thought that was kind of funny.\n\nI mean, the pizza is good, but I didn't orgasm or anything. Sad, I know. I just chowed down and left...kinda hungry after splitting a large pie with the boyfriend.", "author": "Cheryl P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-21", "description": "I went back ... even after I told myself that I wouldn't. I remembered that the pizza was pretty tasty, and rather cheap, and time had softened my horrible memories of waiting in line for hours.\n\nUntil I actually got there. After waiting in line an hour (not long this time), I was told that takeout (which I planned on taking to the very nice park a few blocks away) would be at least another hour - what!? So we decided to eat in. Even though we were at the front of the line, it took another 30 minutes just to get in the door. Once there we ordered and began to wait again...... \n\nWith nothing better to do, I started looking around at what other tables had ordered and noticed something odd... no one else had a pizza. Not a single other person in the restaurant had any type of food. It seems that around 6 pm - prime time dinner - they decide to refuel the fire - a process that takes the better part of an hour. So we'd have to wait for that - and then wait for all the other pizzas before us - just to start eating. \n\nAt this point I flipped out and couldn't take the wait anymore. I left and won't ever go back again. Grimaldi's will always have a line because somehow their mediocre pizza is famous. Because of this they don't care if you come or not. I'd rather eat my own head than try to go back again - just out of spite.", "author": "Steven J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-12", "description": "The line is long with particularly with tourists coming off the brooklyn bridge.  So for sitting down there is a bit of a line.  Takeout is much speedier.", "author": "Daniel Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-20", "description": "I went to Grimaldi's in Dumbo for the first time about three years ago with a couple of friends that were doing their engagement shoot nearby. It was freezing outside, and we insanely waited well over an hour on line to get our pizza fix. While the meal was really good, I pondered for a while if it was worth the wait. Was it just that any pizza tastes good after waiting in the cold for over an hour when you're starving? Maybe. Maybe not.\n\nI finally made my return to Grimaldi's last week with my sister-in-law for dinner. Although it is no longer in the same location (instead it is now right next door), not too much had changed except for one major aspect: there was no line. Oddly enough, the pizza place that assumed their original location next door, did have a line, even without the iconic name. I wondered if it had something to do with the brick oven that remained at the original space, because we expected a wait on a Friday night, but there wasn't one. \n\nThere's an odd feeling from the service at Grimaldi's. Despite there being no wait, I greatly felt like our presence was an inconvenience. The man who seated us (who I suspect is an owner) mumbled something about how difficult his life is as we were being shown to our table. I almost felt compelled to apologize for coming until I realized how silly that was. There's also a lot of rules at Grimaldi's. No credit cards, cash only, no reservations, no slices, no delivery, and most recently... no alcohol (which is perfectly fine with me as both of us are pregnant, and I was never much of a drinker anyway). Since the alcohol section of the menu was crossed off with masking tape, I began to hypothesize that they once had an alcohol license, but perhaps didn't get it at the new location for whatever reason, which could be the reason for the lack of wait. Didn't matter to me though. Eventually we got our pizzas and they were gooooood. So it wasn't just the wait fooling me previously. They definitely make a mean pizza. I don't think it's unlike Lombardi's or many other places-- that's the thing about pizza- even bad pizza is good pizza- even those $1 slice joints. I think if I'm already in Dumbo for something, I would definitely go back, but it's not something I would go out of my way for. It's an easily duplicated experience that could be met with better service, and perhaps the acceptance of a credit card.", "author": "Samantha S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-04", "description": "Not worth the hype. The wait in line lasted about 15/20 minutes and it was pretty cold. Once in, took a little while for a server to take our order. I'm a pizza lover so expected something glorious. It was ordinary. The pepperoni added so much flavor, but without it it would have been pretty bland. Half the pie was chicken, but I did not enjoy it because there was no seasoning. The pluses were you are able to watch the pizzas being made, so its enjoyable if you you have kids and the decor is pretty neat to look at nothing super fancy, just old photos. Ive had better Brick oven pizza, but this you can choose to live without.", "author": "Judith O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-24", "description": "Iconic pizza place famous for lines and amazing Manhattan views. The pizza is thin crust, pretty delicious but by no means the best I've had. But very nice to sit on the waterfront and eat a slice on a nice day. Trick to bypass the neverending line (for takeout) - stroll in like you own the place, tell them you live in the neighborhood and just order. Or - call ahead and order as you begin walking across the Brooklyn Bridge, will be ready by the time you get to the other side!", "author": "Jen J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-25", "description": "My guy friend just fall in love with Grimaldi's when they have their first pizzeria experience in Brooklyn!!! My girl friend and I had tried Lombardi's before this and we keep saying that Lombardi's will definitely be better!!!\n\nSince Grimaldi's is located 15 minutes walk away from our apartment.. We always ignore it and head to Manhattan during the weekends.. So we came to Grimladi's once on a Sunday evening around 6.. The line is super long and I guess we waited for at least 45 minutes to an hour?? I am not sure.. I am too hungry to think about it.. I am glad that I am here with all of my AWESOME friends to keep me away from complaining.. The weather is extremely hot and sunny!!! I haven't had a good meal for the whole day and I was extremely grumpy!!!!!! Grrrrr....\n\nTheir business model is a little weird where we have to stand and wait in a line instead of writing our names into a list. The pizza was served in less than 15 minutes.. 5 minutes later the large pizza was gone!!!!!!! That explained how hungry we were!!! \n\nMy guy friend gave me the largest piece of pizza which I did not realize because I am way too hungry... I am too lazy to rate the pizza since I am extremely hungry.. the only thing that was on my mind is to EAT!!!! so.. my first bite.. Mmmmmm.... great pizza... so i continue eating it... \"So.. Do you prefer Grimaldi's or Lombardi's???\"... After filling my stomach with half slice of the pizza... It makes me stop and think for a second.. My experience with Grimaldi's is good.. I am not a huge pizza fan.. but something tells me that I prefer Lombardi's pizza compare to Grimaldi's.. I guess the cheese and the ingredients that used to make the pizza might be different??? I feel that the cheese in Lombardi's pizza is fresh and there is a weird taste in Grimaldi's pizza.. (well if I really have to compare since that was the question..) \n\nPut it this way... I give Grimaldi's a 5 stars because the taste of the pizza is good as well!!! :) and it's not expensive as Lombardi's.. it's almost half of the price.. The dollar value that I spend and the amount of the time I have waited to get a table.. \n\nSo.. if you ever want to save some money \u0026 don't mind the waiting for a good pizza.. COME TO GRIMALDI!!!", "author": "Shing Yiing O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-20", "description": "Good pizza not sure if it is worth the wait and congestion inside.  There are other brick oven pizza places.  More touristy than local eatery.", "author": "Theresa C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-07", "description": "I finally got around to eating at the original Grimaldi's! The pizza was good, but I didn't think the hype was there that everyone makes it out to be, maybe I'm just not a big pizza person.  Two negatives: Cash only and there were a bunch of little gnats flying around the whole time. Other those two little negatives definitely a must try restraunt to visit while you're in NYC.", "author": "Zach P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-07", "description": "A perfect combination of rudeness, cramped seating and mozzarella cheese makes this place a true legend. This is one of my favorite pizza places ever. How could you go wrong with a true Brooklyn classic? if you want to truly indulge in some of the best pizza around, make sure you stop at Grimaldi's.  My personal favorite is the sausage, onions and peppers. Amazing.", "author": "Matthew C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-14", "description": "As I traveled through New York, a lot of people told me to try this place and were touting how good it is, so I decided to stop by and have some.  I have to admit, for the hype and for the wait that I had to endure to get in, I wasn't that content with it.\n\nThe pizza itself wasn't bad, it was a very thin crust, and the toppings were plentiful.  I'm not going to knock it and say it tasted horrible, because it didn't -- it was good.  I think that with the talk and the hype, I was expecting a bit more of a pie (thick crust) type of pizza.  It was just a little bit disappointing, considering the nearly two hour wait to get in.\n\nIf you're coming through Brooklyn, I think this is a place that you can glaze over and ignore, unless you want to try for yourself, then go for it.", "author": "Thomas Ticha P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-13", "description": "This pizza.... DELICIOUS. I wanted on line for about an hour and a half, was it worth it? I guess, but would i wait on line again for the pizza? Absolutely not lol. If I saw a short line, i would definitely wait. \n\nThe more people you have, the longer your going to wait, so I don't recommend you go in a big group. \n\nIn conclusion, the pizza is one of the best ive had, but its not worth the long line.", "author": "Giovanna T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-31", "description": "If you're in this part of Brooklyn and you have a craving for Pie, then by all means stop in and sample what Grimaldi's has to offer.  Pizza joints in New York are like Cheesesteak shacks in Philly, they're everywhere.  \n\nWhether it's a six-slice or eight-slice pie, it's coal brick oven baked pizza.  Thin slice, with just the right firmness, it'll hold up on it's own provided you don't customize with too many toppings.  The down-side to this thin style, quick bake pie is that it cools down real fast after coming out of the oven.  This shouldn't be a problem for a group of four; two diners will note that the final slices may be room temperature.\n\nGrimaldi's is notoriously one of the best pies in and around NYC, while that notoriety may be a bit embellished and oversold, it's not THE best!  They've got many years of fame and tradition spread worldwide that keeps the touristas and locals waiting in line.  I was there on a Wednesday around 3PM and there was no line or waiting.  Our pie arrived less than 15 minutes after we ordered and it was a tasty treat.\n\nIf you googled Grimaldi's and go in search of it on Front Street after coming off the Brooklyn Bridge; it is now on the corner in a large white building.  They've moved from their original canopied spot in the middle of the block.  Nice ambiance, with a jumble of who's who photos lining the walls in what feels and looks like an old corner bank.\n\nPlease note: There are Four No's with this place; No Credit Cards, No Reservations, No Slices, and No Delivery.  So put on your walking shoes, grab some cash, be prepared to wait and hopefully you will not be disappointed.", "author": "Mark T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-30", "description": "Waited in line and it was worth it. I ordered the food in line and then picked up the pizza to go. It only took 20 to 30 minutes. \n\nI'm not into thin crust pizza but wow...I really like Grimaldi's thin crust!\n\nOrdered a large pepperoni and mushroom pizza. It was amazing! Fresh mozarella. Small pepperonis.\n\nI'm craving it now as I write...gosh, I will comeback to this place!", "author": "Mary Ann V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-19", "description": "My second visit to Grimaldi's.  We got there around 2:30pm and only had to wait for 1/2 an hour for a party of three.  Not bad!\n\nGot the large pizza (half regular and half white) and added pepperoni, sundried tomatoes and mushrooms.  It was a great combination and all the ingredients down to the tomato sauce were fresh (the regular is a lot better than the white).  The host serenaded us with his accordion and a song from San Fran since we told him we were visiting from there.  \n\nService is friendly and speedy.\n\nI have to say... in the case of Grimaldi's vs. Lombardi's.....the winner is Grimaldi's!!", "author": "Sandee L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-11", "description": "This place it waaaay to overrated because it's a tourist trap. I've made better sauce out of a can and I'm not Italian (much like the pizza makers there). I think the best part is that everyone says \"You have to get toppings!\" As a pure bred Brooklynite, it's not a good pizza if you hafta dump more than (1) topping on it.", "author": "Benjamin C."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}