{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-16", "description": "Long lines usually indicate how absolutely yummy a place is. Ehhh...I can't say the same for this place. The pizza really just tasted mediocre to me. I had a small, white sauce, with ham, pepperoni, and Italian sausage. I really wanted to love this place, since I waited OVER AN HOUR and it was highly recommended by locals. Honestly, I gotta agree with fellow yelpers and say this place is over-rated. The restaurant is loud and extremely crowded and cramped, I wouldn't recommend mommies to eat-in with their babies.", "author": "Juleo R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-26", "description": "One of it's kind pizza... The wait in line was worth and only after we left I realized I had over 5 slices of pizza. Try the plain , simple margarita pizza to enjoy the real taste", "author": "Ronak P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-31", "description": "For me, no trip out to Brooklyn is complete without going to Grimaldi's. There's pretty much always a line out the door for a table, but the wait is well worth it. The pies taste fresh and arrive quite quickly. Afterwards, get ice cream at the Brooklyn Ice Cream Factory and walk around the park or cross the Brooklyn Bridge : )", "author": "Kelsey K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-19", "description": "\"Very good the pizza was.  An hour's wait, worth the time it was not.\" - Yoda", "author": "Michael D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-15", "description": "The 2 stars is for the service, but I'll comment on the food first.\n\nThe pizza was certainly fresh, with real mozzarella and a crushed tomato sauce.  A small pepperoni (6 slices) was MORE than enough to feed my friend, Lindsey. and me.  We each were only able to eat 2 slices.  Not my favorite pizza, just because I'm not a huge fan of straight up slices of mozz on my pizza.  But definitely worthy of a try.  And prices are decent too.  $12 for a small pizza sans toppings.\n\nOk, so the service was absolutely horrendous.  There was a line of about 10 people at noon on a Monday when we went, but we prob didn't wait more than 25 minutes to get in.  Definite plus.  The guy/host that runs the show (who may be the owner or manager or who knows) was really nice.  He greeted us when we got in and made sure to ask how things were and ask that we come back when we left.  Another plus.  But the waiter was horrible.  They have so many people wanting to eat there that they just want to get you in and out.  I asked for a root beer and I got a 'tude from the waiter saying they didn't have any today.  He was probably annoyed just because that's prob the 192384th time he's had to say that today, but honestly, how was I supposed to know?  Then the table next to us tried to get his attn and he completely ignored them.  I was sorely disappointed.  And his tip showed it.  I worked in the restaurant biz in college and even if you're in a crap mood, you best move on and do what you're supposed to do - serve and please the customer.\n\nI wanted to take my family there in April, when they come to visit, and I probably still will.  But only for the satisfaction of saying they've been to the famed Grimaldi's.", "author": "Lisa W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-23", "description": "Good Pizza but not worth the wait. There are dozens of pizza places in NY that is just as good or better without having to wait in line forever. The new location is bigger but the oven capacity did not look like it increased which means longer wait for your food.   Don't believe the hype.....", "author": "Aaron A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-10", "description": "When I ask where the best pizza place is in NY, people always point me to this place. We finally got to try it. It lived up the the hype. They use real pieces of cheese and not the shredded variety which makes the pizza even better. Add on some extra garlic and wow, amazing pizza. Why can't we have pizzas like this back on SF bay area? I'll miss you Grimaldi's", "author": "sammy z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-23", "description": "I drive by this spot when i go home, i heard so many stories and how good their pizzas are so i had to try it as a pizza lover i am....i already knew that there was gonna be a line but i didn't know it was gonna take an hour and half to wait outside in a nippy weather glad i came with 2 other ppl we took turn waiting and i brought back hot choclat as we waited not mentioning the old grumpy host was rude and taking bribes to slip ppl in like it was some club everyone was pissed but we stood there like soldiers waiting for our turn and as we got closer we got excited and finally he let us in and we rush in like lil kids in a toys store.  So i have to admit the pizza was very good and i enjoy every bite of my thin crust coal brick oven sausage, pepperoni, ham, mushroom pizza and i must say price was not as bad as i thought but is it worth the wait and to deal with a grumpy old man prolly not so thats where the 3stars comes in other than that u should try it once and next time i will order by phone to take out and eat it by the Bklyn Park to avoid all that traffic.", "author": "Tommy J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-04", "description": "I'm pretty skeptical of anything anyone tells me is \"famous\" or a tourist attraction, so i didn't expect a whole lot from this place, and boy I was wrong!  I'm not sure how long we waited in the line that sprawled down the block, but it was definitely worth it!  My five friends and I ordered two large pies - one with roasted red peppers and mushrooms, the other with capers, sun dried tomatoes and extra basil.  Both pizzas were absolutely scrumptious.  They use high quality ingredients and have amazing thin crust.  Yum!", "author": "Nicole L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-05", "description": "Good pizza.  Tasted just as good 3 days and 2890 miles later.  There's a wait at all times of the day, rain or shine, but it seems to go pretty quickly.  They have water out front which is cool.", "author": "Casey F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-23", "description": "We were forwarned about the extreme popularity of this place so we went on a weekday at an off hour (2pm) and we STILL had to wait for a table. So, we opted to take out our pizza instead (still had to wait -20 min before they'd take our order) and grabbed an ice cream cone from the Brooklyn Ice Cream Factory while we waited.  \nWhen the pizza was ready, we brought it down by the water and enjoyed a fantastic view of the Brooklyn Bridge as we dined on a deliciously smokey thin crust pizza.  Yes, it was good, but if I had waited over an hour for it, I would have been very disappointed.  The pizza toppings were a little sparse and very poorly distributed, such that parts of my pizza only had tomato sauce on it - no cheese or anything.  Maybe Domino's can get away with that, but with Grimaldi's reputation, I would have expected better.", "author": "Cindy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-19", "description": "You'd have to give 5 stars to Grimaldi's! The experience is classic New York, and the Pizza is great too!", "author": "Anders C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-11", "description": "One of my favorite, if not, my favorite pizza place in the city.  Being a San Diegan, I'm really sold on \"it's the water\" slogan, and this place doesn't disappoint.  Get large pie, and a lot toppings, as everything there seems very fresh.  On a side note though, be wary of a 30 minute wait for dine in or takeout at nights, since they take no reservations.", "author": "Minh L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-11", "description": "You have to leave New York City to get great pizza. The wait staff is almost always unfriendly but the pizza is amazing. Expect long lines on the weekends and at lunch time. Take a walk across the BK Bridge and enjoy this spot.", "author": "The O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-15", "description": "4.5 Stars. Totally solid bullet proof pizza, meaning it's a good bet it will always be good. Great crust. Great ingredients. A must try if you've never been or are visiting the area. Can get pretty crowded, so be prepared if you are going during regular meal times.", "author": "Josh E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-10", "description": "Grimaldi's doesn't need one more review confessing undying love for its pies, especially since I fell in love with it many many years ago. But I recently took a touristy-friend back there and stood in the same damn long line in the sub-zero freezing cold for nearly an hour, and upon first whiff + first bite, I was reminded once again that some first loves will always remain with you.", "author": "Jen Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-02-21", "description": "A bit of a trek from the rest of Brooklyn, but a nice trek that gets scenic in spots. Limited waiting room inside means standing in a long line outside, which isn't ideal in the winter. Once inside, though, a delicious aroma assaults your senses and entices your taste buds. The pizza was good, and the fresh mozzarella is definitely a plus. We tried onions, sausage, and red peppers, and it was tasty but honestly not the best I've had. Maybe we went wrong with the peppers, but I wanted to try them since it was something different. The service is brisk and the waiters aren't generous with smiles, but it didn't bother me too much... though it bothered a friend of mine. I chalked it up to the stereotypical New York experience. All in all, I think it's worth a try to check out, but I won't be rushing back until summertime at the earliest.", "author": "Alaina W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-21", "description": "i dream of their pizza when i haven't had some recently.\nno.  really.  last night i woke up and figured out i was craving it because i dreamt of it.\nthat's some good pizza.", "author": "Kimberly K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-28", "description": "Great pizza that's worth the wait... just don't go on a Saturday at peak tourist time.  We walked over the Brooklyn Bridge at sunset, then a tasty pie.  Finish the night with a walk on the boardwalk.", "author": "Jeff Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-17", "description": "Say anything you want about the service.  But the taste of the pizza supercedes the rushed and angry waiters.", "author": "Dan B."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}