{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-11", "description": "Hell yeah, it's worth the hype. Got to Grimaldi's right when it opened on a Tuesday morning and there was no wait. Crust is divine, the fresh mozz is even better. Roasted peppers are homemade and sweet. It's all about the quality, baby. Cannot wait to return.", "author": "Allison B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-07", "description": "After a brisk walk across the Brooklyn Bridge with some of my oldest friends we decided to continue the day with some food. After a few wrong turns we found the the \"line\" and decided what the hell. It was worth it. Once we finally got in had to face another line for the restroom but was able to take in the real show...the men in front of the ovens. These guys can make pizza in their sleep. My girlfriend who is from North Carolina has always called me the pizza/bagel snob and after our meal she apologized and realized that I might just have a point. \n\n60 minutes, 2 pies and 2 carafes of red wine later we walked out. And the next party of 4 on the \"line\" was as happy as we were. It's not something I'd do all the time, but it was a great addition to a wonderful New York day.", "author": "Ann S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-06", "description": "This is my 2nd favorite pizza join in NYC after Lombardis. I felt that the pizza could use a tad bit more sauce but yummy otherwise.  The pizza at Lombardis has just the right amount of sauce so that is the only reason I take Lombardis over this join (which is a fine establishment just to be clear).", "author": "Chris S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-05", "description": "Yum!!! Go on a weekday, the line is much shorter!! Try to head there for lunch AT noon, the line gets crazy in the later hours! \n\nWe ordered the smaller size (I can't remember what they call it, \"regular\" I think, or maybe \"small\"...but either way its the 6 slice option, not 8) and it was the perfect amount for two hungry girls!! \n\nThe pizza was so good and thin. The service wasn't amazing, but it wasn't horrible. \n\nI'd love to get some for carry out....I waited in line once, and thats enough for me. Its good..so good but I'm not excited to be in that line again.", "author": "Jackie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-27", "description": "Pizza is soooooo good.  The plain - big chunks of mozzarella cheese, basil leaves, topped off with a couple circles of sauce and crispy crust - was actually better than the half we ordered with pepperoni and mushroom.  Although the thick cuts of pepperoni that puffed up like meaty little buttercups were hard to beat.\n\nThe line is pretty intimidating but actually moves pretty fast.  We were waiting for an hour, but I honestly thought it would be longer with the length of that line.  If you are with a couple people, have some in your party keep your place in line and check out Jacques Torres a couple blocks away.  \n\nI would give Grimaldi's 5 stars but for the calzone.  We were suckered in by it's golden crust and melting ricotta.  But don't be fooled.  It's not that fantastic.  Stick to the pizza.", "author": "Jenny R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-10", "description": "I've been to Grimaldi's twice now (once this last August and once about 10 years ago) and both times came with long waits in line and high expectations of their thin crust brick oven pizza.  I haven't tried any other pizza places in NY but while the crust is very good and they do have fresh basil and mozzarella to accompany the pizza, it just doesn't seem to warrant an opinion that I need to highly recommend to my friends visiting NY to check out this place.  Maybe they could use some more toppings to fill out the body of the pizza or maybe it's because I've had better in San Francisco.  Otherwise, they're a solid 3.5 star establishment and a great place to go if you're looking for a pizza after walking the Brooklyn Bridge.", "author": "Albie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-22", "description": "Tucked away under the Brooklyn bridge you will find the East coast pizza mecca known as Grimaldi's. Just look for the line that is queuing long before they even open. Don't worry, it is well worth the wait. This place has been in business for over a century and it looks like it. Once you get called inside you are in for a no frills dining experience. For a couple, it was kind of like communal dining. Who cares? We are talking about pizza right? And the pizza was delicious. They have a huge coal fired brick oven in the back and the pies come out pretty quick and piping hot. Don't worry about burning yourself because it cools really fast since it's thin. The crust is perfect and slightly charred. Tasty sauce, stacks of fresh mozzarella cheese and fresh basil. You can do half toppings if you need to. I also saw a huge calzone that was half the size of a pizza and looked great. Put that on the agenda items for a return visit. Bottled beers to wash it all down. You are in Brooklyn, so please do have the Brooklyn lager. Cash only. Settle up and stroll across the Brooklyn Bridge taking in all the sights of lower Manhattan walking off the pizza beatdown you just had.", "author": "Dan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "Went the other night to pick a pie to go and it was really good. Just went with a \"Plain\" it was really good but maybe not the best choice cause it could have used a tad more spice or something. All and all really good pizza. The ambiance of the place adds to the food a lot. The line the guy working the door the owner or whoever was sitting outside telling funny stories or jokes. Just a really cool place with a good pizza. Next time I will be trying some toppings. I even found free parking close by that added to the experience a lot as well. \n\nFinal thought, $15.25 for a pie is cheap in my mind for a NYC pizza just saying.", "author": "Barry S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-30", "description": "We arrived early for lunch and were greeted by some very grouchy waiters, but so what, the pizza was delicious!  We ordered the antipasto and it was fresh and yummy, then we ordered two pizzas, one meaty and the other veggie.  They brought one and we were eating it without question and then they brought 2 other pizzas and we realized that the yummy pizza we are eating was one we didn't order.  It was ok because they didn't charge us for it and we just ate the other two pizzas.  After awhile they started to all taste the same.  Don't get me wrong they tasted GREAT!  We came here because we saw it on Food Wars and wanted to check it out!", "author": "Marie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-18", "description": "I've been here about four times and their pizzas are consistently excellent.  I've waited over an hour during peak times and there have been times that I've been seated right away.  I went this past Friday for the first time in a few years and boy have I forgot about how good this pizza is!!!  In fact, the line was so long that if it wasn't for my boyfriend who was born and raised in Queens I probably would have just left.  He's been trying to come here for the past few years and each time something gets in his way so he was determined.  \n\nAnyway, not much to add to the reviews on here.  I like the onions, mushrooms and sausage on the original pie.  We also ordered a big pie to go with sardines which was great for breakfast.  The bf ordered spumoni for dessert which is actually cake not ice cream.  My one only complaint is that the pizza crust was a bit burnt to the point that you couldn't eat the crust.  I mean it's bound to happen where there are lots of pies in the oven but bit disappointing since we waited +1 hr.  Good thin crust though.", "author": "Cynthia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-22", "description": "I have never been here to eat and I have lived in Brooklyn my whole life. I have always tried to get in to eat here but was seriously turned off by the lines. But I was lucky enough to go to Brooklyn Bridge Park for a free movie night they have during the summer, And I decided to see if the place was at reasonable wait time. I was ECSTATIC to see that their was no line... I placed an order and was told to come back in a half an hour. I ordered the white pizza since my daughter isnt a sauce lover. The pizza was amazing cooked to perfection and not to heavy.  You can taste the smokiness and cripsness without it tasting like it was burnt..It was perfect for a hot summer day. I would have given it 5 stars but I am only giving it four stars because I havent actually ate at the restaraunt and It was a fluke that I didnt have to wait on that horrendous line lol", "author": "Margarita R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-28", "description": "Damn, that was some good pizza.  \n\nMy friends and I decided to get there before the dinner rush began so we wouldn't have to wait 10 years for a table.  Yet we still ended up waiting for almost 2 hours to get our pizza.  And I must say it was worth every minute.\n\nAfter a disappointing evening at the Food Network renown Lombardi's,  I was a bit skeptical with Grimaldi's.  . \n\nThe old brick oven and the cooks were in plain view from our table, but our eyes followed the pizzas bused to the neighboring tables.  They looked so good, and the smell, oh the smell! We ordered two large pies; pepperoni with garlic, and mushrooms with Italian sausage.  The sauce tasted like fresh tomatoes unlike most pizzas where they add marinara sauce, fresh mozzarella melted in small pools of delight, the crust was thin and spotted with small burnt specks forming a chewy and utterly tasteful masterpiece.   Everything just came together in harmonic unison, nothing was overpowering.  These guys know how to make pizza. \n\nOne of the best pies I have ever had, which makes me cry for those who reside in the West Coast with me.  We can never get pizza like this in Cali. Damn that was some good pizza.", "author": "Charles J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-15", "description": "Great Pizza, great house salad. Love this place. However the red wine taste as if it is warner than room temperature. I have been here 10 times, I have ordered a bottle of red wine nearly every time. Either order white wine, or a mixed drink. \n\nred wine should be stored at or near 58 degrees. we left half a bottle, again last week. I will still come, but maybe bring my own wine.", "author": "Barry v."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-02", "description": "Expect to be waiting in line for a quite a while, unless you get there super super early at doors open.  It's known for being one of the places YOU HAVE TO GO when you're in New York.  The ambiance/atmosphere was awesome.  Don't expect to have your own booth in the corner or anything, your literally rubbing elbows with some stranger, as the place is relatively small, always at max capacity! Prices are reasonable, and the food is delicious.  Definitely go, if not for the Pizza just for the experience! But bring cash, they don't take ATM/Cards...", "author": "Jason M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-21", "description": "This place is really crowded and you have to wait in line. For us was about 20 min to get a table (it was a summer Thrusday at 3 PM) and a 10 min wait to get the pizza. The wait is really worth it, this pizza is amazing. I really loved the fresh mozzarella, I wish they could put a little bit more. \n\nAfter having the pizza we ended up walking through the Brooklyn bridge, waht a nice experience!\n\nOverall I think Grimaldi's is better than Lombardi's.", "author": "Ramses M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-16", "description": "Pretty much as good as it gets when it comes to pizza. Better than Lombardi's in my opinion. The wait is always way out the door.", "author": "Denton X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-27", "description": "Waited 30 minutes in 90 degree heat with 90% humidity to try this pizza and it was well worth it.  I was praying that it they had AC and the God of Pizza did not let me down.  Great place to start for a walk across the Brooklyn Bridge back to Manhattan (to walk off those calories...).", "author": "Sean F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-02", "description": "Yes! Yes! Yes! Yes! Yes!\n\nThis is some of the best NY pizza you will find. (The fancy kind, slightly different than the cheap kind at Mi Famiglia and its ilk.)  \n\nThe wait is always long. But some of the best conversation I've ever had have happened waiting in line for a fantastic meal. Also, come prepared with scarves and mittens in the winter, because the wait is also outside.\n\nOh, New York, how I miss you!", "author": "Shawn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-15", "description": "On my last trip to New York, I thought I had found the best pizza in NY at Lombardi's, not realizing that to find the absolute best, you had to make a pilgrimage to Brooklyn. First off, we took the subway and had to trek quite a bit to get to Grimaldi's, only to find that the line was about 40 people deep. Seeing that the restaurant is not big by any means, this calculated to about a few hours wait at least, so whimpering in disappointed defeat, we strolled over to a bar next door where I got a bright idea on how to bypass the line. While I won't go into detail, I will say that I only had to wait 25 minutes for my custom pizza which I ate under the Brooklyn Bridge, watching the NY skyline.. Can you imagine anything more romantic? \n\nThe pizza was phenomenal! I had just sampled Di Fara's pizza earlier in the week, and the debate goes as to who has the best... I have to go with Grimaldi's because I'm partial to a wood burning oven as opposed to the gas oven they use at Di Fara's. \n\nThe pie was really thin and smoky while the toppings (mushrooms, olives, and pepperoni) were deliciously fresh and flavorful. And it really is all about the sauce! How they can muddle tomatoes to such perfection is beyond me, but I was in heaven until the pie was gone and I noticed my belly was stuffed! Aahhh.. the true homage to a wonderful pie is a round belly :)", "author": "Janet H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "Grimaldi's has a great pizza but it feels like a tourist trap because of the sheer volume of people served in this small restaurant. Even though they serve a mean thin crust pizza pie they do not serve the best thin crust in the world. The Mozzarella gets stale too quickly. The honor for best thin crust pizza goes to Villa Paradiso in Oslo, Norway", "author": "Svein Erik J."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}