{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "Sure I'm easy to please when it comes to pizza, but this pizza exceeded my expectations. We went at 2pm and there was no line. We had the original. I had zero negatives about the entire experience. I highly recommend this place to anyone looking for Brooklyn pizza in a convenient spot.", "author": "Jay J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-26", "description": "To start off, I really hate giving bad reviews but this place was astonishingly bad and has an undeserved reputation that I am also guilty of propagating since I visited 7 years ago.\n\nMaybe because I visited the original location 7 years ago, that I had such high expectations from that memory of the best pizza I've ever had. Or maybe because their name recognition is so high. Or maybe because Grimaldi's is generally regarded as having some of the best pizza in NYC, that they would want to maintain that reputation. Whatever it is, my visit last week was incredibly disappointing. \n\nThe pizza was burnt, the toppings were scant, the cheese was dry, the pizza was legitimately not delicious, and the people taking names at the door were incredibly rude. I was in line for nearly an hour, waiting to order a few pies to go. Even though I was at the front of the line, I was continually ignored so that they could seat people who were in line behind me, this went on for a perplexing 10 minutes. I had to keep repeating that I was ordering to go whenever the guy taking names came to ask me how many people were in my party, he asked me at least 5 times while I was in the same position in line. I have no idea why I couldn't just give my order, I had it all written down ready to go. But he made me stand there for 10 minutes so he could seat the tourists behind me in line. \n\nBut besides all that, the most embarassing thing would be that I have been recommending Grimaldi's for the last 7 years since my last visit because it truly was the best pizza I've ever had at the time. But now that I know they are going for quantity over quality, I am ashamed to have misdirected visitors to NYC that have asked me for recommendations for good pizza. \n\nGood thing I tried the pizza at the new location (on the corner of Fulton \u0026 Front st.) last week, or else I would have continued to recommend it based on old information. Seriously, don't go here if you are looking for good pizza. If you want to say you've been to Grimaldi's, then sure. But you've missed the golden era of when it used to be good.  (Or try the Manhattan location.) I used to argue with people who would say Di Fara, Lombardi's, or Joe's had the best pizza in NYC, and I would defend Grimaldi's to the death, but now that I know what the new Grimaldi's pizza tastes like, I would probably get a 99cent 2 Brothers slice before I would go back to Grimaldi's. I am really sad that my experience was so bad, I really wanted it to be like how I remembered. *sigh*\n\nUPDATE: I have been PM'd by a few people on here letting me know that the original Grimaldi's was sold off to one of their customers a few years ago so the reputation no longer means anything.  Turns out if you want the Grimaldi's quality pizza, you need to go next door to Juliana's. Thanks everyone for the tip!  :)", "author": "Aida L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-20", "description": "VERY LONG LINES = long WAIT Time!!! but actually it went by quickly...it was about 30 mins waiting during the summer time.\n\nThe pizza lives up to expectations. SOOOO darn good. No other is comparable. The pizza pie was actually pretty cheap, around $12-15, i was expecting to pay more since its a tourist trap. It serves about 8 people (8 large slices), the only con I have is the oven is right by the tables, so it was very hot inside and the smoke and smell of the oven was over powering. They def. need to open the windows or vents. Otherwise, this is a must try for everyone!!", "author": "Jay H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-01", "description": "Delicious pizza. \nWe didn't have a crazy wait- maybe 15-20 minutes.\n Service inside was a little slow and lacking but overall good pizza and good place.", "author": "Linda M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-02", "description": "So I tried out Grimaldi's the other day with a couple of my friends. Having read some of the reviews I had some expectations both good and bad. I will share my experience and confirm some of the things noted by other diners.\n\nWhen we got there, a line was outside but as luck would have it, my little bit of Italian scored some points with the matron and we were seated right away. We erred in not going all the way to the top and settled on the second floor.\n\nThe setting was cozy. Perhaps too much so as the tables were too close to each other. If you had people eating behind you, one had to be careful you were not giving them a face full of ass when getting up and around. They really need to fix that as there is nothing more unnerving than having someone's butt cheeks all up in your face while dining. I mean who knows where those things have gone \n\nNow for the food and service. The pie was big enough for 3 and was very tasty. The crust was thin and the ingredients seemed fresh! The service though was a bit spotty. Our waiter was not very friendly and appeared either disinterested or not impressed with our order. Dude you are in the service industry, smiling is a big plus. Customers want the full experience of being happy with their food while being served by someone in a happy mood.\n\nAnyway, we finished our food and got out of there quickly rather than have the waiter hover over our table cleaning and giving us looks like the clock had ran out. 3 stars for the food and 1 star for service for an overall rating of 2 stars. I am throwing in another star because of the matron who got us seated timely otherwise this would have been a 2 star review. Fix the service folks, that's what it's all about!", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-03", "description": "Walked across the Brooklyn Bridge from Manhattan to Brooklyn to try Grimaldi's. For those who have not done this walk yet, be smarter than I was and walk BACK to Manhattan so you can see the awesome Manhattan skyline. \n\n// LOCATION // Next to the Brooklyn Harbor facing Manhattan and just under the Brooklyn Bridge. There is a delicious ice cream place around the corner as well, Brooklyn Ice Cream Factory\n\n// AMBIANCE // Be prepared to be sharing tables with other people and unintentionally listening to their conversations \n\n// WAIT // Showed up 10 minutes before they opened their doors and was met with an enormous line. Waited 20 minutes after they opened their doors to be seated. \n\n// FOOD //\n\n     + Pepperoni and Sausage Pizza: Button sized pepperoni adorned our pizza. The menu did not have many veggie topping options (think Garlic Spinach from Lombardi's) \n\nTip: Get there 20 minutes before they open to ensure you are seated with the first seating of people right when they open. \n\nI'm glad I can say I have tried Grimaldi's. The pizza was good, but not good enough to make up for the ridiculous line and the elbow to elbow seating.", "author": "Pauline P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-18", "description": "such a hidden gem !\nGrimaldi's is 5 star overall location service staff and quality is to die for. 1st time coming her I brought my girlfriend and as soon as we came by we found parking in the area easily. Although once we got to the shop and we saw the immense crazy long line we were tempted to leave. The man at door had an amazing charisma and ensured we would love it to not leave. Of course we were skeptical but truly happy we stood. The line moves fast, as you make conversation and enjoy the food. Our favorite pizza IS basil olive and tomato. So delicious and their canolis are great too. Super happy we didn't walk away. We enjoyed our meal and had an amazing view to enjoy after it.", "author": "Hansen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-19", "description": "Grimaldi's is packed out in Brooklyn. That's where this pizza chain started so I wanted to have my first experience there. All I can say is it was nothing extremely great but it was great! I like how I can choose my own sauce and toppings but I love the white sauce better than the red! It's also great because it's not oily on your hands or on the plate unlike the other usual pizzas that you can get from other restaurants. I love their olives as a topping, it's also not he usual ones from cans. I also ordered a bottle of cream soda (my first time) and it tasted soooooo good. It's just nice for me because I can't find that bottle anywhere (Walmart and etc). All in all it was a great pizza experience!", "author": "Janica G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "This is some freaking good pizza. The hype is on point.\n\nWe got half olives and half ham--both halves were amazing. I think what made the pizza really good were\n\n1) The crust - melts in your mouth, and really wholesome without being overwhelming.\n2) The mozzarella cheese - really really fresh! Perfectly melted on the pizza.\n\nThe olives were really tasty--very flavorful! If I ate pizza more often, I would hit this place up every week.", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "Love this place, and the location is great. MIMI the server is the man, always on point.", "author": "Vinny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-25", "description": "I've finally made it to the infamous Grimaldi's! And strangely enough, there was NO line! It was a Tuesday afternoon and beautiful so this struck me as kind of strange. Every other time I've ever gone by they've had a huge line of people waiting.\n\n2 Important Things to Know:\n1) This place is cash only. 2) They sell pies, not slices.\n\nWe got a margarita pie, a large. Reasonably priced. For those of you who are non-New Yorkers and reading this...I would suggest you NOT eat with a knife and fork (it makes the locals laugh at you on the inside). Just fold it in half and eat it like the rest of us.\n\nSo, back to the pizza. It was good pizza, but definitely not the best in New York. There are far better places. There was a lot of crust. The sauce was good. The cheese could've been fresher...when we got the pizza it was kind of coagulated...and not longer hot.\n\nSince it's Grimaldi's though, you should give it a shot and pass judgement. It's worth that much...and you can get it to go and eat on the esplanade, which is a great view.", "author": "Baramee C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-22", "description": "Ok pizza and tourist spot. Honestly next door is better. 30 wait for pizza and 30 min wit for the line. Not much to say really...", "author": "Cindy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "We were advised that the wait was 40 minutes and then this wonderful gentlemen said he would get us a seat right way. Come to find out he was the owner. We were seated with 9 people . The waiter was very nice and quick.  This place is extremely busy but that did not impact the service or the quality of the food.  Although we were only there in Dumbo to see an art demonstration I am very happy that we decided to go and have some pizza.  This was definitely a good choice.", "author": "Jaz N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-25", "description": "Came here on a day trip and the tour guide said it was famous so we decided to try. Waited outside for a while before realizing we could just go in and order. You can't get pizza by the slice which I wish you could've. We just got pepperoni and cheese and it was just ok to me. I don't know if I would come back but I'm glad I tried it.", "author": "Ciara J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "okay so first time I've ever been this past January. Damn i wish they had one of these in Toronto. Super old- school and laid back. I think the red and white picnic cloths are super cute touch. \n\nWhat i loved: \n- the pizza was made in the front, where everyone could see \n- they had a lot of natural lighting coming in (i was there during the day) \n- the staff were super nice and had a couple recommendations \n\nwhat i wish was different (not gonna say what i didn't love because i loved everything)\n- they didn't sell the pizza by the slice :( \n\nall in all: the pizza was ONE OF THE BEST i've had in my life. (i can't say ever cause there was some bomb pizza in Italy that was like actually the best) \n\nbut wait... don't go there just for the pizza. get the CANNOLI because that was actually the best cannoli i've had in my life. \n\nBELLISIMO!!!", "author": "Milana N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-13", "description": "I love the pizza here! They tend to focus on serving you a pizza that focus more on the toppings than on the dough. What I mean is that the dough is thin and crispy so you're able to reaaally enjoy the flavor of your toppings. The atmosphere is also very good and knowing of all of this places history also gives it a special charm.", "author": "Juliana K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "Grimaldi's is delish. When a place is hyped I possess high expectations regarding it. It's up to standards. My big family always orders the pan pizzas and oh my god! YUM! I need to go back just drooling from reminiscing! Go! It's worth it", "author": "Katrina D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-16", "description": "If I don't say this place is perfect, will I wake up with a horse's head in my bed tomorrow morning?\n\nI don't have much to say about this place.  Food was good, but not great.  Service was good, but not great.  When we went there was no line, which was nice.\n\nI just feel like I was missing something, like there's a specific reason the pizza here is so beloved.  I have no ill will toward the food or the staff...but nothing about it blew me away.\n\nI guess I can recommend it, but if I lived near Grimaldi's I can't say I would go back in a hurry.", "author": "Tim O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-28", "description": "Yum! The line was so long we ordered to go and ate outside near the water. So lovely!\n\nSimply go in and order and save yourself some time.\n\nThin crust is never as good as deep dish :) but it was very light and crispy. It didn't disappoint.\n\nVery fresh marinara sauce, basil and mozzarella as it's basics. I would definitely love more sauce but that's just me. We added Italian sausage and it was yummy. \n\nNot a bad price and a generous quantity. It's a little trek out, but worth at least a try.\n\nGrimmaldi's, you are cheeraldi's.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-23", "description": "So sorry, yelp friends, I realize I've been neglecting my yelp duties a lot lately.  Going  through a tough transition from SF to NY, which aint all that  bad, from one great foodie place to another...\n\nAt any rate, what better way to kick off NY than with one of the most popular pizza spots in the land of pizza spots, Grimaldi's - the pizza institution under the Brooklyn Bridge.  \n\nI must say, however, my expectations got the better of me this time around.  My pizza fell a little short, though I have a feeling that my expectations were way too high, given the hype.  The good news is that the pizza came out blazin hot, with steam flying off, but the cheese was a bit bland and the crust on the tough side.  \n\nI realize I'm the minority on this one and perhaps I have to give it another shot...and I plan to (they're opening several spots).  So call this a temporary three stars, until my next visit proves me wrong.  \n\nAfter all, if first impression is everything, I probably wont be married and would have no friends.  =)  Fortunately for me, NY has no shortage of awesome places that the outlook is bright.", "author": "Angel S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}