{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-21", "description": "I was never a big pizza guy but the first time I saw how crazy the line was getting inside I thought I would come back 1 day and try it.  Fast forward 4 months later and here I am in 90 degree heat waiting an hour to get inside, the pizza was surprisingly good but with me after a few slices it just becomes too much too fast.  I ordered the small 6 slice pie with italian sausage, it was pretty good but I don't see the big fuss about it, did I mention I'm not a big pizza guy?", "author": "Roman W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-07", "description": "You're standing on the line towards the front and the door opens when you get hit with the incredible smell of fresh basil and tomato sauce \u0026 you think you'll die if you have to wait another minute more...when you actually step inside its like you've died and gone to heaven! Pizza that engages all the senses. Pizza so good that it's perfect with just basil \u0026 crushed tomato! Maybe its touristy, but who cares!", "author": "Lee G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-21", "description": "I lived in BK heights all my life, and only been to this place twice which says a lot cuz I am a gluttonous fuck. Not worth the hype or the line, save it for the tourists.  It taste like an ashy thin crust pizza...it has a \"different\" factor...that's about it.", "author": "Ralph L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-06", "description": "I just don't get it.  Bitterly, bitterly disappointed.  What is all the hype about this place?  We walked over the Brooklyn Bridge and waited online for an hour for what was frighteningly mediocre pizza.  I mean really, it is just not that good, it is bad like WTF am I missing here?   Bland mozzarella, not enough sauce, tasteless sausage.  The only good thing was they put the two pieces of onion the other half of the pie after it was done as opposed to while it was being cooked.  Yeah, yeah, yeah, I know all about the coal and the brick oven but this place is a tourist trap and nothing but hype.  If you want to wait online hours for crappy pizza go ahead or send me a message and I'll recommend a couple of places where you can get a decent pie and not waste two hours of your existence on earth.", "author": "Rob S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-19", "description": "This is the BEST NY-style pizza on the planet!  Super curteous service and did I mention that their pies are the BEST NY-style pizza on the planet?!!!", "author": "Al K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-04", "description": "The pizza itself was very good. But I've simply had better pizza elsewhere.\n\nIt's a very good pizza but with the line and the hype I felt let down and only Cash, what decade is this?\n\nThe secret for me is to go in and get a take out order and just take it down and eat it by the Brooklyn Bridge. The ice cream place was closed when we went, but that would have been a perfect desert.\n\nWhy wait in line when you have a beautiful view outside and a much shorter wait?", "author": "Kalyan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-25", "description": "Theres a reason why the line at grimaldis never ends...possibly the best tasting pizza in brooklyn..maybe even NY...the pizza is made with the fresh ingredients right when you order it and you get it straight from the oven to your table..the crust is perfectly thin and crispy..the cheese is flavorful and melty and any topping you choose will sure be added with excess to your pie... So yeah the tabels are close to each other and you will have to literally sit next to people you don't know ..but it's ok because the pizza is worth you cramming in this tiny place after waiting in line for possibly an hour in the street...because when you finally get chosen to come in and have ur first bite..you will finally be given the opportunity to try what REAL NY PIZZA taste like!!", "author": "Ramez B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-03", "description": "OK. this pizzeria is just over rated.  There are a lot of better pizza in the city.  This is just nothing special.  The service was bad.  Don't waste your time, there are a lot of delicious pizza around w4.", "author": "Danny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-03", "description": "Despite the long ass line, this place was totally worth the wait! To make sure you get a taste of this amazing pizza, I suggest you come with no more than 2 people in your party because they take in customers based on the available seats....trust me this pizza is the best in the nation! I HIGHLY recommend this pizza joint and only this pizza joint.  I would write more about this place but it just hurts to talk about it and not have any...happy eats!!!", "author": "Nio S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-05", "description": "People are so rude who work here.  They said Fu** about 10 times to my friends and me.  Pizza was horrible and tasteless like the people working there.", "author": "Linda L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-13", "description": "Pretty Good Pizza, but i think its overrated for sure.  I've had much better in the city.  Its not worth the trip to brooklyn if you're not already there.  There was also a good 30 minute wait wasn't too bad compared to other people's reviews of over 1 hour.  \n\nOne thing i hate is coming out smelling like the food you just ate...that will happen because the dinning area is quite small.", "author": "G.K. C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-12", "description": "Grimaldi's, Totonno's, Spumoni L\u0026B, and Di Fara's - these are as good as pizza gets!", "author": "Rlandis P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-06", "description": "unfortunately no slices, but off hours, line is not too long.  the pizza dough was perfect, coal fired, thin and chewy (some parts a little too burnt but crispy).  got pepperoni, and the toppings and cheese had great flavor, not too oily.  just the right amount of red sauce, everything fresh--especially mozzarella.", "author": "Rob C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-28", "description": "My favorite pizza. Thin crust, juicy sauce, melts in your mouth! Nothing else like it...enough said. I like to add ricotta and  sun-dried tomatoes as toppings. Highly recommended!", "author": "Julian B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-16", "description": "My sister's boyfriend was raving about this place...\nThe pizza was OK, it WAS different, but nothing to write home about. Not worth waiting in line [starving] for at least an hour...on top of that people who arrived after us, with larger # of people were allowed in before us...that was annoying.\nOnce we were inside, we were seated, our order was taken and when the pizza came it got cold really fast; the waiters have little to no personality.\nI don't feel like it was expensive and I might stop by again when in NY...but I will be wearing comfortable shoes and snacks for the wait time ;)  At least now I know what to expect.\nI heart Toto's Pizzeria!", "author": "Ingrid G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-23", "description": "So I finally got to visit the DUMBO location.  I have eaten at Grimaldi's on Franklin Avenue many times, but have always wanted to eat at the Brooklyn location.  Lots of tourists and locals grabbing lunch.  It's definitely nice to get pizza here and walk over the Brooklyn Bridge on a nice day (which we did).  Great pizza.  But, if I'm ever craving Grimaldi's I might just continue going to the one in Garden City - there has never been a wait and the pizza is exactly the same.", "author": "E. E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-23", "description": "I sought out many pizzerias during my time in New York, and this one was the greatest.  Their flavor, crust, fresh cheese and herbs create an untouchable combinations", "author": "Joaquin E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-22", "description": "Was visiting in New York on business and got the name of this place as a loose recommendation from someone who heard it was good.  \n\nPizza was OK.  Crust was very good, but the slice was more bland than I was used to.  It is a little better than Domino's, Papa John's because it tastes more fresh, but you can get so much better food just about anywhere else.\n\nI really have to ding them for their really poor service.  I'm in the service industry as well so I hate writing bad reviews because of karma, but these guys demonstrate to me that they hate their jobs.  They roll their arrogant eyes at simple questions (i.e - can I use your restroom?) and get annoyed if you try to ask them for anything.  What a bunch of jerks!  I can understand if they are offering something that is so good that they can afford that, but sorry, keep your poor attitude and mediocre food.  This place just gives New York restaurants a bad name.  Places like this gets such polarizing reviews...I really don't understand it.  After reading other reviews, I really don't understand how some people can say the service is great and how they go out of their way to be helpful while others like me were disgusted by their service and attitude.  Either they have 2 entirely different groups of service, or other reviews are BS reviews.  \n\nFinal decision:  Grimaldi's, you suck! (or at least your staff do)", "author": "The Joker I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-06", "description": "The pizza was okay.  Not anywhere near what the reputation would suggest.  Contrary to what I've read here, the service was actually very nice.  The real disappointment was when it came time to pay the bill.  Cash only, so I hit the ATM.  $4.50 fee!? I've never in my Manhattan/Brooklyn life seen a fee this high. No thank you. I asked the waiter if there was anywhere else to get cash in the area.  He said he had no idea.  He said they had nothing to do with the ATM, which is perhaps only very technically true at best.  I was tempted to tell him his tip just went into the ATM - he could retrieve it there.  Instead I am leaving a review here.  Restaurants should be held accountable for this kind of thing. Instead of leaving Grimaldi's grateful for a decent pizza, I left mad about a stupid ATM fee.  Will not go back out of principle.", "author": "Jeff C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-23", "description": "Ever since the first day I had a slice from this place, I've been in love. Their ingredients are different from your average brooklyn pizza place. You might have to wait for seats, but generally the wait for the pizza hasn't been too long in my several visits, and it's always been tasty and filling. They also offer desserts, although I've never tried them. A large pie with cream soda always hits the spot", "author": "Kseniya U."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}