{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-14", "description": "Grimaldi's is purportedly some of the best pizza in the city. And when I first ate here, a few years ago when it was in its original location, you could make an argument for that.\n\nTo be clear, the actual, real pizzaria owned by the Grimaldi family is Julianna's. It is a few buildings up from Grimaldi's new location, in the location of the old Grimaldi's pizzaria. The only thing that this restaurant called Grimaldi's still has is the name--they weren't even able to take the pizza oven, which, as everyone hopefully knows, is a key player in making a good pie. Don't be that tourist who doesn't know better. Go to Julianna's. It is a shorter wait for a much, much better pie, in the actual historic location.\n\nIf you time going here right, you won't have to wait on a line. The new Grimaldi's is two stories. The decor is kitchy. It sort of feels like they are trying very, very hard to inject a bit of history into the new location. They had some guy with an accordion singing, which could be nice, but it's not the biggest space and was pretty loud.The staff is touch-and-go. I've had good experiences with them, and I've had bad. I will say that the new restaurant does not feel as cramped as the old one, which is a welcome change. The service was quick, and the pizza we got was...fine. There wasn't anything particularly bad about it, but there wasn't anything particularly good. We'd just come in from Smorgasburg on the waterfront and I had a Pizza Moto pizza right before this (I feel pretty strongly about being able to eat pizza multiple times a day)--the Pizza Moto pie was better. Grimaldi's sauce wasn't incredible. The dough was fine. The ingredients were fresh, but nothing we had was anything special.\n\nBottom line, it's really not worth the wait. If you're visiting NYC, it's definitely not representative of Brooklyn. There are better restaurants in the area. As for those who claim that it is the best pizza in the city, I'd like to direct you to Totonno's.", "author": "Cay V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-04-14", "description": "Overrated. I don't like splotches of cheese. I prefer my cheese spread all over the pizza. However, the pizza still tastes good, I just don't think it's one of the best. I prefer Totonnos, Arturos or Giorgios. \r\n\r\nBut, it's a fun place to go to since it's so famous and popular. It's fun to walk across the Brooklyn Bridge and then walk to the staple NYC pizza place. \r\n\r\nThis place has no slices, you have to order a full pie. Very casual, fun, lively and crowded.", "author": "Jen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-06-20", "description": "Grimaldi's is the best!  There's a reason people stand in the ridiculous lines for this place.  The pizza is awesome.  Fresh mozzerella, crushed tomatoes, great crust.  I always end up eating one more slice than I should!\n\nThe decor isn't much to look at, and it can be kinda cramped, but who cares?!  Try to go at off-peak hours to avoid really long lines because they dont take reservations.  Oh and bring cash because they dont take credit!", "author": "Jay I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-04-23", "description": "THIS PLACE IS AWESOME!  I've been twice and it's one of my favorite pizza places in town.  One very fine characteristic that sets Grimaldi's apart from other pizza joints is the freshness of their ingredients.  If you get olive's on your pizza (and you're an olive lover) you will be impressed.  The pizza is thin but extremely flavorful. \n\n I can't wait until I can convince my friends to wait in the long line and go back.  One summer night we waited almost two hours for a table for 4.  The other time it was pouring out and there was nobody there...odd.", "author": "Gabe F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-05", "description": "They miss a star because of all the hassle, the lines, the tourists, the lack of delivery, the sometimes mean hosts. \n\nThey get all the rest of 'em cause that's some good pizza mister! The line actually moves pretty fast, and if you're feeling bad about how much fat you've just ingested you can always take a Brooklyn bridge walk, if you're not feeling bad there's yummy ice cream (Brooklyn Ice Cream Factory)down at the end of the street with a million dollar view for about 3 buck!", "author": "Rhubarb M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-07", "description": "Looking for the real brick oven pizza place?  This is it!  The pie has that aroma of a brick oven burnt smell.  The dough is extremely fantastic - crispy all around.  The pizza sauce makes the pie soggy which makes the crispiness of the crust makes it really good and edible!  I thought this is what pizzas should be!  Their unique style of laying the cheese - some here... some there... not all over the place... it's a different taste.\n\nWhile there are two Grimaldi's - one in Brooklyn, NY, the other in Hoboken, NJ - they're a bit tad different from my perspective.  The Brooklyn location gots a bit more hole-in-the-wall feeling.  The Hoboken location... a bit more classy and upscale.\n\nLocation-wise, Brooklyn's joint is a bit tricky to find hence it's under the Brooklyn Bridge.  I don't remember seeing a parking lot somewhere - my friend and I took the train and walked.  The Hoboken location, parking metered - had to park about a block away, and was easy to find.\n\nMy choice...I'd go to Brooklyn anytime!", "author": "Terry Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-06-07", "description": "The crust was brick-oven scented and delicious, but the ridiculously long line really made this pizza not worth the effort.  If you're a tourist, like I was 7 years ago, it was a must.  But even then, they managed to burn a HOLE in the crust, not good.  The Brooklyn hospitality was basically a scolding for purchasing one of their pizzas.  Although, I must admit that I haven't tasted better pizza in the states yet, this was the first pizza I ate since coming back from living in Italy for a year...\n\nIn sum: Only go if you are a Tourist.  \n\nAlso note worthy:  Never stand in the \"To Go\" line.  They get 2nd priority and end up waiting longer than the dine-in line.  I saw folks that arrived when I did and stand in the dine-in line while I attempted the \"to go\" line.  Guess who got their pizza first: the Dine-in folks...very disappointing.", "author": "Gersey C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-14", "description": "The pizza had its 5 star bites--I'll admit that. But as a whole? A relatively weak pie, especially against the lofty position of New York's Best Pizza that it tries to fill. \n\nMy biggest complaint was that it was soggy. From the instant we got it. \n\nSecond complaint is that it didn't work together as a whole. Parts were raw, and parts were burnt (not smoky tasting--burnt). The cheese wasn't all that good. The sauce, while the strongest aspect and getting points for freshness, couldn't even hold the pie together, and can only be tasted if there is no cheese in the bite. \n\nDon't get me wrong--a fun night can be made out of Grimaldi's, including, of course, a stroll over the Brooklyn Bridge and Jacques Torres hot chocolate after (the chili one). But the best pizza in NYC--or even a contender--Grimaldi's is not. \n\nLeading me to the biggest problem with Grimaldi's:  you can get so much better. Whether you prefer Luzzo's or Di Fara, Grimaldi's just isn't in the big boys' league.", "author": "Erika P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-03", "description": "I tried Grimaldi's for the first time today, and thought the pizza was good ... but still, probably not worth the lines.  I've been meaning to try this place for such a long time, because each time I pass by, the lines are so long.  For lunch, I tried a sausage and ham pizza, which was good.  Of course it was good - it was freshly baked from a coal oven!  The quaint lil restaurant packed in quite a few people, with lil breathing room (not a bad thing on a cold winter's day).\n\nOverall, I still prefer Patsy's and possibly some other Manhattan places over Grimaldi's.", "author": "Rose W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-11", "description": "MM.... I've been here twice, and the first time was pretty great. The second time we went, it was snowing and we came 15 minutes before it opened, and there was already a line!  People waiting in the snow for pizza... it must be good!\n\nI really like the vibe of the place, even though it is incredibly cramped and you are elbow to elbow with people next to you. You literally have to pull out your entire table in order to get out. (Fire hazard anyone?)  But the pizzas come out fast, there is a clean restroom (with toliet seat covers!!) and they give you the entire bottle of soda when you order it.  It's relatively inexpensive if you don't get too many toppings.  I honestly think plain cheese and maybe 1-2 toppings is enough.  I personally love garlic, mushroom and pepperoni.  The pepperoni and mozzarella is really good! \n\nThey only take cash but they have an ATM. I like the owner because he's a friendly, jolly man who sits with his newspaper and yells for customers to come in and take a seat from his own private table. \n\nOh and the best ice cream is just around the corner! (Ice cream factory)", "author": "Carol S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-11", "description": "My first Yelp review!\n\nGrimaldi's, I love you.  You're at the top of my Things I Miss Most About NYC list.  Slightly charred crust...perfect cheese to sauce ratio...you ruined all other pizzas for me forever.\n\nNow I'm hungry.", "author": "Karen C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-26", "description": "Fantastic cheese pizza!\n\nSkip the cannoli - over sweetened.", "author": "Ali G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-16", "description": "I'm not a huge pizza fan, but as I had friends in from London I felt it was only right to give them the awesome tourist experience of walking over the Brooklyn Bridge and then having Brooklyn pizza.\n\nGrimaldi's was delicious - it is definitely done right, and it made me feel like I was getting an authentic tourist-y experience - one that I'd repeat!", "author": "Arielle W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-29", "description": "NY Food Inspection Score: 5 Stars!\n\nMy first slice of heaven aka new york. I loved every little bit and corner of this place.\n\nIn the 7 years I've been visiting NYC, I had never had a real New York pizza, minus Columbia University's nearby eateries which don't count. \n\nAnd I was dying to get a slice of Grimaldi's (once Pasty's) when some natives told me about the best pizza in the city.\n\nWe ordered small white pizza and a large pizza with sausage and roasted red peppers (perfect amount for 4 people). Every bite was so delicious and their mozarella was FRESH! The way it melted looked like white paint on a thin crust canvas. SO F'IN GOOD!\n\nSo good, I even brought a piece 3,000 miles back home to my boyfriend and he was raving about it though it was 24 hours old. \n\nI will come to nyc specifically for the people and Grimaldi's. The best in the world.", "author": "Kristina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-31", "description": "Great pizza, but the wait is really long. Waited in line for an hour and 45 minutes. \nThe crust was just the right amount of crispy and doughy...even though that sounds like an oxymoron. Also tasted a calzone, I definitely recommend getting the ricotta, yummy!", "author": "Rose K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-16", "description": "I'd give three and a half stars if I could.\n\nThe first time I came to Grimaldi's about a year ago, it was the best pizza I ever had.  It was definitely 5 star pizza.  The crust was thin and crispy, baked perfectly!  The mozzarella was fresh and please do order garlic on your pizza if you're a fan of garlic!  Fresh garlic was the perfect topping, along with pepperoni.  \n\nDO NOT GET MUSHROOMS!  Or anything that will soggy up the pizza!  I love mushrooms, but the mushrooms soggies up the pizza when its baked fresh.\n\nI've been back a bunch of times since, but unfortunately I feel like they don't wring out their mozzarella well enough so you're left with a soggy crust.  It's still good pizza, but not the best I've ever tasted anymore.   :(", "author": "Diana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-13", "description": "As an out-of-towner, I'd say that if one is looking for a good \"New York Style\" pizza, walk across the Brooklyn Bridge, and wait in line here.  The wait is really not so bad, and you are rewarded with deliciousness at the end.  Then you can take the water taxi back to Manhattan.  It's the tourist trifecta.", "author": "Holly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-09", "description": "I want to fly back to nyc just so I can come back here. I think it very well might be the best pizza ever. Get ready for a line.", "author": "Dugga P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-24", "description": "Grimaldi's OH Grimaldi's!! How I yearn for GRIMALDI's! \n\nI had the original with extra cheese and I just couldn't get enough. It is really that good. I have to say better than Lombardi's. The crust on that pizza is perfect and the cheese was so good. \n\nWe went on a Wednesday night and there wasn't a long line at all. We must've waited only 10 minutes. You can't be a shy individual either cause you are probably gonna be sitting right next to someone you don't know at the same table. They have to fit as many customers as they can. \n\nService was quick and fast on the refills on our wine. which is always nice. :) If you visit NY you need to stop by Brooklyn and when you get there stop by Grimaldi's.", "author": "desiree s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-29", "description": "This place deserves all the accolades it's gotten. We tried the mushroom and sausage pizza and it was delicious. In my opinion the best part is the cheese. It is so fresh it is amazing.  We waited 45 minutes and it was definitely worth it.", "author": "Nancy O."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}