{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-26", "description": "Great quality and fast. Went in on a weekday and has no wait. Ordered a small which easily fed two people and still had left overs. Our pizza came out pipping hot within 10 minutes of ordering. Cute checked table clothes. Great toppings and is the type of pizza you can fold to eat. I will say that latter I did try pizza at Artichoke and it was a different style, but something a bit more flavoreful. Overall check it out, but also check out Artichoke for a slice.", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-12", "description": "This place could easily be a 4, if not a 5 star establishment if the review was based on their pizza's alone. But all things considered, they are a perfect 3.\n\nI have tried to go to Grimaldi's before (on weekends) and both times was put off by the long lines to get in. This time I went midweek and they've moved, presumably to a larger premises, so there was no line. As we walked in the \"host\" pointed to the stairs and said \"up there\".\n\n\"Up there\" were a couple of waiters stood chatting who, after they had finished their conversation looked at us as if we had walked in uninvited to their house. When we were seated, or more accurately; when they pointed and told us where to sit, we were surprised by how hot it was in there - it was a 90 degree day and they AC was fighting a losing battle, if fighting at all. \n\nThe menu is simple but exactly what you want; pizza; large or small. The pizza's are reasonably priced and additional toppings are too. We went with a small pepperoni to share and I had a soda too. A few minutes later they came and dumped a plastic bottle of soda and 2 waters on the table and walked off, nice. At that point I also noticed by plate wasn't completely clean but I just decided to deal with it.\n\nThe pizza came and it was fantastic. The crust was light and crispy, the tomato sauce rich and delicious, the pepperoni was crunchy and the cheese light (not greasy) and flavorful. Up there with the best pizza in the city.\n\nNo one came to ask how our meal was, no one came to refill our waters, in fact, the waiters (there were plenty of them) were either slouching on a chair looking bored or busy chatting amongst themselves.\n\nI guess they don't need to care as Grimaldi's is an institution in NYC and tourists flock here day and night. The restaurant really filled up as we were there and reluctantly the waiters had to up their game to turn around tables quickly. They would loudly drop plates and cutlery into a box by the bar ready to go and be washed.\n\nThe atmosphere was surprisingly subdued for such a busy restaurant. There was music on sporadically but otherwise the only really buzz came from the wait staff with their inside jokes. The rest of the restaurant was quiet - probably as we were all slowly dying from the lack of air conditioning. Or devouring the great pizza to be fair.\n\nWe asked for our check and again the guy dumped it in front of my fiancee and walked off. I was pleased with the price, however.\n\nHaving lived in NYC for 5 years I can finally say I have been to Grimaldi's and ticked it off of my list. But there are many other great pizza joints in NYC so I won't be back.", "author": "Tom B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "Would give it 4.5 stars. Great location, good architecture. I liked the iron staircase.\nBig serving, good pizza. We tried sausage and mushroom. Could be five stars if middle bread portion wasn't wet.", "author": "Jeff D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-03", "description": "Great pizza and worth the wait.  However, it's not too bad of a wait if you go during off-peak time and you come with a party of 2.  The pizza came in freshly made and packed with toppings.  It was a burst of mouth-watering flavor on a crispy thin crust.  The only thing lacking was the service.  The servers were friendly but absent-minded.  It took a while to get our waters as well as our bill.  But other than that, it was a great place to get NYC style pizza and steps away from a skyline view of Manhattan.\n\n[TIP]  Cash only.", "author": "Deana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-06", "description": "Was told by a New Yorker to go to grimaldi's for pizza. When I arrived the gent sat me at the bar. It took a while for th server to take my order but it didn't take long to get my order. The pizza was delish! Got just a small pepperoni! Yum. The service could be better. Had to ask for leftover pizza to be bagged and for the check. The dude was grumpy that I asked him but that's his job!!", "author": "Nickole W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "My first time dining in this place. We had to wait almost an hour before getting in, but the wait is totally worth it!! \n\nGreat white cheese pizza! Topped with garlic, basil and cheese (added ham and mushroom as our additional toppings.) Pizza cooked just right. It's not too soggy, (a lil bit dry considering there's no sauce added to it) taste of garlic is not overpowering, and a few basil leaves for additional flavor. Mushroom and ham gives off texture to it's taste and more color to it's appearance. The pizza wasn't too oily as well. Fresh!! \n\nThe place was a lil jam-packed and loud, but it's all good.", "author": "Janine R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-11", "description": "Food: 4.5 stars\nAmbiance/environment: 2.5 stars\n\nSome Brooklyn friends took us here and we came right at the opening time so we were seated right away even with our big party of 6.  I noticed right away that the disposable Utensils and plates had been sitting out for quite a while because they were covered in dust. Could they just not set everything as we sat down instead of leaving everything out to get dusty? Anyways, I also noticed that the table cloth had stains on it and it made me uneasy wondering when was the last time they cleaned everything (it had obviously been a while). Out waiter was polite and took our orders in a timely fashion and the food also came out with no hassle. The pizza tasted amazing! Just the perfect amount of char on the crust and the sauce was just simple purred tomatoes, which adheres to the simple, no-nonsense vibe of the restaurant. I would only return to get takeout pizza, I would never want to sit-down there again but I do want to try the sister pizza Juliana's next time I find myself in Brooklyn.", "author": "Meghna K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-19", "description": "Okay, I was expecting the best pizza in my life but honestly, it wasn't omg-out-of-this-world-amazing. I mean, it's really good but nothing where I would wait for days on end and crave for like no other. The ratio of marinara sauce, cheese, and dough was pretty perfect, so I'll give them that alright alright. We (two people) ordered the small pizza without any add-ons. It was big enough for the both of us to eat our fill. \n\nYou have to wait a while (at least 15 minutes even if you're next in line) to get in. CASH ONLY... so don't be bringing in no fancy shmancy credit cards. They have cool posters (I lol'd at this one godfather poster - \"i'm gonna make a pizza you can't refuse\") and the atmosphere can be a bit too cozy as in you could be sitting RIGHT next to another party of 2.", "author": "Deborah K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-03", "description": "It's all been said before. Over rated tourist trap. You will get the same from a $1 slice joint. Soggy base, unmelted cheese, processed crumbed chicken, paper plates, no credit cards, filthy bathrooms without toilet paper. Why bother when pizza heaven is right next door.", "author": "John H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-30", "description": "Cons - this is not the original Grimaldi's, Juliana' next door is.   Long line to get in to a small dining area.  No alcohol.  Crust was chewy, sauce was bland.  After reading their history, we were expecting better taste for all the hype. Next time,  it's Juliana' for us. \n\nPros - cool historic building, cool location, prices reasonable", "author": "Chasen S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-31", "description": "The pizza was made to order and had fresh ingredients. It didn't take too long for the pizza to come out after ordering. The pizza was good but I don't think I'd come back all the way here to get some. \n\nNo slices sold and cash only.", "author": "Abby S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-19", "description": "The white pizza!!!! omggg. no tomato sauce, extra cheese, fresh garlic, and fresh basil!! I went to the Grimaldis right next to brooklyn bridge. The line looked long, but it moved super quick! There was at least 6-7 parties before us and we got seated within 10 mins.We also got our pizza within 10 mins! The small definitely feeds only 1-2. My boyfriend and I finished the small and didn't even leave a crumb behind. We also ordered a canoli. It was by far one of theeeee best canoli's i've had in a long time. I love when the custard is thick, not to mention the canoli itself was crisphy, crunchy, and fresh!\n\nA small pizza and canoli came out to $20. Not a bad lunch in NYC, not a bad lunch in NYC at all.... =D", "author": "Sany N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-02", "description": "Being my first time at Grimaldis, I felt like a total tourist. I was ogling over the pizza makers and their fresh ingredients as well as the decor. The place has an exquisite location, and their pizza is no different. \n\nWe ordered a large pizza which is eight slices, thinking we'd have leftovers but it was so good we ate the whole thing. The crust isn't very thick, which I think helps. The sauce is noticeably homemade in a good way. Not too sweet, which is just how a pizza should be. \n\nWe had a large (8 slices), half pepperoni and meatball, and half ricotta and onion ($27.00). While I can't comment on the meat side of the pizza, the ricotta and onion side was near perfect. My only complaint is the ricotta was a bit cold, it would have been nice for it to have been as hot as the pizza. Also a heads up, you have to pay the same amount for toppings no matter if it's half or not. \n\nWe showed up on a Sunday, about thirty minutes before it opened and were second in line. After about thirty minutes of them opening there was an immediate wait, so I'd recommend getting there early. The only other complaints I'd have, would come of the service. We saw our waiter once when we ordered and after that we had to keep tracking him down to pay and get drinks. No matter how large your party is, they charge an automatic gratuity which is a bit frustrating. Other than that pizza and environment was great. Like I said, just show up early.", "author": "Kayla G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-26", "description": "So a good rule of thumb in NY would probably be any place you have to wait outside to get into at 3 pm is probably more of a tourist trap than a bonafide place to eat. This place fits that bill. Plus this is a \"no credit/cash only place\". Fun. \n\nThe line is long (40 minutes for late lunch) and you have to wait outside. We had ten people so they split us into two groups which is fine. The server came over to take drink orders, brought them back and then took the pizza orders. Then literally never came back to the table again. The food is brought out by runners and the pizza was good. Not the best I have had and certainly not the best I have had in NY. A good thin crust pizza. \n\nSo the whole time there is a guy walking around yapping at people and telling people that they need to get out and get lost because there is a line and people are waiting for tables. OK. And he comes by our table a couple of times and we say \"hey, we want dessert, where is the server?\" and he says he will send him over. The guy walks by the table 2-3 times saying \"oh. I will be right back!\" and doesn't come back. By the time my husband gets up to flag down the guy to order the desserts, the other table has paid their bill (same server too, WTF?!) and they are ready to go. The guy has an attitude and says \"I will be right over\" and then walks by another 2-3 times!! We are stuck and the guy comes around again to hassle us to see if we are done... So finally we get the desserts and they are really the best part of whole experience. But then we are back to begging people for the bill. We ask the \"host\" and he says he will send the guy over. Finally someone I have never seen shows up and gives a bill with the \"SC\" already conveniently added in (service charge for the uninitiated) and I have to say \"wait, take my money\" before he runs off too. Finally, I have to get up and find someone to give me the change because that guy just left it laying on the counter and no one is even there. What a joke! \n\nI really hope that the service charge was distributed amongst the staff and not just given to the horrible server we had. The place is small and he did not have that many tables so I am not sure what the issue was. I would totally say \"yeah this is a great place to grab a pizza and get some yummy desserts\" if the line wasn't down the street and the service wasn't a total crap shoot. Like a 4 stars for food and no stars for service type place.", "author": "Tsuru J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-31", "description": "I would give this place a 5 out of 5 but the service was a little dry. Otherwise, it was delicious! The environment felt like it was out of a movie and the simplicity and diversity of the people made me really appreciate the place and the owner. You can sense the genuineness of the place. If you want really authentic New York pizza, this is your place! Definitely coming here again.", "author": "Ruah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-17", "description": "Classic location in DUMBO area of Brooklyn. \nNot much for atmosphere/ decor. \nService was pleasant. \nPizza was fanfrickentastic!! I'm typically not a thin crust pizza fan but the\nFlavor and texture of this crust was amazing. Pizza sauce great- rich and slightly sweet. \nToppings were generous. \nSmall size pizza was more than enough for two people. \nGrimaldi's is a classic for good reason. \n\nTip from the doctor ( Notorious MD): Walk the Brooklyn bridge for scenery and excercise. Then indulge in a pizza at Grimaldi's. \n\nPS Cash only. No pizza by the slice.", "author": "Andrew R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-28", "description": "Was pretty good, I came here with my girlfriend and ordered a large white pizza with mushrooms and fresh basil. I went here twice 5 years apart.\n\nIt was good, but not ridiculously good. Idk if I am just comparing too much with all the pizza I had from Italy or the grease filled juicy pizza from pizza hut. \n\nMaybe my mouth was not used to the different taste. \n\nWas it worth the price? YES.\nWorth the 60 minute wait? YES, for the history of it being the first/original Grimaldi's\nWorth the calories in my belly? Maybe, almost tasted redundant after the first two slices\nWorth returning? Maybe, If I went with friends who never tried it before\nBest PIZZA EVER? At one point in time, I would say yes.", "author": "Kristofer A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "I've been to Grimaldi's twice with the same friend- both times for lunch on a Saturday, both times at this DUMBO location. Both times we had about a 30-minute wait. And (all together, now) both times we ordered the same small, basic pie (fresh mozzarella, crushed tomato, and basil... mmm, basil). It was like self-inflicted deja vu -- in a good way, mostly!\n\nGrimaldis' ingredients are definitely fresh; the tomato sauce is, I'd say, the star of the whole shebang. It's totally a tasty slice in general and I always enjoy it while I'm there, although I don't really find myself craving it. There are (um, obviously) lots of other pizza places to try in New York, so unless I get another request to return, I'll probs check them out before coming back.", "author": "Laura O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-23", "description": "I've been to the Grimaldi's at Coney Island, and it was a nice experience. However, this one at DUMBO...old guy who works here kept coming outside and yelling, let me be clear, YELLING, at everyone to stand in line, to stay in a straight line, to wait until you were called, and to hurry up after he called your party. He was absolutely rude. Normally I would not even have gone in, but since I was a tour guide to my family from out of state as well as having an exhausted pregnant sister and a two year old, I had to keep myself together. ...but we should've just left because we waited, literally, an hour and a half for two pies that weren't even that good anyway, too thin and small. The atmosphere of this place was unwelcoming. The waiters were solemn, did not smile, and could care less to interact with you. The entire crew just acted as if you were a waste of time. I will never go here again. I don't recommend this specific location.", "author": "Sandy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-04", "description": "I've always heard a lot of positive comments about Grimaldi's and how it's a must try while in NYC.  My friend said his friend recommended Grimaldi's if we planned to be in Brooklyn.  So we kept flip flopping whether to eat here but it was somehow dropped off our itinerary.  \n\nWhile we were in the Brooklyn Bridge Park, we decided to go to the Nets game so we wanted something nearby to eat.  We decided to give Grimaldi's a try since we was right there.  Though we've heard that there can be a long wait, we lucked out and sat right down just before 6pm.\n\nGrimaldi's menu is simple.  There's an antipasto, calzone, two types of pizza (regular or white), and choice of non-alcoholic drinks.  \n\nWe decided to go with a small regular pizza and add on Italian sausage and mushrooms.  The small was enough to feed the two of us.  I love thin crust pizzas, however we both thought that there seemed like there was something \"missing\" in the tomato sauce.  It tasted watered down and under seasoned.  I wish they were a bit more heavy handed with our toppings.  \n\nWHAT TO KNOW:\n*Cash only\n*Service was good, though the workers didn't look happy most of the time\n*Pizzas come in either small ($12, 6 slices) or large ($14, 8 slices)\n*Standard pizzas come margherita style with cheese, tomato sauce, and basil\n*Additional toppings cost $2", "author": "Nicole S."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}