{"aggregateRating": {"reviewCount": 4482, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "This place is amazing.  Some of the best traditional pizza I have ever had.  Staff was great, location was great and the price was where I expected it to be.  If you plan to go, make sure you allow enough time.  We went at about 2 pm and there was a small line up at the door.  This will become a regular stop on our trips to the city.", "author": "Joey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-25", "description": "The pizza is really good New York style pizza. It's thin and crispy with good flavor. We stood outside in line for about 20 mins which is fine but the guy at the door sat FIVE parties behind us. There was only four of us so it really didn't make any sense. Plus, when we got inside there were multiple empty tables but whatever. The service was also really bad. We ordered and then wanted to add something and literally had to wave down the server and he never came to check on us. Again, had to wave him down for water. Overall, the pizza was good so I'd go again.", "author": "Kaj P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-25", "description": "Such good pizza! If you don't want to wait, just ask to sit at the bar. The pizza is the same either way! Cash only, so keep that in mind.", "author": "James L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-19", "description": "Apparently business is SO good they can turn away orders for 12 plus pizzas! We are a tour company and our client gets pizza here every year he brings his students to the area. This year he was TURNED down and treated exceptionally rudely by the staff. It's ok that you don't need the money or the business, the pizza place down the street appreciated the business! When a company turns away business it makes you question the integrity of those who run it. Allowing rude employees.....unacceptable. Will be sure to pass our review along to the American Bus Association and United Motorcoach Association to ensure no other bus groups frequent this location.....", "author": "Carol G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-11", "description": "Still the best pizza ever, even with the new location. I especially love the white pizza, but the one with sauce is amazing too. The place itself is dirtier than I'd usually be okay with, and the use of all disposable plates, cups and utensils isn't cool given what must be substantial waste each day. Still, I love this pizza...so I'll find some other way to offset my carbon footprint for this very occasional indulgence.", "author": "Rebecca B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-05", "description": "I think this pizza place is hyped up although it was good, I don't think it's as amazing as everyone makes it seem. The wait was 30 minutes to get in, the pizza took about 20 minutes so it was about an hour before we got to dig in. It was just two of us and we ordered a large pizza pie, half pepperoni, half fresh garlic and mushrooms. The pepperoni half was amazingly delicious. I loved it! The fresh garlic and mushrooms were something we wanted to try but weren't so happy with it. The crust was super crunchy and it was cooked perfectly. Although it wasn't mouth watering, it was good pizza. I felt like everyone along with us were rushed, the minute we finished eating, they would take away our played, they would have the check ready, and before you even give the money (I guess they knew what you'd give), they were ready with the change. Kind of disappointed at how fast pace the service was.", "author": "Lily F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-25", "description": "We came to the original Grimaldi's with some friends and they had about an hour wait. Fortunately our friends knew the manager and we were in within 5 minutes.\n\nThe service was really good; attentive and fast.\n\nThe pizza was good, but not worth an hour wait. I prefer a thicker crust than theirs. They don't serve any alcohol. The prices are fair.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-02", "description": "I had the worst experience here due to customer service. I read reviews on Yelp how the line is totally worth the wait and it goes by quick. So I wait my fair amount of time - NOT. I wanted to do takeout  and was told by an employee I did not have to wait in the line. I go and ask about their to go option he insisted to get back in the line. I wait longer and longer and I'm not assisted, people behind me were seated before I was asked my order. When he called for anybody for a party of 2 I was delighted and went. When I told him I wanted to go home again he said to wait on the line again. I get back to the line and the other people in line were confused and had same opinions as me. I finally wait even longer almost a hour now and still haven't been assisted. I ask again to another worker and he told me he would help me. He leaves and doesn't come back so I had to ask the original guy who was ignoring me. I was so beyond fed up I wanted to leave. He finally takes our order and says to me \"you should've just told me you wanted take out\". I was furious. I take my order and they AUTOMATICALLY charged tip in the total which I did not want to give, if it were up to my discretion. Keep in mind this place only does cash as well and they make you go to the bar next door to the atm. \n\nOverall the pizza wasn't even as great as I was fantasizing it to be. This place was a huge disappointment. I was originally going to go to a different grimaldis in Flat Iron but heard that \"the original is the best one\". but it tasted strange, smelled strange, and was super greasy. I would rather take my NY cheese slice for $1 over this any day.", "author": "Wendy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-31", "description": "Solid Brooklyn Pizza, they put the cheese directly on the crust and tomato sauce on top. The service seemed angry and apathetic, but I must say they still let me and my friend in after they were closed by a few minutes, to which they definitely weren't happy about, but still let us in, so appreciated that. It's also NY and Brooklyn, there's no BS which is what I like about NY. The pizza itself was ok, for being one of the Brooklyn institutions I expected better. I like Lombardi's more, so I probably would not go back here.", "author": "Andrew H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-12", "description": "Pro: delicious pizza, quick service, casual homey ambience \nCon: cash only, limited menu options", "author": "Zainab Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-27", "description": "TERRIBLE. Why is this place even famous? Paper plates, plastic silverware, NO credit cards accepted (yes, you have to pay everything with cash), and they take a very long time to bring one pizza. In my experience, not only they took forever, but also my order was wrong. Never going back. There are many other places in NY where they make good pizza and also treat their customers the way they deserve. So much for \"the best pizza in NY...\"", "author": "Pablo N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-15", "description": "Spent a few hours in Brooklyn and wanted to grab some pizza. We stopping and got a large pizza with pepperoni and jalapeños. The pizza was delicious and the crust was perfect. The place is massive inside, and the price was very reasonable. I'd definitely come back!", "author": "Jacob M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-13", "description": "Grimaldi's happens to be a staple must-visit for anyone visiting NYC for their infamous thin crust pizzas. Years ago, I believe there may have not been much competition for them, but now thin crust pizzerias are plenty to visit. \n\nThe margarita pizza we shared among my two friends and I. The pizza is prepared quickly, so thats a big plus. The crust was crispy with plenty of sauce and cheese to make it a decent option. \n\nOverall, the staff was not the friendliest and we felt if we were being rushed from the moment we got there to be in and out, when it wasn't even packed that much.", "author": "Asim F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-12", "description": "Why 3 stars? Because I'm retiring Grimaldi's.\n\n   ---   ---   ---\n\nYep... Grimaldi's, you won't disappoint me anymore. After my first visit, I thought that this was the greatest pizza in the world. Since then, I've been let down each time. It's way too long of a wait for average pizza. What I really don't understand is, why is the Grimaldi's chain in Tampa so much better than the original location? I still stand by the fact that they have gotten lazy, considering their reputation allows them a line out the door for all of eternity. \n\nThere is much better pizza in New York, with no wait. The taste doesn't come close to matching the legend.", "author": "Brett N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-08", "description": "Such a long wait and the pizza was not worth the wait. It was good but definitely not over the top amazing. Kind of over-hyped. But it is a good pizza. I liked the globs of cheese they put on it and the bits of basil. The sauce was flavorless though, so I had to put garlic salt on it which I never usually do. Crust was really thin, which is how I like it but for some reason not that crispy. Best part of the pizza was the fact that it wasn't oily at all. \n\nOverall, good pizza but still wait is a huge turnoff. The 30 min. wait outside was fine, but the 40 min. wait to get the pizza, 20 min. wait to get the check, and 15 min. wait just to pay the bill was just too annoying. I would like to come again, but just need to find out when the off hours are.", "author": "Jocelyn K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-10", "description": "The pizza: very good, but it's hit or miss. They do use fresh mozzarella. The first time was perfect, second time it had a crap ton of garlic on it, we didn't order. Third time it was just flat out bad.\n\nThe seating system: complete bullshit. It feels like a lottery system or bingo. You wait in a huge line that forms outside on the street. A man may or may not come ask for the number in your party (not your name or anything just the number) they proceeds to shout out random numbers! \n\nExample: A party of 3 will be sat before a party of 2 waiting 20 mins longer then the party of 2 did. Large parties, I understand, It's hard to get tables together but why are three parties of 4 being sat before parties of 2 or 3 . Also you shouldn't seat 3 parties of 6 (almost) consecutively, mix it up a bit!\n\nBasically to sum it up, just hope your party is the magic number or you will wait ALL night while many people who were behind you in line finish their meals and go on their way!", "author": "Danielle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-12", "description": "The pizza was ok. It was soggy in the middle and burnt at the edges. I could have used more sauce. The service was also just ok. The staff seemed nice. It was a little unorganized as I had multiple servers ask me if I had been helped. All in all the experience was ok. Grimaldi's is just another tourist trap.", "author": "Ronnie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "Pizza was delicious.. \u0026 the restaurant next door has beer \u0026 outdoor seating..so you can order pizza to Go Wayyyyy faster \u0026 sit outside... Order drinks from next door. Cute experience", "author": "Rosa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-20", "description": "My NY friend recommended this place. I just love it. Pizza is amazing. Two of us had the half half ( pepperoni mushroom \u0026 spicy sausage basil). The tomato basil sauce is very authentic. And love the thin crust. Apparently the location is pretty popular. Expect to wait. We took a second floor seat, it is pretty funny to see our waiter to give hand signal to downstairs people through the glass window to put in our orders. :):) Oh, don't forget to check out the Brooklyn bridge park nearby. Amazing view of Manhattan!", "author": "Jennifer W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-29", "description": "This place serves good pizza, but it is not the best pizza in NYC.\n\nI first ate here with my dad when it first opened and there were long lines. My dad hates waiting on lines, so we only came here when there was nobody. Then, everyone followed.\n\nThe pizza was nothing special. I am used to having a \"remarkable\" pizza place serve other things besides pizza and they really had nothing else.\n\nI would never wait here for their pizza. Just come inside if there's no line.", "author": "Deirdre L."}], "servesCuisine": "Pizza", "priceRange": "$11-30", "name": "Grimaldi’s Pizzeria", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "1 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/gWKNFR58TIuA7M25dqj9rQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188584300"}