{"aggregateRating": {"reviewCount": 32, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "I went to Makina Cafe on Saturday with my parents when they had a stand at the Queens International Night Market. I got the yellow rice base with beef tibs and miser (spicy whole red lentil stew) with the Makina sauce. The rice was very well cooked and flavored, the beef was tasty and tender (the rosemary really came through), and the lentils were spicy but well-rounded. The sauce pulled everything together and wasn't too spicy, either. Everything was expertly cooked and flavorful, not to mention only $5. In addition, the owner and workers were so kind and friendly and I loved the story behind the business. Really good find!", "author": "Ambrosia F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-20", "description": "So disappointed!  I was so excited to see this Ethiopian food truck since I absolutely love the cuisine!  Much to my dismay and $10 poorer I was given stale and a stingy amount of injera bread with my vegetarian meal.  I also had a stomach ache and about 20 hours later after ingesting the meal am still sitting on the toilet trying to expel it...  ie.  it gave me \"the runs.\"  (Sorry- TMI)\n\nThe lady was so nice and friendly and the truck is cool looking.  Those are the only attributes of the place.  Food is not good at all.  I have eaten home cooked Ethiopian food and have eaten at at least a dozen Ethiopian restaurants from coast to coast.  Moral of the story is-  Ethiopian food should not come from a food truck I guess-  at least not this bright yellow one on 46th street.", "author": "Anne W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-19", "description": "It's perfect!  Had the chicken tibs, collard greens and cabbage with the hottest sauce along with yellow rice.  next time i'll try the beef tibs, bread, and lentils.  Love love love the flavor.  i'm glad more variety in food trucks is added to the Hudson Street location :)", "author": "Octavia V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "Automatic points for being the only Ethiopian food truck! And as a bonus - it's delicious! I tried the injera base (the only real way to go) w/ chicken tibs, miser, and tikel gomen. So good. Great portion and great price!", "author": "Joseph B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-29", "description": "Tried this place at the queens world fair event. One of the best vendors there. The food was great and the people working were friendly and knowledgeable. I would recommend this to anyone that likes great food and good people.", "author": "Bee D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "Love it. I'm probably colored by how rare it is to eat Ethiopian or Eritrean food in east side Manhattan. The food is good, people are nice, and portion size is fine. \n\nI do wish they were in the east side more frequently. I miss Adams Morgan or Oakland when it comes to availability.", "author": "C L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-28", "description": "Makina Cafe is one of the most unique and authentic food experience that I have ever had in New York City. The blend of spices, flavors, and ingredients are unmatched by any food truck I have been to before, and the time and effort that goes into making these dishes from scratch are immediately evident. Come lunchtime; I find my mouth watering just thinking about all those brightly colored sides and sauces. Red lentil stew, yellow rice, collard greens, and those to-die-for sambusas with Makina sauce, all so incredibly low-priced! Makina opened me up to a whole new world of authentic Ethiopian food, and I hope we'll be seeing a bunch of those crazy patterned yellow trucks all over the city soon.", "author": "Tori G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "Love.  I am by no means an expert in Ethiopian food but I can say that this is great food served by the friendliest staff of all the food trucks I have been to. \n\nThe more I eat there the more I like it.  My go to dish has been the chicken over injera with at least one the stews (red lentil or yellow pea), add salad (when I remember) and extra hot sauce (I get both types but I like the red more).  Green beans are excellent and go fast. Haven't had collard greens yet but on my list.\n\nNote: for those that have never had Ethiopian food, I highly recommend you try the injera over the rice.", "author": "BL G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Makina has done a fantastic job incorporating ethio/eri food on the go! It really can't get any better than eating a blend of veggies and beef tibs to get your day going! We fully support Makina!", "author": "Mickias S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-27", "description": "Being from Ethiopia and growing up in New York, i'm happy to see Makina join the food truck capital of the world. Grate value, awesome customer service, and the food will speak for itself. The chicken tibs (pan sheared pieces of tender chicken) is my favorite. Follow them on instagram to get their daily location. You will not be disappointed!!", "author": "Alef T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "So I had food from makina cafe food truck today and man can I tell you it was amazing. I had two dishes. The chicken with rice and the beef with injera Bread. Both with lentils and cabbage. I could have another two more it was that good.  I highly recommend this to everyone.  Keep up the good cooking makina cafe.", "author": "Roy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-03", "description": "I've always wanted to try Ethiopian food but never really had anyone to go to a restaurant with me.  Found Makina Cafe at the International Food Fare at Citifield this past weekend and had my change.  The food didn't disappoint.  The staff were very hospitable and they were the only vendor at the food fare to have the sense to provide a few chairs for patrons.  I hope the truck will find it's way closer to Rockefeller Center / Radio City.  Will definitely be a customer again if I come across the truck.", "author": "Sophia W."}], "servesCuisine": "Ethiopian", "priceRange": "Under $10", "name": "Makina Cafe", "address": {"addressLocality": "Long Island City", "addressRegion": "NY", "streetAddress": "", "postalCode": "11101", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/oCQgvYrzkcvPkbS0kQe8AA/ls.jpg", "@type": "Restaurant", "telephone": "+19174265649"}