{"aggregateRating": {"reviewCount": 32, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-22", "description": "Absolutely one of he best trucks out there. Flavors are so good and gives me the \"home cooking\" feels. I have introduced many from the office who have never had food from this region before, and they all love it. The owner has the friendliest genuine smile as well. \n\nSome trucks are out there as money makers and they are good, don't get me wrong..   but Makina is special and deserves the success.", "author": "DJ C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-19", "description": "Thrilled to find an Ethiopian/Eritrean food truck. Execution was uneven. Two of the three orders were not filled as ordered. And the food came out lightning fast--too fast. Everything tasted pre-cooked. Getting the sauce over the chicken, not cooked with it, made a real difference.\n\nStill, on balance, thrilled. And we devoured the food, which traveled better than most other Ethiopian food I've gotten to go before.\n\nAnd the combination of buzzed Fifth Hammer patrons and calm, friendly Makina pros made for a very nice vibe all around, including the boy who could barely see the drink he wanted to buy, was helped along, and tiptoed up to put $1 in the tip jar; and the woman given the wrong order who was chased down in Fifth Hammer with the help of other drinkers, forming an information chain.", "author": "Carl B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-18", "description": "Disappointed with the food I received from them on Monday April 14th. They were parked at 45th St and 6th Av that day. I bought chicken tibs with yellow rice.\n\nThe rice was burnt and dry. The chicken itself wasn't terrible, but it wasn't their best. And it was mixed in with the burnt rice so it wasn't good. I've eaten from them before and this was my first bad experience. I had to buy something else to eat for lunch.\n\nJust very disappointing. Hopefully that was just one bad day and this doesn't become a trend.", "author": "Christopher C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-11", "description": "I tried Makina once about a year ago and remember it being amazing, but I never saw the truck again. I know that I ordered the chicken tibs and the makina sauce. I don't remember the sides but I know they were good\nToday I set out for vegetarian food (meatless Monday!) and was very happy to see Makina parked on 46th btwn 5th \u0026 6th. I ordered the veggie platter and chose the spicy red lentil stew, cabbage and potatoes, and split pea stew. The red lentils were delicious. The highlight for me though is the makina sauce which is perfectly spiced and would probably be good on anything that you put it on. I definitely recommend giving them a try!", "author": "Hannah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-29", "description": "Holy Makina! I have been trying to find this truck for months. Low and behold, it was parked on Water and Old Slip, a 15 minute walk from my office, so I decided to make the trek down for lunch. Best decision I could have made. \n\nThere were a couple of people in front of me who received their orders as I was arriving. I stepped up to the window and asked the woman manning the cash register what she recommended. She suggest beef tibs with inerja, lentils, yellow cabbage and spicy makina sauce. She did not lead me astray! \n\nFood cost $10.50 and came out quickly. And at first bite was an explosion of the tastebuds. For some reason, I thought the makina sauce would be red. It was actually green, and it was spicy. I was pleasantly surprised that there wasn't an overwhelming amount of injera too. There was just the right amount to dip in the red lentils - the perfect bite. \n\nI would seriously be here a few times a week if the truck would park here more often.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-28", "description": "I've only had Ethiopian food once many years ago  and while I enjoyed it there weren't any options close enough to me.  That's until I heard about Makina.  I had it for the first time today. They were about a 15 min walk from my office but it was definitely worth the trip. I had the chicken tibs with injera, gomen and tikel gomen with the Makina sauce. I also had the beef sambusas. The chicken was SO SO tender and seasoned so well. The veggies were cooked perfectly and were a nice compliment to the chicken. I am not a fan of the traditional sourdough bread but now I can say I love their sourdough flat bread! The sambusa pastry was nice and flaky and filling was perfect. I'm glad the weather is warming up because I'm already looking forward to having it again!", "author": "Mary Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-29", "description": "So Happy I was able to try Ethiopian Cuisine at The World's Fare 4/29/18. Never have I had the opportunity to try Ethiopian Food so I was so excited to get my hands on a plate!! \nThank you for making amazing food full of so much flavor Makina Cafe! The customer service at your booth was awesome! Everyone was so nice, happy to explain the dishes being offered, and most of all excited to be there! \nThe Beef Tibs were out of this world! And the Injera was like nothing I have ever tasted before...I LOVED it!! Also the Gomen (collard greens) were cooked perfectly. I really enjoyed The Awaze sauce served with my plate! \nThe prices were excellent! \nMy first experience here was flawless!\nNext time I'm going to try the coffee served here! I will be checking out this truck next time I'm in NYC!", "author": "Shannon H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "Went over to Makina food truck at the DUMBO Food Truck Lot since they had some of the best deals. ~$10 nets you a protein with two sides.\n\nI did the beef tibs with collard greens and tikel gomen (cabbage, carrots, potatoes). I chose the indera (sourdough wrap as my base). The bread was actually plenty sour (more so than sourdough bread since it's so airy). The beef portions were pretty generous. The sides weren't that great, however. They were just... kinda there.\n\nWould definitely come back just for the deals!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-04", "description": "This little food truck is one of my favorites whenever I can catch them, and when Makina comes around on Hudson Street in the West Village, I tell everyone to go!\n\nI always get the same thing: chicken with yellow rice, gomen (collard greens), and tikel gomen (cabbage, carrots, potatoes), and either the awaze or makina sauce (both are delicious depending on your ideal level of spicy). GREAT lunch box deal. The food comes out quickly, it's steamy hot with aromatic spices, plus it's a large portion packed with flavor.", "author": "Victoria S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-26", "description": "Love at first bite and the food has only gotten better over time from Makina Cafe, the first and only Ethiopian and Eritrean food truck in NYC.\n\nGreat injera, juicy tibs with rosemary flavor. Chicken or beef are both tasty and can't go wrong either way. Go-to veggies are the miser (red lentil stew) and gomen (collard greens). Round it out with some awaze sauce - adds even more flavor!", "author": "V G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-08", "description": "Not the easiest to find food truck in New York City but I was able to catch them at the Queens Night Market in Corona Park.  Simple Ethiopian fare is what they prepare in a hurry and with care.  Chicken tibs with lentils, injera and drizzled with the infectiously tasty awaze sauce hit the spot.  Expect long lines and slow service here but worth the wait.  Look them up online to see where they'll be next and try it.  Recommended.", "author": "Anthony G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-29", "description": "I did like this place, but I feel like it's food you kind of have to get when you're really hungry, otherwise you won't enjoy it. But I did like it, the Injera (spongey sourdough flatbread) was actually good, especially dipped in Ater (split pea stew). Definitely save this place for more adventurous eaters but overall it was nice to try something new.", "author": "Haylee A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-03", "description": "I've seen this food truck near my job many times but I finally decided to give it a try today. I got the injera (flatbread), chicken tibs with awaze sauce and makina sauce, miser (red lentil stew), and tikel gomen (cabbage and potato), and a lentil sambusa on the side. \n\nThe chicken was SO good! Absolutely delicious and the awaze and makina sauces on top were so flavorful and not too spicy at all. This was definitely my favorite part of the meal (along with the sambusa). The injera was very interesting, my first time trying it. It's very spongey and soggy, more than I was expecting. Not sure that I'd get that again.  The red lentil stew (miser) was a lot more liquidy than I was expecting. In some of the pictures it looks thicker, and it seemed to be a bit on the bland side, but maybe it just tasted that way to me in comparison to the chicken. The cabbage (tikel gomen) was good but nothing to rave about. And last but certainly not least, the lentil sambusa was so GOOD. Would definitely recommend that. I'll try the beef sambusa next time!\n\nThe portions are perfect for lunch - not too much and not too little. There was a bit of a line to order, and then a bit of a wait for the food. But definitely worth it, I'll be going back again to try everything else!", "author": "Anam B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-29", "description": "I didn't realize how much I missed Ethiopian food, which is more ubiquitous in the DC area than in NYC, until I came across Makina. Ethiopian food is familiar to someone who grew up used to curries and stews, but the spices and injera bread make the cuisine distinct and delicious. \n\nMakina has a simple menu that starts with having to choose a base of either injera, yellow rice, or a regular bread, then you choose either a chicken or beef protein base, followed by choice of two veggies from five choices (spicy whole red lentil stew, split pea stew, string beans with carrots, cabbage, or collard greens), and finally a sauce (lemon and olive oil, a medium awaze, or hot makina karia sauce). I went with the beef tibs on injera bread with the two lentil veggies, and makina karia sauce and accompanied my meal with a lentil sabusa and thoroughly enjoyed every bite.\n\nThe food is very nicely presented and the sabusa was absolutely perfect: flaky and very tasty with the accompanying sauce, which I used on my main meal as well. For $11, the value was excellent, and I am excited to try the chicken tibs and the other veggie items. I'm glad to see Makina in the fray and look forward to becoming a regular.", "author": "Danesh I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-12", "description": "Excellent Lunch spot near Wall St! Very Flavorful, Plentiful \u0026 Friendly!\nHad Chicken Tibbs with Lentil Stew and Cabbage. \n\n100% on the list for future visits $9 + Tax. Highly Recommend", "author": "Joe J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-30", "description": "I am obsessed with Ethiopian food so when I was walking to work and saw this truck I thought I was looking at a Unicorn. \n\nSide Anecdote: While I was ordering, someone actually came up and asked for a grilled cheese without even looking at the menu. I almost thought I was in the wrong place. SMH\n\nOk anecdote aside, the food was kinda just okay for me. I got the chicken and two sides of misir. The lentils were very flavorful but the chicken was not what I expected. I was hoping for it to be saucy and it wasn't and was a little dry for my taste. The amaze sauce that was given on the side is great and really complimented the dish!!\n\nWhile I was not super wowed by this place, I will be back whenever I am having cravings during lunch time and it's near by. Maybe I will even try something new.", "author": "Tash B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-06", "description": "Its a nice food truck with nice ethiopian food. But just that its happened once with my friend and again with me today that when we ordered lentil sambusas we got beef ones. This is not acceptable. If someones ordering vegetarian food you should know that they dont eat meat or they would have ordered that. \n\nFood is good so 4 stars for that but i take one back for the mix up. \n\nPS: They come every thursday near 55 water st NY.", "author": "Ruchi K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-13", "description": "This is the first time I've had Ethiopian food and I am blown away at how delicious this cuisine is.  I had the beef tibs with shiro and token gomen.  Injera bread is so good I cannot believe I've never tried Ethiopian before.  I will be coming back many times.  The samosas were delicious too, really loved the awaze sauce.  I am so impressed by this food truck.", "author": "Andy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-22", "description": "First time trying Ethiopian food!!! And it didnt let me down!!! I order the beef one and the steak is super juicy!!! It comes with rice and 2 selections of veggies. I ordered spicy and the green spicy sauce has that right kick for a spicy person. Not sure if the food truck will be here forever since the food trucks street usually change them up for diversity reasons but i will definitely come back when its here next time!", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-28", "description": "I can't say it enough; I love Makina Cafe. I have eaten just about every dish on the menu, and there's no way you can go wrong. I tried to decide what my go-to order was and got lost mid-way through just thinking about all the options. Usually, I'll go for the beef tibs, \"miser\" (red lentil stew), \"tikel gomen\" (cabbage, carrots, and potatoes), the yellow rice, soft spongy injera bread, and you have to try the Makina sauce, it makes the whole thing. Or if you're more of an Ethiopian food purist, you can go with the Awaze sauce. Either way, I can guarantee it will be just about the most mouth-watering and authentic food experience you can get in the city.", "author": "Renny I."}], "servesCuisine": "Ethiopian", "priceRange": "Under $10", "name": "Makina Cafe", "address": {"addressLocality": "Long Island City", "addressRegion": "NY", "streetAddress": "", "postalCode": "11101", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/oCQgvYrzkcvPkbS0kQe8AA/ls.jpg", "@type": "Restaurant", "telephone": "+19174265649"}