{"aggregateRating": {"reviewCount": 184, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-02", "description": "Great burgers and even better because you make them your own. Soemtimes the fries are way to greasy and way to much. I always get one order of fries for three folks unless my husband s there then I get two! Staffs nice enough and the price is alright better than McDonald's and pretty much the same price.", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-30", "description": "dayum dayum dayum! look at the bacon!!! dayum! get yourself a double cheeseburger!!! dayum! dayum! dayum! the cheese is oozing!!! burger with strength and the fries bite back my man!! dayum dayum dayum!!!", "author": "Dave M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-23", "description": "Competition time! Five Guys on Montague, with Shake Shack just a few blocks away..oh boy the choices.  Five guys is great. When you walk in, there's not doubt what they do there! Juicy tasty burgers plain and simple.  Bottom line is if you want a good burger, stop by Five Guys on Montague.  They try to push the throughput, so I felt a little rushed, but overall great place.  Peanuts!", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-19", "description": "One of my favorite burger places in NYC at this moment. I still have to discover a better place.\n\nA good burger has to come with good fries. Five guys serves a tasty fresh baked burger with the toppings of your choice. I might like Shack burger a bit more, but this place gets me with their fries. They're the best fries I've eaten in NYC and if you ask, they'll give you a little cup with mayonnaise to go along. For a European like myself mayonnaise makes good fries even better. And in case you're doubting what size of fries to get. Just go for regular, because these guys will throw in some extra with each order.\n\nOne thing that I need to mention is that the people working at Five Guys there are so incredibly friendly and joyful. You'll get service with a smile not only because they have to, but because they feel like. That makes the food more enjoyable too.\n\nHighly recommended.", "author": "Roel M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-30", "description": "The wait was long and burger + fries cost $10, which is kind of horrifying considering that the last burger + fries I had elsewhere also cost $10 but was huge, broiled to delicious perfection, and included a pint of Hoegaarden.  Whatever.  The burgers here are deliciously messy and patties are thin but they give you two by default.  And those fries are KILLER (probably literally, despite this silly intuition that being fried in peanut oil is any healthier than lard... but let's not think about that.)  \n\nA brain scan while I'm waiting on line at Five Guys would still reveal a strong mismatch negativity when it comes time to pay (\"What??  Fast food?  Why so pricey, Guys?\").  But that does not mean that greasy paper bag full of fries is not producing all the right endorphins.", "author": "Ju L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-09", "description": "Burgers here are obviously good. Best part being the free toppings which allow you to customize into just about whatever style of burger you can want.. Tons of fries as has been said. \nHotdogs here are underrated also. Much nicer to get a grilled hotdog for once, just wish they had chili.\n\nMy main tip is that you call in your order if your coming during peak lunch hours. This basically allows you to skip the line, and also you wont have to wait for your food when you get there.", "author": "Geoff C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-02", "description": "Five Guys Burgers tastes so good when you're eating it but it makes me feel sick after. Maybe it's the mountain of fries that they give you that are really tasty. \n\nThe first time I went I ordered the Bacon Cheeseburger which turns out to be 2 patties. The little burger is one burger. I was upset  that it doesn't say that the regular burger is 2 patties. \n\nIt cost me $16 for a bacon cheeseburger with fries and a coke. This is significantly more expensive than any other fast food burger joint.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-20", "description": "First Impression: The location is wonderful. I love the stools at the window facing the street.  \n\nEntree: The Burger. I gasped when I took my first bite; it was goooooood!\nI also got fries, and they were really yummy.  I'm glad I only asked for one order of fried for my cousin and I, they gave A LOT.  I like the variety in the fountain drinks. \n\nI really had a great experience here. The Burger \u0026 Fries truly lived up to their reputation.  I look forward to bringing my friends and family; I want to see the look on their faces when they take their first bite into this amazing burger. \n\nAtmosphere: Really comfortable and fun. The magazine clippings of all the awards Five Guys has won makes you appreciate the place even more.\n \nFood: It was hot when we opened it (always a plus, cold food-yuck), the cheese was melting over the side, another plus. First bite, \"WOW\".\n\nService: Pleasant.\n\nThumbs up: The staff cleaning after people that left so the tables will be clean for the next party.  It was expeditious and not annoying. \n\nThumbs down: The wait is a little long if your on a lunch break like I was. But I got to sit and eat.", "author": "Kassandra O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-19", "description": "Sometimes you go out with a person for the first time and you are like, \"Wow, he/she is awesome.\" Then after a couple more dates you start to feel like, \"He/she is pretty decent, but I'm not feeling it like in the beginning.\" Then add in one more date and you discretely break up by not returning any text messages.*\n\nThe above is a semi-dramatic description of my time with Five Guys. The first burger was nice, the second one was pretty nice, the third one was just nice, the fourth one was mildly annoying and boring and now after about ten visits in the past year I am over it. The burgers are just ok and it's not like there is much else to get. I like that you can customize your burger, but still it doesn't make them taste much better.\n\nThe fries are highly aggravating to me as well. I like french fries, but I don't like these french fries. They seem more akin to a potato and that should feel more healthy, but when a regular order of fries comes dumped messily in a bag with grease stains pervading every angle of the bag, when the fries are in a cup and on top of my burger in said greasy bag and when there are enough fries for a pre-school class and their parents after a twenty day fast, it just seems to be a bit excessive. Five guys would have trouble finishing an order of fries.\n___________________\n* I do not advocate this philosophy.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-16", "description": "free peanuts while you wait. Burgers are about $7 which i find a little pricey. But the burgers are really good. As are the fries. By far have the best fast food fries to me. With every chance i get, 5guys is my choice.", "author": "Jazmin W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-05", "description": "dont eat those nuts , saw some homeless guy stick his hand in and grab a bunch , the burgers and fries are to die for !!!", "author": "Jimmy R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-10", "description": "While I love the concept, these folks cannot compete with a west coast franchise called In and Out. I put this on the review because it is relevant. The burgers are good, but not exceptional as everyone tells me they are. I feel as though it's not as good of a value as it should be, and the thing that gets me the most - they portray themselves as a fast food place (It's what I assume) and yet it takes me 20 minutes to get a burger and fries. I can't quite put my finger on one thing that is wrong, that's why 3 stars instead of 1. My whole experience is just not right on the whole.", "author": "Tegan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-14", "description": "Just like any other Five Guys you go to with respect to the slighltly overpriced burgers but the service in this locations deserves the stars! The work fast, are always very friendly, and have given me free fries multiple times because they keep them fresh and had some extra they didn't want sitting around! Love that everything is made fresh at Five Guys!", "author": "Erin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-03", "description": "Ok, so this isn't an In-N-Out (oh my beloved In-N-Out, how I miss ye), but for the east coast, it seems pretty close.  First off, the fries.  Get someone to help you with a small order bc there are a shit ton of those bad boys.  I believe their style is more closer to the homestyle fries which is always a win! \n\nTheir burgers are good, maybe a little small...my guess the patty is around a 1/6th - 1/5th of a lb (give or take a few ounces, but still, they have flavor. Obviously, I got the sm. bacon cheeseburger (that is the one up on In-N-Out i must admit).    Although the bacon was crisp, it was still really good.  Now I do prefer bacon all super greasy and floppy and stuff, but I had absolutely no problems with this since most restaurants and most people serve and prefer crisp bacon.", "author": "George F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-23", "description": "It's definitely a good burger but nowhere near the best. The small size causes them not to be very juicy, if they would make a thicker patty instead of making a double I think it would taste better. The toppings are always fresh and the fries are usually tasty though they can be inconsistent at times. Overall I like their burgers but I usually only frequent it when I'm too hungry to find another burger joint to try.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-05", "description": "I went on  a recommendation and honestly these burgers are seriously greasy.  The fries tasted OK but also greasy. Try Shake Shack instead. It's not gourmet but better than 5 Guys.", "author": "William V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-25", "description": "Here's the story of Three Girls at Five Guys:\n\n1. Orders were placed at 7:55pm.\n2. Orders were picked up at 8:03pm.\n3. Orders were devoured by 8:15pm.\n4. Sighs of satisfaction were let out at 8:16pm. \n\nThe end.", "author": "Diana F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-12", "description": "I LOVE Five Guys! \n\nTasty -- no, DEEELICIOUS -- cheap, and I can get practically a whole salad's worth of toppings.\n\nThe fries are heaven. I take my left overs home, put them in a ziplock in the freezer, then re-enjoy them later after a spell in the toaster. Crazy, but worth it.", "author": "amy s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-19", "description": "Best fast food burger place I know. I think it beats shake shack personally. Loads of fries and the juiciest burgers with great toppings. Good value. Try it once and you'll be hooked.", "author": "Zachary D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-02", "description": "Rarely do i eat at fast food places and i cant tell you the last time ive been inside a mcdonalds or burger king.  I am very sceptical of fast food places and with that I've never eaten at a five guys before, but i was really in the mood for a quick burger and I was walking by five guys and it looked so clean and legit so i decided to try it and I was pleasantly surprised.  The burgers here are great and seem to be made of real chop meat which was such a nice treat, the patties at five guys aren't those perfectly round or square flat processed garbage patties that you would expect at a fast burger place.  Also, the seasoned fries were great and a really nice complement to the burger.  I actually can't believe this was my first time at a five guys but I will be returning soon for sure.  For something fast and cheap you really can't beat it.", "author": "Joseph D."}], "servesCuisine": "Burgers", "priceRange": "Under $10", "name": "Five Guys", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "138 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/MaqhcMKeIHwWIrswCXtNoA/ls.jpg", "@type": "Restaurant", "telephone": "+17187979380"}