{"aggregateRating": {"reviewCount": 184, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-27", "description": "its been a minute since i visited montague st in downtown brooklyn and many new shops are in and the old shops are gone but five guys burger is here and my crew want burgers and burgers they will get. the basic 5 guys setup with large counter area where i set you order your burgers , fries , hotdogs , shakes , etc and the other side is the pick up area .i like the made from scratch method as the food may take a while to make but freshness is on point . not a big fan of the soggy fries but burgers and hot dogs are very good , i recommend you get all toppings cause for almost 9 bucks for a 2 patty burger is not cheap especially if you are buying 6 burgers like i did . ok free peanuts is no big deal but self service soda machine with many choices and free refills is good news (i think the refills are free ) and ample seating all around but the high chairs and tables are not good for someone like me who is super clumsy. number 79 is called and out the door i go with my 6 burgers , 3 large  fries and a wallet with minus 70 bucks .", "author": "Sadri B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-17", "description": "It's a bit wacky, but I've been on this earth 28 years and never had Five Guys until my visit to this location. I stopped in for a quick burger and didn't realize how many options they would have here. You really can do a bunch of combinations, but when I got to the register, the toppings overwhelmed me so I ordered something super basic along with fries.\n\nThe burger and fries took about 10 minutes to come out which I thought was weird. The serving of fries was HUGE and I couldn't even really make a dent in them. The burger itself was nothing to write home about. \n\nOverall, a decent spot for takeout if you don't mind waiting a bit, but the restaurant itself is a little off-putting since it wasn't that clean. I wouldn't recommend sitting down here to eat. Take your food and eat on the go.", "author": "Cristina G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-24", "description": "Everything was fine, but that's all. This burger chain just doesn't do it for me. Their fries have always lacked the crispness that I look forward to out of a deep fryer. Their bacon cheeseburger was just not eliciting that reaction that only one chain has been able to consistently provide, although the bacon did make it rise to 3.5 stars in my book.\n\nI gave Five Guys this second or third try, but despite their politeness and efforts, the gratis peanuts, and even the apparent quality of the products, they're just not my favorite and won't have me yearning to return. \n\nThey could also use some drink offerings beyond just soda, although they do have those cool Coke mixing machines and unlimited refills, but I like something like a beer or a shake with my burger on those weekend daytime occasions that I'm meandering through a neighborhood and just letting the day unwind itself.", "author": "Charles B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-12", "description": "Use to love this specific location, but today's service left a bad taste in my mouth. A few toppings got mixed around my order ended up being different but all that needed to be done was add bacon to the right burger and what the cashier did was throw away the whole order to make the order all over again. It was petty and wasteful. Then the remade order took longer and was very over cooked. I mean hey if you don't like your job change it but if this keeps happening you'll just keep losing customers like you did today. It was nice while it lasted but hey all good things must come to an end or maybe people should just care a bit more and stop being petty and wasteful.", "author": "Karina F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "What can you say? Its Five Guys! Always satisfying. Burgers are always nice and juicy. And you cant beat the free peanuts!", "author": "Adventurous P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "Super friendly staff, service was quick and they made my order to perfection.\nIt probably helped that it was earlier than lunch time so it was fast, but I try to come when it's not too busy.\n\nOtherwise you will have a long wait. FYI, there is not a lot of seating and it is a smaller location than most Five Guys. So if you come when it's really bumping around here, you will be SOL looking for seating. \n\nMaybe you can sit on the steps outside that lead up to the front door if it's not too cold outside.", "author": "Kevin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-03", "description": "Gets me going every time.  \n Great to have a nice tasty place during this freezing weather. \n  Keep up the good works.", "author": "Andrei D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "Great as usual\n....it's like a tamed Willie burgers....lol ...if anyone remember them. Great location and fast service to add to delicious grub.", "author": "Ashti D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-28", "description": "A decent fast food place to visit. Definitely needs to work on the amount of salt they put in their food. I know they probably get a lot of customers, who like extra salt on their French fries, but I'm not one of them. The place is relatively clean, and the staff tries to keep it that way. Fountain drink machine, is definitely better than what b-good has, and the food is cheaper. I normally don't mind the stairs, but they can be hell during winter time, with snow freezing over, creating a dangerous environment both for customers and for building residents.", "author": "Vladimir S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-21", "description": "Quite possibly the world's smallest five guys literally stealth opened in Brooklyn Heights. Why in the hell they would open a Five Guys in what can be the uppitiest organic vegan neighborhood I don't know, but I stumbled across the all to familiar sign during a night of boredom.\n\nThe staff here is very friendly and will make sure that you order exactly you want. Why do I say that? Because literally as I opened the door one of the young women behind the counter says \"you having a burger right?\" Now that's what I call service. Not that weak \"Would you like to order\" stuff, a straight up \"You getting a burger today boi!\"\n\nAs for the Bacon Cheeseburger with fries I ordered it was delicious of course - Five guys never disappoints. And they always give extra fries. Like I literally got half a bag of fries. That's love right there.\n\nWhat else can I say. Eat here!", "author": "Richard C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-13", "description": "The cashier Sara. G was a straight up bitch to me and my boyfriend. Completely rude from the start and didn't listen to very well when we told her our order. She added mushrooms when we told her not to, my boyfriends allergic to mushroom and she also put all the fries in one bag which we told her not to because the fries were for separate people. I get everyone has a bad day but who took a shit in your wheaties?", "author": "Marielis G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "The burger lives up to the hype, it really does. I like mind with bacon lettuce tomatoes (I should have said blt) pickles onions ketchup mayo and cheese. This burger is fresh and cooked right to order. Fresh ingredients, fresh buns and burger is juicy. I get it with fries and a vanilla milkshake. The bill is always over $18 but under $20. This place is worth it, I never question the bill. Good eats, eat good.", "author": "Terrance C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-13", "description": "I've eaten at this location before.  Today I ordered a burger and fries for my daughter an myself.  When my daughter was eating there was gravel in her french fries! Gravel! Rocks! I went to the store and all they did was say sorry and that it didn't come from their food.  Which is a lie.  I watched my kid eating and spit out gravel! Will never return to this location again.  The manager was unhelpful.", "author": "Tatiana P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-12", "description": "Came in on a Sunday afternoon before rehearsal I didn't have much time so I needed something fast...! This was just the place. \n\nI ordered the smallest burger they offer and got some fries to share with my guy. Everything here is made to order so your not getting old burgers or fries that have been sitting under a lamp. \n\nWe were starving so while we waited for our burgers we chomped down on the free peanuts... Yum they helped keep the hunger at bay. When our burgers we ready we got them and we were very happy. This location is pretty small but we got there early before all the seats were gone and nabbed a seat overlooking Montague St. \n\nOverall if you are looking for a quick, cheap alternative to your every day fast food this is the joint, great view, quick service and don't forget the malt vinegar on the fries it makes such a delicious difference!", "author": "Melanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-31", "description": "1. This is the best burger in the world that can be bought at a restaurant.\n\n2. The staff are generally friendlier than at most other casual dining restaurants.\n\n3. Fresh cut homemade fries offered with vinegar. This means chippie authenticity. \n\n4. This location actually has decent music playing most of the time.", "author": "Yotam Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-08", "description": "Not bad for a fast food burger. Five Guys offers a bang for your buck. Burger toppings unlimited at no extra cost and the French fry portions are shareable as they fill the bag. Burgers here are pretty good, but a bit on the dry side. My order was slightly off, i.e. a couple of my toppings were missing. Employees here were friendly and the food was freshly made and prepared quickly.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-28", "description": "Five Guys\nNY: Brooklyn: Metrotech\n6:30pm Friday 12th August 2015\nFour Stars\n\nThis Five Guys had the cleanest floor that I have ever seen.  Everyone was polite and threw away their peanut shells.  They have one of those super soda machines where you can get any coco cola product including flavored Dasani water.  They also flavored ice tea in brew containers but they come directly from a pump like the rest of the beverages.  I had a small bacon cheeseburger with pickles, lettuce, tomato, and mayo. It took a while for them to grill it and assemble but it was well worth it.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-11", "description": "very disappointed burger to dry the fries are not the same as before ' meat was over cook almost burned:/", "author": "Jack M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-05", "description": "The customer service here can range from mediocre to terrible. Tonight, when I arrived, one order was being filled. No other customers. I ordered and another customer ordered after me.  The person who took my order went on break or to do something in the back, and the two people also working, completely ignored my order, meaning no one made it. After the person who ordered after me left with her food, the guy in the white shirt (manager?) while sweeping the floor finally noticed I was looking around wondering why nothing seemed to be happening behind the counter on my behalf. He asked my order number. One lower than the  last customer they served. No apology, or anything. Simply told the girl behind the counter to make my order. Which was not swift, at all. While she started the burger, she didn't begin my fries. So after the initial wait, the order took longer than normal. Then, I get it and begin to eat my fries. I open my burger and it's soaked with steak sauce. Great! Except I don't like steak sauce. That's why I didn't order steak sauce. I ordered BBQ sauce. So now I'm writing this while waiting for my order to be filled..\nagain. It's really fortunate my plan was to eat my food here and that I didn't have to be anywhere for forty minutes. I would think, in addition to a big apology, I'd be getting a discount or some sort of coupon at this point. Nope. Burger handed to me across the counter. Not feeling like a valued customer and not thinking I'll come to this location again. I've been coming here on my way to the promenade, before or after church, and randomly when I'm near by for at least six years. When Five Guys was new I thought: this is SO good, the only thing that could possibly screw it up is quality control, or lack thereof. Well... it's certainly getting screwed up. Really sad.", "author": "Kobie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-20", "description": "Got a diarrhea feeling when I'm still in this store. I have a strong stomach and it is totally unusual. Anyway that's just me, be careful ladies and gentlemen. Just in case it happens to you. There's a Chipotle nearby and they'll let you use their restroom.", "author": "Liam L."}], "servesCuisine": "Burgers", "priceRange": "Under $10", "name": "Five Guys", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "138 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/MaqhcMKeIHwWIrswCXtNoA/ls.jpg", "@type": "Restaurant", "telephone": "+17187979380"}