{"aggregateRating": {"reviewCount": 184, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-14", "description": "Sometimes I temp in an office right near the Wall St. station on the 2/3 train.  I usually just eat lunch in the building's cafeteria, because it's cheap and I get to maximize my hour break.  Since the economy is so awesome right now, they've cut back at the caf, which means the guy who used to grill the burgers was replaced by someone who sucks.  They also rarely have their delicious turkey burgers which are a steal at $2.50.  So anyways...this is a review of Five Guys.\n\nI got the brilliant idea today to check where the closest decent burger was and I realized there is a Five Guys in Brooklyn Heights!  The 3 train came right away, I took it one stop, and less than 10 minutes later I was ordering my little hamburger (makes it sound so sad) and regular fries.  I had read that it can get a bit busy in here, so I didn't arrive til about 2.  There was a homeless guy sitting outside the steps when I came in and he asked for some change to get a burger.  \n\nI didn't have to wait to order but I did have to wait a bit to get my food.  Nothing ridiculous though.  I just decided to eat at the bar against the wall since otherwise I would've had to ask some random people if I could sit at the end of their table.  The space is rather small, but the majority of customers were getting their food to go anyways.  The Park Slope location has a lot more tables available if you'd like to be able to sit with a group.\n\nMy burger was cooked well and my fries were tasty, even if there were enough of them to feed an entire family from one of those TLC multiple-birth shows.  I decided to eat my fries with a fork to avoid getting my hands that much greasier.  Some may think that makes me look silly, daintily using my fork to pick up fries one by one, dipping it in the ketchup, and eating them in small bites.  Luckily, I don't eat fries like that.  I get like 4-5 on my fork at one time, slam them into the ketchup, inhale them, smearing Heinz 57 all over my face.  Nah, it's a little bit closer to the dainty way, but faster, otherwise it would take me 3 hours to finish my bag o' fries.\n\nI managed to finish my burger and the portion of fries that I had poured out of the bag (about 2 whole potatoes worth) and still had 15 minutes to spare before I had to be back at my desk.  Perfect timing!  I threw out my garbage and took my now grease-stained fry bag with me.  As I walked back down the stairs, the same guy was still asking for change, so I handed him my leftover fries.  It made me feel like I did a good deed for the day, but kinda in that way that a rich socialite makes herself feel like a good person by talking about that one time that she handed out food at a soup kitchen.  If I really cared, I would've bought that guy a burger.  Whatever, I can make myself feel morally superior to all those people who just wasted their unwanted food by throwing it away.\n\nSo the point is, burgers are good, fries are even better.  Bring someone with you so maybe you can finish one order of them.  Pluses - place is clean and staff was friendly.  Minuses - the guy who was sweeping was all up in my space sweeping furiously under my bar stool while I was eating (minus one star), and like others have said, I now reek of peanut oil.  There's worse things I could smell like though.  I definitely would rather head over here for lunch than most places in the Financial District, so it was a nice change.  For $10 I consumed enough calories to last me until dinner on Thursday - what a steal!  I'll be back.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-03-29", "description": "I hail from California, where IN-N-Out rules the vast western burger landscape without anybody within a mileshot of surpassing its simplicity and taste.\n\nThe keyword here is simplicity. Five Guys attempts to create a laidback, Cali-style burger environment, from the unpretentious decor to its  (relatively) inexpensive prices.\n\nSo you can imagine the look I had on my face when I reached the counter, ordered a bacon cheeseburger, and was immediately prompted to *request* ketchup, and mustard, and relish, and mayo, and lettuce, and onions, and tomatoes. Um, aren't these like a given? \n\nThis isn't create-your-own-salad. This is a burger. I don't want a checklist of 20 items to request, or conversely, leave behind. \n\nThe burger itself was more than acceptable; two juicy (albeit a tad small) patties with all of the works put together quite nicely. As is the case with 9 out of 10 burger joints, the bun was dissed in the process, an afterthought, already soggy and virtually lifeless before bite number 1. Everything in a burger counts, and the bun is almost like the glue that holds all the good stuff in-between together. If the bun sucks, the burger will suffer for it.\n\nSoggy is also how the fries were served. No crunch. \n\nAnd please don't call me a hater. Cuz I'm not. I'm just a burger purist.", "author": "Joseph K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-17", "description": "If I lived above Five Guys, I'd be one of those women you hear about that needs to get the couch surgically removed from their ass.\n\nFive Guys is what I wanted In 'N Out to be.  I didn't know that burger/woman love could be so pure.", "author": "Gina C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-11-26", "description": "I went here last night with my roommate, as I was craving a burger and fries but didn't want to miss any of the Pats-Eagles game by sitting and eating at PJ Clarke's.\n\nI ordered the regular cheeseburger (2 hand-formed patties) plain with just ketchup and a small french fries.  It was absolutely delicious, and they have barrels of free peanuts to snack on while you wait for them to cook it fresh for you.  Speaking of waiting, the downside of getting a freshly cooked, made-to-order burger is that you have to wait what seems like an eternity for them to cook it.  On a Sunday night, there was NO ONE in the place, 5 employees working, and it took close to 20 minutes for my food to be ready.  Granted, this is just a function of getting fresh-cooked food.  It takes time, so I'm not docking them any points for this.\n\nAs good as the burger was, I had high hopes for the fries.  Alas, I was sorely disappointed.  While I do love my fries cooked in peanut oil, these were soggy and flavorless.  I am baffled as to how a company that makes such a delicious burger could have such sad, flaccid french fries.\n\nI think that given where I live, I'll just go to PJ Clarke's the next time I want a good burger and fries.  Granted this burger was a bit better, but PJ Clarke's crushes them on the fries.\n\n4 stars for the burger, 0 stars for the fries.  2 stars overall.", "author": "Jim C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-02", "description": "On a street with numerous sit down dining options, here was an opportunity for something quick and relatively light: grilled veggie sandwich. Odd that its one of my favorite options at a burger joint but it does hit the spot.", "author": "jjj z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "Can't go wrong with this place. Food is delicious and service is speedy. Plus the peanuts are a nice plus post-meal for free. I get the smaller sized burger because the regular sized one is enormous.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-27", "description": "Taking a huge dump right on pictureless John C., who was probably trying to make some sort of snide remark counting the difference between kids and the big boys and also remarking that Washington Magazine rated Five Guys #1 (of course they would; it started in D.C.), I do like Five Guys.\n\nI think Montague in general is such a nice street to walk down, they have just about any kind of general thing that one would enjoy seeing but not be too bombarded with on a Sunday afternoon. I was thinking about lunch a couple weekends ago, and continued to think right as I walked out the door in the middle of the afternoon, to go grab some groceries. I had forgotten Five Guys perched right on Montague before you hit the Key Foods. \n\nMy former colleague at New Line use to rave about Five Guys; when I said they were coming to Manhattan he, usually stoic and fairly mean-spirited, lit up with unusual happiness. He was from D.C., and he said Five Guys was awesome.\n\nNow there are a lot of chains that do their niche well; we don't hate chains because of their product necessarily, it's just that the product is mass produced and mass marketed which brings up a whole slew of aspects to a capitalist equation. I think Five Guys is good in my book, probably because they give you the brown bag of overcooked fries that they would like to tell you came exactly from potatoes grown in bla ba dee bla. I liked the fries; they were kind of monstrous and ugly and you felt like you shouldn't have gotten the burger because a small order of fries was enough to send your ass packing. \n\nSo when it comes to burgers, I say to hell with Good Burger even more. Five Guys is juicy, and comes with some nice toppings. Yes it seemed smaller than I thought, but it was filling, the bun was nice, and I think it was worth the 10 minute wait. Free refills on sodas are an added bonus. \n\nFor this particular Montague branch, it's oddly pretty huge but there's no place to eat, a few stools by the window which was covered so much I barely could get a good view of the street (it's the upstairs portion of the retail space). 4 workers who just seemed really bored (it was a Sunday afternoon), and a dude who went up to the register I don't know, 4 separate times to either complain about his order or to order more stuff, which seemed so odd.", "author": "Victor L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-22", "description": "I really wanted this to be my neighborhood burger place.  I found it on Yelp and was excited that it was cheap, tasty, and close to my apartment.  As I entered,  the white and red checkered tiled walls and counters brought me back to wonderful fast food experiences at In-N-Out and many other great 50s style diners.  However, the burger was a far cry from any of those eateries.\n\nI got the bacon cheeseburger with grilled onions, grilled mushrooms, and barbecue sauce.  Sadly, it was just a step up from something you could get at Carl's Jr., Jack-in-the-Box, or any other fast food chain.  The patty did not taste fresh, and the cheese tasted like a generic version of a Kraft single.  The only thing that keeps this place from getting two stars are the fries.  Those were delicious, and they give you lots of them.\n\nThe other annoying thing:  my meal with regular fries and a regular soda came to a little over $13.00.  Granted, I did get the largest burger, but I was hoping to walk away spending less than $10.  \n\nMaybe I ordered the wrong thing?", "author": "Daniel F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-06", "description": "Juicy fresh burgers, made to order with all the toppings you want.\nIf you say \"cheeseburger\" you get a 2 patty deal, so if you want a \nregular sized cheeseburger you gotta say \"little cheeseburger\"\nand that means one patty.\n\nThe fries come overflowing in a cup, served up piping hot. They\ncut them thick, so if you like steak fries you are in luck. \n\nThey list the calories on the menu - so brace yourself, but bite in\nand enjoy!! It's worth it.", "author": "Andrea C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-28", "description": "Excellent burgers at a good price!  Definitely, the single (\"little\") burger is plenty.  The best part is that anything you can think of (fried onions, sauces, etc.) is free.  That's how it should be!  \n\nThe peanuts are good (I did try them) and the fries are great (though nobody should be eating a whole regular order themselves).  \n\nI didn't try the 'dogs, but a friend who has added Five Guys, in rotation, to his steady diet of Chipotle, says they're good.  \n\nAlso, free refills.  Yummmm, too much Diet Coke while eating peanuts.", "author": "Katharine H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-24", "description": "The East Coast's answer to In-n-Out in burger supremacy.\n\nThe burger? Double stacked, free toppings -- except for cheese and bacon. My favorite iteration: bacon cheeseburger, fried onions, extra barbeque sauce, regular drink, and a regular order of Cajun fries. \n\nCan we just talk about those fries for a bit? I don't know what constitutes that seasoned salt but I want. To put it. On EVERYTHING. (Just imagine the seasoned salt with Pommes Frites fries and then dip away... I'm sure I just made you drool a little.)\n\nFree refills on drinks! Polite fast food workers (for realsies!)! Clean bathrooms!\n\nFor a low key time on Montague, window shopping, pre- or post-promenade. It's just up the steps from Henry Street.", "author": "Miguel d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "Love this place! We usually order of the internet and they have it waiting for us piling hot in 5 minutes. The fries and always fresh and the burgers are always delicious. I think the one downfall and it is not a big one, is I think they use canned mushrooms, other than that this place is great! You have to be willing to pack on some pounds by eating here!", "author": "Aimee M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-28", "description": "Being from California, land of burgers and drive-throughs (IN-N-Out, Fat Burger, Tommy's, to name a few), I've been disappointed with the burger situation here in NY.  I'm not a big fan of the NY style burgers with meat that is thick as they are wide.  \n\nFive Guys Burger is as close as I found to a California style burger.  The meat was not frozen just like In-N-Out.  French fries are made from real potatoes, with its skin still on, not from processed potato.\n\nOne thing, I don't understand is why all these people think the food is cheap here.  $5 for a burger seems quite high to me.  On the otherhand, you can pretty much pick whatever topings you want (including fresh jalepenos, mushrooms, fried onions, etc.).  Also, although fries are expensive ($5 for large), the service size is huge and can easily serve a party of 4.\n\nAs for the burger, keep it simple.  I got the junior cheese burger (1 patty instead of 2 for regular) with ketchup, mustard, lettuce, tomato, onion and jalepenos.  \n\nIf this place was in LA, it probably wouldn't get more than 3 stars, but given the competition, I give it 4.", "author": "Jin K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-21", "description": "Stop stop stop with the In-N-Out comparisons. Just stop. I dunno which In-n-Out you kids went to, but I have never lived further than 3 miles from an In-n-Out for 23 years of my life and I can promise you that these two should absolutely not be compared.\n\nFor starters: I can get a 4x4 monster with an order of fries from In-n-Out for the price of a normal burger here. Secondly, how can you compare In-n-Out's special spread to ketchup, mayo, or hot sauce? Then there are the fries... are you really going to compare In-n-Out's terrible, thin and soggy fries (I always have to order mine double fried) to this place's nice and crispy thick style fry? And, lastly, how can you compare In-n-Out's delicious milk shake to anything this place has to offer? I hate to break it to you, but this place and In-n-Out do not belong in the same burger/shake/fries category to even start a comparison.\n\nNow, that's not to say this place is bad. The burger was good. My lettuce and tomatoes were fresh. The buns were nice and toasty. The patties are a bit plain, overcooked, and not very juicy for my personal taste. The cajun fries were very good. We split an order of fries four ways -- something you could never do at In-n-Out. \n\nAnd the best part was the price. Though pretty expensive compared to Socal standards (Tommy's, In-n-Out, Fatburger, etc) the burgers at this place were very reasonable compared to the competition (Burger Joint, Goodburger, Shake Shack, etc) and of the other burger places, this is probably the only one I wouldn't mind making a habit out of.\n\nNonetheless, I'd be doing my Californian upbringing a disgrace giving this place four stars. if I could, I'd give it 3.5. When I want a great shake to go with my burger, I go to Shake Shack. When I want a thick, juicy, perfectly cooked burger, I go to Goodburger. When I want a \"special occasion\" burger to eat with my tourist friends, I go to Burger Joint.\n\nBut when I just want a reasonably priced burger and some great fries without breaking the bank, I'd come here.", "author": "Mathew T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-08", "description": "I've yet  to have a bad experience with Five Guys.  This location is certainly no different although quite a bit larger than any of the other Five Guys I've been to, no doubt due to its location.  Right in Metrotech, this place serves all the students, finance guys, and insurance people since JP Morgan and AIG is literally right around the corner.  Burgers made to order, have as many toppings as you want, and a regular order of fries big enough to sh are.  Eat it, love it, and come again.", "author": "Phil L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-05", "description": "Oh my dayum. The best burgers in the world. Fresh meat, perfectly fried bacon and a whole world of toppings make this burgers an incomparable gastronomic experience. Everything accompained by the best real french fries you will find for this price. Get some free peanuts if you want. I usually spend 15 bucks for a hole meal. If you are up to classic rock, enjoy the well selected tracks of their radio", "author": "Rafael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-12", "description": "After waxing poetic on the burgers at diner and union square cafe, I figured I oughta at least review a bonafide burger joint.  And granted this is technically a \"fast food\"  burger joint, and so it wouldn't really be fair to compare their burger with the super thick mega burgers served by proper sit down restaurants.  That being said, the burgers here are double patties!!  That's the standard.  You don't pay extra for that or for the multitude of toppings they offer.  The fries are great (fried in peanut oil--yes this place is one big peanut allergy waiting to kill someone) too.\n\nNot quite In and Out (so calm down you diehard Californians), but hey, I also don't get bible verses blessing the bottom of my drink so it's all good.", "author": "Joan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-10", "description": "To say this place is the best burger place in brooklyn, is a mega understatement. The place is super clean and the staff is friendly. Now the burgers, oh god are they good....... no wait good is not the word to use, amazing is the word. \n\nThe burgers are amazing, and the fries are crispy on the out side, and soft in the inside. The price is just right for the amount of food they give, witch is a lot........ trust me if i say its a lot, its a lot. \nI'm a big guy and anytime i leave a restaurant extremely full its because they served a lot of food.", "author": "Juan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-22", "description": "Five Guys is great.  I'd say 4 stars generally, but an extra star for this one.  This location is special for a few reasons...which is why it gets its rating.  First, it's pretty much one of the only quick, viable lunch options on Montague Street (Chipotle being the other one).  In fact, it's also probably one of the only VIABLE dinner options on Montague.  Honestly.  This street is terrible for food (go elsewhere if you want a nice dinner).   Only banks, shoe stores, and realtors populate this street. Secondly, this place was actually OPEN during the Great Blizzard of this year.  I was desperate for food.  There was like 2 feet of snow outside, and Fives Guys was still open!  So mad props to them!\n\nAs for the food...well most people know the deal.  Good to great burger.  I think it's a bit on the pricey side, but I guess you're paying for the quality.  The cajun fries are delicious, but they're not worth getting unless you share it with someone else.  The portions is honestly TOO BIG...and plus, you'll probably get some nice blockage in the arteries as a result.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-18", "description": "If you're even thinking about going to Five Guys, you're probably not in the market for a healthy, holistic meal -- so let's not judge it on a scale of nutritious.\n\nTo put it simply: good prices, great food, fantastic portions.\n\nThe burger meat is never frozen, so it's freaking delectable.  And you can put almost anything (or everything) on it.  The fries are absolutely delicious, due in no small part to their being fried in peanut oil.  You can definitely sense hints of it in the finished product, and it adds something really tasty.  Beware of OD'ing on the fries, though, as a size small comes in a little brown paper sack.  It's a greasy dream come true.\n\nDefinitely the best food coma-inducing bang for your buck.", "author": "Caitlin G."}], "servesCuisine": "Burgers", "priceRange": "Under $10", "name": "Five Guys", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "138 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/MaqhcMKeIHwWIrswCXtNoA/ls.jpg", "@type": "Restaurant", "telephone": "+17187979380"}