{"aggregateRating": {"reviewCount": 184, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-02", "description": "Its a good joint! Love the burgers they are as good as people say they are. I still prefer In-N-Out over them but in the NYC area this is the best \"fast food\" burger.", "author": "Chuck M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-21", "description": "Easily my favorite burger in the city, yet (I haven't tried Shake Shack yet, though).  I love how the fresh patty is smashed onto the griddle, giving it a juicy interior, with a nice and crusty exterior.  All the topping options are great, love every single one of them.  Price is a tad high, but hey, this is one the best burgers in the city.  I try not to crawl here too often though since it's not one of the healthiest meals, but I will go here when there's nothing to eat.", "author": "Minh L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-11", "description": "It'e a pretty good burger.  Not spectacular, but a yummy choice when your hungry and you want a quick fix.", "author": "M F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-20", "description": "The burgers here are very tasty and made to order with all the fixins you want.  The fries are made fresh on site and the potatoes are from different regions which they post.  They give more then a generous portion, so always order the small.  While you wait for your freshly cooked burger, they offer free peanuts which you'll see other patrons already eating.", "author": "Thomas L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-06-22", "description": "First, any place I can NOT order a burger to temp.(medium rare) is NOT a real burger place, but just typical junkie fast food.   Also the burgers are all cooked WELL DONE...  the management refused to cook a burger under WELL DONE and said that it was still juicy... um... a well done burger is a hockey puck no matter what, hence the well done nature of the burger.\n\nANd the bun SUCKS.   REALLY the WORST I ever had on ANY burger. .   \n\nThe ONLY redeeming factor is the fries but ONLY if you ask the guy working the fryer to make sure the fries are crisper or you get grease mops.    I would much prefer the diner or across the street from the five guys in BH to 5 guys.", "author": "J B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-06", "description": "Ate lunch in there again the other day (oh, man, wish I had some right now) and I noticed a sign posted in the window saying that if you need assistance getting a stroller up the steps, to call them and they'll help you.  So that solves the problem of stroller access.  Unfortunately, it seems like folks using wheelchairs are still out of luck.", "author": "Sonja B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-06", "description": "Good find with decent service. Like most burgers, theirs starts off very well but tethers toward the end as you can barely finish the two patties stacked up on top of each other. I mite suggest getting the small burger instead but at the minimal price difference you might as well take your chances getting full with two. \n\nA large fries will run you 5 dollars but should feed 3 or more people. Peanuts are novel idea but will just make you more full in the long run. \n\nAll in all, great find for the area but possibly not worth the hassle of the travel if you don't live in Brooklyn or lower Manhattan.", "author": "Matthew K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-12", "description": "I crave these burgers all the time!!! I could actually use one right now, little cheeseburger with lettuce tomato ketchup mayo pickles grilled onions and grilled mushrooms. SO GOOD!! The cajun fries are insanely addictive, and a small order can be shared btwn two people. Also their little cheeseburger is the size of a regular one so you should keep that in mind when ordering.", "author": "Sam B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-19", "description": "LOVE this place... burgers are great and so are the fries (especially the cajun fries!).", "author": "Kimberly L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-01-19", "description": "I don't get the appeal of this place.  Maybe it was too high expectations that drove me to think this place is just OK.  The burgers and fries were just ok, nothing exceptional.  And it is just a bit overpriced.  I have to admit that I love eating all the peanuts though!", "author": "Michelle N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-21", "description": "so there are too many fries? order a small and be happy they used peanut oil. too expensive? how much is a burger with less flavor at Zaitzeff? \n\nit's dang good here. consistently dang good. go to manhattan. go to bethany beach delaware. juicy,beefy,  flavory, consistent goodness.\n\nsloppy and packed with whatever you want - i get the 2 patties and everything, cause i can. and it is amazing. and how crispy-right is their bacon? perfectly perfect. it is not a double-double animal style, but pretty close to what they got - but really, i enjoy it more...\n\ncheck out my gluttony at: http://www.youtube.com/watch?v=UFFPGkG_a6E", "author": "matt s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-13", "description": "clean,pricey for a burger and fries and a drink 14.00..but pretty good..there are better burgers for the money", "author": "Scott M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-22", "description": "before the came into NYC i was up on this stuff. good food!! now they got more locations opening up. This location is better, the promenade is right there.", "author": "Drew M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-16", "description": "I've heard about this place numerous of times and I have finally gone to see what the hype is all about. Right down the block from my school, I decided to check them out. WOAH! Ok so I saw that there was a lot of options to choose from and immediately I felt like Lebron James during the Finals 4th quarter and 20 seconds on the clock! Talk about pressure. But anyway I asked for a cheeseburger with ketchup, mustard, and tomatos with fries. By the way love the fact that they serve beef burgers ONLY. An all American girl like me appreciates a good beef burger. So finally getting my meal and then opening the foil, the first thing to come out my mouth was DAMN. I had to look at the receipt again to make sure I ordered the right thing. The cheeseburger turned out to be TWO meats with cheese!! I was afraid to bite but so glad I did becasue it was THE most juicest thing in the world. The bread was so soft and the fries that was given in a brown bag overflowing with fries all over the place, was fried in peanut oil[a favorite of mine]and was soft but crispy. I was so satisfied that I told everyone about it when I got home and woke up the next day wanting to go back. Yea it cut into my losing weight plan I'm going through BUT it was worth it! Thank you guys for satisfying a hungry college student's appetite:)", "author": "Tanzania C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-14", "description": "After a little disagreement my fiance and I came here to grab a couple of burgers.  2 cheeseburgers, two orders of cajun fries, and 2 drinks= 25.00. Kinda raised our eyebrows but grabbed a table and waited for our order. Once our food came out, all was well. Burgers were slammin! fries were bangin! This was the first time he and I finished our food at the same time. I usually take small bites and get full half way through but there I was keeping up with his pace and taking bites big enough to blowfish my cheeks. The cheeseburgers are actually two patties, so I assume a \"small\" cheeseburger is a single patty. Trust me, get the double For the amount of calories and fat content, go big or go home! oh, and they use peanut oil...yes, the same kind of oil MickeyD's used to use back in the day when their fries were addictive. We both agreed to limit our visits here to once a month or less. Its a treat, not a habit type of place.", "author": "Monique M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-10", "description": "Went back yesturday and once again I fell in love it really is fresh pipping hot fries that taste great and the Bacon cheese dog was great and while you wait you can eat some free peanuts to me its a win win situation a real must go", "author": "joseph p."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-07", "description": "Twice as expensive as Jack-in-the-Box, and half as tasty.", "author": "Jake B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-19", "description": "Being from California, we were looking for something to replace our craving for In \u0026 Out and we actually ended up preferring this over it! The food is beyond delicious. Definitely the best burger my girlfriend and I have ever had and we can't wait to go back! It's a nice little joint, on a nice quiet street, with their signature red checkers on the wall, friendly staff, and a very clean interior. We were surprised to walk in to find that they stored bags of potatoes around the eating area, but then noticed that they all had today's date on it, so maybe that's just a tradition to show freshness because their was also a sign on the wall that said \"Today's Potatoes are from: Idaho\" No other place around Manhattan or Brooklyn that we've found has Raspberry Nestea and they had it which just made it even better. The fries are almost sweet and so fresh tasting. We even got a side of Malt Vinegar to spice up the fries and that was out of this world. They even have free peanuts to eat while you wait and watch them cook your meal. The only negative light I see on this place is their lack of branding (which doesn't seem to be hurting their business AT ALL) and identity as far as overall presence as a franchise, and in their food packaging. They have no distinct logo except for \"5 Guys Burgers\" written in a more than average font, which was on the cup, but the food was served in a brown paper bag, and the fries in a styrofoam cup. I also wish that they had some desserts or shakes, but I really can't complain. Regardless, this food was insanely good and if I could I would give Five Guys 6 stars.", "author": "Matt C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-21", "description": "I'm a big fan of their burgers.  They're definitely messy and you can tell they're unhealthy (along w/ the unhealthy fries).  But I love they're pretty darn delicious.  The portion of fries you get is also gigantic (though it costs $3.25 for a \"small\" fries).  If the prices were cheaper, it would get 5 stars from me.  That said, it's a really tasty burger and I really like their fries too.", "author": "Kevin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-23", "description": "my favorite fast food burger, hands down.  in and out?  doesnt' compare.  fives guys is the absolute shet.  it'll kill you though, how unhealthy the burger is...but who cares??", "author": "Joe C."}], "servesCuisine": "Burgers", "priceRange": "Under $10", "name": "Five Guys", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "138 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/MaqhcMKeIHwWIrswCXtNoA/ls.jpg", "@type": "Restaurant", "telephone": "+17187979380"}