{"aggregateRating": {"reviewCount": 184, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-20", "description": "I was happy to discover this place.\nThe burgers are very good but the endless toppings make it great. I would get a bacon cheeseburger with grilled mushrooms and onions, ketchup, mayo, lettuce, tomatoes.. French fries from Washington State. The burgers automatically come double. Not to mention free peanuts while you wait. Grab a bag and eat it on the promenade. Amazing.", "author": "Todd S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-20", "description": "I absolutely love five guys and their burgers, the neighborhood it's in is great and close to shopping and the movies and even more good areas and even the promenade. The only downside it's that I wish they had more seating and that there was a way to make it wheelchair accessible.", "author": "Chrissa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-27", "description": "I love them here. I can order via phone, walk over and my food is ready!! Plus they have a million bottles of malt vinegar for me to douse my fries in. Beware the hike up the millions of metal steps in front, not stiletto heel friendly...not that I know from experience. I take a brisk walk over here in sneakers!", "author": "r b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-26", "description": "It's a burger place, what can I say... Burgers are juicy and tasty, fries are very good. Cheap, quick and TASTY fix for lunch!", "author": "Ozlem o."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-23", "description": "lately, i've been having a bit of a burger-resurgence. i crave them all the time, which hasn't happened to me in a long while. i was feeling depressed the other day and a friend cajoled me to take a walk to brooklyn heights for some five guys action. and since i'd never been, i complied, though somewhat begrudgingly. the burger was absolutely awesome! i love that any toppings you want are free....and though they did forget the bacon, they remembered the fresh jalapenos and pickles and bbq sauce so i cant be too distressed. the burger is the perfect size....filling but not omgz im gonna go puke filling. and the fries were excellent....a heaping portion, not greasy, thick and very satisfying. five guys is an amazing quick lunch/shopping lunch/diet cheat lunch option.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-09", "description": "It's not In-N-Out, but it's yummy anyways. Enjoy the Cajun fries, grab a few in-shell peanuts, and be sure to get grilled onions and barbecue sauce on the burger because, well, you can! For no extra charge! Bonus points if you take it out to the promenade and eat it on a bench looking at the Manhattan skyline.", "author": "Laura D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-04", "description": "Five Guys is simplistic.  You order a burger or a little burger, specify the toppings you want, and add fries and a drink if that's your speed.  There aren't 87 different types of burgers, cause if you want one of those 87 types, you can just ask for the things that make it up.  They also do hot dogs.  It's not on the menu but they will do grilled cheese as well.\n\nThe burgers are made of fresh, not-frozen, beef.  The patties are small-ish, but the normal burger is two patties, with a \"little burger\" being one patty.  The bacon is generally really crisp.  Everything is very fresh.  You really can't go wrong.\n\nThe fries are cooked in peanut oil, so while they maybe aren't \"healthy\", they could be much worse.  They taste really, really, good.  If you don't like thier fries, then you don't like real fries.  I'm told the cajun fries are really good, but I'm kinda boring and like the regular fries.  A sign tells you were the potatoes came from, and you can verify this for yourself because the bags of them are stacked next to your table when they have just received a delivery.\n\nThere are open boxes of peanuts in the shell that you can eat while you wait.  Yes, you drop the shells on the floor, that's how it's done.  People with peanut allergies might want to beware of this.", "author": "Wook M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-10-11", "description": "This was the first of two Five Guys to come to Brooklyn. I absolutely love their burgers and fries. So damn good, especially to help with a hangover. Greasy goodness, and a big soda to wash it all down. I usually grab a hand full of the peanuts on the way out.", "author": "Andy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-03", "description": "Five Guys just opened in Brooklyn Heights.  It's basically burgers, dogs, and fries.  Everything is fresh and delicious.  You can get a single or double burger and choose your own toppings.  They have malt vinegar for the fries which I always get excited about, and they give you peanuts while you wait.  You have to order your own food to either sit down with or take out, no table service.  It's really really good, so go try it.", "author": "J K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-26", "description": "While the food is terribly unhealthy, I have to admit, if you want to cheat a little and indulge in a good burger and fries, this is the place to do it. I have been to three different locations and the service is immensely wonderful and refreshing.", "author": "Bob H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-15", "description": "The prayers of In-N-Out fanatics may have finally been answered (well not quite answered but at least they may have been acknowledged) with the arrival of this hamburger haven. Like the beloved West Coast franchiser, this D.C.-based chain uses only fresh--never frozen--ingredients. You may always have a soft spot in your heart for the French fries at Mickey D's, but when it comes to cheap, fast food style burgers, The Golden Arches ain't got nothin' on the Guys. So what do they taste like? Well, with no disrespect to McLovin' fans, picture what a Big Mac would taste like in heaven.", "author": "Kimberly M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-15", "description": "It gets expensive when you add on the fries and drink, but it's the only fast food place I will eat a burger from.", "author": "John H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-04", "description": "Pros:  Totally customizable burger.\nCons:  The franchises are not nearly as good as the DC area originals.", "author": "Aaron Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-21", "description": "The best part of Five Guys is the genius idea of having a layer of chopped up bacon on their bacon cheeseburgers instead of a few strips that you just end up eating right away because they slide out.  I wish I knew that the regular burger has two patties because one would be enough for me.  The burger was delicious and we didn't have to wait long.", "author": "Jennie A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-12-16", "description": "The food OK but a cheeseburger was $9, coke for $2 and fries were $4.99. The help all look like gang bangers and the managers looks like he just ate too much. Eat at your own risk!", "author": "Yimmy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-13", "description": "Yes the burgers are good, but service during peak hours is super sloooooow. Go on an off hour and have a \"little\" burger... two dollars cheaper, and the burger is far from little.", "author": "Adrienne P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-24", "description": "Food: Freshly cooked burgers with tons of toppings to choose from. I'm a fan of onions so I always get the grilled AND fresh onions, make sure you confirm this with the cashier before walking away. They always assume you messed up and the second choice of onions is replacing the first choice. It be better with a more varied cheese selection. Anyway, as you wait for your freshly prepared burger crack open some complimentary peanuts found in a huge wooden barrel. Fries are made from fresh potatoes and they stuff your lil' brown bag with 'em. Seriously they do, the fries are flowing out of their container like how a fat chicks gut flows out of their size 0 jeans. Then they top it off with another scoop of fries straight into your bag. Mmmmh maybe it's because of all these extra fries that we have so many muffin tops. Ima start lopping of stars on my reviews from places that serves hefty portions. \n\nDrink: Fountain soda + refills. You'll need it.  \n\nService/Ambiance: They take your order and hand you food, somehow In-n-Out does this friendlier. Must be the Cali sun.", "author": "Leo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-29", "description": "Out the 15 or so burger spots that have opened in New York in the past 3 years, this place is the best. The burgers are better than shake shack, good burger, better burger, burger company, brgr,  Better than the 40 dollar Kobe burger I had in Las Vegas.  The give a enormous amount of fries AND THEY HAVE THE FOUNTAIN DRINK MACHINE OR FREE REFILLS! This place is a dream.", "author": "Matt T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-06", "description": "Probably not the healthiest lunch you can have, but it's fast, tastes great, and is consistently well made.  Go with the so-called 'small' burger and fries - unless you've truly got a gigantic appetite, it's more than enough.  Even though everything's made to order, my food's always been ready in less than 5 minutes, even during the lunch rush-", "author": "Lucien V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-14", "description": "Overrated. The burgers are ok, but I don't understand all this infatuation with the fries.", "author": "Clément G."}], "servesCuisine": "Burgers", "priceRange": "Under $10", "name": "Five Guys", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "138 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/MaqhcMKeIHwWIrswCXtNoA/ls.jpg", "@type": "Restaurant", "telephone": "+17187979380"}