{"aggregateRating": {"reviewCount": 184, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-09", "description": "This place is a few blocks from my apartment*, and I am now, officially, a Five Guys addict. Lunch, dinner, snack, breakfast, who cares! Is there ever a wrong time to pursue obesity?\n\n(*) Naturally, when I say a few blocks, I mean twenty. But every greasy brown-bagged visit is well worth it.", "author": "Brian L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-19", "description": "This food is amazing! FINALLY somewhere that is NOT overrated...this was even better than I was expecting! Definitely the best burger my boyfriend and I have had in NY and we can't wait to go back!\nFirst off, the hamburger was SO good. The fries are almost sweet and so fresh tasting, you could actually taste the potatoes. They also have Malt Vinegar there to spice up the fries and that was out of this world. Also, I can't seem to find anywhere that serves Raspberry Nestea and they had it here which just made it even better. They even have free peanuts to eat while you wait and you can watch them cook your meal, although neither one of these benefit applied to me. I did find it a little odd that they served the food in a plain brown bag and the fries in a styrofoam cup. I also wish that they had some shakes, but I was just as happy with the raspberry iced tea! \nAmazing Amazing Amazing", "author": "Andrea C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-17", "description": "Finally got to check this place out while on Jury Duty.\n\nPretty good burger and I like that you can add all the toppings your heart desires.  Fries were slightly bigger than I prefer.  Some maintained their crunch; others did not.\n\nNot worth the price and hype.  Small burger, too many fries, and you have to order everything separately (no combo deals).", "author": "Rubie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-14", "description": "All time NYC fave", "author": "Sean R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-08", "description": "Came here today with a friend...\n\nPros: Unlimited topping on your burger\n           Free Peanuts\n           Delicious fries!!!\n           \nCons: low grade beef\n            Soggy bread\n            5.99 For a Big Mac Size burger with no sides or drinks\n            large amounts of boxes stocked in the dining area", "author": "Michael J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-05-22", "description": "I have nothing else to say about Five Guys that hasn't already been said, except to quote Tom Petty:\n\nOh, my my!\nOh, hell yes!\nTime to put on that party dress!\n\nI may have to marry all Five of these Guys.  Maybe polygamy isn't that bad.", "author": "Alice M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-08-13", "description": "I was waiting for my friends outside the Sprint Store this weekend and I was quite hungry because I hadn't had lunch.  I looked up and saw awning for \"Five Guys\" and decided my friends can wait since they've made me wait.  I didn't know what to expect because I never heard of this place (I originally thought it was a deli).\n\nBurger Joint?  Cool.\n\nBetter than typical fast food fair (BK, McDs, Wendy's, other refried crap), it's probably comparable to Better Burger, but much better (not sure if I meant that as a pun).  The place keeps it simple: Burger, Hotdogs, Fries, and the toppings that come with.  The end result?  Fresh quality burgers and dogs (I didn't try the fries, trying to lay off the 'tatoes).  \n\nOh, and they have free peanuts for some reason (strange gimmick?).  I didn't try those either.\n\nCheap high end fast food, it's about time.", "author": "Anthony Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-10", "description": "Perhaps my burger palate is a little more refined than most (perhaps it isn't?), but as far as I'm concerned, there's nothing special about Five Guys burgers.  When I order a burger, that's what I want...I gauge a good burger place by by the quality of the beef and how my burger tastes, not by how many toppings I pile on top of it.\nDon't get me wrong, its not a terrible burger, but its not a great burger either.  When I'm in Brooklyn Heights, I might drop by.  \nFor my money, In-n-Out, Corner Bistro, Royale \u0026 Daddy-O all make a better burger.  \nI think good burgers are about consistency and the burgers at Five Guys have been consistently mediocre.  \n\nn.b. I don't want to get into a big thing here, but the only way you could give this place five stars is if you grew up on the moon or in a vegan household...they're REALLY not that good.", "author": "E W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-04", "description": "This place is a great little joint if you're in the mood for a greasy burger and great fries, but don't want to go the typical fast food route.\n\nTheir burgers are a definite step up from McDonalds, but are still true to their so-greasy-you-can-see-through-the-bag roots.  They offer malt vinegar for the fries, which is the mark of a good burger place in my book.\n\nThe price is a little steep for a simple burger and fries, but they taste great.  Careful, this place can turn into a high school (and middle school) hangout Friday nights.", "author": "Andy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-08", "description": "A decent burger that comes with plenty of free toppings. The fries are ridiculously big.", "author": "Mark G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-16", "description": "I don't see the big deal.  The burger's are huge, yes, but I feel that quantity over quality comes into play.  It was good, yes, but not great.  They give way too many fries though.", "author": "Christopher N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "These Guys consistently shake my shack. Don't know why the foodie community doesn't get behind what is really obvious. Just because it is a chain doesn't mean they aren't doing it right. Shake shack is really not even in the same league, except for the fact that they have shakes, hence the missing star from my five guys review. The only reason I can think that they haven't added shakes to the menu is that their restaurants are not equipped with freezers, which is testament to the freshness of their products. So if being down with Danny means that much to you, I'll wave to you as I walk by you standing in a pointless line on my way to NYC's most consistent traditional American burger, suckers.", "author": "Jack D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-20", "description": "i LOVEEEEEEEEEEEEEEEEEE Five Guys! I think they seriously sprinkle crack on their burgers. One thing to keep in mind that the \"burgers\" are actually double burgers while the \"little burgers\" are actually normal size single burgers.  I suggest getting the bacon cheeseburger with: lettuce, tomato, pickles, raw onions \u0026 hot sauce (they use franks red hot).", "author": "Michael N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-17", "description": "If you're planning on going to a restaurant in Brooklyn Heights and ordering a burger, save your cash and just go to Five Guys. Burgers here are leaps and bounds above anything you'll find in nearby locations. The fries are top notch, and come in generous portions. Tip: get the little burger and split fries to save scratch. It's still plenty of food.", "author": "Marc M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-15", "description": "They should have a veggie burger option. You pay the same price for stir-fried veggies as for a burger. The delicious fries and free peanuts make up for that  though.", "author": "Katie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-08", "description": "The burgers are good, as are the hot dogs. Lots of toppings to choose from, which is nice. juicy and greasy in a good way. The fries are just ok, kinda soggy. The give you an insane amount of food. They have regular and large fries and the regular is enough for 2-3 people, seriously. HUGE portions. The burgers are large too, but you have the option of a \"little burger\". Don't be fooled, this is not a slider, it is a decent sized burger. \n\nThe place does get insanely packed but they work efficiently. You may wait a long time but they are honestly working as fast as possible. They serve peanuts in the shell while you wait which is a little strange but a nice touch.", "author": "Kelly B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-24", "description": "Best of the fast-food burgers -- by far.  Long lines sometimes, so have a back-up plan just in case you dont want to wait...", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-31", "description": "I spend a lot of time in Brooklyn Heights and this is one of my favorite restaurants. One of the biggest factors that sets it apart is customer service. The employees are kind and friendly, and do their best to meet any requests made. I genuinely cannot remember ever receiving service without a smile. The food is good considering the price. The portions are very large (an order of French fries almost fills an entire paper bag) and the food itself is filling. Because of this, I recommend being very careful when ordering. If you order a burger, you will receive two patties instead of one. For a smaller portion you should stick to a \"little\" burger instead. Overall, Five Guys is an inexpensive and tasty way to enjoy burgers and fries.", "author": "Tyler R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-01", "description": "First FIVE GUYS location I ever went to, and became a huge fan of it! Excellent burger \u0026 fries, and made to order which is awesome!", "author": "Matt P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-20", "description": "Made to order burgers, delish fries and great service", "author": "Shaq D."}], "servesCuisine": "Burgers", "priceRange": "Under $10", "name": "Five Guys", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "138 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/MaqhcMKeIHwWIrswCXtNoA/ls.jpg", "@type": "Restaurant", "telephone": "+17187979380"}