{"aggregateRating": {"reviewCount": 184, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-19", "description": "Good and fresh!\nJuicy burger with free toppings!\nFriendly staff!\nLove it!", "author": "Juno W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-11", "description": "I was expecting to have really good burger but I think I can get a better one somewhere else, I had last time here but I don't feel the same quality '", "author": "Jose M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-31", "description": "I often heard good reviews about Five Guys. So my friend and I gave it a try.\n\nI ordered a bacon burger with grilled onions and tomatoes, with regular fries. I would've ordered a drink if the soda wasn't stale (at that time). Luckily, the workers reminded us of that. I got LOTS of fries. The burger was meh. I think I should have settled for the cheese burger. There was like 2 small strips of bacon in there, and they weren't even that good. I got raw onions instead of getting them grilled. My nose was on fire. I think going to Shake Shack would've been better...\n\n\nFortunately, the workers there were very nice and social. One of them even complimented my dress haha", "author": "Ling M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-20", "description": "I will never understand why or how this chain is so popular in the East Coast. Just glad there are better options to choose from. \n\nKatrina R. here says there's \"NOTHING wrong\" about Five Guys. I can agree with that. \n\nNothing wrong...\n \nThey just serve your average fast-food style burgers: dry, flattened, overcooked meat discs haphazardly layered with lettuce and tomato. Throw some cheese on it, too, if ya want. Oh, and the store-bought sesame buns? Nothing wrong with those. I can make burgers like these at home AND make them how I like them AND not feel gross afterwards.\n\nMost overrated burger chain in the US. The fact this place is said under the same breath as In-N-Out to some is dumbfounding. I'm just relieved the West Coast isn't exposed to the overrated tripe Five Guys creates. \n\nThe workers here were nasty, mean college students who clearly just wanted to get off their shift. \n\nNEVER. AGAIN.", "author": "Scott G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-05", "description": "I had a little cheese burger with mayo, ketchup, lettuce, pickles, and grilled mushrooms and the burger tasted really good! Very filling! There's a variety of toppings you can add for free. I also had a regular fry on the side which was too large for me so I had to share. There was nothing amazing about the fries, maybe I'll try the cajun fries next time. Definitely worth to go try.", "author": "Ashley H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-12", "description": "I ordered a bacon burger from this place and was underwhelmed.\n\nThe patty was dry and overcooked and devoid of any seasoning. No salt, no pepper, no fat. I wasn't expecting medium-rare, but they certainly got grill-happy with this one. The only choice of cheese was American, so I opted out. The bacon was also burnt to a crisp and contributed no flavor to the overall experience. The bun was plain toasted white bread with sesame seeds. The choice of toppings were nothing special- pickles, mayo, ketchup and iceberg lettuce. \n\nIt's basically the kind of burger you get at a school picnic, when you're 6 years old and haven't yet developed a taste for good food. Except this one costs $8.\n\nSkip it.", "author": "Jarrett S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-15", "description": "Excellent and friendly service. The diner was clean and well kept. The burger and chips was decently sized and tasted pretty good too.", "author": "Kayla L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-08", "description": "Fast service, inexpensive burgers and hot dogs, and a great Brooklyn Heights location.\n\nStick with the REGULAR fries because they give you SO many extras with every order...just dumped in the bottom of your bag. One REGULAR is enough for 2, maybe even 3, people.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-13", "description": "I've never had a bad experience at a five guys yet\nThey seem to be springing up in nyc and I for one, welcome them.\n\nTry this tip; grab a thing of peanuts...\nEat until there's only one left.  Finish that last peanut after finishing your burger.\n\nIt will be the best peanut you've ever had..", "author": "Nancy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-06", "description": "Fresh burgers. Love their fries. Don't forget to ask for spicy on the fries. I always go there whenever I'm around the area.", "author": "Louis K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-19", "description": "I just Adore their burgers!!!! Fast Service and nice Counter people .. Extra free fries for me :-) .. I think it's my smile lol ...", "author": "FoodieJunkeyz F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "great food and super friendly staff. They always greet with a smile, love coming here!", "author": "Danielle G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-31", "description": "Good burger. I love the fact you can have all the toppings you want. Also they give you a whole lot of fries. I usually get the cajun fries. Overall good experience. Does get a bit pricey for the size though.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-01", "description": "Im from the west coast and a big time foodie so when I hear about a place that is only on the east coast then I have to try it.  I was all around town, taking the subways and I would see these places all over New York. I was told that they had really good burgers, and thats what they advertise so I had to decide for myself.\n\nI would compare the burgers and fries to that of the west coast's In N Out burgers. The burgers and fries are made fresh and thats what makes them good. One difference is that here at Five guys, you can get a whole list of toppings such as bacon, grilled mushrooms, A-1 sauce, BBQ sauce, on top of the regular onion, tomato, pickles, etc.\n\nThe food was very good, but the downside is that they don't do combos and everything has be bought separate. I ordered 1 cheesesburger, little bacon burger, 1 order of fries, 2 drinks. It came out to $20 and some change.  Thats alot of money for a burger and fries.\n\nSo basically...good burgers just pretty pricey. If your looking for a cheap burger than this is not the place for you. But if price is not an issue, by all means, get the works!!\n\n\n***Update: didn't know this..but they do have these places in Cali...umm..IN N Out is better!", "author": "David F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "I enjoy this place for a quick hamburger and I like how they have so many toppings. Definitely on the level of fast food but slightly better. The fries are pretty good As well. This is a great place if you are looking for a quick bite to eat.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-03", "description": "Sometimes I came at 10:30 and the staff were still preparing the food or setting up the equipments. They did let me in earlier when they saw me Stanford outside. It supposed to open at 11:30 but customers got treated like VIPs!! \n\nBacon burgers and cheeseburgers were so delicious if you paid extra dollar then you could get bacon cheeseburger and it's the signature burger there. Usually a burger was enough for lunch and you should probably feel full because it's so large with two petties with cucumbers, ketchup, mushrooms, etc. You could decide the ingredients for your burgers or just pick everything (only ingredients listed in black on the menu) also known as all the way. If you couldn't eat too much, try the burgers on the little burger section. \n\n5 guy provided 2 kind of fries. One was 5 guy style that were just fried potatoes chopped into triangle shapes. They were just regular fries. Another one was Cajun style fries which was sooo awesome and highly recommend by me and my friends. The fries were delicious and 5 guy exclusive!!!! \n\nLast but not least: freeee peanuts near the entrance and pick up area, enjoy!!!!!!", "author": "Trista L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-31", "description": "**** \u0026 1/2. Five guys is a real deal. So it always surprised me that people in LA have this obsession with In and Out Burger which I found quite average. NY has a similar obsession (not as strong though) with Shake Shack. I think if anyone should get the small local burger chain glory in NY it is Five Guys.\n\nSome might argue that it's a chain fast food and can't be that good but I would disagree. First, it's food fast not the other way around. Second, it's a small chain with modest number of locations not overly saturated around the city. Third, the burgers are delicious and made with high quality beef; the fries are made fresh on the spot with real potatoes (you can see a bunch of potato bags right by the counter) - your food is never frozen which is reflected in the taste. \n\nI've been to this location a few times and the burgers are always perfectly made. I prefer the smallest size since it's still quite a big portion (I got a bigger size for lunch once and pretty much needed a nap in the middle of a work day which is not good!). I love the fact the the menu is very simple and not overly complicated with dozens of options. The menu is a la carte - no meals here. You end up spending ~$10 for a excellent burger and great fries. You put this burger in any local joint for $16 - people will buy it non-stop and will thank you for it. \n\nBonus: they have peanuts for customers. The staff is always great and friendly. If you are skeptical about 5 guys - don't be, just give them a chance, they are worth at least trying.", "author": "Namik G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-06", "description": "I really like this place, but definitely check your order before you leave. My order has been wrong about 50% of the time, and strangely enough every time it's wrong it's been the same thing, despite the fact that it's nothing like my actual order! Not sure what's up with that. However, the employees are very nice and the fries are great!", "author": "Jennifer P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-07", "description": "Middle aged Indian woman working there is so nasty.  \nBe careful !", "author": "Kent G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-11", "description": "Another burger chain that I've tried before. I've seen them around but had a chance to check it out when I was at my office's Brooklyn location.\n\nIt's great for lunch. Nothing fancy at all. The moment you walk in you smell grease, which honestly, is one of the reasons I'm not a fast foo dfan. But the burgers are pretty good and I do like that you can choose from a whole bunch of toppings. They give you a ton of fries so I suggest just get one to share with the table.", "author": "Ryna D."}], "servesCuisine": "Burgers", "priceRange": "Under $10", "name": "Five Guys", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "138 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/MaqhcMKeIHwWIrswCXtNoA/ls.jpg", "@type": "Restaurant", "telephone": "+17187979380"}