{"aggregateRating": {"reviewCount": 184, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-03", "description": "Best group of staff on the street. Keep up the great work!", "author": "Tyler S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-21", "description": "Delicious burgers are to be had here.  They're served up with plenty of topping choices.  The fries are fresh cut and order by the mound! (Please note we ordered 1 large fries for a party of 4 guys \u0026 1 girl.) Also, the free peanuts was a nice touch.  I like this place and will be back for another great burger.", "author": "Lisa R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-01", "description": "When I emerge from the Borough Hall station after a long day of work, about 80 percent of my brain is thinking, \"I should head right down Court Street, put my gym clothes on, and get myself to the treadmill.  A nice salad afterwards, maybe some grilled salmon, and then catch up on the news before bed.\"\n\nThe rest of me is thinking, \"A quick detour down Montague will land you one of the best burgers on this planet, at least seven whole potatoes worth of fries, and enough peanuts to cause your clothing to become a health hazard if you walk by the wrong person.  Then you can plop on the couch and watch Golden Girls reruns until you eat yourself into a food coma.\"\n\nNow you understand why my walk home from the subway is challenging.\n\nSeriously good food.  Reasonable prices.  Clean.  And if you wanna talk about knowing what you eat, just check the chalkboard - today's potatoes are from (Idaho/Wisconsin/the Manager's Backyard)!\n\nOh, and that fifth star is for the extra scoop of fries that they drop into the bottom of your bag when you order your stuff to-go.  Awesome.", "author": "Rob H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-05", "description": "The burgers were good. The fries are great.\nSuggest to go with the smaller burger over the large and the smaller fry as well.\nBoth portions are quite huge.\n\nOverall, a bit pricey for 'fast food'. \nI prefer the diner experience over this.", "author": "Josh B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-05", "description": "So Im a California native out here for the summer and had to stop by 5 guys because of the hype I have heard about it. The burger wasn't bad, but the customer service is what really disappointed me. Ive worked in three food industry jobs, and wouldn't ever try to make a customer feel uncomfortable. The person taking my order was nice enough, but a cook walked up as I was placing my order and felt the need to chime in. Asked about my hat's logo so I told him it was a surf company. He looked at me confused as if something I said didn't make sense. So I smiled and said I was from California, thinking the surf brand would make more sense. But he just said \"I can tell, your way to jolly to be from here.\" This didn't bother me too much at the moment but walking out of there I couldn't help but think how condescending the comment was. Kinda ruined my day to be judged for trying to be nice. I may try 5 guys again, but never from this location.", "author": "Robert O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-21", "description": "Oh tasty burger joints how I love thee. \n\nFive Guys is new for us NY'ers...we don't have to rely on greasy fast food temples for our red meat fix any longer. Over the last 2 years a bunch of these yumtastic places have popped up all over the tristate area and they are basically bringing us the East Coast version of In N Out Burger. \n\nLike In N Out burger, you can put whatever topping you want on your burgery goodness, their fries are fresh (with potato sacks stacked around your seating area - this is a pro btw...not a con, fresh food is a good thing kids...regardless of where it is placed), and the price won't break the bank. \n\nThe minimalist menu is a plus...you can go super simple or piece together whatever heart stopping slab of beef to your clogged arteries desire. \n\nOh and be sure to get the spicy fries...don't bother with just the plain ole cuts. Bonus points because it comes in an overflowing brown paper bag. \n\nIn short a good ole pro/con list: \n\nPros: \n- Burgers are tasty and come with lot of topping options \n- Spicy fries in a brown paper bag \n- East Coast version of In N Out burger \n- Peanuts...free...deliciouso \n- Minimalist menu, burger. fries. toppings. Is it that hard that you need a combo?\n- The people behind the counter are usually really nice \n\nCons: \n- Can get extremely crowded, but just go eat outside...get some fresh air folks. \n\n\nGiving it 4 stars instead of 5...only because it's NOT In N Out Burger...and when you've been to the mecca of quality fast food burger places nothing else can really compete.", "author": "Ryan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-15", "description": "I personally think this is better than the stuff you get from fast food restaurant franchises and they cook a burger, like it should be on a flat top grill, with a load of toppings(my favorite would be mushrooms, grill onions, mayo, ketchup, and jalapenos). The fries are to die for, I went with my girlfriend and had the Cajun fries and we are hooked, they were meaty and crunchy, with a bit of the Cajun spice( old bay seasoning perhaps) and when it comes down to it, its the same price for meal at a fast food franchise, but with better quality. I definitely recommend trying out one of the joints if you are near one. Happy eating!", "author": "Peter C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-21", "description": "I really have to take away one star.  Sit down, have a drink, and let me tell you why:  first, they're kind expensive.  And second, I just don't ever freaking need that many fries.  Like, ever.  But if I'm getting a burger, I always want at least a few.  So many times I just skip it and go somewhere else.  Which is probably a good idea anyway.\n\nTheir burger still rules though.  It's not like I'm telling you not to go there.", "author": "Kyle H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-30", "description": "eh, it's not all that in my opinion.  I've tried Five Guys a couple of times because people seem to have such good impressions of this place and it's like you can't avoid it with all of the new locations popping up.  There's not really much worth mentioning, aside from the fact that they give you a lot of fries.  But the fries don't have a whole lot of taste so you just end up with too many tasteless fries.  Maybe if they had a sauce I could dip them in that would help.  Oh, the peanuts are good.  I give it one extra star (so that makes it 2 stars) because they have free refills (fountain drinks).  That is awesome and should be at so many more restaurants in the city, one of my big NYC pet-peeves.\n\nI'm in between a 2 and 3 on the stars, but the fact that I dread going there when someone I'm with wants to makes me go for the 2.  \n\nPros - clean, the peanuts, FREE REFILLS!\n\nCons - the food, the fact that they are now a chain that's everywhere", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-26", "description": "A Virginia import, 5 Guys is a NYC keeper. Who knew such wonderful stuff could come from Virgina? (my hometown!) And, not that I'm biased, but any restaurant that keeps Cherry Coke on the fountain tap is usually \"up there\" anyway in my book.\n\nBurgers are made to order and hand-packed lightly, so the burger itself is taller, rather than wider. This might sound strange, but it makes the final experience far more delicious, because of the way the meat cooks with this well-practiced shaping technique\n\nFries are only more delicious with malt vinegar and a 5 Guys rule of service, ensures that you get an extra scoopful of fries inside your greasy paper bag.\n\nIf you're dieting, let your friends order the fries and steal a few of the extras, and order the jr. burger (sans bacon!).\n\nI wish there were one of these in every NY neighborhood.", "author": "C B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-15", "description": "Great food and quantity for the amount you spend, awesome\nAVOID business hour lunch times example, 12-2pm (CROWDED)", "author": "Kwame J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-24", "description": "The burger was great and the fries were HUGE!  Make sure to split an order with a friend.\n\nAtmosphere is a mom-and-pop, fast food burger joint with free peanuts and shells all over the ground.  It's fun, decent priced for the area, and good quality.  \n\nI wish they offered chicken burgers, however.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-25", "description": "Ok...this may sound drastic, but if I had to come up with a list of my possible last meals on earth, I think 5 guys would be somewhere near the top!\nThe crazy thing was that I was never a fan of burgers until one day i decided to make a trip to 5 guys. While my love affair with 5 guys didn't start at their Montague street location, I am reviewing this one because it just so happens its the location I frequent the most. \n\nThe menu is simple but you know what?--I'd rather go to a place that makes a few things and they do it WELL than a place with a large variety of sub par items. \n\n\nOkay ordering is also pretty simple--you can have any burger you want from the menu but remember to specify if you want a \"little burger\"...if you just say cheeseburger or hamburger, you'll get their regular size patty which literally two people can share! On more than one occasion, I've forgotten to say \"little cheeseburger\", so they gave me the the full sized one and I would have to save the rest for later. Once in a blue though, I can finish one, so I guess it depends on your appetite at the time.\nWell anyway, once you picked your size/burger type [hamburger, cheeseburger, bacon burger, or bacon cheese burger], you tell them what toppings and sauces--tomato, mayo. lettuce, bbq sauce etc...whatever else you want from off the toppings list. No matter what burger or toppings you get, they --the meat is fresh (not that frozen mush they serve elsewhere) and has that authentic \"just grilled\" taste. Btw, its company policy that their burgers be well done, so if you don't prefer your burgers be that cooked, 5 guys may not be for you. \nNow, on to  the fries (My favorite form of carb consumption!). They're fresh, have the right amount of crunchiness, and plentiful. They even have a sign indicating from which city and state they got the potatoes for the week from and I swear to you I can tell the difference is taste in potatoes! ( I told you...I like my fries!). At times though, they may border on being too salty, but I always make sure I grab extra napkins just in case I need to whisk away some of the excess salt. The regular fries (which is the smallest size) can easily be shared between 2 or 3 people, so if you are a light eater---bring a friend! They basically give you a brown greasy paper bag half full of fries! \n-----------------------------------------------------------------------------------------------\n\n\nIf it was based on taste and value alone, I would give  5 guys 5 stars. But there are a few things that preclude me from doing so. For example, I'd like if they would add a few more tried and true burger restaurant staples to their menu such as sweet potato fries or onion rings just for variety sakes. I have been to other burger places and they tend to have signature or specialty burgers, which is something 5 guys doesn' t have that I wish they did because I do appreciate novelty once in a while. *shrug* it's really no biggie though.\nSo, in synopsis, you get a LOT of tasty food, but there is a heftier price tag to match. Don't expect a $7 meal complete with fries and drink like you get at your typical FF joint. A complete meal at 5 guys can cost you about 10 to 12 dollars(you do get free drink refills though!), but for the quantity AND quality you're getting, I think its well worth it. Sure, a cheaper price would be great, but price has never barred me from returning to this place time and time again.", "author": "Cassandra B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-03-03", "description": "Yum Yum.\nFries are lovely and the burger came double stacked even though I didn't order it that way, mistake? I am really not sure about that one.\n\nI really enjoyed it along with the fries, root beer, and free refills. All under 8 bucks..was nice.\nEntrance on left, p.s.", "author": "Christopher T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-08-09", "description": "I liked their burgers just fine.  The way they structure their toppings is awesome but I don't know if the flexibility makes the burgers taste any better.  I wish they had whole wheat buns, though.  Their fries are great, though.\n\nAs a burger joint, I'd recommend people giving it a try but, in the end, its just  a different kind of fast food.", "author": "Christopher P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-17", "description": "Today I happen to go to my internship on Remsen street. My supervisor and a few co-workers wanted food from Five Guys. I didn't know what the hell FG was. I actually thought they were talking about five guys...\n\nThey explained to me that they gave huge bags of fries and really good burgers. So I went for it.\n\nAnd I'm SOOOOOOO glad I did. The burger and the fries were delicious. I'm totally going back again...even though I shouldn't since I'm on a diet. But who said I can't cheat a little? ;)", "author": "Tiffany Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-02", "description": "I didn't realize this place was a chain until about a month after I first started eating here, thats how good it is.  This place is damn good and doesnt leave you feeling as crappy as eating at mcdonalds.  It's pricier but hey you get what you pay for, a much better fast food burger.  The fries are just hands down delicious.  This is guaranteed to fill you up good.\n\nI also like the sign outside that gives the reason for the no peanut leaving the premise policy as protecting neighborhood children... haha just admit you don't want kids running out of the place with pockets full of peanuts.  I know it's something I could've done in my long ago packer days.", "author": "Rob K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-14", "description": "1.Not Cheap.\n2.Your clothes will stink once you leave!\n3.Hot dogs are type good if you have the money for one.\n4.The burger was not grade A beef, but I do not belive it was low grade. It is better than any fast food burger.\n5.CHECKERS IS OPENING UP IN BROOKLYN HEIGHTS! YES!!!", "author": "Amanda T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-06-25", "description": "The neighborhood is very cute.", "author": "Molly Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-09", "description": "Anyone on here who says this is the best burger theyve ever had has never had In and Out. That's understandable as it is a west coast icon. My biggest complaint about 5G's would have to be the menu/price...there are NO COMBO'S!...everything must be ordered seperate...the 6.80 burger...the 2.80 fries the 2.00 drink ....all seperate and over priced..Not only does In n Out CRUSH this place but Fresh \u0026 Fast Burgers does as well(similarly priced to 5G's tho, atleast they have combos)...\n\nThe burger is over rated....and if you plan on ordering the fries...bring a friend....they STUFF your bag with em...walk out and about 5 minutes later your bag is covered in grease stains.", "author": "Keon M."}], "servesCuisine": "Burgers", "priceRange": "Under $10", "name": "Five Guys", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "138 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/MaqhcMKeIHwWIrswCXtNoA/ls.jpg", "@type": "Restaurant", "telephone": "+17187979380"}