{"aggregateRating": {"reviewCount": 184, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-19", "description": "There's no other take out burger place on Montague St and I'm glad that the one there is is Five Guys! \n\nI love Five Guys for one thing - you can have malt vinegar with your fries...yeeesssssssss!!! The fries come out hot, crispy, a little greasy and ready to be doused in malt vinegar. Their burgers are pretty good, too.\n\nThis place is spacious, clean and the staff are always friendly.", "author": "Julia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-25", "description": "Nothing like a good greasy burger to hit the spot. Burgers are cooked to order and you can select a variety of toppings. Their cajun fries are great! We always take it to go, but you can sit and eat as well. Service is quick, but quirky. Another perk is you can order online or fax the order in before pick-up. Service has been made easy.", "author": "Giovanna A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-26", "description": "I like burgers.  I like fries.  A Five Guys Burger (with everything--because I'm a heffer) was pretty top notch for me.  I was lecturing myself after buying a burger and regular order of fries while walking back to work because I'm poor and $12 for a burger and fries is not in the price range a poor student like myself.  Not for a goddamn burger and fries!  \n\nHowever, after I snuck the embarrassing grease soaked see thru bag into my office and opened the thing I thought \"Hot damn!  They weren't stingy!\"  They did pour me a generous amount of fries (better since I paid $4-5 for it!) and the burger was a heavy monstrosity.  I suppose that made up for the cost.  I mean a shroom burger at shake shack costs $7 and as tasty as that mushroom is no normal person can get full off that.  The Five Guys Burger, however, was definitely a filler.  I was pretty embarrassed and shamed after I finished it.   Embarrassed, shamed, and oh so satisfied.  Wait, am I still talking about food?", "author": "Kim D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-29", "description": "The best burger I've ever had!!! Yes I'm serious. In and out, shake shack, black label burger (Minetta) stand no chance. \n\nNow let me just say that when I say best burger what I mean to say is THIS location. I am not saying ALL five guys locations will produce great burgers, because they won't. I remember a horrible experience at another location I think was around the Javitz center...HORRIBLE!\n\nThis fast food joint is clean and the workers seem content. Burgers and Cajun fries are great! \n\nIf I'm in the mood for a great tasting burger Five Guys on MONTAGUE can't be beat.", "author": "Raymond T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-19", "description": "Just came here for a quick bite to eat. I know no restaurant is perfect but must there be fries all over the floor where they're cooking the food? It was such a turn off", "author": "Vicki B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-09", "description": "First time ever to Five Guys. 11:27am on 4/9/15,  Cashier Saskia W. was very helpful and courteous during my visit.  Burgers very good and fries also.  Everything was up to par.  Hoping there's a Five Guys in Williamsburg.  Thank you again to the staff at Five Guys.", "author": "Manny F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-31", "description": "The scrumptious food, clean store and the spacious atmosphere has me keep on coming back to this location!!! The fries are warm and made right on the spot which makes the burger tastes better each time I go... plus the friendliness of the staff makes everything taste so much better :) \n\nI give 5 stars and 1000 hearts!!!", "author": "Natalie K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-05", "description": "I don't know what all the fuss is about with five guys? I wasn't wowed by the burgers , I want to like this place but the food doesn't look fresh or appetizing. The service was fast, it was clean but nothing you can't get from a macdonalds? The location is great being in the business district.", "author": "Sara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-02", "description": "love this place its so close to my meetings and the service is nice and quick. Usually nice and clean too best burgers ever in brooklyn way better than mcdonalds so i come here..", "author": "Jason S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-07", "description": "With all candor and due respect, what the hell do people see in this place?  Have you lost your taste buds?  To compare this place to In-n-Out is ridiculous as this place is barely comparable to a lunch truck burger (no offense to lunch trucks as some of you really can turn it out). \n\nThe burger was unnecessarily greasy and shockingly bland. (How one can make meat, cheese, bread and BBQ sauce taste bland is a mystery, but 5 Guys has done it). Also, the bun on my burger was a soggy mess, as they wrap the burgers in foil which keeps in the heat and dissolves the bun within 1 minute. Terrible. \n\nThe one redeeming item 5 Guys has are the Cajun fries; they are tasty. \n\nA friend has recommended trying Bare Burger next time I'm in the mood for burgers; one thing is for sure--I ain't coming back here folks!!", "author": "Madison B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-08", "description": "I'm just going to go out on a limb and say this is the best five guys in New York for food and service. I always get a burger all the way with fries. Consistently the burgers are juicy and tasty and the fries are delicious and crispy. I only wish they would do chili so I could have it over my fries. The employees are cheerful, helpful, and diligent. The service is quick.", "author": "James W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-20", "description": "Being born and raised in Southern California, I knew it would be a hard journey finding a burger joint that combined both the quality, taste, and price of In-N-Out burger.. This may be the closest joint yet, on the East Coast.\n\nThe prices are great! for the quality of burger, I would say it is very similar to in-n-out, except they do not have the \"special sauce\" that is thousand island dressing.\n\nThey DO have an additional option of bacon and hot sauces.\n\nThe patty is juicy and moist, flavorful!", "author": "S W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-26", "description": "When i was hungry I came here.  bacon cheeseburger with every topping on it.  Load that up with fries that don't fit in that cup, your leaving stuffed.  I could never finish my fries if i ate the burger first.  Either got to eat them side by side or tackle the fries first before that juice burger.  This was a time when you had classes with so little time in between and you just gotta eat and go.  Definitely coming back when I'm around the area.", "author": "Vincent H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-01", "description": "4.5 stars..\n\nFive guys is awesome and if you haven't been, you need to go. It's a chain with a respectable number of locations (not over saturated like the big burger places) and despite being a chain, remains a good solid community eatery with superior quality. This location is on a great spot in Brooklyn Heights, a short walk from the famed Promenade. You can see the list of local awards from different locations, as they are posted along the walls of every location. I believe the chain was started in D.C and last time Brian Williams interviewed Obama they went and got burgers from 5 guys. \n\nThis is the kind of place you order, sit and wait for your number to be called. While you wait you can feast on as many peanuts as you want. They have barrels of them free of charge to snack on. You'll need need to keep your appetite though. Their menu is simple, they basically only have burgers, hot dogs, and fries. You can get as many toppings as you want (the only ones that cost money are cheese or bacon). The burgers are thin but they pile on 2 and count it as a single. My only issue is that they serve a really greasy burger. I would rather a thick juicy medium well burger then 2 greasy well done patties but I see the time and the place for just a nice greasy non-fancy burger and fries. \n\nI did save the best for last though...the fries. There are 2 kinds of people in this world, those who love McDonalds fries and those who don't. If you don't like McDonalds fries, you will love these. They are so fresh they have a daily chalk board telling you were the day's potatoes came from. They cut their fries with the perfect thickness and fry them to perfection in peanut oil. They fill a cup with fries, place it next to your burger in a brown paper bag, then dump another huge portion on top. A small order of fries is definitely enough for a couple people. Next time I go I'll just be getting the fries. \n\nAlthough it's a dam tasty burger it's not the best I've ever had but no one can ever top 5 guys fries.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-12", "description": "Let's begin the neighborhood burger war off right with potatoes aka/fries from St. Anthony, IO", "author": "Robert J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-20", "description": "I love this place.  First, they give you a huge brown bag of fries, so you definitely get a huge amount of delicious food.   Second, there is quick service.  Thirdly, the meat that they used for the burger is really juicy and delicious.  Fourthly, they let you use as many ingredients on your burger as you want.  Fifthly, you are allowed to choose the size of your burger, junior or large.  Yes, it's a bit tacky inside with the red paint and the lighting, but the burgers are out of this world.   This place draws in a different crowd everytime I go.  It's got ample seating, with table and chairs, and stools on the side.  They have all these awards posted, and news articles about their success all over the country.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-02", "description": "I love five guys I don't  like the staff here. They are very unprofessional \u0026 have bad attitudes. I won't be going to this location again.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-17", "description": "Gotta love Five Guys! I'm originally from California (where they also have Five Guys) and miss In-n-out terribly. When I'm in the mood for an In-n-out style burger and fresh cut fry's, I turn to these guys. This particular joint is busy weekdays around lunch time and practically empty other times dying the week.", "author": "Mike M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-30", "description": "This place has some of the best fries and burgers in New York City. The Cajun fries here are second to none and this particular location always scoops a full cup and then some. The Bacon Cheeseburger comes with two patties (each additional patty is $2) and packed with a hearty amount of toppings and sauces at no additional charge. The prices are good for the food that you will be getting. At least you know you'll be leaving the place with a full stomach.", "author": "Alan Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-14", "description": "I don't understand why people are so in love with this place.  I will admit that the fries are great.  I kind of wish they had a small size where they actually gave you a small amount as opposed to filling up a wheelbarrow for you to carry out, but I guess since they are so expensive, you at least get a fair amount for the money.\n\nThe burgers have never impressed me.  They are just greasy nasty piles of meat soaking into the bun.  The patty doesn't really stay together like a burger should and it feels very heavy.", "author": "S M."}], "servesCuisine": "Burgers", "priceRange": "Under $10", "name": "Five Guys", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "138 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/MaqhcMKeIHwWIrswCXtNoA/ls.jpg", "@type": "Restaurant", "telephone": "+17187979380"}