{"aggregateRating": {"reviewCount": 110, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-08", "description": "I like this place.  Came here few times for lunch, $7 lunch special is great especially in Dumbo.  I really like their miso soup, very flavorful, sushi is fresh too!  I don't know why the review is not so good about Miso, there is really nothing wrong with the food or service.", "author": "Klaire L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-17", "description": "This is your only option for sushi in Dumbo and it is just ok! No wow factor here. I have ordered takeout from here a few times, never sat for table service it seems like the waitresses suck anyways. Atmosphere is ok .. Kind of dull.", "author": "Andreina B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-28", "description": "Horrible. Absolutely horrible. I used to go here somewhat often a year or so ago, but stopped going because they would very regularly not have one or two very common dishes. \n\nI've gone in over the last two weeks twice. Why you ask? I went back twice because the first time I couldn't believe they were serving out of Styrofoam and plastic plates the first time. I thought maybe something happened, but short of the cook losing his mind and smashing all the lovely plates they used to have, I don't see a reason. It's more costly, makes the food look less appetizing and is questionable in general which makes the entire dining experience incredibly disappointing. I thought for a second that maybe they were trying to seem quirky and appeal to hipsters but A. This does not seem like a route a Japanese restaurant would ever take and B. None of the utensils were biodegradable or good for the environment. What are you guys thinking?? Definitely do not come here if you want to impress or even if you want to be mildly accommodating to new clients, good friends or loved ones in general - nothing about this place seems clean. The waitresses barely know what they have on the menu (which again, has not changed in a few years), are very rude and are not very attentive. \n\nTo my shock, the first time I'd gone back, they *still* didn't have the dish (on their lunch special, still hasn't changed, still not available 90% of the time). The second time I went back just to see if the plastic plate situation was a fluke. It wasn't. I ordered my dish (they actually had it this time!!) and requested regular plates. I had to request that at a restaurant that doesn't take my order from the window of my car. The portions have shrunk to a very noticeable degree and the food didn't taste fresh - it both tasted *and* looked like it had been made a few days prior. How is this place still open??", "author": "evelyn c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-08", "description": "My friend needed to make a pit stop at Jacques Torres Chocolate Shop (around the corner from the restaurant).  \n\nIn order to have a peaceful dinner along with a toddler, we decided to stop at this restaurant.  Except for 1 party with 4 guests, it was pretty empty.  We picked the table by the window which turned out to be perfect sitting choice.  The service is friendly and accommodating.\n\nI loved the Kani Salad.  The Crispy Calamari with the sauce that reminds of HoiSan wasn't as thrilling.  Edamame was served warm -- which is great.    Atlantic Roll (grilled eel, tempura flake and avocodo wrapped around spicy tuna shiitake mushroom topping) and Spicy Tuna Roll are wonderful.\n\nAfterwards, to walk off the food, we stopped by the Brooklyn Ice Cream Factory and the wonderful downtown Manhattan view.  =)", "author": "Caroline N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-13", "description": "Very average food. Not sure how they survive in Dumbo. Edamame is overcooked, shumai is weirdly microwaved.. Yuckiness...", "author": "Katya H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-29", "description": "The food is average, the prices are reasonable, and the atmosphere could use a makeover for a much cleaner and cozier appearance.", "author": "M D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-21", "description": "A decent lunch choice in this neighborhood desperately lacking good lunch choices.\n\nTheir chicken terriyaki was pretty pathetic looking and mediocre.  And their chicken katsu had way too much onion and the rise was water laden so avoid that one.  But i like their sushi a lot.  Their two rolls + salad/soup lunch special for $8 is a pretty nice deal.  And the salad and dressing is great.", "author": "Jonathan W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-30", "description": "I was famished after a boxing workout and stumbled upon this restaurant on my walk home so I decided to give this restaurant a try. I definitely was impressed. I was hesistant at first as the place was empty but so glad I stopped in.  I have to say much better quality than the crappy subpar sushi joints in Brooklyn Heights. Prices I felt were very standard and very nice staff. I will back.", "author": "L J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-06", "description": "I gave this restaurant one star because both the service and food were poor. I went with my family for dinner because we happened to be walking by. I have to think that it's pretty hard to ruin edamame, but the edamame they served was brownish and inedible. When I pointed this out to the server, she maintained that it was probably more fresh than what we were used to. Not only did she not apologize (much less offer to comp the edamame), but she went to the back of the restaurant and began laughing loudly with the other employees. The miso soup also had an odd, slightly stale taste. The shrimp was ordinary, nothing to write home about.", "author": "Paulina K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-28", "description": "It was the first place not to have an enormous queue on a weekend during an art fest. The 5 of us waited 40 minutes for a table, after being told it'd be 10-15 minutes. I had a salmon-mango roll which was pretty nice. A shrimp pad tai was nothing to write home about - tasteless and not  at all memorable. I'd rather stand in line next time.", "author": "Maria M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-05", "description": "I had 2 rolls (eel cucumber and shrimp/avocado) plus a salad for 8 bucks...this was a great lunch deal...i think?\n...the food was yummy except the salad could have been a bit better ...but for 8 bucks I was happy...I would buy from there again...for lunch...", "author": "Melissa L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-05", "description": "If you care about your health, please go to another place.  The fish was not fresh and I had to throw out my lunch...  Maybe some people were lucky and they got OK fish, but I am not going to take my chances anymore, there are other places you can go.", "author": "Vladimir K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-16", "description": "Bad sushi. Very bad sushi. The glassware is dirty and the sushi was spoiled. Horrible", "author": "Imtiaz H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-13", "description": "This place is just ok. I'd go here again if  I was in the area and was craving sushi, but I wouldn't go out of my way for it. not too many options when it comes to sushi, but large appetizer section. decent price-wise.  \n\nCaution: Spicy Tuna roll here is extremely spicy", "author": "sara n."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-11", "description": "Had their Agedashi Tofu and was greatly disappointed.  Not crispy although they just cooked it and the sauce was too mild. Their vegetable soup was too salty.  We wondered why it was quiet during new years eve.", "author": "Terry F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-30", "description": "Horrible Horrible service! \n\nThe waitress act like we owe her lots of money! \n\nAnd the most awful thing was, I pointed 2 dishes from the \"lunch special\" section menu to her, and she saw them and placed the order. \n\nand when we had the bill, the amount was doubled from the menu. \n\nI asked why and she was like, \"ohhhhhhh, we don't have lunch special on weekend\"\n\nOK, WHY DON'T YOU TELL ME EARLIER WHEN I PLACE THE ORDERS?\n\nI mean, she knew i was looking at the lunch special section and she surely knew i was expecting the special price, but she didn't point it out!\n\nThis is definitely not the right way to run a restaurant.\n\nFood is only acceptable. Why would you expecting good Japanese food from Chinese?", "author": "Judy Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-10", "description": "Terrible service. I come back because the lunch specials are reasonably priced and I work right across the street. Today I've had enough though. The waitress mislead my order and when I corrected her she refused and insisted that I was lying. Completely unprofessional, the manager should look into that. I left in a hurry because I had to get back to work, I didn't eat the food yet but I already have a bad taste in my mouth.", "author": "Sammy A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-03", "description": "I live in dumbo, so maybe I am a captive audience, but anyway - there are no other options for Japanese nearby but I'm glad we have Miso. It's not run by Japanese people but based on what I've ordered, I've been happy. They have sashimi omakase (ie you don't get to choose) that is supposedly from tsukiji market (how to verify??). While it is indeed good sashimi, I don't know that it's worth 2x the price of the regular sashimi. It is definitely not 2x better. I've also ordered sushi rolls (eel cucumber, spicy tuna, tamago nigiri) and its all been good. The rice is good. Salad is iceberg with carrot ginger dressing. Free delivery as long as you spend more than ten bux. The lunch specials are a good deal. All in all, it's decent.", "author": "Kathy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-03-27", "description": "Very nice and casual, great service. Never crowded, delivery available and prices are extremely reasonable. \nI usually go there during some meetings, and everybody seems to like the food and plae. The neighborhood is very calm and artistic. DUMBO. I love their Rolls , especially the salmon avocado roll.\nDaiana Noel", "author": "Daiana N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-14", "description": "If you happen to be in DUMBO and crave sushi, this is what you have to work with. It's fresher than the stuff available at Peas and Pickles (is Miso really fresher?). \n\nAs people have said, its decent. Not OMG fantastic, but not bad either. $8 lunch special gets you two rolls and a salad or soup.", "author": "Carl C."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Miso Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "40 Main St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jSilEFgtSJkNdvNbljT01Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188588388"}