{"aggregateRating": {"reviewCount": 110, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-08", "description": "I've been coming to this restaurant for the last 2 years since I work in the area. It seems to be fit in with every other mediocre restaurant in the area. Let's face it, Dumbo is not a \"good eats\" destination. So with that being said, my rating for this is based on my most recent visit here. \n\nI came here with two coworkers for a quick bit to eat. As usual, the food was sub par, the miso soup was served room temperature being mainly broth and maybe had one piece of tofu. My one coworker's appetizer was served after his entree, not sure what happened there. \n\nUpon receiving the bill, one of my coworkers realized the minimum to use a debit card was $10 and her meal cost $8 as the waitress came over, she abruptly interrupted us to repeat the debit card minimum that we had already established. As my other coworker and I handed her our debit cards, the third coworker, realized she indeed had $8 in cash to cover her meal. The waitress looks over to her and flat out says \"oh, so no tip?!\" meanwhile, we hadn't even received our debit cards back to sign to leave a tip!. I calmly interjected with \"Could you please run our debit cards first and we will sign afterwards, thanks\". The only thing we could do was laugh afterwards because anyone in their right mind would know how crass that sounded. Needlesstosay we left a generous tip and made our exit. \n\nSigh* I will more than likely come back because there aren't other sushi spots in the area.", "author": "Maureen S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-28", "description": "I had a wonderful sushi dinner here. High quality fish. Wonderful roll and individual sushi. Sweet staff. The restaurant appearance is deceptive, as it looks a bit like a coffeeshop. Could use a freshening. Don't be deceived. This was exceptional, v reasonably priced, creative specials. \"A\" health grade.  I live in NYC, but I'll be taking the ferry over ...", "author": "Veronica O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-06", "description": "I like their spicy crunchy salmon and salmon avocado a lot for lunch special,  fish is pretty fresh in my opinion.  I'm docking off a star though because they are SO skimpy with the rice in the rolls.... like don't most sushi places do it opposite where they have too little fish and too much rice? You can basically almost see through to the seaweed wrap because there's so little rice. \n\nI still really recommend their katsu don bowl though.", "author": "Asdy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-16", "description": "From California wanted sushi and saw Miso sushi went in and what a surprise! Ordered the splendid roll and the imposibble roll and they were fantastic!! I highly recommend this place.", "author": "Jesse C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "I use it for takeout 2x week! Always good quality and I am disappointed when I go to other sushi places. The in-dining experience is okay - small and a bit cold but the sushi is top notch!", "author": "Bruce G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "Stopped purely by accident and I'm glad we did!  (When we were in the area it didn't show up on yelp. )The menu is simple, service was great and the food was excellent.", "author": "Emily F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-02", "description": "Can I give negative stars? The restaurant was about at 50% capacity at 12:30 pm so it was not crowded. My coworkers and I decide to take a quick stroll to order takeout. \nAs soon as we walk in the waitresses are yelling TAKE OUT OR STAY?!?! Then she asks me what We want even though we hadn't opened up the menu she just handed us. We patiently order our food and then is yelled at to move away from the register when simultaneously the girl at the register asks me to come back to sign and get my credit card back. So should I leave? Or is it ok with your business that I get my credit card back? We are standing outside away from our friends who also ordered because they demanded we clear the area for their sit down customers. Even though we are probably saving them money, time, and resource by ordering takeout during rush hour lunchtime. It's super windy here in Dumbo and it's freezing out. I've never been so disrespected at a restaurant for absolutely no reason. I'm Korean and hunt for Asian food in the area often and this experience was so disheartening and disappointing. Asians are normally on point with service and respect for customers. Pretty much a damn shame.", "author": "Christine C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-09", "description": "Miso sorry but this place is not good.  Outrageous prices but I get it, you're paying for DUMBO prices but you definitely don't get what you paid for.  It was a cold day so I opted for something soup-y.  Yea, I didn't order sushi from a sushi place.  I mean when your restaurant is named after a soup, you'd think the soup would be decent too right?  Nope. \n\nService (or more like business transaction) is nonexistent.  I called in and asked whether they could substitute the noodles (Udon to soba). What I got was an abrupt and rushed \"No.\"  (It was as if they couldn't be bothered.)  OK, I'm pretty sure you're a restaurant and such a simple request would be honored.  After much hesitation, I got what I requested.  Miso Happy.\n\nSalmon Soba noodle soup- soggy and bland.  Vegetables were overcooked and yellow. The noodles were soggy.  I get it, noodles kept inside hot bowl of broth would turn anything soggy.  But, that's why you don't overcook the noodles beforehand and let it sit and simmer.  My soup was lacking; I think they forgot that I ordered soup and not stir-fried soba?\n\nThe result? Miso hungry afterwards.  Shame that it's one of the only sushi joints in DUMBO so people would still flock here.  I guess I was a DUMBO for trying this place out.", "author": "Wing L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-18", "description": "Don't compare this to a fancy sushi joint, but for what it is, it's a really good deal for some decent tasting Americanized sushi. I come here often for the lunch special (2 fancier sushi rolls for $10 after tax) which fills me up decently enough. There's also cheaper sushi options for lunch special, as well as some standardized teriyaki meat fare with side salads/miso soups, which range $9-12 total. Atmosphere inside the restaurant isn't fancy or special. Take out service is fast when you order in the restaurant and you can eat outside in nearby Brooklyn Bridge Park.", "author": "Liz C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-12", "description": "Been wanted to try this place since almost 2 years, but always hesitate to walk in. \nThey always had this dark lightening, whenever I passed by. \nThere was like twice I passed by, trying to have lunch with my bf here, the chef was laying down in the chairs, and someone was reading newspaper by the side. \nI was freaked out, but I finally gave this place a chance. \nIt wasn't too bad as I suppose it was. \nThere was new specials on the menu. \nI do like their Fried Oyster. (Very crispy on the shell, and soft inside.; definitely worth trying.) \nTheir beef negimaki, was very juicy and tender.\nTheir fried cheese cake was small, but was crispy. (Their ran out of garnish, and topped a piece of lettuce on the top; it doesn't look bad; very creative.) overall all the dishes was very neat. \n\nBut when it comes down for the dining service.... I wasn't too satisfied. From the arrival, the waiters didn't point us to our seatings, so we just sat... Took them a few minutes to come over with menu, and asked for kind of drinks we wanted. Four waitress were at the back table, filling up soy sauce box, and kept talking. There was no service in between, they never refilled our tea, after it been gone from the first 15 minutes, of wait for the food. Toward the end, after the fried cheesecake came, they quickly brought us our bill, before we asked. I felt rushed, and we were the only customers there at that time.  I still left 15% tip, but shouldn't have.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-09", "description": "For a divy little restaurant on the edge of a not high traffic part of DUMBO I was impressed. I only wandered in because I was working in the neighborhood and starving and it was the first place I saw.\n\nI expected the typical dry, cold flavorless sushi with pink ginger. What I got was well prepared stuffed rolls. The pieces were huge. I was stuffed not even halfway through.\nThey didn't skimp on the fish at all. And their spicy is as advertised. \n\nIf they had a more prominent storefront on a more visible street they would surely get tons of business.\n\nAnd while they don't necessarily greet you with a smile I'm not gonna knock em on customer service. I wanted takeout, they gave me good food.", "author": "Madeline Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-22", "description": "We had a great meal here! The superstar roll and volcano roll were winners. Not the most amazing sushi place I've ever been to, but we would eat here again.", "author": "Carissa M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-30", "description": "Not the best sushi place... Kinda disappointing. It's Chinese owned and ok price. But the view from the outside overlooking the bridge is a 5 star!", "author": "C B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-06", "description": "Horrible! Went to this restaurant a few days ago while my girlfriend and I were around Brooklyn Bridge Park. We decided to stop in for dinner. The first sign that this may not be a pleasant dining experience is that it was completely empty. It was just us and the servers and cooks. We still decided to give it a chance, thinking maybe the dinner crowd will come a little later. \n\nWe ordered and the server came with our can of iced teas, I was actually hoping that it was homemade iced tea. I didn't know it was a can of iced tea that we can get from any bodega. Anyway, I let it slide. Well to my horror, the top of the cans were dirty and the iced teas were past their expiration. We immediately told the server that these have expired and we rather not have anything to drink, we will just drink water. \n\nThe server took away the iced teas and then talked in \"her language\" to the other servers/cooks and all of them had the nerve to look at us and laugh and smile. We were like...seriously? This is happening? Then I yelled across the restaurant and said that we are leaving. We don't want to eat here anymore. Cancel our order. We will just pay for the miso soup which had come out along with the iced teas. They indicated that the sushi roll was done and I just said, we don't want it, we're leaving. They never even asked why we were leaving. They knew why! They knew they were talking about us and laughing at us. Laughing at us because we wanted to NOT drink expired drinks??? Maybe that's how they roll but that's not how we roll.\n\nAs we were leaving, I said to all of them. We know you were talking about us. That's not right at all. They just look dumbfounded. My girlfriend also said, this is how you treat all your customers?? Funny...there were no customers there. So maybe that's how they treat them..with no respect. That's why the place is empty.\n\nSo we didn't get to eat the food and I am not able to rate it for that. The one star is for their horrible customer service.\n\nNEVER AGAIN!!", "author": "Mel M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-15", "description": "I like to give places benefit of the doubt sometimes (I mean people are certainly more motivated to write a review of a negative experience than a positive one), but in this case I fully stand by the Yelp rating. Stopped by here after an afternoon play in the area and hunger/open seating was the motivating factor. No service issues by any means- interactions were all  prompt and pleasant. However the food on the other hand- the miso soup was extremely watery, the gyoza was overdone, and the two maki special rolls... well both were tiny, with limited fish and a lack of flavor. The to-go container rolls at Grand Central are even improvements over my order. For the prices, I just expected better.", "author": "Matt M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-30", "description": "Unmistakably underwhelming sushi. Miso is not a destination restaurant by any means. You're likely to eat here due to it's close proximity to the Galapagos art space or because of the serious lack of sushi joints in dumbo. When we walked in here the other night not only did it smell like funky fish it was also nearly empty at prime restaurant time (8:30!) on a Saturday night. \n\nThe interior was nice enough, no complaints. It was clean, bright and somewhat modern. My only suggestion would be to turn the heat up slightly. My hands were freezing and I wore my coat most of the time. Additionally, service was polite but really discombobulated. The waitresses kept overlapping each other.\"Hi! Can I get you drinks?\" \"No... the other waitress is helping us with the drink order.\" \"Oh, OK can I get you appetizers?\" \"Nope, sorry she took that too\". They both kept filling our tea every 4.5 minutes while the other one was in the kitchen or on the phone. While it was appreciated, it was entirely unnecessary. May I suggest a little more communication and coordination, ladies?\n\nOur appetizers were clearly mircowaved; the shrimp shumai was doughy and unexciting. Our sushi rolls were indeed palatable but really bland and disappointing. On paper they looked exciting with a myriad of  interesting combinations in them such as \"papaya, mango, spicy tuna\" but were poorly all executed. I can't think of any other way to describe the sushi other than \"dull\". The spicy tuna atop our rolls was fishy and tasted more like my mom's tuna salad than fresh tuna. The salmon was flat and all of the sweet ingredients like papaya were nearly tasteless. The sweet sauces (eel sauce?) that are often drizzled on sushi were almost non-existent. The one thing that Miso got right were the vegetable dumplings. While they're not especially difficult to mess up I have to give them credit for doing something right.\n\nTL;DR: 2.5 Stars - Bland, average sushi. If you're in the area and starving (like I was) take 20 seconds and yelp up another place on your phone.", "author": "Steph M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-06", "description": "Two stars is for the mediocre food.  Ordered a Cali roll, and an eel avocado lunch special.  Attitude here is very negative, and the service is very rushed.  \n\nOverall, not a place I would go back to.  They just happened to be the first spot we saw for food while we were in the area.", "author": "Crystine W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-15", "description": "Next time I'm heading to Galapagos Art Space for Nerd Nite, I'll bypass Shady Sushi.\n\nIt was a cold (not just outside, inside the restaurant as well), dark friday evening in January of 2012, my friends and I were starving and this was the only food joint nearby enough such that we wouldn't miss our Nite of Quirkiness.\n\nI call it Shady Sushi because 1) it's in an industrial and at times abandoned looking area, and 2) it's one of those hole-in-the-wall places without the food that makes up for it and makes it totally worth it. The sushi was a bit boring, and as Steph M put it, bland. It wasn't terrible, we certainly didn't get sick, but it was just lackluster. I found it kind of odd too that the 3 of us were the only ones there at one point...\n\nI have since been frequenting the nearby pizza place (fuck....what's the name of that joint again??)  to satiate my hunger pangs when in this part of Brooklyn late at night.", "author": "Justine C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-12", "description": "This humble little joint serves (or delivers) splendid Sushi and Asian dishes at a great price (in an expensive part of town) and they do it cleanly, efficiently and with a quiet friendliness.  Bells and whistles may be few and there's always the \"is this precisely how it is done in Tokyo/Fukushima/Naha?\" debate (probably not but tasted good to my experienced North American-raised taste buds).  \n\nWe got a bunch of special sushi rolls, all artfully prepared, standard and sweet \u0026 sour  miso soups (the latter was a nice little surprise) and a soft shell crab tempura (awesome). They have a small but excellent range of Sake available for a fair price, too.  \n\nWhen a Queens guy like me ventures into Brooklyn for an event at 7 and is hungry at 9, the risk of wallet-emptying high-pretension experiences is significant.  I'm glad I read between the lines on the lukewarm Yelp reviews, and got myself a great meal at Miso. Like another reviewer mentioned, they sure seem popular with the takeout crowd.", "author": "Roberto M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-16", "description": "My husband and I just left MISO in Dumbo, Brooklyn for dinner.  We sat at the actual sushi bar and 2 VERY disgusting things happened in front of us. \n\n1. There was a HUGE fly in the front sushi counter where all the sushi is kept - the fly literally landed on all of the raw fish and asparagus in the counter and they finally got the fly out of the counter but they did NOT throw away the fish / asparagus that the fly was crawling all over. We watched him use that fish for a couple sitting behind us at the restaurant. I wanted to throw up thinking about how gross it was. \n\n2. The WORST most repulsive thing I have seen in my entire life at a restaurant - The sushi chef was cutting his finger nails and toe nails in front of us, behind the sushi bar in between making sushi rolls. \n\nI couldnt even continue eating, we asked for the bill, paid it reluctantly and left. The bill was 70 bucks and we both literally were repulsed and didnt even eat after this experience.", "author": "Marie S."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Miso Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "40 Main St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jSilEFgtSJkNdvNbljT01Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188588388"}