{"aggregateRating": {"reviewCount": 110, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-03", "description": "worst service ever. the sushi is alright, but it's a bit overpriced. \none of the servers mixed up my order and then charged me for the roll i didn't want (or eat). When i pointed out i never ordered that roll she said, \"It's not my problem.\" never going back here again.", "author": "Rian R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-02", "description": "It's a cozy place but the food is YUK and the waitress rolls her eyes. \n\nThe fish tastes a bit off. It's served warm or at least room temperature, which I find really disgusting when I'm eating raw fish. I'd rather eat room temperature ice cream.\n\nThe sushi/sashimi is cut in these huge piece, so you end up chewing on a thick, bland, off, warm piece of raw fish. Not my idea of heaven. Also, my girlfriend found a piece of cartilage in one of her pieces and couldn't finish her lunch.\n\nBelieve it or not, the sushi chef at Bridge Fresh actually makes really good sushi. It's not extravagant - it's what I would call \"lunch grade\", but it's fresher than Peas and Picks or Miso, and it doesn't have the goopy mayo that the guys at Foragers serves, unless that's your thing. (I like to keep sushi simple - seasoned rice and fresh fish)", "author": "Joe B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-22", "description": "Miso's sushi is neither the greatest, nor is it the worst. It is typical of the kind of non-Japanese sushi restaurants that far outnumber the genuine ones in NYC. Charmless and unoriginal, their fish is usually fresh, service efficient, and most importantly, they're there - there's no other place to get sushi nearby. Certainly it's as good as the monied hipster Dumboites deserve.\nThe closest genuine Japanese place, Hibino, is a good 30-minute walk away. Miso serves a purpose - it offers a decent, if unspectacular dining choice in an under served area full of people with more money than taste.", "author": "Zando E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-31", "description": "Miso is definitely just a joint you go to for an insatiable sushi fix. Sushi was mediocre and the prices aren't too crazy - about $7/roll or $13/special roll. I had 2 regular rolls, spicy tuna and soft shell crab, while the bf had 2 specialty, King Kong and Passion. My favorite was absolutely the soft shell crab but the bf loved his King Kong, a close second for me. The spicy tuna tasted kind of off/fishy and the passion didn't taste like much of anything. There's good lighting if you wanted to go for a date and the service is acceptable, albeit very slow.", "author": "Katherine N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-09-30", "description": "I agree with everyone else.... this place is OK. But when it comes to eating sushi I really do want better than just someplace that is good enough. But the $7-8 two roll lunch specials are a good price and I think they could easily be split between two people.", "author": "Farrah T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-09", "description": "This place is the worst Japanese restaurant I have ever been.  Other people are nice giving them 2 stars, if there is negative rating, I would give them -5.  The don't even use Japanese rice for sushi, they are using cheap Chinese rice instead and charging you Japanese restaurant price.  I have been there twice, first time was back in 2007 and just ordered lunch there today.  I did not expect a big different but actually it got worst.  I would never go there for lunch or dinner.  Good luck to all of you if you are planning to go and give them a try.", "author": "Gucci S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-22", "description": "No one chooses to eat at Miso. You eat here because you have to - there aren't any other options for lunch in Dumbo. Given that, it's not so bad.", "author": "Judith C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-14", "description": "decent sushi - not good, not bad. but it's all you've got in dumbo so make do! the staff is nice, the menu is pretty varied, but nothing really stands out. on the plus side it is never crowded, the food comes out that fast, and it's not that expensive for the decent quality.", "author": "Yee C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-31", "description": "$8 + 2 rolls + miso soup + not having to leave my office on a gross day = happy lunchtime delivery option.", "author": "Ilana K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-18", "description": "Went there on a whim few months ago when in the mood for some sushi. The sushi was average. The service was respectful and attended to us, but was a little difficult to understand at times.", "author": "Chris W."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Miso Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "40 Main St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jSilEFgtSJkNdvNbljT01Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188588388"}