{"aggregateRating": {"reviewCount": 110, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Popped in for a quick bite after getting my nails done around the corner.   The enjoyed an order of edamame, gyoza, miso soup and california rolls, washed down with a Kagua.  I can't help but heart a place that serves Kagua, one of my favorite ale's.\n\nThere is plenty of metered parking in the area.  That way after you enjoy a great meal you can take a nice walk around and enjoy all the sites and shops.", "author": "Yasmin R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "This is such a great sushi find in dumbo!! It's nothing fancy or high end like most other things in the area. It's super casual and affordable and to top it off, 100% kid friendly! For starters, the service was great. They were very accommodating and quick. My kids loved ate so much food. From dumplings, edamame and so much chicken friend rice. They really enjoyed it. My husband does not like sushi so, he enjoyed the teriyaki chicken. My mother in law and I enjoyed so. much. sushi! We have no complaints however, we do have a 1st, 2nd and 3rd favorite! Peep my photos for that info! Overall, good experience! Would for sure come back here to this location. Especially if I'm ballin on a budget!!", "author": "Chelsea W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-27", "description": "The food here is so ...AWFUL. I ordered a miso soup, salmon roll, and chicken fried rice . The miso was ok, the salmon roll had an awkward taste and the the chicken tasted like rubber. I left the entire plate of chicken FULL. This place is overpriced just because of the location. The service here is terrible as well, the waitress was rude, she didn't even come around to ask how everything was, and the place is the size of a closet. I'm never coming here again, waste of money,time and I left hungry.", "author": "Mackenzie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-05", "description": "Today for lunch I order sushi at Miso and the delivery was pretty fast. I had a lunch combo for 12$ which included 2 rolls ( salmon avocado + spicy shrimp tempura ) + a small salad. Everything was good.", "author": "Carola B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-18", "description": "Pretty overpriced for what I got- 2 sweet potato rolls and two pieces of inari sushi. The sweet potato rolls were pitiful... not even sure if that was sweet potato... it was unnatural looking and 99% fried.", "author": "Sarah T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-29", "description": "We came here wanting to eat Sushi..... and we left here.... wanting to eat Sushi.... \n\nThey should stick to making Chinese food!\n\nWay overpriced which is the biggest tragedy of the experience\n\nEM", "author": "Erick M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-24", "description": "Came here to try some grub since I pass this place all the time on my way to work. \n\nThe sushi was pretty good! I got an eel and avocado roll, my boyfriend got a rock shrimp roll. They were rolled a little loose so when trying to pick a couple pieces up some of them unraveled and fell apart lol. \n\nThe entreé portions are so HUGE. I ordered the pork Katsu don and my boyfriend got the chicken fried rice. \nTable service was spectacular but the food we ordered a little underwhelming. \n\nProbably will only come back for the sushi next time.", "author": "Shayna M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-19", "description": "This place is hilarious...\nI guess if you don't like food, you might like this place because at least it's entertaining...?\n\nThe music is this incredibly loud, booming, patriotic classical. Think trombones.\n\nThe hostess makes personal calls. One after another. So enthusiastically, I heard them from the other end of the restaurant. I mean, girl, do your thing, but at least try to be sneaky about it.\n\nI'm 95% percent sure the gyoza were the frozen ones from Trader Joe's.\n\nThe avocado tasted like butter...? A slimy green butter.\n\nI tipped 20%, but the waitress was still audibly unhappy when she looked at my signed receipt. \n\nAnyway...\n\nI'm going to the cookie place across the street so I can actually eat something.", "author": "Natasha P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-08", "description": "Pretty decent Japanese place.\nThe food was really good (the pork gyoza really hit the spot!) and the service was also great.\nOnly thing is the ambience leaves a lot to be desired.  It's a very outdated looking place and it was empty with no background music or anything playing so we could hear the chefs yelling at each other...if anyone else had been there we would have been listening to each other's conversations. \nThat being said, it's a comfortable little spot as long as you're not looking for a super romantic date or anything.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "Staff not good at all, the waitresses came every 1 minutes to bother us, and taking off the food without i ask for it. \nThe rice was really bad also", "author": "Murilo B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-14", "description": "Staff ridiculous!!!! The rice of sushi was disgusting and the woman who served us was completely annoying", "author": "Nat N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-18", "description": "Just left this restaurant and first off must say all the sushi and food I ordered was horrible. I was really expecting it to be much better just being right in dumbo but it was absolutely disgusting. Go anywhere else but here", "author": "Iman D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-09", "description": "$18 chirashi \"don\"lunch special including miso soup this afternoon... I was hungry!\n2 each tuna salmon yellowtail one scallop one salmon roe one uni with side of rice \nfish fresh enough large  portions only thing not super fresh uni and salmon roe \nnice detail of pickled daikon and one other pickled  veggie ...\nfree very good green tea ..very generous with the refills ..\nmiso soup one of best I have had loaded with loads of mushrooms tofu seaweed and good umami flavor ...\nvery filling lunch ...\nother options for lunch super reasonable $12 2 rolls with miso soup or salad \ncute standard tiny japanese restaurant space \nneighborhood spot- not destination for sure \nif in the nabe check out as apparently not many japanese in the area", "author": "anabela D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-15", "description": "Miso is decent enough for what it really is: a Chinese-owned take-out Sushi Joint. The take-out menu \u0026 atmosphere make it seem like a special Asian-sushi-fusion cafe, but it's really not. It's actually a pretty good business move- for a ritzy neighborhood like DUMBO. There aren't much immigrant-run businesses around. Not even a greasy Chinese place. Miso does the job for sushi, for what it is. It could always be better.\n\nThat being said, I was satisfied with my takeout order. For the price \u0026 size of the meal, I would give Miso 4 stars. I got the sushi roll B Lunch special. The rolls were a good size (1 Tuna Avocado, 1 Eel Cucumber) with a Miso soup (had a few cubes of tofu, nori kelp, \u0026 enoki mushroom). I also appreciated the fresh large pieces of pickled white ginger \u0026 leak-proof soy container. \n\nHowever, taking off a star, I wasn't a fan of the tuna being mashed up. The eel was okay, but slim pieces. They're generous on the fresh veggie in the rolls. And after a few sips of the soup, I started to realize how flavorless it was \u0026 pretty sure it was just flavored soy water. It all looks good \u0026 okay at first bite, but then it's not \u0026 becomes just..okay.\n\nWhen I went to pick up my order at 1:30pm, I was surprised to see the place pretty busy, with 6-7 tables \u0026 a couple at the counter. 2 cashiers, one on the phone, one taking in-house order. \n\nIt sounded like the workers were speaking Mandarin \u0026 the head waitress was running around \u0026 yelling from the back of the restaurant for a family at the front to sit themselves. Honestly, this is just how Chinese people are- fresh from Mainland China. I'm being totally objective. For an overpopulated country, customer service is always abrupt, quick, apps CAN come after the main, it's 1st come, 1st served. There are also no FDA rules, so the review like cutting finger nails at work, is not a problem for a 3rd world country. And yes, since there's only one race, racism exists. \n\nThis is not to say that this is okay for the workers at the restaurant to do. I've never witnessed this at restaurants in predominately immigrant neighborhoods, But it just sounds like, from the reviews, the workers don't KNOW any other way. \n\nI don't know if is go back for the food, at first I thought it was a good deal \u0026 was excited about the menu. But the food could be better.", "author": "Joyce C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-27", "description": "I'm a recent New Yorker and one thing I noticed VERY quickly is how insanely picky and hard to please New Yorkers are!\nSo I don't pay much attention to negative reviews and thank goodness I didn't! This was pretty amazingly delicious and I am a sushi fanatic.\n\nThe vegetable tempura was perfectly crispy and tasty. The 2 rolls I had were so fresh and yummy. \nAnd let me tell you, the hubby is not always excited to go to a sushi place as he doesn't like sushi but he LOVED the appetizer and his chicken dinner. I tried the chicken and it was really good.\n\nOverall, really good. The biggest negatives are the long line, tiny space and LOUD service. But I guess those are kind of expected in NY lol", "author": "Zei K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-13", "description": "I usually do not write negative reviews but this experience warrants one.  New to the area, I've been trying out some of the local restaurants.  I'd walked past this restaurant several times and it was always empty but I just assumed it was the timing...\n\nI called Miso Restaurant and placed an order for two Chicken Teriyaki dishes.  I sent my daughter downstairs to pick up the order.  For now, I won't even discuss how this spot is NOT authentic Japanese.  The chicken tasted like rotten meat and some type of chemical.  Almost like turpentine.  It was completely inedible.  My tongue is still tingling as I write this review. What the heck did I just ingest? \n\nI immediately called Miso to report that something was really wrong with the \"Chicken Teriyaki.\"  The woman who answered the phone became angry and told me the food was from the lunch special. Huh???  I told her I'd just placed an order at 6:55pm for dinner entrees.  (Cost: $37 Why were they selling me food left from some lunch special?  Was so confused... What?!!)  She went on and on saying she didn't want to take the food back or issue a refund or credit --  but then agreed to take the food back.  \n\nWhen my daughter returned to the restaurant with the order, the woman snatched the bag from her and without checking anything, accused her of eating it.  Well, yes, we bought it to eat BUT the food had not even been fully unpacked.  I'd only un-bagged one order, tasted the chicken, which smelled bizarre, and then called the restaurant back.  My daughter showed her that the order was still intact.  The woman then snatched the receipt from my daughter and yelled, \"Get out!\"  \n\nWhat?!! Incredible!!!  \n\nDistraught by the treatment, my daughter called me on her cell.  My husband then called Miso and before he could get two words in, the woman hung up the phone.  I'm am so disgusted at how rude an establishment can be when you are PAYING THEM for a service!  \n\nSo, after meditating, I decided that first thing in the morning I'm contacting the Health Dept. and am going to arrange to have this piece of chicken tested.  There is no way this rancid meat isn't also tainted with some type of chemical.  Miso Restaurant in Dumbo is horrible!!!  Just horrible!!!", "author": "Julie G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-05", "description": "They raised prices and now it's outrageous for what it is.. takeout sushi", "author": "Suzie I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-27", "description": "Cute eatery with decent lunch specials....I've gone two days in a row and ordered the same dish (The 2 Roll lunch special - Spicy Crunchy Salmon \u0026 Rock Shrimp Combo). It comes with a small Miso soup which is good. Both times I've set at the bar. The service is quick. I'd return to try some of the other dishes.", "author": "Elizabeth M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "The fish was incredibly fresh (really, the sushi was delicious!) and service was great. We were looking for a good, affordable meal in DUMBO close to the waterfront and we found it! We'll be back next time we're in the neighborhood for sure.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Came in last night with my mom before a play at St Ann's Warehouse. The sushi was so fresh and really good. We split the Jade roll, the one roll and another rolI cannot remember. I would definitely come back when in the area", "author": "Kate R."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Miso Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "40 Main St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jSilEFgtSJkNdvNbljT01Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188588388"}