{"aggregateRating": {"reviewCount": 110, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-02-17", "description": "Really decent sushi for the price.\n\nThe  staff is friendly, the ambiance is cozy. Not a bad place to try if you are in the DUMBO area.", "author": "Awilda S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-08", "description": "This place will likely go out of biz soon. Kind of a depressing atmosphere and very mediocre fish. Don't do it unless you're desperate.", "author": "Zach F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-27", "description": "I live in DUMBO and have ordered from here quite a bit. It's usually very quick service and the ladies who work there seem very friendly. The whole family seems very hard working to me and I appreciate the hard work they put into this neighborhood business. I usually get an assortment of vegetable rolls. There is an avocado roll that is a bit odd with peanuts in it, I would not recommend that one. But I love the sweet potato roll, it's crispy and just the right balance of sweet and salty!", "author": "Megan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-16", "description": "I work around the corner, and after 2 years I finally decided to try this place (after all, if you really want a quick sushi roll for lunch it's much easier to just grab one at Forreagers, right?).\n\nThe food was pretty decent. For $7 you get 2 sushi rolls (vegetarian ... I believe the fish ones are a buck more or something) and a soup or salad. The rolls were fresh, the rice was perfect, and they were a good size (not small but not big).\n\nThe problem is that the service is terrible. My friend ordered an ice tea. That never arrived and we never could find someone to tell them. I ordered the salad and got a soup instead, and they were less than friendly about exchanging it. It took a really long time for our rolls to arrive. Ration your water (which you need to ask for) because no one is going to refill it.\n\nThe service is one star, but the food is more like a 4, so that's why I'm going with a 3. I'm not sure I'd go here for dinner, but it's not a bad option if you want a sit down lunch (which, again, happens like very 2 years for me since no one really gets lunch breaks nowadays).", "author": "S H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-14", "description": "Just OK, nothing spectacular.  If you're in the neighborhood and crave sushi, go ahead.  But, nothing to make a special trip for.", "author": "Su S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-16", "description": "This is the worst restaurant visit of my entire life. First, we had to wait forever to even order. The waitress COMPLETELY ignored us trying to get her attention. Finally, while ordering, I asked if 2 rolls would be enough for one person. She didn't understand my question at all - clearly there was a language barrier but she could've been more polite about it. Then, we waited A FULL HOUR for our food. Again, we tried to get their attention to ask about our order but we were ignored. By now, we were really angry, telling people waiting for a table not to waste their time. We stood up, ready to leave, when finally my friend and I got our sushi. The sushi tasted fine, but then, the waitress walked up to my other friend who had ordered curry chicken, saying \"We're out of curry sauce, do you want something else?\" Can you believe it????? We'd already waited forever for our food, then when my friend and I were almost done with our sushi, my third friend has to reorder?!?! Seeing how incredible angry we were, the chef walked up to the table, told us not to worry and that she'll get her curry chicken in a minute. She did, and her food was fine...Then, I started chewing on something strange in my sushi. I thought it looked like a piece of plastic or a piece of a nail, but according to the chef, it was a fish bone. Still - Never in my entire life have I had a fish bone in my sushi (especially wrapped in the rice) BUT after reading another review here about the chef clipping his nails while making the sushi, I'm TERRIFIED and sooo grossed out over the fact that it was probably a nail!!! By now, we were so unhappy with our experience, and luckily, the chef told us we didn't have to pay for our food. But honestly, I'd rather have paid $40 for a delicious meal at an amazing restaurant with great service than waste my time at this crappy please...Trust me, you're making a HUGE mistake by eating here!", "author": "Joella S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-07", "description": "Stopped in before a Powerhouse Books event. It was very quiet--I was the only one eating in. (Very early on a weekday). Had two terrific veggie handrolls: peanut avocado and shiitake cucumber. The seaweed salad was extremely fresh and very large. Recommend the food, but not a ton of ambience.", "author": "J K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-22", "description": "Terrible food, bad service. My husband and I live in the 'hood and went for dinner last night. We've ordered from here occasionally and it is always \"fine\". Well dining in the food was terrible. Our waitress was busy almost the entire time with takeout orders in the back, and the restaurant also smelled bad (fishy, dirty)...never a good sign in a sushi place. We had several appetizers, the calamari was cut into huge pieces and was difficult to chew, the dumplings were actually good, and then the waitress forgot about our Oshinko until we reminded her and then she said, \"Oh, we ran out\". Of Oshinko? Really? They come in plastic bags from the Japanese specialty market. Our sushi was a bit too warm and was very sloppily cut. Rice was hard and did not taste fresh, I only ate half of my rolls and then we asked for the check. Gross. Don't waste your money.", "author": "Katherine B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-28", "description": "Wow! What a bunch of assholes! This was the only place open in the area due to hurricane, and they would not let me use the bathroom! Even though I was a previous customer!", "author": "Love P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-12", "description": "Went here on a Saturday night, it was not very crowded, the staff was screaming at one another and were not very friendly. The sushi was fresh and my rolls were good but I would not go back", "author": "A C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-06-02", "description": "Every time I order my extremely overpriced sushi from Miso, I know it is going to be just as warm, bland, and slightly off as it was the time before and the time before that. So why keep ordering?\nBecause It is the only japanese restaurant in Dumbo. \nBut I have recently quit trying. I'd rather walk do the park and fish something out of the river. Same result, less expensive.", "author": "oh C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-19", "description": "Eh,\n\nBeen here a few times, for lunch and everywhere in between. This place is a bit over priced i feel like. The sushi is nothing special there is no WOW facto its more of OK sushi and?. The tables are a bit small and i felt like they where not even placed. SO you are playing sushi tango. Then again this is the only sushi place in the area, so your choices are kind of limited. \n\nPersonally I feel like going there for lunch is you best bet, other than that you will over pay for no reason. \n\nThe service is OK, nothing special.", "author": "Michael J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-25", "description": "Yes, Yes it is one of the only options for lunch in Dumbo. \nI must say, if you are looking for Nobu um, then go to Nobu.\nThis place is an above average go to sushi joint. \nI think the real value is for folks that live in the neighborhood is take out. If you are a regular, you know what I'm talking about.  Their sushi entrees are a great value, their miso cod is fantastic and I order from here once a week.\nIf you want to be blown away per se, ask them what is on the special list. These are all super fresh catch fish that they change daily.", "author": "Jill M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-26", "description": "I agree with Sara, it was just okay.  My friend and I decided to stop here after Grimaldi's had a ridiculous line that we didn't want to wait for.  The service was nice and was a convenient place to get a quick bite.  This is not the place to lounge around for a long period as we were told we should be exiting after we were sitting around chatting for too long.  A cute place.", "author": "Dorim L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-10-06", "description": "I've work across the street from this place. When I first started and was unfamiliar with DUMBO I went here all the time (I love sushi). I stopped going there after being treated extremely rudely by the staff for maybe the third time. \n\nBut today my boss somehow convinced me we should get lunch from there. Yep, still extremely rude. And the food really isn't that great. I like the sushi guy at Peas and Pickles much better (and the avocado rolls and udon soup at Peas and Pickles blow Miso out of the water honestly).\n\nSticking to my guns and resuming my boycott.", "author": "Alyssa K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-28", "description": "I'm still a fan of this joint, in FACT, I moved to Dumbo just so that I can live closer to its glory. [not true]  I just figured that my review needed updating. I'm not even eating sushi right now because I have the condition called \"with child syndrome\" otherwise known as pregnancy, but husband [of former boyfriend fame] and I went for dinner just last night and had non-sushi entrees and were totally satisfied.  T minus 8 weeks until I can have some sushi, so they better watch themselves.", "author": "Sara L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-15", "description": "If you work or live in DUMBO, this is your option for sushi.  It's fine as a neighborhood place, but not one to go out of the way to find.  Atmosphere is comfortable.  The best deal is the lunch sushi special - two rolls plus salad or soup for $8.  Can't beat that.", "author": "Philip L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-05", "description": "Just because the prices are low, ignorant sushi snobs automatically assume the sushi is substandard.  Not true!  The prepared sushi can't be beat.  Weekday lunches are a bargain.", "author": "Dina B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-12-21", "description": "Cute, non-pretentious neighborhood sushi joint.  Very reasonably priced.  The sashimi (salmon \u0026 hamachi) was very fresh.  I loved their creative rolls.  We order the Valentine roll, which contained tuna, imitation crab (i wish it had been real), avocado wrapped with this paper thin dried vegetable(?).  Love love loved their Kamikaze roll!  A delicious combination of crunchy (a little tempura thrown in for good measure) spicy salmon, asparagus all lovingly wrapped in three different kinds of tobiko (black, classic red and lemon infused yellow).  So beautiful it damn near brought tears to my eyes.  I'll definitely coming back for more!", "author": "Melissa S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-11-24", "description": "Need to have a larger meal to assess the joint better. It's serviceable.", "author": "Jeff M."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Miso Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "40 Main St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jSilEFgtSJkNdvNbljT01Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188588388"}