{"aggregateRating": {"reviewCount": 110, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-06", "description": "It's not utterly terrible. The food is okay for the price. I usually order over the phone for delivery. Double check your order on the receipt before you accept the delivery. They have a tendency to get your delivery order wrong, probably because they often rush you over the phone. Sometimes the food is cold, too, once it's finally delivered.\n\nRegarding actual table service, sometimes the place is empty and sometimes rather full. Service could be better. The waiters don't exactly have the most welcoming attitude, but not rude. They also sometimes serve your appetizer way after your main entree which is strange.\n\nDouble check to make sure they're open first because they close for the few hours between lunch and dinner service. But overall, it's not a place I would be inclined to recommend to other people.", "author": "Rae Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-29", "description": "Decided to sit and eat lunch in the restaurant today rather than doing takeout - was concerned because of all the Yelpers complaints about the service but ultimately service was fast, especially considering all the tables were full.  We got complementary hot green tea but did have to request ice water twice.\n\nFood came out fine: the sushi premium platter had 4 pieces plus a salmon avocado roll which were solid and the spicy shrimp and spicy salmon rolls my coworker had were also solid.\n\nAll in all, in and out in 35 mins.  Not bad at all.", "author": "Jenn E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-16", "description": "Reliable local sushi for DUMBO. Good quality fish, quick delivery, nice people.", "author": "Daniel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-18", "description": "We had the Shrimp Pad Thai and a sampling of many rolls! Expecting to get tiny shrimp in the pad thai, we were greeted with several large shrimp in a mound of noodles!  The rolls were extremely tasty! Dragon rolls the best! Screaming daily take-away to me!  We will be back and recommend to others! Quality food and really good prices!", "author": "Beth M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "I literally eat here once a week and they are my favorite easy sushi spot. They are reasonably priced, the fish is fresh, and I love their miso soup.", "author": "Gveve C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-13", "description": "Never got to try the food because they are racist. Me and my boyfriend waited for a table for 10 minutes and then got completely shiested when an asian couple walked in. She acted like she had no idea. Won't be giving this one another chance.", "author": "Marisa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-31", "description": "Since my last review, I have been to Miso Restaurant about five times now and each time I leave happy and fully satisfied. \n\nThey have a great lunch menu and yesterday I ordered an avocado roll and spicy rock shrimp roll. During lunch you also get a choice of miso soup or salad- I always choose the miso soup. It is so tasty and refreshing. Two rolls and a soup all for less than $10. I'm a foodie but I live on a budget and Miso definitely gives me a bang for my buck!\n\nI have also tried the shrimp dumplings. They are so delicious and so is the dipping sauce. Its the best when you order to go and walk down to the park past water street. Eating delicious sushi while enjoying the view by the Brooklyn bridge- it doesn't get better than that!", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-05", "description": "Our go to spot. The food is always good and the people who work there are pretty nice. I'm not sure why there's so many negative reviews but I go here all the time and have yet to have an issue. We even walked in while they were closing for lunch and they let us stay. No complaints here :)", "author": "Aria S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-06", "description": "I ordered in from Miso Sushi last night. My roommate and I ordered about 5 sushi rolls. \n\nOur order arrived very quickly. However the Sushi wasn't great; it was just average. My view is that a good sushi bar ought to make better sushi than the ones on sale at Duane Reade. Perhaps pre-packaged sushi making has been perfected to the extent that the average sushi bar simply cannot compete. \n\nWe received very little soy sauce in our order considering the amount of sushi we ordered. Additionally they mixed my rolls with my roommate's rolls in 1 package even though we clearly said it was 2 different orders. \n\nThe rest of the menu looks interesting. I plan on eating at the restaurant and hopefully posting a more positive review.", "author": "Jimmy G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-08", "description": "Worst experience I EVER had in a restaurant. There were so many unacceptable situations, it would take me too long to write them down.  Very rude stuff, at one point one of them literally  grab my unfinished miso  soup out of my hands. Food wise it's very meh, nothing special about it.", "author": "Ginna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-05", "description": "The lunch specials at Miso Sushi are a good deal- 2 rolls and a soup/salad for $8. This is the same price for a roll made by the bodegas and market delis. Wouldn't you rather get more and a side from a Japanese restaurant? Ask for your rolls to be hand rolls. They stuff them silly. More innards than what's in a regular roll.", "author": "Wilkie J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "dont compre it to swanky sushi places. for me its value for money and got a good selection of fresh fish", "author": "Ram M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-26", "description": "In the past I have enjoyed the sushi but last week my wife ordered sushi and we both got food poisoning. We had banzai roll and signature roll. She was far sicker than me and vomiting the whole next day. Luckily I was able to get through work the next day. I have been eating sushi for decades and have never gotten sick. I called to tell them we got sick and they just said sorry it is raw fish. Absolutely can not go back again. Even a little afraid to eat any sushi again.", "author": "James W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-12", "description": "I don't know why there are so many negative reviews. This place had always been solid. Fast service and event food especially for the area. I always get the lunch special with spicy crunchy salmon.", "author": "Tanya M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-07", "description": "It's good overall not the best taste fish . Sometimes it was too fishy but service is good .over priced for sure should be cheaper", "author": "Filippo B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-01", "description": "The people that work here are RUDE and RACIST! Came here after being in court all day there were no other customers in the restaurant. We ordered our food and drinks. When our waitress brought out our canned iced teas we noticed that they were expired so we let her know and she brought them back. We told her we will just drink water. The waitress told the other people working there that the drinks were expired and the other employees proceeded to talk about us in their language laughing and just being rude for no reason at all. We noticed this so I asked them if they treat all their customers like this? They all stopped talking. I let them know that this is why their restaurant is always empty because they don't respect people that come in to their establishment. There we NO CUSTOMERS so why would they just throw away money by being rude to us for no reason? Bad business on their part. We didn't do anything but come in and order food but we refused to be treated like shit. We told them to cancel our order and walked out. \n\nWe went around the corner to Gran Electrica where we were treated with respect and had some pretty good food.", "author": "Dana L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-26", "description": "It was nothing special, but you know, not bad either. I had chicken teryaki and it was tasty. My friends ordered some of their special sushis and said it was good. SO overall, good experience, but not necessarily to keep me coming back for more. Also, service was pretty bad. Our waitress was yelling across the restaurant to other customers.. bit distracting and rude.", "author": "Nadhia F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-24", "description": "After ordering take-away from Miso, I saw the chef spit a massive ball of green gew behind the counter where he cooks. Hopefully in a bucket or sink. I was so gross, I had to toss my food. Will never eat there again. I'm pretty sure it's not the first or last time he did that. He didn't even try to hide it.", "author": "TheNorwegian N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-29", "description": "Wow. This must have been the worst lunch I have had in a while. \n\nWe ordered salmon soba and shrimp tempura. ALL DISHES ARRIVED IT TO-GO CONTAINERS!!!! \n\nSalmon soba was absolutely tasteless and the waitress asked for hot sauce, did not know what it was!!! Shrimp (2) came with some unrecognizable deep fried pieces of something and over white, tasteless rice. \n\nService is awful, rude, and inattentive. The restaurant was cold and the atmosphere was pretty terrible. \n\nStay away!", "author": "Chris P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-18", "description": "Very good sushi!!!! I have eaten sushi at a lot of places in Manhattan and am really starting to get tired of eaten mediocre, over priced, fish. This was  good change. \n\nI particularly recommend the spicy salmon.", "author": "H Dan I."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Miso Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "40 Main St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/jSilEFgtSJkNdvNbljT01Q/ls.jpg", "@type": "Restaurant", "telephone": "+17188588388"}