{"aggregateRating": {"reviewCount": 3, "@type": "AggregateRating", "ratingValue": 5.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-08", "description": "The owner of this restaurant is very friendly. They serve the basic American Chinese as expected but well worth the price. The look of the establishment is as that of other Chinese restaurants! It's clean, well lit and rodent/bug free. I will continue coming as long as the food continues to be fresh and made to order", "author": "Angela M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Restaurant needs remodeling and better security measures to keep the folks from messing up the windows, walls with their hands and graffiti devices. Restaurant deserves a good remodel. Make it look more presentable and you will get even more customers! Instead of the awning sign you have outside, replace with more of a modern sign like the one next door to you guys. Use a nice Asian font with a symbol at the end of a Chinese dish. Light it up and watch the customers roll in. Change the materials of the place using a wood style scenery. This will attract the eye and make people come in to taste your delicious food. I'm telling you, this will help.", "author": "Jonathan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-28", "description": "While the exterior and location is gritty (a couple of blocks from the York Street station but feels a world away from gentrified Dumbo), this is great takeout Chinese food - and I've searched long and hard for a good option in Brooklyn Heights/Dumbo. I'll definitely return.", "author": "Annie F."}], "servesCuisine": "Chinese", "priceRange": null, "name": "First Wok", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 York St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/ldnf69UrsF5o-isw8lClvw/ls.jpg", "@type": "Restaurant", "telephone": "+17188524383"}