{"aggregateRating": {"reviewCount": 40, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-17", "description": "One of the pricier bodegas around, and I got suckered in to coming here when I needed some organic-y bites.\n\nThey have a kitchen than has some decent prepared meals, but nothing spectacular (or cheap). But if you're looking for Amy's soups, Chobani yogurt or some other random brand organic foods they might just have it here.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-17", "description": "We were starving and even so the food was gross. I asked for a turkey club and he gave me one that was sitting in the display and said it was fresh. I told him to warm it up at least and it was frozen on the inside when I bite into it. The guy in the deli was clueless to his own menu when I observed him helping the next person on line.", "author": "Sindy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-01", "description": "Terrible smoothie. Kiwi Apple, the apples aren't even peeled. Chunks of red delicious skin mixed in with the smoothie because it was poorly blended. I would definitely not recommend. \n\nEverything here is overpriced. There are other places in the neighborhood that can get you the same thing.", "author": "Danielle Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-18", "description": "Good beer selection. Didn't order any of the sandwiches. They have a lot of chips and random stuff for sale too (car phone charger? what?). But again, good spot to go for beer.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-09", "description": "Worst experience I have ever had in a restaurant in NY.\nThey didnt care about the customers.  All of my food came out wrong and when I finally received my food, it was disgusting and barely edible.  \nI DO NOT RECOMMEND.", "author": "Shelley H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-04", "description": "I can't speak for anything they serve here besides their bacon egg and cheese on a roll. I've had some good b.e.c's but this one is superb! The bacon is cooked just right, eggs are fluffy, cheese is melted perfectly, and roll is puffy and buttered. Would never expect it from a place like this (gourmet snacks, drinks - bodega style) but I'm glad I had it the first time cause I've had it dozens after that.\n\nYay for chop chop!", "author": "Crys Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-25", "description": "Its weird- I dig this place compared to most bodegas. Yet, depending who is working there- just buying something can be problematic. \n\nI had one of the guys chase me down on the street because he couldn't get the credit card machine to work after swiping my card. And then he couldn't get it to work for another 10 minutes. It was weird.", "author": "David F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-01", "description": "I have come here twice, both times while I was rambling around Smith St and realized I needed a snack (well, maybe NEED is a strong word, but certainly wanted...).  \n\nThis place is pretty gourmet, so the prices are a little high but you can get fancy bottled beverages like Kombucha and the like, as well as a bangin' salad complete with tasty grilled salmon and a great selection of veggies.  YUM.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-17", "description": "Chop Chop is a cute name. I stopped in here with a coworker for lunch today and was glad to have another option in the general vacinity of downtown (yeah, I know this is Cobble Hill - thank you for being walkable from my office!). \n\nSo a few things. Salads are only thirteen dollars if you put either a ton of things on them or if you get meat or something. Being that I don't get meat or cheese on salads, well... my very delicious field greens/grilled asparagus/kidney beans/dolma salad was seven bucks. I may have also bought myself a four dollar bag of organic vegan chips, but my lunch still wasn't more than I would normally pay, and it was damn good. So. There. \n\nAlso, our experience with the service (since others have complained about it) was prompt and friendly. I wouldn't come here all the time because it didn't bowl me over or anything like that, but I like having it as an option. I'm a big fan of little markets with good-for-you choices.", "author": "Elishevah G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-23", "description": "With no specific destination (other than \"food\"), we happened upon this place on our way to the subway station. A small grocery/deli, they also have specialty sandwiches and create your own salads. Coolers full of beers, wines, waters, juices, and sodas line the back walls.\n\nAs we ordered, it turned out they were out of some ingredients, to the point where we almost asked \"What DO you have?\". I eventually chose the turkey club and a can of Dr Pepper. The sandwich was big enough (and came in a to-go container) that I ate half for morning eating and the other half for lunch time eating.\n\nDecent enough prices and accepts credit cards (sometimes difficult to find in Brooklyn).", "author": "Kristen O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-16", "description": "Open early and late, this bodega has everything from green juices, smoothies, made to order salads and other organic treats!! They also have a good selection of organic food in their grocery area.", "author": "Ashley D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-04", "description": "This is my first time in this place and I'm just upset I didn't start coming here earlier. Got the Greek salad an it was very good, well portioned, and the right price that and a can of did came out to 9.71.", "author": "Ali F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-07", "description": "Let's see. $8 for a soggy salad that filled about 30% of the container. Another salad was instead delivered as a wrap. Expired rotten melon. I could go on, but I won't go back.", "author": "John G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-07", "description": "Had dinner here last night, saw a mouse as I was eating. Felt disgusted, couldn't finish my food after. In addition management acted like it was completely normal around that area... Other than great service...", "author": "Andres F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "Got a coconut oil smoothie, pineapple mango. It's very good, not too milky. Will probably try their panini a sometime. It's like any other places in the city, quick healthy foods, not much seating. Good for grabbing a fast bite or salad to bring home.", "author": "Sara W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-09", "description": "OMG, I will never return to this establishment. My egg and cheese sandwich was cold and overpriced. The cashier was rude and it was clear that they simply didn't care about customer satisfaction, just the ol' mighty dollar. Please do not support this business. Waste of money!!!", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-20", "description": "I ordered a sandwich off their menu, it was made incorrectly and tasted terrible.  I ordered what is essentially a Reuben sandwich, but instead of putting coleslaw on it as listed, they put chopped lettuce... On a hot sandwich.  Yuck!  If they can't get a basic sandwich correct then I really don't see a future for this place.", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-26", "description": "Came in here to grab a Gatorade to cool down from this past weekends heat wave. The AC was on blast and the prices are decent. The staff was very cool. I sat down and read the paper as I waited for my friend. The deli sandwiches looked extra good. Whenever i'm in the area i'll have to try one.", "author": "Ron C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-02", "description": "Much more than a bodega. Soup was pretty good but I got the Ann's Special Sandwich and it's absolutely phenomenal. One of the best melted subs I've had in a long time. Highly recommended for a quick and quiet lunch.", "author": "Doug A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-26", "description": "i'll admit that i can't afford to shop here for all of my groceries but as a treat, i like to stop by for a sandwich wrap or something. \nit's a gourmet grocery and while small, they have prepared meals, an impressive salad bar, and lots of health conscious products. almost everything you pick up is likely good for you and nutritious, it's just pricey.", "author": "Denika C."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Chop Chop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rlBzYSGYqTEdIBAxRQq1TQ/ls.jpg", "@type": "Restaurant", "telephone": "+13473842254"}