{"aggregateRating": {"reviewCount": 40, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-24", "description": "it's 24 hours... BUT\n\nthe food and selection is pretty gross. it fails its attempt at being healthy and yummy. the salads are good, and there arent too many chopped salad places in the area, but i  don't find myself going there looking for a salad. everything is pretty bland, and once you heat it up at home, has a rubbery texture, and sometimes an off-putting taste. it's clean inside, but the food misses the mark completely. please get better!!", "author": "Justin S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-02-22", "description": "Organic crap is really nice if it's served hot and fresh. Luke-warm old-tasting food is a sad exercise in futility, organic or not. \n\nIt's too bad, because this place has the potential to get their act together and serve some gourmet sandwiches. But sandwiches need some soul, and whatever soul is left in Chop Chop is buried under the over priced mashed potatoes.", "author": "Lindsay K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-09", "description": "Yeah, I don't know what happened. Had I written this in January or something, I would have likely given them a 5 star review. Now... meh.\n\nNumber one, there appears to be some sort of problem keeping the place staffed. Several employees that I would be greeted cheerfully by on my near-daily visits are no longer there. There are always new people, and they seem to be getting progressively more and more sullen. The GM has been hanging around for the last week and is pushy and kind of condescending to the staff. The manager never seems to do much else than stand outside, sit inside and eat, or gruffly make admonishments to his staff. It kinda sucks.\n\nI mean, all that aside, the products they sell are fantastic, if not hideously overpriced. I cannot be bothered to purchase $6 tortilla chips or $8 guac to go with it, but their selection of bottled teas and waters are quite fine. I have enjoyed their tossed salads, although it remains beyond me how expensive salads in this city can consistently be. I've enjoyed their breakfast sandwiches-- quite good cheddar involved there-- and their paninis are also tasty. I've yet to find a foreign object inside any of the food there, but I shan't hold my breath. \n\nI'm not sure what's going on over there... they recently took out all the fresh fruit display at the front, which was one reason I would go in. I'm still underwhelmed by the people running the place. For the time being, however, the food is still faring pretty well.", "author": "Danielle G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-28", "description": "I like Chop Chop for lunch or to pick up a cold 6 pack of hipster beer after work. \nThe prices are alright and the food is fresh and yummy.\n\nIf you are ever in the mood for an overindulgent  $13 salad (as I sometimes am) you can do that here and it will be worth your money. You can also make a super yummy $7 salad. Whichever.", "author": "Taueret M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-20", "description": "I love this little grocery store!  Everyone is so nice here.  I like being able to pick up some good food in a hurry.  Only downside for me is their guacamole.  I've tried it many times because I love guac, so I keep hoping it won't be so spicy.  But every time it is.  I guess I'm a sucker, but it always looks so tempting right by the register.  Sometimes it's medium spicy, which is still too much for me.  I know lots of people like it spicy, but I wish they had a mild option. Yes I'm a wuss. :)\nI still love this place!  I love their pasta, veggies, fruit, and salads!", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-22", "description": "I've tried three salads from Chop-chop, and each one got worse. How hard is it to mess up a salad? Don't buy the salads.\n \nOverall everything is overpriced. I bought a Ginger ale, that I thought would cost $1.50, I got billed $3.04!  I had three single dollars and a $20 in my wallet ( no change), and the cashier insisted on breaking my $20. So don't expect any courtesy even when buying an overpriced item.", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-09", "description": "Best create your own salad counter that I've been to in Brooklyn.  Other than that I don't really trade with the place for anything else.", "author": "Bob W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-11", "description": "This place could be so much better! I've gone in randomly and if I'm lucky, they'll have ready-to-go food on the shelf. I got a super great chicken salad wrap! But usually the shelves are half empty! I'd give this place 4 starts if I could get wraps to go everyday.\n\nBut they get 3 stars for a their salad bar.", "author": "Helena F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-26", "description": "I started buying salads here a couple months ago.  At first they were very tasty.  They are a little expensive but i could deal w it.  My problem is that they aren't consistent.  The first couple times I was there I chose the red wine vinaigrette dressing.  It was delicious but the last  couple times the dressing didnt taste the same.  It didn't even look the same.  Wasn't bad but I hate when I love something and then they can't replicate the same deliciousness.  On top of all that they are stingy w the lettuce.  Also croutons were so stale!  UGH!!!!  So upsetting!!!  \n\nNew bagel place opened down the block from them who sell salads for 6.95 and you get five toppings with it!  Haven't tried them yet but i sure will.", "author": "V F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-12-24", "description": "really not even decent.\nordered a turkey and brie sandwich - the bread must have been at least 3 days old, one slice of turkey and some extremely nondescript brie.  i had a hard time swallowing it without choking.\n\nalso - none of the staff spoke ANY english.\ni'm all about the melting pot - but if you work in food service in brooklyn, you should probably know what diet coke is.\n\njust saying...", "author": "Danny O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-27", "description": "Their ventilation system doesn't work anymore.  So you leave smelling like fried pork.", "author": "Matt D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-22", "description": "I can't say anything about their sandwhiches or wraps-- but their salads are overpriced and they really skimp on some of the added ingredients even though they charge a lot for them.  For example, for $1.50, they put about about 1/8th of an avocado in my salad.  Their ingredients don't taste all that fresh either.  Boo.", "author": "Michelle P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-26", "description": "was in the neighborhood and had to grab a quick lunch so stopped into chop chop and i got the one of there signature sandwiches but got in in a wrap instead..and it was def. on the not good side...it was grilled chicken with honey mustard,pepperjack cheese and roasted peppers...the cheese wasn't fully melted so it was dripping chunks of cheese and it had wayyyyy to much honey mustard where i had to just dump it out into a plate and eat it with a fork....my parents had the chicken parm hero and both didn't like it they both took like 4 bites and threw the rest out which was more then half...and i looked at it and it looked bad and even on that the cheese wasn't even melted..gross!!....so yea ill never go back....i will say i had the lentil soup which for a small was 4 bucks but was tasty...should have just gotten the soup..", "author": "caesar g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-29", "description": "I'm not sure that this is something to brag about, but I know how to eat cheap in Cobble Hill. (Hey, it's a talent!) Anyway, Chop Chop's lunch special blows pretty much everyone else away. On weekdays, for $6.50, you get a pasta dish (think penne with fresh mozzarella and eggplant or lasagna) and two sides (I like the spinach with garlic and the green beans with peppers). They aren't stingy with the portions, and everything tastes really fresh. If pasta's too heavy for lunch, an extra dollar will get you meat (fried chicken or grilled flank steak are there a lot) or for $8.50, you can have fish. I'm pretty sure this lasts till 5, so I guess it could even work as an early dinner. And for a cheap but filling meal, go for one of their $2.50 quesadillas with either guac or salsa. I've probably consumed about 50,000 by now and haven't been disappointed yet. If you're extra hungry, cough up for the Red Hot Blue tortilla chips and peach/mango salsa. Hell, just buy 'em anyway. Delicious!\n\nSure, the variety is lacking and the salad bar is entirely overpriced, but I'll give Chop Chop 4 stars (even though it may only deserve 3.5) because let's be honest: I'm lazy, and it's provided me with many a last minute and tasty meal.", "author": "Lesel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-06", "description": "Maybe I caught this place on a good day or something, (judging by the other reviews on here), but I have to say that everything I had tasted really fresh, and quality. My whole meal was delish....they made me a mixed plate in a large container of mashed sweet potatoes, broccoli rabe, sea bass, roasted root veggies, and prime rib. (They heated it up in the regular oven....maybe that's the key??) and it was fantastic for about $1-2 more than a meal at Mc Donald's! Could it be that you guys are just used to overprocessed, over-seasoned restaurant fare? Or, I donno, maybe I just got lucky, but I had a really good, healthy meal for really cheap, and walked away feeling pretty smart.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-22", "description": "Don't do it!!! The boyfriend and I ordered 2 sandwiches and they somehow managed to completely messed up our orders. 2 tasteless sandwiches, which were nothing close to what we actually ordered, cost us 18 dollars..... think twice", "author": "Jonathan Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-24", "description": "This place is average. The only thing I actually like from this place is their Ginger Beer. One complaint I have is the....Customer Service. It's crap. Ahhh. Every time I go there (sometimes alone, or with my mum), the eyes of the cashier/cooks in the back seem to follow me. I dunno, they're strange. Then, when I pay, the cashiers (different one every time I seem to go), keep staring at me. I don't recommend going to this place religiously, only if they have something you can't find anywhere else.", "author": "Emmy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-03", "description": "this place gets a review because i found my pancake mix here.. this is the pancake mix people think i made from scratch by the way... stonewall kitchen farmhouse pancake mix (SO generic yet with a little dash of something cinnamonny it's your secret grandma's recipe.. not that my grandma ever made pancake now that i think of it...hmm) anyway, small and cute.. chop chop is easy access! \ni loves it", "author": "Sasha N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-15", "description": "I don't get the bad reviews. I always order the salad and It's been the best I've had in any deli in the city. Who gets fresh croutons anymore?\n\nOk. I get it's annoying about the empty shelves, but have you been to other gourmet stores lately. (...ex. Jefferson market?). Times are hard. \n\nI love this place. I can't afford to eat in restaurants everyday and I'm not a good cook...  so hang in there Chop Chop!", "author": "kiki p."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-08", "description": "This place is terrible. Salads are scary and ingredients are not fresh. Bought a sandwich the other day and it was stale! The only that's good about it is the large selection of packaged ingredients. Food poisoning waiting to happen!", "author": "Mitch G."}], "servesCuisine": "Delis", "priceRange": "$11-30", "name": "Chop Chop", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "126 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/rlBzYSGYqTEdIBAxRQq1TQ/ls.jpg", "@type": "Restaurant", "telephone": "+13473842254"}