{"aggregateRating": {"reviewCount": 156, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-23", "description": "Typical diner food not much to say. The older gentleman that waits tables at night is really cool but the guy at the register by the entrance is a racist asshole. He is rude on the phone when you call and he is rude in person. He asks where you live and even if its 3 blocks away he will say they don't deliver because its too close to the projects!! WTF??? I don't know if he is part owner or manager or just works there but he should NOT be employed anywhere that involves dealing with customers because he is NOT a customer friendly person! Go spend your money elsewhere.", "author": "Luis E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-25", "description": "Much improved lately. \nGood place for a laid back brunch when you just want to talk to your companions and not fight the crowd. \nExcellent BLT (get it on a croissant!) and love the fried everything appetizer sampler. \nOh, and the super garlicky Greek yogurt tzatziki that comes with the gyro will completely knock out a yeast infection within hours. Just saying.", "author": "Brandy E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-13", "description": "I literally watched the cook clinch(spit) on two sandwiches, when I confronted the manager he laughed it off.", "author": "Mikey M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-22", "description": "Pardon the outdatedness of this review, I just remembered I'd never documented a horrendous visit.  Summer 2010, ordered the nachos, received some chips topped with dry crumbly ground beef and Kraft singles. I kid you not. I hope it's improved since then.", "author": "Brian G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-12", "description": "This is the worst restaurant ever. Ignore the 30-45min deliver window. I have never received a meal in less than an hour and a half. And when you call to get a delivery status they say \"it shld be there any minute\" 20 min later, still waiting. This has happened about a 6 times. I was giving them one more shot tonight, 2 hours later still no meal. How hard is it to make chicken fingers and fries? The 2nd time I called to  ask where the meal was he lied and said the driver left it w my doorman instead of delivering it. I called the doorman. Nope, all lies.  When I called to complain that I paid $20 and have no food, the manager said, \"so don't eat here anymore.\" Nice customer service.", "author": "Natalie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-20", "description": "Came here with my bestie. We weren't rushed to leave after finishing and paying which is super awesome. I hate that feeling of being pushed out. However it was late at night haha. But still. Great dinner food. Comfy booths. Perfect for late night eating.", "author": "Elizabeth C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-19", "description": "I grew up coming to this diner with my family. A few months I had moved away and now I came back to hang out and I completely forgot how great their food was! Oh how I miss their burgers! This spot is a good for a small group outing, it's not too pricy but the food is a bang for your buck.", "author": "Melina E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-17", "description": "Food was ok, standard diner fare.\n\nService was terrible, charged twice for a milkshake and when asked about it the waiter and owner both became confrontational, demanding that we pay.\n\nWill not be back again. The fact that they were almost completely empty during dinner hours should have raised a red flag. There are much better alternatives a block or two up.", "author": "Jon J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "Totally forgot about this place! It's a diner, sure, but they class it up a bit. I almost feel like I gotta behave more. Plus, they have outdoor seating, which is a cute touch. I have never come here at night. It strictly a day time thing. So, my buddies and I are usually the most obnoxious in the room.", "author": "William C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-13", "description": "Let me start this off with a blanket statement about ALL diners.  Why is it, that if you're serving coffee all day and constantly brewing fresh pots, that the coffee always tastes burnt?  I've been to many a diner and notice the same thing across the board.  Just curious.\n\nCoffee aside, my omelet was great and the service was friendly and attentive.  I sat closer to the front of the restaurant but the windowed area in the back looks quite charming.  I like to linger sometimes and never felt like they were rushing me out, a big plus when you've been made to feel uncomfortable by other restaurants in the area.\n\nDefinitely a solid spot for a proper breakfast in the 'hood.  Prices are good too.  Will go back next time I'm having an omelet craving!", "author": "Raquel L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-05", "description": "There are things I expect from a 24 hour diner. I don't expect perfectly seasoned food. I don't expect gracious service. I honestly don't - I understand what I am and am not paying for. I expect to eat something greasy and nonthreatening and possibly even comforting and to be left alone for a while to have long meandering conversations with my friends. And for most of my meal, a fairly empty Carroll Gardens Classic Diner served that purpose. And to be fair, I'm not a perfect customer. I have my faults. I ask for lemon slices in my water sometimes and for the chicken to be left out of a dish. If a restaurant isn't full, I will sit there for a VERY long time. I'm polite about it, but I could understand if I wasn't someone's #1 fave customer.\nAll of this was true before the last few bites of my pasta, when I saw an insect in my dish. It was rather in the sauce - probably had gotten in there in the heating/serving stage, not the cooking stage.\nAnd you know, shit happens. I'm not unreasonable about it, but like hell I'm not going to say anything.\nSo I call over my waiter and point it out to him. \nAnd here is where my expectations get dashed. At pretty much any eating establishment, I would be upset about the presence of visible insects in my food. I think that's pretty reasonable, you know? And at that point, yes, I do expect that it's the establishments responsibility to bear the brunt of that upset. What I mean to say here is yes, I do expect an apology.  I don't rage or yell or abuse, but I will be a little upset by the circumstances and really, I think an apology is appropriate or at least an apologetic tone. Ideally, they offer not to charge you for it, but I don't necessarily expect that. Again, insect in the food, not supposed to happen, pretty gross and upsetting. You know.\nInstead, the waiter tells me that 1) I'm wrong, that's clearly an ant and not a spider (which, of course, clears the whole matter up) 2) it clearly fell or flew into my dish (\"it's one of those flying ants, see the wings there?\" - no, i did not) 3) this is my fault because I have been sitting in this all-but-empty 24 hour diner for three hours eating my meal with a friend\nAnd yes, they charged me for it. And yes, I still tipped 20% because I'm a decent human being. But now I'm here and I'm saying my piece. That was hella uncalled for.", "author": "Reena F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-21", "description": "Beer Goggles, apparently, work on your taste buds as well.\n\nI'm not sure what this place is like during the day when the sun is up. \n\nI am certain though, that you will love their food around the wee hours of the morning after hanging out in the local watering holes. \n\nI -think- the food I had was delicious. Was it really? Who knows. It's sort of like when you order pizza from a place at 3am. It tastes delicious at the moment, but may not be something you'd order at 3pm. \n\nThat's why they call it beer food, and this serves its purpose in the area at the odd hours.", "author": "Mickey M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-01", "description": "You have been to better diners, but this is the one nearest to you, and is open 24 hrs.\n\nThe turkey burger used to have beef in it, and was good. Now I think it's just turkey, and is not good.", "author": "Devin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "We use to order from this place on seamless web, I never liked the food when it was delivered cause it is usually cold. I decided to walk in last night at 12am to eat here.\n\nThe waiter was really nice and very attentive. I am a big fan of good service even if the food is crappy... but the food wasn't bad at all... we started off with the fried calamari and jalapeno poppers. The calamari was nice and crispy and the poppers were great too.\n\nFor main course we had the club sandwich with turkey (it was an over load of turkey for me) but it was also not bad.\n\nI had a strawberry milkshake which was kind of a powdery drink... this is the only complaint I have so far about this place\n\nTry it out... they have an overwhelming menu with many many options maybe you'll order the right one..", "author": "Sera A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-27", "description": "A lot of places in this neighborhood close earlier than we expected, which is why we ended up at a diner. It was bustling with a hipper-than-might-be-expected crowd, and was reasonably pleasant, in that padded-vinyl-booth, traditional diner way. However, our party of three all agreed that the food was a bit below average, even for diner fare, and the (admittedly busy) waiters were hard to flag down. I wouldn't go out of my way to return.", "author": "Althea A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-24", "description": "First time I ordered anything from this place using delivery. Com I ordered a burrito and asked for no beans specifically. It came within fourty min and had no beans. It was a big delicious burrito and I was happy. Will order from here again.", "author": "Aleksandr S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-28", "description": "Came here late Monday, service was great very attentive , which is great, although normally doesn't happen. \n\nOrdered the Yankee bean soup and what they call \"disco fries\"-- fries with melted cheese and gravy. All was delicious, just gets three stars because diners are always (in my opinion) too expensive for their own good. \n\nService is what would incline me to come back. Much better than St. Clair's when going late night.", "author": "Vito P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-04", "description": "id give less stars if i could. HORRIBLE CUSTOMER SERVICE. i called for delivery and tried to pay with a card to which i was told is not allowed so i said okay hung up and waited. an hour later i called to see the status of my order and they had no knowledge of the order. for their mistake i asked if i could get a discount which was another no ( i would have been happy with $1 or $2 off) also i overheard the workers in the background being nasty about my call. So their menu is in the trash and me and all of my coworkers will never order from them again. Hope they are happy losing hundreds of dollars of orders because they didn't want to budget even though they made a mistake...", "author": "Its Me T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-10-23", "description": "One star for 24-hour delivery.  One star for awesome buffalo wings -- but then I take that one star back because at nearly a dollar a wing, it's not really worth it.  Minus one more star for always, always charging more than their menu on menupages states.\n\nMinus 3 stars for giving my husband horrible gastrointestinal problems about 30% of the time.  Last night was the last straw, when he had to get up at 3:30AM to violently vomit up the Mediterranean veggie burger in his gut.  It was the only thing he had eaten in the past 12 hours, so we are sure it was the veggie burger.  In the past, he's gotten sick several times from Carroll Gardens Diner's spinach salads, so he switched to the veggie burger, which he loves.  Well, loved.  (I think some of the other reviewers don't like it because it's not a typical veggie burger.)  Sadly, we will never be ordering from them again.  \n\nFood poison me once, shame on you.  Food poison me five, six, seven times...", "author": "midge j."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-16", "description": "The wee hours of Saturday, 14th of April I went to CGC Diner I decided to abbreviate the establishment the waiter was very cold since the daunting hour of the evening/morning I decide to stick with a  chicken avocado delight salad and a glass of water I had a enough salad to take home I specifically mentioned to the waiter I wanted the chicken and avocado that remained and not the potato salad nor onion my request was not granted smh listening skills is must in my opinion. \nMy aunt had a mini burgers/sliders the burgers were huge she seemed to be happy with it and my Uncle had a greek salad which stated the feta cheese was to big and way too many piece. \nI will not venture to that diner again  I would more than likely go to St. Clair located on Atlantic Avenue unfortunately the across street is not entering my brain at the present time.", "author": "kairis r."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Carroll Gardens Classic Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/0E6m5R12QtMTYkT-CB64VQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184039940"}