{"aggregateRating": {"reviewCount": 156, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-02", "description": "Classic diner with all the standards. Good service, food was fine. Maybe a little more expensive than I expected from a diner? I just wanted to stop for a simple meal on my lunch break. Very little difference between prices here and somewhere nicer on the block, but maybe that's everywhere now?", "author": "Yu W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-14", "description": "Attention all night owls... this diner is open 24 hours!!!!! If you're ever craving anything familiar and comforting at inconvenient hours of the night (or if you're one and a half beers in from your night out???), this is the place for you. They serve the usual diner fare- pancakes, waffles, fruit, and a whole bunch other selections.\n\nI was here at 3 AM craving for something crispy and greasy. We ordered jalapeno​ poppers ($12) and their sampler, which consisted of mozzarella sticks, zucchini sticks, a few pieces of buffalo wings, and chicken fingers ($18.50). They make the food fairly quickly- I think we were waiting for about 10-15 minutes or so. There were plenty of dipping sauces included in our takeout bag! \n\nThe jalapeno poppers were delicious! They weren't spicy like I thought they were going to be- it tasted pickled instead. The outside, which was perfectly breaded and fried, tasted amazing. An overall fantastic appetizer. :- ) The sampler was huge!!!! There were so many things to try. The mozzarella sticks were delicious- and once again- perfectly breaded and fried- and the zucchini sticks were no different. I think the zucchini sticks were my favorite since they were straight to the point- light, not too heavy, and didn't feel like I was consuming too much oil. The buffalo wings were super spicy​ but flavorful both inside and outside. Its exterior had a great crisp to them.", "author": "Anna X."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-18", "description": "A very solid three stars for this 6pm breakfast food diner meal that I had whilst *not* being even slightly intoxicated. (100% serious.)\n\nI figured I'd try this place out after having glossed over it many a times because it doesn't stand out too much from the outside, but I'm always down for some french toast and breakfast potatoes (maybe or maybe not at the same time -- no judgments here).\n\nMy boyfriend ordered the eggs benedict and I had the challah french toast and ham (and my boyfriends potatoes) and I thought it was actually pretty good. The french toast were fluffy inside and slightly crispy on the outside, as all good french toast should be. I even tasted a hint of cinnamon which is a major plus. The ham was ham. It's hard to mess that up I guess. And the eggs benedict, my boyfriend says, was fine. Nothing spectacular and not really worth the kind of high price for a diner. But, we both agree we'd come back and absolutely agree that it's a solid 1-3am option as well, if that's your kind of thing.\n\nThe inside is cozier than most diners, but that doesn't actually mean it's cozy. It's clean though, and I'll absolutely take that any day.", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-04", "description": "Your basic diner. Lots of options to choose from, good prices, open tables on a busy Sunday morning. The food itself was good but nothing special and we were never offered coffee refills. If you're looking for a quick and filling breakfast this is a great place to pop in to or if your first choice breakfast place has too long of a wait this is a good backup.", "author": "Kim A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-11", "description": "The place was practically empty and we waited over 40 minutes for a \"tuna melt\" and a chicken slouvaki. Both simple dishes. \n\nWe were shocked when the food finally came out.... it was truly disgusting. We politely called the manager over and kindly expressed our disappointment - especially with the unsightly $14 tuna melt - and instead of offering us something else or trying to mend the situation, he rudely swiped the plates away from us. We couldn't believe it.\n\nDon't go here. Terrible service and food.", "author": "Laura C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-29", "description": "I desperately needed food delivered to my hotel at 3am, and these guys were one of the few open. Delivery was very prompt, and they even included an extra shake with the huge burger and generous serving of fries.\n\nAll great.\n\nBut I woke up the next morning with what turned into 7+ hours of cramps, diarrhea and vomiting. And considering I had had nothing else to eat that night except a few bites of food at my wedding reception (no one else got sick there).... I'm thinking someone made a bad burger.\n\nThat is all.", "author": "Ash O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-07", "description": "$14+ for eggs Benedict - eggs were overcooked and cutlery was held together with scotch tape . At least there was no wait for Sunday brunch. Saw that a freshly made cheesecake was briefly placed on the counter under the espresso machine - the space was too narrow and strawberry frosting got all on the underside of the machine. Still went back into the display case. Yuck", "author": "Kim S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-26", "description": "This diner is definitely kid friendly which is why they received three stars vs two stars. The food was just awful - we ordered the spaghetti and meatballs. The meatballs were tough as shoe leather and the sauce tasted like jar tomato sauce. My kids didnt mind but I did.\n\nThe hubby ordered the hamburger so maybe it was my fault for not choosing a diner staple.", "author": "Lina F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-09", "description": "Me and my dukes came here on a Monday and it was a very bright and clean classic diner . They also was watching the World Cup which was great lol . They have seating in the front and in the back is like outside indoor seating it was beautiful but me and mom sat at a booth . I ordered a turkey bacon feta and spinach egg white omelette and also a toasted blueberry muffin . The omelette comes with toast and home fries . Everything was delicious the omelette was perfect and flavorful the home fries well they were home fries can't go wrong with that . My muffin was also pretty delicious the only thing about it was it was so big that the butter didn't get to all of it lol but it was delicious nonetheless . Like it was previously stated do not think of this place as a bougie place or a place with a awesome aesthetic . It's a diner a clean diner with excellent diner food and for great prices at that. And it's also 24 hours . Can't go wrong with that right ?", "author": "Chelsea P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-09", "description": "I love this place. Not only is the food super cheap, it's also really good and great amounts. I hardly ever finish my food. There pastrami sandwich is to die for. And I think they make their own pickles which aren't too bad either. I am a huge fan of their coleslaw even though it has raisins in it it still has a great flavor. Every time I go I try to get the same waitress not sure of her name but she's awesome! I also love that they are extremely accommodating and personable. My first time going they made me feel like I have been coming for years and it really made me feel comfortable.", "author": "Ty M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "I love this place because they are open 24/7. It is the only diner in the neighborhood that does it, and they are exactly as advertised, a classic diner. If you need an omelette at 3am, they've got your back. If you need french toast or a greasy burger to absorb some alcohol after going a little too hard, you can count on them.\n\nI've been there for brunch, and I have to say, they're not really up to snuff with competition like Cafe Luluc and Miriam around. It's just classic diner food. Don't come here with your high-falutin' Brooklyn expectations of farm-to-table non-GMO house-made artisanal creations. Come here for plain old fashioned americana. Often times, that's exactly what you're craving anyway, right?", "author": "William J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-04", "description": "Blueberry pancakes are deeelicious! 3 stack of large pancakes and all have a generous amount of berries in them! A lot of times only the top one tends to have the fruit mixed in but all of the pancakes were great. \n\nIf you order coffee, it's unlimited refills. \n\nFound this diner through the Allset app. When I came in, they had a booth reserved for me with the Allset sign on it! Super convenient and I got to sit as soon as I got there. \n\nService is on point, they are always there to refill your coffee and waters.", "author": "Hannah C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-19", "description": "Stopped in at 10am...in search of a burger( I just needed a burger!).  I got bacon on the bitch tho..you kno, since it was still breakfast time.  I got the platter, \npickle-on point, garlic, dill, whatever the hell it was, almost even ate the stem off that bitch\ncole slaw- on POINT, homemade, right amount of sweet AND even had some raisins in that son bitch\nburger- SHEEEEEEEEEEEEIIIITTT- This mickey fickey hit the SPOT! Juicy, with sesame seed roll ( not no kaiser roll BS), with enough big ass strips of bacon on that bitch to start a SECOND sammich.  \nOh fries good too AND threw in 2 onion rings.  In 2018 a diner still producing a \"quality\" burger with all the specialized burger joints around?? Burger so good, turn a vegan STRAIGHT.  Im just sayin, I would def recommend the burger if you go.", "author": "Al B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-29", "description": "Very good food. I love the daytime waiters they are so attentive. Greek chick soup is delicious, the pancakes, cornbeef hash, the lemon chicken dinner is yummy, the grill chicken w/ mash potatoes and garlic spinach on the side is my favorite.", "author": "Rosalinda T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-11", "description": "The food was horrible and the waiter was horrible too and had a snappy attitude. I had vanilla shake that tasted like power milk, and had the fried chicken they also put spicy wingettes. This place is good for breakfast to a degree.  The one star is me being generous.", "author": "Delilah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "24-hour neighborhood diner is my survival tool.\nQuick delivery, friendly staffs and plenty of options.\nNothing fancy, but some dishes are pretty outstanding compare to the others. Our best orders are the cheese blintzes, chicken souvlaki (both sandwich and platter), french fries and cheese burger.\nDelivery is cash only, but you can use card if you order online.", "author": "Dita A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-09", "description": "This diner is AMAZING!!!!! The portions are huge and the food comes out so quickly. Super welcoming, friendly employees as well! Never seen a diner so clean! Wouldn't go to any other diner!!!", "author": "Carissa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "The best omelettes and home-fries in the area ! The food was fresh and well seasoned. I asked for my home-fries to be extra crispy, with extra onions and they didn't disappoint. Seems like a simple request but believe restaurants mess this up all the time. The food didn't take long to cook. The only think I didn't like is for 2 pieces of French toast, the price was $7.50. That to me was a bit extreme. But, that doesn't take away from the quality of the food. I will definitely be returning here.", "author": "Grace D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-03", "description": "1130pm...Horrible. I came in to order a bagel to go. It cost $4. The worker handed me my receipt and said he was making it. Then the owner, this old white guy, took over the cash register and ended up telling me there's a $10 minimum and canceled my order on the spot. He confronted the work in the back too...The worker in the back never told me there was a card minimum, and I was waiting there cluelessly thinking my bagel was being made...smh fck them all! Especially the owner- you can tell he doesnt give a fuck about those Mexican workers in the back (aka the people who took my order)", "author": "Joe P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-02", "description": "My go to order was just OK so that was disappointing.\n\nTo be fair I always get just eggs and potatoes and I like my potatoes plain.  They can't do plain and I feel like it's not a difficult diner request.\n\nMy boyfriend had the hamburger which he said was very good... So need a not as expensive burger... This is your spot.\n\nI'll probably give this another go, but not high expectations for being amazed.", "author": "Kimberly W."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Carroll Gardens Classic Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/0E6m5R12QtMTYkT-CB64VQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184039940"}