{"aggregateRating": {"reviewCount": 156, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-07", "description": "A godsend as far as I'm concerned. At a burger and some chicken fingers here on a late night and the food/service were both great.", "author": "Josh F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-03-18", "description": "So this is how it goes.\n\n\nBeer, beer, beer, shot, liquor drink, liquor drink, beer- 3AM. Taxi. Stop. Stumble, stumble, stumble. Hunger pains. Glance around. LIGHTS! Stumble stumble, the door is open. Sit, mozzarella sticks? Quesadilla? Pancakes? Hmmm... order, wait, wait, wait. GREASE. Demolish. THE BILL IS HOW MUCH? Fumble for pen. Whatever. Stumble, stumble, ZzzzzzzZZZ......", "author": "Amber S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-23", "description": "for all the haters on here.... STFU.   Its a diner.  I repeat.  A DINER.  If you want Per Se or 11 Madison Park go there.  If you want a grilled cheese with bacon at 2am - this place does just fine.", "author": "David B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-12-22", "description": "Why this place sucks:  it's INSANELY expensive for a diner, the coleslaw/pickle thing they insist on serving grosses me out, cash only delivery, the food is never that good\n\nWhy I continue to patron this place:  they are open (and deliver) 24 hours, there is never a wait for a table, and sometimes I just need greasy diner food and don't feel like walking over to Cobble Hill Coffee Shop", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-27", "description": "Very fast, very overpriced. The $5 milkshakes are good, but are $5.\n\nSolid diner food but stick to the basics- pasta, eggs, sandwiches. Don't order nachos, a veggie burger, a belgian waffle. Don't even think of getting linguine noodles and thinking they wont be overcooked, stick to spaghetti...get it?", "author": "Jessica W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-24", "description": "24-hours; also 24 hours on seamless\nit's not cheap diner food in the sense that it's not cheap\n\ndelicious turkey sausage (more kilbasa-ish)\n\nNY mag said to try the turkey club, so i did. a couple times. the turkey club is GREAT, fresh ingredients stand out here. aka romaine lettuce not iceberg, home made turkey, bread toasted just right, bacon is crispy, and it's not falling apart on the plate! if you're ordering delivery on this one, remember that it doesn't come with mayo on it. \n\nfries are thick steak cut, sans salt. not my thing- but to each their own.\n\nservice there is wonderful and fast.\n\nthey serve Amstel light too- for when you totally need another beer at 4:30am...", "author": "Justin S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-16", "description": "I'm not really sure why you would pay so much for boring/average/nothing-special diner food when there are slews of cheaper or similarly priced restaurants within 3 minutes of here.\n\nOh right, you're leaving a bar, it's after 12 and you can't find anything to eat. You know... there's a Domino's on the corner there... just sayin'.\n\nOk, I'm kidding (kind of), but really, don't you feel sort of used after throwing down $10 (+tax and tip) for crappy uninspired out-of-the-freezer chicken tenders and fries? Cause I do.", "author": "Sean E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-06", "description": "I haven't been to a diner in YEARS and always need to find a legitimate reason to actually grub on diner food. My boyfriend and I stopped here for some late night dinner the other night. I ordered the Vegetarian Frittata and my boyfriend had some chocolate chip pancakes. We also ordered some waffle fries to share. My meal came with toast and (the menu says 'potatoes') French fries. Overall, the frittata was actually pretty good. A good use of vegetables such as zucchini, broccoli, and carrots. It was nice and fluffy and not at all oily. The fries my meal came with wasn't anything special. I didn't have my toast, am though it did look a LITTLE burnt. The waffle fries were pretty good. Although I am not an avid diner-goer, I think this place will do you justice if you are hungry! One thing that was notable to my attention was the service! The waiters were so nice, friendly and professional. I asked the waiter if he knew of any cab companies in the area and he gave me a number right away. When the cab arrived, both waiters showed us out the door and pointed towards our cab for us. Overall, a good dining experience.", "author": "Tiffany M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-01", "description": "Our usual go-to diner as it's in the hood and they deliver late night.  Food is fine for standard diner fare, but for reasons that evade me, they can never get our order 100% accurate.  We're not talking leaving things off, or add-on's.  I ask for condiments such as mayo or BBQ sauce for my chicken fingers; get told yes, rushed off the phone, \u0026 the items are not included.  It really peeves me to not have the simple condiments that would allow me to fully enjoy my meal.  After this last time, they won't be getting our business ever again.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-11", "description": "I did the late-night thing here one night and got the grape leaf platter. It came on a bed of lettuce, with generous hanks of feta. Salty yet somewhat virtuous and shame-free. The waiters seemed attentive from what I remember, and endearingly told me \"good night, mommy\" on my way out. I went in the morning, and even in the bright light of day, the service and food were good: egg and cheese on rye, side of homefries. The omelettes are ridiculously huge. I don't get the complaining. It's a diner. If you don't want a diner, go home and eat some cereal at 3am (like that's any fun, plus, if you start throwing ice, YOU have to clean up the mess). My food was cheap, but if prices are higher than other diners I think it's b/c you're paying for the 24 hourness of it all. My only complaint? Get a full license and serve me a Bloody.", "author": "Krista B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-07-19", "description": "How many tales of investing on Wall Street, or of dating, or of eating in restaurants begin with the sentence \"Well, it got off to a good start...\"\n\nThe appetizer: a big, huge bowl of real, fresh cole slaw, served with a pickle so  large, so phallically intense, that it was embarassing to look at (let alone eat), and that was fully as good as the pickles served at Katz's Deli.\n\nIf only the cheeseburger that followed had been as good. The menu bills it as \"more than a half pound of beef.\" It *did* seem like more than a half pound...but, if you're going to serve a beef patty that large, it really ought to consist of \"more than a half pound of really GOOD TASTING beef.\" Not \"more a half pound of essentially TASTELESS  (and kind of rubbery) beef.\"\n\nYou know, tomatoes, red onions, ketchup, lettuce, cheese...Those guys are hardworking souls. But even they couldn't add the flavor that this hamburger so desperately, desperately needed.\n\nLook, I know diners can make really good hamburgers. I had an outstanding lamb burger at Veselka earlier this week.", "author": "Michael D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-08", "description": "If I could give this place a half of star, I definitely would. The food was undercooked. Extremely runny eggs and still soggy half raw bacon. And it wasn't only my plate it was the same for the 4 other people with me. I went after a night of hanging out and the service was NOT up to par. The waitress didn't come back to check on us at any point but instead  chatted with staff. There was a problem with my card on their behalf and when I offered to pay in cash the MANAGER told me to kiss his ass! I m utterly disgusted and urge you to save your money for a more suitable establishment.", "author": "Kamilah E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-24", "description": "The night before my husband and I moved out of this neighborhood we got a little drunk and called for some late night delivery. While waiting we fell asleep and didn't hear them ringing the bell or calling our phone (27 times).  Although I do feel bad about this, I also feel like sometimes you don't have to wait until the next lifetime to see karmic retribution at work.", "author": "Liz W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-10", "description": "The service was awful and to top it off I saw a RAT running through the pastry case.... yea.... I'll never eat there again", "author": "Susan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-28", "description": "Nothing like a feta egg white Omelet at 5am! this is the perfect place in Caroll Gardens to get your grub after a long night of partying! The service is great, and it's good quality diner food with no fuss!\nThe burger also looked (YUM)-I always end up starting at what someone else got on the table thinking...hmmm I should have got that! \nPrice is just right, and my Omelet was just so fluffy and delish!...the whole wheat toast nicely soaked up all the toxins in my body, and I was alive and well the next Sunday morning!", "author": "Maria F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-05", "description": "Exactly what I wanted at 1am on a Friday night/Saturday morning after drinking - a huge plate of breakfast food for $10. I really didn't expect much at all but I was pleasantly surprised. The menu has anything you could ever want and the food was actually pretty good. The perfect place to satisfy your late night hunger whether you want a greasy burger and fries or pancakes and eggs. I would also imagine it's a decent cheap breakfast in the morning. I would definitely be here often if I lived in the area.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-22", "description": "Late night drunk-and-on-drugs last resort. I have learned to love certain items. Overpriced and mediocre. I love you, die.", "author": "Drew C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-25", "description": "24 Hour Late Night Delivery Salvation\nI don't even care what the food is like\nThere is no other place that I know of that does this anywhere in BOCOCA , The Heights , Red Hook , or downtown brooklyn at all\nI believe it is a Greek oriented diner\nIt's 12:41 AM on a Wed and I ordered a Chicken Souvlaki for delivery, it comes with fries and greek salad for $12.12\nWith tip thinking 15\n\nKeywords: 24hr 24hrs 24hours 24hour 24-hour late-night late-nite", "author": "G K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-09-23", "description": "It's hard to be unbiased about foods you consume after a night at The Boat.  Especially after you try their entire Single Malt Scotch selection - yes, even The Balvenie 21 (try it, it's worth it, and the 'tenders are no misers) but minus the boring stuff.  Anyway, let's save that talk for The Boat Yelp.  This is all about Salonike.\n\nOutside The Boat, I mislead my friends towards what I thought would be Atlantic Ave.  We were on a mission for Fries.  I was thinking of this one diner on Atl Ave, not a very good place, probably not even open at that hour, but well, that was my purpose.  After a few blocks, I was corrected, told that we were in fact walking away from Atl Ave.  I unjustly (knowingly) blamed and scolded my friend for leading us astray, and as we walked past The Boat, the welcoming open doors of Salonike invited us in.\n\nTheir menu was extensive, and it made me slightly nervous.  Wide variety sometimes meant that they don't do anything well.  heating of frozen foods, leftovers, no specialties, etc.\n\nMy friends both opted for variations of egg dishes, and I went for the Reuben.  I was lost in the gigantic menu and at the last second, I saw the Reuben.  $9.95 w/Fries.  I started to get excited at that point.\n\nMy Reuben came open-faced, fully covered in cheese, next to an expansive bed of Steak Fries.  None of us spoke for the next 12 minutes, as we consumed the three dishes, maneuvering our forks just well enough to not stab each other on the back of the hands, leaving trails of zigs and zags of food crumbs as we liberally shared.  \n\nThe Fries alone warrant the 4-Stars.  Reuben was really good.  Quality Corned Beef, crunchy, just juicy-enough Sauerkraut, thick layer of Swiss Cheese, and no funny thousand island dressing of any sort.\n\nThe coffee was, well, not very good coffee.  Try not to get too excited about the coffee there.\n\nAfter our feeding was completed, as the waitress gave us the check, I called out for Milk Shakes.  YES!  \n\nOh, man.  SOME Milk Shakes.  THE best Chocolate Milk Shake I've had in the entire United States of America.  These are the moments when I like America.\n\nDespite all the Commercial joints settling on Smith St, places like The Boat and Salonike keep me coming back.", "author": "Arthur O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-04", "description": "Typical, standard, yup. Milkshakes were very nice but pricey. Sometimes \"just a diner\" is nice, with no further expectations.", "author": "Sharon C."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Carroll Gardens Classic Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/0E6m5R12QtMTYkT-CB64VQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184039940"}