{"aggregateRating": {"reviewCount": 156, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-22", "description": "I used to like this place but lately the service has been horrible. I ordered delivery and they decided they did not want to come out and deliver on a Sunday.", "author": "Shameeka D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-19", "description": "Decent food, horrible service. The employees simply make it an unpleasant place to eat. \n\nI'm not sure whether it comes from management or not but it is nigh impossible to get a check or a coffee refill without shouting across the restaurant at the group of dudes hiding behind the counter or simply standing or sitting with their backs facing you. They do just about everything in their power to ignore you, avoid eye contact, and make it difficult to politely gain their attention for any type of service. I really wish I had a better diner option close to my apartment because it is such a chore to eat here. \n\nAlso, their toaster is crap and doesn't toast the bread. I hate that!\n\nUpdate: they still do the same thing. Servers will do anything to avoid eye contact with customers so they don't have to do anything. They stand around with their backs turned to you. You have to shout at them across the room to get a coffee refill or to get your check. Not a pleasant experience.", "author": "Jeffrey W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-02", "description": "Not clean, super expensive! $$$$$$$. They charge you for breathing in this place! Typical diner, a super large menu and food that tastes like an unclean grill in which they have cooked for ages and never cleaned properly. Walk a few blocks down to the bagel place. Much better, also 24 hours, and reasonable.", "author": "J C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-24", "description": "This place is terrible. How can you mess up a grilled cheese with bacon, if you want to know go here. Everything is frozen. Place is filthy too. Last time I was here I saw a roach. Will not be going back. Avoid this place. Whatever you may want from here make at home yourself", "author": "Ann C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-18", "description": "Great neighborhood diner! Our go-to for late night fare. Our favorite dishes include the chicken club sandwich, classic grilled cheese (simple but oh so delicious), split pea soup, and the chicken fingers. So happy to have this spot around the corner!", "author": "Kaley S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-09", "description": "I was brought a completely wrong order: Belgian waffle instead of egg white Denver omelette and the waiter kept insisting I was wrong and had ordered the waffle. Food not worth it for the prices and attitudes there.", "author": "J B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-07", "description": "Overpriced compared to other diners. This place should be the last place you go if you want food at 3:00AM", "author": "Don L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-01", "description": "Came here after after New Years celebration with a group of 7.  The place was full for it being 1:30am after the ball drop, but had enough room for us. The service was great, the waiter was very patient with us...the happy, loud, singing group...lol lol.\n\nWe all had the typical diner fare...burgers, club sandwich, fries, onion rings, milkshake, soda. All of it came out quickly and disappeared just as quickly.\n\nDefinitely a new go to for late night grubage!", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-29", "description": "I like the diner went in and person and had a really good experience but today I ordered and although the food was great and I have no complaints there the delivery guy was really rude for no reason. I went downstairs promptly to pick up my order it wasn't more then a total of 5 minutes between the time I got the call and went downstairs... I called the diner its self and was assured that it would be addressed so I hope that it is.", "author": "Jess B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-14", "description": "I've been here so many times over the summer, and it has never failed me yet. \n\nBig, hearty, quality portions of delicious foods that hit the spot when you're starving and need to start off your day. \n\nOver the course of my visits, I've had their eggs, pancakes, sausages, other times their steak and eggs for brunch which comes with toast, fruit, and a small glass of OJ. That particular meal is HUGE- a big piece of NY strip steak, with a plate of scrambled eggs, possibly two or three. I never finished it, but I wish I could have!\n\nAnother time I got a tuna melt which was perfect ratio of tuna and mayo, not overwhelming at all. \n\nMy bf loves the eggs benedict, with or without the Hollandaise sauce (said he didn't really taste it with the egg yolk when he cut into the food), and he's also a huge fan of English muffins in general LOL. \n\nThere waffles and waffle fries are good too. \n\nHave yet to try their burgers or paninis or wraps, because I'm always tempted by other stuff. \n\nAs soon as you walk in, it's warm, with dim, yet just bright enough dining, not overly bright because it kind of makes you feel as if you're in an office. It gets plenty of light from the doors too. And the servers are people you see over and over again, and they're friendly, telling you to sit wherever you please.", "author": "Tiff C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-21", "description": "Um, this place is NOT DELICIOUS.\n\nI have been trying to find a good neighborhood diner and I stopped in here on a Friday night to test it out and unfortunately it totally failed.\n\nI do have to say that the waiters were attentive but everything else was BLAH. \n\nHere's a list of why:\n\n1. My bf always orders the lumberjack/hungryman type breakfast meal and he usually kills it. The lumberjack he had at this diner... half of it was left on his plate when we left. The pancakes were really spongy and chewy.. perhaps frozen? The sausage had a piece gouged out of it and was black from being fried. The inside was slight grey on the edges and pink in the center. He asked me to try it and I said NO WAY. The ham and bacon were not memorable.\n\n2. I had a gyro plate which was fine. They brought out a huge greek salad first which was okay but when they brought out the entree, my gyro was naked and I had already finished the salad! I ended up just having the meat and bread together with nothing else to top it.\n\n3. I had a diet coke. They asked if I wanted a refill, I did, and I got charged for it. Never in my life have I been to a diner where fountain soda was not freely refilled. Especially since the waiter didn't mention it when he offered.\n\n4. Totally pricey for crappy food. You can eat so much better, higher-quality food at the majority of restaurants in the area.\n\nThat's all.", "author": "Michelle Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-22", "description": "Saturday Morning! \nIt's crowded , and it's Saturday!  I understand\n\nBut if you sit me down and I have to wait 10 mins just for water ?! And people are getting seated AFTER me and getting their water and order taken...SOMETHING ISNT RIGHT.\n\nWhen the waiter came, I kindly asked for water , and HE WENT BACK to get someone else's food.....ughh.\n\nWhen I got up and left , he just looked at me\n\nSorry! Your customer service skills SUCK! \n\nYOU LOST a customer\n\nAnd even if I stayed there....you weren't going to get a tip from this lady right here.\n\nOff to New Apollo Diner I go!", "author": "Shade C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-18", "description": "Great feed and equally good service.  The portions on sides are large we could have split a sausage side but we took what we didn't eat.  Highly recommended.", "author": "Steve J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-20", "description": "I got a salmon omelet for breakfast and a cup of coffee. All ingredients tasted very fresh and the sides were delicious. Coffee was refilled very frequently and was also freshly brewed, in contrast to the usual burnt diner coffee in other places.\n\nPatio seems great and I'll check it out next time.\n\nThe staff was very polite and coming over to check only if necessary. Great place to hang out 24/7 with friends and countless choices for food and drink. I completely recommend the Carroll Gardens!", "author": "Fibo K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-17", "description": "This review is for the delivery service.  It was almost 11pm and we were hungry after a night of drinking.  It was rainy and cold and I didn't feel like getting out of my pajamas and my friend was craving a chicken salad sandwich.  \n\nWe order the chicken salad club, french fries, jalepeno poppers and souvlaki wrap with extra tziki sauce on the side.  The tziki is super yummy and a great condiment for the fries.  The fries were pretty good, and arrived warm and not soggy.\n\nMy friend loved the club sandwich and was grateful to satisfy the craving.  My wrap was just alright, a bit dry and fell apart, but once again it hit me where I wanted.  \n\nThe jalepeno poppers were good (there weren't any left) but weren't quite spicy enough for us, and the sauce was lacking.  I actually like the poppers with the tziki sauce as well.\n\nI would order from here again, 1-because they have 24 hour delivery 2-because it came within 30 minutes and 3-because the food was good and they remembered the extra sauce on the side!", "author": "Deb W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-31", "description": "Racist!!! I tried to order and even though i have ordered before they refused because and i quote \"you live in the projects and i can't make the delivery guys go there because they are scared\" . First of all i don't live in the projects but that's not the point. If i did live in the projects and they were in the delivery zone the diner HAS to deliver. They cannot discriminate because of race, gender or economic standing. This place is like a throw back to before the civil rights movement. Diplomacy dude! Let's not wear your racism so prominently. Ban this place!!!!!", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "This place is the best classic diner. Everything on a classic diner is great here! They are open late and delivery/service are both always perfect. There are so few diners still around with quality food and experience, and this is one of them!!", "author": "V P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-18", "description": "I have this thing for diners. I like to glamourize diners. And although you might think there is anything to gamourize, I would beg to differ on that point. Well, I also like to glamourize all things illegal. So, I guess, at this point, if you don't agree, perhaps you should just stop reading. \n\nYou see, when I end up at a diner in the middle of the night, it usually follows a mind blowing night. Now, granted, when I came here, I was only across the street having a tame night with some friends. But, man I remember my younger days...\n\nThe night would begin with fellow ravers meeting up. We would be decked out in all colours of the rainbow, with glowsticks in hand, lots of water and candy necklaces ready for a night of dancing and raving. We would seriously dance for hours and by the time we ended up at a diner, it was already 6AM. I miss those days of reckless abandon. Nothing to worry about except getting homework done for physics class on Monday. Damn, I hate being an adult.\n\nAnyhow, this place is open 24 hours. My friend had a breakfast plate and I just had some fries. Service was quick and spot-on. Diners are also cool cuz they serve breaksfast all day long. This place reminds me of the good ol' days of raving...", "author": "Vivian H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-17", "description": "Very Fast.  Very Overpriced.  Very Open.  \n\nWith 24 hour delivery and a menu fulled of amazing awesome \"I'm drunk and hungry\" fried foods, CGC Diner hits the 2 am spot every.single.time.  Although there are no other 24 hour options in my hood, it's the only thing going that is going to hit the spot.   The wings are breaded/deep friend/hot sauced/delish (ala Hooters!) and quite unlike your standard \"buffalo\" wing, and I love them anyways.  \n\nBe careful with your 2 am ordering or you'll end up with a fridge full of fried leftovers that you're not going to want to look at...never mind eat...in the morning.", "author": "Kelly T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-04", "description": "Average at best. Burger was large but had no flavor. Late at night not many places open and they have a large menu so perhaps try something else.", "author": "Jeremy Y."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Carroll Gardens Classic Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/0E6m5R12QtMTYkT-CB64VQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184039940"}