{"aggregateRating": {"reviewCount": 156, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Oh man, damn fine food and seriously speedy.  If you're interested in a cheeseburger after 10, these guys are your guys.", "author": "Robby E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-03", "description": "Came for a 03:30 early morning breakfast.  The restaurant was quiet at 03:30 in the morning, but I was provided with friendly and quick service.  The Sausage and Eggs were good, with quality sausages (better then most diners).  The Popeye Spinach Salad was massive!", "author": "Colin J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-31", "description": "I've been going to this place for years and I am NEVER...EVER disappointed. The food is top notch and the wait staff are some of the coolest people you'll ever meet. It's 24 hours and it's all A's in this book.", "author": "Alejandro R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-26", "description": "I have always had a positive experience in the Carroll Gardens Diner. The prices are a little steep but they do give you a lot of food. Their courtyard was done pretty nicely. My son and I go there often to pig out and check out the neighborhood. One of the last standing diners in the proximity of the neighborhood.", "author": "Sean D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-06", "description": "RIP OFF! Service is terrible, food is ok, prices are outrageous. They only positive thing I can say about this place is that it's open 24hrs. They clearly take advantage of that by charging drunks stumbling down Smith St ridiculous amounts of money for standard diner food. The staff is super nasty. Everyone I know has a Carroll Gardens Classic Diner horror story, but, if you go there more then once you know what your getting. Not recommended.", "author": "Jamie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-25", "description": "Just ate dinner with my wife here! 5 stars Without a doubt! \nI don't know what it is but i came here before and it was a waste, now i love it. I think its the new owners! This place is great!! I had a BBQ Burger!! A M A Z I N G ! \n\nPs- Great staff too!", "author": "Gil D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Can't go wrong with this place. Good food, quick service, friendly staff, reasonable prices, and the place is always kept nice and clean.", "author": "Mike G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-03", "description": "About seven years ago, I had roughly six encounters with the actor Peter DInklage in a two year period.  Considering the fact that I live in Portland Maine, it was a curious thing.  I thought a lot about this at the time and finally concluded that there must be some cosmic meaning, some reason this kept happening.  Ultimately, thoughts around this faded as time passed.  To be honest, I had all but forgotten the whole thing, until three days ago, on New Year's Day on my way to the Carroll Gardens Classic Diner for breakfast with my kids.  I pulled up to the light, and there on the corner laughing with his dog, was Peter Dinklage!  \nI turned the corner, found a parking spot immediately and with a feeling of wonder entered the diner.  We were immediately greeted at the door and led to a super comfy booth.  The staff was friendly and attentive and the menu HUGE.  The coffee arrived in under a minute.  Three of us ordered souvlaki/gyro dishes and they were all plentiful and well made.  The tsatziki sauce was excellent.  My daughter got a waffle with sausage and could not finish it.\nAbout half way through our meal, I thought the following thoughts:\nThis is an old school type diner, the kind that existed all over the city 30 years ago\nThe food was great and reasonably priced\nThere was absolutely no rush for us to leave\nThe coffee was bottomless\nI absolutely loved the Carroll Gardens Classic Diner.  The next time I am in the neighborhood, I plan on eating here way more often.  I wish this diner could be teleported to Portland, Maine.  There were lines outside of many other hipster brunch places, reminding me so much of the Portlandia brunch episode. Some day if you find yourself waiting in line somewhere else in the neighborhood, do yourself a favor, and head over to the CGCD.", "author": "Kerrie D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-28", "description": "Deceptive pricing is actually a 40% mark-up over online menu.\n\nIf you're eating here, it must be because it's the only place in the neighborhood open after 11:00pm.  Be aware that the actual pricing is a 40% mark-up to what is listed online, and is also a markup above what is on the printed menus inside the restaurant. The staff was apathetic to the issue, going so far as to question what site would show the different menu prices (yes, it was that obscure site called 'Google' that few people use).  No price justifies the poor quality food - your money is better spent on a cup of expired instant noodles from the bodega up the street.", "author": "Captain A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-18", "description": "Food took 50 minutes. 20 mins just to take the order. \n\nNo free refills even after a long wait.  \n\nWaiter brought food out in a weird order. He brought the pickles and slaw that went with a sandwich that took 15 mins longer to arrive. \n\nWish we checked Yelp before going in. Just didn't think a Brooklyn diner could be this bad.", "author": "David W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-02", "description": "I mean, if it's 3 am, they're open. Don't try to get fancy though. Stick with burgers, grilled cheese, pancakes. Anything else, you're just gonna be asking questions. \"How did this happen?\" \"Who would do this?\" \"Bruh, is this even food?\" \"Do you think I could hit somebody over the head with this piece of chicken tho?\" In general, it's the most overpriced, barely edible food I've ever tasted. \n\nEdited: If you have a problem with your delivery order, the person on the phone (manager?) is very nasty and will hang up on you. Think I'll stick with Neptune for late night eats.", "author": "Lanie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-26", "description": "I would give 0 stars if I could - ridiculous delivery service, estimate for 35-45 minutes turned into hours. When we called they were incredibly rude and unhelpful on the phone. Needless to say we will never be ordering from here again.", "author": "Drew H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-05", "description": "Way underrated deafly not your typical diner food quality here is unbelievable they basically made me a chicken Dish that taste better than any Italian  restaurant in the neighborhood", "author": "Allen G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-19", "description": "It's a diner and open late. I came here for breakfast after a late night. It must have been like 4 am. I kept it standard, as I've learned to do at these type places.  My eggs, sausage and home fries were just what I needed. A friend's steak and eggs was just okay, but another raved about his chicken Parmesan.  The guy was sleepy, but nice enough. Our food came quickly and the prices were decent. Perfect for a late night eat, but do keep your order simple.", "author": "Maria M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-23", "description": "I live in queens but travel to brooklyn frequently and Carroll Gardens Diner is my go-to place after a friend brought me there.  I've been there multiple times and the breakfast is amazing but the one thing that I truly enjoy is the chicken francaise.  The menu is very diverse however, if you are looking for a nice comfort meal...get the chicken francaise (honestly, it's better than some of the italian restaurants that i've been too)... Its a decent sized portion that is served with either pasta or potato and vegetable....opt out for the linguini!  I like to add the francaise sauce on the linguini :)", "author": "Laura G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-20", "description": "Ehhhh.   Been there few times .  For a basic Nyc dinner it's ok .  They could do better as the hood around it has improved so much . Hopefully they kick it up a notch .", "author": "Nicole S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-17", "description": "If you're looking for late night eats this side of Brooklyn, this might be your only option on Smith St. \n\nYou're bound to arrive here at a drunken hour, say...2:30 a.m. with a craving for grilled cheese or something greasy. No worries, this place can provide. It's cash only (if I can properly recall) and the servers are nice enough.\n\nWould I say it's the best diner around? No. But it serves its purpose: Providing drunk munchies for the masses.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "this place is so on point. they always get the order right. the good is so tasty and I wouldnt pick a different place for a great burger any time of the day. Thier mushroom burger is to die for. Highly recommend to you.", "author": "Melissa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-18", "description": "The wings and gyro wrap was top notch. Loved every second of the diverse menu as well. Many options.", "author": "Robert J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-10", "description": "Ordered 3 Cheese Burger Deluxe plates to go. Extremely disappointed.....the burger was very over done, the fries and onions rings tasted old and rubbery and the coleslaw tasted like the mayo had gone bad. All in all a terrible waste of $40.67.", "author": "Kisha G."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Carroll Gardens Classic Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/0E6m5R12QtMTYkT-CB64VQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184039940"}