{"aggregateRating": {"reviewCount": 156, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-10", "description": "Where do I begin?\nI lived in NJ for a few years so I got spoiled as one of the ONLY things NJ has over NY is their Diners.  Having said that, Bay Ridge and other parts of BK still have a few good places. For some reason, this neighborhood has struggled with the Diner. This place is dirty (have seen roaches crawling 2 of the 5 times I've been there. I will say the burgers are good but the egg situation is horrible and my last few times I went I tried breakfast. No taste, water glass appeared to be used by some heavy lipstick lips and never washed. I would go to Donut House on Court St, which also used to be better but still has quality food (prices have gotten a bit out of control). The owner seems to be a nice guy and always greets you, but they need to step it up. To me, this place is how Smith Street was for most of my life - a place mothers never wanted their children from Carroll Gardens to go to. Dirty and not safe!", "author": "John D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-17", "description": "As a native New Yorker I sometimes crave classic, greasy diner food, or something bizarre, like a giant waffle sundae for breakfast or an egg cream. This place is totally solid and the people who work here are really nice. I just wish it was a little cleaner -- it looks and feels a little dusty around the edges.", "author": "Dana G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-29", "description": "They have roaches \nMany people have seen \nThe food is good\nUntil I saw roaches crawling on the \nA whole family gross", "author": "Telling T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-23", "description": "Perfect place for 24/7 need-something-to-eat drunk/sober/high. I've dined in house  and had it delivered. Always fresh and quick. Nice service, too! Love the lady who works the overnight shift. Very attentive.", "author": "Joseph M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-21", "description": "Found a piece of hair in my eggs...needless to say I will not be coming here again...", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-15", "description": "Came here with my boyfriend and my sister's boyfriend around 1AM on a Saturday morning to grab some food. We were STARVING. \n\nI ordered 3 fried eggs with bacon, ham, sausage, potatoes, toast. My boyfriend ordered a pastrami wrap which was served with fries. My sister's boyfriend ordered the meatloaf, which was served with a salad as well as mashed potatoes and carrots. \n\nEverything was just okay. The bacon was too dry. The sausage was \"bleh.\" The meatloaf had a weird texture, and definitely had some mystery meat in it. The fries were fat and flavorless.\n\nA big plus is that it's opened 24 hours. However I probably wouldn't come back.", "author": "Siv L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-11-20", "description": "We were at this place at 00:30 night, service was friendly and prompt, but the food is not really fast so it took a while. We had omelet and a California Burger (see pictures), food seemed fresh and both was very good.\n\nWhat I like about this place, or maybe Brooklyn in general - the prices are very decent. Were you spent 10 bucks in Manhattan, you pay 3 or 4 bucks in Brooklyn. Then there is not that rush to get the fuck out once you paid - and so on.\n\nIf you want to go on to compare - in contrast to Manhattan, Brooklyn seems a bit more laid back and quiet at night. So you don't exactly run into bars and dinners that much - this diner (open literally 24/7) was one of the few spots open and still pretty good. So it's not like we were desperate and took just about anything.\n\nOnly thing I didn't like about this place - I really detaste the TVs in those diners. Why do you need them? Why do they need to be turned on? They are just freaking distracting.\n\nAnd in regard to some other review here, the place seemed clean, I am a bit shocked to read of rodents. I would have probably reconsidered if I had known earlier - then again, are there places in larger cities which are really free of those \"problems\"?", "author": "Till K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-12", "description": "What a vile piece of vileness. Consider this an absolute last resort kind of place, when you are having extreme hunger pangs and nothing else is open and all you have at home is a jar of mustard. There should be no OTHER GOOD reason to enter this place and give them money in exchange for that thing they call \"food\" in there. \n\nI didn't know this, of course, when I walked in one night to get a veggie burger deluxe to go. First off, stupidly overpriced for some no-name diner joint in Brooklyn. $9.60 for a veggie burger deluxe. They really got some nerve, these guys. Anyway, I paid up, and my order was given to me within like 6 minutes. I get home and open the bag, and peer into my veggie burger and the sight alone gave me shivers.\n\nA soft patty of green pea mush. The fries were thick like bloated fingers, and were soggy. 3 pathetic equally soggy onion rings lay on top of them. The burger tasted like someone took that pulp that is expelled from a juicer (all that stuff that's NOT the juice), and slapped it onto a griddle. \n\nSo there. Don't go in. Unless it's the apocalypse and this is the ONLY PLACE AVAILABLE FOR YOUR FINAL MEAL IN LIFE.", "author": "Asya G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-22", "description": "It delivered. It was blurry. It worked.\n\nFound this place on yelp, and I called them while we were still on cab home to Brooklyn.  Not having any idea what they had on their menu, the guy on the phone listed their menu; cheese burger, plain burger, club sandwich, blt, egg and cheese omelet, ham and cheese omelet, pancakes, french toast, waffles, chicken tenders, chicken and rice, grilled cheese, blah blah blah blah blah. They had everything was the jist I got.\n\nBut I went safe and blindly ordered items:\n- Cheeseburger:  This is one big cheeseburger.  It's a cheeseburger. Nothing special. Came with fries, fixings, and pickles. It worked.\n- Chicken Tenders: Also came with fries.  These were fried, definitely frozen, and again it worked\n- Turkey Club: Big sandwich. It was expected. Basic. It worked.\n\nThis place delivered and was an amazing turnaround time. 20 mins the most.  Although we barely finished this meal, there was a ton of food. It's not  spectacular, but call it in when you are in the cab home from Manhattan and BOOM. It's amazing :)", "author": "Natalie G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-08", "description": "I actually really like this place, one of my favorite diners by far. Based on some of the other reviews here, I don't know if that makes me clueless or simplistic. But I don't come here for any of the fluff. I come here for cool service and good food. And as far as I'm concerned they deliver in that regard :-)\n\nI especially love their grilled chicken sandwiches. I can't recall a time when I bought their sandwich and it wasn't fresh or grilled almost perfectly. I also love their french toast and breakfast options\n\nThey also have a really cool little garden in the back. Once again not super special, but not bad either. It's cute and it fits the great neighborhood\n\nMy only issue with them is their side options. For example, in order to get an extra strip of bacon or two, the waiter told me I'd have to purchase the side order of bacon for $4. Not only do I not want that much bacon, but I had no interest in spending an extra $4 for an extra strip or two either. Sometimes however they're lenient\n\nOverall good diner, I haven't been disappointed really. Being 24 hours is also a major plus", "author": "Andre F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-04", "description": "Typical diner with the standard menu. I'm not sure if this place is open 24hrs but it's open VERY late which is a big plus if you're coming out of a bar in the area. They do have an outdoor-ish sunroom you can sit at which is nice and there's lots of elbow room throughout the entire diner. My few pet peeves besides the all mexican wait staff is: they won't substitute muffins for toast (like many places do for a small fee), they put tons of peppers and onions in the home fries (but 99% of NYC diners do that too), and a side of bacon costs $4.50 and you get 8 strips (should be half the price for half the bacon, I'm not ordering the bacon for a group of people here).\n\nThe diners in the general area are the Cobble Hill Coffee Shop, The New St Claires Diner, IHOP, and New Apollo Diner. The Carroll Gardens Diner isn't the best but they're better than the others in the area and that's why I go there. If you don't mind traveling the closest good diner to the area is Tom's Diner by Prospect Park.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-27", "description": "This place was awful.  Nachos with a slice of Kraft singles? \n\nWent with a group after a night of drinking.  Usually that would lower one's food expectations, but we were all pretty grossed out by this place.  Ambience is also not great.", "author": "M P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-05", "description": "At least the coffee refills were free and they accept plastic.", "author": "Jason V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-28", "description": "It is very very rare for me to give a place five stars. I simply do not do it. But...this place, is pretty damn good.\n\nI started coming here a few years ago with family. The food was great and the seats were always so comfortable. Never really had an issue with the staff. The food was always served either eat in or take out in a timely manner. \n\nMy favorite meal to get here would be their bacon cheeseburger deluxe. It's so delicious. Also, their eggplant parm sends me to places...literally. It's delicious. Also, being a few blocks away, it's good when I come home from work, tired and in no mood for cooking. I'll be patronizing this establishment for a long long time.", "author": "Emmy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-23", "description": "Ordered the cheese ravioli with a house salad and some cheesecake. The house Italian wasn't excellent but it was still okay. The ravioli also came with some bread and butter, which was pretty good, albeit slightly hard. The cheese ravioli was phenomenal. 6 large raviolis approximately and was more than filling. Not a marinara sauce but was really good. They got it to my hotel room within 30 minutes as promised nicely packaged and they made sure to see to it that my drink and dressings didn't spill so it wasn't a mess when it arrived which can be so annoying. I will definitely eat here again", "author": "Alexis L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-03", "description": "I have lived here for seven years. The place has become disgusting. Two out of the last four times we went there to eat I found a hair in the middle of my cheese. And the owner who has never been friendly to begin with wasn't even the slightest bit apologetic. Then he came outside the diner as I was leaving to yell at us  for not paying for the other entrée that didn't have the hair in it. Had two bites max of that. I seriously thought he was kidding. Because when I left I said thank you but I'm not paying for this meal this time. The guy has seen my face and knows me well. And this is the way he treats me. I even left a tip for the waitress.", "author": "G S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-24", "description": "went in the rain at 9:45 AM Place almost empty. Sat and asked for coffee five times to waiters standing not 6 feet from me. Always ignored at they served the other persons in the restaurant. They continued to pass both of us( wife ordered earlier as I was parking.) When I had to raise me voice the sixth time for coffee the waiter said I didn't respond to his \"good morning-Never heard it! and he continued to ignore us. My wife's food all this time was waiting on the cooks station but neither waiter offered it to her. It was there for over ten minutes in an almost empty restaurant. Terrible attitude towards customers. I din not order food-no reason to be treated this way!", "author": "Dad N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-17", "description": "It\nMay look\nLike one more\nFuneral home\nBut is a late night overpriced grease spoon.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-15", "description": "I ordered a late night breakfast a week ago with a side of bacon at $3-$5 and they forgot the bacon.  I called back soon as the order arrived and was told my credit card was being refunded, it wasn't.  I spend $38 on take-out ($30 charge and a $8 tip) I want my order right.  If you tell me you are going to make a correction, make it.  This review is based purely on principle since the food is better than most diner food but customer service needs improvement.", "author": "EJ S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-21", "description": "HORRIBLE HORRIBLE service and the owner was extremely rude! I've been a Carroll Gardens resident for two years and this was one of the places I'd go to grab some breakfast and coffee and meetup for an hour or so with some work people to discuss work items. In any case, I always ordered food as did the others I was with. One morning, the owner came to me and accused me (after eating) that I was no longer allowed to go in there with my work people for longer than an hour. The place is almost always empty and I was astounded by the way he jumped to conclusions and automatically assumed the customer was wrong. I defended my self calmly and he significantly raised his voice at me. I am appalled by them and will never be back and have told many about their terrible service. Food is bad too.", "author": "Shar Z."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Carroll Gardens Classic Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/0E6m5R12QtMTYkT-CB64VQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184039940"}