{"aggregateRating": {"reviewCount": 156, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-29", "description": "for a greasy spoon diner this place is awesome! They have a pretty big menu with an array of everything. I have only had breakfast here. It's always good and always cheap. It's no gourmet breakfast food, though they do freshly squeeze their orange and grapefruit juice. it's basic cheap diner food, done relatively well, nice and fast servers too! It's always busy but I never have to wait for a table which is nice too!\nThere are better places to eat but if you are on a budget this does the job!\noh, ps the home fries are not so good. Everything else I have ad has been great, but they have been bad twice. A shredded potato not flavored or cooked enough. yuck!", "author": "Julie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-12", "description": "This one is between two and three stars but since diners aren't really supposed to be fine dining I'm giving them the benefit of the doubt.\n\nA good spot for late-night chicken fingers and milkshakes- and every neighborhood needs one.  Food was decent, the music was mid-nineties (which I associate with diners), and I didn't have indigestion after. \n\nAll in all, a great success!", "author": "Becca F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-13", "description": "So I think everyone who gave this place a bad review should try it again. I am guessing they took a look at this web site because they really stepped it up.\n\nWe got bacon cheeseburgers, chicken club, onion rings, mozzarella sticks...  It all was THE PERFECT diner food. I couldn't believe it! \n(Came with an abundance of fries, coleslaw, pickles, and sauces)\n\n It was REALLY, REALLY good. The waiters were so attentive and the plates of food were HUGE. Needless to say for two people we ordered way too much. Doggy bagged it up and ate if for lunch the next day.\n\nNow me and the boyfriend are avid diner-ists. I do NOT like Apollo diner in Boerum Hill, the Moxy Spot has been slowly getting worse and worse. I am serious when I say it is the best diner, that I have been to so far, in the neighborhood.\n\nMaybe we went on the one good night in a year or two, but I hope someone else tried it and it's as good for them as it was for us.\n\nWe were so stuffed, happy and docile when we got home.", "author": "brigette t."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-07", "description": "I used to really enjoy this diner...yes, they were a little pricey, but the food was well beyond standard diner fare. That is until tonight, my cousin and I were eating our food when underneath the table I spotted a roach crawling past my feet. I didnt want to make a big deal, so I called over the waiter who said he didnt see anything. A few minutes later a roach literally crawled ON our table. At this point I am pretty grossed out, and I call over the waiter who once again does nothing and walks away. While I was considering whether I should continue eating my food I look over to the podium where they place the orders and notice at least 5 roaches crawling out from under it. Gross! Finally, the waiter couldnt deny their presence any longer and calls over the manager. Now, a lot of people would have caused a scene but I was being very quitet about the ordeal as I didnt want to cause problems for the owner. When the manager came over, he was super rude, and actually got angry at me yelling that there was nothing he could do. I have to give one star, if not for the questionable sanitary conditions, but at least for the rudeness of the manager.", "author": "Soey J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-27", "description": "I lived in BK for 2 years and this place made me very happy many times. \nLate night eats its the only place to order from and in the morning the best sausage egg and cheese sandwiches that money can buy. I miss you Carroll Gardens Diner but I will see you one day soon. \nSeriously try the greek lemon soup its the bombizzle!!!!!!!!!!", "author": "Dave G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-01", "description": "Food was barely average by diner standards but cost like it was gourmet.", "author": "Ray D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-24", "description": "no. don't go. \n\nok, if you must, then i think you'll be much happier going in with lowered expectations.  \n\ndefinitely don't go to use the restroom.  \n\nthe salad was browning, there was a bug floating in the water, and everything from service to food to ambience just seemed slightly sub-par.  the waffle fries were delicious but came after my companion had already finished his food.  whatever you do, don't order the veggie burger - i think they're trying to stick it to the vegetarians by making the patty out of broccoli.  ugh!", "author": "Linda L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-01-07", "description": "oh, loved this diner.\ni usually don't like diners, but i did like this one.\nback of the restaurant has a quite cute garden.\nit's nice to have 24 hours open diners such as this, and even better when it's a nice one.\nfood is also good too.", "author": "GO-GO-YU-BALI m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-02", "description": "My favorite diner in all of N.Y.C. Slightly pricey but the food makes it worthwhile and the portions are for the ravenous. Classic Greek versions of American and Italian comfort food. In my opinion there's nothing bad on the exceptionally vast menu, and my favorites include; the greek chicken lemon soup (Saturdays only), the specialty burgers (The Mexican), Field of Greens or Popeye Salad, Veal Parmigiana, Chicken Romano, Bruschetta and the side of their homemade slaw and half sour pickles is not to be missed! 24-hour delivery if you're lucky enough to be in range. Wait staff is usually friendly and very attentive. And the ambiance? Well, you're going there for the food.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-28", "description": "Just a diner!  They are the ONLY place that delivers in the area 24 hours, just be prepared to order your food quickly and efficiently if you are calling after some drinks.  We've ordered many a late-night meal for delivery.  I like the season waffle fries.  The grilled cheese is pretty good, but the chicken fingers are the best.  I've eaten in a few times and the experience was just like any other diner.", "author": "Katie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-23", "description": "wandering around brooklyn today, my husband and i stumbled into caroll gardens diner. it was nearly empty so we had a waitress pretty much to ourselves. the food was better than we were expecting and they even threw in some free pickles :)\n\nwe got much more food than we needed and the bill came to about $13... no complaints here!", "author": "Vanessa V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-12-07", "description": "This place has good fries. The ingredients seem to be better quality than the St. Clair... but it's pricier. I guess they are going to open a place where the St. Clair was. When you call to place an order for delivery, they are in such a hurry that they never get what you ordered exactly right. The menu you have is always one that has lower prices than what you are charged. (When you question them, they state they have to make a living.) They charge for the take out containers for F**K sake. Are they crazy?", "author": "Jane R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-09-02", "description": "i am a sucker for a diner, a 24 hour diner. i'm from new jersey, it's just in my blood to crave chicken fingers and monte cristos at 3 am whether or not i've been drinking earlier. i had no idea that the cg classic diner even existed, although i must have walked past it a zillion times. now that i've finally gone, i will be back again and again. the food is at least a half-step up from regular diner fare, the service was great and speedy, the refills on our drinks kept coming and the prices were right.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-22", "description": "I would come back here again for breakfast. Stopped in w/ a friend on Saturday afternoon for a late breakfast. Had the greek omelette w/ side of sausage. My friend had the chicken w/ feta wrap. Servings were substantial and tastey. We sat in the back which is an enclosed atrium. Very clean. Staff was very nice and attentive. Can't remember the final tab but it was in the normal range - $9 omelette, $7.50 wrap, etc", "author": "Will S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-20", "description": "Very accommodating, good food every time.  The garden/porch area is very charming.", "author": "Victoria A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-07-23", "description": "do not go here! they are such not nice people! the first time i went the food was less than ok, bland and blah - probably a 4 on a scale of 1-10. but frankly, its 24 hrs and theres not much else around that delivers to this area...and tonight i just wanted to stay in. so i called and asked if they delivered. they said yes. then when i ordered, they said, \"look sweetie, why don't you just come in\" and then, when i explained i was just tired and wanted to stay in, the guy was like, whatever, and hung up! that's the rudest thing ever!!", "author": "always t."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Carroll Gardens Classic Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/0E6m5R12QtMTYkT-CB64VQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184039940"}