{"aggregateRating": {"reviewCount": 156, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-13", "description": "Dirty dirty greasy spoon diner.  Don't bother.  Floors are filthy.  I witnessed a roach...saw the busboy drop ramekins on the dirty floor and put it back on the station.  I left most my burger behind because it taste like a cheap quality patty.  Seriously don't bother.  Two stars because the waitress and hosts were nice but this place was gross.", "author": "Carla L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-23", "description": "Solid diner food. Took my mom here when she came to visit one time and she loved their fries, she wanted them the rest of her trip. The guys that work here are nice and the food usually comes out pretty quick.", "author": "Mandolyn K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-22", "description": "I ordered a grilled chicken sandwich with lettuce, tomato and mayo. The servers were nice and quick. The chicken on the sandwich however was burnt and dry, so the sandwich wasn't great. It came with coleslaw and a pickle and the coleslaw tasted off and turned my stomach.", "author": "Shelton H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-16", "description": "I take back everything I said about the chicken fingers. In the sober light of another day, these are perhaps the worst chicken fingers I've ever had. Things said about these chicken fingers when we ordered them recently:\n\n\"These remind me of gas station chicken fingers.\"\n\"They are like finger-sized chicken McNuggets, but worse.\"\n\"Ugh.\"\n\nThose are not good things.\n\nDon't get me wrong, we still ate them all because we had already paid for them and we are gluttons, but next time I'm trying to be fat and unhealthy, I can't deal with such nonsense. I'm just going to just stick with mozzarella sticks. Those were almost OK.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-29", "description": "I came here after a long day at the beach hoping for some breakfast \u0026 sat here for 15 minutes in a near empty restaurant \u0026 no one came to take my order. They saw me here \u0026 said they would be right with me \u0026 still nothing so I left while the waitresses were just hanging around \u0026 theu simply said goodnight as I left knowing I was waiting to order food.", "author": "Reveca C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "Love this spot! Had a wonderful pick-up experience last Friday. Super fast and really friendly service. Felt like family. Get the baklava!! Delicious!", "author": "Jack H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-28", "description": "Our go to place when we can't think of anything to eat. Huge portion and I love their basalmic dressing. And the service is not as bad as other reviews s claimed to be.", "author": "Yuan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-21", "description": "Carroll Gardens Classic Diner seems to suffer from some sort of classic ennui. A lackadaisical mood permeates this spot \u0026 service is a struggle. In spite of this, some of the food deserves four to five stars, which may explain the very mixed reviews. \n\nCase in point - the French Toast. I ordered it \u0026 it arrived lukewarm \u0026 bare (see my photo of the loneliest French toast ever). The waiter drops it off quickly \u0026 disappears. After waiving my hands \u0026 calling out, he finally returns. I ask him for some cinnamon sugar. He tells me they don't have it. \"Well, then just bring me the cinnamon,\" I say. He leaves and returns with the cinnamon. I take the sugar off the table \u0026 make my own. He stares at the concoction with a perplexed expression \u0026 walks off.  I'm stuck sitting there with my cold french toast - which would have been delicious had it been served hot. Shame. Onto the next dish.\n\nThe Eggs Benedict (see photo - so nicely presented it looks like it could be from a magazine) - served perfectly hot, delicious with a light warm hollandaise sauce (not the best I've ever had but pretty good) with a dash of what looks like paprika. And hash browns. All good. All delicious. \n\nBottom line - I think this place is ok if you stick to the basics. No frills. No thrills. But a good decent meal if you have the patience.", "author": "Marie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-31", "description": "I was craving a bacon cheese burger. Order one at 1240am and got it in 20 mins. \n\nThe burger was good. I wasn't expecting such a good burger. It was cooked medium as I requested and had lots of flavor. \n\nThe only bad thing were the onion rings. The breading was too thick. I prefer batter fried onion rings. \n\nDefinitely will RTE.", "author": "Dominic C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-03", "description": "Utterly disappointing. Ordered the gyro sandwich. It was inedible. Took one bite of the bizarre frozen slab of mystery meat inside it and realized I'd made a big mistake by walking into this sh*thole. Thanks for nothing. Try giving a sh*t next time.", "author": "Mary L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-04", "description": "If you want your food made with hate come here. How do you even have unmelted cheese on a hot sandwich???? And don't try to split checks here they will just give you dirty looks. Good luck.", "author": "Daniel B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-29", "description": "I placed a delivery order from here and had multiple issues. 1. The order was not correct 2. When I called to tell them it was wrong the man got very nasty on the phone and hung up on me. 3. I was told I would only get my refund once the delivery man came to pick up the food. After waiting an hour for him to come back for the food I called them again and was told he was coming. He never came so I called again and was refunded the money. 4. When I looked at the cheese cake there was a hair in the cake. \nSo not only can they not get order rights, have no customer service, it is also questionable how they are handling their food. \n\nDon't order to go from here. Not worth it at all", "author": "Julia M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-28", "description": "Came here around 2am on my wedding night because we all had partied too hard for too long and needed grilled cheeses-at least I needed a grilled cheese.\nThe food was exactly what I needed but the service was super weird. \nFirstly, it seemed like they didn't even want to seat us, though the place was pretty empty and ultimately, when they finally decided they were going to serve us, it took them only a minute to throw a table together for my group.  \nThen the waiter refused to give us water until we ordered-he actually put all our water at another table and when we finally got up and went to grab them (we had been ready to order for ten minutes) he explained that it's easier if we wait until after we order for water.  Uhm I'm kind of a fish and the more I think about water the more I become convinced that I must live in a tropical desert and am about to die of dehydration. And anyway, hello lady in a big white dress here, just give me some water-we all needed it.  Then, after ordering it took over 45 minutes for our food to come out.  45 minutes for grilled cheeses and eggs.  Yes we were a large group but the restaurant was empty and it's a diner....how long does it take to melt some cheese between two slices of bread?!\nLike I said the food was fine but overall not a good experience here.\nWere we a bit drunk?-sure....but it's a 24 hour diner in Gowanus, I would think drunk people are a norm here.  Also, we were very polite and quiet drunks...i promise! I worked food service in college at a place that closed at 4am so I can say from experience that it's possible to be friendly to all your costumers...plus I'd just gotten married-bah humbug to me!", "author": "Allana D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-18", "description": "Mediocre AT BEST \nOn a scale of 1-10:\n\nSERVICE: 5. I understand that it's a diner and we came here quite late but COMEON. The waiter barely greeted us when we walked in, and it took way too long to even get us started with a menu\n\nFOOD: 6. Got buffalo wings, jalapeño popper, egg and cheese sandwich, and pancakes .\n\nBuffalo wings: the chicken itself did not have ANY meat on it, was extremely greasy, and all I could taste was the flour. The SO called \"buffalo wings\" didn't have ANY buffalo sauce.. I thought buffalo wings meant having some sort of buffalo sauce or flavoring but no. All I got were mediocre chicken wings full of grease and fat\n\nJalapeño poppers: OK. I actually quite enjoyed this when it was hot but not the best. TotLly understandable \n\nEgg and cheese sandwich: my friend said his was actually quite tasty so yeah\n\nPancakes: what can I say? It's just a classic diner style pancake. Didn't expect too much \n\nPRICE: The chocolate chip pancakes were 11.50 and with added bananas came out to be 14. HOW could you charge so much for some little pieces of banana? Completely disappointed and uncalled for.", "author": "Esther C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-13", "description": "In town to visit family, found this diner around the corner of our airbnb.  Coffee and menus at our table in under a minute, attentive staff and generous proportions of expertly crafted comfort breakfast.  I had scrambled, hash browns, turkey sausage and toast and Nancy enjoyed a low-cholesterol omelette and turkey sausage.  Coffee was strong, and the cup never emptied.  Had to box up and take home what we couldn't finish.  Friendly waiters, a joy to visit.  Based on other reviews I was skeptical, but perhaps we caught them at just the right time.", "author": "Tim M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-26", "description": "Happy to see that they were open late but.... Wouldn't return if you payed me. Above all the service was complete BS. It was 4 if us. We orders the simplest of orders, 3 deserts, vanilla ice cream, and 4 coffees. The thing that bugged us the most, was that the server did not even bother to remember who ordered what. We had to switch the orders as soon as we received them. If the server tossed our plates any harder I would have needed a baseball mitt to catch these deserts. The desert were stale and when we brought it up to the managers attention he, pretty much didn't care or apologize, he even said \"fantastic\".  They didn't ask us if we wanted the deep dish apple crumble warmed up which we assumed was hot, being that it was deep dish. The vanilla ice cream came with fudge on it, which we also did not ask for, the chocolate moose cake and baklava, was stale. By far the worst diner I've ever been to in NY, and that's saying a lot. I Warn and Urge people to stay away from this establishment unless you want to have a very bad experience.", "author": "Brittany D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-05", "description": "I been here a couple of times. The food is decent but the service is what I have the issue with. Specially the last time I was there. I took my kids to eat and when we got there they only gave me a menu. I mean granted my youngest one is a baby so I didn't expect a menu for her but my other daughter looked at me looking for her menu herself. She said to me \"I eat too mom..lol\".. Even though she said it as a joke she was right. When I tried to look for my waiter to get another menu i couldn't get their attention so my daughter ended up getting one herself. \nMy other issue was my waiter.. The first one I had was friendly with exception of not giving my daughter her menu but then he went to lunch and left me with no one to take care of my table. When I asked the next waiter for coffee he seem to be upset and have no problem showing his unhappiness. I know that they eat and I don't have a problem with that but They just need to figure out when to go to lunch. I never had my waiter leave in the middle of my service to have their lunch.", "author": "Ana L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-24", "description": "Came here late night after a night of drinking our waiter Rob was great! Very good job of catering to us and very attentive. He gave us some bruschetta to start off with while we waited for our food and it was very fresh. I ordered the sampler which came with mozzarella sticks, buffalo wings and chicken tenders and my brother ordered a chicken sandwich with turkey bacon, lettuce and tomato. To our surprise, the food was very good! I would definitely stop here again on a late night!", "author": "Pookie W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-06", "description": "Classic dinner setting with proven recipes and ample helping to suite your appetite . greek style in cooking and flavoring.\n\nOrdered Italian burger deluxe which came with fresh fries  slaw and home made pickle and coke, requested medium cook on the beef\n\nFood was fresh , we'll seasoned and was served hot. \n\nrecommended for any one who might be looking for good tasting simple food.", "author": "Umer A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-02", "description": "Group of 4- all of us woke up with diarrhea. None of us even had the same thing. There were maybe 3 other tables so it was not busy at all and it took approximately 15 minutes to get water and the pickles/coleslaw. Disappointing service, and even more disappointing food. I could see them microwaving the food in the kitchen. At least try to hide it next time.", "author": "Bilal A."}], "servesCuisine": "Diners", "priceRange": "$11-30", "name": "Carroll Gardens Classic Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "155 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/0E6m5R12QtMTYkT-CB64VQ/ls.jpg", "@type": "Restaurant", "telephone": "+17184039940"}