{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-17", "description": "Awesome atmosphere for studying! Authentic, cozy, hip. 3 separate areas so plenty of room (less guilt for taking up space) There is only wifi from 7am-4:30 cause they transition to more of a bar. Coffee is delicious!", "author": "Minh N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-20", "description": "I love Building on Bond.  It's not fancy, the food is good but nothing revolutionary, I just love this place because it's chill and easy and consistent.  I get the same thing every time I go and every time I love it.  It's the perfect place to meet up with friends and everyone is happy with what they get and don't have to drop tons of money. \n\nIt's the perfect neighborhood place.", "author": "Christina L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-15", "description": "Boooo they changed their Mac \u0026 cheese since the last time I came here maybe about a year ago. It's absolutely awful now with low quality cheese and tastes like it was cooked it a wood pile. So disappointing. The old Mac and cheese with the bacon bits and ooey gooey goodness was my favorite part of this place.", "author": "Erin M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-01", "description": "If I can give it no stars, I would. Can't comment on the food because I upped and left after getting seated. \nArrived at the place and greeted by the hostess who told us it would be a 30 minute wait for a table. She took my name and number and said she'll text when one became available. Took a walk and still no text after roughly 30 minutes. So we headed back 40 minutes later and saw empty tables. Hostess then states a table just opened up and ready to seat us. She seat us at a two person table when we were a party of three. About three minutes later, someone who appears to be a manager, sweating profusely advised us that the kitchen it's backed up and we won't get food order for at least 45 minutes. That's when we left. What a disappointment and piss poor management.", "author": "Steven C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-08", "description": "Great brunch place! The restaurant has this hipster, kitschy feeling to it lol. The decor was slightly rustic with antiques. Definitely fits in with the Brooklyn vibe. The service was good/attentive and the atmosphere was relaxing. Good place to catch up with friends or regroup after excessive drinking the night before haha.\n\nI got the cranberry pecan french toast. I normally get something savory for brunch because the sweet dishes never fill me up that much. However, the cranberry and pecan are what sold me, and it was a great choice. I also got a side of bacon to get the sweet + savory aspect. I was expecting like 2-3 pieces because restaurants tend to skimp out when you get sides. I was pleasantly surprised to get a good amount of bacon to munch on with the french toast.\n\nThe place was fairly packed when we went, so make sure you don't get there too hungry because there might be a wait ahead!", "author": "Hector D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-12", "description": "Building on Bond  has a super friendly brunch with space to seat small groups and not have to wait hours on end. The food is tasty and served up quickly, with cocktails or strong coffee, whichever you so prefer. They serve up traditional favorites like pancakes, french toast, eggs benedict, and smoked salmon on a bagel, but also have great fresh options, like the duck and kale salad and the Black Friday sandwich (turkey, cranberry, and stuffing!). The prices are affordable for brunch and I loved our server. Ambiance is Brooklyn kitch but down to earth.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-14", "description": "Good thing they included an 18% tip on the bill, because the terrible service wouldn't have earned them any out of the goodness of my heart.\n\nWaited 20 minutes for anyone to come and take our  drink orders, they brought the wrong food and beer, then waited another half hour just to pay, because the place was practically empty, including the server, apparently. The $15 Cobb salad is a joke.\n\nDecent cocktail, though! At least the bartender was trying.", "author": "Keith M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-07", "description": "Walked out of our way one morning to see what they had going on for breakfast.  Not much food to choose from, service slow.  Coffee OK.  Europop music quite iffy.  Hopefully better later in the day.", "author": "N N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-15", "description": "This place is the jiz-am.  hmm, that doesn't really come off sounding quite right...oh well.  We came on a Monday night, sat outside.  We quickly found out they were out of most of the delicious beers on tap, because the taps were broken.  And then I ordered a specific bottled beer, and he told me that one got sold out....because of the tap. Not a huge deal, a bit of a bummer, therefore only reason they lost a star. I'm sure next time I go that 5th shiny star will be shinning brighter than ever.  We had the all you can eat Monday Mussels.  Three kinds of flavors, coconut curry(mmmm), classic white wine garlic(mmmmmmm), and some red sauce one(eh).  My buddy and I tore through about 4 pots each, over 100 mussels, in about an hour and a half.  Our fiancees were quite \"proud\" of us.  They were disgusted. It was sooo good.  The pots come with fries, so they soak up all the succulent juices!  \n\nWhenever I need to gain some much needed \"mussel\" mass to get strong, I know where to go.  Beefcake!", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-29", "description": "This place is amazing! The staff is incredibly friendly and the food and drinks are reliably great. I've been here a couple times now (I've sat at a table and the bar) and the service is always top notch. I'm almost scared to promote this place too much because I want to keep it my secret!", "author": "Garrett D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-16", "description": "The food is ok. Nothing out of the ordinary-- the \"Black Friday\" sandwich was good, but not worth any detours.\n\nFrench fries are pretty tasty. Service was ok, our waiter wasn't that enthusiastic about our menu items which usually isn't a good sign. \n\nOne annoying this is that we had to wait for a table while there were one tops hogging up tables sitting there with their laptops and cups of coffee. I guess they need to get their priorities straight-- would they rather sell a cup of coffee and have someone sit there for two hours or a 4 top of big eaters and booze drinkers.", "author": "Shannon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-14", "description": "I wouldn't tell anyone to go too far out of their way to come here, but I live nearby and they treat the neighborhood right. There is great outdoor seating and they welcome you to bring your pet. I enjoy bringing my dog and the servers always bring her out a bowl of water. The people that work here are really nice, and I've never had issues with the service worth mentioning. \n\nI've had things from the menu that are under-whelming, but I found a few go-to items like the mushroom reuben that never disappoint.", "author": "Zack L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-15", "description": "A perfect balance of quirk and cool. Solid food served in a space that's one part steam punk lounge,  two parts log cabin.", "author": "Sean J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-18", "description": "Ugh, Building on Bond, why do you disappoint me so? I used to love this place... probably even more than it deserved to be loved. The food was never especially exciting or imaginative, but it was consistently good, fairly priced and there were lots of options, so it was an easy place to take people. Not to mention, the atmosphere is kitschy and cute (i.e., \"Brooklyn\"). I especially liked their cobb salad and the pulled pork benedict for brunch.\n\nWell, I went back this past weekend when I had a friend visiting from out of town. Us \"locals\" thought it would be a perfect spot since we were a group of six with variable palates. Also, I have never had to wait for brunch here and, until this past Saturday, I never had a meal here I didn't care for. \n\nThe menu was about 1/10 of the size it once was. Not to mention, there was nothing that even stood out. Boring pancakes, eggs any style, etc. The choices were reminiscent of an unsophisticated cruise ship buffet, except there were only a handful of options to choose from and they gave much less food than I remembered. The eggs benedict didn't come with anything... no side greens and/or potatoes. It seemed like every time one of my friends would ask if their food came with something on the side the answer was a resounding, \"No.\" The pulled pork benedict was nowhere to be found on the menu. And they were out of the only thing that sounded remotely interesting, the porchetta sandwich. \n\nVoraciously hungry, I ordered what I thought would be the largest plate, the burger and fries. Extremely unexciting. The patty was flat and sad looking and the flavor was unmemorable. I am confident that I could have grilled a better burger myself... and I have never operated a grill before. As for everyone else, the unanimous reaction was, \"What the hell happened to this place?!\" \n\nI REALLY hope BoB goes back to their old ways - namely, large variety, consistently tasty food, and generous portions. Until then, I will be eating elsewhere.", "author": "Rebecca N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-13", "description": "I enjoyed my meal here.   Good omelette and delicious cappuccino.  If the service were better, I'd have given more stars.  To be fair, I arrived at 10:55- right before a changeover to lunch service.   Still, I waited 10 minutes to receive a menu, had to ask for water twice and had to ask for bread twice.  When bill arrived, I found that I was charged $2 for bread with an omelette.  I felt that the server should have informed me of this prior.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-26", "description": "It's a running joke in this neighborhood: You go to Building on Bond for the expansive, warm environment--but never for the food. Building on Bond relies on heavy, high-calorie ingredients (hollandaise, egg, bacon, oil, blue cheese) to make up for a lack of menu creativity. This is your captain speaking, with an iceberg lettuce alert.\n\nOn the plus side, the service is excellent: prompt and communicative. Waiters and hosts/hostesses seem like hard workers on their A-game. And the music is often *just right* for hanging out with a coffee or beer: 1950s rock, Motown and post-punk. \n\nBut nothing I eat here EVER produces a craving.", "author": "Sam H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-17", "description": "You don't appreciate what you have til it is gone. They definitely paved over breakfast comfort food with a parking lot of  all ass breakfast changes. Why did you have to kill my go to traditional neighborhood menu? Did you want to compete with the beautiful classy foreign girl restaurant down the block, Rucola? Building, she is out of your league and always will be. \nNow I have to turn away and never spend money at your restaurant again. Why? You broke our bargain.  In exchange  for my patronage you offered OLD reliable brunch fare. Poached egg Benedict in several flavors, breakfast sandwiches, pancakes.... And you had to go and slut around with no more eggs! High faluting chi chi tiny dishes. It is over.\nIt is NOT me, it is YOU. Good bye. I will miss what you were. My pocket will enjoy the 250 dollars I spent at Building every month.", "author": "Bear W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-18", "description": "We've been meaning to stop by based on a recommendation, but didn't get a chance to until recently.  We were told they used to have unlimited mussels on Mondays.  It wasn't on the menu anymore, but they'd still honor it if you asked.\n\nThere is outside seating, but when we went, it wasn't nice enough to make use of it.\n\nAt first glance, it was dark, and the back of the restaurant reminds me of a library.\n\nOur waitress seemed to be new, and was rude when we asked about the mussels.  After we got our food, she stop caring, and went out of her way to ignore us.  When one of her colleagues stepped up, who was an absolute DOLL, they were arguing right in front of the other patrons as we were walking out.  Really?\n\nThe food was average -- didn't wow me, but it didn't offend me either.\n\nNo, thanks!  If you want mussels, go to La Défense instead -- leaps \u0026 bounds better, service-wise, food-wise -- don't waste your time, or money here.  Seriously, their saving graces were the unique decor, and the waitress that brought us our check.", "author": "Ms. V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-14", "description": "Like the other recent reviewers, I sadly have nothing good to say about the recent changes at the restaurant. So many of the dishes I used to get excited about are gone forever - the perfect huevos rancheros, the blueberry pancakes with the blueberries IN the batter, the original and delightful veggie burger, the dry aged burger. Oy. And the Hecho Margarita is probably the best margarita I have had in Bk, they have made it for me since the big change but it's no longer on the menu, so who knows how long that will last.  The new menu items are a little hard to make sense of, there are not many options and no indication of the size or type of dish. The two things I have tried were hugely portioned and unbalanced.\n\nI love the wait staff and I feel bad writing such a bad review of the neighborhood stand-by, but the make over thus far has been a total disappointment.", "author": "S K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-18", "description": "Not a fan of the recent changes.  \n\nFor years this was one of our very favorite places to go to for brunch.  Essentially the menu and food is so different now that it might as well be a new restaurant. \n\nPlease bring back the old menu and food!\n\nAs it is now, we will not be back.", "author": "Peter B."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}