{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-10", "description": "Love Building on Bond. I'm from San Francisco and am visiting Brooklyn for work/pleasure. BoB is great for both. I went w/ friends for brunch last time I was in town and it was delicious. This time I stopped in and worked for a few hours, the coffee is strong and keeps you going, food is yummy and wait staff is pleasant and doesn't rush you. They play great mixes and the atmosphere is unbeatable.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-02", "description": "I ate here twice last year... The veggie burger and fries are very good as well as the mac and cheese. It's a really cozy and casual place for solid food, service and drinks. I wish I still worked in the area so I could go more often!", "author": "Ashley R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-08", "description": "The item to get at BoBis the pulled pork on pretzel roll. Got it? Good. No more whinging about the grilled cheese.\n\nAlso, during the week, this is a good place to come for lunch if you're toting a under-2yo.", "author": "bklyngrl j."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-31", "description": "I've only been in briefly for a cup or beer and recently brunch, but each time seating was ample, food arrived quickly and the staff was attentive.\n\nBasic brunch dishes are prepared simply and lightly, with fresh ingredients and no unecessary frippery.\n\nA nice moment was when I was in desperate need of a wifi signal late on a sunday night and a staff member as well as a patron assisted me in getting what I needed, saving me a long trek to who knows where...", "author": "JD H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-22", "description": "Amazing spot for brunch. Their egg sandwich is amazing, music just what you want to hear, and staff and ambience are all phenomenal. One of my new go-to spots.", "author": "Lexie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-02", "description": "I love this place. Great spot to work at during the day and the Black Friday sandwich is fantastic.", "author": "Ryan F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-17", "description": "This place is great, and keeps getting better. The space is great and the menu has expanded. They have a lot more veggie options now, which makes me go a lot more. I wish they had a dinner salad for vegetarians though.", "author": "Susan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-13", "description": "Looooove this place. You will love everything about this place from the decor, recycled paper on the tables, food and overall vibe. They serve a really good pims cup and the food is so good. I love their burgers and pulled pork and for brunch, they serve this amazing pulled pork concoction (I'm a h.u.g.e. fan of anything to do with pulled pork) which is ammmmaaaazing. I love this place!!", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-18", "description": "Great ambiance; a comfortable, low-key, unique space. The food is above average and decently priced. A good selection of drinks. I would prefer to see more organic and local options.", "author": "Anon B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-12", "description": "a bit of a walk from my apt in brooklyn heights but enjoyable on a warm enough day. the place is never too crowded and you can usually get a seat within 5 minutes. they serve alcohol, cafe drinks and brunch, it's an all-in-one slam dunk. the food is solid, and the waitstaff is pleasant and helpful. you can sit back and read a book and sip and eat and admire the serious attention to carpentry.", "author": "Sarah J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-01", "description": "the decor is a novelty that i am over now.  the attitude of the waitstaff (i am very cool and i really don't need this job and i don't feel like hustling tables) is annoying and ever-present.  \n\nyou will never get a perfect meal here.  something will be wrong, something that was supposed to be cold (like a beer) won't be, the hot coffee will be ever so slightly more than lukewarm and when the milk is added, it will be become lukewarm, the menu item that you ordered won't be served like the menu states, the portions are small.  \n\nthe server that brings the plates will never ask if you need anything else.  customizing is not exactly welcomed.  \n\na few weeks ago, i ordered a grilled cheese sandwich that sounded OK on the menu's description.  what i got was a one piece of american cheese between two slices of white bread, no mayo, no butter.  it was dry and tasteless like what one would expect at chuck e. cheese or in prison.  this is the way that BOB rolls.  all of the time.  \n\ni've been there over a dozen times and it is always that way.  \n\nwhy do we go there??  we are forgiving, it's local and that's about it.  we sort of roll our eyes at the choice each time we eat, pay and leave.  we spent another 10 minutes finding fault with food as described above, each and every time.  they just can't juggle it all and serve good consistent food items.\n\nand whomever has been doing the hiring of waitstaff and cooks all these years needs to go back to the drawing board.  look around the corner to downtown atlantic - the food is 10 times better and so is everything else.\n\nobviously the owners don't read this or care, because if that was my business, i'd put my energy into making the best food that was always very good instead of whatever it is they're trying to accomplish.", "author": "sally m."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-12", "description": "Charming atmosphere, though the food is almost always disappointing (often oddly flavorless). Definitely worth going for drinks or coffee though.", "author": "Tucker P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-30", "description": "Delicious food and fanciful cocktails at a very fair price. I've been for brunch and dinner and even just for cocktails and it always gets the job done. I'd give it 4 stars but the service is pretty bad and sometimes downright snarky.", "author": "ryan F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-18", "description": "Yeah, the coffee here is pretty bad, as another reviewer pointed out. And it's also the most expensive in the neighborhood. And although they brag about the overlap of coffee and cocktail service in the late afternoon/early evening, the employees after 4pm aren't capable of doing any \"barista stuff.\" Only pouring you a cup of burnt drip coffee.\n\nAlso, I have to say: I know the neighborhood is getting fancy, but their beer and booze costs more than at the other bars in the neighborhood -- AND they're sanctimonious about it, like they're offing you a bargain. \"These are cheap. Do you know what prices are in Manhattan?\" They say. Well, yeah. I do. But I don't live there. I live here. And have for a while. And I don't like rude service -- It's not very Brooklyn.\n\nI get that they're trying to break even and they probably spent a fortune on the place, but if I were the manager I might go for attracting more happy people with reasonable prices rather than ripping off a few oblivious people who don't care what they pay as long as they're decent music playing (and there is. generally). \n\nPros: the decor is cool, and very clever. It's got character (even if the staff doesn't). And for the time being it's a nice place to sit and use the internet and watch the world go by. When they start serving food, it might ruin this laid-back vibe. Or if the food ends up being really good and more reasonable than their beverages, I'll come back and say so....", "author": "Glen T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-18", "description": "Oh how I wish it the food, service and drinks were better. I live in the neighborhood and have been here often enough to know that these three things are consistently lackluster. But I go back (not frequently, but I return). I'm not sure why. Maybe it's because it's the hippest (looking) joint around. Maybe it's the funny decorations they put up every now and again. Maybe it's the people watching. All I know is that, eventually, when I go again, I will complain about my meal and lament going back despite my knowledge of the inferior nosh.", "author": "Yoda B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-04", "description": "nothing special but hits the spot - sometimes good old reliable, nothing fancy but all good type of places are underrated in this town.", "author": "James R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-21", "description": "They're friendly, smiley, efficient, and freaking tastey. The environment is really unique, the atmosphere is low light, good color so you look good in there on a date. Had tomato soup and grilled cheese, date had a veggie sandwich with a salad. We walked away satisfied and inspired to redecorate our own homes/studios to match. Priced reasonably. The type of place you don't want to leave, excellent music selection too. No gripes, WIN!", "author": "Kat Marie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-03", "description": "i've totally changed my mind. I love Building on Bond!", "author": "Tom C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-16", "description": "YES!!!!!!!!!!!!!!!!!!!!!! The staff are amazing! The coffee is strong, the pastries in the morning are yum, the din din is kick tush! I freaking LOVE this place! It's so cute and so kick back! This place is unique, special, top notch and like totally OMG!", "author": "allison t."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-06", "description": "Recent Trip to Brooklyn to see my family on Dean Street and I went to this place twice while I was there (once Lunch and once brunch) and the place was more than good.\n\nMy GF and I had a wonderful brunch there (Pulled Pork Benedict was awesome and my GF's pecan cranberry French toast was great) and the burger I had for lunch was very very good. Very nice sized espresso drinks for anyone is a coffee lover like myself. \n\nThe brunch prices were very reasonable (8 bucks a plate) and the burger was 10, which isn't too crazy in San Francisco where I am from. My Grandmother joined for lunch and her grilled cheese looked like something I could make for literally 1 dollar at her place over the stove (2 piece white bread, 2 American cheese slices and some butter on both sides of the bread) and it was 10 bucks with a bowl of plain tomato soup. This should clearly be much cheaper than the awesome burger and fries I had, but its the same. Might want to get rid of the block pricing, so parents can get their kids a 6 dollar grilled cheese, just a thought. \n\nOverall, would recommend to anyone in the area, but be careful because its quite popular with the regulars and you may have to wait for a bit. \n\nNote: if you are allergic to hipsters, don't go here and you probably shouldn't be in NY...", "author": "Nick B."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}