{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-03", "description": "I went here for brunch, and I was amazed at how bad it was. Most of the brunch items come with mediocre, at best, french fries. My sister's bacon was burned. The food wasn't good at all, and the waitstaff is unfriendly.", "author": "Beth C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-13", "description": "Great locale and design.\n\nOld friends reunited here for afternoon drinks and we did succeed! Happy Hour starts at 4, we got there at 2.30 and were able to enjoy ourselves enough to take advantage of discounted drinks. \nDark and stormy is delish, as is their Irish coffee my friend ordered. I was a bit bummed they were out of Kolsch as it is a treat on a hot summer day but I was still impressed they had it. \n\nAnd now it turns out another old friend lives around the corner, reason enough to return, sweet!", "author": "Erin E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-27", "description": "BoB is great! It's a lovely place to go after work for a bite, grab a drink, or brunch. The music is just right. Decor is cute and not overbearing. Servers have always been extremely friendly and attentive. Food is consistent with appropriate portions, though not especially spectacular. Overall, a good place to relax with a nice atmosphere.", "author": "Monique S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-31", "description": "2.5 stars I guess.  Looks cool, had a ton of people eating brunch here so I decided to get dinner there with my family.\n\nfood was totally avg.  I dont get it...", "author": "David K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-17", "description": "Has anyone else noticed that the food here is really spotty lately?  It used to be solid!  They actually manged to mess up french fries--like, beyond all repair.  \n\nI now completely, at-all-costs avoid peak hours here because it can get unbearably packed!  Happy for them that they're doing so well...sad for me missing the good old days...\n\nThe service is usually very sweet.  They do seem to have a remarkably high turnover rate--but I'm not a regular anymore, so maybe that's why.\n\nStill so into the suckerpunch, which singlehandedly saves BoB from a 2-star rating.", "author": "Lee J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-09", "description": "From the welcoming Hostess Chelsea to the very attentive waiter Gareth (cool name btw) this place is very friendly.  Having lived in the area for a while, we passed by this place thinking it wasn't for us, but it is! The menu was very enticing, almost too hard to pick a dish. We enjoyed the Chicken with Salsa Verde and the Porchetta with Fennel. Absolutely delicious! The Pimm's Cup was our beverage of choice and it was very tasty without being too overwhelming with the taste of alcohol. Definitely will visit again as the ambiance was like a homely secretive hideaway.", "author": "Dottie V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-12-25", "description": "I've been here a few times as I really wanted to like the place.  It has a great neighborhood feel, but the food and service is a disaster.  \n\nThe first visit for brunch was OK, so we went back again a few weeks later and it didn't go well.  My girlfriend ordered a latte and when it eventually came it was cold, we finally got a waiter to take it back and they then took forever to bring a fresh cup which when it came was hot, but the latte had become just regular coffee.   They then served up pancakes that weren't cooked and a medium rare burger that was supposed to be well done.  By this point we had been waiting so long I figured I would just eat the burger, but the pancakes were inedible and had to go back.  Properly cooked pancakes finally arrived 1 hour after we ordered.\n\nNot a great experience, but we put it down to it being busy so decided to give it another go, this time for dinner.  Once again I ordered a burger and learning from last time ordered it \"very well\" done.  It arrived dripping with blood.  Meanwhile the grilled cheese sandwich my girlfriend requested with cheddar arrived with american cheese.  I returned the burger, my girlfriend ate the grilled cheese anyway.  Two meals there and we were yet to actually eat at the same time.  \n\nThis place would be so good if they got a decent chef but until then I would steer clear.", "author": "Tim C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-10", "description": "This was my favorite place, despite none of the foods is awesome. It's an experience- the main guy working almost every time I go there, interior, trivia night and stuff, but I feel like its service is becoming poor. I was just served a pastry by a dude not saying anything or looking at me. \nAgain, this place is about the experience, not food or pastry or coffee so I'm worried that that kind of service ruin the space...", "author": "Sho A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-10", "description": "I really like this place. It's spacious, everyone is friendly, good coffee and tea, there's trivia during the week, a wonderful place to enjoy a cold beverage with your friends just about any night of the week.\n\nThere's just one problem: the food. Most of the time it's perfectly average. Sometimes it's just bad. I'm torn writing this review, but unfortunately it's simply lacking. If I'm inviting someone out to lunch or dinner I can't suggest BoB because I don't want to apologize for the food. That's bad. And it's not like it's cheap. It's priced as an actual restaurant.\n\nIf you're just hanging out and ordering drinks and mac'n'cheese -- this is the spot. If you want an enjoyable meal, there're several wonderful alternatives in a one-block radius.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-05", "description": "This used to be my go-to place. Great atmosphere, indoor and outdoor seating, good food for the price. You ignore the crappy service because, hey, it's Brooklyn, you're not in a rush. But. GUYS. They changed EVERYTHING in late July. Gone is my favorite burger (the dry aged burger). Gone is my favorite drink (the maple syrup old fashioned). Gone is my backup choice (Thanksgiving sandwich). Replaced by a fru-fru menu with not very many items on it, with no specifics as to what's an appetizer and what's not, with a lot of potatoes and radishes but nothing appealing at all. So I had the burger, to give it a shot, and it was NOWHERE near as good as the old burger. It was bland. Their old fashioneds used to knock my socks off. The new old fashioned barely had any alcohol. Also, the last time I went, there was only one server for the whole place. And every time I've been recently, the server is new and says it's his/her first day, then he/she disappears. I am SO disappointed because this was my favorite place, and I'd go at least once a week. Need to find a new place now. Booo, Brooklynization. I have a feeling they raised their prices and tried to become fancier, but it didn't work.", "author": "Alana S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-11", "description": "Hair in food in two consecutive meals!!  \n\nI really wanted to love this place -- I thought the beef/chorizo burger tasted pretty good -- but the long black curly hair i found halfway through dampened my enthusiasm for it.  \n\nI was out with my mom and didn't want to ruin her memory of her last meal of her visit to Brooklyn so I just quietly let it drop to the ground and stopped eating my meal. \n\nOne week later, I returned on Halloween afternoon with some friends who wanted to get drinks, mostly -- I had actually forgotten about it and I'm not too squeamish about the occasional hair -- but then one of my friends had a huge hair on her bagel, and the waiter really had a bad attitude when he was asked to replace it (as if he was really inconvenienced by her)\n\nnot sure what's going on but it looks like they are letting their hair down, literally, in the kitchen there.", "author": "Trey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-14", "description": "came here for a midday drink. this review is only for drinking, did not try the food. \n\nmy friend and i sat at the bar. it was around 2ish and there was plenty of seats around. i ordered a dark and stormy, which was delicious. they actually used gosling rum, which i love. my friend got shots of jack daniels with a cream soda. the staff was very friendly and the place was clean and had a good local bar vibe to it. they also have a pretty good selection of hard alcohol from what i could see. there is also a big TV right above the bar area, which was nice. \n\nall in all, very nice place to just relaxed if you're in the neighborhood. also, miles end is around the corner so if you need to wait for a table there, you should come here to relax first.", "author": "Alan C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "This is the greatest neighborhood bar and I love it feeling like home (staff is awesome). Great cobb salad and brunch. I think they need to up their burger game.", "author": "Stacie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-25", "description": "I went here with some friends this past weekend and we were all happy with our meals and drinks. \n\nI had the dry aged burger, which was really good-the cheese on it was amazing and it was cooked really well. Others in my group tried the pulled pork sandwich which was a big hit and is what I will try next time I think. Another in our group tried the cobb salad which he found pretty good. \n\nI also had a couple of glasses of the malbec which I was pleasantly surprised by-you never know how the wine will be at a pub type place, but I was really happy with their malbec. \n\nThe only issue that I had with the restaurant came at the end of the night when we got our bill. I am still not entirely sure what happened, but somehow we ended up getting overcharged about $75-there was some confusion as some were paying in cash and others in credit cards. At any rate, we realized this and it was taken care of no problem so no harm was done.", "author": "Molly H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-20", "description": "The lack of competition and the well designed interior make this a reluctant choice more often than I'd like. The food is passable to not ok, and just overpriced enough that it's irritating. This place could be so much better with just the smallest of menu tweaks or some price reductions.", "author": "Sir M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-23", "description": "Have come here for brunch, lunch, and now dinner. It's a great neighborhood place, good / tasty food and kind waitstaff :) totally recommend if you're just hanging out casually with friends, significant others, or family.", "author": "Pam K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-10-28", "description": "Absolutely love the retro decor @ this place...esp how the placemats are integrated into the tables...really cool touch.  If I was ever going to have a restaurant, it would look exactly like this...but my food would be better than what they've got here.  \n\nMy wife \u0026 I shared the goat cheese \u0026 beet salad, which was actually pretty good.  But its a salad...cheese, beets, greens, dressing...it better be good.  When we got our sandwiches, we were definitely a bit disappointed.  I got the cheesesteak, and lemme tell you...I've had a lot of cheesesteaks in my day, and this one just did not cut it.  The bread was good, but there was barely any meat in the sandwich...and I think it was cheese whiz or something, and there wasn't even that much of it in there, so it really was lacking in both cheese \u0026 steak.  Heck, even the cheesesteak @ the new Meadowlands is better than this one.  And I don't recall the menu saying anything about the type of cheese it would be, but I could be wrong there.  My wife had the grilled cheese \u0026 tomato soup - more cheese whiz (and not enough of it) \u0026 so-so soup.\n\nWe both expect better quality from a place like this, so we left a bit deflated, but we are both willing to give it another go since it does seem like a cool place, and our friends we ate with have been there before \u0026 had a great experience.  Perhaps a star or two will be added, but we'll see!!", "author": "Douglas D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-05", "description": "Walked here after apartment viewing to have brunch with a good friend of mine. She ordered the scrambled eggs with broccoli and mushrooms, I had some interesting thing of fresh mozzerella, pesto and tomatoes on top of a portabello cap. It was surprisingly filling and very yum. Went perfect with the amazing weather that morning.\n\nAgreed, I might not go out of my way just to eat there, but it was so pleasant that it made the apartment I looked at like 10 times more appealing. If I lived there I would frequent often. I loved their \"placemats.\"", "author": "Jess S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-16", "description": "Arrived on Labor Day Monday around 2pm. We waited what according to my local friend was a long time and not normal, to be seated. No worries. The staff seemed to be zipping around and quite hurried. I ordered the portobello Reuben which was delicious. I also ordered the soup. Unfortunately, a spoon was not brought until I asked for it. I would likely return.", "author": "Anthony R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-09", "description": "Nothing to write home about culinary-wise. But you don't come here strictly for the food. It's not bad. It can leave you sated. But it's more about the vibe. It suits every purpose. Breakfast with coffee and a bagel and NYtimes.com on your phone. A burger and a beer for lunch. Steak and wine for dinner. Think of it as the Swiss-army knife of culinary establishments. And they have outdoor seating for one or eight. Huge bonus in my book.", "author": "Gil S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}