{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-10", "description": "This place is beautiful!  Lots of wood, butcher block, and clever details on the bar and tables.  In the day time it's a coffee shop, at night it's a restaurant and a bar.  The people are super nice, and it's clean and a terrific addition to the neighborhood.  The chalkboard sign outside says that Wi-Fi is turned off at 4:30pm.\n\nI have to tell you that the coffee and espresso drinks are awful!  Just really really bad.  And the pastries cost an arm and a leg, even if they are from Balthazar.  The place is getting really popular and there are tons of laptops during the day, so it's a bit harder to get a seat.  Despite this, I still love the place.\n\nThey have now started up food service, but I haven't tried it yet!  I heard it was pretty good, thogh.", "author": "Steph X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-24", "description": "Amy, I had EXACTLY the same experience trying to finally eat here, after coming here for coffee and drinks since they appeared.\n\nThat turned out to be okay though. Ended up eating here for the first time with my family and a bunch of my New York orphan/retail/Jewish friends on XMas Eve. No one else was there, so we could sing along to the 90s rock (both Lit and Everclear, holy balls) and later sing our own carols.\n\nSuch nice staff, such a great vibe. The Molasses wings are great, shocking the other wings aren't nearly as good. All the salads are yummy. The burger is good. Not great, but good. I'll get something different next time. The Mac and Cheese? Ehhhhh. Dumont this is not. Still, perfectly nice, fresh food, good beer, and a great atmosphere, especially on Christmas Eve....\n\nOne weird gripe, though: they turn the lights WAY down at 5 now and shoo laptops users out, so if you wanna work or study here go early, it becomes (at least for now) a full-fledge restaurant in the evening.", "author": "Scott P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-10", "description": "This place is all surface, no substance.  It looks good, but the food and service were sub-par.  Went here for brunch and ordered eggs benedict.  Eggs were undercooked, bordering on raw.  I sent them back, and another plate was brought up no more than 5 minutes later, with eggs that were completely raw - hardly cooked at all.  The waitress explained that it was my job to specify that I wanted my eggs cooked (I didn't know raw eggs were the default cooking method here) and that the cook, who \"doesn't speak english,\" likely misunderstood her when she sent them back the first time.\nEssentially, she blamed me, rather than simply fixing the problem and getting me a new (cooked) meal.  I explained to her that the kitchen translation issues were not my problem, and moreover, that anyone with any common sense and cooking experience (not to mention an adherence to health codes) would not have sent a plate of raw eggs into the dining room.  \n\nBut, based on the cutesy, faux-rustic aesthetic and oh-so-hip DJ booth in the middle of the restaurant, i have a feeling this place will survive - and probably even thrive - despite any ability to, you know, cook and serve food properly.", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-11", "description": "Delicious, Cheap brunch (think $8-10 entrees), and the Cranberry Walnut French Toast was amazing...literally so good my boyfriend and I went on a hunt for cranberry walnut bread the next day to try and recreate it. Drinks are inventive and different and they have Pimms! :)\nDefinitely going there again", "author": "Azella P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-24", "description": "Building on Bond has become my after work bar over the past six months and I love it. The late-night staff are incredible--friendly, laid-back people who give amazing service to polite, honest patrons. Their bartenders are equally happy to engage you in conversation or to let you be. Felice, in particular, is incredibly sweet and funny--she also mixes a mean drink.\n\nI've only been here a few times during the day to eat and I've never been floored by anything (though the soups are usually a good bet), but I'm not really looking to be. BoB is more about atmosphere--a great place to hang out, not the best/most creative dishes or coolest, most obscure beers. \n\nEssentially, if you're looking for the best sandwich in Brooklyn (and \"best\" requires that it come with fries), want a delicious wine with a lot of personality and need those things served to you before you can finish ordering them while your server licks your shoes, I wouldn't go to Building on Bond.\nIf you want to get a drink, relax and have some laughs, then you should.", "author": "Jane O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-04", "description": "Great place to grab a simple dinner or lunch. The veggie burger is delish and I like the fries. Good beer selection and cute atmosphere, lots of stuff to look at. Gets a little hectic on weekend nights though. Came for dinner with 3 friends last Saturday around 9:30 and by the time we left it was like a nightclub complete with DJ and people hovering over us with their drinks.", "author": "Sarah F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-24", "description": "I was here on a Sunday afternoon and we liked it a lot. If I still lived in the neighborhood and not up in Boston, I would definitely return again and again. We were 6 adults and one toddler, and they were very accommodating, moving tables so they we could fit and not getting too upset with a wandering toddler. The service was wonderful, the ambience was nice, the food was good, and the drinks were strong. What else could you ask for?", "author": "Josh S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-15", "description": "This place might as well be my second kitchen. I have no complaints about anything I've ordered and I'm one seriously picky eater. I'm also a foodie and love the imagination on the menu.", "author": "Lex A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-06", "description": "I often go to Building On Bond for their amazing Veggie Burger. It is technically vegan but I get it with Gruyere and it's very good. The sun-dried tomato spread that comes with it is a great compliment to the rich veggie/warm grain taste. It is a lil expensive if you wanna add the side of seasoned fries, but worth it, as they still have their skin on( therefore, in my head, retain some semblance of healthiness), are piping hot, homemade and good.\n\nThe staff is chill, very helpful and lets you breathe.\n\nCome here to relax or work.  Daytime on a weekday is often swamped with coffee drinkers with laptops (they are wonderfully accommodating at B-O-B and have many plugs) It can get crowded at meal time, too much so to work, but by then it is time to  have some beer or one of their interesting and different cocktails (with their infused liquors) and just chill. Everything will be alright!", "author": "Rebecca H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-14", "description": "I love this place.  I LOVE the wood interior, the re-purposed mid-1900s office materials.  Reminds me of the actual old-school office my parents had in their 100-year-old independent pharmacy in Maine.  \n\nThe coffee is superb--Grounds for Change makes a wicked espresso.  Haven't tried any of their other grinds.  I am also quite partial to their flaky whole wheat croissants (though I'm sure they order those in from some bakery).\n\nIt's always warm and toasty in there and they play an extremely eclectic mix of music and not at too high a volume, either.  Free WiFi and lots of free reading material makes it just about the perfect coffee shop.  Tons of warm little nooks to tuck yourself and your laptop away in...", "author": "Sarah D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-01", "description": "Despite what I had heard about their staff, everyone was super friendly and accommodating.  It was a beautiful brisk fall morning and they had strategically placed heaters to break the chill.\n\nFood was great - i had the egg sandwich on brioche, which was fluffy and buttery without feeling too guilty.\n\nIn the drink dept. I went for the Bloodless Mary which was a fantastic sipping drink for brunch - ultimately i still craved the tomato juice so I had a follow up Bloody Mary with their horseradish infused vodka - highly recommend both.\n\nI'll be back.", "author": "Elizabeth L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-24", "description": "Booze brunch is all I've tried here. Service is awful, food is slightly better than edible. Don't go out of your way.", "author": "Chris Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-12", "description": "cute place.  adorable decor.  loved that they showed the world cup matches on a large projector/screen.  oh, and those fries....\n\nmy server was also fab -- i think her name was rachael.", "author": "rox h."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-09", "description": "This had been my go-to place in the neighborhood for more than a year. I had been coming almost weekly, sometimes twice a week. Unfortunately the service was so bad the last time I went that I may never go back. I forgave the mediocre food here, because it was always made up for by the warm atmosphere. But no longer. I walked in with a friend visiting from out of town last week, hoping to show him some true Brooklyn hospitality. We were treated so poorly. The new hostess seems to think she works at a chic Manhattan restaurant, instead of a friendly Brooklyn joint. The bartender completely ignored me as I stood right in front of him like an idiot for ten minutes trying to get his attention. After 20 minutes of being pushed around by the hostess and ignored by the bartender, we left and had a much better experience at Apt 138. Get it together, BoB! No one is coming there for the food.", "author": "L S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-16", "description": "Service 5. Food 5. Atmosphere 5. What a great little place! We stopped off here for late lunch on a Sunday afternoon. It feels very cool Brooklyn but without any attitude - just a great chilled out vibe. I had the veggie burger which was just the right size and damn tasty. My fiance had the traditional burger with blue - we split the cookie with ice cream for dessert. What I most liked was the portion size - just perfect. The service was impecable, no waiting and also half pint beers for the ladies. We'll definitely be back.", "author": "Nadia G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-06", "description": "im sorry but why is this place getting bad reviews? \nHas any one tried the BoB burger? SO DAMN GOOD just thinking about it makes me drool....", "author": "Lady B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-08", "description": "Decor befitting its Boerum Hill corner, delightfully complementary to nearby Brooklyn Inn, Building on Bond also boasts the most delicious burger in the borough: a blend of beef and chorizo between pretzel buns. I am excited for Taco Tuesdays.", "author": "Mario R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-25", "description": "Ended up coming here when we got to Mile End too late in the day to get served. I was greeted warmly by the bartender who liked my Philly Flyers hat and wanted \"the Philly guys\" to sit at the bar with him. Although the menu had lots to offer, I saw and smelled a juicy burger go by and went with that. The patty was made of a blend of chuck beef and ground chorizo, and the bun was actually a pretzel roll that was perfect for soaking up the juicy goodness. There were a ton of board games to keep us busy as we waited for our food, and the beer selection was spot on. Any place that pours fresh local beer gets my nod of approval. All the food looked good, going by and even though I don't often trek out to BK just to eat, I'd certainly come back if I was in the hood.", "author": "John L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-10", "description": "This is a great neighnorhood spot w/ very good food. The place is always packed and the service a bit slow, but it's worth the wait. Their burger in a pretzel bun is very original. You can also have a black Friday sandwich w/ cranberry sauce, stuffing and turkey all year long! Highly recommended for brunch.", "author": "Nif R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-07", "description": "Walked past this place a couple times, but tonight was the night to park our asses on their outdoor seating and have a drink. The healthy selection of beers on tap (we had SixPoint Brownstones) at happy hour rates ($3/pint) started the experience off right. We were well taken care of by our server Meghan, who confirmed their burger (which chorizo and beef mixed) was a winner. They serve a bunch of their sammies on pretzel dough rolls, which is itself a treat. The burger was a little more \"medium\" than \"medium-rare,\" which we attributed to having to cook a burger with chorizo in it a bit longer. Not a problem, though. BoB is a couple blocks from our new place, and I can definitely see us dropping in on an almost weekly basis (especially to try the famed pork sammie everyone's mentioned here).", "author": "Jason K."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}