{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-27", "description": "I will probably not eat out at this restaurant again, for the following reasons:\n1. The service staff are very standoffish and unfriendly. \n2. The food's mediocre quality does not justify the restaurant's inflated prices.\n3. I saw a roach on the floor when I was last there. Gross...", "author": "El D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-06", "description": "Went to see a friend in Brooklyn and wanted to grab a quick bite and found this place about half an hour before the kitchen closed.\n\nThe food was solid, no complaints. tasted fine but wasn't amazing but again, the kitchen was about to close\n\nThe menu items were on the cheaper side, good for a solid cheap meal.\n\nThe service was great, the waiter seated us quickly and we had our food in a matter of minutes. He checked up on us consistently and was very courteous.\n\nWe sat outside which was off of Atlantic Ave. so there was some traffic noise. The area otherwise is very nice and green, a good amount of people walking around with their kids and/or pets.", "author": "Nadeem M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-13", "description": "This place is so quintessentially Brooklyn, it almost made me want to move there. ALMOST. But the attitude of the waitstaff made me realize my foggy thoughts were just due to the insanely-doused olive oil focaccia wrapped 'round my meatballs.", "author": "Valentina V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-17", "description": "I've been here many times since I live in the neighborhood.  Perfect for anything between brunch and a very late lunch with outdoor, enjoyable street side seating across from neighborhood brownstones.  Not a single thing on the menu has disappointed me - the burger on the pretzel bun is a favorite, as is the Black Friday turkey sandwich.\n\nIt feels more like a coffee shop, first, with the addition of a full bar and restaurant, and it seems to do everything well.  During the day, expect a very laid back vibe (with service to match) and lots of 30+ somethings writing/reading/hanging out.  Great beers on tap, and good selection of mixed drinks.\n\nThe dinner is also very good, not crowded - nothing fancy.  \n\nfyi, Bored to Death filmed a scene here last year and is reportedly a favorite of creator Johnathan Ames.  His depiction of the Stroller Mafia was spot on...", "author": "Nish R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-10", "description": "This is my all time favorite neighborhood place to eat.  The weight staff is friendly and personable and the food is always just amazing.  Substitutions are never a problem and make the menus really accessible to anyone.  I love love love their brunch and their drinks are always top notch.  Definitely the best place to head when friends are in the area or you just plain don't feel like cooking.", "author": "Denise B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-16", "description": "I came to this place the other day for brunch. The service was nice the price was right and the food was good. The only negative was were allowing pets in the restaurant. That is a big negative with me.", "author": "Jim C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-26", "description": "Last weekend was not my first time at BoB, but I was pleasantly surprised when my husband and I settled there after two hours of brunch searching. \n\nFirst of all, we sat outside before and I had no idea that the decor was so nicely done inside. I don't really care if there's a DJ there or not, though the music was pretty good, but the attention to detail in the decor is what prompted me to give this place 5 stars instead of 4 (the chorizo burger I got here before was just okay, a little dry...).\n\nSo, have you ever taken a bit of a sandwich and, with your mouth still full, shouted \"WHAT?!\". I did that. No, really. I did that! The Black Friday sandwich was far superior to any other turkey/Thanksgiving/stuffing/cranberry/heaven item I've ever put in my mouth. We shared that and a lox bagel plate - which paled in comparison to the Black Friday, but was still tasty.\n\nOur perfect lunch was topped off with a sweet celeb sighting... \n\nWe will be back and soon.", "author": "megan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-21", "description": "Great place with a good selection of beers.  My son said the macaroni and cheese was the best he ever had in his life.  Great place to drop in.  Don't miss it if you are in the neighborhood!", "author": "Brian F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-26", "description": "I went here yesterday for the first time with the boyf. We were lazy and it's pretty close to my apt. so we just stumbled upon it. I'm really glad we came! We weren't too hungry but staked out some seats outside and shared the chicken sammy - which is huge btw and came with yummy fries and also had the mozz cheese with tomato and basil. Dee-lish. All in all the food was good but the drinks/cocktails were amazing hence the 4th star. I think I'm messing up the name but i think had the \"beehive\" or something similar - bourbon, ginger and honey always work in my book. Strong and sweet, just how I like 'em! On top of that, our server who's name I just forgot (Patrick?) was probably the most pleasant man I've ever met. Didn't rush us, seemed genuinely interested in our experience and even offered up a dessert option (baked apple pie....it was aight, kind of sweet for me but not bad). \n\nI'll def. be back.", "author": "Monks C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-08", "description": "Great Cobb salad. Fries were a bit cold. Service was good, but a tad slow.\nWould definitely go again.\nNice atmosphere.", "author": "Kiri J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-05", "description": "Ok -- here is the run down -- I went here to meet a friend who was in the neighborhood.  I agree -- I don't think I would go out of my way to go to this place.  The food was good.  I had a very tasty veggie burger with FANTASTIC fries.  My partner had a salad which was fresh and tasty.  The staff was friendly.  The Mac and Cheese looked yummy too. The crowd (20 and 30 somethings as noted) looked friendly too. Those are the pluses.\n\nThe minuses -- the staff was slow and not too attentive.  The restaurant wasn't that busy,but I felt we had to prompt them for the basics including:  I ordered tea and had to ask for milk and sugar (it is generally offered)  I also did not get a spoon to take the tea bag out either.  My partner ordered a salad and I ordered a veggie burger -- her food was brought out about 20 minutes before mine -- wouldn't it be natural to assume we wanted to eat together??  While I was waiting, they served me the food for the next table???  I also had to ask for utensils and salt and pepper for my meal(???) \n\nThe place is cozy but the seats are either tall wood chairs (that reminded me of art class), shorter wooden chairs or wooden pews (like from church)  Wooden pews aren't cozy or comfy ... particularly when you are over 40.", "author": "Joan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-27", "description": "Good, reliable meals and really delightful service!", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-10", "description": "In a hysterical sort of way, we ended up moving just a few blocks from BoB so now we come here pretty often for brunch.  They took the grilled cheese off their menu--thankfully!", "author": "R O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-19", "description": "dear building on bond,\n\nstop serving food.\n\nsincerely,\n\nricky r\n\n.....................\n\n\nthe first time i walked into building on bond, my favorite album of all time (marqee moon by television) was playing softly throughout the restaurant. i instantly felt the urge to bounce around like an 8 year old on her second bag of skittles.\n\nthe interior of building on bond is \"retro everyman classy\" and oozes laid back cool. i recommend going to building on bond and ordering a drink or two just so you can sit back and soak in the restrained hipness of its decor... actually, i ONLY recommend going to building on bond for a drink so you can sit back and soak in the restrained hipness of its decor. why?\n\nwell, to put it eloquently, their food is \"meh\". every entree i've tried (and i've tried many) has tasted remarkably unremarkable. my verbose partner described their food as \"edible\".\n\nin fairness bob does have one good food item, the fries... which are actually kettle chips... basically BOB's entire kitchen is a hot mess which sad really because this sexy little building on bond could/should be so much more than it is.\n\nchips, booze, and atmosphere... the only good reasons patronize to this \"restaurant\".", "author": "Ricky R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-25", "description": "Had not made it to Building on Bond in quite sometime-it is near where my friend lives so we had dinner here Saturday night. Everything was really tasty especially the artichoke appetizer. As with this whole general geographical region it can get buts with the kids; this was in the evening and we were sitting outside so it was pretty tolerable (more than tolerable I would say)", "author": "Eve S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-13", "description": "Friend and I met for lunch at the BOB and it was okay. Many of the dishes that I was interested in ordering wasn't available that day and I took the server's recommendation of the pulled pork sandwich over the hamburger. Food was okay, but not memorable. \n\nReally enjoyed the atmosphere though and like other reviewers have said, they let you stay for as long as you'd like. We were treated very well from the moment we stepped into the establishment. I would definitely go back to hang out with friends, read and enjoy the ambiance.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-08", "description": "Dipped out of the Atlantic Antic last week in search for something not so greasy. We were seated outside while someone across the st. was spinning 90's jams.. awesome. The cocktails were delicious, especially mine that had Makers and honey in it. Mmm. We were on our way to a show, so we just needed a few munchies to hold us over. We had the mini-mac and cheese, a caprese salad \u0026 the thanksgiving-type sandwich with fries. All of the food was yummy and good sized.. and I loved the sandwich and the crispy-salty fries it came with. $42 later we were on our way to Jay-Z with our bellies full. We will certainly be back!", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-21", "description": "Careful that you don't walk right past.  You'd be forgiven for thinking that it's a ground floor studio of some hip design-build company (which it may also be) instead of a great new restaurant cafe.\n\nThis places deserves all four stars and then some for the following attributes:\n\n- great food: I had a turkey club which was delicious, it was actual roasted turkey breast not slices deli meat, very succulent, some kind of interesting bread which had (I think) cranberries embedded in it and really delicious bacon; my friend, a long-time vegeterian, pronounced her veggie burger to be the best she's ever had; after we finished our wonderful meal we both perked up when a nearby customer got his steaming plate of mac and cheese which smelled incredible.\n\n- ambience: it's a restaurant with the laid-back, cozy feel of a cafe; it's a functioning cafe with free wifi that also serves real and really good food; at 2 pm it seemed okay to hang out here with your laptop as long as you like; staff is really nice and do their jobs well and the whole place just feels very laid back, welcoming.\n\n- decor: the look is definitely carpenter atelier chic, lots of wood, paper shades, work stools, wood benches, etc.  Everything is kind of mismatched and scattered without seeming messy or confusing; they make full use of the corner location, the big windows pulling in lots of light with the trees on Pacific adding some nice greenery.\n\nI can't wait to go back to try some of the other menu items.\n\n12/15 note: I went back for brunch and the food was good but not as good as lunch.  It almost seemed like an afterthought.  They may be working on a better brunch menu so don't rule them out.", "author": "Lisa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-29", "description": "Best wings in brooklyn and staff is very nice.   The Flatbreads are really tasty as well.  Looking forward to trying more of the menu..", "author": "Dennis M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-10", "description": "Fan. Great cocktails. Had the old fashioned, but I might move to the bumblebee or whatever it's called next. Thick drink, strong. Food is also very good. We started with the fried artichoke. I am not an artichoke fan, but they way they make it is fantastic. Fried in like peanut oil or something. Crispy and flavorful. For the main course, I ordered the veggie burger with french fries. The latter came out piping hot, salty and delicious. The veggie burger held its consistency, i.e. it didn't fall apart, but it also didn't taste all that great i.e. I've had better. Tasted very...healthy...like it was chock full of fiber and grains. Not bad, just not great. The service was kinda slow, but that's okay if you're in no hurry. I would come here again and again.", "author": "Mike O."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}