{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "Adorable quaint bar in Brooklyn right by the Barclay's center. My girlfriends and I were attending a show and we wanted to find a bar to have drinks and dinner before hand. Building on Bond is about a 10 minute walk from the center and well worth it to not be stuck in a crowded bar right by Barclays, its far too over crowded there.\n\nWe stumbled upon Building on Bond after parking, and walked right in and were able to be seated right away at a high bar top. It was really cute inside and fun atmosphere, plus the Michael Jackson station was on so that is always a plus in my book!\n\nThe bartender, Kate, was amazing! She introduced herself and helped us pick our drinks. I was craving gin, so she suggested I try the Stone and Flowers. This cocktail was a mixture of gin, prosecco, and something else, but regardless it was delicious. It really hit the stop after a stressful drive from Jersey and was just what I needed... I had 3 of them!\n\nTo eat, I obviously had the macaroni and cheese - my staple food item at a bar. It was perfect and homemade. I loved the macaroni they used, a larger shell. The cheese melted perfectly within the shell and was broiled at the end to add the right layer of harden cheese on top.\n\nWe really enjoyed our time at Building on Bond, so much we lost track of time and had to rush to make our show. We really loved it there and will definetly be back before every show at Barclay's.", "author": "Jenna U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-29", "description": "This is a comment on one of my closest neighborhood eateries:if needing coffee and pastry on the run( as in driving into Manhattan for a morning appointment) BOB offers excellent take-out coffee and super pastries: croissant, turnovers, pain any chocolate, etc.", "author": "Marty F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-14", "description": "What saved the 4 stars was the server and the perfectly cooked steak but everything else was a disappointment. \n\nMaybe, they are short staffed but it took more than 45 minutes for food to come out.\nThe server apologized and followed by sending fries on the house which was nice but expected after waiting.\n\nTime passed...an no entrees yet... Great.\n\nLong story short ,  I (we) received free fries and a round on the house , the sever was nice and attentive; but the place failed at timing . Manager did  not even apologize over the delay. Expect to dine in for more than 2hrs. \n\nMight come back before heading back to LA", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-06", "description": "Building on Bond has been on my brunch list for a bit, and after running an errand in the neighborhood one perfect fall Saturday, I stopped by to have a late solo brunch. The hostess was all smiles and I sat outside. I started off with a Blood Mary that had the perfect amount of heat, and got a burger. So so glad the burger comes with fries! I think the price of the burger on their website is $2 less than it is now, so FYI. But it was a decent sized burger--I ordered mine medium and it was juicy. The fries hit the spot additionally. My waitress checked in on me many times and I didn't feel rushed. I will again note that I was a party of one and I ate after 2 pm, so not during the peak brunch rush--so plan accordingly if you are a larger party. I didn't go into the restaurant but the decor I peaked at from the windows is super charming and quaint. Will add this to the brunch list for sure!", "author": "Chey H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-24", "description": "Was walking to Rucola but it was closed due to a private event. We stumbled into this place without consulting yelp, and it was a nice surprise. The burger was delicious. The fries were a little heavy on the salt, but nice and crispy. And for dessert, we ordered the chipwich - a chocolate chip cookie warm in a cast iron with marscapone gelato on top. \n\nTwo stars off for their frantic waitstaff that seemed to forget about us. It was a full house with only two waiters, and we literally watched them sprint from room to room, table to table.", "author": "Nicole T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-07", "description": "This establishment should get \"no stars\" but unfortunately I'm not giving that option. My husband and I ( please note: we're both Black American) sat down for and party of two. After ten minutes of sitting and waiting for at least some water, the Host sat two other non-black Americans down and they received water and services immediately. My husband then got up and spoke  to the host, she then replied \"oh\" and walked away from him. This is very upsetting and I will never step foot in this establishment ever again nor will I ever recommend this place to anyone!", "author": "Chantel A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-18", "description": "Delicious.  We love stopping by here on weekend mornings for coffee and almond croissants, but stopped by tonight for dinner and drinks and it was really wonderful.  We had the special- meatloaf with mashed potatoes and green beans and it was really quite lovely!  The service here is always fantastic.", "author": "Kate H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-12", "description": "I was in the area and decided to opentable a lunch spot. This placed seemed good and it is. I got the bbq shrimp and i was expecting something different but still good. (Must like Worcestershire sauce). My friend got the portobello and he gives it 6/10. I came during lunch will gave to come back for dinner. Update to come after revisit.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-18", "description": "Went here with a few friends. The ambiance is cute, the drinks were good and so was the service, but the food was not good. I think this is a recurring issue, based on many of the reviews here. The food is just edible, but not tasty. Perhaps they should just turn into a bar instead. Either that, or they should hire a new chef.", "author": "Cat W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-06", "description": "Cool vibe, definitely comes off to me like a \"hipster bar\" ...but hey, it's Brooklyn. \n\nMenu is pretty limited to sandwiches and salads. They do have daily specials. The cocktails all look amazing and the one that I had (Pimm's Cup) was delicious. My boyfriend and I came here to grab a light dinner after catching a movie nearby. I wasn't too hungry so I got the Korean Fried Chicken Wings from the appetizers. My boyfriend got the special of the day, a roasted half-chicken served with green beans and mashed potatoes. We also got the brussel sprouts to split. \n\nFood came out pretty fast, good portion sizes though the brussel sprouts were definitely a little overpriced ($9 for a small dish). Nonetheless, they were seasoned and sautéed well. The KFC was not bad, I've had better but then again didn't expect much from this place. My boyfriend enjoyed his meal too, but nothing really blew us away. \n\nThe two-seater booths are uncomfortably narrow. I felt like I was in a toddler-sized church pew. \n\nSolid place to grab a drink, still wouldn't come out of my way again.", "author": "Margaret Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-11", "description": "Seemed liked a decent quiet place to grab a small meal by myself before the dinner rush. Had to wait for someone to seat me (again, they were not busy). After asking for the wifi when I got my beer the man was rude and shocked that I would be surprised by the fact they turn their wifi off at 4:30pm. (That's also just not a nice thing to do). After that the service was non existent, when someone came by to clear my table they were unfriendly. I'm not from the neighborhood so it may be a great place for the Boerum Hill people but they were not friendly to me. On top of all this, charging $6 for adding chicken to a salad is totally insane and uncalled for. Would never go back. The stars are for the happy hour beer special and good salad.", "author": "Mariah T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-03", "description": "The first time we came to this place we adored it. We were given a cute tabel and lots of attention by the staff. We held hands in the rustic charm of the restaurant until our meal arrived. Fried Chicken sandwich and a meatball sandwich. The food was delicious and generously portioned and the owner came by to tell us how cute we were. We promised we would be back but during our next visit Building on Bond was a totally different place. Somehow they had no AC in the middle of a NY summer. The restaurant was shrouded under a heavy blanket of humidity and the smell of oil. The waitress never came by to our table in the back and when we finally got our food and drink we just pushed the sloppy looking sandwiches around on our plates and eventually left unsatisfied.\n\nWe won't be going back. It's a shame because the place is very cute.", "author": "Maria A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-09", "description": "Met up here with a couple of friends - actually, had a reservation for just me and one friend but we ran into two others just as we walked up, and they were able to accommodate, so thumbs up for that. They were also fine with my dog being at the sidewalk table, although I did have to ask them for a bowl of water for him. The food was pretty good. I had a charred kale salad which was fairly run of the mill, but I tried my friend's portobello Reuben and that was excellent. Another friend got the same salad as me but asked them for grilled chicken on top and they charged $5 for that! \n\nSince it was a Monday lunch, we got cocktails of course. As per other reviews, the Pimm's cup was excellent and very refreshing for a hot summer afternoon.\n\nMy overall assessment: cute spot with good cocktails and solid food. Service was a bit slow, but they are accommodating. I would definitely come back.", "author": "Olivia T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-01", "description": "Wednesday night dinner...\n\nFood: Delicious and portion size was just right. We had brussel sprouts and wings as an appetizer and then a special pesto pizza and the chicken cobb salad as entrees.\n\nService: A1\n\nDecor: Quaint and good lighting.", "author": "BlueMarie E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "The definition of a perfect neighborhood spot. Super friendly service, solid staples, perfect for working in, never a wait for brunch, dinner good too (the salmon is a good deal!). The Cobb salad is a classic favorite, but I also like the meatball sandwich. \n\nJust good people, great atmosphere. Can be a casual lunch spot for a meeting/catch-up, or a surprisingly romantic dinner location.\n\nLove you guys!", "author": "midge j."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-06", "description": "Great spot! Came here during happy hour for drinks and snacks. Staff is very nice \u0026 friendly, interior is very cool and rustic, some outdoor seating available. \n\nHappy hour specials are lit\nBrussels sprouts are lit\nMac n cheese is lit\n\nThis place isn't anything fancy but that's why I like it. 4 stars because there wasn't anything super duper special about it.", "author": "Lindsay A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-06", "description": "We recently had a late brunch at Building on Bond on a Saturday.  I hadn't been here for a couple years, but was again struck by the eclectically cool decoration.  Lots of outdoor seating for nicer days, as well.  \n\nThe service was very friendly and laid-back.  I had an outstanding Pimms Cup (best day drink ever), and my girlfriend enjoyed the sparkling gin drink she ordered.  The food was good, well-sized, and well-priced -- not sure you can ask for much more out of brunch.  Three tasty pancakes with blueberries and a side of grilled chicken sausage for me, and an enormous BE\u0026C sandwich with fries for her.  \n\nNothing unusual or crazy in terms of the food here, just well-executed standards at a decent price in a large, funky/fun space.  I'm a fan.", "author": "David M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "3rd graders review: Minimal amount of food options. Pancakes were awesome. The Eggs were solid. The lemonade was fresh. The environment was old fashion and very pretty. It is a really cool and unique environment.", "author": "Pervis E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-19", "description": "Underwhelming - the food was bad, the service was slow, and it's expensive. On the plus side, there is outdoor seating and they gave my pup water.", "author": "Jennifer W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-23", "description": "For me, this place was simply okay, the food was alright, but I did not love it or think this taste good, it was edible--that's it. To be honest the music was the best part of this place, if you like indie, electronica or alternative music than you will really like the vibe.", "author": "Naomi T."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}