{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-11-22", "description": "I agree with a previous reviewer. I used to really like going to BoB, good food, tasty drinks,  fun staff, and amazing decor.  What happened to everyone?  Some of them might have been a bit flakey, but at least they could make a decent cocktail, unlike the ones now.  The other night both me and my dinning partner had to send our cocktails back and just ordered beer (which took far too long to make the drinks or replacement beers, BTW).  Also they were great to talk to, which is what you want in a bartender.  As for the  severs, the girls who used to be there were sweet and helpful, now I feel like I'm not cool enough to hang out there, which maybe if they could at least get my order right and on time I could forgive.  After waiting almost 20 minutes for our salads mine had olives in when specifically asked 3 times to be sure it does not.  We used to be regulars, but not anymore.", "author": "Kris p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-02", "description": "First time diner at building.  Had a cheeseburger and fries.  Enjoyed both a lot!  Really good ingredients.  Brought home a chicken sandwich for my wife (in their nifty \"green\" cardboard take-out container).  She likes it!  Tastes nice and fresh, perfectly cooked; high quality ciabata bread;  good combination of flavors - peppers, balsamic, a touch of pesto.  Price is where it should be.  The design of the space is interesting, fun, comfortable.  The staff were very nice, appealing, competent.  This is a solid addition to the neighborhood.  I was looking forward to giving my little review the title \"Building in the neighborhood,by the neighborhood, for the neighborhood,\"  but, sadly, i guess i don't get to give it a title.", "author": "patrick d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-11", "description": "I went to Building on Bond for this first time this morning for a quick meeting and I think I've found a new coffee shop.  The atmosphere is super laid back, and on a Wednesday morning the place was pleasantly busy with patrons doing work on their laptops, holding mid-morning meetings or just kicking back with a book, a snack and some tea.  The coffee is tasty and will appeal to most palates (not too weak, not too strong) and sets you pleasantly buzzing without setting you into a caffeine-induced anxiety attack (coughstarbuckscough).  Although I didn't sample the breakfast pastries, they looked VERY tasty ... nice and fresh (note to self: must go back soon for pain au chocolate).  The lunch and cocktail menus also looked interesting, but again it was too early for sampling those items.  However I was so pleased with the friendly staff, lovely setting and delicious coffee that I wil definitely go back to broaden my Building on Bond palate.", "author": "Linnea N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-07", "description": "Bad service from a rude waitress made our Sunday brunch a crappy experience. The waitress in the back room around 11:30 this past Sunday clearly did not want to be at work. She was cold and not interested in serving us. We asked to have greens instead of home fries with our omelettes and she paused, gave us an annoyed look and said\" \"only if our cook isn't slammed, If he doesn't have time, you'll have to have home fries\". Her reply was the beginning of our crappy meal. When she brought our food MUCH later, she brought us, and I kid you not, what would have to be 3 tablespoon of lettuce w/ no dressing! When I asked her for dressing she said \"what do you want, oil and vinegar\"? upon which I responded \"YES\" almost at the top of my lungs. She returned with a cruet of vinegar and when I poured it on my greens a slimy string of what we called \"vinegar snot\" hung out over my greens! My friend then lost her appetite and never finished her meal. When I called our lovely waitresses attention to this matter she laughed and said she's be right back. Silly us assumed she would return with a new teeny weeny salad dressed properly this time or at least accompanied by FRESH vinegar, but she slammed down a tiny bowl (keep in mind this was 2 people asking for flavor on their salad) of white balsamic, no oil, no new salad, no apology. At that point I told her that I wasn't eating the salad the nasty vinegar had fallen on and that we would like our check. NEVER AGAIN! They've got to get rid of that girl. Management, if you are reading this: she's the brunette!", "author": "Jason G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-02-01", "description": "I had high hopes for this place. I really like the guy who owns this place  he's really nice, but I think he took great consideration in the architecture but not the food. The place is lovely, the wait staff is pretty nice, some of the bartenders not so much. I had a seltzer with cranberry juice and it was flat, how can you possibly mess that up, and my friends had skunky beer. I came back again with friends again when the food had been added to the menu for at least a month and half. I was really happy to order the pistachio chicken it sounded delicious, unfortunately it was greasy and tasteless, the only part of the entree that was good was the broccoli. My friend order a simple salad and it obviously had be sitting in dressing for a least a day, it was all wilted and really wet. The music is a totally decent volume for conversation but the music itself is pretty bad. 90's music sucked in the 90's and it's still bad. I'm so disappointed in this place it was going to be my regular hangout, but I hope he has a thriving business regardless because he's a nice guy and we don't need another empty storefront in the neighborhood.", "author": "youwill never know m."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}