{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-24", "description": "OK--they got  a new chef, and the food is now really good.   The Cobb Salad and the slinky fries are gone (there's a new version of the Cobb salad... pretty good but not as great as the other one) \n\nGood news is, everything else is now great (except the coffee...still that awful Starbucksy taste... don't order it if you like plain black coffee...go to the deli on the corner!).\n\nSalmon with a wonderful sauce and grilled scallions.  Nicely browned Brussels sprouts.  Great hamburgers and steak.", "author": "Toni S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-15", "description": "We dedicated our Sunday to Brooklyn and after a walk across the Brooklyn Bridge we made it to Boerum Hill and came across this gem.  After all the shops on Atlantic Ave we needed a brunch with brunch-appropriate beverages (-: - a very spicy Bloody Mary and a Pims Cup! The food was really good as well. You usual brunch choices - omlettes, poached eggs....-  and the regular menu with a burger with chorizo and other delicious treats. I had the very tasty pork hash eggs benedict.... \nThe place has nice outdoor seating on the sidewalk and cool interior decor with a big communal table in the front.  Bond Street is a nice quiet, residential neighborhood so enjoying a meal or tasty cocktail outside is not a bad day to spend a weekend morning....", "author": "Eva G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-02", "description": "I had a fantastic brunch here yesterday, only a few downfalls.  One that lack of \n\nsignage on the door/windows, we walked pass it twice! Two the overcooked food, \n\nmy Pork Hash Eggs Benedict, came with very over pouched eggs. But the rest of the \n\nmeal (the pulled pork/breakfast potatoes) were still a hit! Three, the tables are way \n\nto close together, (which is a good thing if the people seating near you are chill, but \n\nwe sat near a couple who picked eye boggers off each other for a good half an \n\nhour.) \n\nOn the upside, the waitresses are so sweet. Most of the reviews hate on them :(\n\nit was crazy busy and they were down a hostess, but they rallied and were super \n\npolite. My friend got the BoB Buger, and called it the best burger she had ever had in \n\nher life! \"The Onions are soaked in lime!!!!\" The place is really cute, tons of nooks \n\nand crannies of interesting things to look at, def worth a visit!!!", "author": "Kimberly F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-17", "description": "3.5\n\nMore of a restaurant than a coffee shop.  In that they have waiters, meals, etc.  Went there to study - my bad!  Thought it would be a better version of a Starbucks.\n\nCoffee was decent, almond croissant was, they over-used \"meh\".\n\nPlus .5 of a star for having a water bottle on the table.  I drink a lot of water and hate asking for refills!\n\nIf I were to be back in this neighborhood I would rather walk the extra blocks and go to the Chocolate Room (or whatever it's called) on Smith Street.", "author": "Deborah N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-09", "description": "BoB is one of my favorite local hangouts.  It's very low-key but always fun and full of just the right amount of people.  The service is usually pretty good, the food is also good, but not great (I keep wanting it to be much better).  I gave four stars because of atmosphere and overall concept.  \n\nThe morning scene is also cool during the week if you work from home.  I pop in there from time to time for coffee.  Service is usually pretty fast.", "author": "Harry H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-29", "description": "The\nDecor\nAnd menu\nIs well suited\nFor brunches of all seasons and sizes.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-03", "description": "If you're here for a lengthy drink during the week, as many were with laptops and books, BoB is a great place to be. Worthy of 5 stars even. Hell, even the decor is above 5 stars....well, maybe 4 considering i spotted two ways outsiders can see into the bathroom. But this place for brunch left us pretty disappointed despite the charming host, incredible atmosphere and attentive waitress. \n\nFirst, their \"home fries\" were just dull, soggy French fries tossed in some oil and flavoring--my fries were the \"naked\" version of their home fries. bad form. I got the BoB burger, which seemed great. But, it came with the lamest pretzel roll I've ever had, maybe it wasn't even a pretzel roll? It didn't resemble any I've ever seen before. And for the inclusion of chorizo, I thought this burger fell flat on flavor big time. The burger was too firm and paired with its stiff bun, the two flavor-free essentials for a burger did not compliment each other in the slightest. Not even the scant amount of lime-marinated onions gave this burger any relief from the dryness or the lack of flavor, I was pretty let down by that dish. My GF got the scramble, which was just OK (\"unexciting\" was the word she used) and paired with the poor excuse of home fries as listed above. \n\nOur experience was made a bit more unappealing by 3 people next to us--maybe the owners--ordering, critiquing \u0026 applauding several dishes while we ate alongside them with half-eaten plates \u0026 looks of dissatisfaction. Obviously I don't expect to order everything off the menu, but the way one of the men was talking to his chefs seemed unnecessarily condescending and on display. It was very off putting, especially after our lackluster lunch. \n\nI might be back to try their well-designed cocktail menu....we'll see.", "author": "J. L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-13", "description": "Throughout high school, college, and law school, I was in the service industry. I waited tables for 10 plus years in total. As such, I have the utmost respect for people in the service industry and am typically extremely forgiving of people who are in the industry. With that being said, tonight I brought an out of town friend for her birthday to Building on Bond because I live a couple of blocks away and didn't want to face the cold walking any further. I never had dinner there and had high hopes for a memorable birthday. Instead, I was greatly disappointed in the service I received. So much so, that this is the first negative review I have ever written. It started when our server took 20 minutes to take our food/drink order. Then, our food was brought out prior to receiving our appetizer. When we called the waitress over to tell her we never received our appetizer, her response was \"I will look into it.\" She never came back and never inquired as to how our food was. To order a second glass of wine, we had to flag her down like a Manhattan taxi.  We didn't receive a bottle of still water until we received our check and l when we received the check, it was handed to us by our waitress without an apology for the appetizer issue, a question as to how our dinner was, or a thank you for our patronage. I have to say I am highly dissatisfied with the service I received and sadly will not be returning despite how close I live.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-12", "description": "First off, I have to admit I've never actually eaten here. The lady and I walked in, then walked right back out about 3 minutes later.\nThe place itself was actually quite cute. The crowd, not so much. We found ourselves drowning in a sea of annoyingly high-pitched lady laughs, boring blonde hair and over-manicured eyebrows. Seriously. I haven't been in such an un-diverse (is that a word?) environment since the last time I was in Texas.\nMaybe we caught it on a particularly obnoxious day, and I'll definitely give it a shot some time later and re-review. Hopefully the next time around won't feel so much like a suburban/yuppie PTA event.", "author": "El B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-14", "description": "Fantastic staff, very friendly and accommodating. Food was delicious; I devoured an aged beef burger and fries. Nice beers on tap. Coffee could be stronger. Great atmosphere, and like most places so love, has various seating types (bar, booth, bench, bistro, table...) will be back!", "author": "Melvin B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-19", "description": "We sat down outside because it was a nice night and we wanted to try a neighborhood joint. Eventually the waitress came over, poured water without saying a word, then angrily announced the specials without looking at us or greeting us first. Then walked off. We sat there for a few more minutes, puzzling over what to do, and then decided to leave. Such a bad vibe, and pretty high prices to be treating your diners with weird attitude. So we left and got sandwiches at Boomwich on Atlantic, where the owner was super friendly. Won't go back.", "author": "J V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-26", "description": "Had both brunch and dinner here, two very different experiences.  The food at brunch was very good, as well as the coffee and the Bloody Marys.  The waitress was cold at first but then warmed up, there seemed to be a bit of confusion on who was waiting tables outside.  \n    Last night  I had dinner with my girlfriend and a friend, we showed up at 10:40 not realizing the kitchen was closing at 11 rather then midnight like we thought.  So it was understandable that the waiter was rushing us to get our order in, but that doesn't mean our food should be subpar.  The chicken Pailard both at brunch and dinner was consistently good, but the NY Strip Steak I ordered medium felt like I was eating shoe leather.  I've ordered better steak at a diner at 3 in the morning.  I'm thinking the cook leaned on it with a cast iron pan to rush the order.  The Linguini my girlfriend ordered was very bland.  The wait staff never once came over and asked us how everything was.  I had to get up, go to the bar and ask the bartender for steak sauce of which they had none.  The waiter finally came over with some bbq sauce after I told him I needed anything to help drown out the dryness of my steak, he said nothing to that.  Why keep the kitchen open until 11 if you're basically gonna quit by 10:30?  My Old Fashioned drink wasn't made right, no cherry and they didn't muddle an orange slice as well, but this may be the way they make it there so I'm not gonna sweat it too much.  This place needs a floor manager to keep it all together, both times it seemed like the wait staff was making it all up as they went.  The one person that looked any sort managerial was on her cell phone the entire 40 minutes we were there.", "author": "J L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-14", "description": "I JUST LOVE THIS PLACE.\nFoods are very unique and yummy.\nNice serving staff, location, plenty of outside table, everything perfect.\nOnce we tried their foods, we just keep going to the BOB.", "author": "Jason H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "I only tried their veggie burger here, but it was probably the best veggie burger I've ever had. And I try to stay vegetarian most of my days... Prices are decent too. My waitress was a little slow but the guy who is normally there (Lenny) knows his shit and he's funny too!", "author": "Lee R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-15", "description": "Brunch at BoB presents a nice variety of familiar and distinctive entrees that are well prepared and neither too large nor skimpy. The huevos rancheros while light on the texmex ingredients comes together nicely and comes with a generous full quarter avocado. The cocktails are generous and well flavored, and getting three olives in my Bloody Maria is a sure way to please. The space is appealingly upcycled with good natural light and the outdoor seating a inviting.", "author": "Luke C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-27", "description": "Can we talk about the fingerling potatoes?  The new menu has ditched the formerly fabulous fries with the extraordinarily fabulous sliced, herbed yellow fingerlings.  I don't care what the entrée is, gimme those potatoes.  I usually order the Cobb salad ( which does NOT come with potatoes)   The new Cobb is more consistent and appealing than the old one, (which I liked)..   Also, as a rule, I eat outside and think the service staff is excellent under very difficult conditions.  If you walk by slowly, you can choose your meal by looking at what the outside diners are enjoying.  A great gathering place for Boreum Hill locals and  house-hunting European tourists.", "author": "Douglas G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-18", "description": "I would give Building on Bond two stars if it just came through once in a while. Unfortuntely, this place is a complete disappointment!  I have been here many times with my son and his family - they seem to like it - I just can't figure out why.  The food is so boring and poorly presented it boggles the mind.  It doesn't take a lot of skill to make a hamburger or a grilled chicken breast, but some how they never get it right.   Brooklyn has become so damn hip it's scary!!!  I grew up in Brooklyn when \"Brooklyn was the World\" and it was!!!  Places like this would have been laughed off the block.\nLook, I am not just railing against this joint...it's the whole Brooklyn \"thing\".  The Brooklyn Dodgers are gone - things will never be the same and this place needs to get it's act together!", "author": "Ruth M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-07", "description": "B.O.B. Is nothing special really. It's a cool space and the food is alright. My three stars comes more from the let down when I realized that the menu didn't align with the cool atmosphere. In a city like NY there are so many interesting restaurants that it's almost crazy to spend your time and money on a mediocre one. I'm not saying that I won't go back, just that I wont choose to go back.", "author": "Jessica L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-05", "description": "Based on having eaten dinner here twice I will give Building on Bond an average rating for food but below average for service.  \n\nI've eaten dinner at Building on Bond twice in the past three weeks, and a few times prior have had coffee and danishes in the morning.  The first time  I had dinner here with a group of friends and everything was fine, nothing to complain about, the dinner entree was fresh and tasty and the service up to par.  \n\nThe restaurant itself is appealing because there is something for everyone on the menu and the place itself is cozy and family-friendly.  There is a cafe, a bar and a restaurant.   If I were to compare it to anything I would say it is like a diner but on a bit of a higher notch in terms of food choices and quality. \n\n2nd Dinner Experience: \n\nSERVICE:\nI went back given the positive experience the first time but came away disappointed.  The waitstaff was disorganized and barely acknowledged me as I waited for about 5 minutes for seating.   Although the restaurant was busy there was an ample supply of empty tables and I was the only one waiting to be seated.  I ended up seating myself, which is fine but after waiting for about 15 minutes I had to go to the waitstaff station myself to ask for basic items such as a menu, water.  They seemed distracted and didn't even give me the time of day.  So again I wait a ridiculous amount of time for someone to take my order and when no one came to my table I again got up and asked for my order to be taken (all the while thinking to myself should I just walk out or stick it out given that I've invested about half hour already).\n\nFOOD:\nFinally the food arrives, hurrah!  I ordered their omelette and everything about it was fine....EXCEPT...that it wasn't thoroughly cooked inside.  I ate the parts I could as I was hungry but left behind half of it because just the thought of eating uncooked eggs from a restaurant  made me queasy.  To the waiter's credit he was extremely apologetic and didn't give attitude and even and insisted that I won't be billed but since I had eaten half of it I insisted that I pay and we came to a compromise where I received their wonderful warm apple cobbler on the house.  \n\nSo I came away with a mixed reaction and am on the fence on whether I will eat here again.  I'm leaning toward yes since my first dinner experience was fine. They definitely, without a doubt, need to improve the waitstaff, and given the disorganization I experienced it appears that they could use a floor manager to coordinate all the pieces.  I do like the idea of this restaurant and the location is lovely and convenient.  Now that the warm weather is here it is also enjoyable to order a cup of coffee here in the mornings and sit in their outside sidewalk table area.", "author": "Adele C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "One of my favorite spots in Brooklyn because of the food- the pulled pork on a pretzel bun is amazing, and the Bond St Breakfast Sandwich is perfect for brunch.\n\nService is the only thing that drags down my rating.  Unless you get the skinny waiter with the MTA sweater, the service kind of blows.  One waiter a few weeks ago was super rude and made us feel like we were imposing on him for wanting to wait for a table.  It was Twilight Zoney.  \n\nOh, and Trivia Night there is annoying as hell, unless you like to hear a lady with an irritating voice shouting questions to a room full of people who don't seem interested.", "author": "Kate K."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}