{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-22", "description": "Yes, I remember the bodega that was here,.. oh so many years ago.\nGentrification,.. whatcha gonna do?\nMy first visit was 3 weeks ago. The place looked inviting and warm. I asked if they were serving brunch - a positive answer and a sunny window seat,.. I thought I was on my way to a much needed relaxing day,.. I was also famished. \nI waited about 5 minutes for a menu,.. after another 5 minutes - I asked the barista/bartender if I could order. He called the server. It took a few more minutes. After finally ordering, I waited 25 minutes before I spoke again. *I'd normally leave, but I Really wanted to give this place a chance* The barista spoke to the server,.. who came to me after a few,.. and apologized. She forgot to place my order! \nAargh! I promised myself not to lose my temper,..  Anyhow, when I finally got the order,... it was pretty good. I had the Ploughmans cheeseplate. A bit skimpy (sliced olives, 2 slices of pate, 6 sm.slices of cheese, 2 slices of bread, Branstons pickles, 2 slices of apple) but nevertheless - good! \nGood enough to return. \nI just make sure Ezra, the barista/bartender is there. \nThank you for making my return visits ~ positive experiences Ezra!  8)", "author": "VioletL P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-07", "description": "This place is great. Simple food done very well, and a charming and helpful wait staff. The more you look around the room, the more funny little details you see. Do yourself a favor and drop by, and try the BOB burger. It has chorizo in it. Not spicy, but just enough for flavor.", "author": "David C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-21", "description": "staff is nice, except i dont like being in there when the manager is around. (his eyes tend to gravitate towards breasts)   Foods fine, lemonades good and they make it by hand.  Tall red headed waitress is super helpful too if youre not sure what to order", "author": "Dowey L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-29", "description": "Absolutely fantastic. I frequent here and it never fails to satisfy my taste buds. The only slight complaint is that there's one server who's too nice it feels like he's hiding something.", "author": "Scarlett L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-30", "description": "was excited to find a new brunch spot on my return to brooklyn. such a funky spot. it is nice to have a place like this in the neighborhood that expands beyond smith st. \n\nthe style is like workshop, meets neighborhood hangout, meets middle school science class. \n\ngreat soundtrack. good service. and while i thought the decor was going to be the best part, food was surprisingly good too. \n\nFor all those who have gone at night, check out the brunch. I am going to go ahead and claim that BoB might be a new favorite.", "author": "Mackinnon W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-07", "description": "food is okay and the outside sitting is really nice.  the crowd is super annoying boerum hill media hipsters. this is another place if you LOVE SF then you'll love this place.  \n\nI'll still go here during the summer in the slow hours.  they really did a great job on the inside decor.  \n\nregular coffee and teas are good but espresso drinks are below average.", "author": "jason b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-28", "description": "like all the other reviewers said.... brunch is tasty. and cheap! if i lived nearby, i'd probably be here regularly. its location is nicely off the main streets but close enough to nice neighborhoods.", "author": "Sw w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-15", "description": "ooooh, how i wish i lived right around the corner from building on bond. they would never get me to leave. a perfect corner coffee shop/bar that just starting serving food, they have a tiny menu for now but by next week they should have an extended version. my endive salad was perfect, my mac and cheese was awesome with just the right amount of bread crumbs and both were under 10 bucks. both the sangiovese and the sauvignon blanc were excellent as well and they make a supremely tasty vodka and cranberry juice with their special cranberry infusion. the staff was swift, attentive, friendly and welcoming. i can't wait to try the rest of the menu.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-11", "description": "Seriously? American cheese on white bread? I'm definitely not shelling out $10 for that again.", "author": "Anna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-09", "description": "This place is great. It's the type of neighborhood bar I expected all over the place when I moved to Brooklyn. Good food, atmosphere, and everyone seems to know each other. I only wish I ended up living closer so this could be my neighborhood bar, but the cuban sandwich alone is worth the bike ride into Boerum Hill.", "author": "Joel W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-24", "description": "I want to love building on bond.  The space is great. the music is good, they have internet and are convenient in my neighborhood.  outdoor dining in good weather.  everything seems optimum for a perfect neighborhood spot.  including bar.  however.  the food is less than average.  eggs are fine to order, but just about everything else is sub par for what you expect..  I ordered a burger two weeks ago and it was so off that it tasted rotten.  the bloody mary's are watery. most of the food barring the eggs is just not inspired, interesting or even just.. good.  I want to choose BOB. but will go to Mile End unless there is a huge wait.  another note, this place is filled with strollers, not the best on a sunday morning.  please BOB get it together.", "author": "Lee T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-29", "description": "Cool place with a slightly industrial decor.  We went for brunch and had their version of eggs benedict which was very good.  My husband had a traditional egg breakfast with chorizo which was a nice variation.  The coffee was better than diner coffee.  The sandwiches that went by looked great; I'd definitely try one of them next time.", "author": "Sophia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-12", "description": "very cool, good music, very laid back and less than a block from my house! woohoo! you'll see me there, I'm the nerd with a book/computer. wait that's most people there...", "author": "Adam W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-28", "description": "Just the around-the-corner neighborhood coffee bar/bar/restaurant I've been waiting for! Really unique design, excellent tunes, good neighborhood vibe, coffee and pastries are great. Can't wait to try to food!", "author": "A C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-15", "description": "I absolutely love this bar!! I was patiently waiting for this place to open and thankfully, it was well worth it. I heard about the owners previous projects in Manhattan (all hot spots) so I was very anxious and excited to see what they would come up with. Now I just feel very lucky that my hood, Boerum Hill, was the chosen spot for their newest venture! Building on Bond rocks. It has so much character. It's a very comfortable, inviting, and cool spot. Add in the delicious drinks, laid back crowd, great music and I was instantly sold. All that's really missing from this place is some good food but they told me the kitchen is in the works so I am keeping my eyes out (and mouth open). Definitely check it out....", "author": "Lauren K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-03", "description": "5 Stars for Decor but 3 Stars back for taking vegetarians back to the 1970s in dining out.  The only vegetarian item I could find on the menu at lunchtime was a \"veggie burger\" which came to my table in the form of bulgar and broccoli \"mush\" loosely shaped as burger patty.  These are chefs who clearly think vegetarians are people who boil a stalk of broccoli and serve it up on a plate for dinner.  The burger mush had absolutely no taste or texture to it - they hadn't even attempted to season it.  To add insult to injury, the bun on which the patty mush was served was brushed in a thick egg wash, which while achieving that desired shiny look, only further combined with the grainy mush to taste like somethin' you forgot to bake.  This option for $9 - appropriately served not with a green salad on the side but in its place a single piece.. of you guessed it iceberg lettuce.", "author": "marie s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-07", "description": "So convenient. Fantastic design. Pork sandwich on pretzel bread is excellent, but otherwise food isn't much of a draw. The service is reliably frustrating--the wait staff tends to be good natured, but either they're overly familiar, practically pulling up a stool, or so spacey as to forget basics, like the silverware or the drinks. They do always remember to upsell, though. That said, the place has a nice feel and is incredibly well located and I just keep my expectations in check about getting a fork the first time I ask for it.", "author": "E B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-04", "description": "Incredible Decor, lunch service both times I went was good.  At lunch time the place is filled w/ people working from 'home' on their MacBooks.  Both times there were at least a dozen people all on Macbooks, no Dell. Some one can seriously open an apple store across the street and be set. So it was a bit hard to have a place to sit.  Food was great, only one option off the entrees for veggies, I had the veggie burger.  Carnivores at my table were happy also.  Only con I had was the price was a bit high, $9 for a burger, but the place and service made it worth it.", "author": "Louis M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-10-27", "description": "My favorite place in Brooklyn,  you can spend all day there eating, drinking, coffee, on your laptop, phone whatever and be comfortable.  I also want more and more people to know about the comedy show i produce there once a month, usually on the first thursday of every month called, \"A Very Good Comedy Show\".  The show has been super packed every time and i have brought down only the best to perform on it.  So far we have had: Hannibal Burress, Arj Barker, Rob Cantrell, Magnus Betner (sweden), Baron Vaughn, Eric Andre, Mark Simmons, Cory Fernandez, Ali Wong, Reese Waters, Donnell Rawlings, Matt Mcarthey and many more come bless the night.  Each show we also screen a Ditch comedy short film that we premiere for the first time.  You can find all our films at www.youtube.com/ditchfilms.  Hope to see you out on a thursday sometime, just call BOB and inquire about when the next show is.  People seem to really enjoy this show because it is FREE and they can eat, drink and be merry within a comfortable, intimate comedy experience that is VERY GOOD.", "author": "Yannis P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-11", "description": "Went here for brunch on Sunday, and wish I could give it 3.5 stars. The decor/layout is funky and awesome, the food was delicious. But the service sucked. It took far too long for our order to be taken, and then we needed to ask for everything (spoons? Water?). This seemed to be a systemic issue though, and not the fault of our very nice waitress. I'd try it again another time if the service improved though.", "author": "Chana E."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}