{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-16", "description": "Reliably great. Everything on the menu is always fresh and tasty; friendly staff; great beer and cocktail options. Also the veggie burger is one of the best in Brooklyn!", "author": "Sara M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-15", "description": "Not a fan... this is maybe the third time I've gone here. Never had a great experience but we were close so We thought to give it another try Sunday. We were seated given a bottle of water no glasses. Waited a full 15 minutes and not a single waiter or staff approach us. The place wasn't full there were still tables empty. We just got up and left.  Once again I got the feeling that this place was more like a club of if your in your in. \n\nWent back to Bijans had a wonderful brunch....", "author": "Erelichada S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-21", "description": "Skip the egg sandwich - there are probably a dozen bodegas within a few block radius that will make it better and (significantly) cheaper.\n\nService was a bit underwhelming - water glasses never refilled, one person's entree (a salad) arrived 10-15 minutes after the rest of the group's, forgotten drink order. They were quick to seat our group of 5 and to take our orders, however (peak weekend brunch hour, no reservation).\n\nSolid Guinness pour.", "author": "Stephanie H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-10", "description": "People really like Building on Bond. I'll start off by saying it isn't bad. The service is usually great, it's a nice space and the food seems to get people to come in. However, when I go I always find that something was disappointing. I met my friend there who'd been waiting for 20 minutes already. Another thirty went by before he received his SALAD. We had a similar experience trying to get a cup of coffee. To me their menu doesn't have anything that particularly stands out though their cheesy shells, brussel sprouts and endive salad are good. With each good thing I order there seems to be something that is far below par. If I'm going to pay $14 for a veggie burger I'd rather go to bear burger, frankly what you get here isn't worth the money. Last time I went we had fantastic service, a very nice wine and the Korean chicken wings which were pretty good. But the shishito peppers were soggy, flavorless and incredibly oily. For me the good stuff that the restaurant certainly has to offer doesn't outweigh the fact that the hype it seems to get isn't quite deserved.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-14", "description": "I want to like this place because it's so cute, the staff is so nice and it's so convenient, but it's just not good!  My friend had a huge bug in her veggies the first time I went.  My eggs were served nearly raw last time I went.  This time my friend and I ordered the same salad and they arrived at our table looking completely different from one another.  I just don't get it?!", "author": "Gabriella K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "This place is perfect for a lowkey and casual dinner experience. It's warm and cozy, and has a decent amount of space.\n\nWe came here on a Tuesday night - did not know they had 8pm trivia, so if that's your jam, now you know. \n\nThe Dark \u0026 Stormy was excellent - a little sweet, a little tart, lots of ginger beer. The prime burger was basically exactly what I needed after a long day, and it comes with those fat hand-cut fries. \n\nService is friendly and relatively quick, and prices are for sure reasonable.", "author": "Kristen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-06", "description": "Warm and cozy corner shop. Interesting decor old school hardware meets architecture studio. Big reasonably priced sandwiches and salads. Had the Old Bay chicken sandwich/ chicken Cobb sandwich/ and brussel sprouts ( definitely a must ) \nKitschy beer delivery ( from the ceiling) and with this years bkbeer book had to give it a try. \nOn the repeater list.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-06", "description": "Came by with my son for lunch. I met up with him after his bass lesson and relied on yelp to help me pick a place since I was unfamiliar with the area.\nBuilding On Bond and yelp did not disappoint. \nHaving just come from the dentist I was limited to soup and a salad, but it was super yummy and the vibe was so retro. I cannot wait to return with friends to experience this unique little corner spot, the neighborhood and explore the menu a lot further.\n(Btw... just because I had dental work doesn't mean I couldn't have a cocktail to take the edge off of having to go to one and at 4 pm they serve them just right!)", "author": "Denise C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-19", "description": "I really wished this place was good since I live less than a block away. But both times I've gone, I've been massively underwhelmed. Nothing has been wrong with the service (or that I've experienced), but the food is simply not good. Both times I ordered a burger. Simple, right? First time I ordered it, I asked for it medium. However, it came out well done and very dry, with wilted, old lettuce on top. Second time I ordered the burger, I again asked for medium. Came out rare. Won't be going back a third time.", "author": "Jessica C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-02", "description": "Solid place. Wait staff is quite nice, and are patient if they sense your table wants to take your time. Drinks all around are tasty and fresh, along with breakfast, brunch, lunch, and dinner. The menu mainstays are consistently on point, and although it gets crowded, it never really feels jammed up. Good spot.", "author": "J D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-27", "description": "My husband and I were biking around running errands and going to a gym class on Saturday and decided we both needed food. We happened upon Building on Bond and I was really excited because I've been wanting to try this place for a while. We came around 12:30PM and got really lucky and snagged a table for 2 outside on the sidewalk. It was a gorgeous day and we were really jazzed that we got this table. \n\nI got the heuvos rancheros, which is pretty much my brunch go to and my husband got the eggs Benedict. Both were very delicious. I was so excited that my heuvos came with fries!! These fries were absolutely amazing. The heuvos were good but could have been spiced a little bit more. There weren't a ton of flavors like I like with my Mexican food. My husband's eggs Benedict were equally good but again, the hollandaise could have had a bit more flavor. Those fries though.....man. Delicious.\n\nThe server was attentive even though it was pretty full. I loved the old school Brooklyn feel you get when you're inside. The bathrooms had wallpaper straight up from the 1950s, it was amazing. This is a great brunch choice in the area!", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-08", "description": "Great food \u0026 service! Stopped by for an early lunch and I was pleasantly surprised with the outside seating area and menu! I had the Chicken Cobb sandwich and my sister had the vegetarian burger! Both were delicious!", "author": "Susana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-17", "description": "We loved the NY cider available. A raw bar is always appreciated and the prices are great. Our only complaint is that it's not closer to home, and the chocolate chip cookie should be bigger.", "author": "Dylan I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-04", "description": "Great experience, food was great. \nMy girlfriend and I got the buffalo shrimp and veggie burger ... delicious", "author": "Sarahjean L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-26", "description": "Building On Bond has since improved it menu immensely. They got rid of a tired, jaded chef, and have since re-vamped their menu. Their oysters were good, the chef's salad was equally good, and they didn't ditch the veggie, portabello rueben sandwich, which was probably the only good thing on the previous menu. It's still dog-friendly, the wait staff is great (we still love our Irish barman who has been promoted to manager), and it's an all-around good hang-out place for the neighborhood. Yay, fan!", "author": "Niall B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Nice, low-key neighborhood restaurant and bar with great food and good drink selection. It is my favorite spot to come back to for dinner in the Boerum Hill area.", "author": "Zsuzsa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-20", "description": "This place feels like a trendy yet cozy softly lit living room. The Mac and Cheese is unparalleled. You can customize it with amazing toppings like wild mushrooms and seared spinach.", "author": "Ab A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-29", "description": "Came here for a low key evening. Had the trout pate which was fresh and seasoned.  It comes with crusty toast and a delicious little side salad.  I had the pimm's cup which is great- solid sweet and tasty.  My husband had the house wine which is the montepuciano. Building on Bond is that neighborhood spot where you can have a low key night with Good Food and a cozy atmosphere.", "author": "Marjorie W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-12", "description": "This place has seriously gone downhill. We used to love this place for brunch but the past few times the service has been slow, and the servers have been very rude. Today it started out with a rude hostess, followed by a rude server. Our food took about 40 minutes to come and they didn't even acknowledge we've been waiting, nor came over once to Check in and let us know the status of the food. When we got the food it was really poorly made, with poor quality food- was not worth the wait. It's like they are thinking they will be this busy without trying- not for long! I'm very disappointed. I'll let all my friends know, time for a new brunch spot.\n\nUPDATE: The owner wrote to me and and said this is unlike them. So me, My husband, and two sleeping 8 month olds decided to give it another shot. We walked up and were surprised to see two tables open and no waiting list on a Friday night. We couldn't wait anyway because as parents you had to be in and out of restaurants as fast as possible. The hostess Abby said she can't sit us because they are 4 tops and plus we have a stroller. It'll be 25-30 minutes. I understand you want to wait for 4 people to come but while you wait you could have had us sit there and be done by the time any 4 too will come. And even if it's a policy she didn't even try to brain storm a solution, understanding our situation. Like say, maybe I'll ask my manager, or let me try to pull the tables apart. She acted like she could care less about or business, and she didn't care about our business what so ever. Establishments like that should be ashamed. Now I am truly over buildings on bond and I'll continue to spread the word which isn't hard as I'm an elementary school teacher down the road.", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-21", "description": "Great drinks, less than poor experience from our waiter. \n\nMy friends and I stopped by this spot after watching a movie at the Alamo. The hostess kindly sat us after we asked if it was okay that we order drinks, even though we were told \"yes\", the service reflected otherwise. Unnecessary amount of times checking in and asking if we wanted more, which came off as rushing us out of there, as he was visibly agitated and annoyed. We said we were fine at the moment and asked if they were closing soon, he looked at his watch and said \"not necessarily\". In the end, after we asked to split the bill on 3 cards, 40, 40, 20%, he told us to just write it down. I've worked in the service industry so I understand how annoying this can be. But with literally no other customers around and serving the condescending attitude already, come on bro, figure it out. And then the nerve to tell us we were all in our heads about it all. Oof. We were having a great night. Thanks for killing it, Jake.", "author": "Whitney R."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}