{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-30", "description": "Excellent brunch choice, primarily in winter.\n\nWhy would a place be a better brunch spot in the winter than in the summer? It's not for lack of outdoor seating -- there's room to sit outside in the summer. It's not for food choices, there's not a ton of different between seasons. And the people working there aren't nicer in the summer* than around the time the groundhog goes looking for his shadow.**\n\nIt's better in the winter primarily, and mainly, because fewer people are in line to get in. At a place with food this good, even though it's sneaky long there's bound to be a line to get in once the weather turns nice.\n\nBest things about brunch: get the pancakes. We had the chocolate chip ones, which were stunningly delicious. I don't know what they did to get them so rich without drying them out, but it's an impressive feat and one you should taste in person.\n\nThe fries are also delicious. And though we didn't love the 'thanksgiving in a sandwich' concept of the turkey***, the fries definitely made up for it.\n\nAnd they have refills on Diet Coke (and for $2.75 a glass you should) and won't kick me out as soon as the last bite on my plate is gone? Then this is a great brunch spot that I'm sure is soon going to be too crowded for me to go to again.\n\n* - Well, maybe they are. But it would mean sunshine bursting from their ass cracks if they were. They're really nice in the winter.\n\n** - If that furry little bastard sees his shadow this year, I'll slit his throat.\n\n*** - Needed gravy.", "author": "Danny P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-06", "description": "We had brunch here and enjoyed the in letters and salads. Service was warm, friendly and helpful. We sat indoors but the tables outside were lovely. The prices are reasonable and the drinks and coffee were good. We would definitely come back for another meal at Building on Bond.", "author": "Peter R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-06", "description": "I thought I had discovered all the great brunch places in the neighborhood by now but turns out I've been missing out. Building on Bond is one of my new favorite brunch spots. No crazy wait for a table at 11 in the morning, delicious egg dishes and decent prices. No need to pay $20 for an omelet, Building on Bond will give it to you for $8! And the place has awesome decor.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-17", "description": "Came here Saturday for brunch with the lady and friends.\n\nGetting in:\n- Walked up to the podium outside and asked for a table of 4 - seated immediately\n\nAtmosphere:\n- There is seating outside and inside with a bar up front\n- Casual vibe definitely good for small groups of friends\n- Not too loud, not to quiet \n- Has a rube goldberg machine type feel to it\n\nService:\n- I had some issues here\n- They forgot to bring out my meal (brought out everyone else's), took me 5 mins to track down the waiter and then 5 more minutes for the meal to come\n- Originally they did not compensate us at all for the issue - I spoke to the waiter about it and they took off the cost of one drink ($10) - they did the right thing, but shouldn't have had to ask\n- Waiter was friendly though\n\nFood:\n- Food was ok  - I had the beef hash, nothing to write home about\n- Friends had the Spanish frittata - again, nothing special\n- Over all I thought the sizes were on the small side\n\nDrinks:\n- They made a nice aperol spritz\n- Coffee was good\n\nOther:\n- Not sure I will come back here\n- Worth the try as I explore the area, but overall a disappointment\n- Maybe stop here for a drink, but not as a culinary destination", "author": "Matt B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-28", "description": "We were wandering around Downtown Brooklyn. We were hungry. We turned to Yelp for guidance, and Building on Bond came up with \"great for brunch.\" I disagree...maybe \"ok or pretty good depending on your standards and what you get...for brunch.\" We ate the food, but overall, it was forgettable. The restaurant has rustic charm, I guess. Very casual. \n\nI had an egg scramble, which is an egg scrambled with no spices, slightly overcooked, with huge mushroom and broccoli chunks which I personally would have seasoned and cooked differently, and a barely-there sliver of gruyere cheese (allegedly). It sounded much better on the menu than it tasted. Also, the homefries on the side looked like burnt french fries which had been soaked in water and reheated in the microwave (but not reheated long enough, with cold spots)...and also confusing...why is a soggy cold french fry dark brown? Maybe this is really how they were made. I ate them because I was really hungry, but the flashbacks haunt me a little.\n\nMy companions had blueberry pancakes. They had to ask for butter and syrup...each one had to ask for their own and they were single serving sizes....which was kind of weird. They did not seem that impressed with their pancakes.", "author": "Naima K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-14", "description": "It's a cute spot in a cute neighborhood with outdoor seating (one of the only real reasons to visit), serving up average American dishes.  I had the turkey sandwich (meh) with the fries (v. good). Not much else to it.", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-24", "description": "One of my favorite places in BK, mostly for the decor and ambience. Beer selection is consistently good, and the food is tasty and reasonable. Their coffee is very good (though a bit pricey for the straight drip). My favorite thing about their menu, though, is that they often have a good variety of vegetable sides that are lightly prepared and wholesome - too often places drench their vegetables in heavy sauces or overcook them, but BoB can make some amazing vegetables - they used to offer a meal of 3 veggie sides, which was basically my standby. Their menu rotates, so I have found that sometimes they have more bangin veggie offerings and sometimes less. On a good day, you can get an amazing fresh and healthy meal...on a bad day, their hamburger is still quite good.", "author": "Jeff L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-23", "description": "Most of the time in NY, if you ran into a place posing as a bar, a restaurant, and a café, you'd call that indecisive and assume that it's not good at any of these things. Think about that cool café you go to that suckers you in with its crappy sandwiches: this it NOT that place!\n\nWhat drew me into BoB the first time is the actual structure itself, which says, \"Come in--this is a cool place to hang out.\" There is a mix of table and counter seating, including outdoor tables when the weather is nice. The décor makes you feel like you're in a place that is cozy and cool but without any attitude. For example, they have these interesting desk-like tables with a roll of butcher paper built in. Though it serves a practical purpose (as tables are cleared, the dirtied layer of paper is torn away), it also has the feel of an architect's sketch pad. Quintessential Brooklyn.\n\nMore importantly, a couple of key standouts include the chorizo burger and the French fries. Even if you don't like spicy foods, don't let \"chorizo\" scare you off--it isn't that spicy, and it adds some good juicy fat content and a lot of flavor. Ironically, the more expensive aged-beef burger isn't that strong and tastes a bit bland.\n\nAlthough the side salad is a very solid option, the French fries are ace--just the right thickness, squared off (most likely hand-cut), salty but not too salty, expertly crisp, and a beautiful golden brown.\n\nThe Black Friday is also a nice sandwich, particularly with the use of cranberry walnut bread. The espresso is quite good as well.\n\nThe two times I have been here, there was only one server and one busboy working, and the place was pretty full, yet they were friendly and kept things under control. Service was definitely better than what I encountered around the corner at Ruccola. Price and quality better than say a General Greene.\n\nA minor point is that the music is pretty good (Pixies, New Order, but also some more recent stuff), yet right-volumed: loud enough that you enjoy it without having it overwhelm your experience. I will definitely be back.", "author": "Food Jerk X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-10", "description": "The place is mid-sized/small and quaint, so the atmosphere is nice and you can sit outside. The food was very good, I was honestly surprised. The servers seemed friendly. They had quite a few beers on tap.", "author": "Nick B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-23", "description": "For decor - they get five plus stars. A visual feast!\n\nToo bad the same can't be said for the food. The burger arrived without the pretzel roll (the reason I ordered it) without so much as an apology or explanation.  The roll it was on was huge, and the burger was minuscule. \n\nMy friend ordered the pulled pork sandwich. Again, on a ridiculously large (chiabata?) roll, and IF there were even 2 Tbs of pork, that would a generous overstatement. \n\nMy son, who has allergies, ordered a burger without the roll and without the fries. He loves fries, but he CAN NOT have them. He is six. He was very sad that we sent the burger they brought with a heaping side of fries back so that they could remove the fries. \n\nWe selected the restaurant during a rain storm, unwilling to venture further.  Perhaps we should have. \n\nThe waitress, seemed annoyed by us - and we had to get her attention repeatedly. \n\nSo wish the service and food matched the style and decor. \n\nOwner - I hope you read this and make some changes!!!", "author": "Elise J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-02", "description": "Stopped by for an early-ish brunch on a wickedly hot Sunday.  We were quickly shown a table in the waaaaay back where the AC was most definitely working.  Bless those souls who braved those cute outdoor tables in that heat!  Maybe next time...\n\nIced coffee was good and served in a nice big glass, which looked even bigger next to the shot glass of water you are given.  I polished off 6 shots of water so I don't remember the remainder of my meal.\n\nJust kidding.  I had the egg scramble minus the mushrooms.  It was simple and pretty good.  I really liked the potato hash on the side because it was made of cut up french fries.  It just made me smile and tempered my jealousy of the fries others were served with their breakfast sandies.  I also tasted the blueberry pancakes and they were good.  Nothing too remarkable, but tasty.  \n\nAll in all, an A-OK brunch spot that will surely be a part of the rotation going forward.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-22", "description": "Hands down my favorite and go to place in Brooklyn. Everything on the menu is delicious and they have a great selection of beers and cocktails. I used to live around the corner and go more frequently but since have moved to Manhattan, but I still make the trip regularly to get my BoB fix.  The best Cobb salad I've ever had and the thanksgiving sandwich is also really good. \nEasily one of the better restaurants in Boerum Hill.", "author": "Kristen B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-13", "description": "Building on Bond always puts me in a tough spot; I can never decide between the BBQ Pork Sandwich and the Black Friday Sandwich. I wish I could order half of each every time I went. The pretzel roll on the former is to die for, but I also just wish Thanksgiving could be year round, so I'm always a sucker for a Thanksgiving sandwich. The cocktails are also all pretty fabulous.\n\nThe interior is super styled and interesting, and getting seated at the giant filing cabinet in the back room is both fun and painful - fun because there are things in some of the small drawers and painful because leaning back against that isn't comfortable, so I felt like I was perching the whole time.", "author": "Peggy N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-04", "description": "Really nice layout. Loads of people working on their laptops and chilling out through the day.\nThe coffee is very good and the staff are friendly.", "author": "Kat C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-24", "description": "The new pizza specials have been great lately. They even went wild with a kimchee addition. Also, look for the clam chowder if they have it or the Moroccan soup (rare, but worth it) at lunch.", "author": "Shawn L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-02", "description": "I'm sure this is a perfectly serviceable neighborhood joint, and it looks like they're generous with providing seating and excellent background music for laptop workers, but it's not worth going out of your way for Building on Bond. WITH ONE IMPORTANT EXCEPTION: the slinky fries. The slinky fries are basically homemade potato chips, and they are deliciously oily and garlicky and salty and covered with shavings of parmesan cheese. Oh God. So good.\n\nThe space though? Fine. The beer on tap? Also fine. The burger? Better in theory than in action (chorizo? pretzel bun? how could it go wrong? and yet it does.).", "author": "Pamela B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-19", "description": "We were wandering around looking for a place to eat before a concert at BAM and found this place. We had a great experience. The food was really good and we loved the atmosphere. I usually have at least one bad comment but not tonight, The service was exceptional!", "author": "Elisabeth S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-29", "description": "Um, it was pretty good. I mean, in general - just average. I got the salmon. \n\nKinda pricey but what ISN'T these days (my dignity!)\n\nWhat I DO like about this place is two whole things: LiFE SIZED (ok WTF is that supposed to mean anyways) edit WALL SIZED, a 4 x 3 (ft not inches) LITE BRITE!!!!!!! YOU GUYS! dUDe. Do you remember that ish? \n\nThat AND Narragansett tall boys ($4). Not so bad... RHODE ISLAND RULEzzzz.", "author": "E W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-20", "description": "Barely acceptable food. I have been here several times because I live a block away, so this is not based on one bad visit. It is as if nobody is paying attention in the kitchen. Clever ideas but do they actually eat their own food? Example: in principle, adding pork to most anything improves it. But no, adding chorizo to their burger just makes it a dry-mouth experience. The chicken plate tastes like hospital food: dry, white meat chicken, peanut sauce that has absolutely no flavor, four neat little pieces of steamed broccoli, and a heap of pureed vegetables that reminds me of baby food. So bland, all of it. My otherwise good breakfast came with greasy, room temperature home fries that were made from hashed up yesterday's french fries. They didn't even heat them! Absolute garbage. \n\nThe coffee is delicious, the turkey sandwich is great. Aside from that, everything I have tried has disappointed me.", "author": "Keith K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-10", "description": "Loved the music - good old school stuff at a perfect volume for conversation. Food was good but a little hit and miss on the ratio of amount to price - hangar steak low ratio, meatball sandwich excellent value. Drinks were good. Service was a bit slow and I attentive. I'll give it another shot because I really liked the atmosphere", "author": "Lois G."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}