{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2008-08-20", "description": "I had the worst cup of dishwater coffee last weekend.  Not only was it burnt, there were grinds at the bottom of my cup, and it cost me 2.50 or so.\n\nI wish them well but they need to post a menu so I know how much things cost, and they need to improve their coffee.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-08", "description": "In the two times that my wife and I have went here for dinner we have had some of the worst service I've been exposed to in NYC in over four years. Last night (being the most recent experience) had us arriving there about 7:40pm and less than half of the tables were being occupied. Although we were seated right away, it took 15 minutes for a server to come and take a drink order. Please note: a table of three who came in 5 minutes after us were seated, greeted and had their drink order taken all before anyone even came to our table. When the server finally did come over we ordered drinks (iced-t and a glass of wine) which took another 10 minutes to arrive at the table. Finally after the server did another 6 passes by our table before she came to take our order. She was pleasant and during my ordering of the Chicken Cobb Sandwich I expressed that I did NOT want blue cheese on my sandwich. We then proceeded to go through a list of numerous options that I could have instead... mustard, mayo, etc. I agreed that I would do mustard. She then placed the order. The Brussel Sprout appetizer was extraordinary, both my wife and I enjoyed them. The appetizer to main course time line was fine. Although we had now been at the restaurant close to an hour. When the runner did bring the food my wife's burger was fine. She enjoyed it. Mine was missing the condiment that I asked for. The server stopped by before we even took a bite and asked if \"if everything was OK\". I'm not sure how we would have known at that point, but anyway... (in retrospect we should have just said goodbye because we didn't see her again till the bill came.). As I took a bite into my sandwich I noticed that the bread was burnt and also a pungent smell and very distinct taste that didn't agree with me. The bottom of the sandwich was slathered in blue cheese. I choked down half of the sandwich and left the second half. I had to flag down the runner for another iced-t because the server either just walked on by or stood at the bar and chatted with the other employees. After the runner cleared the plates we then sat there for another 27 minutes (yes, I timed it) with no offers of dessert or another drink. Then the server came by and asked if we wanted the bill. It was the fastest she moved all night! She came back with it immediately. Somehow my wife talked me into a 15% tip, to which I hope 14% went to the only useful employee... the runner. There are too many places here to go back to BoB...", "author": "Andrew A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-28", "description": "It's a cool place to hang out, and I do a lot of work here during the day, but as a place for dinner it's just not that good. I live around the corner and I rarely go. Nothing tastes good.", "author": "Ilana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-19", "description": "Really great place for a quick relaxing meal and a drink. I love that they're secluded from the hustle and bustle of Atlantic Ave.", "author": "K R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-31", "description": "I really love this place.  It has wonderful outdoor seating.  The food and drinks are great.  The service is super friendly.  I guess my only complaint is that it can be a very \"European\" experience in trying to flag your waiter down to get the check.  Other than that, it's perfect!  I'm a huge fan of their cobb salad and their chorizo burger. And their Arnold Palmer vodka drink is divine.", "author": "Victoria G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "I've had brunch and dinner here. The food was yummy. Drinks were large and in charge. The hosts and the outdoor wait staff were super friendly,  outgoing without being obtrusive, and very efficient, both times I've been there. On the other hand the younger guy serving coffee and tea behind the bar was curt and unhelpful, and didn't look anyone in the eyes. On the plus side, the coffee he served was tasty. Great place for brunch or lunch on a beautiful day. We sat outside both times, which was good because it got a bit stuffy inside, but I'm sure inside will be great in the winter. While it's still warm out, go for the Pimm's Cup.", "author": "Jacob R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-10-20", "description": "Good coffee, if you don't mind taking out a second mortgage. They can suck it as far as I'm concerned. There's a ton of places to get coffee that is just as good for a lot less money.", "author": "Graceann D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-11-08", "description": "We live very close to BoB and have gone there regularly for 3 years.  This is a neighborhood favorite despite the just-ok food because it was a welcome addition to the block and a warm and welcome place to get a coffee or a bite.  I am sad to say that something has gone horribly wrong with the addition of some new staffers.  They (especially the morning coffee crew) are short, rude, and just too cool to smile.  But the evening isn't much better.  They seem especially annoyed if you have a kid (no matter if the kid is on best behavior) so be warned you may (and again, it is 2 or 3 bad apples) get a sour face, poor service and attitude to accompany your meal.  And since the food isn't anything special, it's really not worth it.  Too bad really - seems BoB is tuning their back on the same families that made the place successful in the first place.", "author": "M P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-07", "description": "Watch this space. I took in Building on the evening of its first day. It'll operate from 7 AM as a coffee shop and a bar with separate dining room in the evenings. There is a definite seriousness to the trappings here: bold unfinished woodwork, nice touches throughout, gorgeous plate glass windows. It really sets a certain mood and is going to thrive in this hood, which has been biting its nails in anticipation for many months now. I had a cold Sierra and tried some Tuscan red, but pressing pause on the libations until they get their barsettled. As it stands, my neighbours and I are pretty, well, juiced, and the feeling was evident by the parade of well-wishers cycling through the joint that night. Lots of promise here. Given the provenance of the partners--this is the first place of their own, but they designed many Manhattan restaurants, like Schiller's--I'm expecting something of a cross between Applewood and Black Mountain Wine House. Dining commences Labour Day weekend.", "author": "Jeff M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-06-01", "description": "So...\nI had the pleasure of attending a two day Brooklyn birthday extravaganza and fortunately for all of us, this included brunch at BOB.\nIt was 11 am and I faced the classic brunch dilemma -- lunch or breakfast, sweet or savory.  The menu -- loaded with tempting items -- only increases my confusion.  Finally, I made up my mind -- an eggs benedict concoction that replaces the Canadian bacon with BBQ pulled pork.  Three words for you, folks:  Yum yum yum.  The potatoes were fluffy and the Hollandaise and BBQ flavors were a surprisingly satisfying combo.  Thank you, BOB, for introducing me to a new flavor world!\nI had a bite of my friend's banana chocolate pancakes.  If your sweet side wins out, this should be your order.  Some restaurants deceptively just pass off this menu item as a few regular pancakes sprinkled with banana and chocolate.  No!  That is not a banana choco pancacke!  But BOB does this classy.  They mix the choco and banana in the batter, so you get perfect circles of banana choco wonder.  \nThe coffee is good, the decor is funky fresh and the service is A plus.  Prices were not unreasonably high either. I can't imagine a better brunch choice!", "author": "Smog R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-06", "description": "great by day. sunny, bright, even keeled. i really like the people who work here. their brunch looks mighty tasty; all plates were cleaned. word on the street is that it transitions seamlessly into night.\n\nupdate: i just upgraded to five stars because i am full on falling in love with this place. i love that they let me stay for hours. i like watching the clientele. i love that they call me sweetie. and i think their coffee is mighty tasty. i would move in if i could.", "author": "julia r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-05", "description": "We love the brunch here, the fact that the place is stroller friendly and the friendly staff.  My wife loves the pulled pork benedict, I dig the breakfast sandwich.  The french fries are killer!  I'm not a big fan of their burger, but this could just be personal preference on my part.  The service is generally good, and during the day when it's slower it's okay to sit and work at a laptop for a bit.\n\nWe've had dinner here in the warm weather and it's great to sit at one of their sidewalk tables.  I don't really know what their full dinner or cold weather menu is like, though.", "author": "Alec Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-06", "description": "Decor is cool and the atmosphere is good, which is the only reason this place is getting an extra star. Bland, heavy, greasy food at brunch. I've had better egg sandwiches from bodegas.", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "very tasty solid american fare \u0026 cocktails. rad decor and some outdoor seating.", "author": "Clover Dan .."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-26", "description": "Best place ever!!! Awesome staff, delicious food and drinks, and fun stuff like trivia. What more could you ask for??", "author": "A M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-11", "description": "I was looking forward to eating there.  I was incredibly disappointed.  Due to the long wait (for the food) dinner at 8:30 p we ordered oysters, they were shucked poorly and bits of shell inside made them crunchy.   My crunchy green beans were frozen veg, and not crunchy at all.  The escarole was oily, and my veggie sandwich was a grilled cheese with chutney - nothing came out timely, and the couple behind us left because it took so long. The waitstaff was flustered.  I don't think I'd bother giving a second chance.", "author": "K T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-03", "description": "Building on Bond is great for some things and less than stellar for others.  Basics, like scrambled eggs, gravitate toward being inexplicably bad, but the burger and BBQ pork sandwich are usually fantastic. I've always found the service helpful, but zany. This is not a \"destination\" dining spot, nor the place to go when trying to impress a date, but it's great for a casual bite when you're in the hood. The atmosphere and decor are great, though.", "author": "Meghan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-06-16", "description": "I've eaten here many times, and while it gets major points for being so close to my home and my wife's love of their burgers, I haven't felt compelled to write a review until I had their Cobb salad today. Dear. God. Hands down, best I've ever had! Everything about the salad is great but what makes it remarkable is the bacon.... oooooh, the bacon. Thick cut and diced. Perfect.\n\nCouple a perfect Cobb salad with great beers on tap, a great burger and fries, great service (seriously, I haven't run into a bad server or bartender yet. Adam (if I recall correctly) behind the bar was great and we've had two servers more than others who were not only kind, but more than accommodating to our needs/wants), an amazingly designed interior and you get a five-star review from me.", "author": "Chris O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-16", "description": "Building on Bond is my favorite Happy Hour. The $3 drafts are excellently paired with a tranquil and leafy street corner. I've come here alone to read, with friends, and for meetings and have never wished I'd gone anywhere else.\n\nEveryone I've brought to Building on Bond has loved it, too. Perhaps that has to do with the vibe, which is laid-back and not confined to any one demographic. You'll see 20-somethings, 30-somethings with or without kids, 40-somethings, etc. etc. happily coexisting and even--gasp--conversing. It's a nice change of pace.\n\nTheir food is perhaps a little overpriced, but nothing major, especially since the things I've ordered have been pretty delicious.\n\nAll in all if you find yourself with a free afternoon in Cobble/Boerum Hill, I highly recommend checking out Building on Bond.", "author": "Max H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-04", "description": "A pretty cool place with sub-par food.  Although, I got to admit their chicken soup is quite nice.", "author": "Kwik E."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}