{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-07", "description": "I've always liked the atmosphere at BoB, and we went here regularly for brunch. But the menu has changed, and although my scrambled eggs were good, they did not stand up to the old breakfast sandwich, which was my favorite. Plus now fries no longer come standard so you have to spend a fortune to get enough calories to justify eating brunch out in the first place. Further, the service, which has always been relaxed, was downright apathetic. It took us 20 mins just to get the bill, and even then we had to ask twice and pay at the bar.", "author": "Andrea M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-15", "description": "This is exactly the sort of place I wish existed in my neighborhood: legit coffee, delicious food options, and the possibility of a glass of wine after a long day at the office.  Lots of seating, both indoor and out.  Baristas who manage to be simultaneously interested and disinterested.  Cool decor and great people-watching. If I find myself in Boerum Hill, I will go out of my way for breakfast at Building on Bond.", "author": "Elizabeth E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-08", "description": "I love this bar, it has amazing decor, the staff is friendly and lacks the too cool to serve you attitude one often finds in brooklyn.  The food is really good and brunch is amazing.  I recommend the chorizo burger for lunch, the pulled pork for dinner and for brunch, the egg scramble with mushroom and cheese is a winner.  The lemonade is home made, the beers are fresh and seasonal and they have three bathrooms! a girl loves that! They have a really cute out door seating area that is dog friendly.  Love it here, and i recommend it to anyone looking for a low key spot to chill and eat.  did i mention how clean it is?! also i huge plus for me :))", "author": "lesli F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-23", "description": "Starving artist unite! The place is full of fun artistic drawings and displays. The music is hip to the hipsters. The food is great here, the fries makes everyone dig in like a wild pack of wolves. \n\nRecommends the Pulled Pork and an imported Beer. Love the staff, young and friendly.", "author": "Joeffre U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-10", "description": "My friend insists that when she lived in this neighborhood five years ago she would walk past this storefront, then a homely bodega, dream it were a bar, a restaurant, or a coffee shop.  A lawyer then and a journalist now, she believes she has the knack for spotting great spaces and makes wild claims that she has predicted most of Brooklyn's recent hot spots.\n\nit seems she will be right with Building on Bond.  A corner storefront with large windows and a Modern feel quietly waits with one of its double doors open funneling customers to a service counter that extends into a bar with three or four stools.  After that convention, the space folds and unfolds into an origami piece of tables, nooks, corners frames, stairs, levels and other seating that seem simultaneously cozy and clean, private and public.  \n\nThe coffee is good.  A double espresso is pulled with attentiveness by friendly staff wearing Original Penguin shirts (not a uniform, just a coincidental conceit that is so appropriate to cafe culture...)  I did not partake in any pastries, but they seemed very average.\n\nIn short, this is a beautiful space that can only be ruined if management/ownership eschews common sense and becomes uppity.  Having invested so much in the design of the space, it is unlikely that they would divest themselves of business sense.", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-31", "description": "Dear Pretzel Bread Maker,\n\nI am sure glad you know what you're doing because I couldn't get enough of your yummy delicious bread! And to pair it up with BBQ Pork and Apple Slaw, excuse me while I wipe away the drool from my mouth. The side pickle was quite tasty as well and the chips, which I am assuming were homemade, were a bit sparse. I am guessing that your hand is small and couldn't grab more than the 7 that were sitting on the plate, but that's neither here nor there. \n\nAs for the lemonade, maybe you should cut back on all that squeezing. It was too tart for my tongue. Thank you for not kicking me out while I was using the wi-fi for 1.5 hrs! :)\n\nLovingly,\nDreamsrey", "author": "Dream S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-24", "description": "This place could be so much better.  It is, after all, a neighborhood spot so it would be wise to be more considerate and accommodating to patrons.  Would have given BoB one star, but since it's my neighborhood I continue to hope that it improves.  But, the recent menu changes are step in the wrong direction.  For example, why would you take a wide-ranging brunch menu and pare it down to such extremely limited options.  With dietary restrictions, my friend tried to order just eggs and a salad (not a dish on the menu).  Waiter said that the chef refused to add a salad and really didn't want to do the two eggs since it wasn't a dish on the menu. And, those eggs took over 20 minutes to arrive.  So many more options in Boerum Hiil with a better perspective.", "author": "K Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-09", "description": "$2.50 for a tiny glass of soda filled with ice.\nAre you kidding me?  In this economy?\nI thought that was ballsy and not in a good way. \nThe $9 turkey sandwich was good. The pickle was flavorless. \nThis place is good for drinking coffee while surfing the Internet. \nBring a fully charged laptop as there are few outlets.", "author": "Johnny S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-11", "description": "Been there twice, once for drinks and once for food. Good craft style drink options. Interesting variety of food on menu, seemed like something for everyone. Wasn't blown away by the food, but had no complaints either. LOVED the decor. So much interesting stuff to look at.", "author": "Courtney D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-22", "description": "Had walked past this place and it looked very appealing.  Finally went by today (Sunday) for brunch.\n\nThe place was busy in that good kind of way: people eating and talking, waiters flying around.  But it still had this nice vibe to it.  Loved the gentle breeze provided by the mounted fans.\n\nWe sat at the bar and ordered our food from the bartender (who was super nice and attentive):\n\nBreakfast Sandwich--good (not great).  The bun is a lot softer than it initially looks, and makes for a light sandwich.  (Think half bun half  croissant.)  The egg and bacon inside was tasty.  Not exceptional, but good nonetheless\n\nChocolate Banana Pancakes--also good (not great).  The portion was average, and the bananas and chocolate chips were just added on at the end rather than part of the batter.\n\nTwo coffees--bold and smoky.  Good, but not great.\n\nI dunno but I still want to give the place 4 stars.  It's like the whole is greater than the sum of the parts.  (Or maybe because today was such a sunny day...)\n\nWorth a trip.", "author": "Hug S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-27", "description": "Can I put 3.75 stars up?\n\nBuilding on Bond just started serving Brunch and I was there to experience the growing pains. By the second time serving it, they've almost ironed out the kinks.\n\nFirst, I can't say ENOUGH about the decor. I absolutely love the design and architecture - the recycled materials are utilized so beautifully and functionally. The stacked drawers mounting the mirror in the bathroom are a site. \n\nSecondly, the service was solid. The server kept the coffee flowin' and the water topped off. She even stopped to chat with us for a bit in a room full of patrons. I appreciate that. \n\nI really enjoyed my cranberry and walnut french toast (satisfied my sweet tooth that morning - the walnuts seems glazed in sugar) but my companion was very disappointed with the portion size of the poached eggs on toast with hash browns. It was rather pathetic, like a kiddy meal. We had such high hopes drooling over other plates at other tables - the sandwiches for example. The bread looked like a hot vendor pretzel! Mmm... Yet, he was left deflated. The bloody marys were redeeming but the coffee was a bit too bitter Starbucks for me (that's just my opinion) but nothing milk couldn't drown out though.\n\nGreat prices, great atmosphere, great tasting food, great music. I'd definitely go again. \n\nBeware though, brunch may be taken over by the stroller derby association. There was a screaming kid and a few other silent ones when I ate and I'm not a fan of having my ears bleed while eating eggs.", "author": "Julie K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-20", "description": "Building on Bond is a great option if you're in the neighborhood. My  husband and I go here almost every other week, either for brunch or dinner. The food is (almost) consistently good and the service is (almost) consistently blah, so you really have to go for the food+company+ambiance. The veggie burger is amaaaaaazing, make sure to get the sun dried tomato paste with it. The brunch options are also pretty great, the french toast being my favorite. Last time I went, I tried the grilled cheese sandwich with a fried egg on top and tomato soup. It was delicious but I think it was because they were using kraft cheese and plain old white bread. I would have preferred a healthier option with real cheese for it but can't deny  I didn't enjoy the chemical-food after a while.", "author": "Maryam A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-01", "description": "Good coffee and snacks, awesome decor.\n\nI stopped in for a coffee and a danish. Both were good, but pretty ordinary. \n\nThe decor, I loved. I'm a sucker for unfinished wood and exposed pipes. They nail that DIY, recycled material look.", "author": "Lokesh D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-01", "description": "Update: I went again and loved the place like I had before the below experience. I again want to share the joy that is Building on Bond.", "author": "Amy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-10", "description": "Great neighborhood spot. Overall, the food is legit.  The pulled pork sandwich was delicious, but I would've preferred larger pieces of pork on a pretzel roll instead of ciabatta (because really, what's not better on a pretzel roll?). The cole slaw on top was nice though.  I ate dinner outside on a beautiful night, drinking a summertime-appropriate Pimm's Cup. That's the kind of place B.o.B. is -- a good spot to relax with friends.  A few nights later, I went back expecting to do just that. As it turns out, they were having their one year anniversary celebration.  The place was decked out in balloons and crepe paper and even a pinata.  The DJ turned the space into a dance party.  Such great vibes there that night, I stayed and ended my night there.  I have glitter on the bottoms of my shoes to prove it.", "author": "Minh T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-19", "description": "I've wanted to like this place from the beginning. I love the space, the service is super friendly and it just has a nice vibe. Plus it's like 2 blocks from my house. What is not to love?\n\nThe food was kind of a barrier for a little while. While the food and I have to grown to respect each other, this isn't the kind of place I'll ever be dying to go to or take friends to.That said, there's a major exception: the most delicious sandwich of all time: the bbq pork on pretzel roll. \n\nIt's the kind of sandwich dreams are made of. If that doesn't sound very good, expect a cool space and vibe with so-so food. If that does sound good, you're in luck. This is the kind of sandwich you'd kill for.", "author": "Joshua H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "I came back for some real breakfast. I ordered the perfect eggs and boy, were they perfect! It came with chorizo and hash brown. It was a hearty dish and I fully enjoyed it. My friend ordered the chicken pesto sandwich which was also very good. Again, fresh ingredients and the perfect amount of pesto with the sandwich.", "author": "Elaine C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-05-09", "description": "So, I thought a lot about my experience at B on B because it really bothered me that our waiter didn't seem to notice that our food hadn't come out after so long, and also didn't seem to notice that the water glasses were empty and I'd drained my coffee.  And I think this is a staffing problem that could be fixed. And I badly want to like this place, so I am writing an update.\n\nIf our server was keeping an eye on our table and saw that our water glasses were empty, he may also have realized that we didn't have food yet and he could have run down to the kitchen to see what was up. This isn't being Super Server. This is part of staying on top of the job. Instead I think he worked the opposite way. He put in our order and then forgot about us, but would have refilled our drinks when the food came up, cuing him to return to our table. Since he didn't get that cue, we may as well have been sitting across the street.\n\nI don't want to pick on this place. It really is gorgeous and my five year old loved the banana chocolate chip pancakes. I went for lunch on Thursday, and the food was good and the wine wasn't bad for a place that only had two kinds of red. Our server, a different one this time, was very funny. My friend and I were having a lazy afternoon and fully intended to have three glasses of wine in three hours but our waiter let us sit unattended when we'd drained our first glasses, and we had to wave him over to get any service. So it isn't that we just got the bad apple waiter last Saturday. I think maybe the owners know they have a great looking space and they think they can slide on the service. I don't know. I hope that's not the case, and they're just having growing pains.\n\nI don't know whether I would recommend this place at all, and certainly not without some hesitation. Clearly from the other reviews, the service is hit or miss. The food is good. The coffee was good. The wine was good. The music is good. The decor is charming. We'll probably go again, but unless the service improves we won't go a fourth time.", "author": "Ariane B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-02", "description": "Good cocktails, cute decor with blueprints and architecture-related decor. Laidback alternative to Bar Tabac but more intimate cozy feel, same chill comfort-food nabey vibe. Great veggie burger w/homemade sundried tomato spread.", "author": "Krista B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-17", "description": "This was a first visit. My friend was enthusiastically promoting their blueberry pancakes. The layout was deep and minimalist. Chairs and tables were packed close together. My friend ordered eggs and home fries and I got a brioche sandwich with home fries as well. The food was good. But, my first plate was wrong and I had to wait again for the correct order. After getting the order right, we had to look for our waiter to get the bill. The service could have been better. I look forward to my next visit when I get these so-called amazing blueberry pancakes.", "author": "Jamiyla C."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}