{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-21", "description": "Building on Bond - it's time to get your shit together. Service here has been lacking for some time now, but we've kept coming back because the food has been pretty good and the decor is nice. Tonight we were greeted by an unfriendly hostess, told we couldn't sit at the open tables outside, then seemingly forgotten by our wait staff. We waited over an hour for a salad appetizer - and barely had a chance to ask what was going on as our server never came by to check on us. Sorry, but the here food isn't worth this level of service - there are too many better places in the neighborhood to come here anymore.", "author": "Nicole M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-05", "description": "I came here for a dinner with my family. We had hamburger and some wings. I would say both dishes were very so-so. I am bit picky about hamburger, but it was nothing special and the wings were worse than some average bar wings. The atmosphere of the place was cute and even though the place was small, there were enough space for everyone.", "author": "Mini K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-18", "description": "Quaint and cute little joint, with coffees, wine and good food! Outdoor sidewalk seating is available weather permitting in charming Boerum Hill neighborhood in Brooklyn. Weird wifi rules- they don't have it on weekends, and only till 4pm on weekdays??? I wonder why?? Anyway, worth a stop for lunch or brunch!!", "author": "Meri K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-29", "description": "This has always been a well-designed space and atmosphere with a prime corner location in Boerum Hill. The outdoor seating area is really nice and the staff are usually very friendly. \n\nHowever, the food menu really needs some work. Too many disparate items that seem to communicate an identity crisis - and when I've tried anything other than a burger or fries I've been significantly disappointed. \n\nWe tried the recommended bucatini with zucchini and sun-dried tomato pesto. It was really bland, almost flavorless. Same goes for some of the basic apps like broccoli rabe and shishito peppers. The produce itself didn't seem of the highest quality, but then both were overcooked, wilted and lacked any real flavor. \n\nOur server noticed we barely touched any of our food, but at the end of the meal, not a single plate was discounted or comped, no apologies for the bland dishes and long wait, or even a complimentary dessert to make up for any of it. Total bill (for 3-people) was nearly $110 without tip. \n\nUnless a new chef can come in and revamp what could be a major player in Boerum Hill, I'd save your money and walk up a block to the always satisfactory Rucola - seasonal menus with a concept that never underwhelms.", "author": "J D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-18", "description": "Not what I expected. My friend and I walked into the restaurant- a very small but cute and unique space- and waited quite a bit to be seated. It was during lunch and not what you would normally call busy had there not been just one server. We were seated and the menu was simple but had great options. I went with the moules frites and my friend had the burger. Upon ordering, we were told they are only doing salads as the sides right now. I'm sorry but how do you have moules frites without fries, and for $19? Granted, the salad was fine but definitely not what I wanted when I ordered my dish. Also, I found the mussels okay but the sauce/broth was just watery and added no actual flavor to the meal though the presentation was nice. In addition, the bathroom is set up kind of oddly. It is a single stall with the top half of the door as glass panel but covered with a blind. It is weird because someone could easily see into the side of the blind which did not fully cover the glass window. All in all, I probably would not come here again but I do appreciate its cute look and that the server was nice.", "author": "Ana H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-16", "description": "Live in the area and had been meaning to go for quite a while to stopped by for lunch this weekend.\nLovely space and very kooky design/decoration. However, I got the feeling with this place you're paying for style over substance.\nI ordered the Irish breakfast and a coke (I was hungover). The coke was a bit flat..perhaps it's an off-brand or craft, but wasn't advised of this so that was only OK. The breakfast had thick cut bacon that wasn't cooked enough so very fatty, and not 'Irish' in style. The sausage was like an American sausage patty, the beans were cold, there was no butter for the toast ...I could go on. Basically a below average Irish breakfast for $20 dollars.\nMy wife has a burger which came undercooked. It was medium rare and she asked for medium well. They were happy to fix it and took the burger away and replaced it with a new one....which tbh was still undercooked. In their rush the fries weren't cooked enough the 2nd time around. In our opinion, the burger patty was too large for the bun and just became a mess. Cappucino was good though.\nSo to conclude it was a pretty sub-standard experience, which is OK, but when you charge $20 for a breakfast and $16 (?) for a burger and fries it's a bit of a kick in the pants. Perhaps it was an off day but who knows.", "author": "William H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-08", "description": "Great place, great interiors and truly the best beer and music. Wonderful! \n\nP.S. Stephie is the best", "author": "Marcin T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "It's high time I updated my review of Building on Bond because:\n\n1. It's been 4.5 years since the last one.\n2. They no longer serve the chorizo burger that I didn't quite love.*\n3. I've been here many times since. \n4. They are a reliably solid choice for brunch, lunch, and dinner in the neighborhood.\n\nWith a good selection of beers, sandwiches, salads, cocktails and more (mac and cheese, etc.), Building on Bond does its best to be all things to all people, and they are pretty successful. I've taken meetings here over coffee,** I've had lazy weekday Cobb salad lunches at the tables outside, I've cured hangovers with their brunch burger...\n\nBasically, like Biz Markie's friend, Building on Bond is open all day, and they've got what you need. Including a surprisingly decent portobello reuben sandwich, although I do object to the very idea of such a thing. \n_____________\n\n*As such, the odd incest analogy I made is outdated. \n**And by coffee, I mean wine.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-25", "description": "This is my new favorite place to work!  Part of me wants to keep it as a secret but the place deserves more love.  I've always walked by the restaurant on weekends when they serve brunch and it looks like the perfect neighborhood restaurant to brunch outdoors on a nice day.  But, little did I realize, it's a great work spot on weekdays!\n\nThis is a restaurant / cafe duo that serves coffee and pastries only on weekday mornings.  There are plenty of tables for individual and group space.  The only downside is that there are limited outlets and wifi is spotty (big thumbs down for freelancers!).  The decor and vibe is really relaxed and comfortable, so I'll definitely return.", "author": "Brandon P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-13", "description": "Really enjoyed this place!\nPicked this place blindly on the way from a way long meeting because I needed a drink.  The drinks were solid (I had two sazeracs) and the fries (only app I tried) were made just the way I like them....which is pretty much any way : P  \nWhat I really enjoyed about this place was how chill it was.  Not crowded, low music, quiet environment, even the server-who was always prompt and courteous-had a chill and quiet vibe to him.  \nCool spot.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-02", "description": "I came here with a friend - it was an odd time. After brunch and before dinner, so the menu was ridiculously limited and unappealing. We settled for white wine and dessert. I must say, they atmosphere is cute (rustic), the wine was good and the desserts were perfect.", "author": "Tomi C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-07", "description": "Went to Building on Bond with some friends for Saturday brunch. Extremely cute from the outside, with lots of outdoor seating. The interior is also very cute, in a sort of eclectic way. Things started going downhill from there, though. I got the English Breakfast (beans, mushrooms, tomatoes, sausages bacon, and two eggs), which arrived cold. The beans were extremely over-salted, and the sausage lacked in any real flavor.\n\nFood aside, the service was nice and helpful, but I don't recommend coming for a meal.", "author": "Benjamin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "Low key spot with indoor and outdoor seating.  I enjoyed my Cobb salad, which had a deliciously charcoaled chicken. The huevos rancheros was also solid. Best thing is that the portions are the perfect size.  \n\nService is on the slower side.", "author": "Jenny K. L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "They have excellent happy hour specials and great ambience.  Food is solid too. Had charred kale salad and Korean bbq wings, both were awesome. Staff has always been very friendly and it's usually pretty cozy (sometimes live music).", "author": "Murph T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-17", "description": "If I could give this place more than five stars, I would. There are lots of places with good food and lots of places with good vibes in New York City, but very few places that have both. I've been coming here for many years and love the way that the staff treats its customers. This place is basically my favorite spot in BK. And this review is long overdue.", "author": "Ron W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-27", "description": "Super interesting atmosphere - you can tell one of the owners was a design/architect/engineering lover!  The food was all right but to be honest, I only had the burger and fries.  My friend ordered the cobb salad with chicken which was massive.  We each had a glass of the house wine and total all in = the bill came out to $25 with taxes and tip pp.  We did miss out on trivia night which goes to show you that this a neighborhood joint.", "author": "Lina F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Very solid casual place with good cocktails! To eat we split the three-side plate with a bunch of vegetables (spinach, shishitos, and brussels sprouts - all delicious with a touch of spice!) \n\nWe also each ordered the burger, which was delicious Pat Lafrieda beef! Overall simple but good across the board. Good service and ambiance as well.", "author": "Danny S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-05", "description": "I've always had a soft spot for this place, but only because if it's location and atmosphere. Nice place to work during the day. Good outdoor seating.\n\nBut their pricing is rapacious and their portions are stingy. Mind you, for a $9 bowl of okay soup, they want to charge you $2 extra for some plain white bread, not even any options.\n\nI hope they consider mending their ways a bit to show some consideration for their customers.", "author": "Maria G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-20", "description": "I love the space, the food was good, and the food waitstaff were really hustling. HOWEVER, the bartenders must be related to the owners. They were slow, uninterested in doing a good job AND couldn't make standard drinks. We were sitting at the bar and the waitresses on the floor had to keep explaining recipes. I'm not asking for perfection, but you should know how to make drinks as a bartender. And if you can't, you can at least try to move faster and be pleasant, and thank your co-workers for having your back.", "author": "Danielia D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Nice, cozy joint to stop into if you're waiting for a table at nearby Rucola. The Brussle sprouts appetizer with jalapenos was super flavorful and I was sad when it was finished. Staff wasn't super friendly, but so what. With sprouts like that, they don't need to be. Nice wine, too.", "author": "Ruby F."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}