{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-14", "description": "i'm sorry, building on bond, but i really wish you were better than you are.  why?  well, i like your style/decor.  i also think that service is pretty friendly and seems the accommodating sort (as it should be).  but well, your food is, eh, not good.  mostly because it reads so much better in print than what actually comes out of the kitchen.  \n\ncase in point:  the bob burger on a pretzel roll.  sounds intriguing, yes?  i mean, i like both burgers AND pretzels so if a chef is going to marry the two, i kinda trust some tasting rounds happened and that the end result listed on the menu is well thought out and executed.  sadly, not the case here.  the bread/bun/roll should not detract from the essence of the burger, but the pretzel roll's chewiness throws everything off.  you end up chomping down on the bread, tearing away with your incisors (?) like a wolf, or daintily slicing up bite-size portions with your knife and fork.  there has to be a better way.  oh wait, there is, use a potato roll.  maybe not as imaginative, but hell, it gets the job done.  \n\nand still another menu faux paus, if you have nuts in your ingredients, spell it out.  case in point:  the chicken sandwich on the paper brunch menu (unlike the menu online, which i just checked before writing this review) failed to mention that it was made with basil pesto (pine nuts- or walnut- allergy sufferers, beware!).  this fact made a very hungry me quite sad when i saw the telltale green bits sticking to what looked to be a nicely grilled chicken.  ugh, hunger pangs abound.  but good thing i asked because if i hadn't, my table neighbors would've witnessed a violent case of anaphylactic shock, which would likely have put them off their meals as well.  \n\ni could go on, but if i did, i'd probably need to deduct another star to reflect my miffed state.  and i don't want to do that.  again, because i liked the staff and the ambiance and the sidewalk seating.  i just have issues with the food, which when you're a restaurant, you should probably see to first and foremost.  or else just market yourself as a bar/coffee place that serves snacks.", "author": "Tina E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-11-14", "description": "I DIG BoB.  I love the vibe and the overall space.  The coffee in the morning is kind of average - I find the espresso is much better.  The pastries are pretty ok but could be more appetizing.  Offering a little mini quiche or egg sandwich would make me visit way more often.\n\nI went for lunch and had the turkey sandwich was very good and I agree with many others that for $9 there could be a side of fries or chips.  I have also been for dinner and will say that the Pistachio Chicken is amazing!  So good.\n\nFinally, BoB really does make me smile knowing it's there and I love that the owners make the most of the space.  It's like they really thought of everything and every hour of the day....breakfast with people working on their laptops, lunch, dinner and late night drinks.  I think it's brilliant and I wish other places would wise up and do the same thing.  I went to Loretta's coffee shop on Atlantic - very cute and all but I get irritated thinking how the bleep are they going to make rent running just a coffee shop, selling pastries?  Victory can probably pull that off because it's so small but the space at Loretta's feels a bit wasted for the rest of the day and night.  \n\nThis is not the case with BoB...they definitely have it going on.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-13", "description": "Well.....I have been so reluctant to write a review here for a couple of reasons. The main reason is my brother and I are friendly with one of the owners and his wife and I think they're really great people and a lot of fun but they should know and care what everyone thinks and experiences as it's only fair. I watched this place sprout up and had very high hopes for it. Because we knew the owner we had the pleasure and benefit of watching the building process and walking around the construction site and watching all of the design elements evolve.  I felt a fondness for this place and was really excited for it in the neighborhood as I live a block away.\nAs other yelpers have described, the staff is either WAY too cool to acknowledge or greet you when you walk in the door or they hate what they're doing. It is one or the other. In the beginning I came in and made a habit of ordering coffee every morning and a whole wheat croissant from Balthazar (which they no longer sell) and dealt with the sweetest and most pleasant girl's in the very beginning. We're talking days of the grand opening which turned into weeks until they were no longer there and were replaced by a snarky miserable guy and girl who couldn't stomach making a soy latte let alone acknowledge the line forming out the door. Needless to say BOB was no longer an option for my morning coffee ( a shame as I live SO close). I thought about mentioning it to Phil when I saw him but never knew how to segue way into that. I did go back recently and a new girl who says she hates coffee and wasn't confident making it, made the most AMAZING soy latte and was so pleasant about it.\nNow, to my dining experiences, as others yelpers say, I have never been wow-ed by the service. There is a man in the mornings on weekends for breakfast who is great and friendly and a girl outside tending an ice cream cart this Summer who was so friendly and fantastic. Other than them, the service lacks. They always seem annoyed and in their own world with each other and make you feel that you're interrupting them. They're just barely friendly. Last night my friend ordered salmon and she's a newbie fish eater so she asked it to be well-done. it was not. It was pink and raw in the middle. We asked if it could be cooked more and showed it to our server. So the passive-agressive and annoyed server snatched it up, forgot about it and when I flagged her down after 8 good minutes she annoying mumbled something as she zipped by to more important things and zipped by again saying \"it's not done\"....(OBVIOUSLY it's not). An apology or update would have been the right thing to do. There were so many more flaws with her service and the atmosphere in there I can go on and on. Long story, no apologies, no REAL service. I tried my hardest to eat my salad as slow was possible hoping her fish would one day arrive. It finally arrived, our meal was stunted. I had to finish my food before her and then watch her eat. The server was non-apologetic, defensive, passive-agressive and not a friendly person that enjoyed what she was doing bottom line. Our moods were low and the experience sucked. Now, this is the first I write about. There have been about 10 more of these same bad experiences but I continue to come here because it's so close \u0026 I feel like we're supporting Phil and his wife. All the times, I was displeased but my distaste pales in comparison to those that I dined with especially my very good friend last night. She was back in town for a night only to travel early today and her special meal was ruined. The food is nice, they make an exceptional Pim's Cup and the decor is fantastic. If you're looking for genuinely friendly staff who are \"on-point\" and make you want to tip well then you will not find it here. Sad but true.", "author": "Erik R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-24", "description": "Thought you can have a productive day on your computer while eating here? Forget about it; the internet is dysfunctional and dial-up speed would be an improvement to their  current service. The deco is impressive, but the food quality is way below the finely designed interior.", "author": "Pj S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-24", "description": "Had my second brunch here today.  Its a great spot to eat outside on a quiet block.  I had the egg scramble with broccoli, which was very good.  My friends liked their dishes as well.   Although I see other reviews here to the contrary, I've had good service both times and I think the prices are quite reasonable.   A solid choice when in the area on a nice day.  Both times I didn't have to wait for a table, which is a major plus.", "author": "Kathleen S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-30", "description": "Good coffee, lunch and dinner food are mediocre. Service is generally pleasant. With a change in the kitchen this place could be great. Now it's where people go when they don't want to wait for a table at a better restaurant.", "author": "Erik B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-18", "description": "This place is the best find if you're looking for dinner near the Barclays center. The veggie burger and brussel sprouts side are a must! Very friendly staff and right now they have a sleigh and tons of string lights so very Christmassy :)", "author": "Bronwyn H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "Food is good and the vibe is right. More of a restaurant then a bar and the service can be spotty. The outside seating is nice place to have a coffee and late dinner. Big fan of BOB!", "author": "Wilie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-01", "description": "such a great spot in the neighborhood.\ni always pass by when i'm taking my dog on walks -- suffice it say, there was a puppy party going on at the outdoor patio, and we (my cutesy k9 and i, decided to join)\n\na few glances over the menu and i decided on a green salad with asparagus, beets, gorgonzola and endive salad. it was perfect - dressing was light and fresh and it allowed me to indulge in the side order of mac \u0026 cheese. goodness that was amazing.\n\nall in all, it was tasty.\ni was able to bring my dog.\ngood selection of beers to cool down from the summer heat.\n\ni will absolutely return.\nalso, thanks for not delivering, i fear i'd go into cardiac arrest from a mac \u0026 cheese overdose.", "author": "Krystal F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-24", "description": "The food here for brunch is yummy and the decor is cute BUT their wait staff needs to get it together - when I order toast with my meal [which should be included with an egg dish don't ya think???] I want my toast WITH my meal. Took an additional 10 minutes just to get it with my eggs! They also messed up the cheese selections and what not, though my omlette with broccoli and mushroom was still delic!", "author": "Heather F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-13", "description": "Return - Yes, great neighborhood spot for brunch - only so so offerings for lunch/dinner aside from burgers\nAtmosphere - Eat outside in summer, Cool interior, low key vibe, Good place to catch up with a friend over a few drinks. \nService (1-4) - The service is usually pretty solid but it was horrible during my last visit. The manager(?)/hostess disappeared for 20 minutes w/out making allowances for her absence. We stood around as empty tables stayed empty and uncleared. I finally just sat down at the table she had previously designated for us but didn't get served for another 10 minutes - and only after getting up and hunting the manager down. She responded testily that she was busy taking a truck delivery. That's fine but put someone else in charge while your gone or at least let your servers know about it. And definitely don't get testy w/ clients who've waited unecessarilly for a half hour due to your poor management skills\nFood (3/4) - Egg and bacon sandwich (4) served with fries (4), Cobb salad (3+), burgers (3/4 - medium rare, delicious bun), portobello sandwich (2 - a little bland), veggie soup (3 - very salty), mesculin greens (2/3 - a little wilted), taco special (3-), chicken parm sandwich (2) \nDrink - Top notch Bloody Mary (4+)\nCost - Very reasonable - tab for two w/ 2 drinks is usually around $45 before tax + tip.", "author": "Will S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-14", "description": "Solid local place with great, friendly service, good food and a charming atmosphere. I've been going here for years (since it opened) and never had a bad experience. The menu is small but there are enough choices to satisfy anyone. BoB is a real neighborhood resource.", "author": "Howard R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-16", "description": "Great laid back place with cozy atmosphere.\n\nFantastic pulled pork with an apple slaw that is to die for. The staff is always friendly and happy to make adjustments for me despite my needing to have a wheat and gluten free meal. \n\nThe bee hive is my drink of choice here- yum yum!!", "author": "Anna D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-08", "description": "BOB, you broke my heart.  Why did you change your menu?  Why are there so few items?  Why did you get rid of the Black Friday sandwich?  Guys, this sandwich was amazing: roast turkey and cranberries and stuffing and gravy on this hearty nut bread.  I wish I had one right now.  But I don't.  And I'll never have one again.", "author": "Debra D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-05", "description": "This place is hot.  I hung here with a friend on a sunday night and it was still packed with patrons.  Great decor.  It looks like it's been around forever but it's a new addition to the neighborhood.  You must try their specialty drinks that are made with homemade infused  vodkas.  I had the sucker punch with spicy cinnamon vodka and my friend had a ginger infused drink.  Tasty and for 10 dollars why bother going to Manhattan.  Today during the street festival they had a preview of their bbq sandwiches which were melt in the mouth beef or pork in a unique pretzel bun.  I will definitely have to eat here when they start serving food. \n\nI heart building on bond.", "author": "Grace H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-15", "description": "even though their food is mediocre, i just loving coming here b/c it's such a great atmosphere and the people that work there are so nice. \n\nbest part is that they serve/sell my favorite coffee -- la colombe", "author": "Hyun L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-29", "description": "So I have been doing the dating thing... It's questionable- but for some reason it always seems to bring me here.\nMy last three  male court-ers have selected brunch at B.O.B!!\nIt's good, but is it in a dating handbook for Brooklyn based men?\n\nTables are super tiny, which perhaps is part of the date charm. No table can seat more than a group of 4 skinny people.\n\nI suggest the French toast, the scramble is uneventful.\nCoffee is good, like flavorful  which is novel for a place that pours free refills.\n\nLooking for a brunch date... Go here, looking for a brunch experience... Go somewhere else.", "author": "rose d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-25", "description": "The location is perfect for me, and its a great place to get drinks before or after dinner.  The food is good, nothing special, but good.  I usually get the mac and Cheese, or grilled vegetables, but I cant complain about the burger, chicken sandwich or the turkey and cranberry sandwich.  Im not a fan of the fries here- i cant pin point it, but they arent worth the fat.", "author": "Jill Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-28", "description": "This place has an amazing setup... it's almost like one giant erector set. All the tables are on joints and fold up, and there are other articulating parts. They also have jars of paint around... not cans of paint... but paint in clear glass jars. Also, the beer taps come out of a large pipe that snakes around the room and goes into the back somewhere. It's all very creative. Among other interesting features.\n\nI came here for brunch. The food was marginally ok, but it was such a lively scene amidst all the gadgetry that I still give it a good review.", "author": "Jason G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-05", "description": "Went on a couple date here this week and I must say it is delightful! \n\n1. Great Beer and Wine list... many beers on tap, nice variety of wine\n2. Decor/Design... wow. Design was done by hecho inc. and it is beyond beautiful. Even the bathroom was underwhelming, but in the most perfect way. (underwhelming has a good connotation in my review ha!) This is an organizers heaven with all the drawers and filing cabinets as decoration. Seriously go to see the design\n3. Food... Really delicious sandwiches. Sage-Roasted Turkey one is delicious(cranberry pecan bread with apricot chutney and other yumminess in it). Crispy Fries, Fresh Salads\n4. Service... Got very busy and they were understaffed BIG TIME. Still delightful though... \n\nGreat date spot, meeting spot, drinks with friends... anything really!\nVery laid back and prices are pretty reasonable!", "author": "Justine M."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}