{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-14", "description": "Ok, it's time for an updated review!  First of all, congratulations to Building on Bond for winning NYMag's award for Best Neighborhood Hangout (http://nymag.com/bestofny/fun/2009/neighborhood-hangout).  \n\n\"Neighborhood hangout\" pretty much sums up BoB.  It's open from 7am - 1am and serves every need imaginable -- early morning pastries/coffee, lunch, a place to work during the day, dinner, and drinks into the early morning.  \n\nAs a restaurant, BBb deserves a *** rating -- food is delicious, but the a la cart serving style leaves me wanting more.  I'd like to think that a $9 lunch sandwich comes with fries or soup or SOMETHING else.  As others have said, the service is inconsistent.  Sometimes the service is great, but most of the time it's slow and disorganized and unprofessional.  If i have a friend visiting from out of town, I won't take them to BoB for dinner..there are more special dinner places in the neighborhood with better service.\n\nAs a coffee shop or a place to work during the day, I give BoB ****  I love the atmosphere and the excellent music selection and the other friendly people hanging out there.  It's a great place to work. I can't speak to the quality of their coffee, but their tea is ok -- it's a standard boring brand though and I wish they'd get some exciting looseleaf teas.  Compared to the other local places to work during the day, BoB takes the crown.  (Flying saucer is always too warm, Nascent is always too empty and weird, and Blue Marble has too many distracting kids)\n\nAs a bar, BoB gets ***** -- great bartenders, friendly patrons.  Very welcoming.  The specialty cocktails are delicious and the beer selection is solid.\n\nAs a place to hang out with friends (or to make new friends), BoB gets *****\n\nWent to bingo night recently -- really really fun.  And they've started doing other themed nights: comedy shows etc.  What an awesome place.", "author": "Jonathan W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-12", "description": "I came here the other night to meet friends and the service was great. They must of changed the food company because the bread was absolutely stale and taste old not the same as before when I always come here. I think it's obvious the place is not the same maybe they should go back to the old way and get back there old chef or changed there bread company", "author": "Joseph S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-13", "description": "I'm a very big fan of the Building on Bond! Who doesn't love a local coffee shop?! The coffee is pretty tasty and the atmosphere is great. I wouldn't call it a very big \"let's go chat and have coffee\" type of place. Everyone is pretty quiet and sticks to their work and their coffee. Plus, the music is perfect and isn't distracting! Friendly staff too!\n\nAlso, stopped by for dinner recently and it was pretty good. Pistachio chicken was yummy and the portion size was perfect. When I finished it, I didn't feel like I gorged myself!\n\nCan't wait to try the brunch when it comes!", "author": "Michael B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-10", "description": "Great atmosphere and perfect place for a business meeting during the week. The interior lends itself to the ice-breaking chit chat you're obliged to have before getting down to business. And, the coffee's great, too.", "author": "M. C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-16", "description": "Mediocre food. I had a burger that was supposed to be rare, but was too fat, dry and crumbly. It's the kind of place that just makes the food huge to compensate for how dull it tastes.", "author": "Neil H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-07", "description": "After a fantastic dinner at No. 7, the boyfriend and I walked over to Boerum Hill to check out Building on Bond. This corner stop bar/coffeehouse/neighborhood hangout is really cute and, because it is open late, perfect for some post dinner wind-down time. On a Saturday evening at around 10PM, this place was not crowded and I loved the relaxed atmosphere that made me feel as if I was lounging at a friend's hip refurnished basement. I cannot say enough about the decor, from the large open windows that pierce it from all sides, to the salvaged metal file cabinets filled with random business cards and messages from patrons inside. The large, wooden slabs for tables are perfect for laptop work and I think they offer free wifi. I will admit that I was not too impressed by the service... but for the great atmosphere, fantastic hours, and kitschy decor, Building on Bond gets four solid stars.\n\nI will add that their hot chocolate was AMAZING. None of that watery, tongue-scalding bullshit: this was made with milk and was wonderfully frothy and warm (Yes, I had hot cocoa with my beer. Don't judge me, I was craving it all day and it was definitely worth it). Thanks to Jonathan W. for introducing me to this place!", "author": "lora c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-16", "description": "What a great surprise!  Neither my friend nor I had cars available to travel, so Sunday we decided to go to Building on Bond which was about two blocks away from his house.  My friend and I are both over sixty, and wound up being the oldest folks at the restaurant by about twenty years.  The fact that we were \"old folks\" did not impede our welcome and, in fact, while we were standing outside, concerned that there were no seats available, we were graciously welcomed by the host, who sat us immediately.  \nI immediately fell in love with the funky, eclectic ambiance, filled with stuff from every decade from about 1950s onward--old scales, vinyl record albums, etc., etc.  And of course, the place was filled with 20, 30 (mostly), and 40 somethings, who imbued the place with a wonderful energy.  \nWe found the menu quite adequate.  I immediately ordered a vodka with lime and seltzer, and my friend ordered a glass of the red house wine.  My drink was quite generous, and the house vodka was fine.  My friend's $6 glass of Merlot was good as well.  We accompanied our drinks, with \"scallop lollipops\" which were scallops in a bacon wrap and hummus with pita and raw veggies.  Both were terrific.\nOur main courses were skirt steak with a double order of asparagus--it comes with garlic mashed potatoes which I passed up for a double order of asparagus, and grilled salmon over risotto.  Both dishes were excellent, and my asparagus was worth the mashed potatoes sacrifice.  To keep the buzz going, I ordered a glass of Merlot with my steak, which was quite passable.\nDespite good intentions, neither of us could pass up the apple pie for dessert.  We did however forgo the offer of vanilla ice cream.  The \"pie\" was actually baked in a ramekin with a pie shell crust--and was qute delicious and just the right amount for our now full bellies.\nWe found the service to be quite good, and the serving staff seemed to have a good team spirit.  Prices are really reasonable.  I definitely recommend this place.", "author": "Irwin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-07", "description": "A friend I hadn't seen in over ten years was in Brooklyn for a few days (and I've only been here for a few weeks) and we met up not far from Building on Bond, which he saw on his way to our rendezvous, so when I said I was hungry after a day of work he suggested we go there.\n\nI'm glad we did...  We just barely made it in time for $3 beers, before the price jumped to $6.  The waiter pushed us to pick some quickly if we wanted the day-time price and after taking our beer order said we made it by 45 seconds...\n\nI had the B.o.B. Burger.  I really liked the pretzel dough for a bun, including the pretzel-ish glaze and salt on top.  The beef was good, but could've been cooked just a touch more.  Still, that pretzel bun was fantastic!\n\nMy buddy had the BBQ pork with it but didn't notice the pretzel bun in the menu so he wasn't expecting the bug to be quite as salty as it was.\n\nThere was no pressure to leave after we finished and spent quite a while sitting at the table catching up on old times and in between.  \n\nWe both liked the decor, the rolls of paper for quick-replace place mats and the quaint, older looking furniture.  Nice place!\n\nOf course, it wasn't till after I got the receipt at the end that I figured out the \"B.o.B.\" part of my burger's name...   I didn't realize the name of the restaurant until then.", "author": "Kevin R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-16", "description": "This place is cute, nice interior, good food, and good coffee.\n\nI go here with my sister sometimes (she pays which adds a star in my book). I went today at 11 and the place was filled with professional freelancers on their computers. \n\nThe waiters were super nice, brought us coffee ASAP, it was nice rich coffee. We ordered the Cobb salad, which was pricey at 14 bucks. And the Black friday (a thanksgiving day sandwich with turkey, cranberry, and stuffing). The black friday was pretty good for 9 bucks. Its not the cheapest place around, but its one of the best coffee shops around for sitting on your laptop or grabbing a quick business lunch.\n\nOh, and there is really no food before 11. If you want breakfast before then go to Miles End around the corner.", "author": "Jack T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-27", "description": "Nice outside seating, great for brunch.  Can be a very long wait.\n\nThe service is good, but not great.", "author": "Nicole C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-08", "description": "Love this place!  I've been going since it opened, and it continues to be great.  Perfect for afternoon meetings and weekend brunches.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "didn't have any of the food, but this is a solid place for a pre-dinner drink (we went nearby to Rucola)", "author": "John M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-25", "description": "Awesome decor! This place is fantastic for just sitting and reading or using the internet on their free wi-fi till 4:30pm. The music is great, but and it's not too loud so it's not a distraction.\n\nThey have a wide selection of newspapers by the cash register for customers to take to their seats and enjoy, as well as free candy canes (though I have a feeling those will disappear after Christmas). Their hot chocolate is ok -- a little too much milk for the amount of chocolate, but you can get it with 2% if you don't want whole. (I didn't ask about skim.) \n\nTheir combination of offerings is refreshing -- with cafe items (both drinks and baked goods) as well as alcoholic beverages during the day, and now dinner at night. I haven't had the food yet, but I'll be back the next time I'm in the area. And, they are gracious enough to let outside food and beverages in...but I fear that won't last much longer either.\n\nThe only negative about this place is that I saw a little bit too much below the waist line when the server turned around to make my drink. And he didn't even have to bend down.\n\nBut I still give it 4 stars, so check it out!", "author": "Marisa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-01", "description": "Love the food here, but the service is slow slow slow. It's good if you want to hang for a long time with your friends and not be rushed, because nothing is a rush here, LOL! For the record, I recommend anything with bacon, including the Cobb salad, which is delish.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-04", "description": "building on bond serves as a neighborhood nexus: it's a morning café that becomes an evening hang-out; it's a brunch spot, a creative event space and showroom, a meeting room, a de facto lounge for mothers with strollers and ipads, a refuge for writers, actors and laptop jockeys; a corner café for ladies who lunch.\n\nand, for the most part, it works. \n\nas a hangout, building on bond does wonders to create an experience that is hard to find anywhere else, and, given the economy of south brooklyn, it might even defy logic. \n\nlooking back, if one was to propose opening a café in a neighborhood that doesn't get much foot traffic, placing it adjacent to a woodshop / design studio for the auxiliary purpose of using the café as a showcase for the design work, one might have a few questions. \n\nbut not only does building on bond pull it off, as evidenced by the crowds and the expansion of the concept, but the café and design studio also serves as a model for how other creative outfits can build an experience around their work.\n\nwith this in mind, i've taken numerous friends to building on bond to inspire them. suffice it to say, i'm a big fan.\n\nmoving on to more tangible issues, such as the dining experience: in a way, the food and beverage are a reflection of the café's décor, which favors hearty and robust natural elements with a touch of industry. it's comfort food done with a hint of flair and finesse. lunch dishes are predominately satisfying while the coffee is definitely decent. in the evening, the cocktails are not dainty; rather, they are fun and inventive. all around, customer service is certainly a strength, especially if you are a regular, but still can be a bit spotty at times. \n\nmy favorite aspect of the space is the décor: woodsy, industrial, practical and whimsical. 1940's era lighting, utilitarian work-tables and benches, metal file cabinets in olive green hues, beat-up wooden floors, as well as an unusual assortment of rigs and clamps that hang from the ceiling or are mounted on a network of exposed water pipes.\n\none caveat for the laptop-toting day trippers: wifi is turned off daily at 4:30 pm, and, it should also be noted that their wifi is very unreliable to begin with. so it goes.", "author": "christian svanes k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-27", "description": "Came here a bit later on a Friday night with 2 other couples. Venue is very cute and quaint. Sat in the back room, loved the wooden details. There is also outdoor sidewalk seating which seemed nice. There was a brand new menu so the waitress couldn't offer much guidance. However, everyone was pleased with what they got. My main complaint was that the menu was pretty limited. It only had about 6 entree options and maybe 6 appetizer options. Entrees were basically one option for each type of meat. So if you don't eat everything, your meal is basically chosen for you before you sit down. My husband wanted vegetarian so they made him a mixed veggie plate, which wasn't on the menu. I would go back but would have to check with my company on their food limitations first to make sure it's worth it.", "author": "Phoebe C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-28", "description": "Physical space and food were excellent.  However...The wait staff has not been trained on basics.  Truly terrible service.  They have pleasant affect--but leaving the table for 20 minutes without returning for drink refills.  Dumping plates very loudly into bins next to the table. General lack of attention.   I will not ever eat here again.   Plus--they were out of chicken, out of veggie burgers...and of the four diners--two plates came out a full 5-8 minutes before the other two plates came out.  Just simply bad service.  Thank goodness the food was good. Otherwise a terrible experience.", "author": "Kay H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-07", "description": "This place is right down the street from me, so to me its my top notch neighborhood joint. Great atmosphere and decor (they do interiors, see the adjoining but separate shop). They brew and sell La Colombe coffee which I am also a fan of. The outdoor seating during the warmer months cant be beat and the service is good. I know they give doggies treats if the animal is extra cute...Food/brunch is so-so but thier fries are pretty great.", "author": "Jackie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-07", "description": "After a dinner a big group of us were looking for a place for a few drinks. Our initial thought was Brooklyn Inn, but because it was Saturday it was so packed it was obnoxious just walking in and walking out with our unwieldy numbers. So we backtracked to Building on Bond and took over the empty room in the back and played Apples to Apples. \n\nThe space was perfect for a group and I was fascinated by the odds and ends on the walls and tables. I wouldn't come here by myself, but with a few friends it was great. Good taps and board games! what else does a person need on a Saturday night?", "author": "G L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-09", "description": "Went here with friends.  We were there for brunch and really enjoyed ourselves.  We did have a bit of a wait, which was midly annoying.  The food was excellent.  I devoured my pancakes.  My husband really enjoyed his breakfast sandwich too.  Highly recommend this place.", "author": "Melissa O."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}