{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-16", "description": "Love the tavern feel and the warm decor. The server wasn't very attentive specially since there weren't that many people out.  I found the Pat la Frieda burger to be boring and not much better than some diner burgers. On the plus side the ladies did like the desserts though.", "author": "Cesar I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "Came here for a pastry/coffee breakfast. I had a waffle, it was good. Mostly I liked the atmosphere - felt like an old printing press somehow. Coffee and waffle were both good so if I am near by, I would certainly come here again.\n\n(I edited this because I initially gave it 3 stars, I meant to give it 4)", "author": "Chelsea K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-18", "description": "I've been walking this place for years for no reason then when I pass by I'm usually en route to the gym or train. Finally popped in for lunch one day. I had the cobb salad and was impressed. The chicken was flavorful and moist.", "author": "Isaiah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "Chill place for a July fourth drink before heading to all American party. Ludicrously cheap in happy hour, $7 for two good beers. And the lovely Araminta was serving. All is well here", "author": "Adam G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-06", "description": "I was so excited to try this place since I have passed it many times. I was so disappointed. The coffee was just ok, the dish I had (veggie burger) was terrible. The fries were good. Service was nice, but very slow. Food took a long time too, and they weren't that busy. I want to maybe try in the evening to see if it is better.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-11", "description": "I was slightly disappointed with my experience here. A friend had recommended this restaurant so I had high expectations. Even though the restaurant was nearly empty, we were sat directly next to another couple. \n\nMy food was wonderful. I had the salmon with wild mushroom quinoa and scallion oil. It was a huge portion and I was very pleased. My husband's food unfortunately was not up to snuff. He ordered the flat iron steak medium rare. It came out well done and was very tough. It was obvious that it wasn't a great piece of meat.", "author": "Nikki D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-30", "description": "Winter's here!* So grab a seat at the bar and order a hot toddy or a spiked cider, or any of the other wonderful warm drinks you can get served in a mug. Just like at Grandma's house. If Grandma were an alcoholic with a knack for mixology.\n\nSpeaking of, the regular cocktails are pretty damn good too. The Beehive (first on the menu) is solid.\n\nBut be foreward that last call will sneak up on you at this place (around 12:15 on a Saturday), so arrive early to get the most out of BoB. The stools in the cozy ante-dining room aren't too comfortable either. And also, beware of a seemingly homeless man who's free to wander the premises carrying garbage bags of miscellany. Legend has it that he's a regular.\n\nThe waiters/waitresses are also very nice.\n\n*Winter may or may not be here. Note that If you are reading this review not in winter, just find + replace \"warm\" with \"crisp\", and \"cozy\" with \"cool\"", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-13", "description": "I came here on a Sunday with some friends for brunch and had a terrific time. The mimosas and bloody Marys were big hits at our table. I really enjoyed the Cobb salad, which was full of avocados, hard boiled eggs and tomatoes. It was perfectly portioned and tasted so fresh. I also sampled the pumpkin spiced pancakes that a friend ordered. I'm not usually a pumpkin spice kind of girl (except for the occasional piece of pumpkin bread), but I liked these a lot. A nice reminder that fall (and cooler weather) is coming. I think the only issue was that the waiter added an extra drink to our bill after accidentally giving one of my friend's the wrong drink. Despite that, I'd still come back -- the Pimm's cup sounds spectacular!", "author": "Jenny H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-12", "description": "This place sucks. Food is nearly inedible and their drinks are a straight rip off. About a year and a half ago I came in and ordered two hot chocolates with a \"little bit\" of Jameson and Baileys. $64. I pleaded with the server to no avail.\n\n\nSo I boycotted until today. Came in to get a Bloody Mary for my hangover. They measure one shot for their bloodies.\n\nFool me once, shame on you..", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "This place may have just become my new Brooklyn booty call .Yeah.... The meal was that good\n\nCocktails, Wings, kale, Cobb, old bay chicken and this blazing hot mini skillet with a gooey chocolate chip cookie with ice cream literally made my night. I HIGHLY recommend", "author": "Lisa P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-19", "description": "I had the same reason for coming here as everyone. Looks like a nice, small local place to grab some dinner at. \n\nOrdered the Korean buffalo wings and they were raw on the inside and even more insultingly, not very flavorful. My girlfriend ended up having terrible nausea and diarrhea that forced her to stay home for two days.", "author": "Patrick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-03", "description": "This should be everyone's go to place. Warm, inviting, great beer, wine and cocktail options. The menu is great too....from the classics to the specials. \nFeels like a second home here...truly the best of Brooklyn in Boerum Hill!", "author": "Kerry R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "Looking forward to being a local - great atmosphere. I stopped in for a couple of beers around 11.15p. Kate was a gracious conversationalist!", "author": "Chicken H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-13", "description": "I always stop by here after dropping my laundry off across the street for some bonding time with my kindle, a cold beer, and an occasional snack.  (In fact, this place is usually my incentive for actually dropping off my laundry in the first place.)  \n\nThe staff is great - around when you need them, but not disruptive of the chill vibe by constantly harassing you to see if you need anything or bringing the check as soon as you put down the fork to get you to leave.  \n\nIt's also so cool inside - very cozy and vintagey without overdoing it...and I have serious respect for any Brooklyn establishment that can pull off cozy/vintage without overdoing it!  Haha\n\nOverall great spot!", "author": "Jaime G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-28", "description": "Great neighborhood place to meet up with friends when you want something friendly (and want to get out of the City!)\nMet up w a great friend from High School and we both enjoyed our meals and sides!\nShe had Cobb salad and I had the mac and cheese -- so SO good - tastes like my Mom's homemade! \n The only thing I would request are a few more vegetarian choices, and perhaps one or two very sinful desserts! (then it would get six stars!)\n Love it and going there again tonight for another meet up!\nExcellent service, clean, mellow - oh also very close to the LIRR for manhattan and/or LI folks!", "author": "Vanessa P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-18", "description": "HI Phil:\n\nWe had the wings (6 to be exact).  My co-worker had a burger and fries and I had the chicken sandwich and fries.  I found the meat on the bread to be very small and the sandwich and fries very small.  I'd compare it to a kids meal along with the 6 wings.  The drinks were veery good though!", "author": "Ronsheeka H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-05", "description": "I have mixed feelings about Building on Bond- the space is really charming, the staff is unbelievably friendly and attentive, the menu features reasonably priced food, and it generally feels like a laid-back neighborhood spot.  \n\nBut honestly, everything we tasted was just a little, well, underdressed - a little too simple, a little too flat.  And these are all things that are so simple that they should shine. Take the chicken sandwich - how hard is it to jazz that up? But what I ended up with was too-hard bread (roof of mouth should never be cut by bread!) and tasteless, dry chicken.  And I wasn't the only one who ended up with a dry sandwich - the turkey sandwich was just a bit tasteless. Or take the pasta with pesto - it really is just pasta with pesto.  Simple, yes, but maybe a little too simple.  All of this to say, I want to love this space- it's really adorable- I just wish the food could sparkle a little bit more.  I mean, dunk that chicken in some pesto. Or sprinkle some salt and pepper on it.  Something.  Everything just needs to be sharpened and refined a bit here.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-13", "description": "Of all the places in this area, this one has the most average food. Whether it's a sandwich or salad, mac n' cheese or fries, it's all fine -- but nothing spectacular like I'm used to.\n\nWhat is great is the service, everyone here is super nice and speedy. The lighting is romantic (good to grab drinks with a date?) and it's close to plenty of trains.\n\nI hear happy hour is good -- so maybe it's worth a trip again.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-30", "description": "They don't honor reservations, so I can't comment on their food because my time has been wasted and I'm still hungry. Next...", "author": "Nada H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-04", "description": "I came here for dinner last night with a friend. Mine: charred kale salad with butternut squash chunks and cider vinaigrette and the mushroom quinoa as a side. While the charred kale had a nice flavor I wish there were more and larger chunks of squash. The quinoa was a nice-sized portion as a side. Service was fine and the waiter was kind enough to charge my phone. So why only three stars? The food was good but not amazing and served lukewarm. My friend liked her roasted green beans but didn't rave about them either.", "author": "Jennifer S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}