{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-03", "description": "I came here recently with friends and the food was excellent. I had the cauliflower and poblano soup, burger with hand-cut fries. Soup was creamy and full of flavor. The burger was moist/juicy and cooked perfectly. \n\nWe also shared Japanese chicken wings and Brussels sprouts. The chicken wings were big and extra crispy. Sauce was spot on too. The sprouts were roasted to perfection and had the right amount of seasoning Parmesan cheese. Tasted great.\n\nService was on point too. Convenient location, great food, chill vibes inside. I'd definitely come back again.", "author": "Ahmed M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-26", "description": "Updated 5/26/19 \n////\nShittiest most terrible brunch ever. AVOID LIKE THE PLAGUE. negative. Waited an hour for our food to arrive. And it was gross and not cooked to our specifications. LAME. Now at another restaurant to find food.\n////", "author": "Alex M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-09", "description": "I thought this place would be really good since its always packed. Though its not, food is way average and over priced. \n\nWe didn't care for the mac and cheese with bacon. The bacon wasn't crispy and for some reason the whole dish had some sort of sterile or soapy flavor. Like they just washed the skillet with soap and water and poured the mac and cheese in. \n\nWe also ordered the chicken, which was overcooked and chewy. The mash potatoes were good though. We ordered a side of fries, fries were average and nothing to rave about.\n\nI did like the atmosphere. Very Brooklyn chill, and that made for a nice double date. \n\nNothing great about the service. We had to ask twice for a side of mayo for the fries. And thought the waitress was rude in the way she asked for my drivers liscence.\n\nPretty cool bar they own next door though. Good cocktails and they play some interesting music on Saturday night. Crowded and small though. If you can get a seat then its fine.", "author": "Marisa M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-18", "description": "As a long time local I felt obligated to warn others of the declining quality of this sinking ship. As other reviewers have noted, I also had an strange experience last weekend at the \"shrieking shack\". A loud yelp was cried out by what I assume to be the bartender. At first my heart skipped a beat thinking a horrific burn had occurred but I was disappointed to learn it was just because tensions couldn't be contained between the waiters in the room.\n\nAs far as the food goes, I had my usual egg sandwich with a side of sausage. Now one would think this would a be simple request in the culinary world, but apparently it was too much to handle on this particularly dreary day. While the eggs were perhaps pedestrian as best, the sausage left a taste in my mouth that one could only describe as dry cardboard. Completely overcooked, under-flavored, and uninspired. \n\nLook, like the rest of us, I just want to see this local joint survive and thrive, but instead I'm left wondering if we owe it to our neighborhood to put this old horse out to pasture.", "author": "Christopher M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-06-01", "description": "Went here on mother's day for with my fiance's family. We were a bit early for our reservation so we hung around the front and were able to get a couple of drinks .. I got a chai latte which was very good and in a large bowl style cup. They had the music blasting in this front part of the restaurant, luckily when we were seated we got tucked away into the cozy back room of the restaurant. We all ordered a drink and then entrees. The service was slow, but I can appreciate it was a busy day. However , we were disappointed because they seemed to have a smaller menu out for mother's day and it was missing a lot of things on the original menu which we looked up prior to choosing this restaurant. My future father in law and I both got the cheeseburger. Mine was just okay and his was served cold. Will have to give this place another chance on a regular day.", "author": "Kayla J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-26", "description": "Food is just great. Try portebello mushroom and the trout! The octopus is so soft and juicy. Shishito pepper tasted like it was from a top Japanese joint.", "author": "Rocanovasta G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-18", "description": "Shrieking Shack\n\nI've come for brunch a few times before and have always been satisfied. This past weekend however, I had the weirdest experience here. There was some sort of altercation between the two barista/bartender ladies behind the counter, which resulted in one of them letting loose a bloodcurdling screech. Everyone looked up from their meal to see what was going on. At first I thought one of them may have burned herself, but instead they both just looked pissed and were carrying on as normal. I overheard someone ask the waiter what had happened, and he said, \"We just got a rush of customers, so tensions are high.\"\n\nHm. Weird that this place can't handle a semi-busy brunch hour with any semblance of professionalism.  (The place wasn't even full.)\n\nOn top of that, the food has gone way downhill lately. My \"fried\" egg was so runny that not even the egg whites were cooked, and were a mucousy mess. My boyfriend ordered the blueberry pancakes (+$2 for blueberries) and they were just plain pancakes with about 5 blueberries dropped on top. The sausage was pink all the way through, so we didn't risk eating it.\n\nThere were tons of families and kids, which is nice! But it makes me think that this restaurant relies on a loyal \"locals\" crowd and has given up putting effort into its meals or service. I used to like this place-- really disappointing.", "author": "Maria L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-12", "description": "I was shopping in the area with a friend and we became desperate for a nice place to take a break with some wine and eats. We happened upon Building on Bond and were really happy that we did! The atmosphere was cozy and comfortable (we sat outside, it was a nice day) and the server was very friendly. It reminded me of the type of places that we had in the Greenwich Village of yore. Great wings!", "author": "Vicky M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-19", "description": "The food was just plain gross. The shishito peppers were inedibly salty, the Mac n cheese tasted soapy and the medium-rare burger came raw and cold in the center. Many better restaurants in the area, skip building on bond.", "author": "Zoeth F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-04", "description": "This used to be one of our neighborhood places but the quality of food has nosedived. Overpriced for the fare - it is such a beautiful place.\nSteak Frites $26 we're overdone and chewy, burger was charred and fries done in old oil. Fried chicken chewy like cardboard.\nPlease, make it good again!", "author": "Sascha H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-02", "description": "Was looking forward to trying this place cause it looked super quaint inside (which it is). Unfortunately our server had some attitude and they seemed to forget about us a few times (never did get the coffees we ordered). The food was fine, but nothing you can't get anywhere else.", "author": "Luolin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-16", "description": "So fun! The food was good for what it is I think that the price point is a little high maybe by a few dollars but the ambience is nice and we had a comfortable Tuesday night late dinner!", "author": "Daniel E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-15", "description": "I got the veggie burger and it was kind of dry, and the relish on the side didn't make sense with the flavors. They serve too many fries. \nA lot of $ for not enough umph. \nGood wine selection tho.", "author": "Flora S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-05", "description": "Had dinner here for the first time last night and truly enjoyed my meal.   I had the Old Bay Fried Chicken sandwich which had a very good flavor to it.  The homemade French fries were excellent as well.  My girlfriend had the Omelet of the Day for dinner which also was incredible - actually wished I had gotten that instead of the chicken.  \n\nI would definitely come back to this Brooklyn spot in the future.", "author": "Marc L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-17", "description": "Visited here for lunch on a week day and was cery surprised how packed it was. The restaurant is pretty large, it has 3 distinct sections. I was in a rush so I ordered the old bay fried chicken sandwich with a side salad. All and all the food came out quick and wasnt bad. The chicken sandwich was cooked well. I thought it would be saltier because of old bay. It could have actually used some salt. The salad was standard balsamic salad and a good sized portion. Id come back for the great decor especially at night. Its quite charming inside.", "author": "Charles K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-17", "description": "Arrived for brunch. Really nice ambience and comfortable decor. Typical cute cafe. Two farm eggs with sausage was something particularly special. Fresh and Tasty. Ask for toast with your eggs!", "author": "Dimitrios K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-17", "description": "We ordered eggs Benedict and Irish breakfast - the food is great! But the service is meh. First of all they seem to have not enough waiters. We waited ten mins at the front door with no one to take us to our seats. After we placed the order we waited again for like half an hour for those two dishes only. The waiter said it's too busy but it's almost two on the Sunday afternoon and most people have left. (For such a small street corner storefront cafe it's just not reasonable to have so many seats but so few waiters, and the lady at the next table almost tripped and hit my back because there's not enough walking space). After we got our dishes we found there's a missing sausage and we were told they ran out of it only after we asked (but they refunded us in the end so that's alright). The problem is just the dining experience.", "author": "Shengyi X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-16", "description": "Local hang for coffee, lunch and/or cocktail.   Friendly staff, great food, relaxed atmosphere.   Tables outside on quite block are wonderful as well when weather permits.", "author": "Geoff W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-02", "description": "Came for a bite to eat and was very disappointed. The food tastes bland and underwhelming. The burger was tasteless, mussels were fishy, salad was simple. I would not recommend this place to eat. If you want to grab a drink at the bar but that's about it.", "author": "Luisa D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-04", "description": "I still really like Bob because it has amazing real estate. Set on a quiet corner in Carroll Gardens. However the recent menu changes are awful. \n\nOne reason I kept coming here was their Brussels sprouts. Charred to perfection they also were infused with the flavor of jalapeño peppers and some kind of amazing sauce that all added up to the best Brussels sprouts I've had. \n\nWell I had to ask the waiter tonight what exactly was wrong with them. They seemed drier and less tasty than usual. I asked him what happened to the jalapeños, assuming they ran out. Then I found out the bad news that they changed the recipe. It tasted like the dried out bottom of the pan.\n\nThey still had some kick, and I still think they were cooked well, just dry.\n\nThe veggie burger and fries remained the same. But they changed the bun for the worse. I still love the place but I really don't want to say it, but, sadly, I won't be coming back as frequently.", "author": "Judd S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}