{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-07", "description": "Love this place. Its around the block, has outdoor seating you can bring your dog. I love the BeeHive drink and the B.O.B. Burger which has ground beef \u0026 chorizo. \n\nLast night I came with a friend and ordered the NY Strip Steak. Not only did this steak take 1 1/2 hours to come out (no joking, I needed to ask several times where it was), but when it came out it was a shell steak, fatty around all sides, a weird palish grey color, and instead of being cooked medium (and pink) like I asked, it was well done and the inside was the same color as the outside. It wasnt seasoned very well either, but I was so hungry I ate it anyways. The Portabello mushrooms served as a side with the steak were actually amazing and much better than the steak itself. Stick to the B.o.B burger, I will never be venturing away from it again", "author": "AJ K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-28", "description": "Been here once. Had the veggie burger, which I heard was good. It was my first veggie burger ever. It didn't taste bad. It didn't taste at all really. There was no sauce either, and there should have been. I want to return to try the coffee or just for some beers. \n\nnot complaining, but The decor/atmosphere is strange, like they're trying to hard to be a place from a long gone decade, and that's probably intentional.", "author": "Emmanuel I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-09", "description": "Overall, I am a fan of BOB - the house wine is great at $6/glass, the portions are pretty good, but the experience going two different days - one a Wednesday and one a Thursday was so different that I am going to recommend BOB only for early days during through the week.\n\nI like what Building on Bond offers - unpretentious food at pretty reasonable prices. I like the early to mid-week crowd - it is quiet, laid back and not pushy or over-the-top. I get a salad when I go, generally the arugula, with nuts and beets and either avocado or natural chicken. I will get a glass or two of the white wine and sit and chat with nice people.\n\nWhen I went once on a Thursday, what I got was a louder than expected crowd, the place was packed (even after 10 pm) and the servers were clearly having trouble keeping up.  This was evidenced by my salad which came with cheese, which I couldn't eat and far too much dressing.\n\nMy friend luckily got his burger done to perfection, otherwise I would've been one unhappy camper, but it was a good test that the order came out that much differently.", "author": "Kirsten P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-05", "description": "Building on Bond was such a surprising disappointment. I've lived in Fort Greene for two years, but hadn't been; I regarded BOB as a sure bet for an amazing meal that I'd get around to eventually. \n\nFriday night, around 9 PM: we're seated right away, in the middle seating room. My first impression was that the seats are too high for the tables - my thighs were almost pinched between the table and the chair. Such a small but annoying thing. \n\nWe jumped for the cocktails on special - mine, a vodka/watermelon/lemon mix; his,  the \"beehive\", a summer-version Old Fashioned. Great, except they took 15 minutes to arrive (no exaggeration)! I understand waiting awhile for my drink at a cocktail bar, but this is dinner. Drinks should be prompt. \n\nWe ordered a couple of appetizers, \"mini\" mac 'n cheese and meatballs. Mac 'n cheese was phenom, which I had rightly anticipated. \n\nIn the middle of our appetizers, our entrees arrived. Again, such a simple, easy thing to get right--and so annoying to get wrong. My entree salad was one of the least appetezing things I've ever had put in front of me, and his chicken sandwhich looked boring and tasteless too. \n\nTwo stars. One for the cocktails, which were amazing once they actually arrived, and one for the mac 'n cheese. Superb. \n\nBuilding on Bond, I know the neighborhood loves you, but I won't be back.", "author": "Melissa R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-10", "description": "I was pretty unimpressed. The food was bland, I tried the breakfast sandwich. My boyfriend had the pancakes, they were also nothing special. So many better places, I'm not sure why this is so highly rated. The service was slow... I wouldn't come back here. \n\nThe one thing that's cute about this place is the street corner that it's on.", "author": "Andrea Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "we are a family of 4 and have been coming to BOB since its very beginning.  The food was satisfactory but the vibe, the music, the beer on draft, the staff and clever carpentry of the place was the draw for us.   We have a sunday dinner ritual ( especially in the winter) of eating at BOB.\nwhen I heard the food was going to be changing, my reaction was hmmm good idea, it could be better,  and because the neighborhood is definitely changing I could fully understand the need of BOB to \"upgrade\" their offerings.\n\nWe are very pleased with the changes.  The fish is excellent!  When I saw the loss of french fries on the menu I was disappointed but the replacement potatoes is absolutely perfect.  My husband really likes the shrimp, my daughter who will not eat anything loves the burger and my son has been eating there regularly all summer with not one complaint.  The beer on draft is still fantastic and now the wine menu has expanded.\n\nWe are still loyal customers.  It is a wonderful neighborhood standby and now the food matches the hospitality that they offer.  If you have never been to BOB it is worth a visit.  I have recommended it to many friends and never had a complaint from anyone!", "author": "Susannah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-06", "description": "Fabulous place. Great veggie burgers and fries, and excellent service. I'll definitely be back!", "author": "David G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-12", "description": "My favorite neighborhood place. Whether I am getting coffee in the morning or a drink at night I usually go to Building on Bond. My wife brought our daughter there the weekend before Halloween for breakfast and they had pumpkins out to carve for people. How cool is that!\n\nStaff is great. Definitely a place to stop in.", "author": "Seth R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-28", "description": "This place is coasting by on its location and good looks. The food is nothing special and most items are overpriced by a few dollars.  Entrees like the chicken or zucchini parm don't come with sides, then the sides cost another $5 or 3 for $12--Chintzy. At around $12, the burger is priced toward the higher end of burger prices and according to the burger aficionado in my life, it does not command the price. (No claims are made as to the sourcing/quality/happiness of said meat, so it's not that jacking up the price.) \n\nLast night, my old man and I went here reluctantly because we didn't want to venture far in the cold and Mile End's wait was (very deservedly) too long. We'd each had a few unimpressed visits to B.o.B., but I agreed to go one more time hoping this would settle it once and for all (it did), adding \"we better see someone famous\" (we didn't, this time). \n\nOn a Saturday night there were numerous open tables and those occupied hosted other couples in the same boat as us. Yet despite the relatively light crowd for a weekend, service was still disorganized and confused. It took too long for what we got. The swordfish special was $27. Really?! I am not at all confident they can pull off an entree worth $27--but maybe a large chunk of that price was because it came with a side of broccoli rabe. My husband's pretzel bun was dry. And just--eh. \n\nNo reason to do this again when there are so many better choices. I've never gone there for brunch, but based on dinnertime visits, B.o.B. is aaaaaallllll location.", "author": "Colleen K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-07", "description": "Reliable neighborhood joint.  Decent food and drinks, pleasant decor of recycled materials that seems to be de rigueur for funky Brooklyn boîtes these days.  It has a  friendly staff and very pleasant sidewalk seating.  A good default if you live near Atlantic and Hoyt and don't feel like walking too far.\n\nBottom line: nice place.", "author": "Swami D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-23", "description": "I want to like it more, but I just don't.   I like the space, love the location, but every time I eat here (5-6 times) for either brunch or dinner, I always find that the menu is a little less interesting than I want it to be and I settle for something that is decent but not great.   I've never been \"wowed\" by anything there, just content that their burger is solid and I have nothing to complain about.", "author": "Brad K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-29", "description": "Great pecan, cranberry french toast. Very packed and very close tables. I like to dine w. my friends, not yours! \nSpread the tables over guys!!", "author": "Rustygirl M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-28", "description": "I wasn't thrilled with BoB, but there were definitely some tasty dishes. Here's what worked and what fell flat:\n\nYum:\nYellowfin tuna steak- nice little round with a great sear\nTomato lentil salad- warmish with great acidic flavors, and not too tomatoey\n\nYikes:\nPulled pork sandwich on a pretzel roll- I love pretzel rolls, but that was the driest roll I have ever tasted\nSalad- boring\n\nI feel like there must be something better than what we ordered, but I was not too impressed. I'd be happy to order the tuna and lentil salad again, though.", "author": "Kirsten S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-06", "description": "I was not impressed by this place one bit.\n\nI ordered a yellowfin tuna dish with lentils and swiss chard and not a single part of the dish tasted fresh or felt warm like it had been cooked recently.  It gets pretty crowded in here so they obviously have a following but it seems like more of a bar hangout spot with snack food than people enjoying actual meals on the weekend.\n\nAlso, the waitresses seemed uninterested on a Saturday night that my tuna could barely be cut with a knife because it was cooked so well done and instead with the fact that a local celebrity was sitting by the bar.\n\nCould my dish have been the unlucky one of the day? Yes.  Would I go back? No.  Why? Because everyone should feel like a valued customer even when they kindly complain to you.  Also, the pretentiousness of the customers is pretty distracting.", "author": "Daniel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-26", "description": "This place is fantastic. The staff are amazingly friendly and accommodating, the food and drinks are great and the ambiance is simply cool.\n\nBuilding was  recommended to us by a local as they have free wifi and needed a place to camp out so we could collaborate on a project. Great recommendation!", "author": "Martin G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-06", "description": "Had the English breakfast, minus the meat. It was interesting combo and a generous amount of food", "author": "Howard B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-03", "description": "Brooklyn brunch! Good food, average prices, decent service, crowded crowded crowded. Slight bias since we had to sit outside on a chilly windy day. Benedict was made properly. Nicely poached egg served as a sauce for the rest of the dish. A health  goblet of bubbly. Kinda wished they didn't have tables right beside the entrance. I don't care for slabs of door hitting my person or the back of the chair. Great location and decent food. Would like to come back to try something a bit less pedestrian than benedict.", "author": "Kris B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "I think this place is a great neighborhood spot. It has a little of everything and is a good place to hang with friends or by yourself. It has great vegetarian options, outdoor seating and is really cute on the inside. I wouldn't say it's mind blowing but is very satisfying. I thoroughly enjoy all if the dishes I have there. Sometimes the service is less than speedy but not always hence the lack of a 5th star. \n\nGood for a neighborhood bite with friends, kids, dogs or just yourself.", "author": "Victoria c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-28", "description": "I've been coming to this place for years on a regular basis, whenever i can't immediately come up with the best spot out for a particular plan.  It is incredibly versatile and yet never disappoints.   I've been here for lunch dates, brunch hangouts, dinner dates, work sessions, pub quiz, just to grab a couple of drinks at the \"bar\" and just to grab a coffee to go.  It always serves.\n\nThe years I was doing consulting, I nearly lived here.  I brought my lap top and worked while chowing down in their back room (they even let me in their when Anne Hathaway appeared and requested the space solo).  My go-to is the chopped summer salad, with salmon (which is something you now have to ask for specifically because only the chicken is listed on the menu).  That salad could not be improved upon, and is a perfectly chopped and mixed, with an well balanced array of elements.  YUM.  Additional favorites are the chicken sandwich, a number of their soups, and of course the mac n cheese.  Their drink menu is great also, and if you sit at the bar you can chat it up with the bartender who will customize whatever.\n\nThis place truly is a neighborhood anchor.  I'd also say that their is one particular waiter who is always incredibly friendly to everyone in the restaurant, calling people \"gorgeous\" and just really checking in the regulars to see how life is.  Love it.  Also, if you work in the film or tv industry this place is an industry peach.  Not sure why, but I seem to always run into well know actors or end up as an extra in a commercial for Bravo...\n\nThis place fits every out of the house food/drink need.", "author": "Gillian C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-23", "description": "I really want to give this place four or five stars as I have always enjoyed my food here. But alas, I cannot. I used to come here for coffee every morning but had to stop because of the nasty attitude of one of the baristas. Everyone is always so pleasant except for him. Frat bro looking dude with brown hair. Please for the love of god go get a job somewhere that isn't in the service industry!", "author": "Joseph M."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}