{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-23", "description": "BoB is a sweet, easygoing place with great cocktails, good music piping through, and great service.\n\nMy office hosted our end-of-year gathering at Building on Bond. The space was perfect and our waiter was incredibly attentive and present. The food is great, too!", "author": "Anna P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-04", "description": "Building on Bond is certainly a nice hang-out and can't complain about the bar. However, despite a limited but interesting-sounding menu they frustratingly come up short really delivering on their food. \n\nI've had a couple of the sandwiches and a few breakfast items and always come away a little underwhelmed. The turkey sandwich sounds good and comes on their nice multi-grain bread. However there is not much turkey to speak of on this and the quality is just middling. The veggie burger is a nice patty and topped with a flavorful sun dried tomato spread. However it is overpowered by a substantial bland brioche bun that really detracts from the whole. Seems like this would be much better on a pita or thin ciabatta or something. The brunch egg dishes are just kind of average. \n\nThe overall impression you get is that the food is kind of an afterthought here though it seems with a little more care and a few tweaks this could easily step up to another level. Would not hesitate to recommend as a nice place to meet and have a beer particularly out under their shady awnings but I'd say grab a bite elsewhere first.", "author": "Henry M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-23", "description": "We live around the corner and used to think this place was a great neighborhood spot. A few consistently poor visits and we will not be returning. I had Lukewarm salmon eggs Benedict accompanied by strange tasting hollandaise with a limp, un-toasted English muffin. Bland and flavorless. My husband's 'pat lafrieda' burger was overcooked, burned and tasted like it came out of the freezer. We would have complained but our server forgot about us and was rude to begin with. Unfortunate service. Is this place under new management?", "author": "Abby B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-24", "description": "Love Ya BoB but you really need to revamp your menu. You've become too hip for your own hipster good and you've really let the essentials and basics take a nose dive.\n\nI've been a huge supporter and a regular.  I call you my \"Regal Beagle,\" but your brunch is good, coffee great, cocktails on the money, but your midday and dinner menu blows already. \n\n It's time to live up to your awesome interior design with a kick ass menu and chef. You're losing me here.  Your employees are quirky but cool. Keep them, but tell them to smile. The hipsters have nothing to be mad about. \n\n I'm rooting for you BoB.  Shake it up. For now, I could really only suggest this as a drinks spot at night and a jam packed impossible brunch to get into.  I'm not frequenting as much in favor of joints with better vibe, less crowds and better meals.", "author": "Foodie Mamma X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-16", "description": "BBQ pork sandwich was delicious!  The side salad was pretty standard, and the we shared the Mac 'n Cheese with bacon...which was rich and creamy an exactly how you imagine it should be!  Great outdoor seating and a friendly, vibrant waitor made this lunchtime find a great Brooklyn experience.", "author": "Lisa R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-02", "description": "Nice, cosy place! Very kids friendly and the service is always polite. \nThe food however is unequal. I like their mac \u0026 cheese and the veggie burger.", "author": "Calliope C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-05", "description": "I live a literal 1-minute walk from here so I've been numerous times, and every time I go, I'm less and less impressed. Cute if confusing decor, but man is their food the mediocre-st of the mediocre. Typical Brooklyn menu with typical (read: slightly and unnecessarily inflated) Brooklyn prices, and you will leave saying, \"Yup, that was food.\"", "author": "Kate Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-28", "description": "This place is great on paper. Based on the location and the general decor, I want to love this place. I've been there a few times and every time I go I think, \"Maybe this is the time that I'll fall in love with it.\" Hasn't happened yet.\n\nCase in point - the Black Friday sandwich: house-roasted turkey, homemade stuffing, cranberry sauce and mayonnaise on cranberry pecan, warm gravy. Sounds amazing, right? When i read that description I expected a really great sandwich. It was OK, but definitely not as good as it sounded on paper. Turkey was a little dry and flavor was on the bland side. I even ordered it again the next time I came hoping that I caught it on and \"off-night\" the first time. Nope. Tasted exactly the same.\n\nIt's a good place to grab a drink and sit outside when the weather's nice, and they have some good happy hour specials, but the food and drink are just not as good as some of the other local spots (i.e. Bijan's).", "author": "Roy K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-20", "description": "Hey Bob, lets open a restaurant and spend way more time and energy on the kitschy decor then the food.  No-one will notice when they're choking down our bland offerings!\nGreat idea jim! Also people will just come in and eat cause it looks cool, it wont matter if they don't come back because we'll always get new suckers!!!!\n\nAlso, i have this great idea for brunch instead of making real home-fries, what if we just take french fries mix em up with some stuff and then steam them so they form into a nice puddle.\n\nJim, you are a genius, you should obviously be head chef or at least a dishwasher.\nWow our place is gonna be awesome!", "author": "Ian K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "They have a couple of gluten free beers but the menu is lacking. If you vegan or vegetarian I'd look elsewhere. Although, my friend seems to like them and he's a foodie. They have an unlimited oyster night. So, I guess if you like meat, then you'll dig this place. I've given them four stars to be fair.", "author": "Leah W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-19", "description": "Great food, friendly and helpful service, inviting atmosphere, and a wonderful owner named Phil. I highly recommend this restaurant.", "author": "a k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-08", "description": "Excellent food, low key atmosphere, and great service. The burger is best in the neighborhood.", "author": "Jared G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "Building on Bond (BoB) has been our local pub for the past three years. We love the atmosphere and interior of BoB. The only thing we had an issue with was the food, which was just okay. We were very happy to hear that they hired a new chef who put together a new menu. \nI'm scratching my head a bit about these other recent reviewers who are saying they miss the old food, and how great it was. It's very safe to say that the new food is MUCH better. I've tried three or four of the dishes on the menu, as has my husband. I've ordered the trout plate a number of times, and it's excellent. BoB still has a great vibe and great beer on tap, but now with the added bonus of good food, it's definitely a winner.", "author": "Deirdra J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-11-07", "description": "The linguine is delicious. I get that with a Pimm's Cup, and I'm a happy camper. \n\nCan't wait to try the brunch!", "author": "Stacey P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-29", "description": "Let me cut to the chase: there was a dead cricket in my salad. Why am I giving Building on Bond two stars? The brunch special in which I found this dead cricket was creative and delicious, except for the cricket. That was really disgusting. The waiter did right by me by comping my meal. But the cricket experience came after one of Building on Bond's old-school stools collapsed, which meant I actually kind of hurt myself before my meal began. The staff's response was sort of dismissive. When I asked the waiter to ensure our poached eggs were cooked runny, his response was also sort of dismissive, and sure enough our egg yolks were overcooked. I won't be returning.", "author": "Amy B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-24", "description": "Been here a bunch of times. They have a great location in the heart of the Boerum Hill neighborhood, and good outdoor seating for when the weather permits. The decor inside is vintage and cool. I would say atmosphere and location is probably what they have going for them the most. \n\nMost of the food is average, sandwiches in particular. I got the mussels once, which I wouldn't get again. I did have a very attractive bagel lox and cream cheese for brunch one time which was surprisingly delicious. The lox was plentiful and of excellent quality. Sitting outside on a nice summer day with that and a bloody mary, what could be bad? That was by far the best experience I had with them. Other than that, probably won't be returning.", "author": "Sara K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-25", "description": "Found us a new brunch place. :)\n\nFirst off... service was excellent from our waiter Tom. I hope I'm remembering this chap's name. He was friendly, attentive and casual but efficient. \n\nOn Tom's recommendation I had the Huevos Rancheros. Mmmmmm tasty! They are smothered in tomatillo sauce and have the right amount of spicy. \n\nThe menu has great choices and the drink list looked good too. Definitely going back. \n\nminor suggestion from my company: on Benedict, may be good to note that the bacon is not canadian style bacon and is served on side.", "author": "Josephine B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-15", "description": "For the past three years, B.O.B has been my go-to-restaurant--mostly because I live on the same block. However, it's consistently good (not the absolute most amazing food in the world) but it always hits the spot! The waitstaff are AMAZING!!! \nThe BBQ pork sandwich is my favorite--I love the apple 'slaw and the pretzel bun and the mac-n-cheese is delicious, the perfect comfort food (esp. when you're in the mood for a calorie splurge and add bacon). However, the side portion is quite possibly the smallest thing ever, just go for the full size!! If you're looking for a great place to get some work done/studying during the week, it's great here. The downside is that there aren't any refills on your coffee (lame!). Although, the coffee is so great, I am willing to pay for more than 1 cup! \n\nThey also do take-out coffee which starts early in the morning during the week, so you can grab it on your way to work!\n\nThe sidewalk seating is awesome and you can bring your pup! \n\nGo to Trivia Tuesday, you won't be disappointed :)", "author": "Kayla C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-26", "description": "All you can eat Moules Frites and Hot Toddy's in January?! Yes, please! Sign me up!\n\nMy friend lives in the neighborhood and suggested we check out Building on Bond. An excellent decision on his part! The all-you-can-eat Moules Frites deal ($16) was kind of a steal since I was starving. My friend's mac and cheese with added (healthy) veg was decadent, but not too heavy. The service was attentive, but not overbearing. \n\nHonestly, what a warm and cozy little spot. I can't wait to check it out in the summer.", "author": "Patricia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-05", "description": "Like all the places that I visited on my birthday bar crawl, I love Building on Bond. Right off of Atlantic Avenue on I believe Bond, BOB has great food, a unique setup and good all around drinks. The food is fantastic, I highly recommend swinging through for the brunch. Some of my favorite dishes are the BBQ pork sandwich, the mac n cheese and their mashed potatoes. (Didn't care for their fries). The front room is cool and holds trivia on Tuesday nights. (Where I am the king of 2nd place ::sad face::) The back room is a better place if you want to grab a meal. When it's nice out, you can sit outside and take in the beauty that is Boerum Hill. They have a small cocktail menu of their own crafted drinks which are good. Beer selection is nice, cream ale's always hit the spot. Come on by.", "author": "Mitch E."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}