{"aggregateRating": {"reviewCount": 405, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-31", "description": "The BEST { damn good, no frills } cheeseburger in the area and amazing crispy fries. The Brussel sprouts were super good too. I'll be back in the summer to eat outside for sure.", "author": "Brena L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "I love BoB--it's my go-to neighborhood corner bistro.  I think of it as an extension of my living room.  Great food (Cheese burgers, trout pate, pork chop, Cobb salad, huevos rancheros), great drinks (Hecho Margarita), cool decor/vibe and really good, friendly staff...all at affordable prices.  But most importantly, it's an active member of the community...the owners often host social and civic events.  We've lost a lot of good places in BH over the past several years--so I'm really thankful BoB is standing strong!", "author": "kyle b."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-03", "description": "Sadly, I agree with other reviewers that the old brunch menu is sorely missed, especially the salmon and bagel plate. I'd be super curious to know if anyone actually orders the \"trout pate\" for brunch. \n\nLast time I went I had the veggie burger and fries which I found to be pretty satisfying. The french fries especially are excellent. I've also had the Cobb salad which is fine. Everyone else ordered pancakes or eggs that looked fairly average. We were a group of 6 and the middle table space worked well for us. \n\nI just wish the brunch menu was better. Please do something about this because BOB Is a charming brunch place!", "author": "Joy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "Love this place because of the fantastic coffee, excellent service and adorable ambiance, just wish they would switch up the menu sometimes!! There are a few good things, but is difficult for somebody on a healthier diet to find something good to eat. Brunch is amazing :)", "author": "Simone Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-07", "description": "Very cute, quaint location for an afternoon brunch. The restaurant had a charming character, with multiple seating sections of the restaurant.\n\nFood was good, nothing to write home about - however the atmosphere was very pleasant and my friend and I stayed for hours talking over drinks and brunch.\n\nService was great. Coffee was delicious and thoughtfully made.\nI'd come here again!", "author": "Maia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-16", "description": "This is a regular spot for us most weekends. Staff is friendly and they open early. I give a lot of credit to the owners. A few years back they drastically changed them menu = bad reviews here on yelp. They quickly changed the menu to be a more similar to the original menu. Food is solid, service is great and the joint is fun and relaxed. I never write reviews but it makes me mad to see people rate this place a 3 but then say food and service was great or good. Why? Why not a 4?? \n\nGive this place is try. It's pretty solid.", "author": "Jill R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-30", "description": "Thoroughly enjoyed this place! went with family. lovely seating outside. Bloody Marys great! food delicious!!", "author": "Sarah C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-24", "description": "Nice place to hang out... Indoor and Outdoor seating...friendly staff...i tried grilled salmon was delicious...", "author": "Mohamed A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-22", "description": "Stumbled upon this gem after doing a Google search for \"great places to eat near the Barclays Center\" and boy did I luck out! Super cute neighborhood joint, great service and really wonderful flavorful home cooked food - the Cobb Salad was killer!  I will most definitely be making a return visit!", "author": "Claire O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-23", "description": "Okay, this place is cute and service is great, but I should have went with my intuition not to go with the Smoked Salmon Benedict. \n\nIt came out really bland, no spinach just the smoked salmon (a bit cooked from the poached egg) and tiny bit of hollandaise sauce. I think this was my second time having a benedict that I didn't like. I dipped the benedict with the hot sauce that was provided, that helped a lot.\n\nA ordered the Blueberry and Strawberry Pancake - that looked good along with the side of bacon.\n\nI didn't get to try it, but perhaps they're known for other things.\n\nI enjoyed the fresh squeeze orange juice and the service.", "author": "Ro R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "This is such a good brunch place - very solid choices always done nicely. The place is hipster cute. The BBQ pork hash Benedict is awesome. It can get really crowded here sometimes though, but service is always good!", "author": "Amanda F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-28", "description": "B.O.B is the safe go-to brunch spot for us. With a great ambiance and friendly staff, I am not sure why there is not a bigger hype around this spot. Nothing on the menu is extraordinary but every thing on the menu is really good. I have had most of things on the brunch menu and everything was good. We just came back from brunch and today we had brisket potato hash and it was probably one of the best brunch food in a long time!", "author": "June K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-25", "description": "What a lovely spot. Friendly service, ambiance and tasty menu. I had the charred kale salad and exclaimed at the first bite. I loved it. Split some Mac and cheese which was more than enough. Wish I had room for the banana chocolate bread pudding.... And all the other things on the menu. Yum.", "author": "Jessicah W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-30", "description": "Great food, fantastic atmosphere. I live on the same street half a block way and eat here all the time. Always consistent and staff is super friendly.", "author": "Alex H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-16", "description": "If you're in the neighborhood this is a good place to get brunch. I wouldn't make it a destination though. I got a spinach benedict and it was very good. Nothing too special, but the eggs were cooked exactly right and the hollandaise was on point. The service was great, we were seated right away and our server was friendly and attentive.", "author": "Chloe S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "An excellent brunch, friendly staff, comfortable seating for my ample frame.  We've been there twice now, and will be returning regularly.  The Cobb salad was wonderful, a perfect mix, including the balsamic vinaigrette dressing. And a very good Bloody Mary.  Also, whatever you order, be sure to order the toast.", "author": "Clyde S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-07", "description": "Great food, excellent service. I usually frequent this place during off hours and every time I am happy with my experience. Highly recommended!\nTry the meatball appetizer, guac, and the chicken parm.", "author": "BK D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-27", "description": "4 Stars:\n\n1) Best happy hour around - half-priced draft beer, $7 cocktail of the day\n\n2) Amazing pulled pork sandwich - apple slaw, juicy tender meat, etc.  GET IT. \n\n3) Perfect french fries\n\n4) Interior with a strangely comforting school-house vibe", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-27", "description": "Service was very friendly and attentive.\n\nGood beers on tap, enjoyed the porter.\n\nThe Bob burger was good, beef with chorizo. The fries could have been crispier, maybe they sat out too long.\n\nWorth a try, but the taps were a little too ordinary for me to come back from my neighborhood.", "author": "Tommy K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-29", "description": "This place has so much potential, and the food is great. But the service is shit! It has a very hipster vibe and looks hipstery (not in a bad way) but then they play spice girls the whole time (with a bit of Britney circa hit me baby one more time).\nA guy who works there apparently wants to be the Fat Jewish so he just walks around, trying to be the fat Jewish and not doing any work by the looks of things. He stood in the corner gossiping to a couple of girls instead of taking our order. Then when someone else tried to take our order, he steamrolled in and then messed it up. \nThen he put backstreet boys on and more Britney Spears, then he went back to the bar to gossip. Very loudly! The waitress there was super sweet and helpful and apparently is doing her job and his. \nThe food is great, the bar looks really cool and is in a great location. I would only come back if the shitty waiter wasn't there.", "author": "Rachel K."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Building on Bond", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "112 Bond St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/nhIBOTibT3EVnImXePRPmQ/ls.jpg", "@type": "Restaurant", "telephone": "+13478538687"}