{"aggregateRating": {"reviewCount": 3, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-21", "description": "I really like this deli, because I believe they serve the best falafel sandwich in NYC. They make it fresh and it always makes me full.\n\nThey have lots of other vegetarian and healthy food that looks good, too, but I never tried anything else than the falafel.\n\nIt also looks nicer and more inviting than most other places in downtown brooklyn.\n\nKeep it up!", "author": "Philipp Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-02", "description": "I really wish I didn't order from this place!!!\n\nThe burger was soggy and very hard to eat. The chocolate milk shake tasted like nothing. \n\nWill not order again!", "author": "Sera A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-04-26", "description": "I came in for a quick lunch in between meetings. I ordered a salad which was painfully tedious because the girl didn't seem to be able to tell which vegetable was what. She seemed to be afraid of the vegetables. I asked for avocado and she gave me guacamole, her co worker told her that was wrong and she left the guacamole In the salad and added fresh avocado on top. I guess that was okay, except I had wanted it chopped and that seemed weird with the guac in there. So I didn't get it choppped. She asked me if I wanted the dressing on the salad or on the side and I said on the side. So she put it on top. Her coworker had overheard me and brought over a little dressing cup and the girl insisted that I had said I wanted the dressing \"inside.\" Also, it as a pretty small salad for the price.", "author": "Ceema S."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "B Lunch Bar", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "129 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/KdTa6usVPrX2HBAIkFdBVA/ls.jpg", "@type": "Restaurant", "telephone": "+17185224500"}