{"aggregateRating": {"reviewCount": 66, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-16", "description": "Great environment to come down to after a hectic day of work. Bartenders are attentive and caring. I always get service right away and am more - or - less satisfied with the drink selection. The food is surprisingly good -- you can't go wrong with their burgers or their sliders. I definitely recommend the truffle mayo with your fries. Get it on the side and dip your sliders in it. Wings are crispy and I've never been unsatisfied with them -- thai sauce is great but I would also recommend the yuzu sauce as it has a nice citrus element to it. I have eaten here many times and have been very satisfied each time. The kitchen seems to have a high - standard based on my experience.\n\nMiguel is an outstanding bartender and always works to serve. \n\nA low - key relaxing environment on weekends and weekday evenings are lively.", "author": "Rishi B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-25", "description": "I remember this bar from back in the day when it was the old KB's. The establishment has improved significantly but with improvements there are those bartenders that want to rob the patrons. If Happy Hour is occurring it is the bartenders responsibility to advise patrons the difference in price of top shelf and Happy Hour brands. My bartender didn't do that and after I and my friends made a big deal, he decided to give two free shots. Not four which was the number in my party. \n\nMy advice is just be aware of drinks and their cost. Don't let establishments such as this one get over on you. Thanks for the shots even though it was not the top shelf brand I originally paid for. Plus I do believe the bathrooms need a little extra attention.", "author": "Hope M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-24", "description": "This place is pretty damn cool. A+ service and a great menu make the dining room a destination to remember. NY has so much to offer but you can't find places like this. It's the kinda bar the encapsulates the essence NY was built on. Diy. Have fun get some awesome beers talk to locals and watch the neighborhood blossom. Bees knees. Tip-top. Thanks guys!", "author": "John C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-11", "description": "Stopped in here for happy hour and a quick bite the burger was delicious ! but the highlight of my visit was the bartender Roxanne she made me delicious cocktail after delicious cocktail,  I will be back soon !!!", "author": "Chris K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-04", "description": "I've stayed in Downtown BKLN a couple of times and this is my bar of choice. Not too pricey, really laid back, not too loud, great staff and a great selection of drinks.", "author": "José Ignacio O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-25", "description": "Your typical neighborhood bar. Limited draft selection, so narrow it's hard to navigate, but like that old T-shirt you love to wear, you just keep coming back to this friendly dive.\n\nDefinitely go for the mixed drinks. The bartenders make a wonderful vodka blueberry lemonade, my ex told me. The food's not half bad, either", "author": "Colin C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-10", "description": "Came here on a Friday night. You can tell this is a local spot. The crowd is much older but they were also people in their mid 20s. Ran into some nice people and also very rude people. This is why I didn't give it a higher rating. However, the prices are decent for drinks especially for being downtown. I had the aloha burger with was a burger with cheese, caramelized onions, bacon, pineapple, and arugula. The burger was tasty and thick. Plus it was responsibly priced. I would come back because of its chill vibe.", "author": "Geraldine E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-12", "description": "Dining room is a bar and lounge. They serve regular beverages and drinks. I've never dine in here.\nI had a mealpal deal and ordered their fried pork belly sandwich with french fries. The fried pork belly was delicious, juicy and every bite was melting in your mouth.\nEven without the meal deal, I would order this again and again but of course, I would give their other menu items a try. \nBeing that it is a bar, the lighting is pretty dim to none for lunch hour.", "author": "May Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-19", "description": "This place has mad awesome burgers. Shake Shack is just to the west - skip it and come here. Also, though the fries here are good,the optional side salad is no throw away - it's actually enjoyable. The burger is big and bad enough that you will be happy you got the salad.  Friendly service as well.", "author": "Matt J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-29", "description": "I don't get why they call this place the dining room.The finger food that my colleagues and I ordered was not good.Most places I go to for drinking I mainly order finger food because I figure who messes up chicken and French fries‍‍don't waste your money on food stick to the drinks,they weren't half bad.FYI they have a bunch of games which is pretty dope my colleagues played Jenga and Connect Four so it's a pretty chill environment if you not trying to turn up.", "author": "Shorell S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "This is a very good neighborhood type bar in an area where there is not really a neighborhood. As a bar it is very good. I want good drinks at reasonable prices, TVs for sports and some decent snacks on the menu. They have a number of good snacks the burger, Thai style wings are stand outs.\n\nSince I usually drink bourbon neat I have not found any watered down drinks or short pours. The staff is excellent and friendly. This is the best bar in the area.", "author": "Tim C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-22", "description": "I've been to this place so many times but last friday i was here again and the food went from 5 stars to less than 1. The crispy, fresh, hot thai style wings I had before, were totally the opposite. They were absolutely old NOT fresh wings. You could taste that they were almost to the point of going bad. I regret not telling our server about them. The fries were too crispy almost to the point of burning. Calamari were these tiny pieces of fried flour, onion rings were so greasy, i thought they were old and refried. The tequenos were ok. The service has always been horrible, that hasn't changed. I'm so disappointed those thai wings used to be the bomb", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-21", "description": "Maybe it should be called \"ing Room\" because the \"Din\" letters are missing from the front of the bar. ;) \n\nI have been looking for a place like this in downtown Brooklyn for my weekly employment assignments. Its a causal bar/grill with cheap drinks, compared to some of the other establishments in the area. Although I did not have any of the food items, it appears that this place would have amazing, greasy pub food. Oh, by \"area\" I mean within a two block radius. The place has a come as you are vibe and it is not inundated with a bunch of tourists from the Brooklyn Bridge or the nearby Marriott hotel. \n\nThe female bartender who works the early Sunday afternoon shift was super friendly and really attentive. \n\nI am glad that i can add another downtown Brooklyn bar to my Sunday drinking rotation.", "author": "Kwame S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-25", "description": "Based on dive bar experience.\n\nHappy Hour:   Very affordable, but I must admit the liquor tastes watered down.  If you're too classy for that, then stick to beer or steer clear.\n\nFood:  Basic bar food.  Get tipsy enough and you won't care either way.  The wings and fries are decent. \n\nGets pretty noisy but it's only because everyone there is having a good time.\n\nBartenders are friendly and pretty attentive depending on how busy it gets.\n\nATTN Restaurant Manager and/or Owner:  Stopped by yesterday and couldn't even use the bathroom.  Any other time the bathroom was accessible and clean.  This time, the women's bathroom was flooded and the one toilet in the men's bathroom was covered in poop.  Painfully waited until I got home to use the bathroom.", "author": "Rocio T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-15", "description": "The food was ok, service was terrible. $5 fireball offer was offered via yelp but conveniently the bar didn't have fireball? The bartender and wait staff seemed pretty nice but this place needs help.", "author": "Kevin V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-12", "description": "Walked in for a quick bite and drink before returning to work. Bartender did not acknowledge my friend and I till after 10 mins of sitting and waiting ( we tried to get her attention more than once). When finally acknowledged, she did not take our order till 10 mins later. Overall food was great, but service was truly poor.", "author": "Paula I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-26", "description": "would give it a zero if i could but i cant.\nwent there with a group of 25 people for an after work pre super bowl party since it was close to the office. to say the food was garbage would be an insult to the garbage in the bags that were on the street for pick up. the only thing worse than the food was the service. which on a scale of 1-10 would be a minus 1000. the food came out scattered, the servers didnt know who got what (since you couldnt tell what it really was anyhow) and half of our party got their food when we were leaving. we chose this place because we wanted a beer and burger but later found out that its a pub that serves japanese food??? are they serious? again thats an insult to japanese people all over the world. the restrooms had me begging for the rest rooms in the LIRR at penn station thats how disgusting they were. so in conclusion when you walk by this place, keep walking and you'll do better at the $1.00 pizza place next door. im sure one day it will be a parking lot or a dunkin donuts because its not a restaurant and it will be closed sooner rather than later.", "author": "Mike H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-10", "description": "A convenient place to refuel during a downtown pub crawl. It has a few definite perks and positives about it. But it's also got some quirks which work against it. At the very least we can say it has personality, which too many other local spots lack. \n\nWhat first appeals about DR is the cozy, comforting darkness of the interior. Everything dark wood. Nicely-burnished, softened, buttery --attests to a long history of proprietorship. It must have been many other bars in the long-distant past. Thus, there's a good spirit underlying everything. It was likely some kind of Irish pub for years before its current incarnation. \n\nNow, as 'Dining Room' it strives to work also serving random pub-food. Well...the results are ...'middling'. Hit-or-miss. 'Nuf said. Not sure I would ever be a regular diner here. Too many other choices nearby. It just doesn't feel clean, consistent, reliable, or efficient enough to cozy up with food. \n\nYep--'Dining' may be a tad too ambitious for this joint. All the new furniture and new decor in view, seems to jar and clash against the eye; all looks a bit gaudy, crass, and tacky. Add on the inevitable large flat-screen TVs (NBA, NFL) and it decreases comfort level just that little bit more. For boozing, it's fine. But the soul of the bar is clearly all the way in the rear.\n\nIs the hooch watered down? I couldn't say one way or another as to that. Would need to really study the matter under better conditions than a pub crawl (wherein I've just come from six other bars and am on my way to six more). It is a worrisome issue though. Always a concern.\n\nBar service: decent. Personable, confident, experienced, cordial. No problems with service. Drink prices: standard.\n\nSaving the worst for last: the clientele. Late-evening crowd is thoroughly **ghetto**. I'd say this is the #1 problem with the place; but I don't know what to recommend to fix it. Maybe add some bouncers and pat-downs at the door. \n\nBut the whole bar takes on a very bad vibe due to this element. Becomes grim and gloomy, surly, thuggish, and low-class. What it means to me is that I only wander in here when I'm already blotto and my decision-making is already impaired. \n\nOverall verdict: I hope the bar sticks around. It has survived a long time already and I'd hate to see it disappear. I don't mind stopping in to bend an elbow once in a while. Carrying on the tradition even through these twisted times.", "author": "Jorge G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-24", "description": "I'm such a fan of this spot. My coworkers were VERY confused where I was taken them, but when we walked in they were surprised how cool and different it was from the outside of this area. I stubbled upon this place when I worked in the area. I really have to say this is my \"cheers\"!!\n\nThe waiter was VERY accommodating for my birthday ALL evening. He made sure he took care of the drinks and the food to ensure it came out in a fashionably matter. He knew when to ask, get, and grab. he was engaging and made sure we were taken care of all night. I got the burger with truffle French fries (bacon and cheddar cheese) \u0026 a $4.00 blue moon (that's a deal). They had Happy Hour for another hour and half and everyone was very excited. We all loved the spot and I think my coworkers will be back with or without me. I will defintly be back. I come here at least once a month.", "author": "Daisha N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "This for Day crowd only. Bartending is one of the hardest jobs on earth. Gazillion diverse personalities being managed on a minute by minute basis. Yet Roxy performs it flawlessly.  She should write a book on friendliness and service. Add her incredible looks (not meant to be sexist), and you have one incredibly pleasant late afternoon. She has a solid following for a reason. Join the Roxawarians!!!", "author": "Bill L."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Dining Room", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "56 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/tiD7ksKfrX4voKEg8eJ0Pw/ls.jpg", "@type": "Restaurant", "telephone": "+17184888902"}