{"aggregateRating": {"reviewCount": 66, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-14", "description": "I haven't been here for some time but I came because they had this fried shrimp option on their menu and it was delicious, but I believe they are under new management because a few things have changed about the scenery, they still haven't fixed their sign on the outside though because part of it is missing.\n\nThey didn't have my shrimp so I ended up with a burger and wings. I ate the burger, the fries were all grease and no potato and the wings I wasted. They tasted like they weren't throughly cooked; they're so huge. I wouldn't go back now after this experience. The entire menu is different and unimpressive. I would just find somewhere else to eat. There is so much downtown Brooklyn has to offer.\n\nI miss what it was 3 years ago.", "author": "Anissa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-18", "description": "The food here is amazing!! Definitely a hidden gem in downtown Brooklyn. The burger and fries were the best I have ever had, as a matter of fact, everything I have tried is amazing. The prices are very reasonable as well", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-18", "description": "One star for the fries. \n\nAwful distracted service. The waiter was uber flighty. \n\nOne star for over cooked burger that didn't match the description.", "author": "Marie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-01", "description": "You have to rate it for what it is. A simple bar with simple bar food. Your not coming here for a 5star meal or great service.\n\nThe bartender does double duty taking orders and servicing the bar. We came with a group of 6 ppl late at night on a Thursday night.\n\nHe remember all our orders and the food came out at a simple bar pace. Again your not looking for a fancy meal but the food was eatable and it was the only thing around that was open!!! \n\nThe price is great the bill came under $100 for 6 ppl\nEach dish was an average of $10-12 which in Nyc is rare. Good prices, at a simple bar in Brooklyn when nothing else is open, good simple bar.\n\nRate it for what it is people", "author": "Kamil S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-07", "description": "Happy Hour Prices:\n$4 beer you wouldn't want to drink\n$5 blue moon\n$5 Guinness \n\nI ordered a blue moon and it's soooo flat... \nLike drinking juice.\n\nWhy don't I go to east village for $4 Guinness?  Arg--\n\n\nIt's a good place if you want to watch a game.", "author": "Joe T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "This place is awesome! \nService is friendly, although it does depend on the bartender. \nBeer is typical in price.\nIt wasn't crowded when I was there but it did pick up at night. Seems to be popular with people who work in the area.\nTheir fire in the hole burger is amazing. Their french fries are skinny and addicting. They're like crack:)\nOh and they have a fireplace now that winter is showing it's head!", "author": "Jai S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-24", "description": "I've been here a couple times and it's a real hit or miss kinda place.\nOne time the drinks and service will be on point (despite the crowd) and at a calmer time of day, the drink will be piss poor...sucks.\n\nThis is a decent place to end your day (wine down if you may) or you can even start your weekend here. They always seem to have some drink promotion going on so don't hesitate to ask the bartender.\n\nCash and Credit accepted.", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-06", "description": "Miguel was the best bartender I've ever had. Good music, good vibes and he took care of us. Would highly recommend to anybody looking to get a drink and be entertained.", "author": "Jacob K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-18", "description": "This place is tolerable during the week until it comes to Friday evenings, which seem to draw an \"interesting\" crowd. The place becomes a total \"s\"-show at that point. Saw a married woman get sexually assaulted while her wife was right next to her once. Make sure you keep your belongings close to you at all times. Mos def not the kind of place you'd want to leave your stuff at the bar when running to the restroom real quick. Saw a dude freak out after he had his backpack swiped a couple months ago. Then there's the curious case of the haggard, umm... \"Lady of the evening\", going around propositioning just about every dude in the place all sloppily ripped. She must be a regular there too, seeing as how everyone seemed to know her and I've crossed paths with her on a couple of occasions. At one point she was waiting outside the men's room downstairs, pretty much trying to pick up every dude that walked by. Its kind of awkwardly funny and sad to watch her in action. All of the above might just be a product of that specific stretch of street from Jay to Lawrence Streets along Willoughby though. Its noticeably the most ratch block in the Jay/Metrotech area for some reason. The shadiest of shady. I've had mixed dealings with the staff for the last couple of years. Most of the time they're friendly but the times that they're not are really off-putting.", "author": "Tony B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-23", "description": "Expensive..happy hour is beer only...wont be coming back bartender had an attitude ...boring place that made me want to go to sleep", "author": "Kamica N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-04", "description": "My go-to local drinks spot.  Lots of regulars, lots of after-work folks.  Quiet on the weekends.  Bartenders are nice and food is reasonable if you're not looking for anything more than pub fare.  $4 happy hour drafts are great.  Wish they had more craft beer selection, but their crowd probably buys so much of the standard crap that they don't have the space on their taps for anything too adventurous.\n\nUpdate: beer selection very much improved. Other Half on tap among other highlights. Music situation is almost unbearable. Manager has Bluetooth based streaming that cuts out all the time, making for an uncomfortable listening experience. It's been this way for months, and he refuses to fix the problem or even acknowledge there is one.", "author": "Wade B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-10", "description": "The unassuming bar behind pretty typography is exactly what this place is. The place has an enticing menu but once you actually get the food it is not as described. Lapin and I ordered the boneless wings (good but a bit dry),  the buffalo sandwich (dry and came with a different cheese and toppings than described -- along with getting a hair baked into the cheese), truffles fries (okay, not out of the world great), fried oreos (awesome, promised to come with ice cream but came with whipped cream), and fire in the hole burger - well done (Lapin thought it was spicy and was just okay). The service was okay, they never came to check up on us or even refilled our waters. Definitely going to avoid, maybe if we want drinks but nothing else.", "author": "Andie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-20", "description": "Dining Room burgers and fries are absolutely delicious and full of flavor. Service and new management is great, definitely like the menu change and the renovations they've done.", "author": "J C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-14", "description": "This place has the juiciest burger in the area, the service was awesome and the drinks were strong! And the new renovation looks even better, they've open the dining area up so there is now a view of the kitchen. I wish they had an earlier happy hour but perfection isn't easy. The burger here was 10$ a part of they're temporary menu. We had the burgers and garlic fries with the chipotle aioli dip and it was perfection!!", "author": "Ashley D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-16", "description": "$4 drafts, tequila Tuesday something, $5 wells/wine read the sign. Good selection of beers on tap. I came here to kill time before the last yelp event in Brooklyn. One of the bars in the area was shut down or closed and really I had no idea where I was going and just ran into this and a sign outside. Armed with Stephen King's \"The Stand\" and an \"I'm running late\" from my plus one, I figured, well, this is better than standing around on a corner on Fulton Street. Yikes. Had Strongbow Cider and a Laguintas IPA. Lots to choose from on tap. Nothing extraordinary, but nothing boring either. Seemed like a proper British pub in the middle of a crumby area of Brooklyn with a pretty great happy hour until 7pm. A lot of locals come in here after work for a pint. Most of them I was shocked were in the same situation and on their own so I didn't feel as awkward. Their food, though, not sampled, smelled pretty good. Lots of interesting burgers and sliders (some coated in a Guinness Glaze, Peanut butter, or spicy peppers/chipotle), chicken pot pie, fish and chips. On the bottom of the menu they even have listed home-made donuts and wait for it - deep fried oreos!", "author": "Ingrid S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-27", "description": "Stopped in for a quick bite. The bartender seemed to be great with regulars, but as a new customer I could barely get a cup of water. My fries were cold when they came out, and it took longer than it should have to get my check and pay in the end. People seemed to love it though.", "author": "Janell M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-16", "description": "Couldnt figure out how to give a half star.  The bartender today was horrific.  He barely acknowledged us.  We had to ask him 3 times for a menu eventhough the place was practically empty.  He never asked us if we wanted to order. He was completely uninterested  in us.  Never ever had an experience like this in the Dining room with any other bartenders.  I wont be going back as long as he is there...", "author": "Tasha M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-19", "description": "Food was good, ordered falafel and didn't get any sauce, friend ordered fire in the hole without any sauce either. Good price, friendly service, and fun atmosphere. Once we told the staff of the lack of sauce they immediately corrected the problem.", "author": "Jeremiah T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "My bartender was really attentive and nice. The Thai chicken wings here are so good! I didn't really like my wrap tho but I would definitely come back here to eat more of their chicken wings.", "author": "Elle D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-03", "description": "Nice food and very pleasant wait staff. We tried the hummus (excellent!) and the Peanut Butter burger (good but not as peanut buttery as I was hoping).", "author": "Mary P."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Dining Room", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "56 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/tiD7ksKfrX4voKEg8eJ0Pw/ls.jpg", "@type": "Restaurant", "telephone": "+17184888902"}