{"aggregateRating": {"reviewCount": 66, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-29", "description": "Absolutely awful. I'd heard that this place had gotten a renovation in an attempt to reinvent itself from its previous life as a sketchy place with bad food and a rough crowd. WRONG. \n\nA friend and I went here last Friday night for drinks after work. At the bar, there was a guy next to us--at 5:15 pm, no less--who was HAMMERED. Fine. \n\nHe proceeded to sexually harass my friend and I for about 30 minutes. The vulgar comments finally reached the breaking point and I went to find a manager. One of the waiters advised me to tell the bartender. Against my better judgment, I tell the bartender what's going on (who has been watching this guy harass us the whole time), and shockingly--the drunk guy doesn't stop, and the bartender doesn't do anything.\n\nThe guy continues to verbally assault my friend and I (we've just left work, so we are in suits) and some guys next to us who were also in suits. Calling us professional robots, telling us that he makes more than us with his pension alone, showing off his Union t-shirt and screaming that he's untouchable because he's in the union. Screaming in our faces. Insults. Sexual innuendos. Assorted blue collar vs. white collar insults. The whole nine yards. \n\nThe guy finally gets off the of the bar stool and as he is stumbling away, the bartender says to him, \"See you next Friday!\" HUH???\n\nI have NEVER been harassed like the other night, and have NEVER observed a restaurant/bar handle an unruly patron in such a poor manner. The one bright spot was that my friend and I made friends with the guys next to us and agreed, wholeheartedly, that we are NEVER going here again. If you are interested in being verbally attacked and participating in the current class war going on in Brooklyn, this is the place for you! \n\nOh, and p.s.: I called later that night to get a manager on the phone. The person who picked up the phone says \"Dining Room\". I explain what happened and that I need to talk to a manager. The person on the phone says \"YOU HAVE THE WRONG NUMBER\", and hangs up on me. Classy.", "author": "Kia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-26", "description": "The hot dog sliders are the best bite of food in Brooklyn! \n\nFree Public Restrooms! Ask for Peter.\n\nGreat selection of DVD's when the DVD lady stops by!", "author": "Nate G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-20", "description": "The place itself was cool and inviting but the Bartenders....If you don't mind waiting for 10 min for a drink every single time you go to the bar then this is your place.  They were grouped in one section of the bar, while the bar itself is huge, they need a serious lesson on picking up the pace!  If it is dead inside you have a chance at some good service as a group or if it has more than 20 people in the bar, forget it especially if your bringing a group of people in.", "author": "Chad L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-13", "description": "Yikes!\nFor the short of it... What are they thinking! I think this place is meant for the after work crowd that works around here. Certainly not meant for the farm to table thing they are trying to emulate. \n\nMy lady instigated date night here with the LivingSocial dinner deal. It still wasn't worth the half price by a long shot. I thank her for being adventurous but we were both floored at what they put in front of us. We really haven't had this bad of a meal anywhere and just laughed it off. \n\nIf you still want more, here I go. \n\nAbout the only thing they have going for themselves is a good interior decorator, which will work for just about any next tenant. \n\nNow, for what  you get if you are still considering it. Maybe it's because they don't have the official website yet or maybe it's because they skipped culinary school but you won't get what you expect from most trending, farm to table like, places in the city. Nothing we ordered was a memorable experience and most if it was over cooked. Actually the truffle fries were under cooked but the fish was as dry as paper and whatever mush was in the shepherd's pie (actually cottage pie with beef) was disguised under cheddar cheese. \n\nThe waiter, bless his heart, has no experience but did a fine job of running all tables if you don't mind clearing your own. The wait staff certainly aren't adding to the value. \n\nThe ambiance was set for 11pm at 7pm. I don't need to rave to Euro beats over my appetizers but beyond that preference the music doesn't come close to fitting the decor and I actually prefer electronic music. Obviously the out of place beats were for the after work crowd that packed the bar but quickly disappeared when the trains to LI blew. Leaving us to smell our dirty plates that never got removed. \n\nThey do have a decent local beer selection and she enjoyed her wines. Another reason why the thumping bar a few feet away was so busy I'm sure. \n\nUgh. We are simply surprised at how bad this diner experience was. Grab a beer here then go somewhere else.", "author": "David B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-29", "description": "I went to this restaurant using the Living Social deal and I have to say it was so worth it. The unlimited Mimosas deal was great and they were delicious. Everything I had was delicious - Starter the Chef's Choices, Entree - French Toast and Poached Eggs. The service was great and the place has a very nice ambiance with a fireplace by the end. Bathrooms immaculate.\n\nLoves this place and would definitely go back.", "author": "sully g."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-13", "description": "I can't speak to the bar which sounds in other reviews like it's a nice addition to the neighborhood, but my dining experience was quite mediocre.  They only have a couple of vegetarian options, which is fine, except that they were out of the tortellini leaving me to go with a decidedly unimpressive eggplant lasagna.  My friend who had the burger said she could tell it was a good piece of meat, but even though it was well-cooked, was somehow bland.  \n\nWhen we first walked in, we were confused about where to go or whom to talk to to be seated.  The whole thing felt very haphazard.  Even the menu was rife with spelling errors.  We came in with a Scout Mob deal and the waiter said he knew nothing about it.  One little thing after another.  It wasn't a bad experience and the food wasn't terrible, but it wasn't a good experience either.\n\nMaybe we came on an off night.  I'll keep an eye on the reviews and if things seem to improve, I might come back.  It would've been really nice to have a place like what Dining Room seems to be aiming for in the neighborhood.", "author": "Carl B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-30", "description": "I went in looking to have a few beers and enjoy my Saturday. I am currently trying and failing to get my check. I have had two drinks over the last couple of hours. I wanted more than that, but I am less interesting than the bartender's phone. No wonder nobody is ever in here.\n\nThe drink selection is good, and the menu seems reasonable.  But man, the service.", "author": "Justin V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-24", "description": "My boyfriend purchased a living social deal and after reading the yelp reviews I was pretty nervous yet kept a positive attitude.\n\nAt first we tried calling the phone number listed on yelp but it turned out to be a random guy's cellphone # and he was not a bar that served brunch.  Poor guy! \n\nWe then emailed them and wrote on their Facebook wall as the phone number on the coupon and their website did not work.  NO RESPONSE! Seriously? We are begging to make a brunch reservation and you are making it difficult for willing customers despite your horrible yelp reviews?\n\nWe then tried to get a refund from living social.  The site responded by saying they are answering the phone.  So a week later we made a reservation for brunch.  UGH!\n\nThe Saturday we went was very rainy and cold so at noon there were only four other people dining at the restaurant with one waiter who seemed a bit new to the scene and slightly stressed.  He was very nice but as other reviews state, the service was very slow.\n\nFor drinks, I tried the pineapple mimosa and the grapefruit mimosa.  The grapefruit was the best as it was strong.  A good  morning cocktail.  I ordered the kale salad which I thought was too salty.  I was never raised to add salt to my meal and I usually do not enjoy salty things.\n\nMy boyfriend ordered the burger which was very typical and came with fries.  It could also come with potato salad if he chose.\n\nMy favorite were the wontons.  Super yummy and full of flavor.  We also ordered the potato croquettes which were incredibly bland and not worth ordering.  \n\nThe living social deal included the tax which was awesome so not funny business with extra tax/included tip.  \n\nOverall, I see what the most recent reviews are saying.  I think this place is a standard 3-star brunch and has room to grow.  I would consider returning in a year or so.", "author": "Elyssa J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-11", "description": "Burger, fries and beer was ordered and it was good.  Didn't have high expectations - the food and service were on par with any normal bar that serves food.  It was close to my hotel so was very convenient for me to walk to.  I will not likely be back unless I am in the area and looking for a beer, but not food.  Too many other restaurants to explore in the area to eat there again.  Price was standard.", "author": "J. P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-10", "description": "Downtown Brooklyn is constantly changing and this restaurant is ahead of the game.  I was escorted to sit down and given water and the menu. The place was very well designed and it felt nice. The service was amazing, they really tried the best they can to please us. My friends and I put in our orders, and my friends really liked the beer. When our food came we could not believe how great it tasted. The quality is really amazing, and Im a very picky eater. The food was great and the manager and servers kept coming around to see if we needed anything. More places like this should open, or just this place should expanded. \nI really wanna go again and I will def tell others about this place.", "author": "Daphany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "I want to have my last meal on earth here, before I die. The food is delish the have best cheese burgers and the staff were attentive, love Sasha and Ishmael...", "author": "Anthony J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-11", "description": "Excellent place to come here with friends and business coworkers. You can eat and drink, but you can't bring your kids here only this adult only. Since this is my first time here i''ll give it good rating.", "author": "Tonia F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-26", "description": "The late night vibe here is awesome!!! The bartenders here are chill and they usually have good crowd.", "author": "Eric T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-25", "description": "Good happy hour deals, the spicy sweet wings, truffle fries and lamb shank are my favs with addition of the fried oreos. The staff is friendly and helpful and its in a good spot transportation wise, the A, C, F, 3, 4, 5, 2, B, R, Q trains \u0026 52, 38, 25, 65, 103, 45, 41, 26 and more mass transit are all within a ten block radius.", "author": "Roni H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-05", "description": "Ugh.  Salad and entree brought together.  The fish and chips tasted like fish sticks and Mcfries.  The joint was decorated by deranged blind people.", "author": "Tom D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-17", "description": "I love this bar - it's a beautiful space. And the truffle fries are to DIE for! By far the best I've ever had.", "author": "Dee O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-07", "description": "Forget what the other reviewers say but I absolutely love this place. I work directly across from the bar and the bartenders and staff are awesome. Like how they added three flat screens behind the bar. To me the fireplace is great for when for a romantic date. The Dining Room burger with truffle fries is my favorite then the Chicken Francesca. My work buddies and I are somewhat regulars because I usually go about 3-4 times a week. Love the atmosphere. Thumbs up.", "author": "Aikeem S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "Not been there for lunch, but Happy hour gets really packed. Fun place to chill with coworkers. one of the few places around to carry lagunitas IPA. Great service.", "author": "Pluto G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-29", "description": "This place is everything I love and look for in a bar! Chill, great service, sports on easy to see TVs, great lighting, good tap selection, and pleasant noise level.", "author": "Ava N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-10", "description": "Bought a LivingSocial deal for brunch, which said it was good on Saturdays and Sundays. Called on Saturday to make a reservation for Sunday, as directed by the voucher. The guy on the phone said they didn't take reservations - okay, no big deal, that happens with LivingSocial sometimes.\n\nTook the A all the way from upper Manhattan to downtown Brooklyn on Sunday morning; arrived just after noon. THEY'RE CLOSED. No sign on the door, no one answering the phone. All information online says they are open at 11am on Sunday. What the heck?\n\nIf I ever get to eat brunch here, I'll update the review. For now, I'm annoyed.", "author": "Mina M."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Dining Room", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "56 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/tiD7ksKfrX4voKEg8eJ0Pw/ls.jpg", "@type": "Restaurant", "telephone": "+17184888902"}