{"aggregateRating": {"reviewCount": 66, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-28", "description": "a much needed cool bar in the area! I have been twice and both times the bartenders were really nice and friendly. I think this could be a great spot for happy hour during the week. The place has a relaxed, modern feel. Definitely will be back!", "author": "Samantha K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-23", "description": "I came here for a friend's birthday dinner and the ambience is great. Simple but warm and welcoming. It is a beautiful establishment with great food and some of the most friendly service ever. I got to really speak with the owners. Definitely will be back.", "author": "Opal L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-30", "description": "Stranded in New York during Hurricane Sandy, had a harrowing 24 hours walking back and forth across the bridge from a hotel in Manhattan with no electricity, no food, no working bathrooms to a refuge in Brooklyn (the Sheraton), then found this gem of a restaurant by accident. The food was awesome, the wine was great, the vibe was perfect. Thanks for rescuing me. I had the Chicken Francesca, smashed potatoes, and the Zinfandel, and it really gave the term comfort food new meaning.", "author": "Thomas S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-18", "description": "We had a wonderful culinary experience last night at the Dining Room. The appetizers - country fried shrimp and albondigas (meatballs) were delicious. Our entrees - eggplant lasagna and pork shank were prepared perfectly. Our server, Zumbi, was excellent. Very pleasant decor with a working fireplace. Looking forward to going back!", "author": "Vernon P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-08", "description": "Pretty cozy little spot. There is a seating section with tables in the back and a bar up front by the door. Get a sandwich before three - with a free pint - other than that - it attempts to guise itself as a restaurant but the menu is pretty scant. Having said that, not a bad place to start your night with some good friends and a few pints. Would return for drinks!", "author": "Tab S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-10", "description": "Actually stumbled upon this place while looking for another nearby pub and very glad we did.  The truffle fries are amazing, the beer selection is great, and we love the fireplace.  Have already been back once, and plan to make it our regular watering hole.  Very glad this just popped up in the neighborhood!", "author": "Victoria G."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Dining Room", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "56 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/tiD7ksKfrX4voKEg8eJ0Pw/ls.jpg", "@type": "Restaurant", "telephone": "+17184888902"}