{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-07", "description": "The strawberry and ricotta salad with balsamic vinegar is delicious: Sweet strawberries, two big dollops of creamy ricotta, and pile of arugula or similar dark greens in a mild dressing. Very refreshing for a hot summer evening. \n\nThe crispy gnocchi with sausage and broccoli rabe was tasty, but overly greasy. I wanted more bite from the broccoli and less grease from the pile of crumbled sausage. My companion raved about her creamy seafood pasta. \n\nService was extremely slow.", "author": "Lindsay B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-18", "description": "Been here a few times.  First time just to the bar, bartender sent my brother a drink on the house, overheard it was his birthday.  Next few times we ate at a table, very friendly service both by staff and management.  Food was very good. Loved the nicoise salad. i feel like this is a good place to try the specials, because the majority of the menu is straightforward but this is where they get a little creative.  Like I said the food is always good though.", "author": "Pat F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-24", "description": "This has quickly become one of my brunch faves (can't comment on dinner but heard it's great as well).  The restaurant  is pretty small and can get crowded pretty quickly.  That being said, I've noticed there is a garden in the back so I would assume there is additional seating during summer months.  The decor is standard but has a little bit of a romantic flair so its good for a date or an outing with friends.  On to the good part - the brunch!  Food is DELICIOUS and served in nice sized portions so you don't leave hungry.  They also have a variety of brunch cocktails which I like since I get tired of the standard mimosa.  Service is average and although the servers aren't always super friendly, they get the job done in terms of getting the food out and keeping my glass filled.  The best part is that brunch menu is also served on Fridays - you can't beat it!", "author": "Natasha B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-13", "description": "just decent italian food. Good discount with Scoutmob took of $20 for $60 bill. Shrimp scampi was tasty with big shrimps and good scampi sauce. Oysters decent.", "author": "Pan P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-29", "description": "Mediocre food.  Also, they did not honor my yelp check-in bonus of free wine because I used Savored discount there.", "author": "Pavlik M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-09", "description": "After recently returning from a trip to Italy, we decided to try Verde out since the menu seemed fairly authentic. Had the mozzarella and prosciutto and insalade de mare as appetizers. The mozzarella dish was good, not quite as good as Italy, but close. The seafood salad was kind of strange. seemed like the seafood had been steamed and didn't have much flavor, but I did like that it was simple with just some lemon and parsley. I can't remember what the name of the salad we got was, but it was pretty good. We had the filet over arugula for an entree and that was nice and simple and good. \n\nOur server was SO nice and attentive and cool, so no problems there. Not sure if we will go back, but overall a decent meal. Oh and we got a bottle of the pinot grigio, which was great.", "author": "Tinker B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-19", "description": "So good. Piles of seafood. I am from Maine and the lobster in the lobster feast was as fresh and juicy as anything from home. BF had the loster fra diablo which also had a 1/2 lobster on top. I have never seen such high quality shellfish outside of Maine. Tiramisu also amazing.", "author": "Amy G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-19", "description": "Attention RESTAURANT.COM users (and apparently any other coupons based on other Yelp reviews):  I came to Verde for Saturday brunch with a friend to use a gift certificate I had from restaurant.com.  Before selecting Verde as my restaurant of choice I read the policy of the site and of the restaurant itself.  I wanted to make sure specifically that alcoholic beverages were not excluded from the deal since the RESTAURANT POLICY is that you have to spend a minimum of $37.50.  There were no alcohol restrictions so I was happy to select Verde as my restaurant of choice.  I have been here before and am a huge fan of the sausage and broccoli rabe on ciabbata bread sandwich.  BIG MISTAKE!  We sat at the bar and enjoyed a nice brunch and cocktails overall.  As we were finishing our drinks I put the coupon on the bar.  A moment later I felt a tap on the back.  The owner/manager was standing there and told me they do not take that coupon/deal during brunch.  As I began to respond that it doesn't indicate that anywhere, he disappeared into the back.  He returned shortly with his own printout of a restaurant.com page of his restaurant.  He then proceeded to point to the business hours listed under the establish name.  For the weekend it said 4:30 and said that is when you can use the coupon.  Dinner only.  I reminded him that for the Special Instructions/restaurant policy, it only indicates a minimum purchase of $37.50.  As I have frequented this restaurant before, I did not look at their hours on restaurant.com.  I am aware they are open for brunch.  Why would I look at the hours?  He told me that restaurant.com is in charge and they have no say.  Bullcrap!  Each restaurant gets to select their own stipulations for use.  This particular restaurant chose to put a minimum purchase on the use of gift certificate which is very reasonable and understandable.  Obviously they could have added another 'Special Instruction\" of BRUNCH EXCLUDED or DINNER ONLY.  The only reasonable conclusion I could draw from their decision to not indicate this on restaurant.com is to get people to patronize this place during brunch and then have to return for dinner to use the gift certificate.  This lacks integrity in my opinion and is a very shady business practice.  Business owners should know that people are much more willing to share bad experiences than positive ones.  And as evidence, here is my Yelp review.  I have exchanged this gift certificate to be redeemed at another restaurant so that I don't spend any more of my hard earned money at this questionable establishment.", "author": "Nicholas F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-10", "description": "This place was completely disappointing from the service to the food, well especially the food.\n\nThere were two hosts, one in a puffy outdoor jacket looking upset, and the other dressed as a waiter who also looked upset. He also looked miffed when he realized that the first host was seating us, not him. Very odd. It seems like most of the customers there were from the groupon deal (as were we), per our waitresses observation. Our waitress only addressed my boyfriend, and for some reason did not even glance in my direction while telling us the specials.\n\nWe started with the eggplant thing which was covered in gooey (not in a good way) cheese and full of pretty flavorless ground meat. They seem to have a sort of seafood theme, but we thought we'd go safe and each order the pasta dish. I ordered the crispy gnocchi with sausage and broccoli rabe, hoping that it might be inventive and different - never heard of crispy gnocchi before. It was awful. Almost inedible, but I was starving so I ate about half. The gnocchi was pan seared and bordering on burnt. It was gummy and flavorless and had none of the element of gnocchi that one would appreciate. The broccoli rabe overpowered the dish, and had nothing to temper it at all. The sausage was laughable - it looked like little cubes of sausage that they use for Domino's Pizza. The whole thing was disastrous and we weren't quite sure how it even was vetted and chosen to be on the menu. My boyfriend got the pappardelle with beef ragu, which had the same exact gross ground meat as the eggplant. I normally love pappardelle, but the pasta tasted gummy and too thick.\n\nUnfortunately, this restaurant does no justice to the old italian neighborhood that's it's located in, and we won't ever be going back.", "author": "Leda D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-28", "description": "Nice-looking place, charming owner - went there with a Groupon for the first time, unfortunately won't be going back.  The food was very average and reminded me of typical easy-to-make Italian dishes that I would have made myself.  And the service was a joke.  I did discover robiola cheese - made in Northern Italy - like Italian cream cheese, delicious.  Overall would not recommend eating here, there is much better Italian in our neighborhood!", "author": "Dana B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-01", "description": "I was here with my girlfriend. This place is nice! The ambiance is great, the food is gourmet, and it's not *hideously* overpriced. Beware, the portions run on the small side.", "author": "Natalia H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-29", "description": "After speaking privately with the owner and being willing to give him the benefit of the doubt that maybe he didn't realize we'd JUST paid the check when he asked us to leave, I've come to the conclusion that this guy is just as awful, patronizing, and rude as we thought he was at first. He insists that we wanted to stay at the restaurant an \"unlimited amount of time\" -- who would even do that?! -- says I \"threatened\" him with a Yelp review, and said that if I don't like his response, I can delete my review and he'll delete his. Sorry Cono, that's not how this works. You're the one running a business who has a reputation on the line; I'm just a former customer of your restaurant who had such an awful experience there that I'll make sure everyone I know is aware of exactly why Verde isn't worth a visit.", "author": "Liza p."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "It was a planned day with a list of 5 bars, my girlfriend and I had the Idea to go bar hopping in Brooklyn, being that we hardly go out in The BK area. As we walked by Verde, we realized how cozy it was in there, not to mention they had a board outside letting their customers know about the happy hour, which really got our attention quick. We walked in and while it was very small place it was elegant, inviting and very relaxed. The service was great and the bartender would go around checking on her guess every few minutes. It was nice and quiet and dimmed lights. It felt very nice being in there good to take a person on a first date, it was sophisticated but not over the top where you would have to where dressy cloths. While Verde was not on our list to go that night it sure made it to our future places to visit.", "author": "Eddie N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-25", "description": "Very confused and rude staff.  Food was sub-par and the staff had no idea how to handle their own groupon", "author": "James M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-10", "description": "We always sit at the bar (all night $5 wine happy hour) and eat dinner there. All the bartenders are really sweet. Yummy bread with quality olive oil. Staple is always the caesar salad with grilled chicken. They'll do half orders of pasta and the few Ive had are always tasty with quality ingredients. It's an easy, low key dinner spot.", "author": "Jillian M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-06", "description": "This place was a total disappointment. i ordered the chicken marsala the chicken was poor quality a rubbery feel to it. Portions are very small and everything is overpriced! The manager was extremely rude! Overall it was a very unpleasant evening. NEVER will go to this place again!", "author": "Jana M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-27", "description": "came here on Sunday after seeing cafe luluc next door was super crowded. our party of three was seated immediately...but then came the problem. waited 10 min to put our order down. my coffee came shortly thereafter. but the three entrees took close to an hr to come. looking around almost everyone had only drinks ( $14.95 unlimited mimosa, Bellini, etc). \nfood was good, I had the berry crepe. friends had the nutella banana crepe and Kobe burger ( er u know that's not really Kobe beef from Japan right ). \n\nfood was good, not memorable. service was definitely memorable in a bad way.", "author": "Kay W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-22", "description": "Meh meh meh meh meh skip it. The mussels tasted funny and smelled funny. The lobster didn't even come out with butter. They probably just buy their entrees from Red Lobster and mark them up and resell them ha ha joke's on yous", "author": "Drew C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-20", "description": "Went here with some friends for brunch and I am completely baffled as to why it was empty.  My companions were late and I was able to sit right away and they brought water without my even having to ask.  We got the unlimited brunch cocktails and they were refilled even before we had finished the previous ones.  I got eggs benedict and the eggs were poached perfectly and the hollandaise was deliciously creamy.  As a bonus, while the menu says the unlimited drinks are only served for 2 hours, they were definitely generous with that.  I'll definitely go back!", "author": "Andrea A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-08", "description": "Its alright! There are better Italian places out there.I ordered the Nutella- Mascarpone crepe. They were good but it was kinda little for the fact that it was on the brunch menu n it costed 11$. My friend ordered the Steak Sandwich for the same price n got a huuuuge plate with burger, potato, salad. I tasted his and it was really good. I mean my crepe was good too, I was just confused about the same pricing for the 2 very different meals.", "author": "Marianne W."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}