{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-14", "description": "Great food and brunch prix fixe special! Had the eggs Benedict and the steak and eggs - the steak tasted just like Argentinian vacio, salted and delicious. Bellinis were great too! Server could have been more personable, but he wasn't rude and we had a great time.", "author": "Adriana S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-19", "description": "Had brunch here with unlimited drinks. I had a burger and Mr. pook had a chicken sandwich. Both came with little salads and thick potato wedges. Yum! \n\nOur waitress wasn't shy about refilling the drinks either which was awesome!", "author": "Pook V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-26", "description": "Came here for a family holiday dinner and had a an enjoyable meal. Definitely one of the better Italian spots on smith street. The food was fresh and service was good. Since it was a group we got a chance to order several of the appetizers and main courses to share. For appetizers we had the burrata with prosciutto (very good), baked clams (very good), crab cake (average), lobster bisque (average). \nFor mains, we had spaghetti w/ clam sauce (good) - I always judge a restaurant by their spaghetti vongole! ; filet mignon (average); pappardelle w/ ragu (good); branzino (good); shrimp scampi (good). Overall I would recommend this place if you are looking for a reliable Italian place in the neighborhood.  I may return to try their brunch.", "author": "TIFFANY C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-10", "description": "Greta place for happy hour, all night at the bar.  The bartenders are always great to talk to.  Can't beat this place in Smith.", "author": "Rick D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-14", "description": "My little sister, nephew, and I met up here for brunch. She's a huge fan. I was extremely pleased by their brunch offerings. I had steak, eggs, and rosemary potatoes with a large French toast on the side. Heavenly! The French toast is heavenly! We've ventured here a few more times. I had their Nutella Crepes which is very sinful. They offer a drink special for $19.99 you can enjoy as much drinks as you want for 2 hours. You can't beat that. I love the area Cobble Hills its quaint with a lot of hip restaurants and bars.", "author": "Kayisha T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-23", "description": "During the Brooklyn Book Festival, I took a break and walked down to Cobble Hill to this place. I had planned on eating at Cafe Luluc, but the wait was a bit long and I had commitments at BBF.\n\nVerde is a nice space. I ate at the bar with a very attentive bartender serving me a couple of very good mimosas and the omelette. It was quite different, and from that perspective, appreciated. But the ricotta cheese was a bit \"runny\" which detracted a bit from the eggs. \n\nThe rest of the restaurant is nicely designed, plus there's an outdoor patio in the back that was packed on this beautiful afternoon.", "author": "Don S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "We enjoyed a delicious meal at Verde on Smith. The food is very good. We started with Baked Clams, Portobello Muchrooms Salad and Buratta Prosciutto which was really tasty, spesially the Baked Clams and Portobello Salad. For dinner we  got the Lobster Fradiavolo one of the specials of the day, grilled Salmon with spinach, Lamb Shank and Crispy Gnocchi. OMG! Everything was so delicious!!!!\nLamb is so tender, salmon is sooo good, lobster fradiavolo amazing,  Gnocchi ohhh forget it, it is best in my life!!!!!\nService was wonderful!!!\nI love love love this  place, nice music, gorgeous outdoor seating, good service and delicious food and drinks!!!!!!!!\nDefinitely will come back!!!!!\nI highly recommend checking it out!", "author": "Tanya S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-29", "description": "We went again today and brought our 2 week old son. Food was still awesome and the service was great. And super friendly waiters! Very underrated!", "author": "Mimi S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "Great service, food was delicious, and what else can you say about a bottomless brunch other than amazing. I'm surely returning for brunch.", "author": "Christian O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-23", "description": "A wonderful addition to Cobble Hill's Restaurant Row.  Food is not just good, not just great BUT FANTASTIC.  Atmosphere is restful and pleasant and normally the noise level allows decent conversations with others in your party.\n\nIt isn't inexpensive but then fresh high quality ingredients cooked perfectly don't come cheap.\n\nThe waiters are a sheer delight. Solicitous without sidling up and asking that silly question \"is everything alright\" which other places train their staff to ask while ignoring the answer.  They are friendly but unobtrusive.  And they have phenomenal\nMemories as they recite all the specials.\n\nThe owner/chef is often around to ensure quality dishes, drinks and service.\n\nThey take reservations and credit cards.\n\nIn a word, the place is GREAT.", "author": "Dean K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-02", "description": "LOVE LOVE LOVE LOVE LOVE this place!\n\nThe first time I went here was with two girlfriends for brunch and we had the unlimited drinks special. We each ordered the steak and eggs, french toast, a side of bacon, and a side of potatoes. Everything was so affordable and delicious that we had to order brunch TO GO the following week!\n\nThe staff is super friendly and their drinks are delicious! You cannot go wrong with this place!\n\nCannot wait to go back!", "author": "Karol L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-24", "description": "Must have such high reviews because of the unlimited brunch (aka alcohol), but if you're not a drinker and just going for the food...it's nothing to write home about. Had their omelette with Anaheim peppers and ricotta cheese--had absolutely no flavor to it, and was submerged in a lake of ricotta overflow. Maybe their pancakes/French toast/waffles are better but why bother with cafe Luluc next door?", "author": "Gracie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-03", "description": "These dudes set up brunch shop next to another more popular restaurant on the assumption poor suckers like us would get tired of waiting. Then they lure you in with a menu promising maple syrup and Kobe beef burgers. I can't vouch for the burgers being fake, but the syrup was definitely brown sugar, the bacon was transparently thin and came in sheets of laminated together strips that had been as if flattened out with a clothes iron and cooked into a solid sheet. So bad. Opportunistic vultures. Don't do it.", "author": "Ben T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-08", "description": "I came here with some colleagues for brunch and had a wonderful experience. We had a party of 10 and the majority of us had the unlimited brunch. The drinks were petty strong and definitely work the money. Our server was amazing and was always there every time you needed a refill.\n\nI had the sausage and spinach sandwich and it was amazing. I'm still reminiscing of how delicious it tasted. \n\nI definitely plan on going back soon and would definitely recommend it to others.", "author": "Keisha G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-24", "description": "I want like this place because of the bottomless brunch. (Always a plus) BUT I went here for brunch ordered the simplest dish,  and a few hours later I got sick. Can't say I will be going back anytime soon after my experience", "author": "Ann C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-12", "description": "Service is great.\n\nFood is good and large in portions.\n\nVenue is lovely with plenty of seating (plus outdoor seating).\n\nI've been here several times and this place always has good pasta, panini, salads...everything.", "author": "Katrina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-21", "description": "The brunch is delicious and the service is excellent.  The most important thing in any boozy brunch is how quickly your glasses are refilled. They are very attentive and very quick to refill your glass. I also like that the bottomless brunch offers a variety of champagne cocktails (mango, orange, peach, raspberry). \n\nDefinitely recommend.", "author": "Mrs S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-04", "description": "Solid brunch place. The bottomless booze is a tough one because if you're not an insanely fast drinker slamming them away, it's not really a \"deal.\" Nonetheless, their home fries and kobe burger was simple as it should be, accentuating the natural flavor of fresh kobe. The manager was very nice and accommodating. The waitress was forgetful but still nice.", "author": "Anna N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-26", "description": "TIP:  there is a restroom in the basement as well.\n\nClassic Steak and Eggs $15 (prefect portion)\n-Two eggs any style, hanger steak, served with rosemary potatoes\nFrench Toast $10 (really good)\n-Brioche french toast served with seasonal fruit \nA side of bacon $4 (not worth it, DON'T GET IT)\nAnd the unlimited drinks for 2 hours for about $17 \n\nWe were late for our Sunday brunch at 2pm, a party for 3. When we arrived the restaurant, it was only half full so we got seated right away. The waiter informed us that unlimited last called was at 4pm so it was shorter than 2 hours but that's okay. The drinks came fast and our steak was good as well. I nearly ate everything off my dish. We also had a plate of French toast to share. This was really good. it wasn't too hard or soft. It didn't soak up the syrup like other places. It was still in food texture an hour later into brunch. The side of bacon was just 3 bacon and it was over cooked, hard as a rock.... Drinks were strong. It was worth the price. I enjoyed my brunch here and would come back again.", "author": "Tillie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "The French toast was delicious! Eggs were perfect. Mimosas exceeded expectations. The service was amazing!! I have zero complaints about this place. I will definitely be back!", "author": "Cam J."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}