{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-09", "description": "Just fantastic! Wandered in here with my husband last night and will definitely return - an impressive list of specials which were difficult to choose from in addition to the regular menu and the service was A1 as others have said", "author": "Emma N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-09", "description": "It's OK.  Went here after purchasing a recent Groupon offering.  There are plenty of great Italian places in the neighborhood and I already have my favorites, so I never really had a good reason to check out Verde earlier.\n\nService was great... even though we had to argue a bit that our Groupon was legit before they would let us leave.  Food, drinks and dessert were just ok.  As other reviews have mentioned, there are better places for Italian in the area and, in my opinion, there are places with better ambiance.  \n\nI doubt I'll go back, but I would be open to checking Verde out again.", "author": "Lonnie James L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-24", "description": "Last sunday me and some friends had unlimited brunch here the food was amazing and the drinks were strong but lacked flavor; Which is not an issue for me, enjoying a stiff one from time to time is ok. Service on the  other hand was the worst I ever had in New York. My waiter was extremely rude when responding to questions and acted like it was an burdon on him to service my table. On top of that he took my friends plates off the table when they were still eating CRAZY right. Louis you will never get my service or money agian.", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-17", "description": "Amazing steak \u0026 eggs!! And boozy brunch with good service, always a plus. Love that there's a champagne only option. Will definitely come back!", "author": "Idalia F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-14", "description": "You know when you're a little toddler and you have a blanket that makes that mini OCD monster in you come out? You break into hysterics if anybody tries to take it, you hate your parent if they forget it, and life is just peachy when you have it? Well.... I never had a blanket like that, but I imagine many of you did - so you can relate: that's Smith Street for me. It's mine. I love it. I'll cry if you go without me. \n\nI'm rather possessive of the restaurants and bars along Smith, and I find it's a happy little rut that I don't always climb out of. I did, however, venture to try a new place recently, rather than one of my usual haunts. It was Verde- they had me at \"$5 Lychee Martinis!\" As far as I am concerned, there are a bajillion ways to say \"I love you,\" and 'lychee martini' is one of them.\n\nMy Verde experience worked for a quick drink and bite to eat, but I'm not sure I can make it one of my regular Smithies. On the plus side, the bar was casual and more lively than the dining area- great conversation and a very nice bartender and staff. I had the mussels in a blonde beer broth - not only delicious, soak-your-bread-in-it-and-lick-the-bowl-clean, but a larger portion than I expected for the $7-8 range. \n\nThe down side- the martinis were a bit small and lacked actual lychee fruit, the staff didn't seem to know the menu items or their computer system. All of that can be easily conquered though, so hopefully the kitchen keeps knocking out great food, and the front of the house can catch up!", "author": "Mo S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-10", "description": "My brother and I took my mother here this past Wednesday for an early Mother's Day meal because he's retuning to Australia today.  The service was superb!  Our wait person was very patient and let us take as much time as we wanted to go over the menu and specials with him.  Our meals arrived in a timely fashion, hot and DELICIOUS.  I'll definitely be returning to Verde on Smith very soon.  Perhaps tomorrow evening.", "author": "Kenyatta A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "Food awesome. Great service, very friendly. Perfect place to share your dinner with friends.  I had great experience with my friend there. Moderate prices.  One of the my favourite places in the city.", "author": "Hanna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "Every time we come here without fail we have an amazing and service. The bartenders for brunch and dinner are always great and the server we get Louis is so nice and we want for nothing when he takes care of us! The brunch is such a great deal with boozy brunch plus yummy entrees and dinner if you come in with a Large group they're so willing to accommodate!", "author": "M E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-25", "description": "This little trattoria on Smith St. is simply divine.  Don't let the pretty decor and excellent food fool you -- it's surprisingly affordable ($18 lobster special? Um, yes please...) and friendly.  A local gem.  They have amazing drink specials, well-crafted pastas in the $12 range, and if you smile at the owner in the right way, are known to serve up cocktails on the house to extra-friendly tables.\n\nThere are a lot of restaurants along this stretch of Cobble Hill, and many of them are quite good.  Verde stands out, however, because aside from serving up the deliciousness, it's as unpretentious as it is beautiful.", "author": "Debra K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-08", "description": "I've been here several times for Sunday Brunch.  Love this place.  Not only are the waitstaff friendly and on top of things, food is delicious and their selection of bottomless mimosas is wonderful.  Looking forward to my next visit!", "author": "Jennie B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-02", "description": "Location:  Deep into Smith Street from Atlantic Ave.\nDecor:  Beautiful\nHospitality:  ZERO (scroll down for reasons)\nFood:  Eh!\nPrices: cheap and cheerful (but I'll NEVER go back)\n\nReason for going there: Purchased an Amazon Deals discount for $15 off a $30 value meal.  \n\nBooked via OpenTable.com, and upon arrival provided the waiter at the door the print out and joined my guest who was there.\n\nUpon sitting down, the waiter comes over and asks if I had another coupon because the one I had provided was \"used\".  I said \"No, but I did get another as a gift. and maybe they got mixed up\"  So I called that friend immediately and he confirmed he didn't use his either.\n\nThe waiter shows me an Amazon print out list of names and coupon numbers with someone's handwritten date against MY coupon number as proof it was used.  By that time I was livid, embarrassed and had enough of their unprofessional behavior.  He scurried to the back of the restaurant and came back to take our order explaining that people have ripped them off before with duplicate coupons.  Nice.  I was dressed in a business suit coming from work and my guest didn't look like a $15 thief either. :-(\n\nThe owner and his barmaid conveniently stayed away and chose to let their Hispanic waiters communicate with us.  If not unprofessional it was in poor taste! (but I would find out that later)\n\nI ordered the special stuffed Cornish hen with bacon etc. ($24)  It was so overcooked/baked that the outside was crispy and the insides insipid and dry.  I managed to eat 25% of the 'meal'....and decided that this was the first and LAST time I will make the mistake of setting foot there!\n\nEntire bill came to $68.  Not worth the bother of a lousy $15 \"discount'.\n\nAdvice:  Walk on by.", "author": "Bryan F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-11", "description": "This place is amazing , the unlimited mimosas are strong and if you're lucky you'll have Hector as a server. He's so sweet and the best server there( we've had others). The food for brunch is really delicious but our server really made it a great experience . Would come back here for sure ... Good food strong drinks !!! Love this place!", "author": "Arianna D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "My go-to on Smith street for both dinner and brunch. I've been to Verde more times than I can count and I have never had a meal that wasn't excellent. The atmosphere is far less hipster than a lot of other options in the area, which in my opinion, is a nice change of pace. Simple, high quality Italian food, and nicely made cocktails.", "author": "Olivia Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-19", "description": "My husband said \"I'm full but disappointed\". Which summed it up for me too. Nothing really wrong but nothing really right. Next time its LuLuc for us.", "author": "RadicalNewTherapy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-04", "description": "Do not go here. Sorry, they lack any and all basic perception of customer service. Yes, your tables were teeming with patrons but the way my sisters and I were ignored, dismissed, and disregarded left us with a terrible taste in our mouths. I was eager to try the food but now not so much. WOW, the incompetence and rudeness I saw was unspeakable and it was saddening to see that classism, bigotry, and prejudice are alive and kicking... this is my opinion based off of my experience. Really, what was it about us  that prompted this lack of service and caused two staff persons to show us how annoyed they were while serving brunch today? Have things become a bit unmanageable or out of hand with this restaurant? We have had our fill of VERDE exasperated staff lashing out on paying customers (no groupons or deals for us, cold cash only), maybe I can return when management or ownership is changed. Eek! Methinks NOT!", "author": "Rose K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-24", "description": "Food is very good and the unlimited brunch special is awesome but the people who work here are NASTY as can be. My friend ordered the chocolate crepes and they accidentally brought him fruit crepes, when he pointed it out they told him there was nothing they could do and refused to correct the mistake. The manager is incredibly rude. I was eating with a group of 8 friends, the unlimited brunch deal is a flat fee for 2 hours of bottomless drinks, the manager tried to kick us out after an hour and 20 minutes, when we told him we had paid for the full two hours and he told us it was \"too bad\" because they needed the table. This was not true because nobody was waiting, and even if it was, we paid for the two hours and they can't just kick people out whenever they please. Most recently I ordered a raspberry Bellini with my brunch, I didn't like it so I asked to switch mango when I ordered my next one and my server told me that he had already asked the bartender to make me a raspberry one and that I would just need to drink it and he would bring me a mango one when I finished it. I honestly am shocked by the way they treat their customers and have never experience something like this.", "author": "Jeri E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-03", "description": "Really had a great time there with a friend - the lighting, music and ambiance are great. Very nice service - not rushed, attentive. I just had wine and salad, and loved both. Looking forward to coming back.", "author": "Anna G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-31", "description": "Came in here after having drinks nearby with my better half on a Monday night. While I was a little apprehensive at first to enter given that there was no one inside dining, we chalked that up to it being a Monday night. We're glad we decided to give Verde a try. I had some pasta with meat sauce, my girl had rigatoni with a tomato sauce and prosciutto, both were pretty fantastic. Would definitely come back here again.", "author": "Alex S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-03", "description": "Short and simple I loved the food! We went on a Monday night after work so there was no wait time. The waiter kept brining over bread which was a good and bad thing. I love bread so that was the good put the bad part was I couldn't stop eating it. We will go back, I recommend the linguine with mussels.", "author": "Ciara S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-17", "description": "Ive past this place a bunch always thinking, \"oh i should go there sometime\". Had company in town thought we would try it out. scallop dish ended up tasting soapy. service was a little snappy even for a saturday night. eh.", "author": "Jackie L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}