{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-07", "description": "The OK:\nLiving Social voucher.\nBread with olives and olive oil.\nBaked clams oreganata.\nTiramisu.\n\nThe UNACCEPTABLES:\nEven though she gave me a compliment on my glasses, the waitress was creepy and looked like she could use a friend. \nMy generously-bad-salted crispy gnocchi which one-noted my way out of eating the whole dish.\nNot finishing all my food (most unacceptable of them all).  And I don't do the \"leave food on my plate\" thing.\n\nThe SIDE NOTE:\nWill not return for seconds.", "author": "Ava H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-20", "description": "The service is great \u0026 everything I've ever eaten here was delicious.  From seafood, to pasta, to steak; it's all great.  And don't tell anyone, but their kobe burger could be the tastiest burger in the hood.  I know this isn't a beer bar, but better choices on the 4 taps they have would make this place a solid 5.", "author": "Bryan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-14", "description": "We had a Restaurant.com voucher for dinner, which is the only reason we ventured in, being that the place is usually empty.\n\nThe wine we had at the bar was terrible; the bartender was really nice (which was the restaurant's ONLY saving grace).  \n\nIt's not worth getting into the details, but the manager/owner was snobbish and rude and we ended up leaving right after having a drink, not even bothering to stay for dinner and use our certificate. \nWe will never go back and I wouldn't recommend this place to anyone.", "author": "D S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-15", "description": "The place has great ambience and an amazing feel. The presentation of food is also very pleasing. However, the food is quite overpriced while maintaining mediocre quality. You can make better pasta at home for much much less. In fact, I can make a bangin baked ziti for hoard of people that will blow your mind off for less than one simple pasta dish (which is the cheapest entree on their menu) at Verde. \n\nI suggest you go if for a special occasion. But try to find some sort of restaurant certificate that allows you to spend and eat here at a discounted price. It's not worth it without one.", "author": "Diana C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-25", "description": "Horrifyingly slow service. it took almost an hour to get our main courses and frankly the quality of the cooking was not at all worth the wait.  Both entrees were way too salty; so much so that I can't help wondering if this was the kitchen's up-yours response to our having wondered when we'd get our food. And the waiter never bothered to refill our bread until we asked him to when we asked about our entrees. The restaurant seemed to have a nice crowd so obviously, there are local folks who like it. But we felt it was money down the drain and would never consider going back.", "author": "Marc G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-25", "description": "Food was mediocre, bread was stale.", "author": "Nicole B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-09", "description": "We celebrated a friend's birthday at Verde last night in the courtyard in the back of the restaurant. It's such a cute little space and it would have been much nicer if the weather cooperated more. It was windy and cold but I'm not holding the restaurant responsible for that. The service was quite responsive and friendly to us. We had about 25 people in our party. Because of the large party, we had a set party menu. \n\nIf you're going to try something new, you should try the \"Barbabietole Con Porri E Robiolina oven roasted beets with leeks and robiolina cheese\" -- Probably my favoritest dish of the whole night. Also on the menu was Filet Mignon and Seared Sushi grade tuna and two pasta dishes. I felt the two pasta dishes were a little on the salty side. The Filet Mignon and Seared Tuna dishes were both perfectly cooked and delicious! \n\nThough we did not eat inside, the decor was quite cozy and appealing. I would return, but not when the subways are not working properly.", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-16", "description": "My husband and I have made Verde on Smith our Sunday night spot, every single Sunday. We love fine dining, and hitting the top NYC spots. Verde may be small, and not on any of the top 5 lists, but everything about it is as fine as it gets.\nThe staff, the owner, the food, and the ambiance, what a treasure of a place. It is a neighborhood gem in the truest sense of the phrase and we could not praise it highly enough.\nPlease love Verde, it will absolutely love you back!", "author": "Whitney B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-27", "description": "The food was good but the service was terrible! Got the mushroom and onion omelette and it was really good! Wanted the unlimited drinks (which was $17 pretty steep if you ask me) after we waited for 10mins for some belinis we asked the waiter when   will  the drinks come and if they come with the food. And in his condescending tone told us that they would come before. And guess what...Yup! They came AFTER the meal. The ketchup came before anything (the water, drinks and meal) strange. Overall I would not come here.", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-18", "description": "Great food and great service! What more could you ask for?! It was a snowy Tuesday evening and my boyfriend and I decided to use our coupon from restaurant.com for dinner at Verde on Smith. The ambiance is quite romantic being quiet with dimmed lights and candles. We were greeted by our waiter right away and received a bread basket with olives and oil to start. We didn't have any alcoholic drinks but the food was excellent!  I had the scallops and shrimp with spaghetti and it was perfection! It came in a white sauce that wasn't too light or too heavy but just right. My boyfriend had the penne a la vodka with chicken and he raved about his meal being delicious also. All in all we enjoyed our dinner date and will definitely return to Verde on Smith in the future.", "author": "Crystal C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-04", "description": "I love Verde.  I love Verde for brunch and dinner.  \n\nWhat I really love at Verde is their banana Nutella crepes.  Just thinking about them makes my mouth water - and I'm not usually a sweet brunch person.  If you're a savory brunch person their eggs and omelets are amazing too - especially the arugula and cheese one.     \n\nFor the life of me I can't figure out why is this place empty when its neighbor (you know who it is) always has a wait outside, while the only thing those guys do well is the pancakes, even their coffee sucks.  \n\nVerde has a lovely back garden too, people of C-Hill!  Change it up and give it a shot - great service, fresh and all organic food, you'll think you have discovered a hidden gem.", "author": "Meredith K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-04", "description": "I went to this restaurant on Saturday and it was amazing the food were excellent and delicious. This were my first time there and the service were amazing. I give them a 5 stars because they deserve it and including the chef, that they worked hard on their cooking. I'm planning going back there again.", "author": "Tonia F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-17", "description": "I really enjoyed my dining experience at Verde.  The owner, was very welcoming and kept checking in on our table of 8, which by the way meant that we got a free bottle of prosecco (SCORE!)\n\nWe ordered the baked clams, the seafood salad and fresh prosciutto to start.  They were all delicious, the baked clams were almost as good as my grandfather's which is a pretty damn good compliment.  \n\nI asked our wonderful waiter, Richard, for a reco on pasta he said the gnocci or the puttanesca.  Um yes anything with olives and capers has my name on it.  When the pasta came I was pleasantly surprised.  It was really good.  \n\nOverall I love the ambiance of this place, live music, gorgeous outdoor space and really pretty dim lighting and decor.  I would definitely go back!  Grazie!", "author": "Kimberly L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-20", "description": "My boyfriend and I have come here twice for date night using the restaurant.com $25 gift certificate you get for $5. We have had enjoyable nights both times. The wine has been good (around $40) and entrees range up to around 30, so our entire tab with tip for bottle of wine, appetizer and 2 entrees was around $80 with the gift certificate. Not bad for a date night! This most recent trip, we got the portobello mushroom, goat cheese app which was delicious, the chicken asparagus tortellini special and the mussel linguine. The bread they serve is soft and fresh. Both times our waiters have been amazing and helpful! The place itself is very romantic and cute, with the exposed brick and dark lighting. We want to go back to sit outside when it gets nicer out and also want to try the unlimited brunch!", "author": "Jojo S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-15", "description": "I decided to host a brunch here. We had the entire garden to ourselves. The waitstaff was great. Int he end the owner Cono tried to charge me for an additional person on the final bill. I informed him that we had the exact number of people 25+ that we agreed to. He started arguing with me in front of my guests. The nerve!!!! Good food but not worth the attitude. Hello Cono, when we are giving you over $1,200. and not causing any issues please be courteous.", "author": "Daphney K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-25", "description": "Food: Their nicoise salad is my go-to, while my boyfriend has tried, and loved, their burger and chicken marsala.\n\nDessert: They have a banana crepe for dessert that's out of this world delicious!\n\nAtmosphere: I've gotta say, Verde has a gorgeous set up, with some outdoor seating for warm weather days.\n\nService: The service has always been attentive and kind.  Absolutely nothing to complain about there.\n\nAlso, I've partaken in their AYCD for ~$15 brunch deal, which was a crowd pleaser :)", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-04", "description": "Have been here several times for brunch. Good selection. The dishes are very good, not THE BEST, but you won't be disappointed. They have a bottomless brunch option for drinks. Cafe Luluc next door is better, but cash only.", "author": "David P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-28", "description": "I really do love this place. The atmosphere is laid back and very chic. They have an adorable little patio in the back for dining. In my few times here, I've never had a bad experience with service - the wait staff has always seemed very timely and attentive!\n\nThe food is great, the ingredients are fresh. Both the food and the drinks are reasonably priced and some of their specialty drinks are a lot of fun -  my favorite last time was a mix of whiskey, strawberries, and Tabasco... YUM!\n\nI love this place as a date spot, and I think that the bad reviews should really be outweighed by the good!", "author": "Christina S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-27", "description": "The filet is sirloin and its 35 bucks for about 4 oz.", "author": "Wyckoff K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-27", "description": "First off, the decor is beautiful and the hostess and waitstaff were very friendly. Met a few friends for drinks, ended up snacking on a few appetizers and dessert. First we had the beets with leeks and some kind of Italian soft cheese, which was AMAZING!! I can't stress how amazing and fresh the cheese was! The second dish was the, sardines with red onions ( reminded me of ceviche). I loved this dish, despite my hatred for any raw fish whatsoever. The fish was super fresh and the flavors melts together in your mouth.  \n\nI had a late lunch that day, so after snacking on the appetizers, I jumped straight to the dessert, I had the  chocolate cake with mousse,  which was so rich and filling that I didn't want to share with anyone!\n\nI am definitely going back for drinks and to try the other items on the menu!", "author": "Tanasha S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}