{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-28", "description": "I wanted to review Verde immediately (we were there last night) because I felt there wasn't very much about it that was memorable and the experience might bleed from my memory quickly.\n\nThe outdoor garden is lovely, though hot because the fence blocks the breeze.  The food is fine, almost good, but ultimately forgettable.  I had the salad nicoise which was overdressed, but tasty and the BF had the gnocci.  Each ingredient in his pasta was fine, but they didn't really come together.  \n\nIf this were the only place on the block I'm sure I'd come back but with Smith street hopping with great places to eat Verde seems unnecessary.", "author": "Becca F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "I can't believe how many times I've walked past this place and never gone in!  Luckily, I came to my senses recently and had dinner.  The only draw back is that the food was so good, it gave me violent thoughts.....that's not weird, right? \n\nAnyhoo - I really like the look and feel of Verde.  There was a cool blue grass (or something?) trio playing at the front of the restaurant.  They sounded amazing.  We started off outside in the garden, which we had to ourselves.  Cut to twenty minutes later when we got attacked by mosquitoes so we headed back inside (c'mon, the bottom of my foot, REALLY?!!)\n\nWe shared the Eggplant Lasagnetta - it was so good it made me angry.  Like punching someone in the face angry.  It's ridiculously delicious.  You could have it as your entree because it's rather large - I'll remember that for next time.  \n\nFor my entree I had the Salmon with Spinach and Couscous.  Again - so good I wanted to physically harm my dinner companion.  That's ok right?  My dinner mate had the Straccetti -  mouth watering sliced fillet mignon over a bed of arugula and parmesan cheese.  I found myself reaching over the table quite often to steal some juicy morsels.  And again, wanting to kick someone in the back bc it tasted so damn good.  \n\nFresh, yummy tasting food, good drinks and excellent service - I'm definitely going back, hopefully next time I won't be so angry about it.......", "author": "Monks C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "We wandered in here on a cold snowy night (first night of Spring!!!!!!). We'd been in for drinks a long time ago, but never a meal.\nIt was not crowded, but we decided to sit at the bar, as they have a sort of endless \"happy hour\" at the bar. We had lovely cocktails, then ordered food and wine. The\nbartender, Tanya, was quite pleasant and very professional. There is a TV at the bar but\nthankfully it was not on. (I don't remember it ever being on in 3x there) They were playing very cool rock (or whatever) music on the sound system. All in all, great ambience.  Elegant and yet quite cozy.\nWe ordered a house salad and the fried gnocchi/sausage/brocc rabe to split, and it was\nmore than enough to satisfy!! And it was DELICIOUS!!!.\nAll in all, maybe the best dining experience we've had on Smith Street, which is chockablock with over-hyped, overpriced, and/or underwhelming restaurants.\nCan't wait for the outside dining area to open!!  Though sitting at the bar, which we don't usually do, was remarkably enjoyable.\nHighly recommended!!", "author": "Paul S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-18", "description": "Very sedate and pleasant atmosphere. Had baked clams as an appetizer, and a whole bronzini (Mediterranean sea bass) as the entrée. Impeccable.", "author": "David P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-15", "description": "Such a great place to grab lunch on the weekends. Always a great experience. Their bloody mary's are the perfect mix of alcohol and spicy. Service is great. They have a cool backyard as well as indoor seating. Loved the chicken sandwich. Definitely recommend for anyone who wants to enjoy great food in a chill environment. Many things to do around there as well.", "author": "Brian G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-14", "description": "I planned my birthday party here after having a great dinner and happy hour with friends. The planning experience was awesome. menu was set, prices great and responses were fast. I had about 21 people and we were set up in the backyard.  It was windy/cold but its not all their fault for that , note: Verde does not have out door heaters. \n\nThe drinks were flowing for the first hour, appetizers were scrumptious (get the beets even if you don't like them you will become a fan). The pasta dishes were on the salty side, i believe they over salted because they were making big batches instead of individual dishes. \n\nWhen the second hour approached the restaurant got busy and our food took a little longer to come. The waiters went back in to serve the dinner rush and we were left on our own in the cold. The main dishes were cold but tasty, think about if it was cold and stuff tasty it must be scrumptious if they were piping hot. \n\nSo over all... I probably would not have another party out doors since there are not heating units in case of the cold. I wished the pasta was not over seasoned but other than that, Get the BEETS, the fillet was delicious and the tuna is excellent on its own, wasn't a huge fan of the mashed beans.\n\nIf you can eat with a couple of friends in the dining area the service is great and you will be warm.", "author": "Tassamai S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-10", "description": "Fantastic food and lovely, attentive service.  We came here via Savored and its been our best experience (of a number of good experiences) using that site/service.\n\nWe had the eggplant \"lasagna\" appetizer, the tuna with cannelini beans and escarole and the gnocchi with broccoli rabe and sausage and each dish was excellent.  The tuna dish in particular was wonderful.  Our only criticism was with the montepulciano by the glass, which was okay (and generously poured). . . just not up to the exceptional level of the rest of the meal.\n\nThe space is really nice, the music even better, the wait staff was impeccable in their responsiveness, and the prices were great for the quality and presentation of the food.  \n\nIt's a hike for us but we'll be back again very soon and we'll bring pals next time.  Great place to share with others.", "author": "Viv L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-27", "description": "I don't know why this place isn't rated more highly; I legitimately had the best burger of my life this past weekend at Verde and would love to go back there again. I went for a late birthday brunch and had bloody mary's that were good, but needed to be more spicy, which made them a lot better -- but that is always my preferred method of making things better. The place is swanky inside, very comfortable, cozy, and pretty small. I'll definitely definitely check it out again.", "author": "Farrell M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-18", "description": "Love the decor and atmosphere here! Not too fussy, just the right mix of sophisticated and homey.\n\nNow to get to the food: First, my friends and I ended up getting a very very late brunch, thank god they still had it available as it seem every other place in the area seems to have finished their brunch much earlier. I ended up having the tuna salad with arugula and I have to say it was much tastier then I expected.  My friend also had the panini which was pretty size-able and her nice had the spaghetti carbonara. I was pretty worried about her nice since kids are not very willing to try something new, but I was relieved to see she finished her plate up in less then 15-20 minutes. She loved it!.\n\nWe couldn't leave with just brunch (especially since we'd been eyeing the deserts brought to a table nearby) so since we couldn't decide we ended up getting both the nutella and banana crepe and the pineapple ravioli.  The crepe was wonderfull, very thin (just the way I like them) and filled with a mixture of ricotta and nutella, topped with bananas and of course, more chocolate. :-). I have to say I didn't expect the mixture of nutella and ricotta, and didn't know what that would taste like but we ended up loving it. My friend on the other hand  was partial to the pineapple ravioli filled with coconut. Very very light and great for a summer desert. \n\nThe only regret we both had is that we ended up at the subway station before we realized we forgot to ask for a dinner menu. We are definitely heading back for dinner sometime. (SOON!)", "author": "p m."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-07", "description": "Went with 11 ladies for brunch - keeping it short and simple since that's all I think it deserves.\n\nBellinis were amazing and definitely got the job done. \n\nFood? Meh. Portions were really small. French toast was pretty good, fritattas were alright . None of us were impressed with the quality. Really cool atmosphere, nice very attentive waitstaff - the con was simply the food. But for 15$ unlimited drinks, you'll take the eh food lol", "author": "Jessica A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-02", "description": "Great place! I hosted my sister's bridal shower brunch for 10 ladies here last June and the owner of Verde on Smith was extremely helpful in setting everything up.   We had a big table in the back garden and ordered off the menu but also did the unlimited drink deal and really enjoyed the afternoon.  Food, drinks, and service was great and they let us stay as long as we wanted (and just paid separately for more drinks...).  I would definitley go back and happily plan another brunch party here!", "author": "Carrie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-26", "description": "the service here is wonderful.my daughter and i were made to feel very comfortable . i use a walker and oxygen which proved to be no problem for the waitstaff. i had their baked clams for an appetizer ,and they were to die for.my daughter and i both ordered  Lobster Fra Diablo. it was done to perfection. we had a excellent  wine choice that was recommended from our outstanding waiter.the dessert and   cappuccino  was yum.\ni had enough food to bring home and have dinner again tonight.\nps we used a groupon and it was not a problem.", "author": "pat g."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-17", "description": "Brunch Review:\n$13.95 unlimited brunch cocktails (bellinis, champagne cocktails, screwdrivers, bloodies) = YES PLEASE!\n\nThe undercooked food = pass\nBurger was raw in the middle, french toast was soggy + had to be sent back, salmon was raw in the middle...\nI waited almost 30 minutes for the entrees to come out and the food was not even fully cooked?  At least drinks were constantly being refilled or I would have walked out.\nStick with the pasta and panini's if you have to eat at all.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-09", "description": "Verde opened recently on a strip of Smith with many similar restaurants, and I always welcome another option.  We went this morning for brunch, and I'd say it's exactly what you'd expect:  food is fine, nothing special but be definitely didn't have the experience of some of the earlier reviewers with long delays and such.  I think they may have worked out the brunch kinks at this point.  If you like Apt. 138, Cafe Luluc, etc, you'll probably find this fits into that general style of restaurant.\n\nThe one thing that really needs to be changed is the music.  It's maybe 11:45 AM, Mother's Day, and I was confused as to how we had ended up in Ibiza.  *Loud* techno pumping from the speakers made me wonder if I could get a side of E with my omelette.  I'm talking serious untzUntzUNTZ techno here.  Guys, it's before noon on Sunday.  Let's put down the glowsticks and simmer down.\n\nOtherwise, totally fine experience.  I wouldn't rush out to eat there but it's a fine brunch option at this stage.", "author": "B P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-12", "description": "We used a Groupon deal to try this restaurant out, and were very glad we did.  Overall, a very good experience.\n\n*Tasty bread, olive oil, and olives\n*Tasty \"eggplant parmagiana\" style appetizer\n*Very tasty mussels (typical white wine/garlic broth, but really tasty)\n*Great ribeye steak -- charred outside, flavorful inside\n*Scrumptious gnocchi with broccoli rabe, sausage, and more of that white wine/garlic brothy sauce.  Gnocchi had a great texture, and the broccoli rabe wasn't bitter at all.  I wasn't bothered by the duplication in taste between this pasta sauce and the mussels -- it was so good I was glad to get it twice.\n*Delicious lobster special -- don't know how they managed to get sweet corn in April.\n*Sorbets were a little icy, but tasty; cake was a little crumbly but tasty, and ice cream was creamy and delicious\n*Wines were pricey but tasty\n\nMy only two cavils -- a little pricey, and they mistakenly charged me twice for a replacement drink when mine spilled.  They couldn't have been quicker or nicer about removing the charge, however.\n\nThe owner/manager came by a few times and seemed genuinely happy that we were enthusiastically happy with our food.\n\nThe waiters were good with our 10-year-old kids.\n\nSince this restaurant is just up the block from us, we'll add it to the places to go for special occasions.  Unfortunately, a little rich for us for daily fare...\n\nPS -- they weren't the least bit snotty to us about our Groupon.  I have a DEEP problem with vendors who offer Groupons and then are unhappy with the results and treat their Groupon clients as chiselers and/or second-class citizens.  Thanks for not doing this, Verde!", "author": "Carmela F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-12", "description": "Wow  had some great dinners here   cannot beat the value with either a scoutmob or restaurant.com certificate   nice atmosphere   good menu   attentive, personable wait staff    go there you won't regret it", "author": "Edward W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-06", "description": "Came to this FoodFan Select restaurant for brunch and was extremely happy with my decision. The atmosphere allows for a date or a group setting. The staff is friendly and attentive making sure you're satisfied. \n\nI ended up ordering the Smoked Mozzarella Panino and am not lying when I say this was probably the best panini I've ever had in my life. The potato slices that came along with the panini were also just as good. The brunch drink deals are great and alone are enough to bring me back. \n\nWe saved a good amount of money with Select even though the prices weren't that bad. Great decision coming here!", "author": "Adrian G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-27", "description": "I really hate rating places less than three stars but I have to sometimes and this is one of those times. I know my review won't make or break anyone's business (hopefully), but it bothers me just the same. Ok enough of my crying.\n\nI shared some baked clams which were good and ordered the shrimp scampi with saffron risotto for myself. The scampi started off perfect I had about 6 or 7 shrimp surrounding my risotto and I was pleased. The problem started about 2 shrimp in. This food is salty, like make me drink water salty and I HATE plain water. I'm saying maybe it's me I've been on a hybrid grapefruit diet so my palate may be wacky who knows. I look over to my food partner in crime Ava E. and my mouth hit the table....she was not eating her food with the normal ravenous vigor I am accustomed to seeing her eat with! What the hell?\nYou guys wanna read something even more scary? In my ten plus years of knowing Ava E. I have never, ever, ever no seriously never seen her leave a dish unfinished!\nAt Verde she did so ummm yeah.\nThe only thing we both agreed was good was the tiramisu which is why they sadly get two stars from me. Sorry guys!", "author": "Quana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-20", "description": "I've been dining at Verdeon On Smith on and off for two years. I always make time for Verde, they always remember me, and they always go out of their way to make me feel welcomed; like family...\n\nIt is a very personal experience, dining at Verde's. All the wait staff, including the owner Cono come over to speak, talk about specials and wines. Everyone is exceptionally well-versed in all the aforementioned. Some people don't like such familiarities, but I do, and this just adds to the entire experience. I allow for 2 hours or more when eating here. I'm never in a hurry, and tears roll out of the corners of my eyes as I finish one dish and prepare to move on to the next.\n\nEverything is made from scratch. The wine list is superb, with many delicious \"sleepers\", which the waiters all know, and pair with food like nobody's business. The best way to get the most out of your time here is to just kick back, let everyone be brilliant and enjoy the exquisite culinary ride!", "author": "Nicloe M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-28", "description": "So we've tried Verde on Smith several times since its close to home and their Lobster Special was intriging. Nice decor but dimly lit have to use cellphone to illuminate the menu to read it. (could also be old age effecting me) What we enjoyed was the Loster Bisque, mussels with white wine sauce, the loster special and seafood pasta dish. We arent too experimental if we find something we like. So we like!!\nI see live music on weekends but choose to visit during the week when its quieter. So only good things to say about our Verde dining experiences", "author": "Rich M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}