{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-03", "description": "I've been to Verde three times now and can say that I like this place and don't know why I don't go here more often. The food is good, the outdoor patio is lovely, and it's pretty easy to make a reservation here. The service can be a little slow but I don't particularly mind a long drawn out dinner. Menu favorites include beef carpaccio, crab cake appetizer special, spinach and gorgonzola salad, salmon entree, and filet over arugula entree. I haven't ordered a pasta yet but will next time and hopefully will remember to update.", "author": "Tamara F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-22", "description": "Very romantic and well organized place. They have the best happy hour prices in town and their food is awesome. I love how they keep the front of the restaurant open in good weather and it really keeps the mood going. Great margaritas and tapas on the menu.\n\nStaff was so nice and helpful. Will be back from Iceland!", "author": "Erling I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-06", "description": "I had dinner here with a friend using a groupon recently.  The food was really excellent.  We shared the burrata with prosciutto (amazing), the crispy gnochhi with broccoli rabe (also amazing) and a chicken dish that didn't stand out but certainly wasn't bad.  The restuarant is very pretty and the service was friendly and attentive.", "author": "Christine J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-01", "description": "This is an UNFRIENDLY GROUPON  ESTABLISHMENT!!   i went in on Friday night ordered a glass of wine off their specials. After ordering a steak I presented my groupon now to the bartender.  She got  real nasty and said my wine was not on special since i had a groupon.  After ordering the steak the owner comes over and tells me he is out of steaks for the evening so I switched to the tuna.  He also says that there was a 2 person minimum to use the groupon now but he would make an exception this time.   I reread my groupon now and nowhere does it state that it was a 2 person minimum.  I showed it to the bartender and the owner comes running over screaming that he owns the restaurant and not groupon!     So I got up and walked out after driving a half hour to come to this restaurant.   I found a nice little cuban place up the street where i had a very nice meal.", "author": "Anthony R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-20", "description": "I lurve this place....the ambiance is nice, it's not over crowded, and very intimate for a dinner for two.  I've never had a miss with the pasta dishes and the gorgonzola salad is my fave.  The food is on the cheap side...you can totally enjoy a full dinner here.", "author": "Yukie P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-19", "description": "I'm still surprised they are able to attract moderate Smith Street crowds, especially with so many better Italian choices in the neighborhood (Brucie, Pane e Vino, Fragole, etc, etc).  When they first opened a while back, there were some pretty exciting dishes.  I still remember the pasta dish with uni on it, yum.  Somewhere after they switched out chefs, and the food fell off a cliff.  Tried their \"lobster feast\" since then, which I find to be a funny name for half of the tiniest lobster tail I've ever seen.", "author": "Carter P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-08", "description": "The only reason we went here was because we bought a gift card from restaurant.com.. the place was not bad or horrible just nothing worth going back for... the crispy gnocchi was dry and slightly burnt.. the chicken Marsala was good but the sauce was slightly too much/rich.. the ceasar salad so ok but nothing great. The service was good but all and all even with the $25 gift card this experience was not worth the $80 price tag.", "author": "Aimee M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-18", "description": "Went with two friends. One had asked for her steak medium rare. It came well done and had to be sent back. I had the tuna whichI I found tepid and inedible and Im not a food snob. The tuna is advertised as fresh but it had no flavor and was likely frozen. One friend had the shrimp scampi which was pretty good but the cream sauce was heavy as opposed to \"light\". I wont go back.", "author": "Tasha E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "Verde is a lovely spot in a neighborhood where restaurant options abound.  Their menu is entirely organic and focused on northern Italian cuisine.  I've been several times for dinner and/or drinks, and I've never been disappointed.  Their pastas and cheeses are delicious and their wine list is quite good (and very reasonably priced).  The ambiance is low-key and relaxed, with abundant Edison lights and a lovely back garden in the warm weather.", "author": "Micaela L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-12", "description": "Went here for dinner with my girlfriend. Food was absolutely delicious. The lobster was incredibly fresh and the lamb was fall off the bone tender. Service was attentive and friendly. We will absolutely be returning here.", "author": "Kyle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-23", "description": "The service was the highlight of the night. The waiters were all very friendly, professional, prompt and thoughtful. Their homemade pasta with pesto was a great dinner special.", "author": "Sandra K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-16", "description": "The brunch here is delicious and the service is wonderful. It's got the hipster vibe. The only thing is that they have a B rating from the city but you wouldn't know because they stuck it at the bottom of the glass, where the chairs and sign cover it. That's a little shady to me haha but I love my experience there so I let that tidbit slide.", "author": "Linda N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-13", "description": "My husband and I had a really nice meal here. The spinach and gorgonzola salad was especially good, and large enough to share. He loved the gnocchi with broccoli rabe and sausage, and I thoroughly enjoyed my pasta puttanesca. Service was friendly and reasonably quick. I also liked that we could actually hear ourselves talk, in spite of there being music playing and most of the tables being full. We'll be going back for sure!", "author": "Laura M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-09", "description": "Excellent food and atmosphere. Live music and great a experience.  I Would definitely recommend Verde!", "author": "Allissa S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-10", "description": "great value. the pastas were delicious and just what Smith St needs, unobtrusive yet comfortable italian food. fun cocktails and nice wine selection.\nperfect place for a romantic dinner, or girls night out! It's everything you want it to be.\n\nand get the tiramisu!! you'll be glad you did.", "author": "Tiffany E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-30", "description": "Food was good, but they gave me a very small portion. The service wasn't great, he barely spoke to us. The best thing about this experience was the free glass of wine when I checked in.", "author": "Luis C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-06", "description": "I celebrated a very special occassion recently at Verde. Verde is truly  the new place to eat and drink  and have a great time on Smith. The antipasti were delicious, baked clams and the eggplant lasagna. I never had baked clams like that before, they were really good.\nWe also enjoyed the crispy gnocchi and a pasta called orecchiete with chick peas. Then we enjoyed the seared tuna, shrimp scampi\nand  grilled filet mignon with arugula and parmigiano cheese. And finally dessert ,various sherbet, a truly rich and delicious chocolate dessert and my favorite tira mi su.\nThe waiters and staff are attentive and very nice, a beautiful atmosphere ! And live music too...", "author": "carlo s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-18", "description": "We had a very enjoyable experience.\nWe ordered shrimp cocktail, filet mignon and chicken in white wine sauce. Everything was delicious and served in a timely manner. \nOnly compliant would be that the chicken was not described as having cheese and it was smothered in cheese. \nThe atmosphere is also very romantic.\n\nOn a another note, we did not order dessert, but the surrounding tables did and they looked fantastic!", "author": "Iris L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-18", "description": "1st of all they changed the lobster feast to 19.95 but it is still worth it. I was very pleased. We had the lobster feast and the chuppa seafood. Oh, my God. Not every one can cook seafood correctly but this place gets it just right. Its fresh its light, well seasoned and not over cooked or undercooked. Perfect, just perfect.", "author": "Sadzia C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-26", "description": "Which was worse - the food or the service? \n\nThe waiter was unattentive, did not tell us the specials, we were ushered to our table brusquely, no smile or greetings.\n\nWhen the OWNER took away my barely touched dinner he did not ask if every thing was OK, he was pre-occupied and bickering with the wait staff, in front of the patrons.\n\nThe salad nicoise? The lettuce was limp, sodden with dressing and was missing several of the key ingredients. No potatoes, no green beans, no seasoning on the stringy tuna.\n\nNo need to go back. Plenty of better options on Smith St.", "author": "milou g."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}