{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-19", "description": "My GF and I are wine and food snobs, travel to Italy, and grew up eating authentic Italian food.  We are both from old-school Italian families, so Verde on Smith has become one of our rare \"happy places\".  It is so, so rare to find authentic Italian dishes that reminds us of growing up.  They do wonderful non-traditional dishes, as well, but their focus is definitely on getting the traditional sauces right.  Food is very well-priced and they have great wines that won't bust your wallet.  We've gotten to know the staff, and they are absolute professionals and really want you to be happy.  I also just really like the decor, it's very warm with a lot of exposed brick and the front opens up onto the street, weather permitting.  This place is a neighborhood gem and we are NEVER sorry when we go.", "author": "Philip D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-08", "description": "A friend took me here for my birthday on a Wednesday night.  The place was not too busy, but had a few tables filled.  Our server was quick to greet us.   The service was prompt and attentive.  \n\nI had the mussels and linguini.  I didn't want a red sauce, so they made a cream sauce without any objections.  It was delicious.  The fig, walnut, and gorgonzola salad was amazing.  I'd definitely come back for that.  The bread they brought out was warm and was perfect for the oil and vinegar.  The portions were generous. I had to take some of my pasta home.\n\nWe got there a little late. While the service was great, it became a little bit awkward towards the end when the few people who were there left. The staff was all but staring us down, waiting for us to leave.  Of course, they had to clean and get ready to get out of there.  That's normal.  But their eagerness to get out of there was a bit awkward. We thought that we stayed well beyond closing time only to find out that they didn't close for another 15 minutes.  It was quite uncomfortable.  We skipped dessert and got out of there. \n\nOverall, the food and service were solid, and I'll definitely be back.", "author": "Monique S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-18", "description": "Wish I could give 3.5 stars. Not my first time at Verde and I can't exactly say it's a disappointment nor was it a total success. Unlimited drinks for $17 are definitely a huge plus but they could certainly use friendlier staff. Service was ... Not very friendly, impersonal, cold, and unwelcoming. The food was fine - don't have anything negative to say about the burger and eggs Benedict BUT they killed my bacon!!!! It appeared that the chef took four strips of frozen bacon, threw it on the grill, forgot about it, and let it burn to a crisp so much so that when pulling the strips apart you were left with crumbles. Overall, it was ok .... I'd recommend just for the drinks option.", "author": "Tatyana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-04", "description": "Great !!! \nThey have a great brunch . The food is great and the portions are great .  I prefer their brunch over dinner. Don't get me wrong their dinner is amazing but their lunch takes the cake", "author": "Ray W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-21", "description": "This is my favorite brunch place in all of NYC! I must have gone here 6+ times and I will continue to go back. The all-you-can-drink boozy brunch is a great deal. Before our glasses are even below a third full, the waitress brings another round. The food is fantastic too. I especially recommend the French toast and the burger. Their Rosemary potatoes are delicious as well as the Italian sausage. Definitely worth the trip from Manhattan, and an obvious choice if you're in Brooklyn.", "author": "Laura Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-08", "description": "Shrimp cocktail was toooo fishy. \n\nOwner/Manager guy unfriendly with patrons and decided to turn the football game off with full bar at 4 pm on Sunday. Wuh?\n\nLooked at what people around me were eating, unimpressed and heard comments that were not favorable.  \n\nSorry. Better choices around the area.", "author": "J E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-29", "description": "Came for brunch. Great service, atmosphere, great food and drinks!", "author": "Sarah Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-21", "description": "We came here for dinner on a week night and it was packed. Since it was just two of us, we got seated quickly. The venue itself at night has a warm glow, simple, clean with a touch of rustic. There were some live music but we were sat at the very back of the restaurant so we didn't hear nor see anything, also because it was kind of loud.\n\nOur waitstaff were all very polite and attentive. Always refilling our water (they use bottled water, aw, fancy but not exactly eco friendly in my book) and bread basket. \n\nThe food was delicious. We ordered strawberry+arugula+riccotta salad, it was creamy and refreshing at the same time. For entree we had the broccoli rabe+sausage+gnocci and the seafood linguine. My gnocci was tasty but perhaps I have a soft spot for seafood pasta, I found myself stealing M's food whenever he is not looking. It is true what others said about this dish that the gnocci is on the dry side ( I liked the crispy sausage bites!), but I enjoyed it to the fullest and washed it down with a glass of wine. \n\nIt was a good dining experience, although that night was a little too busy if I really wanted to chill out and unwind. All and all, I say 3.75 stars.\n\n-This was the restaurant.com adventure  #1", "author": "Isabella W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-31", "description": "I had probably the best muscles there, the sauce was amazing, not to salty, perfectly seasoned.  This past week I went to 2 other amazing restaurants that had muscles and this place was the best.  \n\nBartender was friendly and professional. She poured the drinks like the owner was watching but the drinks were still good. \n\nThe owner walks around with a really worried expression on his face.  Kind of makes it obvious he's worried about the future of his restaurant and anytime he interacts with his staff you can tell he's micro-managing.  If he had more fun and maybe chilled out a little, the place would be more relaxed.  \n\nThe flat screen was turned off.  Maybe play a old movie from the 80's to show some personality.  Things like that warm up the place and make people want to stay a little longer.  \n\nI asked about the specials but decided to get the salmon.  She asked me how do I want it cooked and I told her whatever the chef thinks would be best. A true mark of a great chef is to give them freedom to choose a coking temp.  Nope, not here.   The salmon was so dry and old tasting. I could hardly eat it and looking at the worried owner walking around didn't help. \n\nThe bartender gave me a free drink since she could tell my salmon sucked which was nice of her but paying $22 for a small piece of dried crap kind of sucks.  \n\nI really want this place to do well but when you give the chef freedom and they drop the ball, that makes me think maybe I should go elsewhere.  But the muscles and drinks were really good. \n\nI got the muscles, salmon dish, 2 gins and seltzers  the bill came out to be $58. the drinks were $10.  If they made the place a little more welcoming, better music, lower prices on the drinks, they may do better.  On a Sat night, 9PM,  no reason to have the flat screen turned off.  Owner should relax, maybe make sure the fish is fresh so we're not eating old dry salmon, all this may help them survive.\n\nOh by the way I left a really nice tip since the bartender was nice enough to buy me a 3rd drink.", "author": "Chris B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-05", "description": "The 2nd Best thing on the menu is the chicken florentine.. Can only tell you about the 1st thing because I ate it so fast but it's the Baked Clams they were the best I've ever had. I come here just for the clams. I order them and take them to go!", "author": "Minnie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-30", "description": "I'm so glad we dined at the bar because the bartender was very friendly, making sure we had everything, making sure our food came out promptly and filled our bread basket and water.\n\nThe star here is the food. I highly recommend the following, \n\nThe steamed mussels were fresh, plush and the garlic white wine broth was so delicious with the big basil leaves. Good size portions too. \n\nFor our entree we had the pappardelle with beef ragout pasta. The pasta itself had great texture- they tasted like they were hand made fresh. The beef sauce was filling, and the flavors were balanced well. The chicken florentine was very good too. The spinach with the melted cheese was seasoned perfectly and nicely plated.\n\nThe ingredients they use here are fresh. You can tell the kitchen cares a lot about their craft.\n\nThey did everything right down to the ambiance, just the manager's attitude sucks so bad. \n\nI made reservation and there was no table reserved for us. His explanation was the garden was open. Given no choice we sat outside. Garden was beautiful however I was eaten alive by mosquitos. I went back to the manager, and requested to be seated indoors. Given no choice again, we dined at the bar, but so glad we did thou.\n\nI'll probably be back to try other dishes, and I hope the management can be more accommodating the next time around.", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-27", "description": "My friend and I are pretty much unlimited mimosa brunch experts.  And, Verde on Smith is not here to make friends when it comes to unlimited mimosa brunch.  With a variety of beverages to choose from (mimosa, bloody mary, screwdriver, bellinis (mango, peach, raspberry) brunchers are never bored with the selection.  You're also free to try different drinks, you don't have to stick with the one you initially ordered.  \n\nThe food is decent as well, I've had the steak sandwich and something else the second time that I can't remember (clearly a testament to the plentiful drinks).  \n\nThe unlimited is actually an add on of 11.95 I believe, so per person unlimited mimosa brunch comes to around $30 before tip.  The two times I've been there I arrived around 12 and 1 pm and didn't have trouble finding a seat.", "author": "Erica T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-29", "description": "Hmmmm.  Vitamin Champagne for an additional $16.95?  Well it's not unlimited but well worth a try.  When my friend and I arrived we thought we were out of luck because it looked pretty packed.  Luckily, we were whisked away to a table immediately.  Our waiter apologized in advance that we may have had to wait because there was a large party.  Why thank you sir.  I like to be forewarned, before I get hAngry and overturn a table!\n\nThirsty for our Vitamin Champagne, we ordered our first round of drinks, bellinis. We noticed right away the clarity of the glass.  Oh snap.  There was definitely an uneven ratio of champagne to juice.  Who I am to argue with this pleasure?  Though they seemed super busy, the food came out quickly. My friend had the steak and eggs and I had the spaghetti alla carbonara.  The spaghetti was really, al dente but the sauce was tasty.  \n\nAt some point our waiter put in a double order for mimosas so double fisting tales ensued.  At 4:30 on the dot we asked if we could have one final mimosa and he obliged. \nAnd so ended another successful brunch.", "author": "Donna A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-09", "description": "I wandered on this place just walking around the neighborhood and decided to give it a try. It has a really cute outback garden where we sat. It has a bottomless brunch but it didn't include your meal in the price so we decided against it. I ordered the hamburger and my bf got an omelet. I am a burger lover but would not order this one again. It was a weird texture. However, my boyfriends omelet was really good and the mimosas were really tasty. Overall I would go again but I would order something else.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-25", "description": "I don't eat pasta but love the nicoise salad and the burrata with prosciutto, plus they have a pretty good lobster deal!", "author": "Samantha V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-17", "description": "Today me and my food loving partner decided to try out Verde on smith. We were shown excellent care by the staff and our waitress Olga was really attentive and sweet. She even played along when I decided to secretly place my order with her behind my menu so not to tell tina that I'd be eating a salad instead of something typical of myself like a burger or steak. We placed our order and the food seemed to fly right out. Typically this means the food was rushed and I was prepared for the worst. However, The food was amazeballs!!! The grilled chicken was to die for and the freshly sliced cheese went great on top. They didnt overkill with croutons like most places. I tried some of Tina's potatoes and honestly its the best fry I can remember. The steak was so soft and cooked to perfection. Olga came and checked in on us from time to time, and it felt genuine, as tho she just wanted us to enjoy our meal and wasn't just doing her job. We had such a good time. Oh and there's Free Wifi in case you were wondering. We enjoyed ourselves there today and I must say I wil be returning.", "author": "Juan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-13", "description": "Staff is extremely knowledgeable and very quick. Girlfriend and I get meat and cheese everywhere we go, and this was hands down the best burrata and prosciutto we've ever had. Sorry no picture, we ate it too quickly.", "author": "Patrick S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-20", "description": "Dang... crispy gnocci.\n\nWe stopped here for a late lunch.  The place was dead, but it was perfect, because we were ladies that were lunching and drinking to kick off the weekend in town.\n\n- Crispy Gnocci:  There is an adorable place in SD called Mamma Mia where I crave their gnocci, and I truly compare every gnocci dish to this place.  But this dish.. gave gnocci a great new twist.  It's crispy so it's slightly seared and has like a toastiness to it.  Served alongside this amazing broccoli rabe sausage thing! My goodness.. Heaven :)\n- Penna Alla vodka: Tasty, and basic.  Penne was cooked to perfection.\n- Caesar Salad: Basic, but no actual anchovies which kinda is a bummer.  But beautiful shavings of parmesan over it.\n- Bresaola: Tasty and fresh. A nice way to start the meal.\n\nAll in all this place was adorable.  It was quiet for lunch, but I loved it.  The music playing too was definitely a win here too.  Good drink menu, and an acceptable wine list. I would come back again next time I was in Brooklyn for sure.", "author": "Natalie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-29", "description": "Went to Verde on Smith for brunch this past Sunday and I was not disappnted. Friendly, attentive staff, delicious food (we had the mix berry crepes, steak and eggs and one of the omelettes) and the space was beautifully put together. Super warm and inviting atmosphere and the bottomless drinks were delicious. I can't wait to return when their outdoor section is open!", "author": "Janissa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-17", "description": "Started a full night of club hopping here. I've also had brunch here. I especially like coming here before club hopping though. Let me tell you what that looks like.\n\nStart with baked clams, ease into a fish special of the day with a nice white wine. End the night with something decadent and then tip the waitstaff generously.\n\nThen head to the L.E.S. on the nearby trains available and get the party started. Woo hoo!!!", "author": "Sabrina W."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}