{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-13", "description": "Great hidden Gem in Brooklyn! Authentic Italian food. Great decor simple but yet rustic - very clean and very well situated.  Attentive service, nice atmosphere and the owner is a gentleman, circling tables and making sure the guests are well attended to.  As far as Cobblehill Italian goes, this is as good as the others if not better.  We eat out often in the area and are Italian (so we obsess over food) and appreciate good, authentic food.   Great drinks (bartender is excellent), great, well priced wine list.   This is a great place, we highly recommend.", "author": "John A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-30", "description": "This place is amazing!! I went several times and always happy. I get the 3 dollar Peronis and eat items off the tapas menu like the Burrata Parma - soft cheese rolled in Prosciutto, Eggplant Lasagnette, The bruchetta. Amazing fresh homemade food. Nice back Patio to eat outside ,Owners are great people. And the bathroom is even awesome lol it's got the music pumping!!! All in All very happy with this spot and owners and staff!!  :)", "author": "Jerry T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-05", "description": "Went here a few weeks ago and had an excellent filet mignon and steamed muscles. It was busy but they didn't rush you out of the place. A nice place to grab a nice meal. I will be going to Verde on Smith again soon.", "author": "Ian A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-13", "description": "Verde's is a very welcome addition to Smith Street's restaurant row!! I've lived in Cobble Hill for years and have seen restaurants come and go. The Lobster feast was delicious as were the baked clams and chocolate dessert. Great menu ,especially for brunch and  the prices are most affordable.  The staff is very accomodating and the music adds a special touch to the overall  ambience. So glad to learn that they now deliver to the surrounding neighborhood.", "author": "Elise C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-15", "description": "Went for Valentines Day and my husband, who has a stomach of steel, got food poisoning today (next day). Margharitas were wierd and the pasta dish our guest had was left uneaten. Fish and spinach salad were good. The other guest had an OK steak that was served with no care for presentation. Given other reviews below this was  disappointing. Given husband's inabiity to go to work due to food poisoning, will never go back.", "author": "E F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-13", "description": "Honestly, I had no idea this restaurant existed for the first three months it was open. I had been going next door for brunch for a couple weeks and the menu peaked my interest so I came back on a friday night. Best decision I made since moving to the neighborhood. They have a great space, Very inviting decor, nice bar, a great backyard, and a very attentive staff. The manager/host and owner are eager to please and the wait staff looks happy to serve (which having worked in restaurants through college I can tell you isn't always the easiest thing to do). I have been here about half a dozen times now and I've sampled most of the entrees and can say I really haven't had a bad meal yet. The lobster is a great value, the pastas are all tasty and even the classic dishes are very creative (try the crispy gnocci!). Definitely one of the lesser known gems on smith.", "author": "Ralph M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-05", "description": "My friends and I really enjoyed our dinner here.  The service was prompt, and our food was delicious!  The items on the menu are very affordable (~$10 pasta dishes) however the beer cost more money than I expected.  The sign in the front advertised $3 beer and $4 wine, but that price turned out to be for the bar only.  (That was one of the main reasons we decided to eat there!  We were all going to enjoy a few glasses of wine with our dinner, but couldn't spend $10/glass thus had one beer instead.)  Aside from that, we all liked our food and will probably return!  It has a nice atmosphere and an affordable food menu - two plus-points for a restaurant worth revisiting...at least in my book!", "author": "Mbt T."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}