{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-27", "description": "Verde became my favorite place! Food, drinks, atmosphere are just amazing. Stuff is always helpful and friendly. Highly recommended if you have special occasion to go out for dinner/branch or if you just want to spent nice evening with your friends.", "author": "Anastasia U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-16", "description": "Favorite place in Brooklyn to brunch. Excellent bottomless drinks. Good service. Always go for the steak and eggs. Fluffiest pancakes", "author": "Diana A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-22", "description": "This is my new fave brunch spot. I went here for a birthday brunch, ended up accidentally leaving my bag so i called the restaurant and they held it for me for like a week!! The owner (im assuming) was SO nice about everything and was very friendly. The food was SO GOOD. I had the salmon burger and it was really fresh. Calamari was great too. Overall great experience! Will definitely be coming back.", "author": "Ashley S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-09", "description": "Amazing. I'm from la. And just stopped in. INCREDIBLE BRUNCH ITEMS. SMALL BUT LIVELY ATMOSPHERE. \nThe servers are on point and sooo kind. \nThe new management is spectacular.", "author": "A A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-31", "description": "A nice brunch experience drinks are very strong and you're able to switch flavors and drinks throughout the two hours without incurring an issue/fee. The food is just \"okay\". I would have expected a larger portion for the prices but the food did taste good. We had pancakes and a frittata (two deer ate entrees). We had rounds of Bellinis(mango, raspberry) as well as mimosas. Overall I would come back but I'd probably order two entrees or eat prior to patronizing", "author": "Dane B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-26", "description": "Went here today for brunch and I will go again. Bottomless drinks inclusive of mimosas, bellinis, screwdrivers, and champagne are all good things . I ordered the fillet branzino good but I encountered a few bones. Lol. Overall I really liked the place. Staff was friendly and accommodating.", "author": "Karen K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "This is one of my FAVORITE brunch restaurants in Brooklyn. I came here for brunch with my cousins. The bellinis are amazing I always rotate the flavors (raspberry, mango, and peach ). Today we decided to go with a appetizer to start off. We ordered the calamari, to my surprise the portion was extremely small and not worth $9. I must say it was flavorful I was soo disappointed that it was a small portion. I ordered the Kobe Burger medium well and it was really good. I usually get the Kobe burger or steak and eggs, those are my go too. My cousins ordered the salmon burger, steak and eggs and salmon with couscous. All of their meals were good. The staff is very nice and polite. I highly recommend getting the unlimited drinks for brunch it is worth it.", "author": "Jessica A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "AMAZING FOOD , DRINKS and service !!!!! Love this place been coming here for years def. recommend it. Food just gets better and better every time I come :D", "author": "Hannah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-24", "description": "Cute spot. Not the best with wait time if they are busy. It gets packed and it becomes hard to maneuver through the place BUT the service is great. They are very attentive and apologize for anything that is not to your liking. The food is good too! Mimosas are strong yet so good and their fries are amazing!", "author": "Brittany D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-26", "description": "I've been there last week with my friends for dinner. We had amazing appetizers that the server suggested. I had beef short ribs which was mouth watering and a great pair with my special cocktail. After we finished our dinner the owner(Mark ) came to checking if everything was alright. Then we learned that the place is under new management for 5 months and they kept all the employees who used to work. They are doing amazing job with food, drinks and hospitality. You can find everything you're looking for from a restaurant. I'll definitely be there for trying their bottomless brunch as well. Good luck guy. I am pretty sure you'll be much more better day by day", "author": "Osmancan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-28", "description": "The food was sooo delish! And the bottomless brunch drinks were AMAZING! Mark, the owner was very hospitable and involved with making dure.we were satisfied.  Definitely one of our new summer brunch go to spots!", "author": "Denise C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-31", "description": "This place has amazing service and food.\nGreat coffee and brunch menu.\nI had the greek omelet and my friend had the spanish omelet. Also the mozzarella sticks are amazing!\nThe manager and the servers are so nice and positive, always smiling.\nThank you for the great service!", "author": "Nikola B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-22", "description": "Each time I have been to this restaurant the staff have been exceptional. They have been very accommodating whether it was changing the television to a college game or making room for my moms birthday balloons. It is definitely a place that I frequent often when in the area.", "author": "A J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-30", "description": "Absolutely Amazing!\n\nI have been coming here for years, and the service/food keeps getting better and better. \n\nThe brunch menu has to be one of the best bottomless brunches in Brooklyn. \n\nWill be there this Sunday for sure! Definitely, worth the money, and the commute.", "author": "Stephanie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "My husband and I walked on Smith St looking for a spot to Dine when a man stepped out of this place to greet us. I smiled but kept walking. He still smiled back, wished us a good night, and went back in. That small kind gesture made us turn back and try the place out ... AMEN!! Same man stepped out to greet us again and was happy to tell us about all the specials of the day. Turns out he is the new owner. Great atmosphere and the food was Super Delicious. The server, Hector, was fantastic! He made everything on the menu sound amazing! My husband even ordered dessert...He NEVER orders dessert!  \n\nThis is a MUST DO! And I can't wait the go back!", "author": "Carmen J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-24", "description": "The food and service were very good and well-priced, however, while we were eating a family came in with dogs and was allowed to dine in the restaurant with them, which we found very disgusting and against NYC health codes. We probably won't come again because of this.\n\nEdit: I work with service dogs and the behavior of these dogs made it very clear that these were NOT service dogs.", "author": "Anna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-17", "description": "The food was very fresh and the portions were great. The orders were delivered in sturdy packages, and the staff goes above and beyond to please their customers.", "author": "Alla Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-20", "description": "I really liked the ambiance at Verde cafe. They also have live music . The koben Burger was amazing and delicious. Thanks guys...", "author": "MuStafa Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-12", "description": "I meant to write this review back in December when it actually happened but you know life happens. When I went here on December 22, 2018 I made a reservation for 2 people at 2pm, my friend and I arrived on time and were seated within 5 mins. Now I've always loved brunching here, the food is amazing and the wait staff are usually very attentive to the point when you do the unlimited drinks they bring you a fresh drink as soon as your previous drink is empty without you having to ask for one. When I came there that afternoon we were seated and ordered our drinks and food. Maybe 10 minutes later when were comfortable and chatting it up, the manager comes over to our table and asks if we would mind switching to another table because of a big party of people coming in that I assume didn't make the proper reservations of how many people would attend. My friend says okay before consulting with me and we move tables. They put us in the back of the restaurant, the last table by the kitchen against the wall, to say I was beyond annoyed is an understatement. When I saw another table across from us leaving, I asked if we could be moved because I didn't like our new table they said no, another big party is coming in. At that point brunch was ruined for me, the food didnt taste as good as usual and drinks werent coming as fast either. The manager didnt even come over and apologize or offer us a comp on fries or something from moving from our initial table. I just think the situation was handled poorly it was not our fault nor problem that the party that came in invited more people than they told the restuarant. I haven't been back since", "author": "Katherine W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-11", "description": "The food was delicious but the ambiance, not so much. The restaurant is so small that the live jazz band they had playing was way too loud. We were sitting in the table farthest from the band and we couldn't even have a conversation. \n\nNo complaints about the service, the drinks or the food. If you go to this restaurant expect a tight squeeze. If you don't like jazz then don't go on a Sunday night (I believe that is the only time they play).\n\nI imagine I would have had a much better experience had I gone on a regular night as opposed to jazz night.", "author": "Louise M."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}