{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "Noticed the restaurant walking by and we were NOT disappointed! Super friendly staff, romantic ambiance, and the food was delish! Make sure to ask for the daily specials. Will return for sure and bring our coworkers.", "author": "Viktoria F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-16", "description": "Living in the Gowanus neighborhood I go here once a year with my wife. The food is always good here, no issues at all except that the menu has not changed in years. That's good and bad but personally I think they need to update it. Servers are very good and many have been there for years. The owner will typically be there and oversees a lot so feel free to tell him what you think.", "author": "Jared T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-27", "description": "My friends and I came here for brunch on a Saturday. We made a reservation in advance for 2:30. When we arrived at the restaurant, they said they're server went down and we had to wait till 3:45 for a table. The restaurant was small and PACKED. It was booming. We understood it was a stressful day for them and the situation was unexpected, but they were quite rude to us. Three of my friends got to the restaurant first and they got a small glass of a free mimosa, as an apology. When my other friend and I arrived, we were not offered a mimosa. So we left and walked around the surrounding area, and came back at 3:45 sharp. When we arrived, it was still super packed. And our table was NOT READY. When we asked the host, he kept saying \"yes, yes, 3:45.\" Which it was. 10 minutes later, they sat us at the bar and started getting our drink orders, while we continued to wait for our table. Finally at 4:30 we sat. The waiter came over to get our drink orders since we went through our first drinks while we were waiting for our table... \n\nOverall, the food was okay, nothing special. We went for the endless mimosa, bloody mary, and bellinis they offered. The endless drinks last for 2 hours and it's $19.95. Overall we each spent about $40. The staff was nice, helpful, and efficient. Would I recommend? No. There are tons of other places that are better. Were the $19.95 endless drinks worth it? Totally.", "author": "Isabel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "One of my favorite places to eat- brunch and dinner! Truly the best and never disappoints. \n\nI have tried most things on the menu and cannot complain about anything. \n\nIf you like shrimp, definitly try Shrimp Scampi. My old time favorite is Salmon with Spinach and Couscous. \n\nMy dad who never likes any place we eat at as he says \" food is food\", for the first time said he liked his steak and asked me to bring him there on father's day.\n\nI have tried Chicken Florentine and Chicken Marsala, both were very good. \n\nI had my birthday here and all my friends (20 people) liked their food. The owner is very attentive as is the rest of the staff. Always checking in and making sure everything is going well. \n\nDesserts are homemade. Tiramisu is a must!!! The owner imports Gelato from Italy so it is also something you might want to try.   \n\n\nBRUNCH\n\nUnlimited drinks - for me mimosas :) enough said to go there for brunch especially during summer months. It has outdoor seating and the restaurant itself is very nice.", "author": "Laura V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-09", "description": "Brunch was awesome! I had the steak and eggs with french toast as a side. French toast was delicious! I like to try out different places for French toast and I was very pleased! Also unlimited drinks for brunch with different flavor mimosas!", "author": "Chastity M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-12", "description": "The food was exceptional , and the service was great , l also really liked the bar, it's family friendly the managers and the waiters are really professionals", "author": "Ercan U."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-13", "description": "The food was pretty good. The restaurant is quite packed and quite loud it felt like everyone was screaming due to the closeness of tables and the small atmosphere. I ordered the Belgian waffle which was very good but some of the other food was quite mediocre.", "author": "Tomasilienne L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-16", "description": "Though the space was small, the food was delish! I had crepes stuffed with ricotta cheese and assorted fruits. I also got a side of potatoes that were SO GOOD! It was my first time having crepes and it was very tasty. I'd definitely come back for more.", "author": "Shurland C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-28", "description": "Brunch! Brunch! What would life be like without brunch? I don't want to know. \n\nVerde hit it spot on with the unlimited mimosas/bellinis and some fabulous brunch options. \n\nBy far the pancakes were my favourite. They were small, fluffy and had a nice outter crisp. The omelets were fresh and tasty, with a nice amount of veggies and cheese added. \n\nMy only setback with giving Verde a 5* was our waitress. She was extremely obnoxious and rude (Maybe bad day?) because we were being our usual friendly selves and she kept trying to ruin our moods. \n\nI am definitely a fan of the food and hopefully manage to score a less grouchy waitress next time.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-06", "description": "The staff here is wonderful. Service is great, very friendly. Some dishes were awesome, some ok.\n\nWe got a mushroom appetizer that was incredible, like eating a steak. I could have had a double portion of that for my main!\n\nStrawberry salad was good. \n\nBraised short ribs looked and smelled incredible. I didn't try any because I didn't want them to have to give any up they were enjoying it so much!\n\nI got the orechette with Chick pea and spinach? Very boring. I was debating between a few different things but I love me some chick peas so I went for it. Should have gone with something else. Pasta was cooked well but just generally lacked flavor. \n\nNice place overall.", "author": "Steph W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-19", "description": "Good food and vibe for Sunday brunch outing. Accommodating to someone with food allergies. Thank you hector for being a wonderful waiter... can't wait to try the dinner next time", "author": "M T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-24", "description": "Sat outside and the ambiance was really nice. The baked clam and the spaghetti clam and shrimp was really good also. The only thing was the wine, the menu stated 2014 and we got a 2017 bottle for the price of a 2014, very mis The waiter was not very attentive. My least favorite dish was the gnocchi... it had was too much sausage and broccoli rabe and way too salty. i would rename the dish on the menu to Broccoli Rabe and sausage with crispy gnocchi instead of Crispy Gnocchi with Sausage and Broccoli Rabe.", "author": "Mary M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "Verde on Smith is my absolute favorite brunch spot in Brooklyn, and possible in the whole NYC. I've been coming for a couple years for brunch only and the service is always great and food is always amazing. Some weekends can get very busy so I suggest making a reservation for brunch, especially if you have more than 2 people. \n\nThey have bottomless mimosas, bellinis (peach, mango, and Rasberry) and screwdrivers, and you're able to switch between drinks. The mimosas are my favorite, very bubbly with more champagne than OJ, in a very tasty way. The French toast is my favorite brunch item, very filling with berries on top, and some syrup. I've also had the steak and eggs which was good, and their Rosemary potatoes are absolutely delicious!", "author": "Robin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-27", "description": "Great food and atmosphere. Came here for a date night and it did. It disappoint. My husband and I were both happy with our entree selections. We will be back. The shrimp was so yummy.", "author": "corissa m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "I was in the neighborhood so I stopped in for an early dinner. I had the baked clams, burrata \u0026 prosciutto and shrimp scampi as my entree. The baked clams were delicious and well seasoned. The burrata was still a little frozen on one end but the other side was perfeft \u0026 delicious. Shrimp scampi was well seasoned but the sauce was a little too salty. Overall tasty meal.", "author": "Tasha H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "Went here for brunch yesterday for my friend birthday. We had a group of 9, so we made reservations ahead of time, I got the steak and eggs (medium rare/sunny side up), delicious steak,  \n Also got the unlimited drink special (I had like 8 Bellinis in 2 hours) - well worth it for 20 bucks. I tried all 3 flavors - Rasberry, Peach, and Mango... Mango was the best one but all 3 were good. It was beautiful out so we sat in the backyard area. It was very nice. The service was very good, our waiter Hector was very attentive and had some personality to him (I may have just been a lil drunk by that time) - but he wasn't a yes sir no sir type waiter (I hate that, seems so fake). Overall, really good experience, will be coming here for brunch again soon.", "author": "Jimmy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "Lovely atmosphere, cordial service, delicious good...we were all very pleased   Staff went out of their way to make sure we were happy", "author": "Mish P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-20", "description": "A group of 3 of us came here on Sunday around 1pm for brunch. We didn't have a reservation, but were able to be seated right away even though they were busy. Two of us did the bottomless 2 hour brunch for a set price of $15 per person for bottomless mimosas or bellinis. They are not cheap with the refills at all, any time you ask they will bring another one in a decent amount of time, which is always a plus at brunch! \nThere brunch menu has a large selection of different options. I went with the salad with grilled chicken and the two other people I was with got the steak sandwich and the Kobe beef burger. We all really enjoyed our food. \nThe restaurant can accommodate all different groups, they had a large birthday seated as well as groups of two just out to eat. The service was good and all the staff was very friendly, I'll be back for sure, possibly for dinner next time.", "author": "Jessica R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-02", "description": "My personal brunch favorite!\nThe outdoor seating and doors that open to the street make every table a pleasurable al fresco experience. I've also been here on a chilly spring morning and it was warm and cozy inside so any season is great. \nMimosas, bloodies, bellinis and champagne are all included in the $20 bottomless deal. Entrees are extra ($11-20 each) so it isn't the cheapest brunch deal I've found in Bk but would it help if I told you every time I leave here I feel like I've been transported to a lovely meadow. Good food and drinks flowing just miraculously puts everyone in a good mood. \nSometimes I wish there were a different sandwich and pasta variety but there is enough selection to satisfy the pallet. \nMy one gripe is I requested a 2 or 2:30 reservation outside. The hostess said sure how about 2:30? I agreed but when we arrived we were told there wasnt any more outdoor seating and brunch ends strictly at 4pm so our 2 hours of bottomless would be cut short no exceptions. I wasn't happy that this wasn't explained over the phone but the waiter filled our glasses quickly to make up for it so I can't complain too much.", "author": "Julianne B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "Excellent service and delicious food!!! Definitely worth a visit!! Will be back real soon!", "author": "Edward S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}