{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-06", "description": "I admit to being an intermittent sucker for Groupons.  Some of them turn out quite well, or at least OK, and you feel like you saved a little cash.\n\nSome of them make you feel as if you have been ritually disemboweled.\n\nVerde's Groupon is such a Groupon.  \n\nMy wife works close by to the restaurant, and I bought the paltry $15 Groupon for $30 worth of food, because I thought it would be a no-brainer.  \n\nI read the fine print:  it couldn't be used for brunch or happy hour.  That's fine, I wanted to use it for lunch.\n\nOf course, it is not prominently advertised that they do not serve lunch.  But I'll admit that is something I could have maybe divined from the wording of the Groupon, but was not explicitly stated.  OK.  I'll still say it's my bad.  I should have been less impulsive.\n\nSo I had what was going to be a generally useless Groupon unless I was in the area for dinner.  But if I was going to be in the area for dinner, I wouldn't have chosen to eat at Verde. In any case, there was an outside chance I'd use it before its expiration or after.\n\nToday, Friday, I'm in the area with my 14-month old daughter, to visit my wife for lunch and to our surprise, Verde was open.  I was pleased.  No-brainer, cheap lunch, nearby.\n\nIn any case, we sit down.  Place is almost entirely empty.  Two other small parties sitting close to the front.  They have a garden area in back, but we are not offered the option.  Very quiet.  Somewhat peaceful, actually. \n\nWe sit down.  I order a beer.   I'm actually getting a good vibe from the place for a second or two.  \n\nWhen he comes back, I tell him I have a Groupon.  He says, no, you can only use it for dinner.  \n\nI point out that it just says that it cannot be used for brunch or happy hour, and since it is Friday at 1pm, it is neither of those.  It's lunch.\n\nI look down.  I just notice that it is a brunch menu.  Damn.  BUT IT IS LUNCHTIME ON A FRIDAY.  I'm here to eat lunch.  \n\nNo dice.  \n\nI try to reason with him about the fact that it is Friday, and why don't you just honor the Groupon?  \n\nHe walks away.\n\nWe paid the exact amount for the beer and left, and went across the street to a homemade pasta restaurant (AWESOME) and felt great paying $30 cash for a mind-blowing lunch, and tipped generously.  \n\nThe place does not want new customers, it does not appreciate good business, the manager was rude, gruff and unfriendly, and really, you can't just honor a $30 Groupon so that maybe I'll come back?  Maybe we would have come back for the \"Boozy Brunch\" they offer (although likely not on a Friday.)\n\nIt is businesses like these that suck the goodwill out of Groupon's model and just make you feel like buying the Groupon was basically a scam.  Sure, if I was a bit more critical when I bought it, and not impulsive, I could have figured out they didn't serve lunch.  But then they should have said \"Valid for dinner only.\"  Because then I would not have purchased it.  But they don't say this. That's all you have to say: \"Valid for dinner only.\" Succinct.\n\nLong story short:  strange, unfriendly, desultory place.  They're not open for lunch, ever.  Never.  Not even once.  Dinner and brunch.  Maybe they'll open up a seven day a week boozy brunch, and then they can sell even more unusable Groupons.  \n\nPerhaps they also don't like small children, as we had our fourteen-month old with us.  I get that. I can respect a restaurant not wanting too many young children.  God knows Brooklyn is more and more like a hip, urban Lilliput.  I have kids and I can't stand kids in general.  Put up a sign: \"NO KIDS.\"  I'm with you.  Defend you till the end.\n\nBut the place was empty and they could make a sale.  We eat out all the time, with and without children.  \n\nSo Groupon lesson learned, and now: less likely to buy another Groupon anytime soon.  Groupon loses, Verde loses.  The dark side of the Groupon.\n\nAnd will definitely not being going to Verde.  But you know what: I'm pretty sure they didn't even really want us.\n\nBut the pint of Peroni on tap for $5.46 including tax was quite refreshing.", "author": "Ryan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-09", "description": "Friday seafood lobster platter is amazing. I go there on my lunch break eat, enjoy, and back at my desk in 1 hour. Awesome waiters. Clean establishment.", "author": "Fay H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-25", "description": "Eh.  Disappointing addition to Smith St.  We have eaten here a few times.  \n\nThe menu is Italian-ish and looks good.  The food, however, is mediocre considering the price.  There are so many better Italian places in the neighborhood; I'm not sure why I'd go back.\n\nIf you must go, go for lunch or brunch.", "author": "Eric H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-23", "description": "We always have an exceptional time coming here! Their staff is friendly and helpful and their food is ALWAYS AMAZING. Cute italian ambiance. A perfect place for a saturday night dinner.  Another true gem in brooklyn.", "author": "Lauren F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-10", "description": "Pretty place. \nHowever, you do not get enough satisfaction for your hardly earned bucks.\nI ordered a shrimp and pasta dish...I remember finding only 3 shrimps in my plate...by the time we left I didn't feel I had a satisfying meal. My boyfriend's dish was meh...nothing special.\n\nIt's decent but I'm not sure it's worth returning back.", "author": "Pamela B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-15", "description": "Allow me to clarify my stars: Based on Brunch service, I can sincerely give this place 4 stars! A friend \u0026 I had the mushroom omelet with additional toppings (cheese, jalapenos) which came with a side of rosemary potatoes \u0026 salad. First of all, service was a delight. The place wasn't really crowded, my guess because everyone was next door at Cafe Luluc. Although I'm not sure what all the hulabaloo is about that so-called \"French\" place..I've eaten there. Waiter service was prompt, patient (while we decided on drinks, toppings, etc.) and polite. Water was always filled and the waiter did frequent check-ins. The omelet was delicious. Eggs were so fresh like they came straight off the farm and it was prepared just right. The rosemary potatoes (albeit only 3 of them) were stunning! So crisp, buttery, and the hint of rosemary gave them a distinct aroma. Plus the parmesan sprinkled on top was just perfect! I began to get mad at the fact that there were only 3 of them!! But then again, the omelet is the main, and it was sizeable and filled to capacity with toppings. Plus i hate it when an entree comes with fries nearly falling off the plate anyways. Perhaps, 4 potatoes would be fairer, lol. All in all, brunch service is comparable to any you'd find in the area and the food is pleasant and satisfying. \n\nBut, about dinner....\n\nWell, my bf \u0026 I ate there one early evening on a deal from Groupon. They readily accepted the deal and seated us. I didn't mention this before, but the decor in this place is architecturally stunning inside! So much thought was put into keeping a geometric, panoramic theme throughout the place. This place could easily be situated in the Flatiron district. Once again, service was prompt and polite. There weren't many seated for dinner either...it was prob too early. We were offered the specials of the evening which I chose: Lobster bisque \u0026 Lobster ravioli. Well my Lobster bisque wasn't very impressive at all. It was just okay. My bf had the baked clams which were nicely seasoned. Although (6) clams for $12 in Brooklyn??? But again, my bisque was waay too bland. Didn't taste (or see) the lobster at all, it didn't have that luscious, creamy, rich bisque texture...quite watery actually. More of a canned soup quality unfortunately. Then the ravioli...oh boy! Again, where was the lobster?? The seasoning? The sauce?? it was all just bland, and I honestly couldn't identify what the ravioli filling was. It wasn't very satisfying but then again, that IS what ur usual \"special\" at a restaurant is: A pseudo-cheap,  second-rate dish that leaves all to be desired. My bf had the tilapia which was decent but it's not like I was sitting there wishing I'd ordered that instead. \n\nAll in all Verde is a gorgeous place, the bar station has an awesome energetic, inviting vibe. But I think they have trouble securing the local crowd because there's just nothing special about this place. They certainly wont steal the customers from Luluc next door, becuz tourists flock there. I mean anyone looking for authentic Italian-inspired cuisine would be highly disappointed in this place. It just seems the food overall is uninspiring. I wish the same effort and energy put into the decor of this place translated in the dishes. \n\nNot a bad pick for brunch, but I cannot in all honesty recommend anything else.", "author": "Marlena S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-17", "description": "Here two weekends ago for Brunch before a road trip.  Overall, it was a poor experience and the food was mediocre.  We like to try different spots on Smith Street and the $14.95 Brunch with Brunch cocktail lured us in,  It wasn't very busy which is fine, but service wasn't very attentive.  Especially once we realized the waiter obviously didn't listen as to which of the two crepes one of us ordered when the wrong one came out.  They were less than apologetic and brought out the correct crepe after 15minutes minimum.  \n\nThe cherry on top was being charged for the so called included brunch cocktail.  Will not be going back.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-14", "description": "The Good: Cute backyard area for dining. Great atmosphere for brunch. The vegetable sandwich was a good choice and prices are relatively reasonable for the quality of food.\n\nThe Bad: Salads were not fresh. The nicoise salad was very lacking. The side salad that came with my sandwich was def not fresh. I picked out more than a few bad leaves.\n\nWith the abundance of brunch spots in the area, this one is a pass in my book.", "author": "Lydia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-26", "description": "The bartender looks like she makes really good drinks. However, she takes a straw and pumps the drink up to taste test before she serves.\n\nSo I ended up ordering wine.", "author": "Tammy H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-06", "description": "I made a 7 pm reservation for dinner to celebrate my wedding anniversary.\n\nArrived on time and to my dismay, the place was empty which was indicative of what was to come.\n\nThe waitstaff was friendly and accommodating.  Our drinks were fine.  However, we were so disappointed with the food.  I ordered the scapetti with arugula and my guest ordered the lobster feast.  Neither entrees were horrible but definitely not what we expected based on the reviews.  Not the worst meal we've had but nothing memorable at all about the experience. And with soooo many restaurants on Smith Street alone, we would not recommend  nor would we return.  Very mediocre.", "author": "Audrienne C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-02", "description": "Came here for Christmas Eve dinner with my boyfriend. The place is so adorable. The service is great. The waiter counted in Italian which was so cute. \n\nI love a place that serves bread with olive oil and olives. Yum.\n\nWe started with Pappardelle with Beef Ragout which was yummy. My boyfriend ordered the filet mignon medium rare which was served with delicious potatoes and mushrooms. I ordered the ribeye medium rare with polenta and spinach. Unfortunately it was prepared medium (I don't think the waiter heard me correctly) and had a very BBQed-charred taste to it. I took most of it to go and enjoyed it the following morning with fried eggs and runny yolks though :) We ordered a side of mushrooms which were very delicious, juicy, and flavorful.\n\nDuring our meal, an older couple came in and sat at the table near us. They must have been regulars because they ordered lamb chops (yum!) and lobster bisque -- items not on the menu.\n\nWould definitely come back!", "author": "Siv L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-11", "description": "I love this place- my fav for brunch! Just wish it was bigger - when it gets busy it can get packed-def a regular for me", "author": "Sparkle T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-20", "description": "Loveeeeeeeeee...the tiramisu is fantastic.... Thanks, Carissa    ™®", "author": "Carissa N. S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-24", "description": "Went here the other night on a date with my girlfriend. The place was only half full so we were seated quickly and the staff stayed pretty attentive throughout our visit.  I had the gnocchi with broccoli rabe and sausage, my girl had the branzino specials. We both really loved our food and they had a great wine list that accented our meal.  We had mussels for an appetizer, those were so good. Great portion size too, didn't have tons of food to take home but also had plenty to dig into.  Dessert tip - get the tiramasu if they have it! 1 of the best I have ever had.\npro tip on this place - keep an eye out for them on coupon sites, plus they do foursquare specials so you pretty much always feel like your getting some kind of deal, which is nice.", "author": "Joe M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-03", "description": "hummmm!!!! its okay - All I remember is that it was loud. And it took like 5 hours to get served - okay maybe I'm being dramatic= but I don't really remember.. the food was good- it just took forever to eat.", "author": "Veronica C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-27", "description": "Really, really enjoyed a \"solo\" dinner last night.  I was on Smith St. when the hunger pangs hit, and after a stressful day, Verde's laid back interior and warm glow looked just perfect. I received a friendly greeting and was very comfortably seated.\n\nI treated myself to a Ketel One and Soda (expertly poured) and ordered the Beets and Leeks with Robiolina Cheese for an appetizer, and the Filet Mignon for an entree.  This was my first Robiolina cheese experience, and it was creamy and delicious--a perfect compliment to tasty roasted leeks and beets.  The perfectly (med. rare) grilled Filet was accompanied by sauteed button mushrooms and roasted potato fingerlings and served with a light au jus--holy s\u0026*$, it was amazing.  Verde seems to have an Italian focus, but this was certainly one of the best Filets I have enjoyed.\n\nI enjoyed the friendly and attentive service, the comfortable seating, the starched white table linens and fine utensils, and most of all--the expertly prepared meal at a fair price.  I was expecting good, but this meal at Verde was fantastic.  Thank you Verde--you were a fine dining partner.  I will return soon.", "author": "Chuck B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-06", "description": "Loved it!  The owner Cono is very nice. The staff is very attentive. The food is great! Great looking place!", "author": "Joe B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-21", "description": "Pretty average food. I had the salmon frittata - nothing to write home about. \n\nHowever if you like clams, get an order of baked clams. They are simply done, crispy tops, creamy centers, chewy sweet clams. Great dripping to scoop up with bread.", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-04", "description": "I've been here three times for brunch, and I think that no other meal should be served here. The neighborhood is meant for day time, in my non brooklyn-ite (nouveau or not)/non hipster view. It's a great place, so don't get me wrong. I just think that sunlight coming through the windows (reflecting off snow or not) is the best ambience for this place. :)\n\nI've ordered their Kobe burger and Chicken sandwich and both were tasty, ingredients were fresh and were accompanied with a serving of fresh greenery and potatoes. The biggest draw here is their bottomless beverage service for an additional cost. (I think it was an extra $13?) Beliini's and mimosas are meant for sunshine. Go here for them. The breakfast-y options were tasty from the plates I sampled from at the table. I'd say you can't miss on anything there food or drink wise.\n\nThe service was good, the waitstaff was friendly and the bluegrass band was great so there wasn't just silence echoing off the pretty brick wall. Also, I saw a mini patio in the back, so that's a plus as well! Each time, we easily spent a few hours talking, reminiscing, etc. After a while, it came to a point of, \"oh crap! 4pm! I've got to go submit this paperwork for law school, or we've got to go meet up with someone, blah blah blah.\" Never a dull moment. \n\nAlso, its kid friendly.", "author": "Anjaly P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-18", "description": "I've been here a few times for happy hour but am revisiting this place to review them for brunch/dinner. We came here for brunch but half of us wanted dinner. So without any hassle, they let us order off both menus mid-afternoon on a Friday. \n\nThe broccoli rabe sausage crispy gnocchi was awesome! I've never had crispy gnocchi but it was a perfect reason to forego the no-meat during Lent Friday plan. The penne alla vodka and the bresaola appetizer like usual were a pleasure in my tummy.", "author": "Christine G."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}