{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-05", "description": "Pasta perfection.   Verde is a really nice find.   The pasta is perfectly cooked whether you order broad noodles like pappardelle or spaghetti.   The Bolognese and Primavera sauces are delicious.   I really enjoyed the spinach salad in a fig dressing with walnuts raisins and for gondola,  and they have a nice San Giovese to accompany your meal.   Service is attentive and pleasant.   Fresh bread is served with a tasty olive oil and fresh olives.", "author": "Cary R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "Excellent food,  very good bartender, fine service.  I am writing this review to counter the one star review that was  written by someone who accused the owner of being discourteous.  Nothing could be further from the truth.  Cono is a gentleman. I  have witnessed him treat all who enter the door with the utmost respect. I love this restaurant and have dined here numerous times.  You will enjoy a lovely delicious meal, in a cozy restauant with a perfect ambience.\nEnough said.", "author": "Arlene L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-07", "description": "I've been here twice. Once for dinner and once for brunch. Both times the service and food were excellent. Our waiter was very attentive even during a busy brunch. Ii will be visiting here more frequently.", "author": "Jamelia F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-27", "description": "Never had a bad experience. The wait staff is amazing, especially Luis. We've had two large parties of 12-14 and he has been so attentive. The meals have been a crowd pleaser no matter what you get on the menu. If you're looking to impress your guests you should go to verde on smith.", "author": "Jessica T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-01", "description": "I ate here previously and liked the food, so apologies to the kitchen, because the one star was due in the front of the house. I had made a reservation online and was running late, so I called ahead to push the reservation a half hour and was told that would be fine. Upon arriving, my partner and I waited for a half hour to be seated, were told repeatedly it was our fault for showing up late (despite having called ahead and been told it was fine). We were then told 'sorry for the wait' (but it was our fault) and we'd be 'taken care of.'\nUpon being seated, we were told that we were too late for the brunch special (we would not have been late had we been seated within 15 min. of our revised reservation).\nWhen we inquired as to whether an exception could be made based on our service to that point, the older man who seated us began to explain again that we were too late and couldn't get a reduced price because they had to prepare for dinner?\nHe finally conceded to extend brunch 30 minutes for us, but only after slamming his hands down on the table (we were fairly quiet and polite), at which point we opted to just skip brunch altogether, since the hour was getting late.\n\nCustomer service =/= explaining to the customer how wrong they are.", "author": "Michael K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-19", "description": "Came here like 2 weeks ago for my sisters graduation, the menu looked ok, I wasn't really impressed with the menu items. Then the waiter came and told us the specials. As appetizers we got an eggplant lasagna and stuffed mushrooms they were both great. My meal I ordered shrimp, lobster and scallops al Diablo I wasn't too fond of it. It was ok, my sister raved about her stuffed chicken, my nieces ordered something simple like Cesar salad with grilled chicken, and the chicken was amazing tasted really fresh. My boyfriend had a coconut martini and it was so delicious, and me and my sister had a lychee martini also very good. I liked the drinks better then the food honestly. But they do have happy hour buy u have to be sitting at the bar to get it!", "author": "Venus R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-14", "description": "Came here with my mother this weekend and had a great experience.  Both here Crepes and my Spaghetti Carbonara were cooked and seasoned perfectly!  As a bonus there was no wait for a two person table!  Prices seemed reasonable ($13 for the carbonara plus $16 for AYCD).  Additionally all the drinks we tried were delicious and well made!  Definitely a great place to come for a fun, maybe tipsy, but still a little classy brunch!", "author": "Julianna G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-15", "description": "The first time I went here, it had just opened up and I wanted to try it for my birthday dinner. We sat in the back garden which was cozy, quiet, and lit with candles. The waiter was especially friendly and did a great job of recommending the appropriate wine and dessert with our meals. \n\nThe second time, I was very pleasantly surprised by my lobster dish with steamed shellfish--it was advertised as the chalkboard special, and they truly delivered. Again, the friendly service was consistent, the atmosphere classy without being ostentatious. I like.", "author": "Mia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "I loved brunch here. I repeat, loved brunch here. The food was great, the different flavor mimosa's were heavenly and service was good. I sat outback and that just made the meal and the experience that much better.", "author": "D C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-04", "description": "I should not be made to feel that I am being discriminated against as I come into an establishment for brunch. The owner/manager is a brute. Not even a smile! Not even a simple welcome to VERdE ! Not even a be with you in a moment; Just my party and I standing at the entrance as if we were a prop or invisible to say the least . My friends and I have been patrons for over a year and we have let the condescending service slide but this subtle discrimination is unacceptable in my hometown. The management Verde on Smith needs to learn how to serve their clients from the time they set foot into the establishment. Granted, we have enjoyed great service from some of the staff but the management there is so curt and abrupt! The owner/manger said that seating would take 45 minutes, however another worker said 20 minutes, less than 5 minutes before. As he said this, a group stood up to leave. When I inquired about the open table and he said he was expecting a large group... Really? At 3:10 pm when brunch ends at 3:30! He said that only outside seating was available for our party of three. This was all said in a disgusted impersonal manner. He then added as an after thought that unlimited drinks had already ended, as if This was enough to send us out the door with no return. We went across the street to Chance, where we were immediately welcomed. I bumped into a friend of mine that said he received similar treatment over the past week that he has frequented the establishment. If you are a person of color be advised.\n\nYour Comment (Cono M. of Verde on Smith \nBusiness Owner) 5/4/2014- \"How much malice and bad faith in this review\",\nFurther shows that you do not care for your customers. Learn some business etiquette and hospitality!\n\nThat's another 1 Star for you!", "author": "Elle K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-03", "description": "Was on the way to Cafe Luluc for brunch, but realized this place (just next door) had unlimited cocktails!!  I would be half way through my screwdriver and the waiter was back at the table with another one :-) ...\n\nI ordered the Kobe burger and the meat was actually seasoned!! Not many of the other burger places I have been too actually season the meat!!!", "author": "Justin H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-15", "description": "Always love coming here for dinner and drinks. Came for Fathers Day. While the food was delicious, the service was slow and they added 20% gratuity on a table of 5. While that is typically par for course, the gratuity was a little steep with quality of service.", "author": "Kate S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-09", "description": "Made a reservation here for brunch after my friend raved about it as a cute spot for me and my beau to attend for for Sunday brunch. Fast forward we make it 15 mins late for the reservation and the hostess told us they still had a table reserved for us. We were then greeted by our waiter who didn't introduce himself he immediately took our drink order.. We ordered the steak and eggs with French toast to share . Super yum until my beau found a hair in his potatoes...bummer. Our waiter never came back to check on us after he put the order in. Luckily another near by waiter was promptly servicing us keeping the drinks flowing...score. The Decor was very  Victorian which I liked. It also has a outdoor seating area. I would recommend.", "author": "Sade M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-20", "description": "I have been going to Verde for brunch for years with no problems. I was appalled at my most recent experience there. I made a reservation for brunch for three people. Unfortunately, we hit traffic and were running no more than 10 minutes late. Out of consideration I called ahead to let the host/owner know of the situation and was told rudely that he could not hold the reservation. Then I was told to come and if there was a table, he would seat us. So being that I'm 8 months pregnant and hungry, my friends and I decided to take our chances. When we arrived, not only was the host/owner rude again, he wanted us to sit in the freezing cold outside. When I asked how long it would be for a indoor seat, he refused to tell me. What kind of restaurant owner turns away patrons who had a reservation and a pregnant woman???", "author": "Nadine H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-16", "description": "I am basing my review on the service because the food was actually very good. However, the service was mediocre to say the least.  It was three of us and for some reason they had to take ONE chair away from the table to make it a 3 person table even though it s 4 top table. They did it to another customer as well and he was perplexed.  So me and my girlfriends tried to somehow understand why they were doing this but the owner explain they were very busy - hello I am looking around there were only 4 tables being serviced how are you busy right now. Anyways, moving on - here comes our lovely attitude fill waiter who for some reason the owner defended when he should have been corrected. We told him we couldn't understand why they couldn't move us to another table - he proceeded to make a joke that was NOT funny saying \"well what is the problem I can give you the other table and switch and it still be the same table\" ARE YOU KIDDING ME? So I told him - well it seems he doesn't care about his tip.  He had an attitude and his name was Luis. They was absolutely nothing pleasant about him - I would have rather have one of the other serves which were REALLY nice. One of them brought us our drinks and he practically pushed him out to take the drinks from him. He was rude and didn't have any customer service skills whatsoever. As a owner you should be able to correct your employees not let them act however they want - your business is a representation of yourself and since you approve of him as a waiter you lost and will loose plenty of customers.  I do not recommend this place and will not go back.", "author": "Michelle Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-16", "description": "I'd give this place a 3.5 - good positive experience but not my favorite.\n\nVerde on Smith serves Italian/Seafood cuisine. My dinner party of 4 arrived at 6:15pm on a Saturday night. The service was a little slow but it was nice not to feel rushed out of the restaurant.\n\nThey have an awesome cocktail and wine list but a pretty lousy beer menu. I was surprised to find a restaurant in BK that doesn't serve multiple craft beers - only Peroni, Stella, Hoegarden, and BK Brew.\n\nHere's what we ordered:\n\nAppetizers:\nBaked Clams - Exactly as expected. Delicious.\nSeafood Salad - Not a fan of cold seafood dishes. The squid was mediocre.\nPortobello Mushroom w/ Feta - Amazing. The portobello mushroom was sliced and had an amazing meaty texture.\n\nDinner:\nLamb Shank - Not too big, not too small. Comes with steak like fries and some sautéed spinach.", "author": "Sean C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-27", "description": "Love the ambiance of this place. Very classy. The bartender was very kind and knowledgeable, we enjoyed our service and loved the oyster presentation.", "author": "Mia P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-08", "description": "I really hate giving this place a poor rating but at least I'm not giving it a 1 star. Since I tried a place nearby I figured why not give this a shot. Mistake. I really didn't enjoy what Verde offered and the price to food execution ratio is way off. Meaning I shouldn't be paying so much that doesn't taste great. Here's the scoop:\n\nPotato cakes with creme fraiche: the discs were too hard, possibly from leaving in the deep dryer too long\nBaked eggs with leeks: I felt like I was bringing on a heart attack for myself by eating this. Basically eggs in a little pot of oil and cheese. I tried just picking out the eggs with as little oil as possible but that was unsuccessful. It was not pleasant eating such fattening eggs and I'm all about eggs!\nHalf burger of some kind: Can't even remember the name so you can tell how \"great\" this was. I can only recall it was very dry and small in size. \n\nBill came up to be $42 with tip. Kinda pricy for those dishes if you really think about it. I couldn't believe I suggested to come here; I'm so embarrassed. Lesson learned, there are plenty of better places around the area so my advice is to keep on walking.", "author": "KL Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-04", "description": "Decided to eat here last night after strolling Smith street and reading some of the not so great reviews.  Verdict of that decision: awesome dinner!\n\nThe decor and ambiance is quite nice.  It was pretty late so it wasn't too busy and so nice to be in a quiet restaurant, with good acoustics and an awesome play list.\n\nStarted with some wine and baked clams.  The clams took awhile to come which I prefer since you know they are not pre made.  They were delicious, great broth on plate.\n\nEntrees included the tuna with beans and the special of grilled pesto calamari on arugula.  Both entrees were cooked perfectly and delicious.  Definitely will return.", "author": "Lindsay M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-16", "description": "The first sign of a soon-to-be less-than-pleasant experience was the waiter's announcement that he didn't \"really know the wine list\" (as he had just started working there)...One may not know the wine list, but it's a whole other thing to not know what Processo or Sauvigon Blanc IS.  \"Can you point that to me [so I can write it down letter for letter on my pad]?\"\n\nIt was endearing at first, but quickly went downhill as he also had no concept of the menu items.  We had to point everything out so he could write it down.\n\nIt's a bit of a shame--the resto is totally cute, the backyard is gorgeous but (a) it's the same Smith St. food I can get up and down the street and (b) it's nothing special.  \n\nThe beet appetizer, while yummy, is miniscule.  Tiny.  3 beet slices.  It didn't help that the plate was about the size of our table, and the 'sharing' plates were equally as huge.", "author": "Kelly T."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}