{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "A proper Italian restaurant. I've been here a couple of times and haven't had a bad meal or drink yet. Service is great as well. If you are looking for an Olive Garden experience ... move on. Always ask about the specials.", "author": "Joe T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-19", "description": "Loved this restaurant. Warm reception from the bartender and waiter, and delicious food.  We had the arugula salad with strawberries and ricotta, special stuffed shrimp and linguine with mussels. One of the best meals on Smith Street -- excellent Italian a cut above the norm.", "author": "Karen G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-21", "description": "My first time visiting Verde at the recommendation of a friend and here is my review: \n\nThe host: upon arrival I was greeted by a not so warm welcome by the host who sat us down and then proceeded to become our waiter for the evening. His attitude was a bit dry and although he moved swiftly to get us our food and drinks, his attitude at the end was beyond deplorable. When a waiter rudely reminds the customer about a tip not being left on the receipt, it shows his lack of observation that the tip was in fact on the table as we wanted to give him a great tip in cash. Needless to say, I do not ever want him to serve me again \n\nThe food: Appetizers were ok, the crab cakes, I won't ever recommend because they were soggy and lacked that classic crab cake taste. The Insalata Caprese was fresh and delicious!!!!!! The main course, now that, deserves my full attention...I had the most scrumptious lobster, calamari and shrimp mixed in a spicy red sauce served over linguine pasta. It was the BEST and the special for the night...super yummy \n\nThe dessert: I tried the lava chocolate cake which wasn't that great but it wasn't bad either \n\nOverall, I will try Verde again but will pass on a few items on the menu", "author": "Kai M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-23", "description": "Had a small birthday brunch here on a Saturday morning. The place was pretty empty, but it was snowing, so we were seated right away. The food, drinks and everything else was good. The service was decent.", "author": "Tatyana P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-18", "description": "Nice place depending on the color of your skin. food was decent and unlimited drinks were good, and our waitress and waitress we had serving us did a great job. Unfortunately the owner is extremely racist and does not try to hide it.  \n\nWe had a large group and even though we had reservations and the table was already set up for us when he saw our group was predominantly black he offered for us to sit outside.  It was freezing and he mentioned he had a couple of heat lamps but still said we would be cold as it wasn't sufficient for our group. \n\nI wouldn't recommend this venue to anyone of color, don't spend your money at this venue the owner doesn't respect or value your business.\n\nIf you don't believe me check it out yourself and see how differently the owner will treat you and look you in disgust!", "author": "Rem F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-06", "description": "This is an italian restaurant but definitely not authentic. Got the shrimp scampi risotto and it was not the texture of risotto at all. It was soft rice. The flavors were okay but nothing special. It came with 6 medium sized shrimps and for close to $30, this is a big ripoff. \n\nThey have oyster specials that sell out quickly.", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Great place. Have gone twice now for their brunch on a Sunday with friends. It's hit or miss in terms of how crowded it'll be...we went one day and we were practically the only ones there at 2 pm on Sunday while another time we arrived and had a small wait. But regardless.\nAwesome bottomless brunch - the bloody mary's are delicious. The food is excellent too, really yummy salads and good fritatas too. Would definitely recommend. Service is excellent and they're always a pleasure. \nThey also have an outdoor back area that looks super cute too!", "author": "Ayla A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "Went here for Mother's Day , loved the food , great service , we asked to be seated outside and it was beautiful ! Will definitely go back", "author": "ID K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-24", "description": "Great place for brunch, outside area is nice, good coffee, love the frittata with lox.", "author": "Inessa M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-15", "description": "We came to Verde on Smith for Valentine's Day dinner. The atmosphere was lovely and the staff was friendly, however, the food was mediocre at best and extremely overpriced for the quality... Unfortunately, the dinner was a disappointing experience. We'll be looking for a better option in the neighborhood next time.", "author": "Kayla K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-09", "description": "Had brunch with two friends at Verde and we absolutely loved it. The food was excellent, prepared exactly to our specifications. Their unlimited drinks brunch was well worth the price. We had so much fun catching up, the ambiance was perfect. Our server was very attentive and amicable. We really enjoyed our time there and will definitely be going back.", "author": "Dania Maria S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-19", "description": "horrible and by horrible i mean horrible customer service! i was not greeted, no one came over to my table to ask what i'd like to drink. i had to ask someone to find my waiter. my waiter had a nasty attitude and barely understood what i said. horrible, horrible, horrible!!!!", "author": "Brooklyn M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-27", "description": "Went to Verde on Smith for a brunch on Easter. I had the the steak and it was amazing. My girlfriend had two eggs and fruit. The bottomless brunch was perfect with my medium steak. As soon as we walked in we were seated. What more could I ask for. I would definitely recommend this place and I'm going back to explore the dinner menu.", "author": "Dwayne M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-23", "description": "As a born and bred brooklyn gal, I;m ashamed to admit I just tried  Verde on Smith for the first time tonight. Where have you been all my life Verde?\n\nMy Mother in law gave us a  fantastic  Restaurant.com coupon for my wife and I to use. I;m sure glad she did.Beautiful ambience, attentive service and best of all the most brilliant IPOD play list ever.. all my favorites were jammin at a nice volume level all night. Ellie Goulding, Tori Amos, Sarah Mclachlan, 10.000 Maniacs.. I could have sat there all night just listening to the music.\n\nNow for the food.. I was in heaven. We shared  a strawberry/ricotta salad that was the perfect blend and portion size.\n\nI had the delicious Lobster feast for a reasonable $30.00 I got 1/2 lobster, baked clams ,shrimp, garlic bred and corn on the cob.. the only thing I didn't finish on my  plate was the spring of parsley.Simply the best baked clams I;ve ever had and baked clams are my christmas eve specialty. I;m pretty fussy when I order these out. They were perfectly seasoned and cooked.The lobster was  a nice size and sweet. The shrimp simply divine.. I could go on a and on.\n\nMy wife had the chicken marsala and cannot stop raving about it. Cooked to perfection and again.. the marsala sauce was better than mine. \n\nI guess i can stop cooking and just eat at verde from now on...", "author": "Barbra B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "Came to Verde on Smith bc of a Restaurant.com gift card and boy were we blown away! A truly dynamic Italian menu, we had a hard time choosing but ultimately settled on the caprese salad app, orchiette pasta with chick peas, spinach and speck and the flank steak over a bed of arugula. Not a bad bite was had! The mozzarella was soft and creamy, the tomatoes had great flavor (even in early March!), pasta was delicious and not too heavy, the steak was cooked perfectly and the arugula salad had a wonderful light vinaigrette that complimented the dish very well. Overall great meal and I'll mention that the wine pours were very generous. We'll be back again soon!", "author": "Megan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-20", "description": "Love love love this place!! From food to customer service! The mimosas are to die for! I love the outdoor seating!! This is a must go every Sunday!!", "author": "Vicki B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-24", "description": "Food good... maybe a little better than good. What takes the cake is every time I'm here for the unlimited drinks during brunch, the waiters are always making sure your drinks are filled to the brim. What an experience!!!", "author": "Jermaine Sean S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-16", "description": "My friend and I went here on Wednesday evening to hang and to use up the last of her restaurant coupons. We met at 6:30 and when we arrived, we were the only customers at Verde. I'm not going to lie; I was a bit nervous. it was a gorgeous evening and the outdoor space is perfect for any couple/group of friends looking for a nice, casual night out. I quickly learned that my apprehensions were misplaced and that it was just a fluke that Verde was lacking patrons.\n\nWe sat down and ordered a glass of wine and a beer to start with. My wine was $9, the beer $5. We were told that we couldn't get a happy hour discount because we weren't sitting at the bar. To me, that's sort of ridiculous but whatever, we drank anyway. We received a complimentary bread/olive oil dish which was oh so delicious and shortly after, we decided to order dinner. I got the penne a la vodka with shrimp (additional $4) and my friend got the branzino. The food was delightful! The penne was one of the best I've ever had and the portion was perfect. The branzino was incredible as well. I've never had the fish before and it was cooked to perfection, soaking in the tomatoey sauce and spices. My friend and I were very pleased with our meal.\n\nWe got the check and with the discount ($20) we each paid $17/person. We both ordered the more affordable things on the menu and I personally felt that in general, all the food cost a little more than it should. Verde is a more expensive restaurant for what it is - good Italian food. I'm all about paying more especially if it's great but there was something missing (I think from the vibe) to keep me from giving it a 5. I'd recommend this for a couple looking for a nicer dinner but if you want cheaper Italian food, I'd urge you to go somewhere else.\n\nAnd an fyi - excellent service! Our waiter, whose name I forgot, was super polite and lovely!", "author": "Reese L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-18", "description": "Made a reservation at Verde on a Friday night and it was pretty quiet here. At first I thought that might be a bad sign but I was surprised. The drink choices were great and they definitely weren't watered down. Other than that, above-average italian food and a solid wait staff.\n\nThe strawberry and ricotta salad is a must have.", "author": "Anthony M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-15", "description": "Stopped by Verde when the intended destination, Café Luluc, looked too busy. I'm not very good at waiting in long lines for food. Verde was a great decision though.\n\nWe sat down right away. Staff was friendly and attentive. Cappuccinos tasted like actual coffee although could have been stronger. The eggs were yummy and cooked perfectly. Bacon was nice and crispy and not fatty. And the potatoes were so interesting and delicious. They serve them cut in long wedges and are seasoned with rosemary (I think). They're buttery but not greasy. It was nice to have something different other than hashbrowns and homefries. \n\nWe also had the nutella banana crepe which was obviously great. If you slather nutella on anything its always a win win. Lots of fresh strawberries, bananas and blueberries for garnish. \n\nAll in all a nice place. I'd love to come back and try it for dinner.", "author": "Rheem A."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}