{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "I love this restaurant and I order their nicoise salad every week!  The atmosphere is chill and elegant, and the back garden is beautiful.  The food is delicious.  Last year I held my birthday party here and they were absolutely amazing.  For any meal or occasion this is a great choice.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-25", "description": "WOW \nI will never go there again!!\nI had a livingsocial coupon for this place and figured I would take a friend. Staff was so unbelievably rude- it was amazing. After getting the menu and being there for a little over 5 minutes we had a waitress come over and ask us what we wanted to order- when we told her we didn't know yet her reply was: \" why don't you know?? whats taking so long?\"\nREALLY?!?! \nWe ended up ordering an entree (fried gnocchi with sausage and broccoli rabe) and some beers. The beers tasted flat. They only had enough for ONE hoegarden (how is that even possible!?!?) and the stella just tasted flat. The entree was nothing to be impressed about- the fried gnocchi was soggy. Loaded with garlic- so yo couldn't even taste the other flavors. Could have made this at home and it would have tasted better. \nWhen we were ready to pay the waiter or waiters (b/c we literally had a different waiter every time someone came to our table) couldn't figure out how to apply the living social deal. It was a $20 for $40- and at first they only took off $30. I finally got the manager involved who just laughed and took off the rest of the money and then had to go run around to find me change b/c the bar couldn't even break a 10!\nWill NEVER come here again.\nI was honestly embarrassed to have brought a friend to this place. \n\nAnd on top of that they have the nerve to list the following on their announcement section of yelp: \"We are not sure why Yelp is filtering our good reviews?? \"........ No one is filtering anything - you're just HORRIBLE!!!!!", "author": "Sonu K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-15", "description": "Food was yummy (clams oreganata, shrimp scampi); service could be a bit better.  I hate getting the drinks we ordered at the beginning of the meal after the meal.  As such, there should have been apologies and drinks comped but that's just me.  Don't wait staff notice these things anymore?  I think part of the problem these days is that there is no one - no head waiter, no maitre d', no hostess going around and making sure that everything is satisfactory.", "author": "Pamela K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-18", "description": "I have been here several times for brunch and dinner - The food and service is always fantastic.  I like that there are choices on the menu and not the current trend of a handful of  dishes to choose from (ahem, neighboring restaurants).  The unlimited mimosa brunch deal is worth a visit.  There is never a line here, it's truly a  neighborhood gem.  Sometimes there is live music which is always entertaining.  My favorite dishes thus far have been the Buffalo Mozzarella, French Toast,  and Kobe Burger.  The food is a generous portion if you wish to share your appetizers.", "author": "Jody K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-26", "description": "My boyfriend and I went here on 4/24/10 for dinner.  We literally live two minutes away and this was our first time to try out this new spot.  \n\nThe space and decor is very nice but the tables are crammed in very close together, even by NYC standards.  The lousiest table would be the last two-top right by the kitchen door.  I think if someone was sitting at that table, one of the diners would be able to see right into the kitchen since the chair is practically IN the doorway.  There are also two two-tops right up front by the door, bar, and hostess station, and those would also not be very desirable.\n\nLuckily, we were there early on a Saturday and we were seated at a two-top along the side wall of the dining room. The drawback to these tables is that the wall is also the kitchen wall so you can hear banging around in the kitchen through the wall.  The other tables are along a nice exposed brick wall and feature a wall-length banquette on one side.  The decor is minimal in rich browns and creamy whites.  The ubiquitous Tungsten light bulbs fill some simple chandeliers overheard.  \n\nNow for the food.  Yum, yum, yum!  We ordered the burrata and prosciutto di parma appetizer which was just divine.  The cheese was flavored with coarse salt, a drizzle of olive oil, and some herbs.  Both cheese and meat just melted on the tongue.  I ordered the crispy gnocchi with broccoli rabe and sausage.  It arrived nice and hot and absolutely covered with thinly shaved slices of Parm-Regg with a dusting of black pepper.  My boyfriend ordered the linguine with mussels in a spicy tomato white wine sauce.  His dish came not only with mussels mixed into the pasta but with  twelve mussels in the shell ringing the edge of the bowl.  \n\nBoth of our dishes tasted bright, fresh, clean, and light.  The sauce on the mussel dish was incredibly bright thanks to the white wine but neither of us thought it was very spicy.  My dish, on the other hand, was very spicy, which I didn't expect since nothing on the menu mentioned it being spicy.  Not sure if it was just the natural combination of flavors that made is spicy or if it was just loaded with pepper.  In any case, it was a little too spicy for my liking, but I did eat all of it!  \n\nWe skipped dessert since it was my birthday and we had cake waiting for us at home.  \n\nService was exceptionally attentive but I think was due to the fact that they weren't terribly busy and had lots of staff just kinda standing around at the ready with the water pitcher or bread basket. (Oh!  The sliced bread is very good - soft and dense on the inside, chewy on the outside and served with earthy olive oil and some olives.)  The service didn't bother me but they were dangerously close to be annoying.  I would rather have too much service than none at all.  All the servers were very pleasant and polite.  One server did remove my boyfriend's empty plate, bread plate, and MY bread plate while I was still eating my entree.  This irks me to no end when servers remove plates before the entire table is done eating.  It's not like they were trying to turn the table since it wasn't busy. The server was probably just looking for something to do, but if he had waited just another two minutes while I finished up, he could have cleared the entire table at one time.\n\nWhen we were seated around 6:15 (we were eating early), there were only three other couples at tables. By the time we left a little after 8PM,  I'd say only half the tables were full and one was a party of six.  So obviously, word of this place hasn't quite caught on yet.  It will and I expect word of mouth will be good, so go now while you can still walk in on a Saturday night.   Or if BINO (formerly Po) down the street is too busy, walk a few more blocks to Verde.\n\nI knocked it to four stars because of the unexpected spiciness of my dish,  the early table clearing while I was still eating, and the strange, strange music that was playing all night - it was a shuffle of Elvis, Aerosmith, and Bon Jovi.  The music volume was just a tad too high but not bothersome.  We did however, find the Aerosmith tunes more distracting than the other two.  Get music to fit the classy, warm, comfortable vibe of the place!", "author": "Ellen G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-16", "description": "So I made another visit to verde as I normally do!   However I had to write another review because the food is just soooo good!  I usually go to verde for their polenta, which is great. This time we also ordered Oyster Rockefeller for an appetizer.  I still have the taste in my mouth days later. They were unbelievable. I'm dying to go there again this week!!!!", "author": "Andrea P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-11", "description": "So I am an avid food person and read up on all the food blogs. Back in April I read about Verde opening up and it looked great. As I do, I told family and friends about it, but do to work I never got a chance to go. That was until this past week. The decor of this place is super nice, I mean the open front with the dim lighting is great, and I really love the eye poping white light the runs behind the bar. \n\nWith that being said I sat at the bar, and it was great, the beer on tap, ($3) can not be beat, and the bartender was awesome and very personable. I ended up ordering two appz, but boy every dish that came out smelt delish and looked delish. I had the Buffala Mozz - and it absolutely melted in my mouth - i was told it is directly from Italy - and it tasted just as if it was. I also had the baked clams, and I didn't want them to end. The flavor was perfect, and the leftover juice was great for bread dipping. Oh and that reminds me, the bread before the meal, with olive oil and olives - I couldn't' stop eating it! \n\nThe service was great, and I was greeted by both the owner and manager mid meal and throughout asking if \"everything was okay\" and it was great. I will definitely be returning to Verde as the prices and food can not be beat.", "author": "Eddie H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-21", "description": "Just 'ehh' - underwhelming, especially given the price. Service was fine...didn't tell us specials until we asked. Free olives and bread were a plus. I'd go back if if they had a good happy hour special..but not for dinner.", "author": "Elizabeth K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-06", "description": "The food was very mediocre.  Too many great places in the neighborhood to waste a meal here.  Disappointing would be the word.", "author": "Katie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-26", "description": "What a Great Place!! The decor is nice for a date or to just meet up after work . We ordered lasagna and the chicken... they both were full of flavor but the presentation could use more work. We did come back for brunch and the Kobe burgers, excellent!!!", "author": "Randizzle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-18", "description": "Amazing food! Will accommodate dishes for vegetarians. Staff is extremely friendly and attentive. Decor is modern, while still being comfortable. You feel right at home sitting with your friends at a table for dinner, or just having a drink at the bar. ALWAYS amazing specials and deals through facebook, which I LOVE! Weather is nice enough to start enjoying their amazing outdoor garden! Highly recommend! LOVE LOVE LOVE!!", "author": "Ingrid H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-28", "description": "This place was okay but with so many good spots on Smith its unlikely I'll be back. My friend had the veal which only so so. I had penne with a vodka sauce that was quite nice - thin, not too creamy. The wine recommended by the waiter was horrible. Service was attentive. Atmosphere was pleasant", "author": "Will S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-29", "description": "Four of us had dinner at Verde last night, and we quite liked it.  It was a civilized atmosphere with nice lighting and a comfortable noise level.  The food was very tasty and very reasonably priced.  Management was especially kind and considerate.  I had an issue with a gift certificate, and the manager took care of it politely and professionally.  I will definitely return!", "author": "Gary B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-22", "description": "I've been to Verde at least 5 or 6 times at this point and they have become my favorite Italian restaurant in the area.  The brunch is equally as good as the dinner!  You have to get their Mimosas!  They do a few different flavors and use fresh squeezed juice for them, not the canned stuff.  The burrata is delicious and so are the pastas.  The waitstaff is very friendly and accommodating.  Eating at the bar is nice because the bartendar is cool.  They have a garden out back which I can't wait to try now that the weather is getting nicer.  Very solid, good food for the price.  Place is nice but can get very loud.  Not quiet and romantic but very inviting.", "author": "Syl S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-05-02", "description": "I'm pretty shocked by how many positive reviews this restaurant has received. I've been to many restaurants on Smith Street and have enjoyed most of them, but I have no desire to revisit this one. The servers were overly attentive when I was waiting for my boyfriend to arrive but once he arrived, we had to grab their attention every time we needed something. We shared the roasted beet appetizer, which tasted OK but would have been better if served warm. I ordered the scallop and sea urchin pasta, which was what I expected, except the scallops were shredded and cooked in the sauce. Why wouldn't they keep the scallops whole? Seemed very odd and it left me wanting more. But the worst crime was my BF's dish: the tuna. The only reason he ordered it is because he read some good reviews about it, but what they call a  \"white bean puree\" was just a bland mush of undercooked, underseasoned beans. There is no way this dish is worth $24. They also tried to charge me $11 for a cocktail when all the drinks on their cocktail menu were advertised as $10.", "author": "Anna N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-12", "description": "Let me preface this review by saying I only went once, and it was brunch, so perhaps the kitchen wasn't being manned by the regular chef. It was also the first week they were open. That said, here's how the meal went down:\n\nThree of us arrived and were seated in the simply appointed garden. The room inside was tastefully decorated and the staff was friendly. We ordered the $13.95 unlimited brunch cocktails which were unfortunately the best part of the meal. The mimosas were delicate and tasty. \n\nOn to the food: We each ordered different things. One pasta dish (this is an Italian restaurant after all), one kobe burger with melted, smoked scamorza cheese, and the arugula and tuna salad with potatoes, capers, tomatoes and olives. We waited approximately 35 minutes for our food (I will say we were warned that it would take around 20 minutes for the food to be prepared to order - not sure why). As we looked around the room, which had filled out in the time we waited, we noticed no one had any food. When our plates finally arrived, the tuna salad had NO potatoes and NO capers - two of the main ingredients. I mentioned this to our lovely Italian server and she offered to add some, but it was too late at that point. My companion's kobe burger was also missing a main ingredient - cheese. We mentioned this to the obviously flustered and slightly embarrassed server who asked if we wanted more drinks. You bet! Gotta make up for the poor food and long wait.  The burger itself was overcooked and tasted like a giant, sauce-less meatball. The pasta was also overcooked and the sauce uninteresting and quite tasteless. The tuna salad while nothing special, was fine - though missing two of the four main ingredients.  \n\nI wanted to like it here. Really. But I am hard pressed to come up with a reason. Oh, I know - go order the all you can drink special at the bar on the weekends - but eat before you go...", "author": "alyssa m."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-04-25", "description": "Living in the neighborhood we watched the restaurant be built with anticipation-- and finally got a chance to try it for brunch .  Unfortunately the entire meal was a letdown.  I ordered the sausage panini-- and while I enjoyed it, I found myself searching around for the other half of my sandwich.  It literally was sliced like half a sandwich, the other half of which they must have given to someone else.  My wife ordered the crepes with ricotta and mixed berries.  Here as well the portion size seemed like a joke and the mixed berries translated to two under-riped strawberries.  After she crunched into one bite (the crepe being cold and hard, likely pre-made a while ago)-- I could tell immediately that we would not be coming back.  Our server was very nice but she never commented or asked about why my wife had only one bite missing from her dish and so we left without saying anything...and made ourselves lunch at home.", "author": "Kevin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-30", "description": "Went here for Brunch. They had nice live music, prices were affordable, food and coffee were good. The only drawback was that the \"crepes and fruit\" menu item came *surprise!* covered in chocolate (not listed on the menu). Changed the character of the dish quite a bit. Other than that though, really good.", "author": "David S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-26", "description": "I'd give this review more stars if the bartender who acted like the \"decider\" had been friendlier. \nWe had dinner during happy hour and since we were the only ones in the restaurant, we asked if they could extend it to our table. First, why do restaurants do this \"happy hour bar only\" policy? It doesn't make sense. Anyhow, our friendly server agreed but when we ordered our second round, they'd run out of Peroni and the bartender didn't offer a replacement and went on to remind us that they don't usually extend the happy hour to the tables. How they could've run out of a tap beer with only 3 tables filled at this point is beyond me but the fact we had to complain before she brought us Stella at the happy hour price was disappointing. \nOn top of it all, online the lobster feast is advertised at $19.95 but the menu said $24, we let that slide and didn't bring it up because websites aren't always up to date. \nThough I enjoyed the food, I don't know if I'll return.", "author": "John C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-03", "description": "This lovely restaurant is like a slice of Italy. It's not fast food or a cookie cutter menu.The ingredients are fresh, delicate, authentic and beautifully arranged on the plate. We travel to Italy often and know the difference. The staff was lovely and attentive. Try the appetizer with beets, leeks and cheese...delicious.", "author": "Lila E."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}