{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-16", "description": "This is one of my go to restaurants for in Brooklyn. The food is amazing, the ambience is comfortable get chic and the staff is beyond attentive! Verde is known for their weekend brunches but their dinner is to die for and the drinks definitely help to set the tone for a great day . My favorites for brunch are the pancakes, Nutella crepes( if you like fresh fruit and chocolate) and Salmon frittata and for dinner the salmon \u0026 mash potatoes is fresh, seasoned, and each bite just as good if not better than the first . Definitely a great date spot/ girls brunch spot/ and just about everything else low key but turnt you can imagine .", "author": "Kai G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-08", "description": "Verde Cafe is one of the best places in Brooklyn. They are an American mixed with Mediterranean and Italian cuisine. There is a variety of dishes you could choose from. I choose the filet mignon with Mushroom and baked potatoes wedges. My wife choose the salmon scaloppine with mash potatoes. As appetizers she got some amazing delicious fries and I got the fried zucchini which I highly recommend every dish. I also recommend the wine and deserts. The price is reasonable for all the food we order. The owners and customer service from the waiters are great. They attended to use like high Vip guest. I felt welcomed in this beauty cozy restaurant. I will definitely coming back .. thank you mark and abi for the hospitality.", "author": "Josmanuel A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-30", "description": "The biggest appeal of Verde on Smith is their 2-hour bottomless brunch option. The restaurant is small, so even with a reservation we waited about 30 minutes to be seated. However, when we were, the waitstaff and host were very accommodating. They made us a table and moved us to a larger one when it became available. Once we were settled and ordered our food, we comfortably enjoyed ourselves. Verde on Smith is clean and classy. If it was nicer out, I would have loved to take advantage of the outdoor seating option. The meals and drinks were all reasonably priced for a restaurant in Brooklyn - especially the 2-hour brunch drink deal which was only about $20 per person (significantly cheaper than other options). They were very attentive to the drink refills - you definitely get your money's worth within the time limit. The food was delicious, but the portion sizes were average with no frills. (Depending on how hungry you are, you may want to split a little something extra like we did.)", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-21", "description": "Tonight was my first night going to a spot I've heard so much about!!! And I honestly don't know what took me so long to go here. I love everything about my NEW favorite spot in Brooklyn. Despite it being minutes away from Manhattan, this is the most go-to spot! \n\nEverything from the ambience of this place to the owners just makes you feel right at home! I always enjoy dining at a classy \u0026 chic places \u0026 this place takes it home. Let's start off with the look of this restaurant. As you walk in, the lovely staff \u0026 the OWNERS greet you. Not many people do that \u0026 this place does. There's a historic but yet modern/contemporary decor from the chandeliers to the brick walls \u0026 the wine displayed. It has an upscale romantic vibes all in Brooklyn. \n\nI started off with 1/2 baked clam. OMG I am all about the sauce and there was something about the garlic \u0026 lemon taste leaving me wanting more! Then I worked my way over to the main course, which I had lamb, chops. I loved the combo of the lamb chops \u0026 Verde on Smith's garden salad. It was definitely the dressing that added a special touch to it. I'm usually not a big salad fan but this salad was mouth watering. \n\nAnd course, I couldn't end my evening without dessert. I had a homemade Crème Brûlée, which can I, say \"TO DIE FOR!\" I've tasted a lot of crème brûlée before but not like this one. It wasn't too sweet and didn't lack a thing. It was just right \u0026 not many people can master that. And the icing on the cake was their cappuccino that had a special touch to it with the heart design. \n\nI cannot wait to celebrate my birthday here \u0026 try their Brunch menu. I heard this place is also great for a Brunch Spot. Also, I got to meet one of the musicians who play live music on the weekend here. \n\nI am a big believer that a key to a successful \u0026 great restaurant is the staff \u0026 ownership. Everyone was so pleasant \u0026 attentive. I like the fact that the owners Mark \u0026 his co owner makes you feel like family. They really invest in their customers by coming over \u0026 introducing themselves to you and making sure you are enjoying yourselves. I know I did \u0026 I highly recommend this spot to all new comers whether they are from Brooklyn or not. Hello Brooklyn!!!\n\nP.S. Verde on Smith has new ownership and they are doing a great job!!!", "author": "Melissa K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-26", "description": "Verde was the best find in the Brooklyn area. An amazing Italian/ Mediterranean restaurant located on Smith Street. I want to start first with their decor, upscale with that rustic feeling along with cozy and romantic lights. I really the brick wall, it is very BROOKLYN for me. The dining room looks very cleaned and organized I can tell management know how to run also I noticed they have A grade.it is always a good sign.\n Anyway let me talk about the service; the owners; Mark and Abi are great hosts, they welcome their guests by the door with a nice smile and welcoming attitude. They check every table frequently if they are ok and needed anything. We had the same treatment as well. The wait staffs are amazing, friendly and very polite. The service was fast (we had an early dinner) and the drinks came quickly. They have a wide selection of good wine from Italy, Spain, Chile, New Zealand, and California. I tried their Agave Margarita; it was the perfect balance of sweet and sour. They must have a good bartender because bar seats were full. (They have happy hour during weeknights)\n\nThe menu has a nice mix of options and priced well considering it is Brooklyn. Fresh bread and olives are brought out to settle you in; we were told that the olives and olive oil are imported from Italy. \n\nI had the Straccetti with arugula. The meat was cooked perfectly ( ordered Medium) the cut was high quality it was super tender and still juicy. It was a very good idea to match tasty steak with fresh crunchy arugula and hard shaved parmesan cheese. I also ordered The French fries were amazing! Very crisp and seasoned perfectly. \n\nMy wife ordered a seafood linguini.  The pasta (found out that they have fresh homemade pasta) was a perfectly cooked, clearly timed correctly to add to the sauce. The seafood was also perfectly cooked for each item. It could have used a scallop or something but it was still awesome.\nFor the desserts, we tried their homemade Crème Brule and Tiramisu. Both were so tasty.\n\nThe timing was just right, clearly, the kitchen isn't pushing food out just to move tickets and that they spent the time that it needed.\nThings we found out after speaking with Mark and Abi  \n- Live Music ( Every Friday-Sunday Nights)\n- Happy Hour (  Weeknights )\n- Their Famous Brunch (Bottomless Cocktails). We definitely will try.\n- Delivery - Take Out Service\n-Catering for Offices, Residential, Lunch Meetings\n\nIt is our new favorite place. Well organized.", "author": "KEMAL B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-05", "description": "Came here for my birthday brunch in late February with some family members. I must say I was very impressed with the food, service and dranks. \n\nSidebar note: our first choice was Cafe Luluc. It would've taken a lifetime to get seated. I didn't mind the wait but I lost to the majority vote (even on my birthday). Sigh.\n\nBack to Verde. When we realized they were next door, it was a sigh of relief that I was still able to brunch. Yes, it was that serious. \n\nWe were seated right away (it was kinda empty) but that was okay. The waiter was so nice and patient with us. We had lots of mini requests to drive any waiter crazy but he was very accommodating. And then our waiter told us about unlimited mimosas for two hours...I was definitely a happy camper.\n\nI had the Eggs Benedict with potatoes which was actually pretty tasty. I believe the rest of the family enjoyed their meals as well. I know my mom had an issue with her cappuccino; she stated it wasn't hot enough but we explained this to the waiter. He brought her another one.\n\nFor mimosas, there were three flavors; peach, strawberry and mango. I had all three and the mango was the best one. I also had a bellini as well which was okay. The mango mimosa was the winner.\n\nI really enjoyed my time at Verde; they earned an extra brunch visit from me.", "author": "Gail C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-21", "description": "Great food and ambience.  Grilled octopus was brilliant and pasta was fresh.  Surprising dinner choice by my daughter but homemade pasta was wonderful.  Don't think twice.", "author": "Kdawg Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-30", "description": "Best Sunday brunch vibe!!!! Bottomless mimosas, great shaded patio! \n\nWe stayed for like 3 hours and just hung out, service was super nice and friendly, the owner came around to make sure everything was great. \n\nWe shared a Cesar salad, chicken sandwich, had bottomless drinks and a coffee and the two of us paid $45 each", "author": "Sally W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-22", "description": "This place is amazing! The waiters are so friendly and helpful. Not only is it an awesome place where you can get bottomless every day of the week but they are also super friendly. Come here, now!", "author": "Andrea G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-17", "description": "Nice place, friendly staff and a great ambiance. What's it all worth if the food sucks though? \n\nThere was utterly no flavor to our food (four people) so I don't think I'll be returning. Standard NYC prices.", "author": "Frank A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-18", "description": "Came in on a Thursday afternoon and the restaurant was busy with the doors open allowing the breeze to come in. It was perfect. Sat at the bar and our bartender Bilo was awesome. Great drinks, great food.  Avocado salad was as fresh and refreshing as possible. And oh man, the steak panini was perfect. Would come back in a heart beat (especially want to try weekend brunch).", "author": "Mark P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-18", "description": "My friend and I came for dinner and we ordered shrimp scampi and Lobster pasta. The food was very delicious I've never tried that good shrimp scampi before! After main course we ordered deserts. It was creme brûlée and tiramisu. Both of them are homemade. Taste really good like my mom made it. Lol\nVery good atmosphere, good service and good management!! Definitely will come back!! HIGHLY RECOMMEND! 5 stars", "author": "Varvara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-08", "description": "Beyond awesome!!! The food is great and the drinks too. The drinks are not like most places where they're more mixer than drink, one actually tastes the liquor!!!! The pasta is al dente. The Alfredo sauce is yummers!!! Seafood is  Don't hesitate to come here, you won't regret it!!!", "author": "Julissa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "Great food for truely great value! (Hint: try the French toast!) service was also some of the best! Always made sure our bottomless brunch drinks were full! A great atmosphere and we'll be back very soon!", "author": "Matt Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "I truly enjoyed my time here at Verde . On a Friday night you would think it would be super crowded but it was the total opposite it was empty and just me and my friend enjoying our meal . The ambiance is absolutely beautiful and I would recommend going before it gets too cold because sitting outside is just so nice and the breeze was just right and you can talk and people watch it was just perfect . I had the spaghetti Puttanesca. It was so flavorful and so light and they gave you such an amazing portion of food and of course they have beautiful bread before you eat with a nice olive oil . It was really delicious and the staff was really sweet and were really good to us . Going to come back for brunch !", "author": "Chelsea P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-29", "description": "Decided to have my belated Birthday dinner at Verde on Smith! Best choice ever!!!! The atmosphere is beautiful! The drinks divine and the staff so on point!  I can't wait for the doors to open to experience the outdoor dining.", "author": "Susan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-27", "description": "We made reservations so waiting was not an issue. Our food also came pretty quick. The service was great as was the food. The waiter was very attentive. We had the grilled octopus and crab cakes for apps and the octopus was delicious! Our entrees and desert were also very tasty. We will definitely be coming back soon, thank you Verde for a lovely night of fine dining and great service!", "author": "Stephanie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-09", "description": "Love their fluffy egg and cheese, and their Steak and Eggs!!#Phenomenal \nwish they freshly squeezed OJ though, \nWould come here gain definitely!!!", "author": "Dulce F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-11", "description": "Truly delicious Italian with very fresh ingredients and great cooking! I've been there several times now over a few years and it always is wonderful. Love it for special occasions. Cocktails are good too.", "author": "Mara P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "Great food, friendly staff, relaxing atmosphere.\nThis place is a home run for weekend brunch.", "author": "Ronald B."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}