{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-12", "description": "Sunday brunch with longtime girl friends was the day I visited Verde. The unlimited drinks on the brunch menu was our motivator! Well, let's just say they definitely don't serve these drinks lightly so the drinks were just perfect, two \u0026 done LOL ordered the mimosas \u0026 the bloody mary (strong) ...so let's get to the food since this is what I'm sure you're looking for...Ordered the scambled eggs \u0026 mushrooms which was what I was in the mood for but when I read they had a nutella banana crepes dish it kept creeping in my mind while eating my eggs. The other girls ordered steak \u0026 eggs, the meat was delicious.  So we decided to order two of the banana nutella crepes to share this dish did not disappoint, so good I'll be back for this alone. \nThe place was very busy on a Sunday at 1:00 pm we had 5 people in our party and only two of us arrived but would not seat w out the whole party present. Inspite, of the busy time of brunch, the owner was kind enough to hold our table while the other girls were looking for parking. I was impressed at how they (staff) managed this busy afternoon, flawlessly without making the customers feel the rush of brunch. For a small space they make great use of it and the staff navigated the room well. We left satisfied \u0026 happy (probably from those drinks) most importantly I would definitely return, this time to sit outside \u0026 sip those mimosas in the garden patio", "author": "Sharon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-08", "description": "I would give this place 10 stars if I could. They are freaking amazing . I came for brunch \u0026 cannot get enough . The food, drinks, hospitality, Mark \u0026 Louis especially are amazing. I would highly recommend to anyone looking for an affordable fun brunch.", "author": "Amber F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-04", "description": "Let's start from the beginning. My partner and I wanted to have a nice brunch at Verde on Smith St in Brooklyn. It was anything but... We had reservations for 1:15 and wasn't seated until 1:35... The host seated us at a table that had stains on the tablecloth as well as glasses that was drunk out of... I kindly asked for a new tablecloth like everyone else had and he assumed that I didn't want a new one?! The waiter was horrible! It took him 20-30 minutes to take our order and another 10 minutes to give us our drinks... So eventually we was served and given our food. But when my partner asked for another drink the waiter boldly said your not finished your other drink so why do you want another one?! I was thinking oh hell no! I was about to say something but my partner held his composure and I said ask for a manager! So we talked to the manager and nothing was solved unfortunately... But as of now avoid this place at all costs! But I'm not going to let horrible service mess my Sunday Funday up!", "author": "Michael T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-07", "description": "A weekend brunch visit.\nOn the plus side - the bottomless bloody mary's were spicy and strong!\nKobe beef burger. I had mine medium rare with cheddar and bacon. Nicely cooked and juicy with a satisfying beef punch!\nNot so good - my dining partners eggs benedict. The english muffin was soft and not toasted, denying the dish of a counterpoint of texture. The egg was nicely poached but the hollandaise sauce was bland and did not have that slight acidic touch that you find in the best versions. Disappointing\nNot a bad choice for brunch as long as you stick with the bloody mary's and avoid the eggs benedict.", "author": "Anthony W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-04", "description": "Got a wonderful spot overlooking the street and enjoyed delicious food and drink with great service!", "author": "Devin B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-31", "description": "Back for my second time in less than 2 months, that's saying something! This place really knows how to serve up a great brunch! From ambience to food to service, I haven't found a misstep yet! I was first here last month for my birthday brunch, and they treated me like a queen! My waiter was excellent! My husband is usually super hard to please, and even he really enjoyed our meal. He got the steak and eggs and I opted for the French toast. The french toast is delicious! One of my favorites all year, and I consider myself to be a french toast connoisseur. It's not an easy feat to be well portioned on thick brioche, yet not so thick that it's unpleasantly \"doughy\". They manage the right amount of lightness and don't skimp on the fruit. Loved it. My husband's meal was really well cooked and well seasoned too.  Most importantly, all the food was hot! Lukewarm food is a big pet peeve of mine, so Verde did not disappoint here. We both had the unlimited drink special (20 dollars for 2 hours) and I love that you can rotate through different deliciously flavored bellinis (mango,peach, raspberry), mimosas and Bloody Mary's. Between the two of us we tried all but the Blood Mary, and all were strong and great tasting! I went back again 2 weeks later with my family and again another home run. We can't wait to return to try dinner, love this place!", "author": "Simone L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-30", "description": "Food was delicious and the service was very good.  We had tasty cocktails.  If there was any negatives and it's really not a negative I would say that the desserts are done well but perfunctory.", "author": "Natalie F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-02", "description": "Yes - I like.  We were seated in a cool area and we were expecting some delicious food and we were not disappointed.  It was a beautiful afternoon, our server was friendly my simple food was simply delicious.", "author": "Byron D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-16", "description": "STAY AWAY! STAY AWAY! STAY AWAY!\n\nAlthough the wait staff is hardworking and friendly, the food is okay and way overpriced.  I also read many negative reviews about the owner and have to agree.  He's a stone-faced and unfriendly rodent that shouldn't be in the business of running a restaurant.", "author": "Joe R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "I had great time at the brunch, I eat steak and eggs so yummy!!! the drinks and the service was awesome. Thanks to Angela that she was the very kind waitress. \nI hope see you again!", "author": "Elizabeth E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-27", "description": "We had a reservation for 2pm and still waited until 3pm to seat our party. The manager seemed to be afraid to manage the party currently there and tell them that their 2 hours of brunch and bottomless mimosas were up 30 mins ago. We literally had to speak to the manager about 4 times before he gained enough courage to ask the table \"how much longer will you be here?\" Fortunately they finally said they were leaving now. Apparently they do not honor reservations here so be prepared to wait regardless. We were finally seated and eating after 3pm. I had the Spanish omelette which was nothing special. The potatoes it came with were dry and only tolerable after drowning them in ketchup. Even though they seated us late we had to go back and forth with the server to honor the 2 hour bottomless mimosas we paid for since they tried to cut it short. Needless to say, we will NOT be revisiting the establishment. The food was far too average to deal with the bad customer service and wait.", "author": "A A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-23", "description": "The food was awesome! The service was fantastic, I will definitely be coming back here. The dishes were put together with class and the service I can not get over it!!!!! Love it.", "author": "Renee P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "This place really exceeded my expectations. I highly recommend checking it out. \nVerde 's drinks were amazing, they do take a little long to bring them out but it was still amazing none the less. We sampled a few different ones off the speciality cocktail list.\nFor dinner everyone was so happy with the choices we made. Meat lasagna, short ribs, baked clams, prosciutto and Baratta, and a portobello mushroom with arugula and goat cheese. Everything came out in a timely manner and was delicious! \nOur waiter Hector, was the best. Do yourself a favor and ask for him!!!! He was so engaging, funny, and attentive. He truly made the experience for us.", "author": "Jessica W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-12", "description": "Verde on Smith has my favorite weekend brunch in Brooklyn, hands down. To be honest, I've never eaten anything besides the Smoked Mozzarella Panino, but that sandwich drives me to occasionally go to brunch by myself if I haven't been there in a while. The unlimited deal is pretty standard for Brooklyn, cost-wise (I believe it's an additional $18 ish), and has more drink options than usual since they offer multiple mimosa flavor options/screwdrivers/etc. If you intend on going after 1 pm or have a larger group I would recommend getting a reservation, but it can also be great to pop in for a spontaneous neighborhood brunch. Highly recommend!", "author": "Meredith H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-13", "description": "ugh, a little disapointing. this past saturday, we made reservations for 7, to sit in front near wall, near window. we got there at 10 to 7 and all the front tables were taken.\nwe had the last table in the back, next to the kitchen door.\nverde is under new management, and the atmosphere was not the same.\nthe new owner was nice, but the lights for saturday night dining were too bright, and the music was god awful, from big band ( which I loath) to Ray Orbesson, \"pretty woman\", horrible. That was not dinner music. Try \"Cafe del Mar\" music, that is dinner music. Nothing worse than eating and hearing big band horns in the background.\nWe had gone here for years and this past saturday, the steak was raw in the middle, had to be sent back, the pasta was fine. But having made reservations for the front, and getting seated in the back, was, unfortunately not making me happy. I sat there as to not make a big deal of it, but really wanted to sit in the front. Some of our old friends were still working there and we were happy to see them.", "author": "Adrastos C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-22", "description": "Don't appreciate the cemetery lighting (feeling like I'm dining in a crypt). Can't even read the menu it's so frikkin' dark. The food was pretty good but everything is way, waaaay overpriced for what you get. I left $100 including tip for a modest dinner for two. Two entrees, dessert for one, a cocktail and a beer. Seriously. What am I paying for? Oh, and the owner is a major douche.", "author": "Miklos P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-21", "description": "Steak and Eggs w/ Rosemary Potatoes. I've been there multiple times, I keep thinking I'm going to get something new, but now. I get Steak and Eggs. Why? It's fucking delicious. \n\nBrunch drinks are a bit on the strong side for me, anything over two is knocking on day drunk territory but I'm a light weight unless there is rum involved.\n\nGood Service. Great food. There's isn't anything to complain about.", "author": "Anastasia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "One of the only few places in Brooklyn that offers a bottomless brunch, in addition to having a wider variety of brunch cocktails to choose from (other than the popular mimosa and Bloody Mary). We went on a Saturday afternoon and were seated right away, in the outdoor area which was very lovely. I had the steak sandwich and my boyfriend had the smoked mozzarella sandwich, mine was okay (I didn't like the taste of the steak), my bf loved loved his.", "author": "Yari G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-12", "description": "Really tasty brunch, casual ambiance, guests were pretty evenly split between couples on dates and groups of friends catching up. Highly recommended!", "author": "Chanel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Yassss to brunch with unlimited mimosas; the food was fresh, well seasoned and delicious. I had the egg Benedict, it was soooooo good. This will be my go to place brunch this summer. The staff is friendly and very efficient, as soon as you took the last sip, you had a new drink in your hand.", "author": "Alicia T."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}