{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-24", "description": "I think that this place is overpriced. Simple pasta dishes cost at least $14. My pasta wish shrimp and scallops was mediocre considering it was $18. I think the only reason it tasted decent was because they put a lot of sauce on the pasta. I wouldn't say the food was terrible it's just that it wasn't worth the price in my opinion.", "author": "brb b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-29", "description": "Great food, great music, great service. I'd defiantly be going back very soon.", "author": "Anthony D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-23", "description": "This place was a little weird. The manager or owner was practically staring my husband and I down the whole time we were there. Now that I'm reading these reviews I guess I understand why, they're worried about going out of business.\nThe food was meh. I had the bolognese, however, I like the bolognese I make at home better. There was a hostess that was stomping around the entire restaurant, which was very distracting. We could hear her every move.\nWe called the waitress over at one point to get more water and before we could say anything she apologized for the food taking so long, she said something about being \"so busy\" however, there were like 3 or 4 empty tables. The place only consists of like 10 tables. \nAlso, the waitress seemed woefully inexperienced, which made me feel really bad for her because she was like a scared mouse coming over to our table. It was all a little weird. \nWe left a proper tip but I doubt we'll be returning. It has a nice atmosphere but the food and service were just blah.", "author": "Teresa F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-02-15", "description": "With all the wonderful food that one can find and savor in Brooklyn, there is no reason for this restaurant to exist, other than to fill a void for those who don't care what their food tastes like, or looks like.\n\nAnd why did the bartender tell us that her margarita was the best we would ever taste, then churn out one of the most bland drinks I've had in years?\n\nIf the food was only so-so the presentation was horrible -- a rib-eye steak on a plate with four slices of potato? Boned fish with a dollop of spinach? And a pasta dish that as so awful our friend didn't eat it.\n\nYou never know but I would wager this place is not going to survive, at least not on the food. Can't speak to brunch or $4 martinis.", "author": "daniel w."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-28", "description": "Just moved to the area and I love this little gem. Gnocci was delicious and the broccoli raab was awesome. Love this.", "author": "Jerry B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-30", "description": "This place was just delicious!  I gave 5 stars to try and up their average because I didn't understand why they were 3.5!  The eggplant lasagna app was delish, and so was the orrechiette with spec and chickpeas.  YUM YUM YUM!!!", "author": "Shira G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-07", "description": "i don't get all the haters!  Our waiter was enchanting, attentive and informative.  The food was great.  Not life-changing, but delicious and the decor is very hip for the neighborhood.  Made our 'date-night' away from the baby feel like money well-spent.", "author": "Nicki W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-15", "description": "Only went here because someone got me a stupid gift cert to restaurant.com.  This was one of the few Italian rest by me that was on restaurant.com.  \n\nArugula, fig and prosciutto was very good.  Shrimp scampi was not good.  Shrimp had a strong fishy flavor like it was old and not of good quality.  Gnocchi with broccirabe and sausage was not good either.  Way too much oil and nowhere on the menu did they say they chop up the broccolirabe and sausage like it was corned beef hash.  The dish didn't come out as I expected.  \n\nWould not return to this place.", "author": "Jeffrey H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-08-03", "description": "We stopped in here for a $5 glass of wine during happy hour. It was early and the place was pretty much empty. It looked classy enough and the bar tender was friendly. I'd try it again next time I'm in the neighborhood if there is more of a crowd. Also, the food that we did see looked nice and the menu looks decent, so they have that going for them.", "author": "Holly N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-16", "description": "Beautiful space. I can tell that this place will be hopping once the weather turns a bit warmer. Overall we had a great experience, but I believe they may want to explore the menu. It appeared things were inexpensive, but with a lot of two-tops, it lacked enough \"shareable items.\" The menu is dominated by pasta items that appear small and then larger plates. A meat + cheese plate would be welcomed  as well as some crostini options. They were really very affordable for the food, but $7 for a draft beer is a lot in this area of brooklyn. Will try it again soon.", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-19", "description": "This was some good italian food! THE END! started with the oysters and moved on to the rigatoni which was flavored just right. Has a rustic true taste to the food that i love.", "author": "Winston R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-19", "description": "great spot for brunch in our hood. unlimited drinks is solid way to start my sunday funday.", "author": "Sasha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-02", "description": "This a fantastic jewel of brooklyn. I had a birthday there last night and the quality of the food and service was very impressive. I had the gnocchi for dinner and the prosciutto goat cheese salad, and was very happy with my order.", "author": "Monument I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-16", "description": "the french toast, the bottomless drink sprecials, the lobster shrimp clam platter, the steak and eggs, the potatoes,  the burgers, and the service deserves 5 stars. the garden is very beautiful in the summer, but be mindful that business picks up during the summer brunch days so prepare to wait.", "author": "Shayana C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-20", "description": "They fixed it, music was fun, lively.  The spirit was too.  THe owner had a smile on his face and a packed house.  And we got some extra prosecco and grappa.  How could you go wrong?", "author": "aimee m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-02", "description": "My bf and I live close to this restaurant and have been interested in trying it out since it opened. Restaurant.com offers a $25 coupon as well,  so went last Friday and were pleasantly surprised by the quality of our experience. The live music was fun, the waiters attentive and the food was excellent. The Caesar salad (though a little rich) was possibly the best I've ever had and the penne alla vodka was delicious. They even brought over a little bowl of extra parmesan cheese with the meal without my having to ask. Overall a very satisfying meal - we will be going back again very soon!", "author": "Ariel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-22", "description": "Awesome food, great atmosphere! Get the mozzarella And prosciutto app and mojitos are great too! Can't wait to come back! :)", "author": "Shobs J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-12", "description": "Firstly let me outline I am a picky eater. It is very rare that I say I enjoyed everything we ordered. However I have been to Verde twice now and honestly really enjoyed everything. We stated with Gorgonzola salad! Delish! And then had muscle spaghetti. EVEN BETTER! If you haven't tried this restaurant take my advice and go there. The staff are great and the food is even better. I can't wait to go back.", "author": "Jessica R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-04-28", "description": "Green happens to be my favorite color and Verde will surely become my favorite restaurant.  Everything, from the décor to the service to the sublime food, not to mention the wine, is magnifico.  I would describe the décor as understated elegance with exposed brick and very romantic lighting that creates a cozy and convivial setting.  \n\nI went with a group of people on a Saturday night when the restaurant was filled to capacity and the service and food never skipped a beat.  Luckily, all in my party are adventurous eaters and for the appetizers we ordered everything on the menu so we could share.  That included the tuna and salmon caparccios, fresh sardines with red onion relish, eggplant lasagna with meat sauce, and buffalo mozzarella and proscuitto.  \n\nBoth carpaccios were beautifully presented and the fish were fresh and inventively seasoned.  One of them, I can't recall which, was served with thin crispy wafers which complemented the dish perfectly.  Fresh sardines with red onion relish lifted this much maligned fish to new heights and possessed a pleasant briny flavor.  A layered eggplant with meat sauce was surprisingly light and cooked al dente, a nice departure from the heavily breaded overcooked versions commonly served.  My dreams, though, are pervaded by the perfectly matched proscuitto with buffalo mozzarella, both imported from Italy.  The mozzarella, slightly sweet, melt-in-your-mouth creamy, was balanced by the savory counterpoint that had just the right consistency and saltiness.  \n\nNext was spaghetti with scallops and sea urchin in a slightly creamy, lemon flavored sauce, certainly not your run of the mill pasta dish.  This is something I've never had before and certainly could not replicate in my own kitchen.  It was cooked perfectly and had just the right amount of sauce which allowed the other flavors to come through.\n\nFor the main course, I chose the roasted chicken on a bed of purple Peruvian mashed potatoes accompanied by roasted peppers.  What a wonderful combination and I loved that the potatoes had an intense earthy flavor that wasn't watered down but rather enhanced by the added ingredients.  We didn't share our entrees because everyone was too busy enjoying them, but those sitting closest to me had the filet mignon and they all raved about it.\n\nDessert again was a smorgasbord with everything on the menu ordered.  The flourless chocolate cake with pignolis was rich and creamy.  One of our dining companions has an allergy to pignolis and magically another version without them was produced for her.  A heavenly concoction of chocolate ice cream spiked with liqueur and a crunchy topping reinvents the typical Italian ice cream desserts.   The most original dessert though, evoking gasps and sighs from our party, was a ravioli with a pineapple and coconut filling accompanied by coconut sorbet - a work of art.\n\nThis fledgling restaurant is already operating like a well-oiled machine with attentive, yet unobtrusive service, and an original menu unlike any I have experienced elsewhere.  Everyone in our party agreed that Verde will become a regular destination.", "author": "Nancy M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-27", "description": "This is a decent place, nothing extraordinary or exciting about the food or the drinks or the prices but the staff seems friendly and nice enough and I just saw a sign for an all you can drink brunch - so together that seems like it'd be worth coming back for!", "author": "sasha y."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}