{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-25", "description": "Excellent food and service.  I came here for my birthday celebration and they came out with a piece of cake and a candle and sang to me.  \n\nI never had a bad dish here and recommend everything.", "author": "Debbie D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-29", "description": "The service in this establishment is absolutely terrible. I was never able to taste the food as it never arrived at the table. My wife and I went for brunch. We sat, placed our order and 45 minutes later there was still no food. (Pancakes and Eggs). During this time I asked the waited for an update on the food and he just ignored us. I then asked a woman for an update on the food. She shrugged her shoulders and pointed at the man who choose to ignore us. We finally had enough and I stood up to get his attention again and then he tells me the kitchen never made the food. The manager then come over and I explained the problem to him as well. The manager confirmed that the kitchen never made the food because they were too busy. He asked if we wanted to continue waiting for the food we told him no. 45 minutes is too long to wait for pancakes and eggs that have never been made. \nWe instead went to Cafe Luluc next door and had an amazing meal. \nWhat a disappointment this place is.", "author": "tai d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-22", "description": "Booked a reservation last minute for me and my mom for Mother's day. It was one of the few places that wasn't booked up and actually looked like it had good food. \n\nUpon arriving, it is a very tight space. There is really no waiting area... as soon as you walk in there are tables. However, we were seated right away. \n\nComplimentary bread with olive oil to start. Mom had the seafood linguine which she loved! It was really loaded with seafood. I had the penne vodka - honestly not too flavorful. I had to add a ton of black pepper and parmesan to add any taste. The chocolate mousse dessert was delicious.\n\nService was very prompt and friendly.", "author": "Deanna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-08", "description": "I love this place. Whether it's for brunch or dinner, the ambiance of this place helps you look pass its size. Both the brunch and dinner menu has many options and they are moderately priced. Their drinks are good and they have happy hour specials too!\nThe service by the bartender Bilo (I hope I spelt this correctly lol) and Mark were great.\nI look forward to returning on a warmer day to sit outside in their patio space enjoying a couple of mimosas or Bellinis... Ah!", "author": "Danielle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-01", "description": "Wow! Verde did it again! Every time I visit for brunch I am so blown away with the yummy food and attentive team there. This time I got to enjoy their cute outdoor space and try out new dishes- French toast \u0026 frittatas. The manager Mark went over \u0026 beyond to make sure that my visit perfect. My waiter made suggestions on the different brunch cocktail options which was very helpful! I can't wait to visit again, so many more things I want to try. \n\n@verdeonsmith was great! \nDrinks: bottomless options are sweet- mimosas, bloody Mary's,  screw drivers \u0026 peach, raspberry and mango bellinis.\nAtmosphere: Dope, though I don't recall any music, the loud chatter \u0026 laugher coming from millennials \u0026 Brooklyn natives was enough to make the place feel super cozy. \nFood: Super tasty, there were about 40 different items on the menu. Ranging in unbelievable prices from less then $10-$25.  Pictured are the steak, eggs, mixed green salad and roasted potatoes. Also, pictured, branzino, mashed potatoes \u0026 mixed green salad. @chas_ea", "author": "Chas J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-28", "description": "Ended up here because another restaurant up the block gave me one Star Service before I even got seated. I believe everything happens for a reason because VERDE HAD THE BEST SERVICE EVER. They made what was a stressful Easter Sunday into a pleasant evening sitting in their yard. Ended up seeing my family there which was also a blessing!!!! \nWill definitely be back!!! \nWine was served chilled and water constantly refilled. \nWe had their mussels! Yummmm..... Chicken Francais.... Delcicious.", "author": "Alana G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-19", "description": "Another great restaurant found thanks to yelp. I was looking for a bottomless mimosa brunch in Brooklyn. Yelp provided this establishment in its search results. And I was not disappointed. \n\nEverything was good about my visit. There was a minimal wait to be seated - 10 min. It was busy but they have an inside and an outside. Since 2 seats freed up at the bar we sat there.  Great decision.  The bartender Bilo (hope i spelled that right) was great. Friendly,  attentive and keeps your glass full. As i watched him make other drinks, he is very skilled in his craft. Food was good too. Sorry no pics but I was HUNGRY and the food just disappeared. Lol. Steak and eggs as well as crab cake sandwich. \n\nIf you are looking for a really good brunch with 2 hour unlimited (mimosa, bellini, bloody mary, champagne), good, strong drinks and great food - make your way here. Highly recommend.  Staff is very friendly too. \n\nNeedless to say I will be returning.", "author": "Kim W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-20", "description": "My friend has raved about Verde and after coming here for the first time this week, I can totally see why. Thanks for the intro here, Johanna!\n\nWe stumbled in on a Tuesday at around 9 after a holiday party looking for a quiet place to eat and catch up. Verde definitely delivered on that! Marco greeted us at the front and had us seated immediately. The space itself is warm and inviting, and very nicely decorated for the holidays. It was pretty quiet, likely because it was kinda late on a Tuesday, but that's exactly what we were looking for.\n\nWe started off with the fried zucchini which we devoured and then moved into our entrees. My friend ordered a shrimp dish wish I totally stuck my fork in for a taste test, and everything was perfectly seasoned. I ordered the Salmon Scalloppini - served with mixed veggies and mashed potatoes - for myself and was definitely impressed. The salmon was spot on. My only little complaint is that the veggies were cold, but it's not like that stopped me from inhaling them lol.\n\nThe service was definitely a big highlight. Our servers were delightful and Marco really knows how to give his customers a warm welcome. We were even given a complimentary dessert which I thought was really sweet (pun intended) of him!\n\nI'd definitely like to come back on a weekend to sit by the bar and order some apps. See you soon, Verde!", "author": "Cristina G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-08", "description": "Came here for brunch. I ordered a kobe burger wnd fries. Very flavorful. They have bottomless mimosas and a brunch menu EVERYDAY from 11AM-4PM. Now you dont have to wait until weekends. Food is fresh, they never disappoint.", "author": "Dessi B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-06", "description": "On many weekend afternoons we have witnessed the hoards of brunch-goers cluster into and around Verde. Many I suspect are awaiting an opportunity to participate in their $20 bottomless brunch drinks, which looks like a fantastic deal and offers various beverage options. Unfortunately I did not indulge in that, but we figured the food must be somewhat decent to draw such consistent crowds and decided to give it a shot.\n\nI left with mixed feelings. The prosciutto frittata was my order, and I felt like it was missing a few things. I don't enjoy putting ketchup on eggs, but needed to in this case to offset the blandness. A little bit of cheese added to the recipe would go a long way, and they skimped on the prosciutto. Even the greens that came on top were dry, something just a touch of dressing would fix. \n\nI did, however, really enjoy the beef crepe that my girlfriend ordered and oh-so-generously let me sample. It had a ton of flavor, and the sauce and juices were abundant. The beef itself was pretty good, too. \n\nI'd probably go back to Verde for dinner or for any non-egg meal. The service was friendly, and the prices are way better than the norm for this area. It's worth checking out.", "author": "Rich B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-14", "description": "Avoid steak and eggs! \n\nWe came in for a Sunday brunch with my wife and kid. Weather was nice so we chose Verde because of the outside seating.\n\nOutside seating: backyard seating, similar to most places on Smith st. No umbrellas to hide from the sun though.\n\nService: the service is poor but not terrible. The waiter had to leave 3 times to bring all the manus. (1. Food 2. Kids menu 3.drink menu) every time he left it took at least 5 minutes to return) after 45 minutes of waiting for the food we asked for some bread for the kid which I feel should have been brought as soon as we sat down and ordered. Another 10 minutes later they brought the food. The kids order was wrong and he had to continue eating bread.\n\nFood: \n\nSteak and eggs: \neggs were perfect over medium, but the steak smelled and tasted like it was marinated in charcoal lighting fluid. I couldn't eat it. I was hungry enough to give it a shot so I tried adding tobacco and ketchup but it didn't mask the chemical smell or taste of the lighting fluid.\nThe kids wrong order turned out to be the best tasting dish. Grilled chicken with sweet potatoes fries. Both were cooked well.\nMy wife ordered salad with grilled chicken. The chicken was cold and rubbery/ chewy. The rest of the salad was tasty, but without chicken. \n\nAfter a asked the waiter why the steak smells and tastes like a canister of lighter fluid he paused and said: \"hmm ...  really? \" And left.", "author": "Paul Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-12", "description": "I've been to Verde in the past for brunch and it was a winner among my friends.\nNote---it is now under new management and I couldn't be more satisfied with my experience this evening.\n\nI found out that happy hour lasts until 11 PM during the week! Unheard of as most happy hours end far earlier. But Verde Cafe has been a staple on Smith Street for some time and has a following. Rightfully so.\n\nWe decided to sit at the bar and was lucky to have Yulia as our bartender. She really knew how to create drinks with the right proportions and with such a pleasant, welcoming attitude.\nFor instance, I love Mojitos but oftentimes it is way too sweet. She created the perfect sweet/tart balance. Very good.\n\nBy the way, the ambiance was adorable in full Halloween decor. Sitting at the bar was comfortable and cozy. But their table accommodations were also very inviting.\n\nFor food, we selected the seafood appetizer containing squid, octopus, shrimp, mussels, red peppers and celery. We enjoyed this appetizer a lot accompanied by a nice side of warm, crispy bread and olives. \n\nAfter reviewing the menu for additional food, we decided on the salmon served with sauteed spinach and couscous. I really enjoyed the balance of flavors presented in this dish. Very delicious.  I'm usually cautious when ordering salmon for fear of it being overcooked but it was done just right. No complaints. The portion size along with our previous appetizer  was definitely shareable \n\nWe also had the pleasure of speaking with the new owner, Mark, who was enthusiastic and passionate about the launching of a new brunch/lunch/dinner menu.  We got a sneak preview of it and everything looked amazing.\n\nHe extended to each of us, on the house,  a glass of Chianti. Smooth, delicious and mellow---it was a nice finish to a great meal.\n\nI really like the ambiance, attentive service, vibe and food that Verde has to offer. \nIt was a crowd pleaser and I'm looking forward to trying their new updated menu.\n\nWell done. Thank you!!!", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-02", "description": "Amazing food and great service. Homemade food\n You do not even need syrup for your pancakes. Bottomless is great too", "author": "Fabiola M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-27", "description": "What a truly sad example of this so called\n \" Italian food \" waiters were very nice, \nbut the food was so bad, not one item from the menu was edible, over cooked rubber octopus, \nold clams and a watery, tasteless eggplant dish, that was the start, still willing to give it a shot, ordered a burger, medium rare, alpo dog food smelled better .\nPlease change your cook!! \nThrew away 200. 00 dollars, maybe McDonald's would have been a better choice", "author": "Margaret R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-29", "description": "Came across this place a while back and had been wanting to try it for a while. I'm soooo happy I finally got to. A friend and I went for Sunday brunch. There's a cute outdoor area but it was still a little too cool for us. We went on a bit of a gloomy day which worked in our favor- we were seated immediately. But it was definitely still a full house \n\nLet's start with the service:\nThe waiters were really nice and attentive. We opted for the bottomless option for an additional price ... \u0026 I literally never saw the bottom of my glass ! \n\nThe food:\nNow, I'm am a self pronounced stuck up pancake eater. \nAs simple as it seems- everyone can't make pancakes, and that's okay.\n\nWith that being said: GET THE PANCAKES ! They are sooooooo good !!!! I meant to take photos but everything was so appetizing that I just didn't have time for that !!! Lol\n\nI want to go back to try dinner. \u0026 I especially can't wait to go back and have brunch again !", "author": "Danielle H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "WoWwwww . Verde which is under new management now , has tremendous renovated its style and dishes . I was truly amazed at the new setup and welcoming staff. Went over on a Saturday, got the bottomless Brunch special, so worth the price. There was no waiting, we were seated right away. The service was marvelous, on point. I ordered the Steak and Eggs . The streak was made exactly to my liking , and was a good enough portion . Friend got the Eggs Benedict, she really enjoyed it . Now for all you people, that's love outdoor seating they have a seated backyard open as well . \n\nAmbience  - 10/10 \nService - 10/10\nOutDoor Seating - Yes\nParking - Meters \nWiFi - Not Sure \n\n*Bottomless Brunch for $19.99*", "author": "Sajal B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-18", "description": "One of my go to spots for brunch ! They have unlimited 2hrs mimosas/bellinis for brunch, the food and ambiance is great ! I definitely recommend everyone to try this place out, they have new owners and a new menu. They also have a patio, which is great for nice weather.", "author": "Sasha T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-16", "description": "Wow wow wow wow !  I've come here on various occasions and each time it's been a 5 star experience! Literally starting from the welcoming staff, the chill ambience of the venu, the amazing food and delicious drinks! I promise you won't be disappointed with this place. Special shoutout to Marco (the boss man) who is extremely personable, social, and accommodating!", "author": "Talia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-07", "description": "Verde was definitely a great find with a delicious menu and awesome ambiance. They also offer bottomless drink option with their brunch. The food was very fresh and delicious! Cant wait to come back and try other dishes! Staff were very attentive as well.  Definitely looking forward to enjoying many meals this summer in the backyard area.", "author": "Nadia K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-16", "description": "This is my favorite Italian Restaurant in Brooklyn!!!! Every meal is so delicious. It reminds me of my first time in Italy!!! Verde is know for their amazing brunch. But their dinner  is to die for. The salmon taste extremely fresh and  makes your mouth water. And don't forget the drinks!!This is a great place to bring family and friends to celebrate every occasion!!!", "author": "Veronica A."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}