{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-12", "description": "An absolutely fantastic restaurant. The food is delicious and the service is better than any other restaurant on Smith St. \n\nI have been here dozens of times and tried most things on the menu. Its great for dinner and brunch. It's our go-to spot for date night as well as for family gatherings. \n\nThe eggplant appetizer and the pastas are among my favorites.", "author": "Tiffany W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-27", "description": "Had brunch at 2:00pm on a Saturday afternoon with a couple of Gfs. We were seated by the entrance about 5 minutes after we checked  in.\n\nA couple of us order the Kobe Beef burger - It was good! Not the best I've had but it was definitely juicy.\nMy friend ordered the steaks and eggs I believe - I had a piece of the steak and it was perfect!\n\nand let's not forget the unlimited drinks for an extra $17.95! Mimosa glasses were NEVER empty - just the way you like it!\n\nOverall, good food, restaurant ambiance was great (not too loud or too packed) and drinks were awesome. Service was slow in the beginning. \n\nWill I come back? yes, if I wanted the bottomless brunch option.", "author": "Laney L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-13", "description": "Brunch is where it's at here kids. Dinner was meh. Service at night seems not as attentive as brunch either. There is a General Manager type who seems involved and somewhat on top of things. I was disappointed in my service overall and it was Mother's Day and not crowded. \n\nAs I said, dinner was middle of the road.  I wanted to love it the way I loved my brunch and bottomless Bloody Mary's which are top notch (please know I'm very hard to please in the Bloody Mary market)\n\nIt wasn't an awful meal but nothing rocked my world. The baked clams were pretty tasty and lobster bisque was a 6 out of 10.  Not creamy traditional but more tomato and spice. It was Ok.  \n\nI'm hurting for positive adjectives so I must go now.", "author": "Foodie Mamma X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-01", "description": "Came here for brunch in December.  This place is small, there is outdoor seating but it was closed because its Winter.  So there was a bit of a wait for a table but I didn't mind because my group was the only one waiting so we were seated when the first table opened up.  I opted for bottomless belinis and I tried all their flavors but the mango was my favorite and my friends also agreed.  We had a couple of items on the table, I ordered the french toast which was amazing. I will definitely be back for brunch but probably when its warmer so I can sit outside.  I probably will come and try dinner as well.", "author": "Yeminem O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-31", "description": "I love Verde on Smith and was very happy with food + drinks but my friend and I became so sick after eating the steak and eggs that I felt compelled to post here. Others in the group (3) did not get sick as they had not ordered the steak. I'm honestly not sure if this was a fluke but I suspect it was the steak, unfortunately.", "author": "Elisa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-04", "description": "I have been here so many times. Although, I have been disappointed once the food and drinks (especially) is always right on point.  I can definitely say this is my favorite Brunch spots in Brooklyn that service a boozy brunch. There isn't many spots in Brooklyn that serves  unlimited mimosas that's made correctly (no vodka please).", "author": "Tammi B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "Wonderful service from Luis! Wonderful food (try the french toast with seasonal fruits) and it was a great vibe. I will definitely come back for brunch, and maybe dinner.", "author": "Tyler R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-06", "description": "I'm a fussy eater, so there are usually only one or two things on menus I'll actually eat. Not here. I could have chosen half the things off the menu, and that was before I'd heard the specials. I wasn't disappointed with the thing I went for: it was delicious and there was lots of it. To top it off, the cocktails are amazing and the staff are extremely friendly.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-03", "description": "Yes I was there for brunch this sunday. I just wish I could of received the help I asked for and was told I would recieve. I even asked for further explanation and the waitress said I'll just get the manager but she never did.", "author": "Tahirah W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-30", "description": "My friends and I came here for brunch after a particularly rough night out and it was a great choice.  Firstly, there was no queue and it was easy to get a table on a Sunday morning, which is a pretty big perk, especially in such a busy and overpopulated city like NY.  Secondly, the ambience was really nice - I particularly enjoyed decor and I'm always a sucker for exposed brick.  We did notice that they run a bottomless brunch for far less than most places in Manhattan ($17.99 instead of around $50).  I ordered the pancakes and berries and they were so delicious that even when I was feeling full, I just had to clear my plate.  I would definitely come back to Verde next time I'm in Brooklyn.", "author": "Whitney R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-16", "description": "They were closing, but still let us dine here. We were so thankful because the food was fresh and filling! So happy to have eaten at this little gem! The Primitivo wine and beef carpaccio are most haves for your order! :-)", "author": "Casey J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-16", "description": "Very good dinner and service Friday night!  We were greeted quickly and our party of 11 was seated on the patio. Service was great and so was the food.  The crispy gnocchi was different and very good.  Other entrees ordered were the zuppa di pesce- great, duck ravioli- the person who ordered this couldn't stop raving about it, spaghetti with clam sauce- excellent, veal- delicious and rich, salmon- great.", "author": "Lisa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-14", "description": "Me and my friends had a dinner which was beoynd any expectations.  Food was delicious, service was attentive and friendly. \nWe ordered branzino which was oven roasted and perfectly seasoned, short ribs in red wine sauce, lobster feast and a few appetizers to start with. Everything come out in time and was perfectly cooked. They also have a nice choice of wine and delicious drinks.\nWe really enjoyed our time and dinner,  I strongly recommend this place!", "author": "K S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-30", "description": "This place is in convenient location, stylish and clean, nice relaxing atmosphere and affordable prices, has bar as well,  all this make it a great solution after long day at work", "author": "Julia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-12", "description": "I love this place, food is really!!  perfect!  staff is very friendly, waitress was always smiling and nice, drinks was strong and comes fast, atmosphere is wonderfully. One of the best places in this area Come back for sure!", "author": "Alex M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-09", "description": "I kinda love this place. I've only been for brunch, but I haven't had anything that I didn't like. The pancakes are my absolute favorite. I've also had the french toast, steak \u0026 eggs, and eggs benedict. Oh and they keep the mimosas and bellinis flowing if you decide to do the unlimited.I took off a star because sometimes the servers can be a little hasty, but I recommend this place to anyone. There aren't too many brunch places in Brooklyn that I love but Verde is high on the list. Go here!", "author": "Patrice M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-18", "description": "We ended up here a few weekends ago, we were supposed to go to Cafe Luluc but it was a bit packed and loud so decided to go here instead.\n\nService was quick, and the place was pretty quiet and nice. We ordered a mozzarella sandwich and a kobe burger and both were pretty good. The bloody marys were strong and tasty. \n\nThe bill was kind pricey for what we had, around $50 without tip, but it was a nice meal.", "author": "Ana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-24", "description": "Went to Verde with a group for a birthday brunch with a party of 12. When the birthday girl arrived the host was quite brusque with her. He asked her where her guests were and advised her that the two hour booze would stop flowing two hours after her reserved time regardless of when her guests began drinking. She and most of the party arrived about 30 minutes after the reservation time...Yeah, can't blame him for his attitude. Every dish we ordered was good (steak and eggs, eggs benedict, Kobe burger, shrimp Caesar salad, salmon) and the drinks were excellent and a really, really good value. We had no issues with refills. One order was incorrect, but they fixed it as promptly as possible. The patio looked like a nice spot to eat, but we sat inside and it was cozy and comfortable. Two hour meter parking outside, except on Sunday.", "author": "Eva C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-02", "description": "Absolutely HORRIBLE!!! Went here for dinner, ordered zuppa di pesce which had an awful smell, clams were chewy and rest of dish was inedible. Extremely disappointed. Will never go back- this is how people get sick, do not serve them old or cheap seafood.", "author": "Kristie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-12", "description": "I have been here twice. The Gorgonzola salad and stuffed shrimp appetizers are great. Full of flavor great presentation. For main course I had the Lobster Feast. It was intimidating as it approached my table. It had a half lobster cut in half breaded, breaded shrimp, claims and French bread. It was tasty but I wish they would have cleaned all the green stuff out of the lobster before it was served. I could only eat some of the meat. I love the ambience and the manager was awesome.", "author": "Meme B."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}