{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-30", "description": "It's Easter Sunday, and we made reservations, so I would think that meant we had a reserved table.... NOT!!!!! \n\nWhen we arrived at 1:50 for our 2pm reservation. The hostess told me that it would be a few minutes because they were crowded.  I reminded him that we had a reservation, and he stated we only use that as a guide???? Huh? REALLY??? \n\nAfter a few choice words the hostess informed me our table would be ready in 10 mins.\n\nWe were finally sat and ordered our food via a server who should never been.\nThe food was mediocre. It was an annoying experience!!\n\nAll to say, I won't be back!", "author": "Shea G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-25", "description": "It's really good. \nAnd a really great option if you don't want to go to one of the other really awesome restaurants in the neighborhood.", "author": "Will B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-14", "description": "I love the Kobe Burger here. The service is off and on. They can't handle a rush.\n\nThe first time we came here, the service was good, but we came here on a voucher, but the voucher did not specify when we could eat there, so we ended up paying full price. But the food was great, so didn't complain much, the staff was awesome.\n\nOn another occasion, the service is great when we're eating inside, the waitstaff were attentive.\n\nBecause we love the Kobe Burger so much, so we came back for lunch, but then it was not on the menu, and when I tried to order the Kobe Burger, I was told that they did not have it.  They did go back to ask, and found out it was a dinner item, and\nthe management was so nice they made it anyways.\n\nWalked into order some food to go, and they were just too busy to even notice me.", "author": "Sheryl G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-14", "description": "The prices have gone up to a point where while yes, the food is good, it's not worth going there without a discount or gift certificate anymore, sadly. Their wine markup is absolutely ridiculous.", "author": "Eloise M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "Food is so good I recommend the Kobe burger and the eggs Benedict and the bacon...bloody Mary's are eh kind of too strong and watery..bellinis so good though! And staff is great..Louis is awesome", "author": "Ciara D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-31", "description": "This was a delicious brunch spot. 10 of us came here the night after a bacehlorette outing. The food was delicious and HUGE portions. \n\nI got the steak and eggs, very tasty option. So much steak too... and all for just $15! They also have a boozy brunch option for the future.\n\nThe staff was friendly, but I could tell they were a little overwhelmed. There were two very large parties to be fair. \n\nI will definitely be back in the warm weather to hang out on the back patio!", "author": "Linda P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-12", "description": "Nice Calm cool place came here for brunch food is really good and I had a mimosa. They have a Unlimited drink special for 17.95 for two hrs but its per person. The waitor could have looked less irritated though.", "author": "Tissy R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-26", "description": "Had a lovely \"girls weekend\" with my two besties and we went here for the bottomless brunch. The food was and environment was great but try to get there early because it fills up fast.", "author": "Akilah R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-28", "description": "Loved this place!\nStopped in for dinner on Sunday. Everyone was pleasant, the decor was beautiful, and the food was delish.\nI had a tortellini special, the gorgonzoli salad, and the mixed berries for dessert.\nI literaly have no complaints.\nThis is a cute spot for dinner with the girls or a date night.\n\nThey have outdoor space in the back which I am sure is open in the Summer.", "author": "Nikki H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-07", "description": "Loved Verde on smith. The service was great. We got there early so we beat the rush and were seated right away. You can choose which brunch cocktails you want for your unlimited choice. I got my traditional steak and eggs and was very pleased with the portion of steak. Everywhere else I've gotten probably more eggs  than steak. I have to try everything else in the menu now ! It's small and cozy with warm decor. Go early or make reservations if they have them this place gets very busy after 12!", "author": "Yomaira C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-21", "description": "Haven't been to a bottomless brunch spot in a long time. Alot of regular places stopped doing it or they keep it under wraps. Verde on Smith offers a fantastic brunch menu but it is one of the more pricier menus out of the bunch. You can always opt to skip the unlimited drinks but that is dumb. \n\nThe place is fairly large and has a nice decor. They have outdoor seating in the back. We got there fairly early (12:30) and didn't have any problems sitting but after 1pm it got really busy. Make reservations ahead of time. There is a bar you can sit at right in the front. The staff was nice. Service was ok. Not the best service but prompt and they kept the drinks coming. There was 8 of us in the group and we got seated even though all of our party wasn't there which is great. Most places make you wait. \n\nThe menu is pretty great. Better then alot of the other popular brunch spots I usually go to. They have a bit of everything and I think the party I was with enjoyed what they ordered. I ordered the kobe beef burger. You can get your choice of cheeses, sauteed veggies bacon or prosciutto. I opted for the cheddar and bacon with sauteed mushrooms. I never had a kobe beef burger before. It is much more tender and fatty then regular ground beef. I asked for it medium rare but I think I should of said medium well. It was juicy enough. That complaint is on my end and not the restaurants. It was cooked perfectly otherwise. It came with \"fries\" which was nothing more then large sliced potato wedges. Don't get me wrong it was good but I was kinda bummed I didn't get actual fries. Originally I was going to order the sausage and broccoli rabe panini. I will definitely get that when I go back. \n\nDrinks were plentiful and amazing. You have a choice of bellini, champagne, mimosa, sangria, and bloody mary. There were 4 types of bellini to choose from. The drinks were strong and tasteful. They don't skimp on the alcohol. The servers replaced finished drinks pretty quickly. There is a 2 hour limit on brunch but they let us stay longer. It looked like the host was kinda getting annoyed with us and kept looking our way but didn't say anything. \n\nOverall this was a great bottomless brunch experience and i would go back again.", "author": "Eric R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-30", "description": "We went to Verde tonight after purchasing a restaurant.com voucher. I'd never heard of this place before and was not expecting much based on the mediocre reviews. However, I was pleasantly surprised and really enjoyed dinner. The owner was actually very nice and our server was fantastic. Everything we ordered was delicious (amazing baked clams!) and we were unfortunately too stuffed to even order dessert. The restaurant itself is very cozy and intimate; perfect for a date night, not so good for larger parties. Based on my experience tonight, I will definitely return. Would love to head back for their brunch.", "author": "Kristina D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-13", "description": "The first hint should have been that not a day goes by without seeing a Groupon or Living Social deal for this place.\n\nThe second hint should have been that it's often empty at night.\n\nYet, we ventured in. Unfortunately.\nWhile the bartender was very friendly, the owner is much less so.\nAdditionally, the food was a disappointment. Rubbery chicken and tasteless steak, paired with a horrid happy hour chardonnay. \n\nMaybe this place makes for a good spillover brunch when LuLuc is too crowded, but for dinner, there are better options.", "author": "weldoris b."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-19", "description": "I was very underwhelmed with brunch here. We wandered in when the line up at our intended restaurant was too long, and we were too hungry. There was no line up here, and plenty of tables. At the time this was taken as a good sign, now I think maybe not? \n\nThey do offer unlimited alcohol for $16.95, which we did not partake in. Perhaps if we had the meal might have been more memorable.\n\nI ordered the eggs. The eggs were well cooked, but served with 3, count em THREE pieces of potato (a simply puny amount), and a handful of salad. No toast. No bread on the table. Bacon was ordered on the side (because it wasn't served with any sort of meat or alternate). My meal came to $16 ($10 eggs, $4 bacon, $2 tea) plus tax, and I left hungry. \n\nI won't be back (for brunch at least).", "author": "Tara E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-23", "description": "Absolutely Wonderful service and meal!  My fiancé and I made a 6pm reservation today. As soon as we walked in we were greeted by the hostess and seated at out table immediately.  The garcon explained in detail the specials for the day.\n  We ordered the Branzino and Salmon with couscous and sautéed spinach for our Entrée and the stuffed crabmeat Portobello Mushroom for appetizer.  Every bite left you wanting more, more, and more. :-)\n We will definitely come back here again with family and friends.", "author": "D S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-27", "description": "Bartenders/servers-great \u0026 attentive\n\nManager/Owner-ummm....not so much\n\nSo bummed when our local *go to* after works drink spot turned into a 'never again' tonight. Loved the place and was psyched to see a Groupon for it. Bought two, followed the rules, checked with the bartender at the beginning of the night about using both Groupons on separate checks. She took my iphone (slightly odd) to the back and checked with the mysterious manager and she said all was well. \n\nAt the end of a fun night manager/owner \"Carlos\" said we could only use one per 'party' and not one per person (even though the groupon says one per person). Captain Fun actually hauled out a computer that was on the bar and logged on to Groupon to show us the policy which WE pointed out we followed exactly. He would NOT let us use both Groupons.\n\nIn our discussion he said the words, \"Listen Lady...\" at which point ANOTHER CUSTOMER (hero) stood up and said, \"don't speak to them that way.\" She also said \"I have worked in customer service for 20 years and that is not how you speak to people--the customer is always right.\" \n\nYay her! Boo that place.  Oh Carlos...not a smart move. There are so many other places to go and eat and drink on Smith Street, btw. And our hero was right--the customer IS always right. Always. It seems your \"40 years in customer service\" has not really paid off....or panned out.", "author": "Melvin S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-15", "description": "I ordered the gnocchi with broccoli rabe and sausage. When it arrived, there was no sausage to be seen. I asked my waiter, who somehow thought I had asked for the dish WITHOUT SAUSAGE.\n\nAghast, I said, \"Sir. I would NEVER do such a thing.\"\n\nMy companion was prudent enough to point out that the waiter does not know me, and cannot be expected to be aware of my deep, abiding love for sausage. The waiter then handled the situation very gracefully in the face of my indignation, and soon enough I had a new bowl of pasta complete with sausage. No hard feelings. \n\nAnd it was pretty good. The gnocchi were a bit dry and heavy, but the flavor was decent. As was our Caesar salad, her lasagnetta, and our bottle of wine. Everything was just fine, without standing out.\n\nAll in all, Verde seems to be a perfectly nice little Italian joint on Smith. It is well decorated; dining inside or in the lovely little garden both seem ideal for a date. However, the food seemed unremarkable, and with so many Italian options in the area, I probably won't become a regular.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-11", "description": "Unlimited drinks (bellinis, mimosas,  screwdrivers) are always great tasting and the price for it is reasonable. The guy at the front who greets is moody. Sometimes it feels as if he can care less if he gets your business or not. Food is good.. Stand outs are the French toast and the lobster special they offer.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-07", "description": "I had brunch here one morning when Cafe Luluc next door was terribly crowded and I couldn't wait any longer to quell my mounting hangover.  \n\nAs a fallback option, Verde was pretty good.  They had solid frittatas that my boyfriend and I both ordered, and the coffee was tasty (also the free refills kept coming, yay!).  I got the arugula and cheese frittata, and he got the smoked salmon one.  The smoked salmon was clearly the winner, as it came stuffed full of smoked salmon, red onions, and capers, served with a generous dollop of creme fraiche atop a mound of arugula.  \n\nThe side of bacon that we ordered was not great, however.  For some reason, the slices were all cooked in a block, so we had to peel each piece apart in order to eat it.  Also, the slices were extremely thin and greasy.  Obviously I expect some grease, but this bacon was basically soggy with it.    \n\nI would come back for some more tasty eggs and brunch foods, and would love to try their AYCD option when I have nothing else to do on a Sunday.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-21", "description": "I came here with a friend on a Friday night. It's an okay italian restaurant. I had the penne alla vodka and my friend had their spaghetti. I enjoy my pasta soft, so the pasta dishes were a bit al dente for my taste; the sauce was good.\n\nTheir wine selection was decent. My friend had a chardonnay and I had a rosé. \n\nNice ambiance but their music was really random. I don't understand how you go R\u0026B to country. There are other better Italian restaurants.", "author": "Birdy L."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}