{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-17", "description": "It wasn't bad. I would recommend this place, affordable and have a lot more options for brunch than other places that I've been to.", "author": "Christelle L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "I brought my family here to have dinner to celebrate her birthday. And it was great experience. We had a reservation so we were seated immediately. The restaurant wasn't that busy for a Sunday afternoon. The waiters were extremely attentive and our orders came out pretty quickly. Some of the orders included the duck, the seafood platter, the pasta, the lasagna. Everyone thoroughly enjoyed their meal. I'm definitely coming back.", "author": "Tamira G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-23", "description": "Always good food and nice staff! Love this place! Best place on Smith Street. I have been going there for years and never disappointed. Lately. It is under management and can tell things much much better. This place is good for group, family, romantic dinner and cozy hang out. Definitely recommend.", "author": "Yulia Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-07", "description": "Love Verde on Smith. Came here with my girlfriend looking for a happy hour and found our new favorite spot. The bartender, Bilo was incredible. Drinks were cheap and he made sure we were happy the entire time. I got the salmon burger which was cooked to perfection and the calamari to share. Great atmosphere and super cozy. Pumped to have found a new great spot in Brooklyn to come with friends and hangout!", "author": "Katie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "Going out on a Friday night without a reservation and with a party of 5 is a dicey situation in NYC.\n\nLuckily, we stumbled upon this gem and they were able to accommodate us without a wait!\n\nWe started by sharing an order of the burrata with proscuitto. I always love burrata and this was definitely a very good burrata.\n\nWe also shared a house salad, which was simple, but refreshing.\n\nSomeone else at the table started with the asparagus soup, which they enjoyed, but noted was pretty salty.\n\nFrom there, we ordered a bunch of different entrees. The penne alla vodka was excellent. The osso buco off the specials was greatly enjoyed. The steak was delicious and cooked to perfection, however it was not... aesthetically pleasing. It arrived on a soupy looking pile of mashed potatoes. We got the ravioli off the specials, as well, and they were large and tasty. I ordered the crispy gnocchi with sausage and broccoli rabe. The broccoli rabe was the most delicious broccoli rabe I've ever had. The sausage was good too, and while almost everyone at the table love the gnocchi on my plate, it wasn't my favorite.\n\nFor dessert, we shared mixed berries with moscato and a warm cookie sundae. They were very good.", "author": "Katie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-15", "description": "We've been coming to Verde for a few years.  The new menu is great and reminds us of the old menu we cherished so much.  The staff is always so attentive especially during the endless brunch drinks.  Menu offers a lot of selection so there is something for everyone.", "author": "Danielle M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-06", "description": "Beyond the disappointments that I've come to expect from brunch in NYC, such as fake maple syrup, this establishment adds a few nice touches that drag your experience down even more. There was about a 20 minute wait to be seated on a Sunday around noon, which isn't intolerable (though not ideal). The man who seated us was courteous and personable, but this was the most positive part of my experience. Shortly after being seated, the waiter, Luis, asked us what drinks we'd like to order. I made the unfortunate mistake of ordering an orange juice. When I received my drink, I noticed it was a third ice. I know because I took the ice out, put it in my glass of water instead and watched the orange liquid disappear. I can best describe the orange juice as sugar water with food coloring. It was very off-putting. So when the waiter returned to take our food order, I asked if I could return the drink and get a hot chocolate instead. The waiter didn't give me an answer and instead asked what I wanted to eat. He left the table with our food order, leaving my fake orange juice with me. I moved it to the edge of the table to make clear that I did not want it. The food arrived a short while after that. While the waiter was at my table, I asked again about exchanging my drink for another - I got no response from the waiter and he quickly moved along to the next table, leaving me quite confused. Did he not hear me or was he intentionally and repeatedly ignoring my request? \n\nMy order of plain pancakes was surprisingly small for the price, at least compared to my experience ordering pancakes at other NYC restaurants. The pancakes were decent. I also had a side of bacon, which was a paper thin sheet of about 5 slices, all connected. It kind of felt like what you'd give to a child as part of a kid's meal. The waiter kept bringing mimosas to the other party members without even asking, which was a bit odd. And, finally, upon receiving the check, my \"orange juice\" was indeed on the receipt. I paid for an orange juice that I didn't drink and that I asked to return twice. I can say for sure that I won't be returning here.", "author": "Alex L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-09", "description": "Not sure why people give this place such a bad review. It's got good food and the prices aren't that crazy for the neighborhood. \n\nThe food is amazing in my option. I got the spaghetti carbonara \u0026 it was perfection in every sense of the term. Not too salty, eggy, saucy, etc. PLUS the pasta seemed freshly made. What's not to love?! I've also come here before and gotten the eggs benedict, which were also amazing. The food always comes out quickly and is fresh. If the weather is nice enough, I recommend sitting outside (it's a lot of space!).", "author": "Naomi Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-09", "description": "******BRUNCH REVIEW*********\n\n+++\n- for two hour unlimited mimosa\n- drinks kept on coming\n- more raspberry mimosa please\n  * raspberry beats mango which beats peach\n\n++\n- i enjoyed my steak and eggs\n- side salad is good complement to steak\n\n+\n- wife enjoyed poached eggs (she thought ham was kind of salty)\n- im a fan of fingerling potatoes", "author": "renje g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-24", "description": "One of the few places that still does bottomless brunch! No, you still have to wear pants. But you can spend $10 to get your choice of unlimited cocktails. Well, unlimited for 2 hours, but that's plenty. Mostly things like mimosas, bloodies and bellinis. Their bloody Mary mix is pretty meh, but their mango and peach bellinis are top notch.\n\nIn terms of food, I had a steak sandwich, which was delicious. Big chunks of chopped steak mixed with mushrooms and onions, with a side salad and exactly three rosemary potato wedges. A steal at $15!\n\nService was wonderful. Our waiter Hector made sure we never had empty glasses, and didn't need to wait for us to call him over!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "Came here for brunch on a whim because there wasn't a wait and we saw the bottomless drinks for $20 option (sold already).\n\nIt took a bit for a waiter to get to our table but once he took our drink order we were completely blown away by the service. He continuously made sure we had full drinks and brought us another as soon as ours were low. The bellinis were great and the Bloody Mary's were decent (secondhand note from someone in our group).\n\nThe food was absolutely wonderful. I had the Anaheim peppers and ricotta omelet with a salad and rosemary potatoes -- so good. The perfect amount of ricotta in the omelet and the potatoes had the perfect amount of seasoning. Other favorites were the french toast, and eggs benedict. \n\nThe atmosphere is good, prices are great (less than $35 for an entree and bottomless drinks? Where else can you do that?!) and the service is great as well. Plus, no need for reservations (as far as brunch goes). I'll definitely be back!", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-31", "description": "Here we are New Year's Eve.  At a great Italian place in Carol Gardens.  It's early and the owner has seated us.   The waiter comes right over and I ask what the favorite red is.  Of course Montepulciano!  Then we are served a delicious house salad.  \nThe entrees.  Braised shot ribs. The meat comes right off the bone!  I've ordered the pollo with portobello mushrooms mozzarella and peppers   With a brown gravy!  Unreal!   Absolutely amazing food!  \nWe toast to the New Year with a table of youngsters next to us!   This is a beautiful restaurant.  Great ambiance and food", "author": "Mike M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-29", "description": "I just left this restaurant and I have to say I loved it. I'm sad that I never came here prior. I have to say Anastasia my bartender was amazing wow so sweet, helpful. I loved all her drinks \u0026 recommendations also enjoyed her conversation. The place was so cozy and romantic. I think it was the manager also forgot his name was great. I can't wait to come back here. Please make sure to let the manager know that Anastasia is what every restaurant needs", "author": "Millie T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Verde is truly a great place with a stylish decoration, nice ambience, attentive service and very delicious food. We went there with friends for dinner and drinks. We really enjoyed our meals! We had mixed appetizer plate and Greek salad to start, then salmon, shrimp, bronzino and rib-eye steak dishes for main course. Everything was very tasty and fresh, especially my rib-eye steak was simply outstanding! The portions were also pretty decent and filling. Finally, we had desert plates and some cappuccino, and it was an amazing finish for our dinner. Their homemade deserts are really so good, particularly we loved their creme brulee. You should definitely give it a try! Besides the great food, the service was very nice and friendly, which made our dinner so pleasant at Verde. I've noticed that new management pays close attention to every single detail to make their customers satisfied in all manners. We appreciate your effort guys! Keep it up! Verde is strongly recommended to everyone!", "author": "Sercan D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-29", "description": "Mark is a great host and owner. The food was delicious. I enjoyed mouth watering French Toast with eggs and home fries. The atmosphere was cozy and friendly. I highly recommend Verde. It is top of the line.", "author": "Kimberly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "The staff is very friendly and professional. The food is perfect and the portions are big. The new managers added really good food to the menu to make it match everybody's taste. One of my favorite spots for the weekend and i am really glad that i found this place.", "author": "Hussien A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-19", "description": "I had brunch here to celebrate a friends birthday and the food/service was exceptional! I had the salmon and spinach entree.. it was so good I got a second order!! I also received my meal in less than 10 minutes which is a plus.\n\nLastly, I'm not a drinker but the people I was there with opted for the bottomless mimosas and they really enjoyed it. It was only $20 and you could try any drink on the menu. \n\nI'll definitely be returning here!", "author": "Moe D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "Food was deelissssh. I enjoyed the brunch the steak and eggs were amazing. I will return this will be my new brunch spot", "author": "Meryl P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-07", "description": "Amazing place for food and drink also we had nice time. Good service I recommended this restaurant for spend wonderful time with delicious food.", "author": "Maher A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-15", "description": "I ve been in this beautiful restaurant with my friends to celebrate his birthday,love it so much ,service is spectacular and food is so delicious,definitely the best place for dinner parties.", "author": "Miguel G."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}