{"aggregateRating": {"reviewCount": 428, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-04", "description": "Went here for dinner. We bought one of the \"cheaper\" bottles of wine on the list for $38. I foolishly googled the wine after the fact. It retails for SEVEN DOLLARS. I know wine markups are usually high, but that is straight up robbery. The food was fine and our waiter was nice and attentive, but it's hard to get past getting ripped off like that right off the bat. \n\nWe only went because we were given a gift certificate, so we'll definitely never go back. With so many other options in the neighborhood (Fragole's food is miles beyond Verde), I don't understand why anyone would go here.", "author": "Mike T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "Amazing food, drinks and atmosphere!! No wait time at all even though I did make a reservation. Will definitely be returning for Brunch again", "author": "Latasha H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "I came here in mid January for my birthday brunch. Management was so lovely and accommodating and allowed my friends to come early to decorate the table.The $20 bottomless drink option includes mimosas, bellinis, and straight champagne and the staff is very attentive to refill. The food is amazing, American with an Italian influence. \nUnlike most bottomless brunches where the vibe is raucous and young with tweens aiming to get wasted in an hour, Verde had a very sweet and calm vibe. The staff was lovely throughout our time there and I am eager to go back.", "author": "Isa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-11", "description": "We came here on a Saturday for my friend's birthday brunch before heading over to Royal Palm's for shuffle boarding. Naturally we all opted for unlimited brunch cocktails for two hours.   I thoroughly enjoyed my bloody marry's and enjoyed the prompt service even more. Before I was halfway through a drink the waiters were already asking if I was ready for my next bloody marry. At $17/person for drinks plus your entree at ~$13, it felt a little pricey for a Brooklyn neighborhood restaurant. \n\nFood was decent, good of used a touch of hot sauce or salt on the mushroom omelette.  Portion sizes felt like they were a little on the light side (everyone was given only 3 potato wedges).", "author": "Frank W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-09", "description": "I came here for dinner. Love the Spaghetti-don't know what kind of white sauce they used for the Spaghetti with shrimp and scallop, but it was very good. Complimentary bread and olive oil was greatly appreciated! ^^ Interior design was beautiful. Bet you're wondering why I only gave 3 stars. Well, that's because the server took a loooong time to get back me after I asked how much their house cheesecake would cost. I saw the server whispering for awhile with another behind the bar, and I just got the feeling something wasn't right. :O", "author": "Rita D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-17", "description": "The food is just OK. Every dish is overpriced and over salted. \nWhen they have the specials out by the door, do not be fooled. You can only have the 'specials' price, if you sit at the bar. \n\nIf my husband and I decided to choose your restaurant for the night, we sure are not sitting at the bar. That is absolutely ridiculous. I heard a lot of people refer to the specials and pricing, and they were told that you have to be seated at the bar. CRAZY! We sat all the way in the back, and our waiter was phenomenal. And I think even he felt uncomfortable telling us about the bar seating situation. The management has to rethink this, how is this acceptable?\n\nI would never come here again. There are SO many restaurants on that street, that I am sure we can find a restaurant that charged $19 for a pasta dish.", "author": "Nika V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-02", "description": "I returned here on a recent Sunday to indulge in the brunch. Luckily it was a beautiful day outside, so my friends and I were able to sit by the entrance and enjoy the view. The restaurant was loud though. About 8 women were there celebrating a birthday and face timing the occasion to someone. Anyway back to the important stuff. I ordered the delectable French toast with a side of sausage. It was soooooo darn good! The bread was fluffy and crisp with a hint of sweetness and beauty. I cannot wait to return for more. I also had a peach Bellini that was alright, it looked better than it tasted honestly, but I'm not much of a drinker. I will definitely return for brunch. I'm not sure if the dinner menu has changed since I last came, but I am open to trying it again. As far as service, it was great. The waiter and other staff were very helpful and kind. But we had to return a number of dishwater because it was either dirty or broken. A definite no-no but all is forgiven as the staff was very good at addressing the issues promptly. All-in-all I will be back.", "author": "Monique M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-12", "description": "The Owner Of This Restaurant Is A Racist!!!\n\nOn several occasions my husband and I have been seated at the very back of this restaurant the table right next to the kitchen. On our most recent visit I told my my husband to inform the owner that we didn't want that same seat next to kitchen unto which he told him its either there or outside. More than that he walked away from us and disregarded us and then spat out I'm sorry. I really enjoyed the food that I'd recommend but I will never patronize Verde again.", "author": "Shamari H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "Smith Street use to have a wide variety of unlimited brunches available. Now that it is starting to dwindle,  you can still rely on Verde. The first time I had ever been here was a three star affair. I sat inside toward the back of the room. While the food was very good, the service was somewhat lacking for drinks. I have found that if i plan to come to boozy brunch, I simply cannot rely on the single woman who appears to be the only server for the entire floor.  I have since rectified this by going straight to the source. I prefer to come to Verde in a pair. With only two people, you can easily sit at the counter. I strongly suggest this. The bartender is amazing. She is prompt and courteous with drinks and food. She is willing to have little conversations about what you may want to try or sample for drinks. I am a big fan of the raspberry bellini. Less acidic than mimosas and they are a dreammmmm. She is also willing to mix little concoctions like raspberry/mango if you're lucky.\n\nNow the food is reliably good (at least for Brunch). I normally get steak and eggs or the burger. I recently tried the steak sandwich and really enjoyed it. I love their roasted potatoes but alas, you generally receive only three of the delicious spears so if you'd like more, order a side to split (as we normally do.....we are fatties... I mean foodies). The portions for the main entree are fairly large, usually with a side salad. \n\nWhile I very much enjoy the backyard, the service will be slower as I said earlier. If you are just coming in for a lazy brunch with relaxed friends and you DON'T care about getting day hammered, then you will like it. They have large umbrellas, many tables and usually, I am able to sit in the shade (although my table mates usually must sit in the sun for this to happen).  In the summer, there will be a wait for tables in the back. I usually arrive later in the afternoon and I get my preferred bar seating with no issues. While opting for the bar, I think you will find that Verde is a 4-star joint. If you are looking for Sunday brunch with the family, you may believe that table service is perfectly acceptable. Either way, with Smith street's unlimited dropping off this plane of existence, Verde is a completely reliable place to go.", "author": "Erin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Perfect Brunch Spot! Great food, great ambiance with a beautiful garden! Perfect for friends, and couples!", "author": "Jury R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Went yesterday, for the first time. Food was delicious,  wish I had saved some leftovers for today lol. Definitely will be back!", "author": "Vanesia E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-28", "description": "Verde on Smith St\nWhy did I wait 4 years to go there? Had probably the best lobster Fra Diablo ever. 1/2 lobster plus 5 maybe 6 shrimp and calamari for over fettuccini for $28. They took the time to do it right with a real seafood tomato sauce. And the seafood was perfectly cooked. My wife had a wonderful seafood salad and an amazing lobster bisque. wow! I really had to control myself and not lick the plate clean. LOL My wife even picked over the lobster carcass....\n\nOk so based on reading another recent review where the wine prices were objected to I decided that I would check out how much they charge for a bottles vs retail and I have to say I was surprised. On a recent dinner I ordered a bottle of Maraia barbera Del Monferrat0 2014 the retail price was around $10 to $13 they charged $46. The food and service was wonderful but still.... you lose points on the wine.", "author": "Erelichada S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "I went here for brunch and I can say without hesitation that it was one of the best brunches I have ever had.\n\nIf your looking for drinks, they have a brunch deal. $16 for unlimited drinks (2 hour max).\n\nThey have amazing burgers, stake and salmon. \n\nIf you haven't been here, its a must!", "author": "Christopher R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-26", "description": "The atmosphere is intimate and warm. The bread and oil to start was delicious. I had the crispy gnocchi with sausage and broccoli rabe which I could not stop eating it was beautiful and delicious. Great service and paired with a wine that perfectly complimented my dinner {and mood}. Wonderful place for a quiet evening with friends or loved one.", "author": "Debra P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-02", "description": "Overall experience was Good. The staff was friendly,helpful and hospitable. The food selections were tough but my choice of the ceasar salad and shrimp cocktail were very good. My friends chose the rigatoni and enjoyed it as well. \n\nAlthough a bit pricey having the dining certificate helped because it offset the total cost of the meal. I might consider coming back for restaurant month.", "author": "Rudolph G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-05", "description": "I went to Verde last night with my friend Will, and it was quite tasty! We started out our dinner with appetizers--I ordered the mussels, and Will had the Beef Carpaccio. Both were really good--especially the butter/wine broth that came with the mussels! Very tasty! As expected, they served the mussels with some crusty bread for soaking up the broth, and I just couldn't stop indulging! I'm gonna have to run 5 miles today just to make up for it !!\n\nAs for our entrées, we both ordered from their nightly specials instead of the regular dinner menu. I had a baked bass fish (the fish was served whole), and it was tasty. What really made the meal was the skin of this fish, which was perfectly crisped and seasoned just right with garlic, lemon, and other spices. My friend Will had the lobster ravioli, which, luckily, he let me taste a bit of. It was delicious, too.\n\nBoth of us ordered wine with our meals. Will had a sparkling wine, and I had one glass of Cabernet Sauvignon followed by a glass of Chianti. To me, their wine portions were are a bit small. That was slightly disappointing, but the prices weren't crazy, so I guess that made up for it a little.\n\nAs for atmosphere and service, both were fine except that it was a bit hot in the restaurant (it's almost like their air wasn't working or something). This was a bit frustrating at first, but I downed a couple of glasses of water, which made things a little better.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "I came here for a late lunch and the service provided by Ms. Elizabeth was excellent. Great atmosphere and food as well. I'll be back for sure.", "author": "Austin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "I celebrated my sister's birthday at this place and it was wonderful! The food was delicious and the drinks kept flowing. We sat out outside on a beautiful Saturday.  The server Elizabeth was so sweet! It was a perfect day. Thank you Verde on Smith for making my sister's birthday extra special!", "author": "Elizabeth G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-14", "description": "Best brunch spot in Brooklyn hands down great service good food and great area $20 boozy brunch definitely worth it unlimited drinks for 2 hours", "author": "Solomon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "I came to this place many many times and was never disappointed by the food or drinks! I like trying different dishes. And my every experience meets my happy face! \nStaff is very professional and friendly : tells you daily specials each time and always makes you feel welcomed. \nDefinitely, Verde on Smith is the place I would always come back to.", "author": "Evgenia S."}], "servesCuisine": "Italian", "priceRange": "$11-30", "name": "Verde On Smith", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "216 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/TK5p0aQYSkyeMR0lX_LUzQ/ls.jpg", "@type": "Restaurant", "telephone": "+13472058589"}