{"aggregateRating": {"reviewCount": 221, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-14", "description": "Very good bfast with reasonable prices...tour bus layover area across the street at Cadman Plaza", "author": "Stephen J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-15", "description": "I've passed this place a ton of times, and finally went in recently while wandering around the area looking for grub after 11pm. \n\nIt provides every element of a diner; the decor is dinerish, the booths are dinerish, the menu is thick and 10 glossy laminated pages long, and the waitstaff wear vests. \n\nNo pickles though, when we sat down. Where are the pickles, man? \n\nIt took a while to order, get our food, and get our check, so I wouldn't recommend this place late in the evening if you're looking for a quick meal. Other than that, it's your typical diner. I'm glad to know that I can get grub late at night in this area.\n\n I'd add it to the rolodex of munchable options.", "author": "Mickey M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-04", "description": "Wow..... before I get started.. I've attended Saint Francis College.. which is a few blocks from the location of this diner... I trained for cross country across the street from the diner at Cadman Plaza. Now... I only saw old people going in and out of this diner over the years.. I took it for a joke!... \n\nWell.. this weekend after spending time with this gorgeous female... we decided to stop in.. my appetite was on level 10!! It was about 3:30am... and the diner was open!! I was shocked! it was pretty packed.. not crowded but it had a nice crowd , considering it was 3:30 in the morning. \n\nI wanted to give this diner 5 stars... I seriously did... but the staff in this place is out of control! They were screaming at each other, cursing....... just not carrying themselves in a professional manner,  #madness #disturbing.\n\nMy judgment about the food..... GREAT!!! I ordered the fried chicken with two sides.. I just got 2 sides of mac \u0026 cheese. The chicken was... ehhhh..typical Fried Chicken, but that Mac \u0026 Cheese!!!!!!!!! Yeeeeeaaaahhhhh Budddddyyy!!!!!!   I'm talking not watery.. the cheese to roni proportions was on point! Meng... That cheese was rich! They didn't boil the roni too long or too short it was prepared just right.\n\nFor dessert............. I tried the Baklava..... Man... Oh......Man!!!! Mama told me there would be days like this!!! When I first tasted it in the diner.. it was room temp.. kinda cold.. nothing impressive I said let me take it home instead of discarding it. So when I got home.. I decided to heat up the rest...... Baby... Baby.....Baby!!!!! CHECKMATE!!!!!!!! ROGER THAT!!!!!!!! SELECTA BRING THAT BACK!!!!!!!!!!!", "author": "Dre D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-13", "description": "I come to this diner often and have not been happy with the quality of food lately.  My first time here someone at my table ordered a buffalo chicken wrap and had to send it back because they used bad lettuce in the wrap.  This is not the first time that we have received bad lettuce in wraps from here i guess they think we won't notice.  Last time we went my friend ordered a salad to go only to realize when we got home that the lettuce on the bottom was bad and completely inedible.  Many of my friends have gotten food poisoning from eating at this restaurant.  Typical diner food that you can get elsewhere without getting sick.", "author": "Jenna B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-21", "description": "This place has a great happy hour with the $3 coors and 50cent wings...but the service was absolutely horrible I did go twice and the first time was good when I had the girl waitress but the male waiter that was there the second time was horrible I don't even want to waste my time describing just pray you get the girl smh I'm definitely not rushing to this place", "author": "Teddy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-14", "description": "My husband and I visit this place for the first time for dinner and it was a very nice experience. The waiter was ready for us and always check on us to make sure everything with us were ok! The food was delicious and we got served promptly! overall I will go again with my husband!", "author": "Lola L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-03", "description": "When I was eight, I almost convinced my parents to go on the Diner Tour of America, where for all three meals, you eat one single item on the diner's menu and at the end of the tour, you would have eaten almost everything that a diner could possibly feature. My dad was totally up for it, but my more sensible mom nixed the whole idea, but I've just never gotten my love affair for diners - there is literally something for everyone, and so unless the food is exceptionally greasy or the service is plain obnoxious, I can't say anything too awful. \n\nI was kind of struck by the strip of advertisements running along the length of this particular diner underneath its sign. From far away, the place looks more like an auto shop broadcasting hourly parking rates than a restaurant, but once you're inside, the first thing you see is a humongous glass case of cookies and pastries. It's not very well-lit inside during the daytime, so make sure to pick a seat by the window for some people-watching with your meal. Menu has everything from breakfast options (waffles, omelettes, pancakes), Greek dishes (gyros and skewers), some Mexican tossed in, burgers, dinner entrees, steaks, ribs, pretty much everything one could be in the mood for. I ordered the grilled chicken fajitas, which came with bean mash, rice, a tiny cup of guacamole, two soft flour tortillas, and lettuce and tomatoes. I think I ate until I was bursting at the seams, and I still barely made a dent on my plate. Everyone in my group finished everything on their plate, which sort of speaks to the general tastiness of the food. \n\nPlace is heavily frequented by lawyers and jurors from the courthouse across the park. Service was on the nicer end of the spectrum: one waiter dropped off a bag and take-out carton for my leftovers, and then another waiter came by, scolded the first waiter, and wrapped everything up for me. I would not object (get it?? 'Cause it's so close to the courthouse? Never mind) if someone suggested this place for lunch again.", "author": "Joy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-26", "description": "Of all the places I've eaten, I give 5 stars to a diner? Damn straight I do!!! \n\nFirst off, the place is huge! It also has big booths so I have room for all the camera equipment and still have legroom. Second, I don't  think I have ever waited for a table in this diner. Third, the waiters are attentive, I've never heard of an order that was incorrect and I am never left waiting for anything I ask. Fourth, the food is damn good. I've had burgers, salads, sandwiches, turkey dinners, chicken cordon bleu, dessert, EVERYTHING!!! It has always been damn good. Twice the portions of manhattan at half the price! And fifth, this place is clean. Tables, floors, bathrooms, health department rating...All Clean!\n\nFive reasons to give it five stars!!! BAM!!", "author": "Al E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-23", "description": "I frequently order delivery from here. They are very quick. I have have tried several entrees and a couple different dinner salads. All were quite good, better than diner quality standards. Haven't had any of their breakfast foods or pastries, but plan to try soon. Menu is huge, but I don't feel that negatively impacts the food quality from what I've experienced so far.", "author": "Matthew H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-19", "description": "I wanna know what I have done to deserve what you did to me 2 nights ago.\n\nAfter a long day of work and finally being able to eat, i chose to go on seamlessweb and order from you guys. I have been ordering from you for the past 4 months or so. \n\nMy fav thing on the menu is the cheese burger.. it's juicy and the cheese is always perfectly melted perfectly on it. I also get the caramel shake and onions rings so I can regret my meal and feel fat the next day. BUT, this time.... oh this time... you messed up my friends... why the hell did you change the burgers you use to have?\n\nI received my order and to my horror the cheese was not melted... the burger was so damn dry I had to take a sip of the thick shake with every bite I had. It was a sad moment in my life... and to top it off, the shake was thicker than usual and much much much sweeter....a really sad moment.. because I use to order from you all the time on my late nights and now I am afraid I will find another diner to replace you...\n\nWhy did you do this to me? Are you under new management or something?!?!!?!?", "author": "Sera A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "My go to local diner.\nToo big to be called comfy, but you never have to wait to be seated and delivery is fairly fast.\nThe menu is a little too extensive for everything on it to be great so use your common sense when ordering.  The diner staples - pancakes, omelettes, burgers and fries are great.  I also love their soups, sandwiches and salads.\nCan you tell that I eat here too often?", "author": "Pat G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-11", "description": "Celebrated Mothers Day here and I have to say it was not packed. The service was great. We ordered the appetizer that was mixed with different  itemsand onion rings, Ruben Cornbeef sandwich with a side of fries, shrimp linguine, my mom was not pleased with the meat loaf and mash potatoes so she got a cheeseburger instead and that she liked. They also have a kids menu. And they have a BAR!!. Recommended drink. LONG ISLAND ICE TEA!!. ENJOY", "author": "Adalhia T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-28", "description": "This is the only place that opens 24 hours in Brooklyn Heights.  We came here and had what every late nighter wanted: milk shake, burger, omelet, and fries.  All were ok, but I know I will come back again because....well, like I said, this is the only place that opens 24 hours around here...", "author": "Juan J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-29", "description": "This was our go-to diner when in college living in Brooklyn Heights. Typical diner food plus they deliver. Open 24 hours and the prices are reasonable.", "author": "Kris P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-11", "description": "Wow I don't know what to say. I ordered food once and the burger was okay but a little dry. I think it is a little pricey considering its food is not that spectacular. I tried to order late night food today but the man on the phone was absolutely horrible. I understand if you are closing early but you need to be patient with your customer. Not yelling in the phone \"we are closed cooks are gone blablabla\" and before I even said anything he just hung up on me. I just expect more patience with the customer at least.", "author": "Steven S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-15", "description": "I work at courthouse and have eaten here once in a while.  Food is nothing special, just run of the mill diner food and run of the mill service.  Proximiry was greatest attraction.\n\nWalked in after work one day and asked to use restroom before my long drive home. Not only didn't he recognize me from previous visits, he said I have to purchase at least a bottle water for the privilege. \n\nA terrible business practice in my opinion, and rude to current and potential customers.  Me \u0026 my co-workers will now walk the extra block and a half to the other diner.  \n\nThe US attorneys call this place \"the defense attorney diner\" anyway.", "author": "Greg S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-04", "description": "Huge\nBreakfast\nSelection\nPerfect cure for\nLong nights. Nothing fancy and that's alright.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-30", "description": "If you are coming off the Brooklyn bridge and are looking for a meal, this is the place for you. \n\nFirst rate Greek salad, if you add the grill chicken you won't be disappointed.  There isn't any better hummus and purée eggplant with with pita this side of Astoria!", "author": "Matt C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-07", "description": "I have a warm spot in my heart for Park Plaza Restaurant. It's the diner that I would sit in looking filthy and teary eyed for dinner after a long day of work and visiting my late granddad down the way at LICH before he passed away. I would eat here because I was too sad and exhausted to cook and the staff here never judged me. They would  just lead me to me to my table for one and ask NO questions while I cried and binged on fish and chips and key lime pie. Really exceptional diner fare. My faves are the grilled shrimp wraps, fish and chips, shakes and key lime pie. Food here is always delicious and fresh and you never feel rushed. The owners of this establishment are very kind, they never forget your face and treat you like family. Park Plaza recently opened a really cool looking Sports Bar area inside. The Sports Bar menu is shorter than the restaurant's main menu but everything on it is a treat. Stop in for fish and chips and cheap drinks at happy hour.", "author": "Tanya R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-08", "description": "They use compressed turkey product.  Not real turkey like most diners. What are they thinking? That you can't tell the difference.  GET REAL TURKEY PARK PLAZA!", "author": "Gloria K."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Park Plaza Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "220 Cadman Plz W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/0zjK4v3ipM49Qj9I1DlfNw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965900"}