{"aggregateRating": {"reviewCount": 221, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-28", "description": "I used to work across the street from this diner. They renovated it a couple of years ago. Not only does the restaurant look better, the food tastes better too. I was there for a farewell party for a former colleague.  I had the burger deluxe and some buffalo wings. The burger had good flavor and the fries were crispy and seasoned. The wings were meaty and it had a good kick. The service was also good. The staff was nice and friendly.", "author": "Erika Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-09", "description": "I enjoyed this establishment. Friendly staff, everything's pretty much immaculate, the food was great and comes out pretty fast. The only downside is that its kind of expensive. I had breakfast with my mom and it came out to like $40. Other than that its a great diner.", "author": "Gherell O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-10", "description": "Great for 24 hour delivery in the BK Heights neighborhood.  Always fast\n\nAlso, really good hangover food for Saturday and Sunduy mornings.  My favorite meal has to be the buffalo chicken sandwich.  \n\nAnd it's cheap!", "author": "Chris D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-26", "description": "It's fair. Oddly, it seems as if a lot of people from outside of BH drive here to eat! Dont really get it.  Very mediocre.", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-11", "description": "I went here with my family recently because the reviews looked pretty good for the most part.  I have to say this was the worst diner food I have ever had in my entire life.  For lunch we ordered an appetizer with onion rings, chicken tenders, and mozzarella sticks.  That was average.  We also had bread with the dinner which I found to be completely stale.  I had the salmon dinner and my husband had the steak.  With it we ordered veggies and a baked potato.  It was absolutely horrible.  I was VERY disappointed by this experience.  Not only was the food TERRIBLE but the wait staff was not too great either.  The only things that are good about this diner is the location and the decor of the diner.  I gave this place one star because I am unable to give it zero.  I tried to go on the site to contact the manager, but I was unable to find contact information.", "author": "Dashima C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-18", "description": "Bummer - 2nd time getting take out from Park Plaza, the first was really good. Not perfect because they put tons of shaved carrots on the Old Fulton salad which is not listed as an ingredient and I don't eat carrots due to low carb diet - when they are shaved they are really hard to eat around or remove and the chicken was dry. But it was good sized as a meal ($15)  salad should be and the ingredients were fresh.\n\nThis time I ordered another meal salad ($11 because it didn't have chicken), the Greek Salad.  The ONLY thing decent about this salad was the amount of feta was acceptable.  Everything else was awful.  I had to remove the cucumbers because they were so rotten they were clear and rubbery and smelled bad (no they weren't pickled!). There were 4 small olives in the entire salad, 3 cherry tomatoes. The lettuce was old, wilted and brown. I had to cut out about half of the pepper slices and remove them because they had brown soft spots. The serving was was miniature - you could see the bottom of the tin container because the portion was so small.  \nSure not worth the $11.", "author": "Person Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "Amazing food. Pancakes, eggs, cake, burgers, fish, chicken. Anything you want the have it!", "author": "Coby S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-03", "description": "Love this restaurant.  I go here everytime I go to New York.  Every meal I've had is hot and very tasty.  They have baked goods you will love and want to take home with you.", "author": "Talitha H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-05", "description": "Met w my cash flow game group we were 8 service excellent food fresh n hot prices reasonable everything clean n the manager n boss came over to ask if we needed anything.", "author": "Rosa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-03", "description": "Comfortable diner, friendly staff, good food.  Love being able to get breakfast which is always hot and fresh  anytime of the day.   Been a customer for years and hopefully for years to come.", "author": "jane n."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-06", "description": "This has been my go to spot for over 10 years for breakfast. This is simply my  review on their breakfast food. Where else can you get an omelet any way with a drink for less than $10 dollars. I always love their homefries, ham and scrambled eggs. This will continue to b my weekend breakfast diner.", "author": "Ebony J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-19", "description": "This is a reliable spot. Especially on summer nights when you can't sleep and take a walk around the park... it's 24 hours and the waiters a friendly. The food isn't anything to rave about, standard fare, but it's edible. Had the mac and cheese and it tastes like the kind out of the box. I wouldn't order something that doesn't seem like a diner specialty because it's probably a bullshit item you know? The desserts are cheap and ok. Like I said, it's nothing to rave about, but it's reliable and friendly.\n\n// 3 stars to 1 star review change\n\nSO... I revisited this place a couple times since I made this review... and tonight was their last change, honestly. They have two diners, one that's expensive, one that's not. When you go in, they ask you to sit in the expensive one, without even mentioning the one RIGHT BEHIND THEM, the cheap one...  I went to the expensive one once, had a great meal, went back to have it again, it took 1 hour for me to get the food, and when i did, it was cold, and the butter, so. much. butter. was basically 1/2 the dish... it was practically turning back into a solid, I swear. I ordered something and they brought me something else, I sent it back and they took it off the charge, however, I also wanted to cancel the other food I had ordered, which were chicken fingers, for $8, and yes, it was from the frozen ones you can get at Target, I've had those, they were the same, they said I couldn't cancel my order, the food was already made, literally 3 minutes after I mad the order, the food being the store bought chicken tenders. I also ordered a can of soda, that was $2.75. NOPE. \n\nSo, basically, the only way I say to you visit this place, is when you're walking around, it's super late, literally no where else is open, the devil on your left shoulder won, and you're not that hungry anyway... order a cheap dessert and an expensive ass glass of soda (Tell them bring the can) and try not to order anything else they actually pretend to make. Seriously, the chef at this place is the microwave and the fryer, that's it.", "author": "Mel B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-27", "description": "*Delivery*\n\nI'm going with 3 stars for now because everything we ordered was good except my Fish Tacos. Delivery was quick and the food was hot. Came with lots of great condiments and sauces and of the four of us, I clearly ordered the wrong item on the menu. \n\nThe fish taco was more like a slimy, mushy fish-paste wrap with zero flavor that I absolutely could not eat. In fact, I will not be eating fish for a while do to the memory of taste. I tried to burn it down with Sriracha but to no avail.\n\nThe Curly Fries  and regular Fries were very good, the Mozzarella Sticks were great, the Fried Shrimp, (real) Mashed Potatoes and Broccoli were delish. I'm told the Seafood Combo and Burgers were also very tasty.\n\nOverall, we'll try them again, just felt compelled to warn people to stay away from the Fish Tac-NOs.", "author": "Brittan B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-12-04", "description": "'Meh' is definitely the first word that comes to mind. While staying at a hotel in Brooklyn I ordered here because the ratings were decent and they delivered to my hotel. I clearly should've stuck with room service. The guy taking my order was clearly not familiar with the term 'customer service' he was rude, abrasive and seemed to be under the impression that he was doing me a favor by taking my order. \n\nThe food arrived (thanks to a nice enough delivery guy). I ordered buffalo wings, fries and sauteed spinach. The buffalo wings and fries were all in one container with nothing to separate them and it all ended up a bit mushy with buffalo sauce on the fries. The spinach was oily and lacking flavor. There's so many good spots in Brooklyn, no need to bother with this one!", "author": "Jamila F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-01", "description": "Ordered from this place twice.  First time got a Reuben. It was pretty mediocre and not worth getting again.  The second time I ordered buffalo tenders, and they were terrible.  The chicken tasted frozen (I'm fairly certain they were) and the buffalo sauce wasn't spicy or tasty.  I won't bother ordering from here again, but you can definitely do worse (I'm looking at you, Panda Delight).\n\nSeriously, don't order from Panda Delight.", "author": "Brandon D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-10", "description": "My family and I have been coming here since I was a child. Hot chocolate and whip cream with french toast and sausage has never steered me wrong. The owners and staff are great and the food comes out quickly. I've never tried anything other than breakfast food here so I can't really judge on that level but don't most people go to diners for breakfast anyway? Can't say I've ever had anything but a positive experience here.", "author": "Kristian S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-18", "description": "Great food and service. I got the bodybuilder breakfast with the egg yolks. Since I'm on a low carb diet I didn't want the home fries. They kept try to accommodate me with other food such as toast, fruit salad, and oatmeal. I then explained I didn't eat carbohydrates. The waiter apologize for bugging me--which he wasn't. Food was great. Eggs were made in butter which didn't bother me, but if you have a phobia of fat because of what was taught in the 80s and 90s then you may want to ask about other options. The turkey sausage was a little greasy for me tho. Put the 4th one in a napkin to soak up the grease and it was much better.", "author": "Joe B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-16", "description": "From the perspective of this diner compared to other diners, this is the place, Park Plaza Restaurant gets it right. I think that some of the negative reviews here are from reviewers who are comparing this diner to other types of restaurants which is an inaccurate analysis. \n\nThe food here is really good, as are the prices, the staff, and the decorum. The only reason I have not given this place 5 stars yet is because I have not had everything on the menu, only the most popular dishes. \n\nIf you are in the area and are looking for a great diner to satiate your need for diner food, then look no further.", "author": "Harry B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-16", "description": "My experience at this diner was fine. Realistically though, this place is more about frozen food management than about serving anything of any quality. I would love for anyone to prove otherwise. That being said, they serve the exact same food that every bottom level diner in this country serve. I guess it is a small step up from eating on an airplane.\n\nOutside of having some playful , childhood association to the food which makes the experiance memorable, the decor is truly the only thing worth even mentioning as even slightly interesting. How anyone has given this lowest common denominator of a diner anything more than 2 stars just highlights how ineffeciant the Yelp rating system really is.", "author": "Bubbles McTroubles S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-08", "description": "They have the normal American Breakfast but more choices... I got a french toast tops with almonds.. The bread they used are kinda different even though is just a regular french toast.. It feels like they dip the bread into the egg.. :) most of the restaurant just toast it and you can only taste the egg at the outer layer of the bread.. \n\nI guess the highlight is not my french toast but my friends special 3 eggs omelets.. The omelets are simply just hot, simple but awesome.. I don't remember what my friends ordered but it seems to fill them up with satisfaction.. If I am not mistaken.. they each ordered \"the big mess\" and \"italian omelete\" I took a few bites of their portion.. The omelets they serve are really different than other restaurants.. The portion of the meat and vegetable they cook it with the eggs are just nice.. not too many meat/vegetables.. just well blend..\n\nMy girl friend ordered something else.. with pita bread and a few spreads.. It tasted a little weird for me.. kinda funky.. maybe I am not used to the taste.. But my girl friend love it!! maybe is just my personal preference.. \n\nI love this place... but there is something that made me not giving a 5 stars.. I guess it's because the french toast did not really surprise me!!! other than that.. I will totally return here for brunch again!! :)", "author": "Shing Yiing O."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Park Plaza Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "220 Cadman Plz W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/0zjK4v3ipM49Qj9I1DlfNw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965900"}