{"aggregateRating": {"reviewCount": 221, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-18", "description": "Always sat on the Diner side of Park Plaza restaurant but decided to sit in the bar section today. \n\nIt's lunch time so there's a nice office-worker type crowd and vibe. \n\nAs usual this place from front to toilet is clean. The staff always friendly and accommodating. \n\nI got a dinner meal of ribs, mash and corn which came with cole slaw, soup and crackers all very yummy. Truth is,  I suggested we come to this place because of their ribs. I love it! My friend got an omelette, fruit and pancakes which too tasted great. Yep, at lunch we got breakfast and dinner meals cause we're bad like that!\n\nFinishing review \n\nWhenever I'm hungry or not in the mood to try something new, this spot is now one of my GO TO SPOTS. \n\nLeft satisfied plus my doggie bag  ensured I had dinner (large portions)\n\nThe End.", "author": "Freeyah-Knycky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-23", "description": "I returned to where I started in NYC visiting my old dorm at the Hotel St George. \n16 years ago I moved to NYC and Park Plaza Diner was open 24 hours. This was great for me and my dorm friends who became lifelong friends, we were all new to the city and would go out to explore and excessively drink. When our taxi cab brought us back to the George at god knows what time, we would find ourselves at Park Plaza Diner.\n\nReturning to both the food and memories I was pleasantly surprised at how much this diner has grown.\nThere are two sections, and the manager thinking I was classy and fancy automatically took me to the dinner section which had families and successful adults. While looking around for the sports bar tv screens he asked \"are you looking for something?\" And I said \"the sports bar\" and he said \"it's on the other side right this way.\"\nThere is now a sports bar with the most fabulous bartender I have met in a long time, Lee, who is professional, fast, and has really good energy. Multiple screens for viewing, happy hour specials, high tables for a bit of privacy, and a few booths for groups of 6. \nI really enjoyed my Sunday dinner. Not only was it delicious with good company from Lee I found myself taken back to first moving here. \nI'm glad to see one of the first diners I experienced in NYC growing with such a positive, efficient staff.\nKeep it going Park Plaza! Hope to write your second review 16 years from now!", "author": "Chanelle F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-17", "description": "Nice diner just as what you would expect. Good variety and fast service. Greek owned and very friendly. Breakfast is the best here and we often go a couple times a month", "author": "Jessi B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-23", "description": "Ordered Souvlaki, pork wasn't marinated or grilled, I think they just fried a pork chop and cut it into cubes.  Very bland", "author": "Richard S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-16", "description": "It was Easter, so it was pretty busy. We had to sit at a high top in the sports bar area and those seats aren't made for people with wide hips. The food was ok. The matzo ball soup was good. The mac n cheese was delicious. Fries are fries. Burger was good and the veggies over cooked. The fried chicken skin was burnt that it couldn't be eaten without breaking a tooth. The actual chicken was moist and delicious. But I would've ordered grilled chicken if I just wanted chicken.", "author": "Derrick M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-25", "description": "I'm willing to momentarily disregard the fact that they were 20 min late.  What I'm not going to disregard is my temporary lapse in judgement when I decided to order from this horrible diner again.  This picture is apparently their Honey Crusted Chicken Sandwich.  It actually turned out to be a giant soggy POS on a hard roll.  It's actually scientifically impressive how they were able to burn the outside so badly with still having the inside completely undercooked.  My wife got macaroni and cheese which may or may not have had some sort of smoked meat in certain bites (it's not supposed to).\n\nDo yourself a favor and just stay away.  Thank me later.", "author": "Noah R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-27", "description": "Tyler is the mannnn! \nWe're from Boston, visiting for a bit and decided to walk in before heading back. \nGreat customer service, polite, and helpful. \nDefinitely coming back!", "author": "Marc-Albert B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-01", "description": "Came here with my sponsor/friend after getting my admission to the federal bar in the nearby Eastern District.  I think it's the go to spot for people who just got done with things in federal court or the 2nd Department (a court officer recommended it to us).  I had the french toast special though we found it weird they didn't bring us butter or syrup for the toast (which we both got).  Nice little diner that seems to have some selection and ample food at a decent price along with sorely needed air conditioning in the summer months.  If I were in the area and needed to eat, I'd come back.", "author": "Monica T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-11", "description": "Good if you're in the area and looking for a quick bite! I usually get take out but I dined there once and it's a diner sense of service. You get what you come for and nothing more. Definitely good diner food though!", "author": "Kristen S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-30", "description": "Before walking across the Brooklyn Bridge, we stopped in for a quick visit. The management was very accomodating and friendly. The restaurant was very clean. The selection was impressive. I highly recommend Park Plaza.", "author": "Jeff H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-17", "description": "the waitress Sophia was weird, she didn't want to take the order i wanted. The food is okay, but service could be better", "author": "Xavier P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "great service, great atmosphere and great food! one of my favorite places to eat in brooklyn heights.", "author": "Caroline N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-31", "description": "Used to be good BUT not anymore...\n\nOrdered a Buffal Crisp Sandwich. Apparently this is just two gross pieces of chicken on a roll (no tomato, no lettuce, no dressing). I called to see if my order could be fixed as it was not delivered as it should have been (with all the fixings that were mysteriously missing) and was told \"we do not deliver lettuce and tomatoes and we will not make you a new order.\"\n\nThis is ridiculous, how do two dry out chicken strips on a roll constitute a sandwich?  This was not what I ordered. Ended up having to go through Seamless to get a refund, and will never order from this place again. \n\nHORRIABLE SERVICES AND FOOD", "author": "Joe S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-22", "description": "What a beautiful Trainwreck. If you come to New York don't go see CATS on Broadway or Jersey Boys, come spend an afternoon in this restaurant. Get a cup of coffee and enjoy the show. If this place had its own TV series it would be called \"Cafe Hate.\" These employees are a mix of all of the bad kids from \"Newsies\" and \"Annie\" all working together. They really have an enjoyable hate for each other. \n\nAs I got seated, there were already two of the servers congregated by the bar arguing with each other. It wasn't one of those weird quiet whisper fights, they were going at it like a married couple of 32 years. There was swearing, accusations, snide remarks, like I was watching a daytime soap opera. I loved it. When you thought the fight was done, more employees would meet at this love spot and argue with each other. I really enjoyed that part. Now on with the food:\n\nI ordered the bake chicken lunch with mash potatoes and broccoli. I also ordered a chicken and rice soup. My server was a good man but brought me, what I think was an order of some split pea soup. I explained the mix up and he was good about it. The mash potatoes were \"aiiight\" and broccoli was probably just cut from its stock and placed on my plate. It was not put in any boiling hot water or seasoned at all. The chicken was ok. I didn't hate it but I would not call it back for a second date. That was the extent of my meal.\n\nMoving on to the poor old lady sitting next me. She ordered the roast beef lunch special. Randy Macho Man Savage should've delivered the food himself and yelled \"Need a little excitement? Snap into a Slim Jim!!!!\" That ladies roast beef came out looking like a mix between tree bark and those dog chew rhines you give your pit bull. She kindly explained to the waitress her issue with the Toast Beef and how it was overcooked and dry. Instead of the waitress bringing the order back, she storms in the kitchen like a young Tazmanian Devil and starts yelling at one of the line cooks. The waitress brings out a bowl of Au Jus to help with the roast beef. That's like installing a sprinkler system in the Sahara desert, it will have no effect. \n\nThat's all I got. Go to this joint and just get a coffee.", "author": "Ernie M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-23", "description": "I wanted a super healthy breakfast one morning at work and ordered the \"Six Egg whites Scrambled with 6 Turkey Sausage Patties\". The Yelp system was a disaster that morning and their phone system was down at the restaurant. It took a really long time to show up. Ultimately the food was delicious - just wish the delivery hiccup didn't happen.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-30", "description": "Decent place for a burger. Been coming here for years now. I don't know what else to say, it's a diner!", "author": "J D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-31", "description": "Do you like getting cursed out while eating cold fries? Then Park Plaza Restaurant is for you! Ordered on Seamless and when we called to check on our order (20 minutes after it was supposed to be delivered) we were yelled at by the manager for 'complaining'. We waited another 15 minutes outside in the cold until the food finally arrived because, even though they had the correct number, they didn't call us and had to then RE-DELIVER it.", "author": "Leslie A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-19", "description": "My tuna salad was good and New England Clam Chowder was okay. Chicken wrap was good and sized good. Chili was also good according to another person in party . The turkey platter was a bit disappointing with portion.  Smallest diner portion ever. Taste was very good and served hot.  Service was attentive.", "author": "Patty Ann M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-10", "description": "This is a great diner, esp if you have small\nKids -- it's spacious and they cater to little ones. There's a ramp so it's stroller friendly and ample stroller parking inside. Lots of items on the menu.", "author": "Jillian b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-16", "description": "Rats and cockroaches OMG, and hairs in the food!!   We have a problem, with Park Plaza Restaurant!   The way they treat their staff is horrible, in front of customers; they have no shame. The turnover is horrendous. Unless related to family waiters and bar tenders have only lasted less than a few months. All the managers and the owners raise their voice and talk down to the help. And, in addition to the rodents and roaches, the food is just not that great. If you too see a roach leg in your omelette, we recommend you save it for the NY health department.", "author": "James O."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Park Plaza Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "220 Cadman Plz W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/0zjK4v3ipM49Qj9I1DlfNw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965900"}