{"aggregateRating": {"reviewCount": 221, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-30", "description": "I've heard that gangsters would eat here before they went to trial across the street at the courthouse, and I can picture this when I eat here at 3AM after a night of boozing.\n\nA typical diner in ever sense of the word, with a VERY diverse menu.  I always get the veggie burger and sweet potato fries which are always excellent and cheap.   The servers are more friendly than your typical 'diner' server, and the booths are comfortable from years of satisfied asses.  \n\nIt's located in a great part of Brooklyn, close to the bridge and the Brooklyn Heights Promenade.  A great place to start or end your day of sightseeing in Brooklyn.", "author": "Craig R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-10-14", "description": "A run of the mill diner. Its a giant space with a separate bar section. I had a Greek omelette which was average. My side of hash browns looked like leftovers and was completely mushy. The side of sausage oozed grease and didn't resemble pork in appearance or taste. My server was very nice as was the host/owner but the food was pretty bad. Clarke's in the Heights is a much better alternative - at least for the meal I had. Total tab before tax/tip with no drink was $13.50", "author": "Will S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-25", "description": "Best diner in brooklyn, they have really fast delivery( although the guy on the phone can be rude at times). The food is always fresh and very good, it is a bit pricey but worth it with the quality of the food. The salads are actually good which is hard to find in a diner. I would recommend the Brooklyn heights sandwich!", "author": "Ariel S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-14", "description": "I order from this diner all the time and my only complaint is there rolls that they serve their chicken sandwiches on. The rolls are stale, tasteless and low quality, it really ruins the sandwich. I would suggest getting the sandwich on toast instead. Please Park Plaza get better rolls!!", "author": "Aimee M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-01-12", "description": "I will admit that the \"bizarre TV contraptions\" that the previous reviewer discussed are a bit unnerving, especially when they start talking to you, but if you're lucky to be seated at a booth (or table) that is not equiped with \"dine-a-vision,\" it's actually a pretty nice place to eat. \n\nThe food is by no means spectacular, but it's good for a burger, they do awesome breakfasts and pretty good desserts. The only food I ever had there that I didn't really enjoy was the spinach pie.\n\n They have pretty much the nicest wait staff I've ever encountered. The service is always excellent and the place is always spotless.\n\nThey're open 24 hours on weekends and for Brooklyn Heights, it's very decently priced. It's an excellent alternative to the Happy Days diner which hasn't seen \"happy days\" since the show first aired.", "author": "Haley C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-05", "description": "Good service, but not so good burgers. The bread was too crunchy, while the meat didn't seem to be fresh. The meals are generous for the price, but you can do better with your bucks in Clark Restaurant.", "author": "Rafael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-27", "description": "Great diner to have lunch.  You may run into a movie being shot at times, great area.", "author": "Lorrie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-18", "description": "We come here for the banana splits.  Or I really should say my boyfriend does because as soon as I turn around, it is gone - seriously how does one finish an entire banana split in less than five minutes??\n\nAnyway, this place is great for desserts and hot chocolate.  The food is eh.  They're open later on weekends, which is great, because most restaurants in the area seem to be closed.\n\nP.S.  Some of the tables tilt.  If you come here when you're drunk/tipsy, you can have endless fun playing \"roll the salt and pepper shakers down the hill.\"", "author": "Michelle N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-15", "description": "Nothing special....run of the mill diner.  Expected better due to the location.  Received less than the average Brooklyn diner.  Wasn't even 'asked' as our neighboring table if we would like the \"complimentary\" cole slaw and pickles.  Had to ask and my dh and I laughed when it arrived.  We thought we were being punked!  This tiny cup of cole slaw for 2 people and some low quality pickles!  Not the hearty fresh pickles you are served at most diners.  And most diners also serve \"complimentary\" chick pea salad, pickled beets, challah bread.  Here you get two hamburger buns and crackers!!!!!\nOh, and if you ask for rice instead of a potato, you are told no problem, but then you can't get a veggie too.  Why?  Because rice is soooooooo much more money than rice!  So the waiter said!!!!!  Please....you would think they covered the plate with rice and placed the entre ontop.  Nope!  They serve the rice in one of those small soup cups!!!!\n~~~~~~~~~~~~~~~\nOK.....the good stuff.  The lentil soup was excellent!  The fish was tasty.\n\n~~~~~~~~~~~~~~~\n\nOh, another very annoying thing.  The bus boys kept trying to take away plates that you were still eating from!!!!!  Waiter noticed we hadn't eaten the bread 'yet' and asked if he could remove it!  Who does that!  Seems management must tell the workers to keep moving....well, please.  I come to relax and enjoy a meal.  I don't like being constantly disturbed by hands trying to grab our plates!\n\n\n~~~~~~~~~~~~~~~\n\nThat being said, this diner is off our list.  \n\nWhere have all the diners gone.......(singing).  ;o)", "author": "Brooklynne J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-20", "description": "Whenever I need my diner fix I come to Park Plaza.  They have a huge menu that's got something for everyone (I bring friends here when we can't decide on a place). The food is consistent and pretty well priced.  I really like the worn down and dated interior, it gives the place that genuine diner feeling.  I've been here on many occasions both drunk and sober and they never disappoint.", "author": "Ryan H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-22", "description": "When we moved to BK Heights, we were so sad to leave our fave diner in the UES (Ritz Diner on 62nd and York) but we were sad no more when we found this GEM. If you don't like diner food, don't eat here, but recognize this - no matter what you've a hankering for, you'll find it on their menu. We go all the time and love all the staff. We probably are there at a minimum of 5 to 8 times a month. We have a sickness, and the only cure is more Park Plaza!!!!!!!!!", "author": "Elle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-18", "description": "Really should be four and a half.  Like the vast majority of New York diners, this place is too expensive, but the quality and quantity of food and the very pleasant service kind of justify the price.  You get the pickles and slaw before your entree, which makes a big difference to me in terms of not being mad about the size of my check.  I may eventually come back and promote this place to five stars because they make the best egg cream I've had - I don't know whether it's the proportion of ingredients, the wrist action when they're mixing it with the fork, or what.", "author": "Seth P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-28", "description": "Never go there!!!!!! The service sucks. The waiter approached us as we were leaving to ask us to explain why we tipped him so low, but his service was less than mediocre. They were so rude!!!", "author": "Eva S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-01-17", "description": "Great, family-freindly diner.  \n\nThey have all the standard diner fare.  Food is good but nothing to write home about.  What sets this place apart from other diners is how child friendly this place is.  \n\n1.  There is plenty of room in the restaurant with enough room to park several single and double strollers indoors without folding them.\n\n2.  Great owners and wait staff who are friendly and very and are willing to cater to kids' needs/wants.  \n\n3.  Great food selection.  Again, don't expect anythign special but whatever you're in the mood for, you can have.\n\nI would have given this place 3 stars for food and 5 stars for service and kid friendliness (so I averaged it to 4 stars).  If you don't have kids, I'd probably pass.  If you have kids, this is place is great!", "author": "Jin K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-07-17", "description": "We so were happy with the food, service and prices in the fall.  The last few months have seen a steep decline.  The refrigerator case showcased a pudding dessert with mold growing on it.  The service is unprofessional.  I assume is was either the manager or owner that was berating the server/ busser loudly for all to hear (on numerous visits).  The bar area smells strongly of the bathroom.  I think this place is a perfect candidate for Restaurant Impossible.  Only safe thing to order is a beer at happy hour... but make sure they charge you happy hour prices.  We had to request the bill be changed.  The waitress even put up a fight over it.  They need some help!", "author": "L B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-15", "description": "Amazing food. The texas 2 step brisket sub is out of this world. Everything here is good, I never had anything bad off the menu. Open late!!!", "author": "GUY W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-04", "description": "A solid B Greek diner.  Not quite as good as the Vegas or El Greco but they do OK.  The newly renovated bar is a great place to watch a game.", "author": "Scott C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-28", "description": "I've never been treated so poorly. They sent me the wrong delivery and hung up the phone on me when I called requesting they exchange my order. Literally, yelled at me and hung up the phone as I was saying \"I'm not trying to fight I'm calling because I just paid $20 for a meal I didn't receive.\" Never going back again.", "author": "Wafa G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-30", "description": "Came with collegue Patricia for a late breakfast around 10;30 on friday November 29,2013.\nAll other patrons were escorted to their tables with menus while we were told sit anywhere then an older latin or indian waitress came and threw menus down on the table and walked away.\nWaitress then come back 5 minutes later for our order and we asked for 2 coffees while we looked over the menu...she walks away with an attitude.\nShe brings coffees and say you ready to order and we say not yet and she walks away once again with an attitude.\nwe finally order:\nPatricia\"s order was the Park Plaza which is french Toast(came out soggy) 2 slices of bacon( very fatty) 2 beef sausage( okay) and 2 eggs over well( eggs came out when we were almost done eating we had forgot about the eggs) no apologieswhat so ever.\nI ordered THE BIG MESS which i have had before and asked that the homefries be done well...waitress leaves table and comes back to tell me that it is all thrown together then tossed on the grill. I told her to tell the cook to brown the homefries then toss everything else on top of it and flip it to cook..why did my dish come out looking like a thin crust of homefries topped with a western omelette with shredded cheese thrown on not melted??\ncoffee and water refills you had to hunt someone down because she disappeared and took forever to bring refills.\nfood needed a lot of salt pepper and Ketchup!!\nFOOD WAS NOT HOT NOR TASTY\nSERVICE WAS CLOSE TO NONE\n2 stars one for convenience and one for the decor\nthis waitress and breakfast staff are horrible all the way up to the manager/cashier who i mention this to and he gave a DRY ASS \"sorry\"", "author": "Chino P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-03", "description": "huge menu, nice staff.\nhowever, the food was just okay. nothing really special. but def. a huge family restaurant for huge parties and families in Brooklyn area. most of the restaurants here are small and cramped. this one has lots of space.", "author": "Ai L."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Park Plaza Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "220 Cadman Plz W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/0zjK4v3ipM49Qj9I1DlfNw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965900"}