{"aggregateRating": {"reviewCount": 221, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "Love the location of the place from our dorms! It really makes eating out easier(: especially the healthy choices and their friendly service! Definitely recommend going often!", "author": "Ashleigh H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-06", "description": "Chicken and Waffles!! WHOOP WHOOP!\n\nI have been here a few times.  It is good food, good service and a great location. Not the best place you are going to find, but great to try.", "author": "Bryan F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-07", "description": "My friends and I have been going to this diner for many years. It's our go-to place for breakfast lunch and cocktails. The food and drinks are reasonably priced and tasty...best chicken wings and french fries in Brooklyn! Service is great and the staff is very pleasant and professional. The owners pay particular attention to detail and they are always available amenable should there be a problem with your order. I highly recommend this place--best value for your dollar. Oh, and they also have Happy Hour daily.", "author": "Rachelle T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-29", "description": "I come to this place every couple months since it is by my school and let's just say they are good. I've had better food but it's not that bad, you can still enjoy yourself. Every time my friends and I come we are always seated right away with no problem. The service is fast and great. The food before used to come in bigger portions and today when we ordered the portions are smaller so that was disappointing. The food is not bad nothing bad happend with my food yet. Love coming here!", "author": "Milena M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "Park Plaza Diner previously known as Cadman Plaza Diner  has been in the Brooklyn Heights community for as long as I can remember. Excellent wait staff service, refreshing new menu items and every month they have a special thank you for their diners. This month, all beverages are free including refills.  I felt that was a nice touch. It's definitely  a big hit for Brooklynites who go to Manhattan for the night  life and stop in for a great breakfast  with reasonable prices. They now have a sports bar in the back with big screen tvs, karaoke nights and few other themes that seem very inviting. It's also located very close to the Brooklyn and Manhattan bridges. Parking can be tight, from time to time, but that's Brooklyn for you.  It's an old time tradition  that continues to grow, not to mention  it's also a landmark for those in the know!", "author": "Jacqueline E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-08", "description": "I've been spending entirely too much time in diners of late. Perhaps I'm trying to recapture my desperately fleeting youth, or maybe I'm just drinking late into the night and wanting to stuff fried things in my face. Who can really say?\n\nAll I know is that I ended up at Park Plaza late one evening, and we ordered all the fried things. By that I mean we got the Plaza Pile Up: wings, mozzarella sticks, and chicken fingers, and onion rings. We added the Rockin' Fries (curly of course, because we're not idiots), the soup of the day (an exploratory order that turned out to be pretty good), and a chicken quesadilla. \n\nThis was probably excessive for only three people who had absolutely already eaten dinner. Well, I regret nothing. \n\nActually, I take that back. I regret everything. But that's more on me. Park Plaza is solid, and their fried things taste good. \n\nGranted, they wouldn't let us sit at the gigantic round table, as they had little sympathy for the fact that I didn't want to sit next to my wife. And we had what was perhaps the worst service I've ever seen (in a good way)...but this will now be my go-to diner since Carroll Gardens Classic has betrayed me and everything I thought we meant to each other.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-12", "description": ".50 cent wings Friday at happy hour.. well drinks.. those chicken wings were bomb!! Service was really great! Super friendly and nice. \n\nWe went to the bar side for happy hour! \nFree wifi too! PW: 220cadman\n\nVisiting from California and I liked the vibe. They have a DJ too and plays old school music. \n\nWould def come back if I'm ever in this area.\n\nMy bf and family enjoyed it:)", "author": "Suiying S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-10", "description": "The is the first restaurant I've ever seen that charges extra for a take-out container with a delivery order.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-28", "description": "Park Plaza Restaurant is a fun and enjoyable diner with great booth seating and a huge menu offering. I ordered the Classic Angus Burger deluxe and was super excited to see all of the options to choose from as a substitute for French Fries. They had onion rings, sweet potato fries, and CURLY FRIES. I repeat.... CURLY FRIES!!!  While the burger was a bit dry and on the average side, the vast portion of curly fries hit the spot. Service was friendly, attentive, and overall I enjoyed the atmosphere. If it's 2 AM on a Saturday night and you're starving, Park Plaza Restaurant is worth the visit!", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "Love this place! They stay open late for you, plus the karaoke on Wednesday nights is so much fun!", "author": "S D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-06", "description": "Ok... my waiter was amazing! Environment very nice and clean. Food pretty good. But extremely disappointed in the \"baked\" Mac and cheese.. it was more like Kraft mac and cheese. Also the fried shrimp was coconut shrimp... that's great if that's what you expected...  not sure what the chef was thinking. Thank goodness for my waiter who offered an alternative once I brought this to his attention. He was fantastic! Next time I'll try the breakfast.", "author": "Patricia F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "Park Plaza Restaurant is always so delicious. The atmosphere there is wonderful. Such a nice place to sit and relax with friends :)", "author": "Kenzie F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-28", "description": "I wasn't served the meal I ordered. But the one I got was still pretty good. Didn't complain. Will probably come back again sometime.", "author": "Scott T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "Outstanding food! Come here alll the time with my friends! Try their sandwiches! Great for late night bites l.", "author": "Miata L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "This is a first rate diner.  Food is fresh and tasty. Atmosphere warm and welcoming.  Service is friendly and efficient.  Morning coffee is excellent.\nVeggie burgers are the best I have ever eaten.  Owners are caring.  Excellent all around.", "author": "Beverly S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-18", "description": "This place should be charged and shut down for serving low quality crap at high quality prices. I placed a very standard order via GrubHub. What I ordered are staple dishes at ANY diner and I was sure they couldn't possibly screw up chicken fingers or a BLT. WRONG. All the food was hardly edible, but the most inedible was my chicken gyro and Greek yogurt. The gyro chicken was greasy, served on a soggy pita with hardly any lettuce, tomato or onion. The Greek yogurt was the consistency of cream cheese, there was no honey in it as advertised, and to make matters worse, the so-called granola was nothing more than a Natures Valley bar crumbled over the top. For $9 you crumble a $1 granola bar over cream cheese and call it Greek yogurt? $9?!!! Naturally, I phoned the restaurant and was met with a rude and disgruntled manager named Freddy who's reasoning for this debacle is that no one else complains. I could care less if no one complains, I'm complaining, and for a $50 order the food could have at least been decent at best. I called GrubHub and was only refunded half my order because Freddy told them that I only complained about the Gyro and yogurt. Had he not argued with me, I would have gotten to the rest of the garbage they sent me, but I couldn't get a word in. I took the refund and GrubHub gave me a $25 gift card. Oh, and FYI, they charge $.30 to put your food in a container. I was charged $.30 for my gyro and it didn't even come in a container!", "author": "Kammy B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-02", "description": "Park Plaza Restaurant has been an incredible support of a community based program I run by donating every month for over one year straight! The owners, Nick and Demetrius, have shown us tremendous kindness and generosity by investing in our cause and we've always had positive experience with their service. \n\nWhen I used to live in the neighborhood, I would also go to Park Plaza a few times a week and was very happy with the customer service and food, especially their burgers and tasty Greek dishes. \n\nI highly recommend Park Plaza Restaurant and also recognize them as a staple in the Brooklyn Heights community! Especially being open late, I see them as a go-to for a great dining experience.", "author": "Dana T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "The best customer service I have seen in a restaurant in a long time \nThe staff is superb the happily sat us down as soon as we walked in \nWas very warming and the food was excellent and they also told me about the special they was having which saved me more than I expected \nAnd they was so kind to give me and my wife a free drink and dessert \nI was really happy cause my wife was so fond of the place . So that made me really happy \nI am now a frequent customer", "author": "Chris P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-23", "description": "Great place, amazing food and service. Would recommend it to anyone looking for a casual spot in Brooklyn Heights. They have a cool bar inside. Karaoke every Wednesday which is awesome! Just had their weekend brunch. The Cuban Benedict was awesome. Good price with a brunch cocktail. Definitely a regular spot for me and my friends.", "author": "Anny D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-27", "description": "This is the worst diner I have ever ordered from... my food was completely disgusting. It looks like they gave someone else's scraps! I will never spend my money here again! Totally disappointed.", "author": "Simone L."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Park Plaza Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "220 Cadman Plz W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/0zjK4v3ipM49Qj9I1DlfNw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965900"}