{"aggregateRating": {"reviewCount": 221, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-12", "description": "I eat here often and while the food isn't high class or exquisite, it is perfect for a hangover brunch or brunch with a large group. There is always available seating, quick and good service, strange characters (staff and customers), and good breakfast food.\nI have heard one story that made me not want to go back (involved ants) but I've never had an issue. \nCoffee isn't that great, but free refills make up for it. Prices are good. Cards accepted.\nIt really is just an adventure, you never know what characters you're going to see or what eastern European accent you will hear that day.\nSee you there Sunday? I mean every Sunday.", "author": "Darren G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-23", "description": "Park Plaza offers typical diner fare, neither great nor terrible, but you know what you're getting and it's fine. (except the fries - they're those battered fries, just awful)  Their main attraction is that they're open later than most other restaurants in the area, are very big so you'll always get a table, and the price is modest. \n\nThe serving staff is friendly enough, but the owners - the people who man the register and answer the phones - are the most obnoxious bunch of people you'll ever run into. They harbor a genuine hostility towards their customers, and react with disdain to any request. Were it not for their sheer nastiness, I'd go to and order from this place often, since I live next door. As it is, they're a last resort, and I'll only go there when there's no other option and I'm starving.", "author": "Zando E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-28", "description": "The first time I ate hear was with my friend Donna for brunch ,I never knew this place existed,they got a B ratings on their window,but she swear this place have good food so I tried it,I ate the park plaza omelette,with turkey bacon on the side and toast with a mimosa,she had a Spanish omelette with bacon on the side ,my omelette was pretty decent with the milky white cheese on it the home fries I had was seasoned nicely ,most places I had home fries they was so bland ,I enjoyed the meal ,the place seem Like a nice family spot in the day,my friend home fries came to her cold but the young lady I believe she was the manager made sure ,she had some nice fresh hot ones ,which I thought was cool ,other than that the food was pretty decent..this was Saturday,Oct,27,2012,after a night of partying me and my boyfriend went to Kellogg  diner which was crowded and people was coming out who had been in their 40 minutes with no service,so we went to park plaza,I had a breakfast burrito with steak and some coffee,my boyfriend had something called the mess,it had egg,bacon,ham homefries and some other things mixed up in it,he enjoyed it ,I enjoyed my meal,oh yeah I forgot to mention it was a 24 hour place..I will eat here again a nice size place,I heard on Fridays people come to have drinks,its always a nice crowd on that day,they have a full size bar,with a nice liquor selection,I also smelled fresh paint ,my friend Donna was telling me they was remodeling,my friend Donna found out about the place because one of her coworkers had their retirement party here ...I will be coming again", "author": "Monique B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-09", "description": "Great no frills diner that got a recent upgrade. Glad there are still a few of these left.", "author": "Atlantic A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-02", "description": "5 stars for just delivering at 3am on Saturday morning! After having a friend from out of town come in late he was starving when he arrived. We went on delivery.com and saw that Park Plaza was the only thing open at that time and delivering. Added bonus was the amazing breakfast. The waffles with banana was great and so were the grits! My boyfriend had an eggs and his friend bacon and pancakes. We were all VERY happy with our food and fast delivery. Good to know they are open and delivering for late night munchies!!", "author": "Stacey G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-25", "description": "Definitely typical diner food. The French toast and chicken sandwiches are very good. It's always clean and the staff are all really friendly.", "author": "Chrystal A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-07", "description": "I love eating here. I don't think I've ever had a bad meal, and even at weekend brunch, the service is good and the food remains great. I would go here every day if I lived in the neighborhood.", "author": "Joe S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-22", "description": "We are regulars who eat here at least 4 times a month. Ever since the renovations we have noticed a change in wait staff. The new staff seem disconnected, preoccupied and disinterested. Our coffee has not been refilled and when we ordered a dinner special, we were just served the eggplant with no pasta. He totally forgot our appetizer too. The food is still ok but service has really been hit or miss. We may have to change our go to place.", "author": "Julia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-14", "description": "This place rulez.", "author": "SGCL .."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-16", "description": "2.75\nyes it's a diner, a dinosaur diner almost.\nforgettable greasy food and coffee water.\nin some eating establishments on occasion you hear jocular repartee and  laughter emanating from the kitchen. not so here.\ni was convinced by the angry shouting that was actually penetrating my senses like a 2 year old's temper tantrum, that there was going to be blood shed. i waited gingerly for an ambulance to arrive. the pitch and crescendo, the cacophony of the pots and pans at a feverish violent pitch continued through the entire meal. the ambulance never came, and i'm not certain if vengeance was ever exacted.\n\n\"no volvere, te lo juro con todo mi alma, te lo digo llorando de rabia, yo no volvere!\"", "author": "bridget e."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-02-26", "description": "This diner resembles the set of a Mafia movie from the 1970s. The food is decent and service is friendly, but the outdated decor could use some updating. The $16.95 three course dinner special is a bargain. The food portions are huge and you do end up taking leftovers home with you. \n\nBefore the meal, our server brought over a basket of warm bread and sesame seeded breadsticks to our table. I made the mistake of munching on these because it filled me up so quickly that I struggled through the first course of hummus and pita. When the second course of pulled pork, steamed string beans and fries arrived...I was so full I had no choice but wrap it up and take it home with me. For dessert, I got a large slice of lemon coconut cake but only took a few bites out of it. Unfortunately, I let it all go to waste. I couldn't stuff myself any further.\n\nOverall, the food is good but it's way too much for me to consume in a single meal.", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2006-10-16", "description": "Alright, so don't ask me what I was doing here at 6:30am on a Saturday, but that's when I stumbled into this place, hungry, sleep deprived, and wet from the rain outside.  Don't let the fancy name fool you, this is a pretty typical diner, maybe a bit larger than normal but it's got all the familiar diner trappings, down to the big booth seats, so-so food and mostly working class patrons.  What really makes this place stand out are the bizarre TV contraptions at every table.  Instead of having a couple of TV's like most normal places showing sports or the news they have a very fancy looking setup at each table with a pay-per-view style TV set where you can choose what channel you want to watch.  At first I couldn't decide whether this was the most brilliant or the stupidest thing I'd ever seen, but finally decided it was dumb after seeing how much the little TV thing cost to use -- $5 for 30min, wtf! It's just a TV and it's not like you're on an airplane or some place where TV is a novelty (even on airplanes the damn TV is free!)\r\n\r\nAnyway, as I already said, the food was so-so at best but hey, if you're just getting off the Brooklyn Bridge at an ungodly hour, find yourself hungry and in need of some shelter, then this is pretty much where you'll find yourself.  It beats Mickey-D's I suppose.", "author": "Herman S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-01", "description": "I frequent this diner every so often but every time I do stop in I'm reminded why I keep coming back.  The staff is great and service is quick. It is one of the cleanest diners in Brooklyn. The portion sizes were just right as well. I have yet to go there during the day but if you need something to eat and happen to be in the area stop in, you'll probably be glad you did.", "author": "Gerard H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-27", "description": "Park Plaza was my go to diner in New York. Really nice owners and waiters and really yummy food. I still have dreams about their strawberry cream cheese stuffed french toast. The veggie burgers and salmon burgers are equally fantastic. And oh the souvlaki, the wondrous, beautiful salmon souvlaki! I may have to jump on a Chinatown bus this weekend...", "author": "GiselleLee L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-15", "description": "This is a decent burger, breakfast and super late night joint. The booths are comfy, and its clean. They are open all night on weekends and late on weeknights. The desserts are decent too. Though I really wouldn't stray far from breakfast food, sandwiches, and appetizers if I were you.", "author": "Kaitlin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-14", "description": "Consistently good diner food. Have only ordered take out, never eaten in the restaurant, but the service when ordering is always good and the deliveries come quickly unless it's a busy ordering night. Really yummy matzoh ball soup, sandwiches, chili, and disco fries!", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-02", "description": "Excellent food, good prices, late dining spot, reliable \n\nPark Plaza has excellent food plus reliable and friendly service. You can find anything to satisfy your craving whether it's breakfast, lunch or a late night stop. Mouthwatering burgers, delicious popcorn shrimp and amazing tartar sauce, one of the best Philly cheesesteaks around and terrific chicken tenders just to name a few...Menu is regularly updated to keep food exciting.", "author": "Vivian P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-03", "description": "The Park Plaza Restaurant is just your average diner. The food is ok and the service is fast. I would only recommend this place for breakfast.", "author": "Lisa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-21", "description": "I love Brooklyn diners and this is my favorite!  Food tastes really good, the selection is broad (it's a diner) and there is a lot of space and plenty of booths, which I like.  Ladies room is a bit cramped, but has always been clean.  No parking lot. Subways close by. Value priced. Pleasant staff. I was particularly pleased with my salad which was not loaded with iceberg lettuce.  Check this place out when a diner is what you are looking for. If you have children, this is an eat-out treat. If you don't this place does not invite kids' worst behavior. Cool kids are cool here. Uncool kids are uncool.", "author": "Sharone W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-06", "description": "Really good food.   Ate there twice over the weekend because we were moving, shopping, unpacking.   The spicy omelette was really good with chorizo and pepper jack cheese, along with fresh onions and peppers prepared very well -- you could still tell the onions were onions and the drizzle of chile sauce was really yummy.   For lunch had the bison burger and chicken noodle soup.   REAL homemade chicken soup - some of the best I've had in New York.   The french fries and onion rings were fine, nothing to write home about.   Service was positive and upbeat, though slow at lunch because it looked like they just got filled up with new tables right before we got there.   But a great sign that the restaurant was packed full with what looked like lots of regulars (they greeted one another!) at 2pm on Sunday afternoon.  Nice neighborhood feel.  Bakery items look pretty yummy - especially the baklava -- but haven't had a chance to try those yet...", "author": "Erin E."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Park Plaza Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "220 Cadman Plz W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/0zjK4v3ipM49Qj9I1DlfNw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965900"}