{"aggregateRating": {"reviewCount": 221, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-27", "description": "Mimosas!!! Great for breakfast! Good french toast! Burger and fries good for the price.", "author": "Alexis R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-28", "description": "This is always a well-accommodating place if you ever want to relax and eat good food. You have a choice of two separate areas, bar with TVs or regular quiet diner. I come here quite frequently and they never disappoint.", "author": "Zachary D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "I love this diner. The food is always good and the staff is always efficient. Its great for a late bite then stroll on the promenade and great to take the family too (including the little ones). You can't go wrong with any of their pancake platters.", "author": "Cassie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-09", "description": "Pancakes were awesome every time I've ordered them. I honestly don't care about the service, which was good. I have no memory of the sides bacon etc. because  I enjoyed the pancakes that much.\n\nEverything else I've seen from what others have ordered look like regular diner food. \n\nPancakes enough said (Breakfast time)", "author": "Eugene J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-24", "description": "I've dined in frequently and gotten delivery frequently as well. I really like the sports bar area and they are very accommodating with the games and volume if there's something you want to watch. Solid fries/onion rings/sliders/mozz sticks and beer selection. \n\nFast delivery and good price, clean restaurant and great customer service. I've tried a lot of things on the menu and they range from pretty good to decent.\n\nHowever my main criticism is that they cannot possibly focus on their food quality with a menu that huge. I'd recommend they remove about half the menu items (who's really ordering some of this stuff??) and really try to focus on improving the other dishes. You can tell how much frozen stuff they use because they can't possibly keep things fresh on a menu with that many random items on it, they wouldn't be able to go through the stock in time.", "author": "Jesse O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-14", "description": "pretty decent food, but the service is terrible. I try to only get take out to avoid having to deal with the rude waitstaff. Not cheap either. If this place wasn't so close I probably would not order as much.", "author": "Danielle G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-12", "description": "I have ordered breakfast and a salad from this spot on a couple of different times and it was ok. Nothing to rave about. I find it annoying when you have to pay a container few considering not many other places do that. The food isn't that high of quality but coming from a diner you expect it to be around the same level of others. Wouldn't be my first pick to order from again.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-13", "description": "Owner is a prick and the waiters are all creepy. Food sometimes would make my stomach ache but there were times this was my only choice.", "author": "Cindy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-19", "description": "Excellent burger, get the deluxe (with fries and a couple of complimentary onion rings). Chocolate mousse cake is superb. The delivery service is fast and friendly. Also has great omelettes and desserts. Good food!", "author": "Sara V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-23", "description": "The first time I went here I was seated immediately by a reasonably friendly host. I sat at an unset table with one menu for two people and no waters for around 30 minutes  without service before getting up and leaving. I swore I'd never go again.\n\nJust recently I decided to order take-out from here because there was literally nothing else open for take-out and I figured I'd give it another try. Upon walking in I was ignored by all the staff until a disheveled and rather rude host directed me to the take out counter. After sitting confused for about 10 minutes a guy speaking very little english barked at me for my order and walked away before I finished. 20 minutes later he brings my food, what I later discovered was an overcooked cheeseburger with a half slice of cheese on a stale deli roll, and the check. After paying exact change and going into my wallet for the tip I hear him bark, \"What? No Tip?\", to which I promptly closed my wallet and said, \"Nope, not anymore.\" All in all I will never eat at this place again. I feel sorry for anyone who might be unfortunate to walk past it and give it a try.", "author": "Mike H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-15", "description": "Very solid diner food, open late, and the service is generally good. Fast delivery, friendly service, pretty good portions. I have never actually been inside the restaurant but my roommate and I order take out from this place all the time.\n\nGreat wings, breakfast menu is stellar, and they actually read the special instructions when I order through seamless.\n\nI didn't give 5 stars because I wouldn't say this food is as good as it gets - it could be better, but by no means does it disappoint! \n.", "author": "Dylan L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-01", "description": "Ok I hardly review anything but...\nI ate here a few times as I work close by. Each time it was typical diner food and quality. Not overwhelmed and not under. However today changed my tune. The bad experience started from when we ordered for delivery to our office. The woman on the phone was terribly unpleasant. Ok maybe they're busy...its lunch time...fine. Ten minutes later we get a call that the food is on its way. Ok not so busy. Weird. Nonetheless I'm hungry. I proceed to eat my $15 Greek salad with grilled chicken (questionable) right away I notice my chicken is old and rubbery and reheated. Possibly a few times. As I continue to eat the feta cheese and stuffed grape leaves (very good by the way) I noticed a string on one of the pieces of rubber chicken and in my head I try to ignore and chant please be a string please be a string. I know a string is a weird thing to have in or wish to be in food. So I investigate by pulling the string with a napkin and realize it is not a string. It was an imbedded...gasp...hair!!! My worst fear realized, I threw it out.", "author": "Sadie H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-04", "description": "First off the service was great from the employees but the Manager was pure disgusting and just straight up rude. Any issues among staff should be discussed in the back, not in front of your customers! The guy completely ragged on his employees who were doing there best! He started yelling and everything! Completely unprofessional. Plus the food wasn't that popin! Like for a late night diner you can do better, no ones paying you for a basic meal they can make at home. At least put flavor to it! More then anything I could have dealt with the food, if I didn't have to put up with that manager. He can get his life...at a new job!\n\n\nPS I would have gave it 1/2 a star if I could...thank yelp for the 1!", "author": "Kira I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-01", "description": "Stopped ordering from here for a long time. Decided to try to give them a shot again and got ripped off.  Forget it. So much more reasonable food in this neighborhood. 3.50 for a 15.2 oz bottle of OJ for just one example.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-01", "description": "Ah I'm so torn about this review.  Because the food was actually pretty good.  But OMG the service...\n\nI was with a big party and as far as I'm aware half of them are regulars who enjoy this place a lot.  I got the Grilled Shrimp Wrap, except I got the shrimp fried...  It was pretty good, not the best, but not disappointing.  I tried some other peoples dishes and they were all good!\n\nHOWEVER\n\nOur waiter seemed displeased to be taking our order.  He got most of them wrong in some way shape or form, and they all came out at completely different times.  (There was at least ten minutes in between the first and last meal between the 8 of us)  When he was corrected because the wrong thing was sent out he seemed annoyed with us.  Even commenting to one girl that having sides of both mashed potatoes and fries was too many carbs. \n\nTo make matters worse, when a couple left through the back door for a smoke the entire staff went on a tirade.  There is nothing near the door that says you can't exit through it, but multiple personal came running over yelling.  One of them even called us \"freaking female dogs\" in spanish.  Unfortunately for him we're all educated enough to know what he was saying.\n\nAnyway.  I wouldn't go back.  Unfortunately for them the good food and late hours doesn't nearly make up for how we were treated.", "author": "Shannon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-03", "description": "This was my first time here and I loved it, nice looking place, the atmosphere was very pleasant and relaxing.  I order the body builders omelette, which was 6 egg whites, with six turkey sausage patty's, spinach, avocado, home fries and toast.  The portion was VERY big, if it sounds like a lot it was.  The food was delicious and the waitress I had was wonderful very friendly, fast service and helpful.  I will definitely be coming back again.", "author": "Kim G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-01", "description": "Yawn. Much to be desired here. Service was awful, food was ok. Decor is nice but who cares... It's like a nicer looking Denny's to sum it up. Don't waste a meal here when there's a zillion better choices right around the corner.", "author": "Lexi O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-28", "description": "Adorable waiter prepared Irish hot chocolate and gave great dinner recommendations.\n\nHad the sliders. Good price, good meal. Definitely will be back.", "author": "Deedee M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-02", "description": "I've been coming here all my life. To date I've only had one bad dish (their matzo ball soup). I can recommend without any reluctance their hamburgers and Belgian waffles.", "author": "Logan G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-18", "description": "This is an old favorite of mine gone wrong. I moved away for a year and came back to find it renovated. I thought it looked great and was excited to dine there again. The seat was old and uncomfortable so I switched sides of the booth, ok better but why is the booth old and crappy after such a nice renovation? Then, the food comes... OMG! My omelet was so greasy and looked a lot more like a scramble. My home fries were greasy mush. Disgusting. I was really disappointed with my meal.\n\nAnother point to add would be that when I opened the ketchup bottle there was a gross liquid inside waiting to fall onto my food (not the normal ketchup fluid that gathers in an unused bottle).  Then after eating what I could I went to use the restroom and there was no toilet paper in any stall, when I told the manager he said they had another restroom I could use while he fixed the problem.  In the other bathroom I listened to men in the kitchen scream at each other.  Overall, the entire experience sucked.\n\nAfter being an old regular I probably will not be back.  It looks really nice but some things just are not what they seem.", "author": "Autumn W."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Park Plaza Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "220 Cadman Plz W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/0zjK4v3ipM49Qj9I1DlfNw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965900"}