{"aggregateRating": {"reviewCount": 221, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-10", "description": "I've been coming to park plaza literally all my life and it has changed a lot in the past few years. The food is ok but it seems like they are more focused on their bar area more than their food these days.", "author": "Brittany R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-18", "description": "I came here twice before once just for happy hour which was really good 20 cent wings which is unbeatable. . . But last Saturday I came here with my daughter I ordered the chicken tenders and fries for her and I ordered the chicken penne la vodka. . . My daughters meal was good the tenders was seasoned very well but for my meal it was so/so it wasn't much seasoning and not enough cheese but there were lots of chicken which was good I had to add salt and lots of Parmesan thou. . . My pasta came with a caesar  salad that tasted like butter instead of caesar. . . Overall it wasn't a bad experience I'll definitely be back for the kids meal for my daughter and the happy hour", "author": "Sherika G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-04", "description": "As good as it gets, on steroids. The food is always fresh and delicious. I often order delivery and the food is always hot when it gets here. One of the best burgers I've ever had.  Their specials often include comfort food (eg chicken pot pie).  Italian excellent!  Prices fair, people lovely. Run, don't walk, to Park Plaza!", "author": "Mike L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-07", "description": "I've come to Park Plaza since I was was about 12 years old. That's a lot of years lol. Never had a problem until the other day. Over the years the food has just been average but I continue to come back because it's the go to spot. \n\nOn Saturday I arrived with a party of 3, we had our mediocre lunch and were ready to pay. I noticed that there was a $7.50 tip added to our bill. Doing the calculations it was more than 15% of our bill, basically the waiter made up his own tip and added it onto the bill. \n\nWe went to the front desk to pay and asked if adding the tip to the bill was something new that they were doing because in all of the years that I've come here, tip was never included. He told me that tip is added to the bill for parties that come in after 6. It was 5:57 when I was leaving out to pay. \n\nThe guy at the front desk didn't offer to take the tip off of my bill nor did he apologize. We had a staring match for about 49 seconds before he dismissed me and said have a good night sweetie.", "author": "Keisha F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-25", "description": "The food was great and awesome  variety  but the waiter wasnt really nice.he seemed to rush and his service  wasnt worth the $15 tip he demanded.", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-26", "description": "Ordered online through Grubhub and wanted a Memphis burger but got some other burger. I mean, I understand if you mis heard me on the phone but it was online. You can read my order as many times as you wanted.", "author": "Alex P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-29", "description": "This was my first time here. The host was extremely welcoming and made me comfortable. This dinner is very big and has a sports bar attached to it. \nI used the restroom and I must say that it was spotless and clean and unlike a few restrooms I have used the air freshener was consistent. This kind of cleanliness makes it a big factor in me choosing to eat at a restaurant. \n\nI order the California wrap and before it arrived the patron next to me was complaining that the over easy eggs he ordered was hard but he would power through the meal anyway. The waiter offered to changed it which was nice. \n\nMy wrap arrived and I must say that it was drenched in oil. The main source of protein in this meal is salmon and I am not sure if they allowed the oil to drain or not but it was extremely oily. The spinach and other ingredients were fresh but the wrap lacked the raspberry filling it was supposed to be accompanied with. \n\nI have lately been elementary salt from my diet so the absence of sodium was bearable. We asked for some honey mustard which made the meal more bearable.  \n\nI ate half of the wrap and despite me being hungry I could not finish the meal. All in all the staff was pleasant and I probably would give here a second chance.", "author": "Adrian F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-12", "description": "The service is great the meal was tasty. Only complaint they had no hollandaise sauce on my eggs Benedict", "author": "Albert S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-24", "description": "This is my go to place. They make pretty good sandwiches and wrap combos, ya dig. Breakfast food is spot on too, plus you can substitute your toast for pancakes which i love. I ve been dinner hopping for years now. Only downfall to thus place is that it's pretty drafty because the doors are straight of Court st and the windows need to be caulked and sealed. Dress warm", "author": "Krystal F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-19", "description": "The woman at the front desk was awesome. Pleasant, welcoming, and efficient.\nGreat at accommodating large parties and child-friendly.\nOverall taste of the food was good! Everyone enjoyed!\n\nThe service and presentation needs work. I must admit, based on the location, other reviews, and appearance of the place, I expected just a bit more FINESSE.\n\nSuggestions (based on other diners all over NY that I have eaten in over the years):\n-Bread baskets upon seating would be nice\n-Syrup in a pitcher instead of syrup packets would be nice \n-A little garnish or at least celery on the hot wings plates\n-Food could be a bit more fresh overall, my dad had to send back his olives that were discolored and hummus was very loose (guessing a lot of lemon juice to revive?)\n\nWaiters reached over us in all directions quite a bit - enough that it was noticeable, and even once just set a plate on top of a menu my uncle was reading from.\nMultiple waiters served us and came by to ask the same questions or take the same orders\n\nIt was certainly a busy day for the diner but a personal preference is that staff or ownership is not heard talking about guests, parties, complications, and or speaking sharply to employees. This was pretty evident from staff buzzing around our table and sours the environment a bit.", "author": "Desirée L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-12", "description": "I came here late one day just to munch. This review will be relatively short\n\nMY ORDER:\n\nHot Chocolate- GREAT! Full of rich chocolate flavor, but not overwhelming. The whipped cream was also great, not too sweet.\n\nMozzarella Sticks- they were OK. not too bad but I've definitely have had better. \n\nSweet potato fries- REALLY GOOD. My friend had these with a burger and he said it was okay. Nothing more nothing less.\n\nStrawberry Shortcake- GOOD. This was my favorite part. \n\nA little pricey. Not impressed. Wouldn't come back to be quite frank. The service was ehh. Nothing spectacular.", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-07", "description": "I rode the subway in from midtown Manhattan to walk the Brooklyn bridge back over into Manhattan. I had breakfast here since it is right off the station. Breakfast was decently priced and the food was fine. The service lacked as I only was served one cup of coffee and had to flag another waiter down after waiting for 15 minutes for mine. Would go again next time I'm in the area.", "author": "Dustin B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-30", "description": "I actually have been coming to this place since I was a child. I went to the elementary school in Middaugh. \n\nMy boyfriend and I  came late one night to grab a bite. Our food was sub par but we ate anyway. . \n\nAfter we paid our server and the GM came back to BERATE US in front of the ENTIRE restaurant because he wanted bigger tip. When I tried to inform him that we tipped him $25.00 he told me we were lying. He actually had the nerve to ask me what I do for a living and then tell me that \"since I'm a bartender I should know how to tip\" and then told me I was lying...again. \n\nWe tipped on the card but also left him a 20 on the table which he didn't see until I decided to take it back and put it in my wallet. Then they both tried to apologize. I will never visit again. New management is horrible and the new servers are horrible. It's a shame.", "author": "J I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-25", "description": "Love this place for late night eats. They have two side, the main \"Dinner\" style  is somewhat bland and the service is relaxed family style. The other side looks like a contemporary bar, my favorite place to sit . Bartenders always have good service. Food is the same regardless of where you sit. It's good dinner food, perfect for late night, drunken cravings, and ordering out. Good for late night delivery as well.", "author": "Kyle M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-16", "description": "I've been here once before though I don't totally remember if I liked it or not. The major reason I gave Park Plaza 2 stars was because on this occasion the service was absolutely terrible. The issues started after the waitress dropped off the food, we assumed she was coming back with more because a fruit plate and sausage were missing which was half of my sister's order. We didn't see the waitress for the rest of our meal and were brought the check by a busser after waiting for an excruciatingly long time after the table had been clear. The fruit and sausage were on the bill so we had to get them removed when we went to the counter to pay. I really don't know what her deal was, she didn't seem to have a problem waiting on anyone else's table. \n\nI ordered the Buffalo Crisp sandwich which was ok. It came with a huge piece of pounded fried chicken on a decent kaiser roll with some buffalo sauce on top. It didn't have lettuce and tomato as the menu described but as I never saw the waitress again I couldn't really ask for it. The fries were pretty good, they threw an onion ring on top also which was nice. I really wasn't all that impressed with anything and I know I won't be back unless dragged here.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-01", "description": "Walked in with a friend just because we wanted to have a nice breakfast on a lazy ththirsd morning. Place  look very clean, bathroom was so clean it was amazing, sat down right away. I ordered eggs benedict with potatoes and my friend ordered french toast with sausage and 2 eggs sunny side up. Coffee was nice and hot when breakfast came within 10 mins of placing the order.  I didnt bother to ask for toast as most places include toast as part of the breakfast. So i skip it, the eggs were good but the potatoes didnt really have much salt or seasoning..kind of bland. Lucky for me they had salt and pepper and a good bottle of mexican hot sauce. The order of sausage looked very well done, in fact i would have sent it back but neither one of us had time to waste and we were starving. The place was not busy few people having breakfast but i dont think the kitchen puts much effort into presentation. Service was on point but foodwas not, so i would not come back. The food was just ok the bill was $24 with tax and we left a genorous tip for the waiter as he was really nice and he checked our table several times to make sure we were good. I can say at least the coffee was hot and the service was fast. I have to find a better breakfast place in the area.\nI am open to suggestions...", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-18", "description": "This is one of my go-tos when I want takeout. I usually get there grilled chicken Caesar wrap. There's is my favorite compared to other places I have been. Also their pancakes are the best pancakes I have ever had in my life! They are to die for. The employees are also very friendly.", "author": "Kirsaly H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-22", "description": "I came here once before a couple of years ago and enjoyed my food, but now I'm questioning my judgement. Did I show up on a bad night this time, or was I really that drunk for my first visit? \n\nTo start off, the service was a little too slow for an empty restaurant. I don't think it's okay to have to wait for over five minutes for a menu or to be acknowledged for that matter. I'm not that impatient but come on! We were the only customers there. It took a while for our server to take our order, too. We even had to ask for our check from a cook we saw leave the kitchen because we were left alone for a little too long\n\nSo we both order burgers. Both were deluxe, but mine was with cheese. what PISSES ME OFF like no other is the fact that we were asked how we wanted our burger cooked. We asked for Medium. How did we get them? Overly well-done. Mine even had remanence of burnt fat and oil. The best part? It tasted old and as if it were frozen. I'm not a quitter, but I couldn't even finish mine. Had the fries been as bad as the burger, I would've screamed. \n\nHonestly, I don't think I've ever had a bad burger before this one. Even White Castle burgers get the job done for me. My standards are pretty low, and this place couldn't even meet them. How can a diner mess up a burger?", "author": "Adriane C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-07", "description": "Of my glorifying fifteen minute feature poetry performance at an open-mike held here, I was disappointed for the abrasively rude, habitual scrowl look and unfathomably nasty service from the waiter for our large party of twenty!!  The dude was visibly disgruntled, unhappy to serve patrons as he is unable to hone his interpersonal skills for lack thereof customer service.  It's actually a diner, not a true restaurant.\n\nDiner food for slow incompetent service for my newfound friend never received her ice cream in a timely fashion and was not charged for it? AIJA... get off this Park for the plaza does not wish to serve patrons with professionalism.  Park Plaza Restaurant contains all the sterling qualities of the 4 B's:  Bland, Blah, Boo, and Bù (the fourth is Chinese for NO)!!\n\nN.B.  A parking lot is available for a measly TWO hours usage.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-04", "description": "I've come here twice now because my brother's a big fan but both times I've been here, they've got my order wrong. \n\nThe first time, the waiter tried to convince me that I had misspoken when my brother could even attest that I hadn't. I just wanted a waffle with ice cream and they forgot the ice cream. He could have simply given me a scoop of ice cream on the side instead of arguing. \n\nThe second time, I had asked for tzatziki but I was given hummus instead. It wasn't a big deal but it's annoying that this happened both times I came. \n\nThe food wasn't too great either - both the hummus and tzatziki were too sour. If the service were better, I'd consider coming again despite the underwhelming food, but as of right now, I won't be coming back.", "author": "Mehak I."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Park Plaza Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "220 Cadman Plz W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/0zjK4v3ipM49Qj9I1DlfNw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965900"}