{"aggregateRating": {"reviewCount": 221, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-11", "description": "Been hearing good things about the BBQ food so I decided to stop in on my way home. I tried the pig overload which was 2 ribs, pork belly and pulled pork. It was Amazing!  Everything was so delicious and juicy and it came with homemade sauces to try out. \n\nI'm definitely going back to have more of the bbq", "author": "Chris G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-02", "description": "Food is always good. However they are pricey. \nThey also have a new menu including bbq food. Didn't see anyone order that but hey. \nThe cookies were bland. \nThe onion rings are the best.  \n\nNow the reason for 3 stars is no where on the menu does it say tip included. So please be ready to pay an 18% tip no matter how mediocre your service is. \nImagine my surprise for burgers (3) n fries n cookies me giving a $20 tip. Ummm I'll pass on this establishment next time.", "author": "Yajaida M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "This is a nice find. My boyfriend's aunt took us to this place. I had the Park Plaza special with French Toast, Eggs and choice of meat. It was tasty with large servings. Moreover, my boyfriend has a gluten sensitivity and we were able to find tons of options for him. Needless to say, we are coming back for the yummy and reasonably priced meal.", "author": "Karla G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-16", "description": "Let me preface this review that I would have not understood or believed any of this before trying out the BBQ at Park Plaza last night.\n\nTHIS PLACE IS LEGIT!\n\nWe usually eat BBQ at Hill Country and since they shuttered the downtown Brooklyn location we traipse into Manhattan to get our quarterly fix. ( chicken for me, ribs for my wife)\n\nWe go to this local diner occasionally for breakfast and always upon entering look to our right at the ample bar to our left before sitting.\n\nWhile paying the bill one morning I struck up a conversation with the manager ( owner/partner?) and asked him what the \"deal with this enigmatic bar was all about\". He (Dimitri) went down the list of activities and offerings and we started talking about the BBQ. He explained he was the pit master, learning the ropes by traveling to BBQ pits around the country.  Of course I was skeptical. (By the way Dimitri is a great guy with tons of pride in his establishment)\n\nBottom line we took his advice and went to the \"other side\" of the diner and ordered our BBQ. I kid you not; the food was as good as any BBQ in the city. Hill Country, Dallas, Dinosaur.......you name it, Dimitri is an equal to all of them. \n\n\nThe other bonus is that the meal is about half the price of these other places. \n\nIf you travel for BBQ in the city or just live in the area do yourself a favor and try it out. It doesn't look like much but don't judge this book by its cover! \n\nThis is now the new go to place for us when we need a BBQ fix.\n\nThanks Dimitri ( we didn't say hi as you were running all around running both sides and dealing with a rebuild of the front of store.)", "author": "Tom Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-31", "description": "Ordered Matzoh Ball soup from the delivery menu. I paid for a large (24 Oz) but received a small (16oz). Not only was it not real matzoh ball soup - it had chunks of chicken and one tiny matzoh ball. But when I called to inquire the women who answered the phone put me on a long hold and then argued with me upon her return to the call. I will never order from this restaurant again. $8 tiny soup. Horrible misrepresentation. No thank you.", "author": "J P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-10", "description": "So sad. This restaurant has changed its menu. Going in a new direction-- barbeque  and high fat meat. I understand the need to try new things and keep up with trends. I also understand restaurants need to focus on profitable items.\nBut it breaks my heart to see that the new menu eliminates items that they did so well.\n I am talking about the  best omlettes in NYC,, possibly the wprld. The Park Plaza Omelet  with goat cheese was the most outztanding breakfast item on their menu. The Spicy Omelet and th La Guadalupe were also .excellent.Yet they were cut from the menu!?!? PLEASE RECONSIDER THIS EGREGIOUS ACTION.", "author": "Elizabeth O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-10", "description": "One of my favorite diners. The owners Nick and Demitrius are some of the loveliest guys I've met. They are kind, hard working, and always have a positive attitude. I really love that there are music nights now, and although my favorite dish is the California Wrap, I appreciate all the recent additions to their menu! It's high quality food, great service, and a great place to eat with friends and family. Park plaza restaurant  brings people together.", "author": "Maria F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-27", "description": "I've read some of the reviews and I'm pretty surprised. I found the food to be nothing special. I ordered a buffalo chicken sandwich with fries and onion rings. Unfortunately, the chicken and the roll it was on was so incredibly dry. In addition, the fries were cold, tasteless, and a very small amount of them (which considering the quality, I guess the quantity doesn't matter much)  More than likely to local Downtown Brooklyn people they're loyal to this place no matter what, but this Staten Islander wasn't too impressed (plus paying $14.00 for a gross sandwich just doesn't make me eat with a smile). \n\nCertainly not coming back. I'll stick with my Staten Island diners that know how to make a basic chicken sandwich.", "author": "Josiah B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-15", "description": "Park Plaza is fun! A great place to go, have breakfast or a regular meal and chat with friends. They have a brunch, a full bar, and good service. Totally worth the price of a meal.", "author": "Jan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "Nice place to meet a friend for drinks or lunch!  They have special during happy hours. Call to see the prices.  Karaoke night was a blast!  Each night seem to have a theme. They have a trivial night too! My buddies love coming for a beer and wings.  Dj Torre  is a fantastic spinner!", "author": "Mei T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-18", "description": "I ordered from here once. I ordered a Greek wrap and when I got it It looked like a gyro. I was so turned off by how it was prepared and brought to me. The lettuce tomatoes and onion was all over the place, I couldn't taste the tzatziki sauce from the Greek wrap at all. The gyro bread was soggy as ever. It looked nasty as hell. They didn't provide any condiments whatsoever. I would never buy from here again. \n\nDid I also forget to mention they didn't use a wrap for my wrap. They used gyro bread for God's sake ew", "author": "Vonnie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-19", "description": "This was a pretty rundown spot. Typical diner food. I had a burger. It was cooked the way I ordered it and it was just ok. Had some gristle in it. We had an appetizer sampler also with onion rings, mozzarella sticks, chicken strips and wings. It was ok also. Nothing special at all. We went because we were starving. Wouldn't go again.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-27", "description": "This place is crazy over priced for no reason, there food taste horrible so I spent $15 for bullshit. Each item was $4:95 for sausage link 4:95 for grits $5:00 for home fries.. And it taste like shit.. Do not order from this place.. You would be extremely disappointed. Waste of money..... I. WANT MY MONEY BACK...... I would take a picture if I could.", "author": "Stacy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-06", "description": "I just ordered a burger deluxe for delivery and it was disguisting it looked like it was sitting there all day but i called the owner and he made it right with a fresh new order free of charge that is the only problem I've ever had and I've been going there for Many years", "author": "Dina D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-28", "description": "Got a tomato soup for my friend last night who wasn't feeling right before they closed. Did me a solid. 5 stars.", "author": "Andrew L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-15", "description": "This is a great restaurant.  Fantastic breakfast menu and good service.  Highly recommended!!", "author": "Joe R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-10", "description": "Came here for Lunch while coming back from Queens. It is a big restaurant and street parking was available just outside the restaurant. Checked out the reviews here on yelp and thought of giving it a try. It has a menu of 8 pages. We were seated on a table of 6 and after 5 minutes we were asked to move to a different table. Waiter took 20 mins to take our order.  After she came to take our order, she bought water first and then after waiting for 15 mins food was served. We ordered one brewed coffee which was fine, one spicy omelette and one grilled chicken omelette.\n\nSpicy Omelette- it comes with buttered toast and potato hash. You can choose other sides as well. The spicy Omelette looks delicious with spicy sauce on top of it. With each byte, cheese flows in the plate.\n\nGrilled Chicken Omelette- its actually called as scrambled eggs with chicken. As its name it comes with a grilled chicken breast and scrambled egg whites on top of it. On sides I got buttered toast, home fries and a cup of fruits. You can also order a cup of oatmeal or steamed broccoli.\n\nOwner was nice. He offered me to use their Wifi. The presentation was good too, service needs to be taken care of.", "author": "Bhavnit K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-16", "description": "The salad was fresh and delightful.  The staff was very helpful.  It's right by my job and 20 minutes from home driving.  With the park right across the street, it's a prefect spot.", "author": "Nicole F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "Across from Cadman Plaza, this diner is a court lawyer favorite. The service is excellent and the food choices ample. The food is very good and there are lots of low-carb items available.They allowed us to sit there the entire time having both lunch then dinner. Definitely recommend for a casual meal.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-04", "description": "A good court date lunch time special.  Good variety.   Good service.  \n\nNice atmosphere.", "author": "Njboating C."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Park Plaza Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "220 Cadman Plz W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/0zjK4v3ipM49Qj9I1DlfNw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965900"}