{"aggregateRating": {"reviewCount": 221, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-09", "description": "I'll cut to the chase. This place has great food and delivers all night. We order from them all the time. But the guy who takes phone orders night is the biggest prick I've ever experienced in customer service. Dude hangs up on you, goes out of his way to make you feel stupid, and truly seems to enjoy it.\n\nI still call of course, because of the food and because I can get a panini at 11:45pm. But like clockwork, I always get a couple minutes of frustration for my money. Annoying.", "author": "Nathan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-26", "description": "Terrible. Ordered the honey crisp chicken sandwich. Breaded chicken cutlet was burnt, while the sandwich was suppose to have honey mustard and asiago cheese- I did not get any. Just lettuce and a tomato with chicken between a brioche bun. Come on, seriously? How hard is it to remember 5 items that go into building this sandwich? Maybe you guys should cut your menu in half as its way too overwhelming and you'd remember how to make your dishes.", "author": "Jacob R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-15", "description": "Great spot to study - I come in here all the time and they're super nice about leaving me alone for 4+ hours over a few cups of coffee - I always wind up getting a piece of pie or plate of fries too - pretty solid diner food and cheap! (though their cookies have recently gone down hill)\n\nMy only complaint is that sometimes the manager is a real d*ck to the people who work there and there's a pretty obvious high turnover of waitstaff (most likely because of it).  I've seen him belittle delivery guys, I witnessed him actually purposefully spilling a guy's water all over the floor (maybe it was a joke, but the waiter didn't find it funny at all), I even witnessed him telling a delivery guy specifically to include chocolate milk with the order and then when the guy came back, he was told the customer wanted regular milk instead and that it was HIS fault (meaning the delivery guy's).  \n\nThe manager is always nice to me, so there's no problem there, but it just seems like he takes a lot of his frustrations out on the people that work there by being really mean to them.  I always tip really well.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-11", "description": "This place was recommended to us by a local (well, she's Irish but lives in NYC). Finding ourselves in need of a very late breakfast after crossing over the Brooklyn Bridge we headed here.\n\nAgree with the other reviews about the size of the menu and its effect on food quality - it needs to be seriously streamlined so they can make a smaller number of dishes look and taste superb.\n\nThe pancakes with maple syrup and bacon were good, but not amazing. The two poached eggs (randomly served in a coffee cup), were less so. \n\nIt's the definition of A-OK if you're nearby and in serious need of carbs, butter and syrup ;)", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "One of the best burgers I've ever had.. and I've had plenty in NYC..I had the chefs burger without the ranch sauce.. Juicy, seasoned well constructed burger.. had bacon, grilled onions and jack cheese.. nice charcoal flavor and the fries were fresh cut well seasoned also.", "author": "Jack G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "Classic diner food, with warm and welcoming people. I'm a picky eater, but my modifications are always respected. Delicious breakfast options and the desserts (cookies!) are yummy. They were a hit for my younger cousins. Will definitely be back", "author": "Jade H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-19", "description": "My Mom moved into the Cadman Plaza towers a few years ago.  this place is around the corner from her \u0026 has quickly become a regular for summer nights. \n\nThey recently built a bar and I LOVE it even more. Its way more modern than the rest of the diner.  I now make trips in the winter too. Happy hour is from 4-7 with $4 drinks (tap beer and mixed well drinks) \u0026 50¢ wings.  But even w/o the happy hour specials, the prices are reasonable.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-04", "description": "I've been coming here for 2years when I say this is my FAVORITE place to be that's an understatement ..... the owners are super sweet respectful polite...they make you feel at home my favorite bartender is TYLER he makes amazing drinks he is sooooooooo friendly very well versed in wine pairing.....I'm actually on my way there now lol for happy hour love this place", "author": "Melissa F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-17", "description": "I ordered mac and cheese, quesadillas, and an omelet. The mac and cheese is vile. I'm not sure what is in it but its not cheese, the breadcrumb crust was also gross. The quesadilla was very good and a large portion size. The omelet was okay but nothing the write home about- same with the fries. The fries tasted like fries that you buy in the frozen section of the grocery store and put in the oven at home. I would save some money and just get those if I were you.", "author": "Hayley C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-10", "description": "In town for a conference and a large group of us (I'm talking like 50 or so college kids) came in for karaoke night. And I just want to shout out to the bar staff for still being very friendly and keeping it together because we were definitely a rowdy crowd. I spilled my drink all over myself and not only did they clean it up quickly, but they also replaced my drink for free. I didn't get to try the food and it didn't look super appetizing, but my friends all seemed to enjoy it (esp. the 50¢ wings!). My only complaint was the douchey karaoke guy who was \"curating\" a \"flow\" for the music. He pretty much kept skipping people in our group so him and his friends could sing lame ass songs, even though we were the only reason the bar was so packed. The sun was still up when I put in my song request and it wasn't until 11:30pm until I got to sing (when all his friends left). In the same time period, three different women had been allowed to go up two or three times. I won the raffle for a free drink though and it was overall a really fun night! The general consensus for our group would be to come again if we were all still gonna be in town.", "author": "Katrina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "Both the quality and taste of the food is good. The portions are good too. The restaurant work hours is a big plus. And so is its location from the Brooklyn bridge.", "author": "P J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-30", "description": "I am a director of a dance organization and we used to train at a studio near Park Plaza Restaurant. My colleagues and I would go there for dinner after 5+ hour long rehearsals and always leave satisfied. We thought to build out a partnership with them to spread their amazing food with the entire dance community here in NYC and the owner, Nick, happily accepted my invitation to contribute to our program, H+ | DanceMart, on a monthly basis. We've been working with both Nick and his brother Demetrius for over one year now and we are so thankful for their support. I highly recommend Park Plaza Restaurant as a neighborhood go-to for an awesome and filling meal served with great customer service.", "author": "Yasmine F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-22", "description": "Good Brooklyn heights neighborhood diner!  It's right next door to me so I definitely have frequented this spot more than yelp shows :).  Great quick takeout and delivery as well. \n\nSome of our favs: any of the breakfast items -- especially the omelettes and the challah French toast, the Reuben, fish tacos, and chicken gyro. \n\nUsually quick prompt service ... If you want, you can easily be in and out of the diner within an hour.", "author": "Dara B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-23", "description": "i want to say that my giving the park plaza restaurant I\"The Big Diner\"  or TBD) four stars does not mean that i think it prepares gourmet food.  for me diners are a separate class of restaurant, so my giving The Big Diner 4 stars means it's as good as it gets for a diner.  this means that one needs to expect their vegetables and baked potatos often may come somewhere way south of al dente nearer the border of puree. diners are a place to have french fries!\n\nThe Big Diner is a classic harkening back to the time when the city and its suburbs had many diners almost all of which were run by greek families. the menu is immense (including some nice dishes that are unique to TBD) as are the portions and the management is very tolerant about substitutions. \n\nthe breakfast  omelettes, which are available all day, are a great choice.  ask for the home fries well done. the dinner salads are huge and satisfying.  i usually have oil \u0026 balsamic vinegar (or lemon) brought separately as i think it's best to apply one's own dressing.  although i don't eat red meat, my late husband did and thought their corned beef and pastrami were great.  same for the burgers\n\ni like the santa fe chicken breast sandwiches a lot. they are large \u0026 i don't eat the rolls but the chicken breast itself is immense \u0026 with jack cheese and guacamole on it's a big portion. . cole slaw \u0026 pickles come free with all sandwiches  i get a  baked sweet potato (very, very well-baked) instead of fries and the meal is completely filling and tasty.  there are a number of wraps which are also good. my favorite dinner dish is their french cut free range chicken which has a light flavorful sauce. it is grilled so it takes a bit of time to prepare. \n\nlots of people from the neighborhood eat here and people come from the courts and downtown brooklyn. on sunday it is not unusual to see whole families who come in after church.   i have a west coast friend who, when she comes to visit, insists we go to TBD. they don't bug you to leave and we sit and chat for long stretches.\n\ni never get takeout or deliveries so i can't comment and i don't eat dessert anymore (but there is a wide range of choices.)  their kid's menu is good..", "author": "Ruth N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-22", "description": "I always enjoy eating at this diner. The owners are very nice people who care about their customer's dining experience. They welcome your feedback and want you to enjoy your experience - whether it's a quick meal or family occasion. The food is great, the servers are kind, and the prices are very good. I have not been disappointed once.... and I don't think you will be either!", "author": "M. O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-02", "description": "This is a nice diner... from the moment we walked in the owner greeted us, asked us how was our morning going and seated us immediately...our server came over maybe 3 mins after we were seated and we told her we needed a few minutes..she came back and we were ready to order...our food was hot in ready in no time..i was impressed..she brought an assortment of condiments as well. we were both satisfied with our food...after we ate, we stayed for a minute to chit chat...I sneezed back to back and out of no where someone said bless you, bless you and it wasn't my boyfriend, it was the owner...lol..he was quick. my boyfriend didn't like that very much though:-)", "author": "Carolyn C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-09", "description": "I ordered delivery from Park Plaza, which never arrived. I attempted to reach them by phone to get a refund, and there was no answer. I will not be ordering from them again. Were it possible, I would give them zero stars.", "author": "Toby E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-20", "description": "Though pricey, This place is pretty solid if you know what to get. Burgers, burritos, breakfast, salads and apps are all great. Pretty big portions. I love their mozzarella sticks and fries (not sure if those things could ever be bad- but they're really good here.\n\nThe mashed mac and cheese is not good and please do not get the breaded chicken- I don't know what it is- but I doubt it's chicken.\n\nFast delivery (even late night), pretty good about special instructions", "author": "Bethany W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "I was debating between 4 and 5 stars, just because the food isn't always that good.  But it's not that good in the sense that they overcook the chicken tenders, the beans have been sitting around, and it doesn't feel really fresh.  This is the type of place where you kind of know what you should and should not order, and what is and what is not fresh.  Don't expect that your food is going to taste different or better than you expect, but it'll taste like you imagine it will taste.  So why do I rate it 5 stars then you ask, right?!?  Well, let me tell you.\n\n1) the people that go here are regulars.  So most order the same thing because they figured out what they like and what is good there.  And once you figure that out, then you're golden.  It might take some trial and error for you newbies though, but it's worth it.\n2) the place has character.  Don't let that recent renovation (don't laugh, yes the place was fairly recently renovated) fool you!  This place has been around and been in the neighborhood.  The owners are around, you see them, you know them, and they remember you.  \n3) the offer free (usually up to 1) refill on sodas.  Worth mentioning and giving them a shout-out for, since this is way too rare in NYC.  \n4) and this is a big one - you can take your kids here.  Or your grandparents.  And both can complain and make noise and it's ok.  Just try and get a booth and reign your kids in every once in a while so people know that you're trying.  Or let the kids stare at the cookies behind the glass window.  The place is definitely kid-friendly and people won't look down on you here.  It's the kind of place where people who are eating around you might even comment on how cute your kids are, or at least smile at them and pick up some of their toys when they throw them on the ground.  But then again it IS Brooklyn so you also might get someone who give you dirty looks.  But since it IS Brooklyn you can give them the stink eye right back, knowing that you're in a kid-friendly place and if they want to eat at a fancy restaurant without people, kids, noise, mess, etc. they can walk outside to just about every other sit down restaurant in NYC and feel right at home.  This is your one restaurant damn it, own it and don't apologize! \n5) late night hours.  In my younger days (or at least my days before having kids) I was known for coming here late late night and eating those disco fries.  Ah, the days.  \n6) breakfast is particularly good/can't go wrong.\n7) The prices are fairly reasonable, given the portion size, and the fact that you can kind of hang out a little.  The place is pretty big which means that they generally aren't chasing you out to give your table to someone else.  This is a luxury in NYC, which is sometimes forgotten.  But I got you Park diner, I notice it.\n8) to sum it up since I'm being so succinct here (ha), I give it 5 stars because I worry about the day that their landlord raises the rent and they pack it up.  It's one of those restaurants that there aren't enough of in NYC and that keep shutting down. I would be seriously sad if that happens because you KNOW that whatever restaurant took its place (although it's just as likely to be replaced by high-rise apartments) it wouldn't be half as good as Park diner.  And it certainly wouldn't be a place that you could easily come to and bring your family and extended family to, knowing that whether you're a party of 1 who sits at the counter, or a drop-in party of 10 without reservations, you'll be welcomed with a smile.  Or semi-smile, which really is just as good.  \n\nListen, the truth is that the wait staff are some good, some not so good.  And some of the good ones aren't good on every visit, and some of the bad ones are good on some visits.  So it's hit or miss.  If you're in a rush, then do things to help the meal along like being ready to order, telling the waitstaff you're in a rush, asking for your check, etc.  If you also want to make sure that you get what you're ordering from the menu, you should double confirm what is in the meal or what comes with the meal.  Some things on the menu are a little different when served (e.g. the fish tacos come with things that the menu doesn't mention, and didn't come with other things that they said it did, certain salads add things that aren't in the description). They added a sports bar area in case you want to watch games.  Also, good event space if you ever want something like that too.", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-24", "description": "I like this place, so I'll start with the reasons why it didn't get a 5th star. Service is sometimes slow, prices are a little high, and none of the food is actually phenomenal. This is a basic diner with a big menu and drip coffee. \n\nPark Plaza is still a great staple in the area because of its late hours and classic diner food. Expect a typical breakfast combo (juice, coffee, eggs, bacon/sausage, toast, French toast/pancake) to run you 25-30% higher than at the typical cash diner you'd find upstate or in NJ or PA. That's probably because of the location. Last year's renovation made the place much cleaner and modern, but took away some of the old Brooklyn/outdated diner feel.\n\nIf you need a reliable place for corned beef and hash or a Monte Cristo but can't get into Bensonhurst or out onto the Isand, look no further. \n\nTip: you'll normally get refills on the iced coffee just like the regular coffee, so it's great for those who drink it black and forego the syrups at Starbucks anyway.", "author": "Courtney F."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Park Plaza Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "220 Cadman Plz W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/0zjK4v3ipM49Qj9I1DlfNw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965900"}