{"aggregateRating": {"reviewCount": 221, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-17", "description": "Had a terrible delivery experience. Burger was undercooked and fries were soggy. Delivery took 30 minutes longer than expected.", "author": "Gideon S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-17", "description": "Here for a birthday celebration. Everybody's vegetables were uncooked. How do you mess up peas? Very disappointed.", "author": "Christine P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-21", "description": "Horrible delivery service. I called after waiting 1.5 hrs (on a normal Wednesday) just to learn that they had not even prepared my food yet. Will not ordering again from this place.", "author": "na n."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-22", "description": "It's a diner.  I had a club sandwich and can't complain.  I'm just glad it is open late so I was able to curb my late night craving after drinking.  The decor is kinda 70s like, nothing special.  It's just so-so.", "author": "Tracy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-01", "description": "Excellent food.  Hipster free.  A place like this is surprisingly hard to find in Brooklyn.", "author": "Grand B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-10", "description": "Classic NYC Diner Experience.\n\nThe place is clean, menu extensive, and service extremely fast. Exactly what a diner should be. Go here for breakfast, lunch, or late night. Never a problem waiting or with the food here.", "author": "Chris K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-22", "description": "This place is convenient, huge (never a wait for a table), and cheap. it looks like it could be a set for a diner. they have all types and configurations of tables, one for every possible size group. many are booths, and they seat small parties at large booths when it's not busy - that always feels a little luxurious, even if you're sitting on a plastic bench cushion. \n\nThis place's best point in my opinion is that they have fantastic hot chocolate. It comes from a machine, and I don't know what they do to it to make it so good, but it's addictive. I usually wind up having two, even so far this summer when it's been 95 and humid. \n\nMy wife would probably say that her favorite aspect is that she almost never has to look around and flag someone down to bring here more coffee, they just come past with more all the time. \n\nI've come here maybe 10 times since the spring, after never going there for the first two years I lived in the neighborhood. I usually get breakfast food - had a couple omelettes, which have been decent (though not always exactly what I ordered - they've put raw mushrooms in place of the cooked portabellos I requested, and regular tomatoes rather than cherry; on the one hand, those are not listed as omelette toppings, but on the other hand they are listed as toppings/ingredients for sandwiches and salads, so why preclude their use in omelettes?). I've gotten some good croissants and some dry ones that were probably left over from previous days - hit or miss on that score. \n\nMy go-to is the monte cristo club - a french toast triple-decker with ham, turkey, and cheese. It's weird, they always use significantly more turkey than ham or cheese (I'd prefer a different ratio, but not trying to make trouble here). It comes with (good) french fries and (always, for some reason) two onion rings. It's a gut-busting sandwich, so I usually have half, and then finish off the fries and take the other half home for a later meal.\n\nMy wife likes the homefries (and the french fries - it's a pattern) and she is always eager to go here. I'm skeptical about the cleanliness - the last time I went, my menu seemed sticky. The neighborhood offers tons of diner options, but I have a feeling we'll be back here.", "author": "Josef K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-03", "description": "Classic diner... Vast menu, fast friendly service and well executed diner classics. We love love love this place, especially for a late weekend breakfast.", "author": "Sara G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-07-24", "description": "Average Diner, nothing to write home about. The eggplant spread is gross... Basic things like chicken wings and burgers are fine, but I wouldn't come back here to eat.  Service is very slow and not that great,  avoid this place if you can.", "author": "Tamara P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-19", "description": "It's a solid choice for hungry people who feel like eating on the set of Goodfellas (source needed).\n\nFor a diner, the place itself and the menu are both enormous. The wise guys who work there are friendly. There's a good chance that they'll make you an offer you can't refuse. Just don't make it their coffee....it tastes like tiger piss.\n\nBreakfast all day is a good call. \"The Big Mess\" is a tasty choice in that case.\n\nMaybe it was just me, but eating there always had me leaving in a bit of a food coma. My hunger was always....well, whacked.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-10", "description": "Finally. The perfect slices of challah french toast!! Well-done outside, soft (but NOT) soggy inside. This plus breakfast sausage = mega breakfast.\n\nA large space, very strange for NYC. Feels more like a truck-stop (without the truckers). Fast and friendly staff, rapidly becoming my sat-am go-to. Never been in for dinner or lunch - wil have to check it out!", "author": "Erik C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-04", "description": "I can't see this restaurant deserving anything more then 2 stars. It's a diner! That's what it's been for years, and that's what it is still. It still has the same quality food as it's always had. They thought by changing the name from diner to restaurant, and updating the decor, it might fool somebody.  Wrong. What it needs to do is cut that ridiculously large menu in half, focus more on the quality of food, and it might get better business as well as reviews. The only thing it has going for them is its late hours and delivery. I've been eating here for over 15 years and honestly nothing has changed, and it's sad. I've been holding off on this review hoping the food would change, but it hasn't, and I continue to find myself disappointed. On top of the terrible quality, they are also way overpriced. If happy days was closer I'd go there instead, and their food sucks too. Lucky for park plaza, they get my business because I'm too lazy to walk 3 blocks for crap food. The only reason I've given 3 stars is because of their quick delivery, and the massive variety of food they have, although I said it kills the quality of food having so many options, but none the less is convenient when you order delivery.", "author": "Jake S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-24", "description": "I ate at this restaurant for the first time yesterday and I was so amazed at the taste of the food, the presentation and how quickly it arrived. My boyfriend and I ate at the bar/lounge side of the restaurant and the area was clean, well ventilated and our waitress was so friendly. I began my meal with the loaded nachos and they use a mix of yellow, red and blue corn tortilla chips. This was the first restaurant that actually meant LOADED Nachos. They included an awesome guacamole, onions, peppers, jalapeños, chili, shredded cheddar cheese and sour cream, and a bunch of other things I'm sure I'm forgetting to mention. My boyfriend ordered the wings with the angel of death sauce. This was the first time he had ever gotten hot wings that lived up to its name. Since we went during happy hour the wings were 50 cents a piece. I ordered the grilled chicken Caesar salad and was so happy with the amount chicken they gave me. It was a large grilled chicken breast which covered the diameter of the bowl it was served in. The grilled chicken warmed the bed of lettuce so nicely. The greens were tossed in Caesar dressing, garlic and I'm sure grated Parmesan cheese. All there of these items left us with a bill of 27 which wasn't bad at all!!! I would surely eat there again.", "author": "La'Donnia P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-08", "description": "I felt like I was in my own rendition of Back to the Future.  Super friendly service, really cheap food, and 1980's wood/leather decor.  The food was fine (omelet, pancakes) but the service is really friendly.  I noticed a good number of families that were familiar with the staff. In this crazy city, it's nice to know that there are establishments that really connect and provide a service for their community.", "author": "Donna A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-16", "description": "Macaroni and Cheese- Ohhh, nooo. You do not make a bad macaroni and cheese. How is that possible? Mm. Don't order this one. Not a good choice.\n\nWarm brownie sundae- I have had this twice, actually. The first time it was so amazing that I just had to have it again. The second time they skimped me on two scoops of ice cream. What?? If this was a drug deal I would have shot Park Plaza in the face. You didn't think I was gonna count them scoops!?\n\nThe wild inconsistency (getting three generous scoops of ice cream versus only one, sad melted one) makes me very cautious about ordering from Park Plaza again.", "author": "Monica G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-07", "description": "Good friend of ours introduced us to this place late one night. Great place to eat when you're in the mood for... almost anything. \n\nThe menu is ridiculous. In addition to their 40+ breakfast options (served anytime), they also offer everything from paninis to burgers to braised lamb shanks to pulled pork. It will take you a few minutes to run through your options. Depending on your choice, you can get fed well for anywhere from $7 to $20. Not bad. \n\nI love any restaurant that gives you a small plate of noshes while you're waiting for your order. We got a plate with potato and macaroni salads, hummus, pickles and olives. Good on all counts. \n\nGreat place, great service and very cool old school decor.", "author": "Ed C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-08-18", "description": "Though the service at Park Plaza Diner was friendly and quick, the restaurant is in dire need of some repairs and updates.  The seats in all the booths are ripped and torn, making them unattractive to look at and uncomfortable when sitting.  The menu is large, as with most diners, and the desserts up front look delicious.  But there's just nothing making this place stand out.  I won't be back anytime soon.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-15", "description": "I am willing to admit, that we may have caught them on a bad morning.  I have to start out with the positive, the waitress, and manager were very apologetic and willing to correct any issues.  So, first things first:  my sister has been talking about how yummy the grill cheese is at the Park Plaza for two days.  She finally orders it, it arrives with a long hair peeking out of the cheesy center.  The waitress barely put the plate down, when my sister noticed.  Back it went!  The second grill cheese came out with American instead of Cheddar. Back it went!  The third and final grill cheese wasn't melted, but it was too exhausting to send it back.  So, the rest of us had no issue with our food...until...there it was, a piece of paper baked into my pancake! Ugh!  A million thoughts floated thru my mind, about the life that piece of paper may have had before finding it's final resting place in my pancake!  The manager said he thinks a piece of the bag fell in, when they added the mix to the mixer.  He did comp both meals.  Meanwhile my husband sat happily with his French Toast and Gyro meat.  I think I will pass on a return visit.", "author": "Natasha W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-07", "description": "Dear Park Plaza Restaurant,\n\nYou are my addiction.  Every weekend, I try to convince myself that I can survive without your crunchy and delicious fries and fried chicken.  I try to quit you, but I never can.   \n\nSincerely,\nHopeless Fried Chicken Addict", "author": "Alicia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-20", "description": "Typically diner in many ways, but rather not-New York. It's in its own freestanding building and is bigger than your usual NYC diner and it's a little more laid back, maybe due to the extra space. It's a good-looking room, especially if you don't mind throwback style (I sure don't). The staff is very friendly, familiar, and chatty especially if you sit at the counter; when I was there today I almost expected my waitress to ask me to cover for her while she went out to smoke (not that she did go out to smoke).\n\nTwo different ladies have told me this is a hang-out for Brooklyn-born gay guys. I haven't seen it, but there it is, an inside tip for you.", "author": "John S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Park Plaza Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "220 Cadman Plz W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/0zjK4v3ipM49Qj9I1DlfNw/ls.jpg", "@type": "Restaurant", "telephone": "+17185965900"}