{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "Love this place for lunch. My favorite thing to order is the Kimchi fried rice with beef. Hits the spot every time. My friend loves the japchae here... perfect place for a chill meal.", "author": "Steph S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-21", "description": "Definitely a place I would recommend friends to try at least once. Good attempt in Korean/western fusion cuisine. Portion size of the lunch platter is huge, well worth the price. Decor and service are top notch. Would definitely come back to try out more of the menu.", "author": "Edward F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-31", "description": "Going into this place I wasn't expecting it to be so amazing. I strongly recommend getting the rock shrimp and soy ginger and spicy wings as an appetizer and Bulgogi NEEDS to be your entree. I will definitely be coming back!!", "author": "Samuel W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-10", "description": "The food at this restaurant is not bad. They were short staff and disorganized.  I ordered a drink it took the waiter 15 minutes to get my drink. After, all my friends order came I thought my order will come after nope it didn't . The waiter  forgot my order and I was about to cancel my order. I end up taking my order home to go. The owner gave me 15% off my order because the waiter messed up.", "author": "Kathy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-23", "description": "Nice decoration with lots of lightings, delicious food with great service. Stir fried rice with beef is a must will definitely come again", "author": "Yn Nhi N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Love this place - the bibimap is super fresh, the space is super cozy and the staff always remembers me, am here about once a month.", "author": "Glenn Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Great atmosphere and the waiter was quick with the service. The food was also pretty good since I thought it may not be authentic. They also have a full bar so I may come back for drinks and for dinner.", "author": "Cathy W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "Loved the food here. It was quiet and we could talk and relax. It was good value for the kind of food we ordered, and they were very nice and quick to serve us. I am coming back as soon as I can to try more dishes.", "author": "James M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-21", "description": "I have never given a review before but I was so disappointed and upset with this place I wanted to help others avoid it. Don't be fooled by the aesthetics, this place stinks. My family and I were visiting NY and came across this place. We have eaten at many Korean spots in the past. It was a huge disappointment. The price was not worth it for the portion size. We ordered the galbi and got maybe 10 small pieces of beef. We also ordered the spicy pork. It came with 5 pieces of tofu and literally barely any pork. When I mean barely I mean 2 small pieces chopped up to bits and spread around. The sauce for the spicy pork didn't even taste good, it was super salty. Too expensive, small portion size, and less than average tasting food. We got there a little after 3 pm and there was only waitress serving. She was nice and all but around 3:30 a couple walked in wanting to be served and she turned them down because she had to go on break. She ended up taking her break right in the middle of the restaurant. Her and somebody else that worked there at pizza in front of us, very unprofessional. All in all I had a terrible experience and left feeling very upset. My whole family agreed. Never going there again.", "author": "Sala A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-21", "description": "This is a nice cool place to go to the waiter is really nice she made sure I was taken care of. For example my drink was type weak and she seen I wasn't drinking it and she looked at me and said what it's too weak? I'm like yeah so she took it and put more liquor in it . But the food was good the music is smooth, mind you it's 1:00pm. So you can definitely go here for lunch.", "author": "Emmanuel O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-05", "description": "Someone from the restaurant left a compliment on my last review, which was actually him telling me I was incorrect in some my information and asked me to remove the review. I do not want to harm business, so I removed. But good food and polite customer service doesn't change the fact I heard owner be cruel to servers. TIP IN CASH!", "author": "Charlie K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-20", "description": "If there was not him, I would not give them any star. My friends told me not to come here because servers are very rude, but I wanted to try their Korean food and came here with my friends.\n\nMy experience with Ssam was different. The only reason that I give stars is only because of the waiter!!!!!\nWe came here for lunch and ordered bulgogi quesadilla and Galbi stone bibimbap. \n\nWe waited for our food almost over 30 minutes!!!  It is not the only our table!!! The waiter kept saying sorry to us and other tables and I saw that he checked with the kitchen several times. \nFood was so-so, but rice wine he recommended was really good. They called it 'Makguli.'\n\nWe were upset in the beginning, but we felt better when we left. The waiter knew what we wanted and needed although we didn't say. He know the point. The way he talks was very polite and professional. The way he handle the matter was very professional, too. \nI should've ask his name but I couldn't because he was busy. I only remember he was wearing glasses. I will ask for him later if I go there again.\n\nJust one thing!! they really have to do something with the food!!! Atmosphere and service was really good but... Delayed Food was our issue.", "author": "Kate B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-11", "description": "Ok, Brooklyn. We've got some eating to do. Ssam has got to be one of the most underrated restaurants in this city and it's a shame because the food, service, (and prices!) are SO GOOD. \n\nI live around the corner from Ssam but only went in for the first time tonight because I assumed it wasn't very good given how empty it usually is. \n\nThe restaurant itself is clean and well-decorated. And I immediately felt welcomed by the staff. \n\nI ordered the bulgogi japche (clear sweet potato noodles with super flavorful and lean beef) and the spicy pork bibimbap. Both were stupid good and came with traditional Korean side dishes (A+ kimchi) and miso soup. My only complaint is the egg on the bibimbap was a bit overcooked. The yolk should just break open but they must have cracked it a bit too early before serving because part of the yolk had cooked. The tofu side dish was also a little off texture-wise, but now we're getting picky.\n\nAdd a 7 dollar lychee martini and a few on-the-house tasters and I was a very satisfied lady.\n\nI'll absolutely be back. Tell your friends! I want this place to stick around a while.", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-09", "description": "I love this place. It has amazing food and a great atmosphere. The Ramen is delicious, especially the pork belly, and so is the bibimbap. There is very nice calming music. And a perfect setting. Have a nice visit!", "author": "Linda Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-07", "description": "I just moved to Brooklyn in August and have been here three times. The wings are some of the best I've ever had, crispy and sweet. Order several things to try, including the kimchi fries. I promise you won't be disappointed. And the ambience? I can't wait for winter so I can escape the cold in here and order a piping hot bowl of soup.", "author": "Maxine C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-12", "description": "ummmmm I'm not totally sure how I feel about this place.\n\nOn the one hand, the price is affordable and the food is pretty inoffensive, but on the other hand, I feel like SSAM is suffering an identity crisis. Is it trying to be swanky with the weird neon lights at the bar? Orrr romantic and cozy with the booths and soft woodgrain decor?\n\nThe menu is equally confused with a myriad of japanese-american sushi rolls (and surprisingly only 3 types of korean kimbap) and a few other items that felt out of place. The wine list is pretty limited and it was also difficult to select something without actual bottle names and only descriptions + regional notes.\n\nOn the plus side, I thought the banchan offerings were modest but tasty, and our waitress offered to refresh them for us towards the end of the meal. It was a bit challenging to flag staff down from time to time but people were always warm and friendly once we were able to get their attention.\n\nThe real downer is the awful lighting - if they could fix the sort of off-putting fluorescent tone I think it'd drastically improve the ambience. Overall I think I would consider this place more for takeout (Netflix and Chill?! aaaight) but I wouldn't put up a fight if I was with a few people who really wanted to sit down. For Cobble Hill korean, it'll do.", "author": "Vicki L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-11", "description": "I really want to give Ssam a higher star rating - honestly their dolsot bowls were delicious and deserve 4 or even 5 stars. But service was messy and a lot of problems arose that unfortunately we're not so great. \n\nFirst, they forgot to bring us the appetizer we has ordered, a kimchi pancake. Our dolsot bowls (one with spicy pork and one with kalbi) arrived. One dish had a perfectly cooked soft boiled egg on top while the others was overlooked and hard - bummer! \n\nThe waiter must have at this point realized our appetizer pancake had never been made and he came over and apologized, giving us a different type of pancake than we had ordered saying it was on the house. Then he asked if we wanted some beers on the house. This was all lovely and made up for the slight mistake. \n\nHowever, when our bill arrived they had charged us for the pancake that was supposed to be on the house. Everything just seemed completely disorganized although our waiter was good intentioned. Because the food was tasty though I would give them another chance.", "author": "Sol C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-21", "description": "The food is amazing, service is great, environment is comfortable. This is a great place to come to with friends or family. Will continue coming here for sure!", "author": "Refa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "First time trying this place and it was a nice surprise! The bulgolgi bibimbap was great and the Korean pancakes were a nice starter. The staff was really friendly and I would definitely come back!", "author": "May T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-25", "description": "This place has amazing food and drinks! Good prices only down was it's a little loud.", "author": "Beauty Call N."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}