{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-08", "description": "I hate to do this. I hate to write a bad review. There are people who work at this place who I'm sure are fine, wonderful, and all-around upstanding citizens. This isn't about them. The service was fine. They were pretty nice. This is about the food poisoning I got from their gluten free chicken wings. \n\nYes, full-on food poisoning. Barfing and pooping all day the next day. Unable to eat solid food. Aching joints and headaches. The whole 9 yards. This may have put me off of fried chicken for months. Whatever you do: do NOT get anything chicken related here. I repeat: DO NOT get the chicken. It will make you SERIOUSLY ill the next day. Like: a full-body exorcism. \n\nThe fact that there's a sign outside advertising the 'gluten free fried chicken' is an absolute f**king joke. It's sort of like Sweeney Todd advertising cheap haircuts. Just because something is gluten free doesn't mean it's any good. And apparently the gluten free fried chicken will make you vomit for a full day the next day. At Ssam they have major issues with food preparation that NEED to be sorted out. I was violently ill from their food and I suggest you go to literally any other restaurant on Smith St. \n\nThis place used to be a really good sushi restaurant. Now it's a barely passable Korean BBQ place (with only 2 bbq tables). The sushi station is still there in the back just empty. \n\nSorry, guys. I haven't been that sick from food in probably 20 years. The service was fine, the decor half-finished, the food was absolutely horrific. There are so many other options on Smith to choose from. Do yourself a favor and stay VERY far away from this place.", "author": "Bart S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-01", "description": "Walking down Smith St. because I refused to take my 17 yo to Dalls BBQ's and came across this gem.  My son was sold, Salmon Teriyaki.  \nI had the Ginger Leominster tea, hot which was a hit for me.  We started with Edamame and then we were given some Banchan, Kimchi, potatoes, picked radish and not sure what type green vegetable it was but it was good.  There was this brown sauce and for the life of us we couldn't figure out what that was either but it was tasty!  His Salmon came and he couldn't stop raving about how good it was. It came on a hot plate in chunks with Brussel Sprouts, Carrots, Onion and Green Peppers.  I ordered Dapae Samyupsal hot plate too (BBQ Pork Belly) with Onions and Zucchini also, served with 3 leaves of Romaine Lettuce.  It also came with a small Soondubu (Mushrooms, Onions, Cabbage red broth) soup and she added extra Korean pepper to it.  OMG, OMG, OMG!  So good, we shared and still had leftovers to enjoy again tomorrow.  I will definitely make it back there again, so well worth it!", "author": "Deb C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-14", "description": "So I went here for lunch.\nPros\nClean place\nFriendly staff\nGood fried chicken wings\nCons\nVery dim lighting (I don't mind if it was at dinner)\nVery small menus\nBimbibop was not great they mix a lot of non traditional things in it\nNo bachan I guess fusion places like this would not have it\nKimchee is a staple but it was not good\n\nOverall if I'm really desperate than I'll come here for a somewhat Korean fix. But I will definitely go to Ktown or flushing instead.", "author": "Michelle F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-11", "description": "I'm Korean and I missed ddeok-mandoo-guk this year (it's the traditional dish for Koreans to eat on New Year's Day), so my sister and I had it today and it was perfect, especially with brown rice. The broth was savory but not too salty, the brown rice went well with it, and the ban-chan (side dishes) taste authentic. The staff is also very nice and I'm so excited for this first Korean restaurant to enter the neighborhood.\n\nMy sister has had the kimchi-jjigae and fried chicken, both of which she recommends.", "author": "Jeayoon L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "How did I not discover this gem earlier? \n\nFirst- the food.  Top notch.  Did the dol sot bibimbap with Kalbi.. with KALBI! Most places do it with bulgogi- but it tastes so dang good with kalbi. \n\nService and ambiance is solid.  Basically, when food is this good- you just don't want the service or environment to get in the way.  Check on both fronts.\n\nThe pricing is quite reasonable.  For some reason, Korean food in Manhattan has gotten a bit out of hand the last couple years.  Pricing here was very reasonable- i think the kalbi bibimbap was $16 pre-tax/tip.", "author": "John K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-27", "description": "I am surprised by all of the low reviews because I am a big Korean food fan and this place really delivers. We came for lunch but I'm sure the flavors are the same during dinner by the way lunch is a great deal. We had the kimchi tofu stew and the spicy pork lunchbox. Both were delicious kimchi is one the best we have had", "author": "Kathy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-09", "description": "All you need to know:\nORDER THE WINGS\n\ndoesnt matter what kind, or what sauce or how many....\n\nORDER THE WINGS.....\n\nalso remarkable service. I love to see a restaurant that has warm and friendly waitstaff. I am hispanic and have rarely ever had korean food. The waitress explained what everything on the menu was (and gave me a lesson in pronounciation) and recommended some wonderful items. \n\nWould definetely go back.... but once again\n\nORDER THE WINGS!!!", "author": "Nathalia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-20", "description": "The waitress was really nice and they have pretty nice package for lunch. If you review them on Yelp they also get you free drink! :)", "author": "Emily D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-10", "description": "We have gone here a four or five times since they opened.   When they first opened,  they had sushi.  I didn't mind the crossover.   They had some really original sushi interpretations, and I am disappointed that it's not offered anyone.    Also, their first menu had more to offer.  Korean dishes that you wouldn't normally find.\n\nSomewhere in the back of the kitchen is a chef who really cares about food.  We have always been happy with our meals.  I agree with the one reviewer who said the hot pots are too expensive.  If they lowered their prices on the basics,  they would be able to expand their menu again.   \n\nI would give this place five stars, but the service is spotty.   It takes forever sometimes to order our first drink.", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-06", "description": "This isn't real Korean BBQ, but since there are none near me in Brooklyn, this will have to do.  It looks like they are putting in 2 barbecue tables, so that will be neat-o!\n\nThis is also the closest place to me that sells solo, therefore I could forgo the $40 uber ride to k-town!\n\nWhen I come, it is usually because I am craving bibimbap.  Their hot stone bibimbap is ok.  Not great, lacks depth.  But, like I said, it will have to do.  The scallion pancake is not bad.  And the soup is pretty good.  My son is a fan of the spicy chicken, it is very spicy!\n\nThe side dishes (banchan) are few.  But my daughter is a fan of the broccoli.\n\nI hope this place gets better, maybe once the barbecue tables are ready?  I will, however keep going because, like I said, where else am I getting Korean in this part of Brooklyn?!?", "author": "Deb W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "WHERE IS THE STAR FOR GIANT HEARTS IN EYES?\n\nOh my god. Savory, crispy gluten-free fried chicken with your choice of sauces (or none). Perfect spicy kimchee tofu salad and other side-dishes. Hilariously giant portions of delicious french fries! Attentive, super-friendly service for our group, which included a small, messy baby. I didn't even get to the bibimbap, but everything I sampled from our table was crazy delicious. \n\nAnd did I say gluten free fried chicken? GLUTEN FREE FRIED CHICKEN. I've gotten sick after eating at several nearby restaurants advertising \"gluten free\" who were obviously just catering to the trend and not taking it seriously for people with celiac or a serious intolerance. Ssam appears to practice immaculate food prep, as several fellow GF friends can attest. I'll probably be eating here once a week at least.\n\nEveryone please eat here all the time so they thrive except not too much or I'll never get a table.", "author": "Erin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-24", "description": "New favorite Korean in the neighborhood. Cool new interior, great food and good service. I had the special cold noodles which hit the spot on this hot day.", "author": "Remko D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "I'm from Korea and I strongly recommend Seafood Pajeon and Kimchi Pajeon. They are even better than usual Pajeons in Korea. Also, others foods and drinks here are also awesome.", "author": "Boram K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "Great ambiance and cool space. Food very good and the staff is very friendly. Try the calamari (excellent ) and stone rice dishes. Excellent", "author": "David K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-08", "description": "I approached this place as an affordable Korean BBQ alternative to Insa ( very good instead). \nWell is not that affordable, way more expensive than any Korean Town place and not that cheaper than Insa. \nThe side dishes, usually many as the traditional Korean way, were just 3 small tiny plates for 2 people in a plate they presented a single broccoli florets with no condiments !! \nThe Kalbi bibimbap was average at best and the beef was not tender and well marinated. \nThe scallion pancake was thick and not fully cooked in the middle. \nSorry any Korean Town place has a way better Quality/Price ratio!", "author": "Andy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "I went for the first time tonight.  Finally decent Korean food in the neighborhood!  It didn't blow me away or anything, but was definitely what you would expect.  I had the hwe dup bap, pajun, steamed pork dumplings.  Pajun was on the small side but tasty.  Hwe dup bap was pretty good, had ikura on top and everything!  I didn't actually taste the dumplings but my daughter seemed to like them a lot :)\n\nAlso they were very aware/good with children, they gave my daughter an apple juice box right away w/ our waters without us even asking, and then some crayons and paper, nice gestures.\n\nI really hope this place sticks around!", "author": "phil a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-13", "description": "Very good place. Ended up here unexpectedly and had a good surprise. Very good food, fair price, great staff!", "author": "Felipe C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-04", "description": "I liked this place. Came here with my BF and his family because Ki Sushi opened later than they should have (they were running late they said) and we didn't want to wait half an hour (it was 5 pm and we were hungry). We were craving Japanese and saw that this place had both sushi and Korean food (I'm Korean, btw)! \n\nThree out of five of us had some form of bibimbop. I had the one that came with raw fish and roe and a bowl of it was only $16. We also shared rolls, apps and my BF got sushi/sashimi. Admittedly, the sushi was not on par with Ki, however, it is noticeably cheaper and the fish is certainly decent and the portions are generous. The bibimbop and pan cheon (only korean dishes we tasted) were tasty. \n\nService was excellent. We were the only table for the first 45 minutes though. The place does not yet have its liquor license (they said they were getting it in 2 weeks) but after some urging by our party, they let us BYOB! We bought a bottle of wine a coupla stores down and the waitress was gracious enough to provide us with wine glasses. \n\nWill definitely come again.", "author": "Haj da P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "The wait staff was very helpful and accommodating. Haven't tried the food yet but will update. Very casual vibe just passed the busy section of town. Looks like it would be a good lunch place and a nice, quiet dinner spot.", "author": "Sal S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-04", "description": "Nice Korean Place on smith st. It's surpising taste for fried chickens. Chickens are sweet and well deep fried. Bibimbob is a good portion with lots of vegetables. Sushi is little disappointed. But the presentation was very nice with stylish dishes. Other Korean dishes are decent and good size. Kimchi Pajun was just right spicy. Jabchae was sweet and chewy. Service was very nice. Everyone was kind.", "author": "James K."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}