{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-06", "description": "Hmmm, the food really is only 3 stars but I will most likely go back.  It is walking distance for me.  Sigh, must I go to Manhattan and Queens for good Korean always? The chicken wings were ok, my husband enjoyed his bibimbop, and I was ok with my tofu stew broth (don't order the seafood one like I did, because fake crab meat is not seafood!)   Good service!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-06", "description": "First time here at Ssam Korean Bistro. The workers are very polite and tend to your every need. The portion of the food was large and delicious. The lunch special is affordable and the setting/atmosphere is very pretty and comfortable.", "author": "Jess L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "The drinks and food were so amazing. I recommend the spicy beef ramon. The service was fabulous and the atmosphere was perfect for a good dinner.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "It was my first time here and we had a wonderful time. The restaurant is newly renovated and has a nice ambiance to it. Three different servers helped us throughout our dinner and all were very friendly and helpful with recommendations. For starters, we had the crispy chicken tenders which has a delicious sauce, sesame seeds and a great crispy texture. We ordered the prime gal bi entree which was OUT OF THIS WORLD. The meat was so tender. It comes with lettuce to wrap it in with stir fried veggies and rice. It's a must order!! We also ordered the Je yook dolsot (pork shoulder bibimbap). It says that it is spicy, but I think it's only spicy if you add a lot of the kimchi sauce to it (given on the side). Make sure you mix it up when you get it or you'll end up with a nice crispy layer of rice on the bottom (kind of like socarrat in Spanish paella-but maybe that's your thing! Just an FYI) for a refreshing drink you should also try a Hite beer (pretty light beer) and even mix it with soju if you're feeling daring - just like how they do in Korea. Overall great experience. We will be back!", "author": "Amara B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-08", "description": "Great soy garlic wings and stir fried noodles!  Atmosphere is comfortable and family friendly.", "author": "Peter F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-12", "description": "The food was mediocre at best. \nThe service was horrible. Lady kept bumping into me. \nWhys this 4 stars?\nChicken wasn't even fried Korean style everyone wants.", "author": "Benjamin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-08", "description": "A pretty restaurant with roomy tables, big enough to accommodate all the yumminess Ssam has to offer.  The bibimbap is the star, but the beef short ribs on the table next to me looked pretty darn good.  The hot sauce makes everything taste even better and the kimchee is addictive.  Friendly service pulls it altogether, topped off by prices that won't leave you gasping.  Ssam is now on my rotation list of places to dine.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Best service ever. Food was very delicious. Best food ever. The teriyaki chicken was very good and so was the bento box.", "author": "Miracle P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-02", "description": "My favorite Korean place in Brooklyn!!! Everything is yummy and made from the heart. Staff super nice and the place is big and spacious..as well as warm ambiance. Love it!! Will definitely be back soon:) and thank you always for such a warm welcome!", "author": "Bernard S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-27", "description": "Great local Korean spot. Service was great and the food was authentic. The fried chicken was tasty also. Can't go wrong here if you are having a Korean craving.", "author": "Phill N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Great BBQ - loved the sake and appetizers ! Great service - friendly, helpful and patient with us!", "author": "Pooja K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-18", "description": "Korean gal here, giving this place 5 stars because we need to keep it in business! It's K-town level good, at least for their dduk mandoo guk and kimchi.\n\nI had come here when they first opened last year -- it's improved a lot since then.\n\nImprovements that could be made:\n- More varieties of banchan\n- Better music\n\nThe service was wonderful and the prices are totally reasonable. PLEASE eat here so we can keep a real Korean restaurant in Cobble Hill/Boerum Hill.", "author": "midge j."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-25", "description": "Let me just say what a terrible experience we encountered. We had to get the attention of the bald headed waiter so many times only to have him disappear after telling him the first dish and were wanting to order more. Called  (the bald headed waiter) back again and clearly he was not having it. Why would you hire such shitty waiters who have such a terrible attitude? we ordered lychee martini and it was the worst mix ever. It was totally bitter and filled up with gas. -___- Sent it back only to have the waiter cussing at us with his colleagues. (Yes I speak korean). \n\n\nThe service was so terrible but the kimchi pancake and kimchi fries were good. The bald waiter didn't even come back to take our order for the main course!!!! We were the only customers at the restaurant at the time. The management definitely needs to do something about the terrible customer service!!!!  hire nicer korean waiters without a terrible attitude.", "author": "Rebekah R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-30", "description": "My first visit to SSAM was about a month ago. I got the beef bibimbap and it was incredible. The bowl was audibly sizzling and all of the food was hot and perfect. Crispy rice, fried egg. I dreamt about it but didn't feel justified spending $15 on another bowl without occasion.\n\nI went back to treat myself tonight and when my food came out about 5 minutes after ordering I had my first concerns.. That was too fast. Then I realized that the bowl was quiet. No popping and sizzling. \"Be careful its hot.\" I felt it and it wasn't. \n\nWhen I started to eat I realized that some bits of veggies were hot but most were lukewarm or cold. The egg was undercooked. But most offensive in my opinion was the rice. It was completely lacking any crisp, sitting in a puddle of lukewarm oil. I tried so hard to enjoy it, after all I had been looking forward to it all day. But with every bite I was more disappointed. Finally, when the employee asked how it was I told him that I was disappointed. That it was better last time. I showed him my bowl of oil, explaining that the soggy mess was completely underwhelming. He froze and stared at me, trying to figure out his next move. I was embarrassed, I have never ever complained about my food before at a restaurant. \n\nBut what was more embarrassing was his half hearted mutter of an apology and a complete lack of anything else. He didn't say anything else to me until asking if I was ready for the bill- or did I want to order a drink first? I was not discounted or compensated for the soggy shit bowl in the slightest, nor did anyone offer me a new one. \n\nYou guys ruined my treat to myself on a night I really needed it, driving me to write my first ever yelp review. Not out of anger, but out of sadness. \n\n(The second star is for the first time I visited)", "author": "Teagan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-09", "description": "Better space since they redesigned it. Food is solid, not much competition in the area. Deducted points for their hideous delivery. They use a big third party to take the order which charges a fee but is very user unfriendly and I can only succeed in making an order half the time I try. I went so far as to call their tech support today but it's just not worth the hassle.", "author": "Derek D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "If I could review this place 10 times and give it a 5 each time I would. Service was very homey. Gina is so nice. I speak a little Hangul and she speaks to me and I appreciate that. The food is sooo good. Just as good as Korea Town or better at most places. It's unreal why people don't give this place 4 stars minimally. The cocktails are great. The soju is normally priced. I will never go to Korea Town again for \"gui\" (Korean BBQ). Ssam is it.", "author": "Akeem J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-01", "description": "They have amazing steamed \u0026 fried dumplings. WOW!! Great food \u0026 Location!! The Staff was so friendly and accommodating. We walked in from the heat and they turned the air down to cool us off", "author": "Jenifer W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-13", "description": "Nice Korean spot not far from my work. Great lunch special deals, excellent friendly service. Would recommend it for others to check out.", "author": "Felix K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-01", "description": "Came here twice. My wife is Korean and so I have eaten Korean food in K-Town and in Korea more times than I can count. Food is excellent. I don't understand the low reviews but the owner did tell us that they had made some staff changes recently, so maybe I'm getting the benefit of a new staff or kitchen?\n\nHad several items - fried chicken, tofu soup, bulgogi beef, and bibimbap.  Ate at one of their BBQ tables the previous time and that was very good. Many free sides (banchan) and ssam lettuce wraps for the bbq. There were two bbq tables which are like those in k-town.\n\nOne tip, fried chicken takes extra time to prepare so if you want it, order when you sit down.  This is a welcome addition to Brooklyn as an authentically Korean restaurant.  Will be coming back.", "author": "Frank F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-21", "description": "Bibimbap was absolutely amazing. The staff were very friendly and attentive. Would definitely come back.", "author": "MJ E."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}