{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "Ssam is excellent Korean food.  The favors are authentic, but not too heavy.  We had some wings, a seafood pajeon, dduk mandoo guk, soon doboo jigae and grilled spicy pork shoulder.  Everything was delicious!  Service was good and we felt the portions were in line with the prices.  We're already planning our next visit!", "author": "Be R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-01", "description": "Sushi was great however when you are on the couch with food poisoning from undercooked chicken kind of difficult to recommend this place. There are off nights at restaurants but brand new to the neighborhood, not off to a good start.", "author": "Matthew R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-20", "description": "Finally a bonafide Korean restaurant in Brooklyn.  But the food is only ok.  Had the kalbi lunchbox and the meat portions were good.  But somewhat skimpy with the banchan (side dishes).  Would recommend if you're looking for traditional Korean food, but don't want to schlep all the way to K-Town or Flushing.", "author": "Michelle P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-21", "description": "Went here because I was craving soft tofu soup. The pot I got was okay, but pretty tasteless and way too heavy on undercooked onions. Given the quality, the $11 price was excessive.", "author": "Prentiss M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-01", "description": "I really wanted to like this place! There is such a need for a Korean place in this  neighborhood and surrounding area so the right place could really kill it. But the service was very bad and slow, and the scallion pancake was undercooked and not good. We actually had ordered the seafood pancake but the waitress brought us the scallion instead. We didn't bother complaining cause we had been waiting like 40 minutes for our food! The wings were good though. It was only a few days old so hopefully they have worked out their kinks. I will go back again to see if they have improved and hopefully I am not disappointed again.", "author": "Sandy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-13", "description": "I don't like hyperbole, but two days after my dinner here I am still in a culinary fantasy, and I described the food to a friend as \"blindingly yummy.\"  After the flavorful miso soup and crunchies (potato, pickled radish, and wildly good daikon) my pal and I had the brussel sprouts with pork belly -- delicious, sweet, crunchy, and salty -- as an appetizer, then shared the tofu hot pot with spicy pork, a wonderfully balanced dish with the quiet tofu offsetting the deep spices of the pork, and we also had very flavorful yet not greasy bulgogi, wrapped in lettuce leaves.  The food was rich in texture and flavors, full of colors -- irresistibly satisfying, enough to make a suburbanite plan a trek to Smith Street again soon.  And the service!  Wonderful caring but never obtrusive service -- kind explanations as well as food-hustling -- from JOHN and O'NEIL.  I can't wait to come back again.  Lovely!", "author": "Michael S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-08", "description": "i was so excited when a Korean restaurant opened in the neighborhood. We've eaten here a few times and it was fine, not great but fine. Where things really fall apart is when you try to order delivery from these guys. They are either really sloppy or just don't care. I guess if they can't see you you're not a real customer. We have ordered from them a few times - every time things were left out, we then have to call back and wait and wait for the missed items to be sent out. Tonight was the last time we'll be ordering from SSAM. Once again my bibimbap was sent without the sauce, the order of fried chicken was incomplete and didn't include the sauce we asked for. Plus no banchan, that's happened before too. I called back, they asked me twice to list everything that was missing and promised they were sending it all right out. 15 minutes later the delivery guy shows up with sauce, that's it. I'm so over this place, they are completely incompetent and apparently are not interested in making it right when they get a complaint. This is Brooklyn - you can't possibly think you can survive with that kind of customer service. There are amazing restaurants around here with top notch service.", "author": "Dena F."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}