{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-23", "description": "As a Korean that grew up in Seoul I must say this place is pretty good  they also give you a lot of side dishes also it's a decent place for kbbq not as good as the other ones in flushing but I find myself always taking my foreign friends here first when I want to introduce korean food to them", "author": "Grace K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-03", "description": "Happy to see a Korean restaurant in the neighborhood.  \n\nWe had the bibimbop, pork bulgogi, the kimchi pancakes and the fried chicken.  Everything was tasty - especially the sauces - and the banchan was good and plentiful.  \n\nHowever, the prices were steep for the smallish portions ($20 for the bulgogi).  I hope they can either lower their prices or make the portions larger\n\nAnd unfortunately, the fried chicken's flavor cannot yet compete with Ganso or Dassara.  \n\nTo be fair, they've been open for a very short time.  \n\nI hope they stick with the traditional Korean menu, find the right pricing for the portions, and improve their fried chicken.   \n\nWe need great Korean food in this part of Brooklyn!  Welcome!", "author": "Michael A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-27", "description": "Best Korean food ever. I went there for unlimited chicken wing and Beef Dolsot. The food, the service was excellent and the atmosphere was warm and comfortable. Sure I will visit them again.", "author": "Kent P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-19", "description": "Eh, it was OK. \n\nI have to warn you, this was my first experience with Koren, but I was with a group that was very familiar with the cuisine.  \nThe food had it's ups and downs.  They served a selection of complimentary mini apps to start...kimchi, sweet black beans, etc and they were OK.  For an app, we got dumplings and the scallion pancake.  The scallion pancake was my favorite thing of the evening.  We all got Hot Stone Bibimbop, with different mix ins.  It was OK, a little bland (this was the group consensus).\nOne of the most disappointing things was the wine selection, it was a short list and very low quality wine.  \n\nThe service was also not super.  Attentive at first, but M.I.A. the rest of the meal and the restaurant wasn't that busy.\n\nI will definitely try Korean again, but probably not at SSAM.", "author": "Nicole P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-22", "description": "Mixed feelings about this place like some of the other reviewers. So it basically comes down to what is important for you in a dinner. \nNice open space plenty of room for everyone. The host/waitress/bartenders..all super nice but slow. If you don't constantly make an effort to communicate your needs.. like ordering.. you will be sitting a long time waiting. Which we did, despite there being only another couple in the restaurant when we were there. My friend and I ordered dirty martinis --as they had a full bar. The bartender brought out some gross concoction which did not resemble a dirty martini in the slightest. I sent the drinks back. He was then shown how to make a dirty martini.. which came to us VERY dirty.. like sewer dirty..and stinky..and did not taste good. Because we had issues they only charged us half price. \nThe music was rap/hip hop and very loud.. which I enjoy in a club, but not so much when I'm trying to have a nice Korean dinner. \nThe traditional Korean appetizers were few and were not that good. If you go to Korea Town in the city, you will get at least 6 bowls of yummy whatevers including delicious kimchi. Last night they gave us 4 bowls of ok stuff and the kimchi was not good.. it was overly salty instead of tangy.\nBUT and there is a big BUT, we had ordered the sizzling meat stone plates..and the meat that came out was absolutely superb/devine. \nI had ordered the Bulgogi and my friend had the Kalbi (beef short rib) I believe. The rib was one huge rib and the waiter cut the rib meat for her with scissors into bite sized portions. \nBoth were wonderful. \nAt the end of the meal they gave us mason jar glasses with delicious cranberry juice. That was  a highlight for me since I didn't get to enjoy any alcohol. \n\nSo there you have it. Drinks and starters meh... meat: 5 stars\n\nIf you do not go there with high expectations.. or any expectations for that matter.. you will have a good meal. Bring a positive attitude. Would not recommend for people with nit picky attitudes and no patience for people who don't speak English.", "author": "Darya K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "I'm giving this place 4 stars, as much because its the only Korean in the nabe as I am for the food. Both my wife and I agree that its not the most glorious Korean food in a city where K-town is but a quick F-Train away, but its more than acceptable... quite good, in fact. Bibimpaps (an impressive variety) are more than decent and reasonably authentic tasting. Their Korean pancakes are excellent -- crisp, not greasy, well seasoned. Bulkogi comes sizzling and is also well marinated in the typical garlic, soy, sesame deal. Stews are bubbling hot and have a fiery pepper base -- tho at $16.95, the portions of protein were scant -- mostly cabbage. As others have noted, the banchan need some work. Cucumbers and kimchee are limp, a bit bland and the rest are generally uninspiring.\nService is always friendly and the place itself is nice enough -- not the typical Brooklyn table-on-table affair where you wind up dining with strangers (not that that's always a bad thing - depends on the strangers). Tho I must say that I find the too loud pop rock/rap music to be annoying. Seems incongruent with what the place otherwise wants to be (jazz, softer rock anyone? Even some Korean pop music might feel more appropriate. Okay, never mind - stick with jazz).", "author": "Barry P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-03", "description": "The chirashi-style bibimbap is delicious. It's a big bowl of warm rice topped with diced sashimi and flying fish roe and served with a sesame chili sauce on the side. At $16, it's very fairly priced for both quantity and quality. I ask them to hold the lettuce because I don't like cold lettuce on warm rice. \n\nThe fried chicken is meh. Very sweet, very sticky. When we went, they were serving full-sized drumsticks instead of the traditional drumettes. Which means you get a huge portion of chicken for the price, but I find it unappealing. Korean fried chicken is best in small bites. A whole drumstick in such a sweet sauce is overwhelming and unappetizing.", "author": "Lindsay B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-16", "description": "Our appetizer was apparently delivered to the wrong table, sat there for 15 minutes... and when we inquired about our missing app (after our entrees came), the waitress decided it was sanitary to give us the order that had been sitting out at the other table. I asked her to please take it back, which she thankfully did. The food was good, but the experience makes me question the hygiene and general habits of the place. If I were the owner I'd want to know about that experience. Wouldn't go back as a result :(", "author": "Mark F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-28", "description": "Ssam is a nice addition to the area.\n\nThe dining room is spacious, clean and not overly jammed with tables.  The room is somewhat dark, but not oppressively so. The staff are affable and generally congenial.\n\nThe menu is rather large, but what comes from the kitchen is well prepared. The wings are quite tasty, as are the bibimbap offerings. Of the usual Korean condiments placed on the table (banchan), most were decent. Though the pickled radish with black sesame seeds was dismally bland and possessed of a mushy yet grainy texture that was rather unpleasant.\n\nWhere Ssam falls down is in the service. Though very friendly, once our entrees were on the table, getting someone to notice us for refills of our water glasses required flailing about like hailing a cab at rush hour. Speaking of our entrees, the timing from the kitchen was rather poor, as our entrees arrived at the table about 30 seconds after the appetiser.\n\nIdeally, though, these are things which can be easily corrected with a little more time and attention as a new restaurant works out it's kinks.", "author": "Adam G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-12", "description": "I'm not well versed in Korean food, but it was tasty and hot. The service was also impeccable, waiter was super nice and made good recommendations.", "author": "Liz L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-26", "description": "Favorite bibimbap in Cobble Hill! Spicy pork is the yummiest!! We ordered seamless and the delivery man accidentally dropped it off at wrong address (we share the building with a business so it happens a lot) and he fixed it quickly and we had a yummy dinner of Ssam at home! He was so sweet about accidental deliver would definitely order from here again!", "author": "Margot S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-27", "description": "Our first clue was the empty restaurant on a Saturday night. The second red flag were the three tiny banchan (Korean side dishes) that came out. For me, one of the best parts of going to a Korean restaurant are the awesome accompaniments- including a wide variety of side dishes, which is nonexistent here. The second best part of going to a Korean joint is cooking the BBQ on a sizzling coal fire, which they clearly didn't have here. They have a glass ceramic stovetop thingy, which our waitress suggested we don't use because the meat doesn't taste as good as having it prepared by the kitchen. Alrighty, then....\n\nThe food itself was mediocre. We ordered the bulgogi japchae, kimchi stew, short ribs, and kimchi fried rice. All the portions were relatively small compared to portions you get at restaurants in Koreatown. The japchae was probably the most disappointing-- it lacked the most flavor. Overall, it was a less than stellar experience, and I wish we just drove the extra 20 minutes to Koreatown for an authentic and flavorful meal, specifically Seoul Garden.", "author": "Anna T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-08", "description": "Finally a possible success in this jinxed location. Could this possibly be the Korean equivalent to Joya on Court Street?  It has the potential and I certainly hope so! I've eaten here three times and each time the food has been amazing, granted I've only tried the hot stone bibimbap, but it is so good. It comes served with a miso soup and three small appetizers.\n\nIt seems the restaurant is still working out many of its opening kinks, but they are making progress: however rather slowly. They've opened up the front so you can clearly see inside the restaurant which on weekends is full, a good sign. Service has been sporadic, it seems an easy formula:\n1.  Seat customers, provide menus, offer still or sparkling water, and take drink order.\n2.  Explain the daily specials, and take food order.\n3.  When serving the appetizers, explain what each item is. \n4.  When serving the hot stone bibimbap offer a strongly worded caution about the hot bowl. Add provide tips on how best to eat.\n5.  Stop back at the table to inquire about the quality of the food, take more drink orders and refill water frequently. \n\nEach time we visited the wait staff has hit on some of these basics but not all. Training is definitely needed. Lastly, the bibimbap seems a bit expensive ($16) considering it is just a bowl of vegetables with an egg (unless you get a meat add-on); if I were the manager, I would reduce the price 25% which would probably increase customer volume and revenue substantially.\n\nI'm keeping my fingers crossed that this restaurant is a complete success. Give it a try!", "author": "Donald N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-30", "description": "First, I waited 45mins for the seafood pancake, yes this seafood pancake only have 2 dices of octopus, and a few of fake crab meats. The octopus is like chewing a rubber.Absolutely horrible !! Then I waited another 10 mins to for the noodle, I can smell the sourness before even trying it. Two bites and I'm done with it. I can't eat it any more . The kimchi fried rice is okay. Korean BBQ bugogi, shouldn't be bad right , guess what, it came out ster fried thin slices beef !!! I will never come to this place ever again. Not like I'm sitting at a corner , but no server come to our table. If u tried korean food at korean town at midtown . I totally don't recommend this place. If u never had korean. I guess u can try it . Wasted money and time on a Friday night !!!!", "author": "Peggy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-10", "description": "Delicious food! Tried the Kimchi Jigae. Very flavorful.", "author": "Rosanna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-17", "description": "First time having Korean! It was good indeed. The service was GREAT. Super friendly and helpful. They gave my boyfriend and I suggestions, as well as on the house veggies. I had the sweet potato pasta from the appetizers, they were gooey and interesting haha. He had the kamchi rice. Def coming back for the meat.", "author": "Abigail G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-27", "description": "Overpriced. Kimchee chigae had two sad pieces of tofu and dry cubes of flavorless pork. Only thing that was worth the price? Japchae maybe but just so darn overpriced. Paid the idiot tax again at what we thought could have been decent Korean in Brooklyn. This place makes the H Mart food courts in NJ worth the drive. Even Woorijip is worth the mini trek into MH.", "author": "Melanie V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-11", "description": "A stow away place located in what they now call Restaurant row on smith street.  Nicely open and spaced the decor is light well.\nI started with the sushi salmon rolls which were pretty succulent. I chose to shy away from the traditional dishes and go right for the fried chicken Korean style. My dish consisted of the mix of drumstick and wings which was fried deeply. The chicken was somewhat tasteful but needed a traditional spice to add some flavor. I chose to add some Soy sause to infuse the chicken and bring out more taste. Over all I was would return just to try more items on the menu.  \nNext stop will be the sexy bar.", "author": "Robert J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-22", "description": "Let me just start by saying, I did not have a Yelp account prior to finding this place. This restaurant is FANTASTIC! I decided to create a Yelp account because I had to leave a review about this place. Jay, the manager, is one of the nicest restaurant managers I have ever met. Very seldom do you meet people like this in the city that understand how to make customers happy and keep them coming back.\n\nThis place is a gem for Korean food. I have had the scallion pancake, korean fried wings, bibimbab, spicy stir-fry noodles, and much more. All of it is is just as good as the Korean food you will get in ktown in Manhattan, but at half the price!\n\nI will be going back (on a regular basis) and hope to show my Manhattan friends what good Brooklyn Korean food is about!\n\nStaff A+\nFood A+\nAmbiance A+\nBar A+ (Especially their happy hours!)\n\nYOU MUST GO HERE!", "author": "Sunil K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-07", "description": "Great place.  Great people.  Jay is the man. Thank you for the way you treat others.  Wonderful drinks and food.  Recommend if you want a place that makes you feel special or want to impress others. Everything is worth it.  Happy hour is great", "author": "Marty R."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}