{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "This place is awesome \nSpecially kimchi jigae  is original Korean traditional taste \nAlso I like  hot bibimbab", "author": "Kenny J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-22", "description": "Love this place and it's Saturday and empty!!!!!\nPlease come and support this restaurant! They deserve more business.", "author": "D E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-08", "description": "When I had heard a Korean restaurant opened up in the area this past summer, I thought to myself, \"oh that place is going to absolutely KILL! No Korean places around here at all, so this should prevent people from traveling to K Town.\" Fast forward to last night's dinner. \n\nI'm so disappointed. Without the sign that has the single Korean character on it, you would have absolutely no idea that this was a Korean restaurant. Too Brooklyn Heights and too generic in its layout and idea, Ssam really missed the mark. Even sitting in a booth, I couldn't tell I was in a Korean restaurant. Here's my thing: I believe all of the people who love Korean cuisine want to have it in the traditionally authentic Korean atmosphere. It lends credibility and it gives you the impression of \"I'm going to get some good Korean food here.\" Instead, SSAM gives you a \"why is this menu in half English and half Konglish? Why does it feel as if I'm sitting in a Bareburger with a bar? Why does this massive establishment have only two (3 maybe) bbq tables?\" vibe. \n\nI had the rice cake and dumpling soup (dduk mandoo guk - $11) and my friend had the stone pot bibimbap with beef (dolsot bibimbap - $13+2 for the beef). I can live with the prices. Couple of dollars higher than what I've grown up with in Queens but fine, rent here is absurd. \n\nMy soup really wasn't bad. I slurped up every last drop. Steaming hot and hearty, there's a reason this is my all time favorite Korean comfort dish. The bibimbap. Served in a warm stone pot. With nary a sizzle. Why bother serving it in a stone pot if you aren't going to cook it in the stone pot? Also: what's with the 1/3rd serving of rice? Seriously, it was about a third of what every other Korean restaurant everywhere else gives you. You charged $15 for a fried egg, vegetables and beef that just happened to have some rice in it. \n\nThe side dishes (banchan): broccoli in sesame oil, yellow daikon radish, chonggak kimchi, and an odd rice wine vinegar (I think) sliced carrot thing. End scene. \n\nThe staff was very friendly and was quick to re-up the side dishes (after I asked) and to bring my friend the miso soup that's supposed to come with the bibimbap (after I asked.)\n\nI'll give them the benefit of the doubt considering the owner was conferring with the designer/architect/decorator in the front, but I won't be back until many fundamental changes are made.", "author": "Hooney H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "It's a hidden gem in Downtown Brooklyn and Cobble Hill area. There's a lot of restaurants here but not all asian food here are great. SSAM is even better than a lot of the stuff I had in Korean Town. Will come back and recommend to others.", "author": "Yuan L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-20", "description": "What can I say, I shouldn't even write this review... or maybe I should. A disaster of an experience, but it left me without words for months, and now I'm writing about it.\n\nWent in on a quiet weeknight, maybe 3 tables occupied. Ordered 2 dishes, Bibimbap and Fried chicken. Bibimbap was on the table in 10 minutes.\n\nAfter about 30 minutes of stalling from the server and possibly the owner, my chicken was still not done. Now, I should follow this up with the fact that the menu states it will take extra time for an order of chicken wings to be prepared. Not great, but I accepted that part.\n\nHowever after some time, maybe 30 minutes, they admitted to screwing up the order. 15 minutes after this, almost an hour at the table with no food for myself, they sent out the chef to apologize,\"We made a mistake, and are almost done with your wings.\"\n\n10 minutes later, still no food, so I asked for them to go. \n\nFinally got my to-go bag, brought them home, took one bite and threw them away. They were absolutely disgusting. Fortunately they were kind enough to not charge me for the wings.\n\nAfter all this, I thought I had lucked out because I ordered rice with the meal, and assumed it would be in my bag -- which they conveniently forgot to include -- so I had nothing to eat that night.\n\nIt was almost 10pm at this point, so I just drank beer and went to sleep hungry. Good times!", "author": "Ian J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-25", "description": "I give the service a 2 out of 10. They were very pleasant but the restaurant is very understaffed, but it was only a Sunday night. The Korean dishes were authentic, but nothing outstanding. The pork belly ramen was bland and the noodles were over cooked. The Korean fried chicken wings were crispy and delicious but the spicy wings, were not spicy at all, and I lika de spice!", "author": "Ria B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-20", "description": "Not a happy camper.  I came here in December and immensely enjoyed the Korean fried chicken wings, 6 for 9.99. Vowed I'd be back!\n\nSo today, there's no A/C. And big ass fruit flies.  And after a 20 minute wait my wings were delivered, except wait, there's only one wing on there!  I said to the pretty hostess \"umm I ordered wings?!\" To which  astonishingly she replied \"oh we are out of wings, is drumsticks not ok?\".  Well do I have a choice?  I guess I do, get up and walk out, but I say \"you should have told me and given me the choice\". I'm pretty sure I was glaring.  \n\nAnd yes I was hungry and I ate them all, no sauce.  Piping hot, super crispy, moist meat inside.  But I don't like the bait and switch action, not at all.  Not at all.\n\nIn her defense, she poured me a hefty second glass of Sauvignon Blanc. Drown those sorrows and anger!  Ok. \n\nBut there's been maybe ten people in here since I've been here.  I hope they hang in long enough for me to have another wing.", "author": "Lisa V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-22", "description": "Food overall has great seasoning, staff is very friendly and this establishment is very nicely decorated.\nRating not 5 stars because although staff was friendly and kind we had everyone waiting on us and this brought for slow service. Chicken came out before appetizer and we waited quite some time for both- wasn't terrible because we had delicious soup to keep occupied. Food portions were generous. My favorite items were the scallion pancake which included carrots and zucchini cooked inside of it I want to say and the garlic soy fried chicken breast was very moist and crispy. Bulgogi was also good slightly spicy and served with rice and lettuce for wrapping.\nThere was music playing, and tv at the bar, booths were available and it seems two tables have the function of cooking on the tabletop.", "author": "Natalie R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "We randomly stumbled upon this place and it was a great find! Warm and cozy ambiance, and a lot of authentic dishes with just the right touch of fusion!", "author": "Justin M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-12", "description": "Nice interior. Food has much catching up to do. \n\nThe fried chicken appetizer is decent. Unfortunately the appetizer trumped my bulgogi entree as well as my three other friends' entrees. \n\nOne word... BLAND. The chef needs to utilize the salt. My friend's side of Korean hot paste was not enough to make her dish appetizing. A bit pricey for inferior food.", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-08", "description": "Out of the many Korean restraunt I've tried this place was a disappointment. The food wasn't that great.", "author": "Meini C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "Wonderful smelling restaurant. The environment is cozy and not too loud. They played country music when we came, but I could hear my date and it was a warm lighting.", "author": "Kat H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-18", "description": "I came to SSAM with my friend, both of us recently came back from Korea. We were looking forward to a delicious traditional Korean meal. SSAM provided us with that experience. The waiters were friendly and the food was outstanding, delicious bulging. I highly recommend this restaurant, we had a great time.", "author": "Amanda B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-03", "description": "Randomly found this place on our way back from the transit museum.  The cocktails are AMAZING and super affordable for New York City.  The boneless soy wings are also great!!!  Service was very efficient and food came very fast!", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "Great time! I'm not terribly familiar with Korean food, but I but everything I got here was amazing. I especially loved the crispy chicken appetizer - spicy, sweet, and delicious! They also apparently renovated recently and the place is beautiful. The woman that served us was very kind, friendly, and attentive. I'll definitely be back.", "author": "Ron L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Bo ssam was very tasty! The white kimchi had a nice flavor and the pork belly was tender. Good service too.", "author": "Stephen N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-10", "description": "Tried Ssam for the first time a couple weeks ago.  The Korean fried chicken is a must have in 3 flavors, similar to better known BonChon.  The kalbi and pajeon are tasty.  Sushi and ramen are decent too.  Cobble Hill needs a good Korean restaurant and this may be the place.", "author": "Wailana W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-14", "description": "We are very, very limited on Korean food options here. SSAM has some good variety and has a full bar and huge bar area. It is a huge place. I also saw a sushi counter but did not see sushi on the lunch menu. \n\nThe lunch specials were decent and draft Sapporo is always $5 which is good. The fried chicken wings are highly promoted here. They do an unlimited beer and wings special for $20 cash all the time. Since, we never tried their wings we didn't opt for this. The wings (spicy ones) were good and crispy. I liked that they weren't as spicy as the Bonchon ones, which I can barely take. Tofu stew was okay. Lots of mussels but no clams or shrimp in my seafood stew. Bibimbap had lots of stuff in it but the rice was too \"wet\" and lacked flavor. \n\nWe got three little appetizers which were pickled cucumbers (barely pickled or had any flavor), some weird potato salad and something else. I don't remember. It was bad.", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "This is my go-to spot for Korean food in Brooklyn, and really all of NYC mostly because it's convenient and very good. I truly think this could be one of the most underrated places in NY. I'm half Korean, so I have pretty high standards when it comes to Korean food. Ssam always hits the mark when I'm feeling homesick and missing my mom's cooking, which is the biggest compliment I can give!\n\nI always choose to sit at the bar, especially if I'm alone or with one other. You're guaranteed to have great service and feel much more cozy that way.", "author": "Sheila H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-30", "description": "So I was working near NYU for a client event and wanted some ramen on a cold day so I used yelp. WOW. Service was super helpful . I ordered small portion of the wings and had them split three and three of the flavors and then ordered the Kimchi and pork stew. It came with side of kimchi, pickled cucumber and white steam rice. The stew had noodle and presentation was very nice. SO yummy!!!!!!!!!!!!", "author": "Kimberly S."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}