{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-26", "description": "The lemon tea is delighting my taste buds but I am confused by the orange wedge. Food hasn't arrived yet but I love the wooden columns and the ambiance is precious.", "author": "Edward M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "The atmosphere is great.  The lights create an inviting atmosphere.  The food is wonderful. I had the Dolsot and it was great.  Served hot and with fresh ingredients. You should definitely try the BibimBap. If you are vegetarian, they have great options such as Kimichi.", "author": "Rajan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-10", "description": "Great space, beautifully remodeled. The food is pretty solid. I like the Bibimbap they have a great variety.  I'm always here during the day. You must try the spot out it's really good", "author": "Chris W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-23", "description": "Very hole in the wall place. Came here for lunch and food was great. We had the lunch platter, the wings and the bulgogi bibimbap. Very cozy spot for sure. If you order the wings make sure you eat those first. It was also pretty cold that day and when the door is opened you feel the draft hit you if you're sitting in the front half of the restaurant so sit in the back if possible.", "author": "Jawn L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-19", "description": "The seafood pancake was too thick and doughy for my liking. The soy garlic wings needed more taste but the truffle fries and japchae were good. They brought out 2 small banchans when we were about to finish our meals though.", "author": "Heart S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-05", "description": "The food was decent although priced way too aggressively. You'd be paying for the space and deco. I would've given 4 stars if not for the incident at the end.\nMy husband and I went here for a quick dinner with our 4-month old baby. The baby started to get fussy as we raced to finish the food, so we asked for the check in advance in order to get home ASAP. We handed over our credit card but a few minutes later were told the machine wasn't working so we had to pay cash. OK, we searched both our wallets, but even including the coins, we were a couple of dollars short. So we asked if they could offer a discount - many restaurants would do this pro-actively in such situations. But they gave a hard NO and kept asking us to go somewhere across the street to find an ATM. Well, that's not gonna happen - this whole thing wasn't our fault to begin with, and our baby was screaming! Upon our insistence, they tried the machine again, and it now magically worked...Ummm, I have an interesting theory (*wink*).\nI just think this whole incident was stupid. Had they offered a slight discount (only a couple of dollars!) or offered us to come back and pay next time (we live nearby), we would have really appreciated it and probably have given a 5 star review and come back again and again and recommend them to others...of course this is assuming the machine did really stopped working briefly and somehow came back online again shortly (*wink*).\nNow, they deserve only 2 stars.", "author": "Katherine J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-06", "description": "Food: 2.5 stars\nService: 2 stars\nAmbiance: 5 stars\nOverall: 2.5 stars based solely on food and price\n\nIf you're accustomed to eating traditional Korean food, you will probably not enjoy some of their food options here. We came as a party of six so we decided to order various items on the menu. Although some of the dishes were delicious, Ssam clearly missed the mark on a majority of them. \n\nHere's what we ordered: \n1. Kimchi jun (pancake): Possibly the worst kimchi jun that I ever had! Even the ones from Korean supermarkets taste better. The pancake was so doughy and had little flavor. Additionally, the portions were extremely small. DO NOT ORDER THIS DISH! \n2.  Chicken wings (both flavors): These chicken wings were delicious and fresh. Be careful before trying them, as they are piping hot! Both flavors were great-- I would order them again. \n3. Calamari: Okay, these were good but they're not calamari. They use octopus instead of calamari/squid. On the menu, it said the calamari would come with spicy mayo and wasabi dressing but it came with only the dressing and ketchup. Kind of disappointed about that since I love spicy mayo! The only reason why that I didn't ask for it was because the servers barely came to our table. \n4. Cold noodles: HORRIBLE! Their cold noodle is really naeng-myun, a cold Korean noodle dish. In my opinion, the broth is extremely important but this broth had no flavor. They didn't even have mustard/vinegar on the side-- a standard for naeng-myun.\n5. Japchae noodles: Mediocre at best. I would buy these at another location if possible. The portions were small as well. \n6. Galbi dolsot and salmon dolsot (hot stone bibimbap): The dolsots were surprisingly delicious! The dish was hot so the rice became crispy. I preferred the galbi dolsot over the salmon one because it had more flavor. The salmon kind of dissolved when you mixed it in. \n7. PRIME galbi: DELICIOUS! This was the best dish that we ordered. The marinade was really great. I wish they gave more of it because it was a whooping ~$29. \n8. Pork belly BBQ: Rubbery and tough. Not worth ~$21. \n\nAdditionally, service was mediocre. The waiters barely came to our table to refill our water and also gave the wrong amount of water cups when we first sat down (even though we told them twice). \n\nI would avoid this place if you want real Korean food.", "author": "Sharon H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-09", "description": "We went there on a Friday night around 7pm and were able to sit down right away. Took us about 15min to get water to the table and another 15min. to get our drink. The service is incredibly slow here. They only had two ppl. working and getting drinks and food took quite some time. Once the food came it was delicious. The scallion pancakes, the fried noodles, bibimbap was all very delicious. \n\nI recommend eating here, just be weary that the service can be sloth speed at times.", "author": "Akshat D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-07", "description": "Good food, but a bit expensive. Chicken wings and ramen are the best options on a menu.", "author": "Kasia P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "Our party of three arrived at the restaurant on a Saturday around 6 pm and were seated in roughly 20 minutes. As has been my experience with most kbbq places, the table was already set up with banchans (small side dishes) and ssam (leafy vegetables for wrapping the meat). What was unique about the setup was the grill had a \"moat\" around it that was one part filled with a corn and cheese mix, one part filled with some peppers and onions for grilling with the meat, and one part with a yellow liquid that I later discovered to be egg--yum", "author": "Mike B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Such a beautiful restaurant. My husband and I have been wanting to try this Korean spot for quite some time and we are so glad we did. You cannot beat their lunch special. My husband and I split the special and it was more than enough food. Staff was friendly, food was fresh and delicious and I got a free ginger ale for reviewing them. What's not to love? We will definitely be back!!", "author": "Maria R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Great food! Awesome service! Hang out with several friends here on Saturday night. You have to try the sea food pancake, super tasty!", "author": "Rui G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Awesome BBQ pork, wings amazing and truffle fries were out of this world!! Service was also very good. Nice neighborhood spot perfect for lunch.", "author": "Molly K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-06", "description": "The food is amazing and excellent customer service. It was my 1st time here and will definitely be going many more times!!", "author": "Roselyn R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "Great authentic Korean food in Brooklyn heights. We came as a group and received prompt service. We very much enjoyed our time at SSAM.", "author": "Luke O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-13", "description": "We always order delivery here because the food is good but the orders are always messed up. We are either missing food or half the soup spilled. Delivery takes more than an hour also. When we call the manager doesn't really take responsibility and blames the delivery. Anyway, 2 stars for food taste.", "author": "Rozanne R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-17", "description": "Authentic Korean cuisine, as good as anything you'd find in Ktown.\n\nWould strongly recommend the Korean style fried chicken, Galbi dolsot, spicy jeyeuk", "author": "Jacob C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "This is a nice cool place to go to the waiter is really nice she made sure I was taken care of. For example my drink was type weak and she seen I wasn't drinking it and she looke i'm like yeah so she took it and put more liquor in it . But the food was good the music is smooth, mind you it's 1:00pm.", "author": "Jimmer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "Wonderful start to our Brooklyn adventure. The Bbq and truffle fries were so good! We loved Gina's smiling face and menu suggestions. The rock shrimp was so tender and tasty and came out fast and hot.", "author": "Allison C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-15", "description": "Love the music, spacious yet cozy environment, and their fried dumplings were amazing. Service was great too. They have great drink specials. $4 draft Sopporo when I visited. Will definitely be coming back to try the bibimbap!", "author": "Kristin C."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}