{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-19", "description": "Came here and tried to get dinner at this place.\nWe sat down and ordered our drinks - white wine and sprite. My husband mentioned the sprite was a little weird and did not drink it. \nWe also ordered their galbi dolsot and steamed veggie dumplings. We were looking forward to the food.  Fast forward 40 minutes and still no food. We asked our server and he said it should be out shortly. Still nothing 10 minutes later. We asked another person and she went and checked with him (our server). Turns out there was a \"glitch\" with the system and our order wasn't placed. I was shocked to hear that considering we had already flagged this 15 minutes ago. \nWe told them we weren't interested in dining and wanted to leave. We received our check and left after we paid. Actually, we noticed that they charged us for a ginger ale which made sense on why the sprite was weird. We flagged it to them that we ordered sprite, and their response was oh but it's the same price as a sprite. I was appalled to hear that- we didn't ask about the price. We mentioned we didn't want a ginger ale - they did take it off the check. \n\nExtremely disappointed that we couldn't try this and how slow the service was considering it really wasn't packed. Will not be back.", "author": "Tahima B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-18", "description": "1) We liked fried chicken wings. Got both soy garlic and spicy- crunchy and yummy. \n\n2) The service was a little disappointing. We tried to get their attention 2-3 times after our food was given to us- was acknowledged- and then we waited for another 10 minutes. I pointed out to the that we were going to order more food but we just lost interest in doing so. After that, they checked in on our table five times within a 10-15 min period. They did offer to make something for us and apologized- we declined.", "author": "Ange C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-11", "description": "Have to say this was really just okay. Came here with one other person around 6:30. We were literally the only people there and yet it took several minutes of standing by the door for someone to come over and give us a table. The food was pretty good, we both liked what we ordered. When it was time for the check we had to wave our server down (again still the only people in there). So basically the food was good but the service was awful.", "author": "Alex I."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-26", "description": "Checked out SSAM because I had seen it so many times on the way into Pane E Vino next door, I love Korean food, and was curious if it would be good enough to scratch my Korean itch without going to K-town,Flushing or NJ.    \nSSAM has a very good lunch special menu, I got some of the Soondubu, Soondae and Spicy Korean Wings.     \n....... Fine, I had a bottle of Soju as well.\nThe service was great, pleasant, attentive, welcoming, friendly, not a checkbox missed. I mention this because that should be recognized, but I acknowledge other reviews that are contrary to this.\nThis was a tuesday afternoon, I got to take my time, it was empty soon enough. I enjoyed my food no doubt,       \n I hate to bring but into this, but, it didn't cure my jones, or scratch that itch.", "author": "Matt C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-27", "description": "I had to look up the word Bistro - to make sure I was not misunderstanding Ssam. It means small restaurant serving moderately priced simple fare. \n\nMy review is an average of two scores. \n\n1) The ambiance/decor is pure 5 stars. It feels like a mountain lodge or a cavernous spot near a lake. \n\n2) The Korean food is closer to 2.5 stars.  \n\nHere me out. \n\nIt's Korean and even the items listed as \"spicy\" are medium spiced at *best*. The soon duebue (spicy seafood tofu soup) comes with about 3-5 pieces of seafood. Sparse (I've ordered it 3 times, to my chagrin). The spicy squid dolsot is sweet and NOT spicy. I'm assuming that this is because Ssam is located in one of the most Lilly White neighborhoods in Brooklyn - Cobble Hill and they are assuming that wypipo can't handle heat/spice. \nIf that's the case, they are serving the palate of the neighborhood via this \"bistro\" - I get it. \n\nNow I don't expect BCD Tofu House or Cho Dang Gol, but I do expect spicy comforting Korean broths and the spices that accompany. I used to go to the little spot in the CitiBank building food court - at Court Square. That spot was so much cheaper and way tastier ... similar to so many Korean booths in bodegas. \n\nNow if the reason you go to Ssam is ambiance. Yes! I get it. That long sexy wood table, the mysterious wooden booths. Drinks after work, maybe an app or two. Sure. \n\nBut I'll take my spicy Korean cravings elsewhere.", "author": "Fazeela S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-04", "description": "Cute interior which makes it look very korean / izakaya. Yet food quality is to be improved, I always think you cant go wrong with korean food, however I realized theres still difference between the good , soso and the bad, so when the quality of food is not that good , please lower your price, this is my only comment for this place. Food are really soso.", "author": "Evelyn F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-27", "description": "I ordered kimchi jigae and there's no rice? Do you expect me to just drink the soup by itself? What kind of korean restaurant serves kimchi jigae but doesn't provide rice? Are you guys really that dumb.......?", "author": "Emily K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-12", "description": "I don't usually write reviews but my experience tonight at SSAM warrants one. My family and I (4 of us) decided to have dinner at SSAM. Since there are no decent Korean restaurants in the area, we wanted to give SSAM another try. The first time we went a couple years ago was disappointing. Unfortunately, tonight's experience was even worse. Food is mediocre @ 3/5 and service being even worse @ 1/5. Wish I had  a notepad to list everything that went wrong tonight.\n\nWhen we arrived, the restaurant was pretty busy, so I was thinking the food must be good here. We were immediately seated in a large table, which was roomy especially for my two young kids. Everything went down hill from there. When we were ready to place our order with the waiter, we ask him what kind of noodles came with the stir fried noodles and he didn't even know. Then he said it depends on the chef in the kitchen. That's a new one. We just wanted to verify if it would be udon noodles, but he didn't know. That wasn't a big deal, but that raised a red flag. \n\nAfter we order the food, they bring out two condiments made up of kimchi and shredded daikon. However, there are no plates for us to eat on, so we are eating directly straight from the dishes. Then I have to waive down the waiter to bring us water, which had not arrived even though we've been sitting at the restaurant for at least 15 minutes.\n\nThe food was underwhelming as well. First of all, the food took quite a while to come out. We ordered the seafood pancake and soy garlic fried chicken wings for appetizers. For entrees we got the Kalbi hot stone bibimbop, stir fried noodle with salmon, and galbi tang (beef short rib soup). The seafood pancake was served burnt so that burnt flavor overpowered any flavor coming from the seafood. The only thing helping it was the sauce which you had to pour it on top of the pancake to make it edible. Also there was very little seafood on the pancake. For the chicken wings, the meat was over cooked and lacked enough seasoning. For the entrees, the stir fried noodle was actually quite good. It did come with udon noodles and a large piece of salmon. Also the galbi tang came in a very tasty beef broth. However, bibimbop missed the mark. First off, after the waiter brings out it to our table, he runs off like there is no tomorrow. And he forgets to bring the red chili paste that is used to flavor the rice. So I wait another 5-10 minutes to get the sauce, which would be unheard of in a Korean restaurant. After finally getting the sauce to my rice, the flavor profile of the bibimbop was very underwhelming.\n\nAs we were finishing up our dinner, I ask the waitress to bring us more napkins.  She tells me literally that the wet naps left on table can also be used to clean my hands. No kidding, I wasn't born yesterday. I just wanted a dry napkin to clean my hands. When the check is brought to our table, the total bill is around $100 including 15% tip (which I think is generous here!!!) \n\nFinally I tell the waitress that we wanted to bring back some of the leftovers. The waitress says ok, then just walks away without taking the dish with her. Wtf. Now I need to wait again to bring the dish back to the kitchen. So rather than wait again which they would have found a way to screw up, we just left the restaurant without the food.\n\nVery disappointing and don't plan to come back. Spent $100 of mediocre food and poor service. Not sure if the restaurant is understaffed or new, but everyone seemed to be unsure of what to do. Will get my Korean food in midtown, jersey, or queens next time.", "author": "Tommy C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-24", "description": "We went there on thanksgiving evening and were shown amazing service. However the food was not that good. \nWe ordered 6 soy garlic and 6 spicy Korean fried chicken wings. The soy garlic had great flavor but none of the wings were that crispy. The spicy tasted more like a sweet and sour type of sauce. \nWe ordered jjampong, soondubu, and pork belly ramen.\nI would not recommend the pork belly ramen. The broth wasn't very flavorful and there's only noodles, three slices of pork, and scallions. No other vegetables or eggs. \nOverall, the service and atmosphere is nice but the flavor of food wasn't quite there.", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-15", "description": "I came here last year and the food was great! I came to visit again last week and it was a very different story...\n\nThe food was extremely salty and I didn't even know what sauce the wings were drenched in...probably won't go back.\n\nI miss the old SSAM", "author": "David K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-08", "description": "Being generous with the stars here..\n\nIn short, its a cool looking place to get a drink but not to eat real Korean food. Who's in the kitchen and where did the chef go???\n\nCame with my wife and 1.5yo. Ordered Kalbi, seafood soondubu, bulgogi dolsot bibimbap and soy garlic wings. oh and pitcher of sapporo.\n\nI thought the pickled cucumbers and kimchi was ok, the rest of the actual food was mild at best but honestly bland.  \n\nSoondubu looked and tasted watery, decent amount of tofu and few pieces of seafood.  Normally the bowl should be boiling hot when its coming out but when the server served it, her thumbs were cradling it. \n\nthe Kalbi, omg, we had less than 10 pieces of meat.  It was bland, was not seared and cooked to medium well.  the meat was served on top of raw white onions with the stone plate that wasn't sizzling or hot! \n\nBibimbap was ok, rice was cooked pretty well, wasn't much content and could be fresher ingredients.\n\nso yeah cool looking atmosphere, decent bibimbap, and beer which was on tap.\n\nwill try to update with pics to prove to you what I said.", "author": "Andy Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-29", "description": "There is a very nice atmosphere here and the service is great. However, the food could be a little more consistent. They had two banchans: cucumber and kimchi, which were both delicious.The seafood pancake was very salty. Their Japchae needed a little more flavor which their fried chicken had but could be a little crispier. The steamed pork belly and the fries were very good, but wished there was some sauce to dip for the fries. The food also took a long time to come out.", "author": "Ashley H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-28", "description": "Ordered 12 wings, half spicy and half soy garlic. Also ordered bo ssam. \nWorst meal i have had in a long time. The wings were ~ $17 and were way overcooked. I thought i was eating chicken flavored chips and the spicy wings were the mildest wings iv had that claimed to be spicy.  The bo ssam was ~$14 and first, the portion size was pretty small. Got about 7 pieces. Too bad they were overcooked to the point where the decent pieces felt like eating jerky and the worse ones were like eating pig flavored chips. Their kimchi was also terrible. Its too bad, the vibe of the restaurant was nice and all but its disappointing when the best part of your meal is the chilled water.", "author": "Taeho C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-24", "description": "Ordered today and delivery was on time. BUT everything was extremely salty. Especially the seafood pancake  could not stomach another bite. We also ordered kimchi fries and wings. However we called them to let them know everything was very salty and they were nice enough to send another order! We really appreciated the effort but everything was still salty", "author": "Cissy Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-25", "description": "Typically fine, last time I went I had the worst food poisoning of my life. So maybe reconsider next time you're thinking about this place.", "author": "Jona B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-04", "description": "I live in the neighborhood and always wanted to try. I finally did and was so hungry when I stepped in. \nIt looks so chic and nice from the outside.... but as I stepped in, think: diner music and cool chic ambiance. \nIt. Does. Not. Match. \n\nI ordered kimchi fried rice with bulgogi on the lunch special and i also ordered soy garlic wings which was actually really delicious. \n\nKimchi fried rice came without bulgugi and was SO bland. So. Bland. Which was really surprising. \nThe waiter was really nice tho.  \n\nI had to ask for gochujang which is the Korean hot sauce. That kinda saved the dish. \nThe kimchi we asked as a side was also bland. So sad. \n\nThe music... I'd recommend the store to play some cool k music. And up their cooking game. \nJust add a bit of salt. Plz.", "author": "Phoebe S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-01", "description": "Been here today. Food is ok. no service. Only one waiter for like 10 tables. No side dishes until you asking. Not satisfied with that.", "author": "Weisi Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-13", "description": "One of my friends asked for lemon on the side with my water, but the waiter pre-squeezed lemon in my water and it's super sour. The Ginseng chicken soup was bland; there was no chicken, chestnut or ginseng flavor. The soup base of the Pork belly ramen was salty, the Japchae didn't have enough noodles. Bulgogi Bibimbop was burnt on the bottom and the fried egg was overcooked instead of runny. Overall, the portions were really small. **Even though, the food was horrible, the service was good.", "author": "Jimmy Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-22", "description": "Such good Korean food! Ahhh! So I went here on a rainy Sat night around 7, it was kinda quiet but people started coming in a little later on. The atmosphere is very nice, twinkly lights every where, yess!! \n\nFood was great! Kimchi pancakes and spicy wings for appetizers, so gooooood!!! The spicy wings were super spicy, no kidding! But I love spicy food so I enjoyed it. For entrees my husband ordered the squid bibimbap and I ordered the Jaeyook bibimbap, so flavorful! I wish there was more meat on the dishes though...but great food for a great price.\n\nWe will be back!", "author": "Kawomi E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-05", "description": "The spicy beef stew gluten- free was amazing. My partner had the pork belly ramen and loved it. The inside of the restaurant is so cute, too. Great spot overall.", "author": "Jamila H."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}