{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-19", "description": "My husband and I are huge fans of Korean food and we're thrilled to have Ssam in our neighborhood when we previously had to travel to K Town or Flushing to indulge in the cuisine.  We have been regular customers since they opened and have consistently been very happy with the food and the service.  \n\nThe menu has changed a bit since they opened.  But the changes have been a real plus. They give you a yummy and substantial selection of ban chan, the items of which change regularly.  The lunch boxes are fantastic and huge!  At this point, I have sampled almost the entire menu.  Everything is delicious and authentic.  The kalbi and bulgogi are perfectly seasoned and cooked.  Even the chicken wings and fries are delicious!  Jap chae - delicious.  Stone bowl bibimbap - delicious.  Sundubu jigae (spicy tofu stew, for those of you who've never had it) - delicious.  Mandoo (dumplings) - delicious.  I could go over everything on the menu but that would make this review a bit too long and I have other things to do today =)  \n\nThe service is also a big reason why we are regulars.  Jay and Oneal always makes us feel at home.  They are attentive and do everything that they can to make the dining experience as wonderful as possible.  Andrew is new and also awesome.  \n\nNow for the ambiance.  The restaurant decor is cool as well as welcoming and comfortable.  There are booths for larger parties and I suppose they could even push together other tables if you're planning to bring your entire rolodex to the restaurant.  They'll make anything work.  Customer service is very important to them.  So, worry not.  You will be well taken care of here.  Great spot as part of a fun date.  Cool music in the background.  You really can't go wrong here.  \n\nWe wish continued and increased success for this restaurant.", "author": "Coco M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-29", "description": "This place is empty for good reason.  Service barely passable and the food put  both me and my woman on the toilet bowl", "author": "John B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-26", "description": "My boyfriend and I came here for dinner. We had seafoods udon, chicken teriyaki, and seafoods pancake. The service was great, the server was really friendly and helpful. She came to our table a couple of times to make sure we're alright. The foods was good (I would give it 7/10, minus 3 because the chicken teriyaki was dry but other foods were fine) especially the seafood pancake. My only complaint is, the foods are pricey.", "author": "Nina Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-04", "description": "I like spicy pork here! It's really nice and authentic! Japchae is my favorite food here.", "author": "Yongsu C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-09", "description": "Been here twice so far and this has become me and my friends favorite hiding spot. we always head to ktown to satisfy our cravings for ddukbokki or stews or chimaek but here at ssam they have everything that i'll ever want and need :) on top of that they're in my favorite neighborhood and so much closer to me! brooklyn xoxo! the servers here are super attentive and the chef is so kind! we were bummed out cause they didn't have anymore of one of the appetizers we ordered but they were so sweet and gave us gyeranjjim (fluffy steamed egg) so yummmmm. i had their raw fish with greens and rice (hwadeopbap) my friend had their kimchi jjigae and we also ordered cheesy ddukbokki more than filling! we were stuffed! the first time i came to ssam i had chicken and beer and bossam and samyupsal; so sinfully delicious! can't wait to come back again!", "author": "Caroline T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-25", "description": "Nice food, great service. The variety of korean food they provide is quite nice and organized that it doesn't look daunting or hard to choose from. Id like to compliment the super nice manager/owner who helped us so kindly throughout the meal. Def would come back for some food and drink!", "author": "Steven K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-03", "description": "i am giving Ssam a well deserved 4 stars. i think for being smack dab in the middle of cobble hill which feels less and less cultural as the years go on, ssam is holding it's own and bringing back some of that diversity that the area desperately needs.  \n\nyou get a complimentary three little sides and a bowl of miso after you place your order. pickled daikon radish and kimchi being two up for offer. i took a star off my review because there were raw oysters in the kimchi (what the...?) this needs to come with a disclaimer. i found the raw, slimy taste of the oyster unexpected and unappealing - and I am an oyster lover. \n\nthe hot stone bibimbap with bulgogi (thinly sliced marinated beef) is my favorite. it sizzles and  gets that perfectly crunchy rice bottom that you want the longer you let it sit. \n\nthe interior is like an asian/bar fusion. \n\ni will be back for BBQ and an updated review but in the interim, if bibimbap is what you crave, this place will hit the spot.", "author": "Maia D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-08", "description": "Come here for good Korean food without having to trek to ktown - hot stone pot bibimbap (dolsot bibimbap), seafood pancake, soft tofu soup - all delicious! Had some good tea and Korean traditional rice wine as well.", "author": "Eunice B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-27", "description": "We ordered the sweet potato noodles with beef, sea food pancake and soup with pork, tofu and kimchi. Every thing was above expectations. There was plenty of tender beef in the noodles. A generous amount of shrimp and squid in the seafood pancake. The kimchi soup had pork, rice cakes, tofu and lots of peppery kim chi. Be prepared for an authentic korean hot peppery experience if you order the kimchi soup. The service was very good with two waiters making sure we were well attended too. We did not wait very long for our food. The only thing they got wrong was I ordered a Korean bear and got the tap sapporo but I was very happy with the support so no complaints there.", "author": "Ronald W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-17", "description": "Ssam is my favorite place to go to! Not only is the food good, but the service is great as well. They are always so attentive and always ask if I need anything from them. They serve free appetizers and always refill you water whenever you finish. The food is always fresh and doesn't take long to come out. I would highly recommend this place to anyone craving Korean food or drinks. I would go everyday if I could.", "author": "Jeffrey L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-27", "description": "Rating it based exclusively on Bibimbap....excellent.\n\nFirst time I came it was not sizzling and almost didn't give it a second try...would have been a big mistake.\nSo, so happy I can find this in the neighborhood...finally!", "author": "lisa k."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-31", "description": "Go to this place! Some of the best Korean food I've had and dirt cheap! Great service and great veggie options too", "author": "Chris W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "What a great find on yelp. I was just craving some Kimchi stew and here it is!! The chicken teriyaki bento box was so out of this world yummy, and really liked the Korean style spicy fried chicken. Warning, its pretty spicy!! The food quality is comparable to K-town! On top of that, the service was wonderful. Refills on the banchan and really enjoyed the free miso soup! This would be a great spot to bring big groups.", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-20", "description": "If you know Korean food then you should be SUPER excited to have this restaurant in the neighborhood especially given the other \"ethnic\" options around. The people writing bad reviews based on the BBQ make me chuckle. Order the dol sot bi bim bap (stone bowl) and duk bokki. You won't be disappointed.", "author": "H S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-20", "description": "The portion sizes are enormous for a Korean restaurant, completely justifying the slightly higher than average prices. The banchan and ddukboki were excellent. I plan on coming back soon.", "author": "Minnah S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-15", "description": "I am reviewing this place because I want to help them out, it was really good! The brussels sprouts with pork belly were off the charts delicious, and the scallion pancakes were the bomb! The waiter forgot to bring my seaweed salad which is why I left off a star but the place was nice and the service was really friendly. I will definitely go back!", "author": "Dari L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-20", "description": "I don't understand y this place has such a low rating. The food is excellent. The noodles r to die for and their chicken wings are extra good. Not soggy and very crispy. I got the spicy garlic. To the people with low score reviews...are u sure u have the right restaurant?", "author": "Nataki S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-01", "description": "Had a great lunch with hubby and my friend! We each had the bento box and there was so much delicious food. When we sat down we were offered hot tea and given miso soup right away. Three little side dishes were also set down. Nice for a snowy day! Miso was luke warm and that was the only con. But the lovely ambience of the place and the attentive staff made it a wonderful dining experience. I would come here again. I wish this restaurant was in my neighborhood", "author": "Kim W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-28", "description": "If it hadn't been for my friend really wanting Korean food while we were in that part of Brooklyn, I wouldn't have even considered this place based on the rating. But this place deserves more than 3.5 stars.\n\nWhen we came in during early lunch the place was empty, so we were naturally greeted very warmly and swiftly, they gladly gave us a good booth and served us complimentary green tea.\nThe menu had a good selection and there were a lot of nice lunch deals. I chose the spicy pork bento box and my friend chose the bulgogi beef box.\nWe were served an appetizer of kimchi, picked cabbage, and spiced cucumber. And it was good!\nOur lunch was served in a decent time and it also tasted very good! Yes, it wasn't the BEST Korean I've ever had, but it was GOOD, and more deserving than 3.5. \nWe also got green tea ice cream and again, it wasn't anything insanely good but it was above par for cheap food.\nSeriously, if you're hungry, and want a nice seat and good service, go here. You won't be disappointed. I would go back.", "author": "Sara L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-26", "description": "In life, realities often don't meet expectations. That girl (or guy) you just met and go on a date with turns out to be a dud. That hyped restaurant with such mouth-watering looking dishes turns out to be overpriced and blah.\n\nWell, I can tell you that SSAM has never disappointed me. I've been coming here for lunch since they opened and I love all their dishes. The fried chicken drumsticks are delicious, crispy on the outside, tender and juicy inside. Those are my favorite! But the lunch boxes are also great -- the spicy squid, the spicy pork. And their prices are more than reasonable.\n\nLastly, I find their atmosphere quite convivial and their service excellent. Their staff has always been courteous, friendly, and always willing to accommodate any special requests I have.\n\nGreat food, great service, great atmosphere. Like I said, the culinary experience at SSAM has never disappointed!", "author": "X. I."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}