{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-14", "description": "Great location in a fun part of Brooklyn. Lots of seating available - perfect for groups. \n\nService is lack luster. You have to repeatedly give eye contact just to get someone to get to your table. I waited quite a while just to get served water. \n\nHowever,  the food is undeniably good. I had the spicy pork shoulder bibimbap. They don't come out with any accompaniments  (bachan) but if you ask,  you will get some kimchi. The rice tasted good and the veggies were done well,  almost a sweet taste to it. \n\nOverall,  its got good food but poor service.", "author": "Tony T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-18", "description": "Eh. Is the descriptor that comes to mind for this place.\n\nA group of us came here on Saturday around 7:30. The 5 of us made up more than half of the patronage - which for a restaurant on Smith street on Saturday night isn't a great sign.\n\nWe sat in the middle at what I believe would be a communal table if there were people to commune with and looked over the menu. About 3 minutes into sitting down a waitress came back and requested she have 2 of our four menus and we \"share\" because a new group of three had come in and they didn't have enough menus. \n\nWhat was their plan if more than 10 people came into this restaurant at once? Menu reading time limit?\n\nAfter we lost half our menu's we waited another 20 minutes until we were approached (read: had to flag someone down) to have our order taken. \nWe ordered a pitcher of beer and a variety of items for the table to share: shimp appetizer, two orders of the sliders and a chicken bibimap.\n\nThe waitress took our order and proceeded to just stand at the bar and about 5 minutes not doing anything as we waited for our pitcher. After she left and did a few things it was clear she forgot our pitcher so we went to the bar and asked for it directly.\n\nThe food was ok but nothing outstanding. The Bibimap was a little bland. The sliders were the fave of the table.\n\nThey have an eclectic menu and there's not many Korean options so come here if your craving some bibimbap but don't go out of your way.", "author": "Megan R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-24", "description": "This place..... seating was quick. Probably because there weren't that many people in there. Service... slow and disorganized. We ordered 3 appetizers. 1 came 5 minutes before the other 2 came then the entrees. My order of bulgogi with glass noodles came in a hot plate with my food already burning. Literally. I had to ask for my rice and salad which came 8 minutes after my food finished burning and drying out. 45 minutes later, we finally got our entree after asking for it twice. Missing the avocado that was asked for. We will never come back to this place again. If we want \"Korean\" food... we'll go to Koreatown.", "author": "Margaret Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "Atmosphere - definitely a place I really enjoy with a great music selection and lighting is great for an intimate night out with friends or even a date. This place is popular and I could see it filling up during colder months \n\nService - the staff is friendly and even took a photo of our group for us. All our questions were answered in detail since alot of my friends hadnt been to a korean inspired restaurant before. \n\nFood - really interesting selections and each dish we tried had some good flavors. The pork ramen had the most flavor and my veggie tofu bowl was a little lacking but thats usually expected with the veggie plates. I was also glad to find there was a selection of korean beers I have never seen before.", "author": "Brandon B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "Excellent service. Love the happy hour special. $1 per wing! Amazing atmosphere. Decor is on point. Definitely would recommend checking this place out if you're in the area!", "author": "Claire L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "Stir Fry Shrimp noodles add spicy, spicy beef ramen, spicy pork belly ramen, sea food ramen and veggie tofu ramen add spicy. DELICIOUSNESS!! Very great atmosphere and great decor. I'd come back!", "author": "Sabina B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-21", "description": "Being that in always in the area, I thought to try this place out. Nowhere near thrilled. \nThe appetizer comes out at the same time as the entree. So if you're near being famished, eat something before you arrive and then order entree. Food wasn't all that. Would rush back at all. \n\nStaff is super nice and friendly though.\n\n**peace hand sign**", "author": "Wesleyan T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-02", "description": "I really wanted to like this place, but my experience this evening was pretty lackluster. They were fairly busy when we arrived, which wasn't that surprising on a Saturday night, and generally a good sign. But the staff seemed completely overwhelmed, as if they had never been busy before. We were seated right away and given water, but it took 15 minutes before someone came to take our order. Even then, one waitress started to take our order and in the middle of ordering another waitress came and took over. They seemed flustered and inexperienced. Rather than having defined positions and working in sections, they were all running back and forth all over the restaurant and behind the bar. There was no method to their madness. It's telling that over the course of our meal we watched 3 separate tables simply get up and leave after without ever placing an order.\n\nAnyway, so the food. We waited a solid half hour for our dishes to come out once the order was in. We ordered a kimchi pancake as an appetizer to split. This was probably the highlight of the meal. Very similar to a scallion pancake. You'd be hard pressed to pick out the flavor of kimchi, though, and since it was $2 more than the scallion pancake in retrospect I wish I had just ordered that. For my main I went with the pork belly Ramen. I'm fairly certain they just threw a brick of instant ramen in the broth, as the noodles were still in the shape of the package when I started eating them. The broth was pretty good, but it was lacking in the accoutrement you usually expect with Ramen. So it was mostly just that: broth.\n\nMy girlfriend ordered the salmon Bibimbap, which we both found to be pretty dry. The rice got a nice crispy texture as it continued to cook in the bowl, but it was under seasoned. We poured a little of my broth in along with some soy sauce and sriracha which helped, but you shouldn't have to doctor a meal in a restaurant so heavily in order to make it palatable.\n\nWhen the meal was over, it predictably took a long time to get the check. All told we spent 2 hours there in what was supposed to be a quick, casual dinner. None of the food was bad, but it certainly didn't wow us, and considering how slow the service was the food would have had to have been really on point to make us want to come back. I may give them another chance. It's possible it was an off-night, but first impressions are hard to shake off.", "author": "Brett V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-20", "description": "I ordered the Lunch Special that consisted of a big plate of Chicken, rice topped with a sunny side up egg. Fries, fried dumplings, a side salad with a light and tasty dressing. I also ordered a side of Kimchi that came with a dish of \"Udang (sp?)\". The host explained that it was fish fried in potato flakes. Absolutely delicious. The service is great and he suggested we try the Plum wine. This is my third time visiting this quaint and rustic eatery.  I highly recommend!", "author": "Anna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-19", "description": "Happened on this little gem on a hunt for dosas! What a welcomed surprise! Yummy food and attentive service. Pork belly ramen was delicious and steak and eggs as well. Perfectly prepared fried eggs on every dish! Love the rustic feel of this place as well. Definitely coming back!", "author": "Malicka H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "Had the Pork Belly ramen (center of the picture) and it was amazing. Ambiance is awesome, servers are friendly and attentive.", "author": "Mario R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-13", "description": "--- we waited super long to be served, 1 hour to have the appetizers....It seemed all the tables around us were waiting just as long as we did. One of the waitress was running in the restaurant from one end to another. \n\n---food was blend, no genuine flavor whether it was for the appetizer (boneless chicken) or the bimbimbap. Shame as we love Korean! Nothing stood out. \n\n+ for the place. Nice place to have a drink but that's about it.", "author": "AL M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-09", "description": "TERRIBLE EXPERIENCE!!! Just ordered through Seamless and the ETA was 7:30-close to 8pm. And when I refresh the page, it pushed the eta to 8:15-8:30pm. I immediately called, a lady picked up and said it's not out for delivery yet and they are a bit back logged and said probably another 20 minutes. Then, I refresh the page 20 mins later and the ETA pushed to 9pm. I called again and again at least 4 times and no pick-up. Worst delivery experience I've ever had. I called Seamless to cancel my order. Supposedly relaxing Friday night turned to anger and hunger (hangry). Do not do deliveries if you CANNOT handle it. Or just tell me on the phone how long and people can decide for second option versus dragging people's time. So inconsiderate!!!!", "author": "Shanny L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-02", "description": "Ssam was simply amazing, we organized my friend's engagement party there and they let us decorate our table and were extremely helpful in planning the whole thing. Great food and service, would 100% recommend !!!", "author": "Violette P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-27", "description": "I stumbled across SSAM tonight while seeking dinner before our showtime which was at 10:00. I was extremely surprised to find that most places in the area closed at 9:00 pm, and found SSAM which closed at 10:00 pm. We arrived to SSAM around 9:00 pm, and was informed that they can't take anymore customers, I believe it was because the cook had to leave. I believe it was a sudden occurrence, but the waiter allowed us to be seated, after informing us only if we can make a selection quickly. \n\nI ordered the sundubu with beef, which was great. You can actually see taste the huge chunks of beef brisket. My date ordered the Kim chi fried rice with chicken, which I though was great, but he thought was a little too spicy for his liking. We also had the yogurt sake, took a moment to get use to but, once you get used to the favor it was delicious. \n\nThis was our first time at this restaurant, but it surely will not be our last. Next time we would be sure to go a little earlier to ensure we don't feel rushed.", "author": "Zi Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-25", "description": "There is not good service, the food is not something to remember, just spicy and too much hot. The restaurant smells not good", "author": "Diana P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-11", "description": "We came here because the reviews were great, but we were not very impressed. The crispy wings were really good. The bibimbap did not taste freshly made. Kind of tasted like a freezer meal that just came out of the microwave. The bulgogi was tasty and the Korean hot sauce was delicious.", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-22", "description": "Service wasn't the best, not sure if they were understaffed. Regardless, the food is awesome and I would go again. Order the NACHOS!", "author": "Michael N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-05", "description": "We came here for a friends birthday dinner. The place is big, it's great for groups. Atmosphere/setting was nice and cozy. Food was very good, service great. Reasonable prices. Nothing to complain about. Cant wait till we come back again!", "author": "April D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-11", "description": "Really disappointed with this place due to its customer service and food. Ordered delivery for my husband and I, only received half of our meal even though when they delivered my food they even gave me the receipt that clearly said my correct order on it. Called them back to see if we could receive the rest of our meal. They said they \"would look into it\" aka: they didn't even attempt to call us back and left our additional phone calls unanswered. I'm not quite sure how you can treat customers like they don't even matter. As for the food...it was just very alright. Average. For the price and customer service I'd rather go elsewhere.", "author": "Alexis W."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}