{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-15", "description": "Waiters are really rude. We were waiting for a friend and didn't want to order first. But even after we told the waiter about this, they still come back one minutes later and ask if we want to order now. We said we were waiting for a friend, but they come back in one minute again. This happens 4 times before our friend came.\nAfter they served the food, they keep coming back to check, but the way they check is really rude. They wander behind you, and you feel like someone is behind you, but suddenly they go away.\nThe stone bowl is way too hot that all the onions are charred. Food taste so-so too. I'm not coming back.", "author": "Kai-han C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-16", "description": "This is an amazing Asian restaurant, and better than anything at home. They serve everything really hot and the ingredients cook in front of you. I.e. the egg.", "author": "Jonathan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-26", "description": "We came here early on a Thursday night.. around 6pm. Place was empty when we arrived but it started to pick up at the end of our meal. \nWe ordered two spicy chicken bibimbap, a plate of boneless wings and the sliders. The Bibimbap was good, served in a heated stone bowl. It arrives at the table sizzling.  My only concern is that it came with straight up gochujang sauce instead of the more traditional sauce that has sesame oil and vinegar mixed into the gochujang.  A little disappointed about that.  Otherwise, we were very happy with our meal and glad to have a good bibimbap place in the neighborhood.  \nStaff was nice. Ambiance is good. \nDefinitely will be back.", "author": "J L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-05", "description": "Was really craving Korean fried chicken but didn't want to travel to ktown, east village, flushing or bayside... so came here since it was close to my house. I was actually quite surprised there was a Korean restaurant here and yelped to see its reviews. There seemed to mixed reviews but I decided to try it anyway. The decor of this restaurant is pretty cool but couple of things I noticed that weren't so great 1- all the chairs are torn (they have pleather seats and the pleather were all torn and in pieces making it really difficult to sit) 2- we sat at a table where there was a hot water pipe right next to it, my husband get burned on his leg. The food is really mediocre- the wings were ok, there was no authentic banchan (Korean small dishes) - they only served stale kimchi. The ramen we got was blander than if I cooked my own Shin ramen (which after eating here and paying $16 for a bowl, I really wanted to go home and do that). They also played top 40s Latin music all\nNight... like it was a club... anyway this place is not a authentic Korean restaurant... the food is nothing to rave about... and next time I will definitely make the effort to travel to a authentic Korean restaurant.", "author": "Susan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "Legit Korean food. Delicious dishes.the Bossam was amazing. Kid friendly, we had 2 hot stone dishes, both were really good. Portion sizes are great as well. Definitely recommended.", "author": "Manuel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-26", "description": "Service was very attentive, and food was great! \n\nOrder the chicken wings, bulgogi, seafood soft tofu stew, bo SSAM!", "author": "Lilian S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-09", "description": "Love this place. Delicious bulgogi, bibimbap and kimchi. And a truly sweet and lovely staff: friendly and super eager to accommodate.", "author": "plume L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-16", "description": "Chicken wings are a must! Definitely my favorite Korean chicken wings I've found and better than anything in Ktown! Our other dishes - salmon bibimbap and squid \u0026 pork plate - were super on point! \n\nThe manager was very kind and provided great service. The atmosphere is cute cozy, and on trend. Can't wait to go back and try their other dishes and most importantly, eat their chicken wings again!", "author": "Courtney C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-16", "description": "First, there was nobody at the entrance to greet us. My party and I had to awkwardly wander into the restaurant to flag down somebody in order to be seated. The food was pretty much forgettable. Haemool pajeon was cooked unevenly (which you can clearly see in my photo) and barely had any seafood in it. Kalbi dolsot bibimbap and haemool sundubu were pretty flavorless and not well executed. While trying to pay, the waitress took our check, placed it next to the cashier, and proceeded to complete  multiple other tasks. I had to walk up to the cashier in order to remind her to run my card. Will not be coming back...", "author": "Caleb F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "Great food. Great atmosphere. And reasonably priced. What else could I ask for? Not many Korean BBQ places that fit that criteria.", "author": "Paul H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-02", "description": "Yummy- yum!! Absolutely delicious - great flavors. The Galbi Dolsot so hit the spot, the meat was super flavorful and just perfectly tender. Salmon Dolsot was also quite good, and I loved the sweet and savory flavors of the Ddukbaegi Bulgogi. Glad we tried it, even though hubby was a bit upset about having an egg in his dish after he ordered it without the egg - minor hiccup, as was the bottle of Guinness that was supposed to be draft (he did get over it).", "author": "Tatyana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-20", "description": "Nice hangout with friends. Wooden furniture with dim light and soft trendy music. Food has very nice combination of American and Korean style but contains the traditional Asian taste!", "author": "Janet K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-18", "description": "This place is gorgeous inside with tables in little nooks that give you a lot of space. The food is great, and reasonably priced. Ive had the kimchi cheese fries (unfortunately so good we ate them all), dumplings, bibimbop, noodles and a kimchi pancake. The pancake is the only thing I might skip because it was a bit greasy, everything else was bomb.", "author": "Alison K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-26", "description": "This is quite a great Korean restaurant! It is a bit pricy but the best I have tried in Brooklyn.", "author": "Viola L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "The word that comes to mind when I think of this restaurant is \"refreshing.\" It's refreshing to find a place that serves great Korean food (had the bulgogi bibimbop). It's refreshing to be able to show up to a restaurant on a Saturday and not be stuffed into a small table with other tables breathing down your back. Oh, and the mojitos are really refreshing.\n\nI'm coming back.", "author": "One L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-14", "description": "I usually never write reviews but my fiancé and I came here and we waited 2 HOURS for our food. Finally I got my entree and they told me they forgot about my fiancé's entree. An hour later when my fiancé got his entree, there was a sticker from the vegetables floating inside his meal. AWFUL service and awful food. Would recommend never coming here", "author": "Radha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-17", "description": "This restaurant is absolutely amazing. Try the stone bowl option. Delicious, nutritious, very filling and piping hot to the last bite! Best lunch in Brooklyn.", "author": "David H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-09", "description": "This place is a great escape for your lunch hour. It's chill, great music, you get a seat fast, and the food is delicious.  I usually go with the lunch selections and get the kimchi fried rice with chicken wings. Also the Japanese-style bento box is another great choice. The right amount of spice and never short on the flavor, SSAM will make you want a taste of South Korea every time.", "author": "Shakiva W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-03", "description": "I finally found a nice place to have my lunch near my work. I had kimchi fried rice with marinated pork. It was great and even the side dished are fresh and yum. This place will be my lunch place from now on.", "author": "Jinhee H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-15", "description": "This place was terrible. They were out of Bulgogi ! It took them 10 minutes after we ordered it to let us know they were out of it. That's a whole section of the menu! The ramen noodles looked like the ones out of a package. Adele was blasting, and Justin Bieber. The music was unbearable.", "author": "Nicole S."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}