{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-07", "description": "The spicy korean wings here are amazing! The seafood soondubu was on point. The bibimbap with Bulgogi was delicious as well, even tho they sprinkled some kale in it. The soy garlic wings were meh, a lil too salty for my tastebuds. The tteokbokki \u0026 fish cakes were delightful with that sweet \u0026 spicy sauce. The kimchi side dishes were fabulous! Overall, I'd give the food 5 stars.\n\nThe service on the other hand, was awful. There were 7 of us, we ordered mostly wings and some other dishes I named above. One of our friends got her tteokbokki but never got her wings. When we asked about it, he came over and asked what she ordered again. Then went to the kitchen, came back and said, \"I didn't forget your order. Itll be right out.\" \n\nAbout 15 mins later, we ask again, he said 10 more mins. Another 10 mins go by, we asked to have it packed to go. He responds with 2 more mins. As we waited longer, we requested for the check. Took another 5 mins and finally brought the check to us. But still no wings! So, we asked another server and he ran back there and finally, the wings came out along with the server's face screaming, \"oops, I forgot your order, again!\" Service = 0 stars.\n\nOverall, 3 stars MAX since their dishes were tasty, but they need to work on the service or just get new servers since it appears that I'm not the 1st one who's been disappointed with them.", "author": "Teresa L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-12", "description": "Drinks are cheap! but on the night I went, they told me they didnt know if the bartender was coming in or not... so they offered to make it by reciepe and i said fine, ill try it. I never tried the one that bartenders there make but the one they made by reciepe was passable probably. \nwell me and my friend had fun, it was a huge place but only had maybe 3 tables come in through the night, so it wasnt noisy. \n\nthe servers all seem new and didnt know what they were doing, especially a girl. she told me it was her first day but she shouldve gotten training during shift since it was so dead in the place. its not excuse. \n\nthe experience i had in here wasnt that good. but the drinks are pretty cheap for the area and the food was passable. I might come back if im in the area and want some cocktails.", "author": "Rebecca Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-23", "description": "My partner and I were walking down Smith St. looking for a place to eat, as you do. We saw SSAM from across the street and new we'd found lunch. The interior is interesting but nice. \n\nI opted to get the Bibimbap lunch special with chicken. My partner got Kimchi Tofu Veggie Ramen. We started with the 6pc soy garlic wings. Every single item was excellent and I'd recommend them all.\n\nThe staff was super attentive and very nice.", "author": "Matt H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-17", "description": "This is my third time going to Ssam, and I never had to complain about their food until now. We ordered the kimchi cheese fries, chicken wings, and beef soup. We were served cold fries unappetizing fries. My friend was so disappointed that she stopped eating after a few bites. The chicken wings and soup were just ok. I don't know maybe they changed their kitchen staff, but I'll give this place one more try before giving up on it.", "author": "Leyla D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-11", "description": "Solid Korean dish's!! I love love love Bulgoki so I had to order and I was not disappointed! We came for World Cup, not exactly our first choice or thought of a place to watch, but we had an enjoyable time. Not sure if they have regular drink deals like they did this time. Check em out!", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-10", "description": "Great date night spot.  Open atmosphere, friendly staff, rustic/DYI decor.  The service was pleasant and fast.  Wings and rock shrimp were a great start.    Kimchee Jjigae hit the spot on a cold night - rice cakes were cooked well.  Bibimbap was flavorful and the extra crispy layer of rice at the bottom was a plus.", "author": "Hung L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-21", "description": "Overall this was a good place! The servers were nice and the food came quick. I got the tofu and kale Bibimbap and it was good. I only wish the tofu was cooked in some sort of sauce similar to the spicy chicken one. The kimchi was so so good though! I would definitely come back though!", "author": "Spurthi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-22", "description": "Visted New York from California. After the long flight and ride to our hotel in Brooklyn, we got hungry. Was tempted to try all the popular \"must eat places\" in New York, but since we were pretty tored from traveling we just wanted something nearby the hotel. Luckily my pregnant girl came across this place on yelp and said she wanted to go there.. the spicy sticky wings are the bomb, i would go back to Ny and  order like 7 orders of these and be perfectly happy...the ramen and potstickers was pretty good, the kimchee they serve before your meal was yummy, and the server/ food runner / busboy (dont know his actual position he sorta did everything) was super ontop of his game, was not expecting a tall white(i think he was maybe swedish or something) to be a working at a Korean restaurant but he was the best restaurant worker we encountered the whole time in New York... when we returned back to CA and people asked about the good foods and stuff we ate, they were all surprised that the sticky wings were very high on my list compared to all the overrated \"must try\" items", "author": "Will S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-26", "description": "The food was mediocre, but if you're craving for Korean food and is around the area. This place is truly authentic. \n\nWe ordered the soy garlic And spicy Korean wings which were a little bland. The only seasoning the wings had were the sauce on the outside. Which was a little disappointing, crispy but meh \n\nWe also ordered the spicy pork hot stone bowl which was our favorite ! The pork was nice and tender and their bibimbap sauce was spicy and sweet as well. The only complaint was that the stone bowl wasn't hot enough to crisp up the bottom of our rice which was a disappointment. \n\nOur truffle tries was the worse by far. Not crispy not golden brown just bland and seemed very low quality considering how much effort they seemed they put in our other dishes.", "author": "Sally C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-01", "description": "I usually don't write poor reviews for small establishments. They have a hard enough time as it is.  But service here alone warrants it. \n\nIt took 45 minutes to get our food.  My head would go up every time someone came out of the kitchen and then go down in disappointment that it wasn't for us...again. I'm all for waiting for some good cooking, but this order was for wings, a soup, and bimbibap.   Not exactly reinventing the wheel over here.  \n\nAt no point before or after the food come did anyone check on us. Refill our water.  See if we needed anything else.    Oh, and they forgot my wings but didn't forget to have them on the bill.  \n\nAs for the food, pretty solid middle of the road. Nothing better or worse than you'd get from a million spots in KTown.     Could be a nice addition to the neighborhood but they need to tighten things up.  A lot.", "author": "Daniel B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-11", "description": "Winning for the wings. \n\nDelicious wings! Compared to Bon chon, the wings here have less/no breading. But they are freaking CRISPY and light. Come in two flavors, soy garlic and spicy. Soy garlic is a thumbs up, light with a tinge of sweetness. Spicy flavor, isn't really spicy, it definitely does not hold a kick like Bon chon. The spicy wings taste like it's barely brushed with red pepper paste. I would just get the soy garlic only. 6 for $9. \n\nSince I'm at Ssam, I figure to go get the Bo Ssam (steamed pork belly with kimchi) . I was much less impressed. The pork belly itself was moist and tender. But the white kimchi that accompanied it was really salty. I had to counteract with some high quality h2o action. It was a pretty plain dish that I probably wouldn't order again. \n\nCucumber banchan: bland, as though just soaked in water\nKimchi banchan: decent\n\nService: excellent and food came out quickly \n\nCool, rustic ambience btw\n\nBottom line: wing me here again!", "author": "Nan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-07", "description": "I came here with a friend for dinner a few nights ago. The ambiance is nice and laid back. The waitress was very sweet.\n\nWe had the wings, both soy garlic and spicy, the spicy rock shrimp and Parmesan fries. Everything was very good! We shared hot stone Bulgogi with white rice. Overall, pretty good!", "author": "Sophia H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-17", "description": "Went here for Valentine's Day with my girlfriend. The inside of this place is so cool. On the outside it looks small but there's a ton of tables there. They even have this  fort/booth hybrid which I wanted I wanted to sit in but whatever. We got the wings for an app which were so-so, I wasn't really impressed. For our entrees we got the Jeyhook which is spicy pork which was excellent. It was very tender with a nice kick to it. We also got the Bulgogi Dolsot which was equally delicious. Pretty good drink selection of wine, beer, and soft drinks. I would of given this place 5 stars but the service wasn't great, we waited a long time for your order to be taken.", "author": "Phil C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-03", "description": "Korean restaurant in Brooklyn, even if you're used to Annandale, VA? Why not, let's give it a try.  Ssam doesn't disappoint.  I had the Spicy Squid Dolsot Bibimbap.  The stone pot was crazy hot, so hot that you could hear the rice on the bottom of the bowl crackling with flavor.  This is exactly how it should be - wait a little bit, and a hard layer of super-heated rice, browned and even blackened from the heat, should be at the bottom, waiting for you to crack it open with your spoon.  Start mixing the fresh, crunchy vegetables, smell the spices, watch the gooey sunny-side-up egg split open, and you're ready to enjoy.  If anything, I was only slightly disappointed by the squid - there wasn't much, and Ssam used the ring part of the squid found in calamari.  I'm used to (and much prefer) the squid legs, especially the crunch of the suction cups when it's cooked perfectly.  But otherwise, hipster or not, you can get a very flavorful, authentic Korean meal at Ssam.", "author": "Paul J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-17", "description": "The worst Korean food I ever eat.The soup and short ribs are super super super salty only the chicken wings is eatable they waisted my time and money", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-28", "description": "I found this spot almost by chance and was really excited to try it ! It is on the length of smith street in Brooklyn that has a handful of good restaurants. The scallion pancake was split for an appetizer and was very good. The salmon bibimbap was great ! It came in a hot stone pot and had a large portion of salmon. \n\nThe interior is a little dark but it is fitting of the other decor. Besides it being a little cold I enjoyed the ambiance. Can't wait to go back and try some of the drinks !", "author": "Allie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "Had a great anniversary lunch with the wife yesterday at SSAM  the service was quick they were very kind and attentive even when they made a mistake by not bringing Our  drink to the table they ,went above and beyond to not only give us a drink complementary but we're very apologetic and Kind. this matched the food and service\nWould definitely recommend this place for friends and family also I love the decor very rustic. Great atmosphere some music but nothing that will upset your experience of the great food.", "author": "D. W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-19", "description": "Stumbled upon this place after having a few drinks at Zombie Hut and waiting for five hours from a call from Lucali (we obviously gave up on that one). This place could use a serious upgrade in the staff's attentiveness as we waited quite some time for water, orders, and our food, and then had to flag down several people for our bill.\n\nI asked the servers for recommendations and the servers kept pushing their soups even though it may have been 90 degrees that day. I was shocked they did not recommend anything else on the menu including the Korean BBQ options.\n\nI liked the interior of this place and my friend and I sat in one of those wooden booths which was cute and intimate. I also appreciated the music (perfect volume for hip hop on a Saturday evening). \n\nFood:\n- We ordered the soy garlic wings which were as good as you'd expect them to be. 7/10 - I'v definitely had better\n- We also ordered the bulgogi from the Korean BBQ menu - it took us quite some time to get the rice accompanying this dish.\n\nIf you're in the area looking for Korean, I'd recommend it, but definitely not worth hiking to. Check out Camp next door if you want to roast some s'mores!", "author": "Michelle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-29", "description": "TL;DR: SSAM has savoury Korean dishes, but not traditional as the dishes and ingredients are catered toward the Brooklyn/American palate. The spicy squid and pork kimchi jeyook are the highlights.\nVERDICT: I recommend but expect something tangential to Korean fusion.\n\nMade a reservation for SSAM for a Saturday dinner. They had a table ready for us right on time. The ambience is casual but on the trendier side with respect to its decor and menu. Great for friends, family, and dates.\nThe dishes that I liked the best were the pork kimchi tofu jeyook and the spicy squid. Both come sizzling on a hot skillet, which continue to grill the foods and keep them hot. The grilled crispy onions with the pork and kimchi were great. The spicy squid came with large pieces of squid and noodles; there was a good kick to it.\nThe eel bibimbap was interesting. It had chopped kale, which was different from what normally goes in Korean bibimbap. It definitely added an unexpected taste to the dish, though it was not bad.\nThe dish itself was seasoned well with the veggies and eel. The seafood soondubu had much more traditional ingredients with generous amounts of seafood.\n\nThe staff is very friendly and attentive. The restaurant is clean and spacious so no complaints here. SSAM is a great introduction to Korean food in the Brooklyn neighbourhood without having to go to Manhattan or Queens. I recommend it!", "author": "Jem S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-04", "description": "I ordered the Eel bibimbap - good, classic bibimbap but left me wanting more traditional toppings. The eel itself was delicious. \nMy boyfriend first ordered noodles which were incredibly terrible. The veggies tasted like they were frozen and microwaved and the noodles themselves were over cooked and bland. He sent them back and got fried rice in exchange which had a piece of metal in it, looks like it came from a dish scrub. Seriously?", "author": "Emma D."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}