{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-11", "description": "SSAM turned out to be a very special surprise.\nWe were walking by and the smell was so fragrant, we just had to poke our heads in.\nAs we reviewed the menu and observed some of orders coming out , we had to give this place a try.\nAnd we were not disappointed.\nWe sat at the bar and had some good conversation with Danny the bartender as we waited for our orders to arrive.\nThe vibe of this restaurant was very welcoming .\nAnd had a cozy feel to it.\nThe food was prompt and well prepared and the flavors were spot on for Korean fare.\nHighly recommend a visit to SSAM ... we'll be returning very soon.\nNot mentioning what we had so not to sway you.\nBut do not miss the Bo Sam ... Pork Belly appetizer\nand the chicken wings.  \nStart with those ...", "author": "Kenneth P. T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-16", "description": "I would say this is a very mediocre Korean restaurant. My friend and I came by around 6:00 PM on a Wednesday night and it was empty. We were quickly seated and ordered the following:\n\nSoy Garlic Wings ($9.00): nothing too special about this. The soy garlic taste is definitely there but this was a very average dish.\n\nTruffle Parmesan Fries ($8.00): these fries were good and the portion was big for two people. Is it a problem if I thought the fries were the best part of my dinner?\n\nPork Belly BBQ ($21.00): I had some sort of expectations for this dish because I mean.. Korean cuisine... pork belly... can't go wrong with that. My friend and I were both very disappointed. The pork belly was extremely dry and pretty tasteless... it was also very hard to chew. I would not recommend.\n\nOverall, not the best experience and I don't recommend. There are better Korean spots. I don't think I will be returning.", "author": "Racheal D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-06", "description": "After binge watching Mukbang videos while experiencing the worst of my PMS symptoms...I decided that I NEEDED spicy seafood ramen and some rice and fish cakes ASAP. Thank god for my wife and her ability to locate this place on Uber Eats. I mentioned my hankering and she got to Googling... I was able to recreate what I had been watching and while I was a bit nervous about what the experience would be like because of some of the reviews/photos posted, we placed an order anyway and girl...my Korean fried chicken was SLAMMMMMMMMIN' , and my spicy seafood soup was also SLAMMMMMMMIN'. The food gods blessed me with a ton of shrimp and calamari. The rice and fish cakes were also SLAMMMMMMMIN'... My wife ordered some beef joint with rice...the beef was tender and delicious. I almost ate her food too. GOOOD! I mean GOOD! Delivered quick and HOT! Shiiiiiiit....\n\nThis PMSing girl was HAP-PYYYY... I mean Happy! I cannot tell you... After one disaster meal upon another... you begin to wonder whether or not you are fool for ordering food for delivery. For a while, I just stopped altogether because all of my favorite restaurants were either getting my order wrong or just sending me cold and disgusting inedible food. \n\nNot this time. This was worth it and the next time I need a fix...this will be  it.", "author": "Tatiana S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-04", "description": "In a sea of sushi and Thai, Ssam is a welcome Korean change of pace. And although it may not be K-Town, they offer good food at a good price.\n\nThey've got your Korean favorites including bibimbap, galbi, japchae, pajun, budae jiggae...or maybe those are my Korean favorites...either way, they are good. They've got a few bones they are throwing to the white people, like avocado and kale salad, bulgogi nachos, sliders, truffle fries (very solid), and ramen (which I'll never order because I believe in getting ramen and sushi at ramen and sushi places). \n\nThe lunch special in particular is a winner. It'll run you about $12, but you can get bibimbap (fairly loaded with meat), or alternatively a half dozen wings, fries, a salad, and some eggs. Along with some kimchi and pickled cucumbers, this is a damn good meal.\n\nParent Pro-Tip: Bibimbap is an excellent choice when you have a kid, as the stone bowl ensures it never gets cold as you deal with their every need.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-03", "description": "I was craving stew... because believe it or not, while it's Spring in NYC, feels like winter never left.  I yelped for a recommendation and SSAM popped up.  A brisk 15 min walk from jury duty... Korean eats, here I come. \n\nI love the decor, spacious, bench seatings, table seatings - good options for groups of 2, 3, 4 +!  Service was nice, although it was lunch hour, there were only a few groups dining.  They give you a small banchan plate of kimchi and kimchi radish - both were OK.  Bathrooms in the back near the kitchen. \n\nFood wise though, is where they lost me. I ordered a beef fried dumplings, which was ok, not outstanding and kind of bland.  Figure the dipping sauce will provide much assistance but it did not. The sauce needs a vinegar balance.  I also got my favorite stew, Yuk Gae Jang, a spicy shredded beef stew with japchae noodles. It looked soooo good! But then after tasting the stew... I wasn't sure, maybe I caught a cold? Because I couldn't taste any seasoning. IT TASTED LIKE WATER.  Spice Level - NEGATIVE ZERO!!!  Would it have been rude to ask them for salt and the red pepper paste??   Needless to say, I did not finish. \n\nOverall, I think I'll lump this one: \"Quasi Korean Food Made For Gwai Lo\".  Hey, it's not KTown. It's Carroll Gardens. #fancybrooklyn", "author": "Karen Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-28", "description": "Great place to go w/ a group (or smaller, but it's got group atmosphere and space). Since White Tiger, one of my favorite Korean food haunts, temporarily closed down in Prospect Heights, this is my new Brooklyn Korean spot. Yummy food, so so service and special cocktails. Happy hour specials, even on weekends, before 7 PM. \n\nOdd tidbit: the suggested 20% tip was listed on the bill as the post tax amount. How weird is that? We gave a little over 20%, but on the pre-tax total. \n\nI'll be back!", "author": "Felicia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-12", "description": "Really excellent food- well seasoned cooked to perfection-\nFabulous service, yummy stuff.. nice sake collection.  Bimonbap and japchae .. oh my!", "author": "Susan T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-27", "description": "I'd consider this place Korean fusion and not traditional at all. Overall 3.5/5\n\n\nAmbiance (5/5)\n\nCute space with cozy tables on the sides and long tables in the center. Unfortunately we had to share one of the long tables with two other couples.. one was too loving (the lady was all over her fiance) and the other couple had a guy who's vocab was limited to using the f-bomb every other word. Else it's a very nice space.\n\nService (2.5/5)\n\nThe servers are rather slow.. they move quickly but don't come around often enough.  I wonder if this is due to not having enough servers or if they just don't appear often.  We were never given the banchan but did receive it after asking.  The two seated on either of side of us never received theirs either, but a server did give some to those seated behind us.  \n\nWe had to flag down the servers for sauce for the bibimbap... for more water.. for a new order of soju.. it was a LOT of flagging down!  Overall, not great service!\n\n\nFood (3.5/5)\n\nTruffle fries [3/5]\nVery light truffle taste -- so light I sometimes wondered if I ordered overpriced fries... they could use more truffle and more Parmesan. They were pleasantly crispy, however they had a spicy mayo that wasn't very good.  I wish it came with garlic aioli instead. \n\nGalbi Dolsot Bibimbap [4/5]\nThis would have gotten a higher review if it wasn't so overly hot that several parts of the rice were burned black!!  The meat was very tender, but the dish is a bit bland until you add sauce.  With the sauce, the meal is good.  The rice is nicely crispy (except the burnt bits).  The bowl was so hot it also overcooked the egg.\n\n\nPork Belly Ramen [4/5]\nThis is not a traditional ramen by any means.  The broth is super creamy and tastes a bit like cream of mushroom.  The pork belly is pretty tender but also tastes like it was dusted with cinnamon or cardamom... very strange... and not very Korean.  This dish also had some cabbage.  This was not at all spicy, but unique.  Definitely not a Japanese or Korean style ramen. \n\nWatermelon soju [3/5]\nVery sweet and tasty but the glass came with 3/4 ice!!!  I've never been served so much ice in soju my whole life!!  I feel a bit ripped off on this!", "author": "April T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-05", "description": "My little sister wanted Korean wings for her birthday so I suggested this place since I've had it bookmarked. There aren't a lot of Korean wing places in Brooklyn so I was excited to try this one. We got to the restaurant around 7pm and there was a few parties.\n\nAfter we placed our order, I notice that other tables have side dishes like kimchi and pickled cucumber. Since everyone in our party wanted the side dishes, I asked the waiter if we can get some. He gave us 2 kimchi and 1 cucumber for a party of 7. Could have at least gave us 2 side dishes on each side of the table. On top of that, never ask if we wanted refills.\n\nFor appetizers, we order 12 soy garlic wings and 12 spicy wings. The wings were okay, it was nice and crispy. We also order 2 seafood pancake and only 1 came. When we got our entrees, we figured they probably forgot about the second one so we told one of the server. Then he went to check it and eventually that came. \n\nMy sister and I got seafood soondubu. As I was eating the tofu and drinking the soup, I was wondering when will I finally get some seafood. I realized, there was none. I asked my sister if she had any seafood in hers and she said she doesn't either. We told the waitress and I guess she told the manager. He offer either to remake it or take one off the bill, so we just asked for it to be taken off the bill since we didn't want to wait. On top of that, our egg was fully cooked with huge egg yolk. From what I see on yelp, people got like raw egg on top of their soup which I prefer since I like the egg mixed in the soup. The soup was okay, didn't have much flavor either. \n\nSo the wings came with like two huge ceramic trays and we also had like tiny plates for those wings. The waiters/waitresses never took any of those away. It was in the way for everyone so I moved everything to the edge of the table on my side since there was space. I guess they finally saw it and took it away.\n\nOverall, not a good experience with the food or service so probably won't be coming back.", "author": "Lisa C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-12", "description": "I was thinking about going to the German beer garden across the street but I accidentally stepped on their happy hour sign outside. \"I am sorry\". $6 for cocktial and $5 beer and a few other I can't resist but ends at 7pm and it's only 6:55pm. \n\nOn a Friday night, the place is not super packed. I can easily get a booth table enough for 4 or more. This spot ended up as a perfect date spot. With the correct ambiance and deal on drinks, we had a great time. Beside not having to yell at each other and overhearing someone else conversation, the waiters are so nice. \n\n\nFood is delicious. We just got some tapas including their wing, kimchi pancake and some pork belly. Their Seoul mule is strong and huge which is well worth the $11 or $6 happy hour special. It's equal to two drink size tbh. The hot toddy is decent but I would go for something else. \n\n\nWing is pretty good. I think they need to be marinated a bit more as the flavor isn't all the way into the meat. The kimchi pancake is a bit sad due to the size and it's not midtown quality. They need some more work or a better recipe. This place has potential but need more work on their food of course. The bar is a good deal and drinks are on point. The noodle we had come in a sizzling hot plate but it ends up burned at the bottom. Good show but not ideal for eating. \n\nService is 100 %. Everyone is super nice.", "author": "Kevin Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-14", "description": "I've been here twice already! The food is great and it doesn't get overcrowded in here. While you wait for your food, they give you Kimchi and this Cucumber Salad. So Good!\n\nI've ordered the:\n\nRock Shrimp\nSpicy Squid \nKimchi Fried Rice\n\nAll were excellent!!!\n\nThis place is great for a date night or group outing. Very cozy.", "author": "Maya A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-21", "description": "This review is for their take out.\n\nWe ordered their beef bibimbap and kimichi avocado stone bowl. Both of them are just not bad. But considering for their price, I am a little disappointed. They really tasted like rice bowls that you could buy in a Korean convenient store. The beef in bibimbap was over cooked. All the ingredient in both dishes just didn't match very well, and seemed to be just placed randomly on top of the rice.", "author": "Chloe M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-24", "description": "Ssam was not terrible, but disappointing considering the lofty price points.  Haven't become accustomed to K-town, I expected a glorious banchan array but Sssam gave only 2 measly portions of kimchi and pickles.  I was confused by my order, bulgogi barbecue, because I expected the usual lettuce leaf to wrap and meat and sauces, but instead it was served with mixed-green salad and gochujang.  I threw it all together in an improvised rice/salad/meat bowl, but it was not what I was hoping for.\n\nIf you're here, I'd recommend bibimbap which is lower priced and its flavors are good.  \n\nI also had to work to track down servers every time I needed anything, which was frustrating because there were only a few other patrons.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-29", "description": "I have been wanting to step up my Korean food knowledge and consumption for a while now. SSAM seemed like a beacon calling out to me for just that reason on a random night of wandering around Smith Street in searches of a dinner less boring than anything my freezer had to offer.\n\nSoy Garlic Wings: I tend to be picky when it comes to wings, but absolutely loved these! Crispy on the outside, juicy on the inside, not too much sauce - really just no complaints with these. I would definitely get the wings again.\n\nOh-SSAM: Vegetables were perfectly caramelized, and the dish was well-spiced and flavorful, but the meat only took away from the overall quality. The octopus was extremely tough and rubbery, and the pork belly was dry and overcooked. Surprisingly enough for my taste and food preferences, I found myself wishing that I would have gotten a vegetarian entree.\n\nTruth be told, I did have higher expectations than the experience at SSAM's turned out to be and I did not get the Korean BBQ experience I was hoping for. Perhaps this can be my new not-so-secret wing spot.", "author": "Nataliya M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-08", "description": "It's very unfortunate for me to write this poor review because I was initially excited to discover a Korean wings place in Brooklyn (usually have to journey to Flushing for my wing cravings). I'm honestly shocked by my substandard experience since this place seems to have good reviews. \nMy BFF and I ordered truffle parmesan fries and the 6 piece half and half wings. The fries were ok; I've had better truffle parmesan fries in Flushing. What was extremely appalling and disrespectful were the wings they served us. They were abnormally small and misshapen, as if they got these deformed chickens from a nuclear plant and were inflicted with radiation.  The wings barely had any meat; it was mostly bones and fried skin. If there was any morsel of meat, the meat was tough, stale, and hard to chew. The \"spicy\" wings were not spicy at all, just salty. \nBottom line: waste of money, never coming back here again. Fellow Brooklynites, if y'all are in the mood for some good, tasty, tender Korean wings with plenty of meat on the bones then save your time and cash and head to Flushing. Honestly, the food alone will compensate for the lengthy commute.", "author": "Belle A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-24", "description": "Stopped by for a happy hour drink, ended up staying for some food. I forget what the exact price was but all of the drinks during HH were $8-$9 from their set cocktail menu. I picked their mule option that was made with Sapporo instead of Ginger Beer. It was actually very good and coming from some one who love miles and ginger beer that's saying something. \n\nPicked up the HH fries, super cheap!! They came out super crunchy and crispy just the way I like them. After sitting there for awhile I also ordered the Boneless Chicken with Soy Garlic sauce. They were excellent. The chicken alone will make me come back here. \n\nMost of the dinner items are pretty pricy so this isn't a place I would come to without a HH.", "author": "Amanda D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-27", "description": "Went here today the service was quick and friendly. When we arrived at the place the young lady sat us we order quick lol and boom 10min later the food came out. The atmosphere was relaxing and they had a great playlist playing in the background.  However,  for the food we order hit the spot. We order the chicken wing platter which brings one egg, white rice, salad and fried with 6pcs wings, and also order the kimchi fried rice with spicy pork. I reccomend this restaurant for anyone looking for a delicious Korean spot.", "author": "Nick .."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-12", "description": "I've been here twice and each time was a little underwhelmed by the food. The service is good and the environment is nice, spacious and cool design, but their dishes (including the kimchi side dish) are on the saltier side. We ordered the chicken dolsot and the seafood soondubu and both were rather salty. I am not sure if they are consistently like this or just happened to be so for the two times I was here. But I personally would hesitate to come back.", "author": "Jing L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-16", "description": "I've been meaning to go to SSAM for a while, and it wasn't until we tried to watch the World Cup Final, that we ended up here. It was the only place with a ton of seating and a TV (albeit a small one, and only one).\n\nThe place was packed, so I won't fault them for their service. They were running out of mugs and pitchers, but the bartender was super cool and made sure we got everything we ordered.\n\nThey were also running some awesome deals. Sapporo draft beers were BOGO. They were offering 25% off non-lunch special dishes.\n\nThe Korean fried chicken here is serviceable. Definitely not close to the best I've ever had. The skin just wasn't crispy enough, and the boneless wings were a little too chewy.\n\nThe bulgogi bibimbap ($13 lunch special) was pretty good. Gigantic bowl (though they ran out of stone bowls, and it was served in a big salad bowl, so there wasn't that crispy goodness on the sides). Lots of meat. Nice runny egg. With kale, which was interesting.\n\nThe space is huge (though with only one TV, the entire bar was crowded around the front). They have communal wooden tables as well as booths and regular tables near the back.\n\nWould definitely stop in again for a low-key Korean meal!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-12", "description": "Delicious tteobokki, i asked them to add mozzarella cheese on top, so good!! We also ordered japchae and bulgogi with mozzarella, it was okay I've had better.", "author": "Katherine S."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}