{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-03", "description": "Beautiful deep long space, with wooden benches and furniture, this place is 5months old. Server is Korean guy Steve. Food is authentic. I love how the chopsticks and spoon are sliverware! True Korean style  (not plastic disposable takeout ones)\n\nOrdered the Bimbimbap lunch special (Veges, egg, bulgogi beef) for $10.95 plus tax\n\nI live near here and have been passing by - finally walked in to try their lunch special today (3Nov2017)\n\nDefinitely see lots of things more on the menu I want to try. I love Korean food and so happy this place opened up near me- will definitely be back to try more", "author": "Yun Chun C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-07-04", "description": "Me and my friend were really hangry, so we were excited to check out this chic looking korean spot. It turns out the kimchi fried rice was very bland, we could not swallow the fried rice without the hot sauce. Also we ordered kimchi fried rice with bulgogi but it didn't come with bulgogi. The fried chicken was good though. \n\nOverall would not recommend, may be a good spot for happy hour.", "author": "Rae L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-20", "description": "This was a true disappointment.  I came on a Tuesday night and there was 1 large party of 10 and about 5 parties of 3-4 people. There was only one server working and possibly a manager/bartender who mostly stayed behind the bar.  I arrived at 8:30 PM and it took 30 minutes for the apps to come out and a hour for the bimibap. \n\nWe didn't even order hard entrees or apps. Waste of time.  Wings were cold, scallion pancakes were warm at most.  Bimibab came out sizzling hot but only after an hour of waiting. \n\nWon't be back.  Please upgrade your service staff to be more efficient.", "author": "Karesa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-02", "description": "The pork hot stone was delicious. [I forgot a picture :( ] My friend got the Spicy Chicken Hot stone. However, I am giving this place a four star due to its lack of staff and slow service. The environment was amazing and felt welcoming, but there was a single waiter on New Years. So; the four star is for the food and environment.\n\nThe food took about 40 minutes to come out. We weren't even able to order until 30minutes of waiting and we didn't receive our utensils and water till 10 minutes in. As it was New Years, it could've be the reason why there was one server and the service was slow. I hope to visit this place on a non holiday day to see if the service is any better.", "author": "Kimberly W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-28", "description": "Atmosphere is very cozy and relaxing. Service was quick, and the servers were very polite and efficient. We ordered the bulgogi nachos, spicy pork shoulder bibimbap, and cold summer noodles with apple, radish and egg. DO NOT ORDER the bulgogi nachos - this dish dragged their review down immensely; they need to take it off the menu!!! A pile of tortilla chips with a handful of shredded cheese and a few slices of bulgogi beef. The drizzle of spicy mayo sauce is barely noticeable, and the entire dish is bone dry. Not worth your while, trust me! The spicy pork shoulder bibimbap was the best dish - sizzling, flavorful, and very delicious. The cold noodles are weren't great. Noodles were starting to get soft and the beef is very dry and powdery w/ no flavor. The soup was okay, but a little heavy on the sweet side. Overall, we would not come back because of the food. The nachos... what a nightmare.", "author": "Cora M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "Cozy and warm Korean restaurant. \nPro: big space, nice vibe, good service, food is good\nCon: female's restroom kinda cold \nWill come back with friends. \nHappy to find a good spot to hang out ~", "author": "Nicole L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-14", "description": "SSAM has terrible customer service. They forget to bring out water and plates as they're serving. The food was below average and it didn't taste fresh at all. I would highly recommend not coming here if you want to treat someone out. The only nice thing I enjoyed was the decor and lights.", "author": "Michelle Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-23", "description": "Had lunch here after renovations. Man, I am loving the new setup they got here. It's definitely got a vibe where you can chill with a drink and lunch which is a great time to be here and away from the same old sandwich upon sandwich upon coffee places. \nNow for the food. Wings are out of this world. The bones look like it's been sandblasted once I'm done. \nThe Japchae is also good. More real ingredients than noodles compared to other restaurants. \nDynamite chicken, I liked it...\nThe seafood pancake is packed. They don't go cheap here\n\nGood for first dates and second and group", "author": "Thomas C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-19", "description": "Bottom line is they lost me as a customer due to reduced portion sizes. \n\nLongtime customer and have ordered from Ssam during its former and present management. As much as I want to support a Brooklyn Korean restaurant, I won't be ordering from them anymore. Their portions have become paltry. Ordered two dolsot bibimbaps and the portions are probably 60 percent of what they used to be. Too bad because the food still tastes good. Shame the present management decided to cut back on portion size. Hard to justify spending 18 dollars on what looks like a lunch special portion.", "author": "Christopher C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-07", "description": "Ssam dishes are missing here... like ban chan - the small side dishes they serve you at other korean restaurants. For city prices, I expect something of similar quality/quantity. The fried chicken was really good, but we had to ask for pickled daikon to come with it. The bibimbap was tasty, but the spicy chicken with cheese on top was missing that cheesy action. They sprinkled some mozzarella, and called it a day, but when I order a cheese dish I expect some serious CHEESE action. \n\nWas really bummed about the ban chan and the lack of cheesiness. You'll have to know what to order to get a good experience outta here (bibimbap/fried chicken) or else I would recommend going to ktown or maybe a different restaurant. \n\nWaiters take their time and dont quite remember to check up on you or refill your water despite how empty the restaurant may be. I was really hoping for a good Korean restaurant without having to go out too far!", "author": "Carmen W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-08", "description": "I thought it was odd they were still undergoing renovations in the back/kitchen/food prep area, and had the front of the restaurant open for service at the same time. I also could see they were very sort staffed but were trying very hard to get to some unhappy customers who waited awhile for their food. Really really really wanted to like this place because the food was good (great wings, hot stones) but pained to say we got sick after eating here :(", "author": "Dana C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-06", "description": "I came here for my birthday a while back and I had the most amazing time. The food and drinks are delicious. We had the soy garlic wings, bulgogi, and lychee soju. All delicious. My favorite is the lychee soju, made by Halil! Ask him about it. The service here was really accommodating and they do a really good job with parties. Also, it's a REALLY spacious place, so you don't feel cramped like a bunch of other places you go to in the city. It's close to the F train, so it's not too far from everything else either. 5/5.", "author": "John C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-06", "description": "Cons:\nService is on the slower side(we had to keep flagging down a waiter/waitress to order, water wasn't given immediately).\nSlightly disappointed no side dishes were offered, but this place isn't a barbecue house.\n\nPros:\nWe were a party of 6, with no reservation, went in around 8pm on a Friday night, and were seated asap. We were definitely on the luckier side since once we sat down, the crowds started rolling in.\nDecor is cute, they have open seating, tables, and a booth with a hint of Korean tradition.\n\nFood was so good. My favorite of the night was the bibimbap, chicken wings, and tofu stew. I actually quite enjoyed everything we ordered, but I'll divulge on my faves.\n\nBibimbap - no amount was enough for us, the rice was so perfectly crunchy at the bottom (but not burnt) and with the sauces added in, it really brought it home\n\nChicken wings- SO CRUNCHY BUT SO SOFT! Spicy was alright for me, but I  the soy garlic.\n\nTofu stew(Sundubu) - EVERYONE TOOK ALL THE SOUP AND ADDED IT TO THEIR RICE, I ONLY GOT SCRAPS \n\nBrooklyn doesn't have many Korean joints, but SSAM definitely takes the cake among the ones I've tried. This is as close as you'll get to KTown or flushing without the travel.", "author": "Joanna Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-03", "description": "We came here for lunch and were literally the only two people in the place. Our server, I hope his sake it was his first day of work. We tried to get dynamite chicken once my friend found out it wasn't that spicy. When asked if they have fries and he said no they don't serve fries. So I asked him what kimchi fries are and he said they are fries. I could only blink on confusion. We ordered wings which is what the two stars are for . So about 29 min later the server comes back and says the dynamite chicken is spicy. So we got rock shrimp. Another 15 min goes by and he says that they are out of kimchee and can't serve only just fries. My question is, if we are the only ones here, what the heck are you doing that it takes you so long to come back to your customer with answers to things you should have know already. I could go on but you get the idea. Go to bonchon instead.", "author": "Joey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-21", "description": "Very casual place with a lot of seats, perfect for an after work get together. The food here is good- nothing out of this world but I like how their menu offers Korean classics with American twists. Our waiter was attentive and friendly, stopping by the table several times. \n\nChicken wings- we got the 12 pc half soy garlic half spicy flavor (only 2 flavors). I personally preferred the soy garlic, the spicy wings just had heat to them, not a specific flavor. I was craving Ktown wings and the ones here are really crispy on the outside, tender on the inside, which is how Korean wings should be so this made me happy!\n\nSeafood pancake- a little on the greasy side, but I think that's expected with this dish. I thought the center was a little too gooey, but my boyfriend didn't mind it so that might be a preference thing. \n\nBulgogi sliders w/truffle Parmesan fries- soft bun and well marinated meat, this was a good tapas dish to share between 2 people. I didn't really taste the truffle but the fries were still good. \n\nOverall, good service and they have well priced drinks here that mix and match things like Soju,\nPlum wine, lychee etc. There are also regular beer options and they have happy hour from 5-7pm. Would come again!", "author": "Sharmin A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "It's pass 6pm, one person is servicing the whole restaurant.\n8 tables. 3 waiting to pay, 3 waiting to order and 1 waiting to be seated.\nI've been here many times before. \nIt's never been the best but this is pretty sad.\nEveryone that is waiting already seem annoyed.\n\nAnd lastly, order take out the other day and they switched to a more economical foil package.\nThat ended up leaving everywhere.\n\nTo management, what are you guys doing??", "author": "Hagu C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "Came with our granddaughter. Really enjoyed the Korean food which was spot-on for flavor and quality of the dishes. This family-run place even gave a little extra egg dish to our granddaughter, who really enjoyed the experience. The atmosphere is rustic casual. Highly recommended for a Korean choice in Cobble Hill.", "author": "Darryl R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "HALIL makes a MEAN lychee and cucumber soju drink! All the guests were raving about his soju drinks. The staff was amazing at helping me host a surprise birthday party. Halil \u0026 Danny were generous, attentive, fast, beyond kind, and so amazing!! They really cared and went above and beyond in helping our event go smoothly. I would definitely host another party or come just back again for a meal. \n\nI highly recommend the soy garlic wings (best I've ever had) and the ssam gyup sal (pork belly). Their portions are generous! \n\nThe atmosphere is very nice and spacious. All the lights create a very romantic and welcoming environment. The photos don't do it justice. I didn't want to leave! All the guests were happy with the food and service.", "author": "Julie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-03", "description": "This is one time I should've listened to the previous reviews. I ordered the beef bibimbap, never again. The rice was hard (like when you burn the bottom of the pot) and the beef was overcooked and very dry. I will say, the flavor was nice but crunchy on the rice and dry meat made it difficult to enjoy", "author": "Naimah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-15", "description": "The place is amazing. The design and the lighting really made a great impression on me. It's definitely not your typical Korean BBQ space. They cook all the food in the kitchen so no worries of coming out of there smelling like BBQ: another awesome plus. The music was very chill and not the norm Kpop music which was another awesome plus! Don't get me wrong, I do love watching those videos. \n\nWe got the 12piece wings half soy garlic and half spicy. Yum. The bulgogi quesadilla was yum too. But man oh man, OH MAN! The boneless galbi was off the hook!! And it came with veggies! Usually, you have to order veggies separately. I was highly impressed! It had Brussels sprouts, mushrooms, red bell peppers, asparagus, and onions. Since they cook in the kitchen, the galbi was served on a skillet. Made the mistake of thinking it cooled down halfway through eating and burned my tongue a bit. Not at all a complaint. Was more impressed that it stayed hot the entire time it was on the table. I didn't get a cocktail but they had some great choices there and will definitely get one the next time we go. \n\nThe staff were very friendly and left us alone to eat with friends so that was also a big plus. Most places the staff is okay and can be rude or not helpful. This made our experience that much greater. Wish I lived in Brooklyn or NYC for that matter coz I'd definitely come here more often. We don't have this kind of chill place in DMV. \n\nHighly recommend this place anytime you're near. Wish they were in the DMV area.", "author": "Currita A."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}