{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-29", "description": "My parents picked this spot to eat for lunch. When we entered, they didn't have heat on right away and it was freezing inside. We all had to order hot, green tea to stay warm. \n\nThey had lunch specials and I ordered the hot stone bimbimbop with beef. It was not as hot as it could've been and not crispy on the bottom of the bowl. We did order a bunch of appetizers to share including the pork belly taco, etc.", "author": "Jessalin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-05", "description": "Nice atmosphere and friendly staff. Good place to go for Korean food. Good lunch specials. Quiet and peaceful place to relax during the day. Food is  !!", "author": "Nina A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-21", "description": "I came here and was weary because I am not a big fan of trying something really new without looking at the menu but I was not disappointed \n\nThe place is spacious and has a nice ambiance too it. Its great for groups. I went on a rather empty night so the servers were attentive but not overbearing. \n\nI ordered the noodles and Korean chicken wings. The wings were DELICIOUS. The noodles though, not so much. They were thick and slimy so for me, personally, it was not good. I do believe that depends on the person. My colleague likes the noodles and took the remainder of mine home. \n\nI would have given four stars if they weren't as expensive as they were. Each person paid 35 (x4) and we only had 2 orders chicken wings, a salad, a rice and a noodle dish. Overall, seemed too pricey and not worth it. \n\nI would come back for the wings.", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-13", "description": "Oh geez. I ordered here twice before and loved it.; no craved it. This time was such a disappointment. The stone rice wasn't crispy, but just steamed. The beef was fatty. Everything oily. :( \n\nFor $70 delivery what a bummer. This place isn't going to last long if they don't correct their quality. Sadly, I won't be ordering from here again.", "author": "Heather P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-13", "description": "They have no kimchi here today. Come on! Service is fine. Food is good, but if all the things in the menu half have kimchi and none are available because they can out of kimchi", "author": "Andrew S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "One of the best Korean food spots in Brooklyn. The ambience feels cozy and unique. Definitely coming back here. Must try the spicy chicken wings!!!", "author": "Maria P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Had a spicy pork bibimbab and galbi tang, and they were very good. I also ate korean foods from other restaurants at NYC, but this place was the best. Service was good too!", "author": "JK M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-09", "description": "I tried ribeye steak with sake and gluten-free tofu bibimbap.\nIt was awesome. I will come back to try other dishes.", "author": "Jihyun L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Really cool vibe in the place, I really liked it! Liked it so much I started eating and messed up the egg before taking the pictures. The food is amazing of course. I got the Gabli bibimbap which was really good I'd definitely recommend if it's your first time here!", "author": "Anna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Incredibly casual and large space.\n\nOrdered the squid bibimbop and split the kimchi pancake (jun pancake I believe)? Bibimbop was freakin' awesome, the pancake wasn't skimping on the kimchi.\n\nLooking forward to coming back .", "author": "Gabby S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "Awesome vibe and great food. Nice addition to the neighborhood!\n\nOrdered boneless soy garlic chicken for an appetizer and bulgogi bibimpap and it did not disappoint. Will be back soon!", "author": "Carlo D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "A very cute place! Cozy table and nice music. Good place for hanging out with friend. The food are pretty nice, I will recommend you to try budae jjiae, kale and avocado salad, shrimp Gypza. cheers.", "author": "Shiqi W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "SSAM is one of the best Korean restaurants in Brooklyn. The waitress was very attentive and the food was great. The place is dimly lit but has a great ambiance. I always come for the wings and drinks.", "author": "Cindy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-16", "description": "Pretty good Korean for Brooklyn. Great seafood pancake and BBQ.", "author": "Betty Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-14", "description": "Soooooooo good! I had the bulgogi bibimbap and it was so flavorful and filling! Def coming back!", "author": "Katherine L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Excellent spot! Very cozy place with authentic Korean food for hanging out with friends. Pork belly BBQ, Seafood soft tofu stew are great. Would recommend!", "author": "Patrick X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "This place is super fun! Our toddler really loved it and wanted to try everything. The staff is super nice and someone even came to doctor up my drink when I was halfway through. \n\nGreat food and super kid-friendly! And Smith street is great in the summer time.", "author": "Robbin V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-10", "description": "Restaurant doesn't answer the phone. Delivery is 30 minutes late and counting. I contacted GrubHub to cancel my order. No clue what the food tastes like because it never got here.", "author": "Paraag S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "Absolutely delicious -- friendly service and great ambiance too. I got the soy garlic wings, delicious -- not overly breaded but flavorful and crispy. I also got the kimchi fries and WHOA. Fries stayed crispy in spite of being covered in kimchi and cheese, all served in a rectangular ceramic baker and just generally scrumptious (especially on a cold day).", "author": "Mary G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-10", "description": "Friday evening front of the restaurant is almost full but the back is empty. We're immediately directed to our table with our first steps in. It's the same for all others who walk in. \n\nEven after we look at the menu and are trying to make eye contact that were ready to order, it takes another 10 mins for someone to come over and this is me hardcore trying to wave someone over with my eyes. \n\nI order, he repeats my order but the appetizer still comes out half wrong. We ordered the seafood pancake and get the kimchi one instead. However it was delicious, the flour they used was orange in color and tasted maybe like sweet potato?  The kimchi fried are a must - crispy fries topped with cheese, kimchi for a little kick, a little bit of a sauce, and scallions - superb!\n\nSoy ginger drumsticks are crispy yet moist on the inside. Beef bibimbap could have used more meat ($3) for extra but was still a good comfort food entree. \n\nWould def return!  We were skeptical but it's the best korean food I've had in brooklyn yet!", "author": "Thy L."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}