{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-04", "description": "The food is absolutely delicious.  The service was quick and friendly... and the quality of the food really brought out the authenticity of the restaurant.  I have seen ssam  for over a year now , and always looked in wanting to try this place. Just so happened to crave Korean food for dinner and hear I am. LOL I will be coming back I recommend this place to anyone who knows and loves authentic Korean food.", "author": "Gabriella J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-28", "description": "Great service right from the start, attentive and gracious. \n\nI got the spicy pork hot pot by the recommendation of the staff and it was both hit and in a pot. Also it was damn good. Full of flavor and spice. \n\nWill come back many times", "author": "Henry W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "Awesome place, awesome location. They have an amazing deal for $1 wings. Don't let the price deter: they taste like they cost hella more.", "author": "Merone T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-15", "description": "We were staying in the neighborhood and it's a cozy place to grab lunch and good food.", "author": "Landon P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-29", "description": "To start, the food was splendid. It was flavorful and probably the best Korean BBQ I have had in Brooklyn! The service was incredible. The server I had was incredibly kind and patient when I went with my family (5 people). I will visit again with my friends in the future!", "author": "Jenny B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-12", "description": "Great neighborhood place with delicious bibimbap and amazing scallion pancakes. Quick and friendly service. Cool ambiance - love the music.", "author": "Brett S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-19", "description": "Delicious food and great atmosphere! Fast service and romantic venue in Carroll Gardens. Loved the selection of food and the Galbi Dolsot! Will be back soon!", "author": "Suzanne L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-17", "description": "Looks good but the Kali was not cut or served probably I was very disappointed.very gummy texture wasn't able to swallow or chew anything literally bit into two pieces unfortunately not happy about spending $35.", "author": "Allen G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-23", "description": "Great atmosphere and service. Food is not bad but not amazing. Slightly underwhelming for the price I think. I'd go back if I were in the area due to service and atmosphere, but the food is kind of meh.", "author": "Henrietta A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-09", "description": "This is a much improved version of the original Ssam. The food leans more toward Korean bar food, than a traditional BBQ joint, but overall pretty tasty. I guess the only complaint is the lack of banchan appetizers with the entrees.", "author": "Scott E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-31", "description": "Those who know me or have read my review know that I'm typically easy to please, except for when I review racist establishments. Please note that this review is about the horrible experience I had over here last weekend and NOT because of any racial-related treatment.\n\nI bought a groupon deal two weeks before visiting this establishment because of (frankly) the fried chicken. I always thought that Korean fried chicken were tad overpriced. I'm willing to pay for Bonchon type of goodness but not exactly ready to do so at an establishment that to me isn't a known quality (I live in cobble hill so people like me are generally deprived of Korean fried chicken unless we trek over to Manhattan on a non-work weekend.\n\nArmed with a $40 value groupon certificate I bought for $25, I walked into the store and ordered my fried chicken as take out. When it was ready the manager told me that he is consciously refusing to honour my Groupon.\n\nWhaaaa der fugg.... I asked him why and he tried to explain. I told him it's unfair for me to get caught in the middle of his mess with Groupon but it didn't matter to him. I had to pay for my take out. And I'm still out of pocket by another $25. My $40 voucher wasworthless.\n\n\nThe experience sucked. I don't know who's fault it was and frankly as a customer, it should not be me bearing the brunt of someone's screw up. The management said that Groupon sold this without their \"permission\". I paid for the meal because I did not want to be that person does not pay for his food. And when I called Groupon up, they said they'll refund the $25 and contact the management (over a week still nothing from Ssam or groupon) but refused to right the wrong. To me it was still wrong because I paid for something that I would not have ordered and paid for knowing how crappy the experience would be and that the voucher would not be honoured.\n\nMaybe Groupon was wrong, maybe Ssam was wrong but the bottom line is the customer suffered because no one wanted to do the right thing. Shame on Ssam, shame on Groupon. And no, I would not pay $39.09 for their overpriced fried chicken although this is something I'm not opposed to doing when it is delicious but still overpriced like Bonchon\n\nThe chicken honestly was not good. Wet and soggy and the sauce was very runny.", "author": "Terk C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "Stopped by here on a Saturday afternoon with the family;  great atmosphere and food.  Crispy kimchee pancakes, wings; Japanese beer on tap.  Satisfying and relaxed", "author": "Eric W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "One of the best Korean restaurants I've been to in the US. The bibimbap was delicious and the Galbi was some of the best I've had outside Asia. The service was great and the staff was friendly and helpful. 10/10 would recommend.", "author": "A D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-17", "description": "I wanted to like this place, I really did. After moving from Queens--home to many amazing Korean restaurants, I needed a go-to Korean joint near Boerum Hill. Reviews were super mixed about this place but I finally gave it a go to see for myself. It also looks like there a few fake 5-star reviews on here--accounts that just joined yelp and only have 1 review, no photos, etc...just beware.\n\nUnfortunately the food fell short..service was ok. I don't want to sound harsh but anyone who says Ssam has good Korean food clearly hasn't been to restaurants around Queens. Even Ktown in Manhattan has better choices. Somethings off about their KFC-the sauce and flavor seemed right but the skin wasn't crispy like Boka or BonChon. The bibimbap and soondubu (soft tofu soup) was lacking in flavor but still passable. Their seafood pancake was the most disappointing, from texture to taste, nothing was right. It almost seemed undercooked..like doughy eeek. \n\nThe best thing about Korean restaurants is the ban chan, free small side dishes. Yes they are free but Ssam only provided three measly and sub par ban chan dishes during my dinner. I don't expect the world but this is the worst ban chan spread I've ever encountered. \n\nSadly wont be back and don't really recommend.", "author": "Ashley L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-25", "description": "I ordered pork belly ramen, kimchi pancake, and kimchi fries. The food was really good.They make home-made kimchi. I will come back again.", "author": "Karen K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-02", "description": "We ordered Dolsot BiBimBop. It was delicious. The beef was perfectly flavored and cooked. The amount of rice and vegetables was just right. The accompanying kimchi was also tasty. Great find!!!", "author": "Dillon C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-03", "description": "I placed my order through seamless and waited over 2 hours for my food to arrive but it never did.  Apparently, no one picks up the phone at the restaurant either.  After finally contacting Seamless, they were able to get in contact with the restaurant and advised that they were under staff.  It would take another 2 hours to get my food!  Eventually, Seamless cancelled my order and offered $5 off for my mishap but I never received an apology or anything directly from the restaurant. If they were under staff, then they should be have the courtesy to let their customers know so that they don't wait around for over 2 hours to only have their orders cancelled. Horrible service!", "author": "Retail Junkie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-01", "description": "This place was amazing! They're chopsticks are fancy which is fun. Atmosphere is cozy, tables are wood, bar is expansive. They had great lunch specials and great service. I came here with a group of friends for lunch and we'll definitely be coming back. Awesome addition to downtown Brooklyn", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-21", "description": "This is certainly the best bibimbap I've had in Brooklyn, far superior to some other, far more expensive Korean restaurants nearby. The bulgogi is so good that I've never ordered anything else, though I've been here plenty of times.", "author": "Chris A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-08", "description": "The food was so good! Between the flavors of the food and the hospitality by our waitress Gina, I will definitely be back.", "author": "Ty N."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}