{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "Amazing pork stone bowl! Had some great food and will definitely come again!!! My friends come here all the time and also will be coming back!", "author": "Sammy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Amazing, authentic Korean food. Love coming here. Great atmosphere and service. Thank you!", "author": "Jason W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "Great atmosphere, friendly staff. It's a little dim (mood lighting) but not unbearable.\n\nThe drinks were good. I ordered the crunchy chicken tenders, which were described as \"sweet and savory\" but I found them more spicy than anything else, on the level of buffalo sauce. Great though--very, very tender. The batter is delicious. Do recommend!", "author": "Hunter G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-07", "description": "Excellent food and wonderful waiters. If you want to have a great night here, SSAM is your good choice. Rock shrimp, japchae noodle are recommended.", "author": "Yuhao Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-28", "description": "This place is really interesting - the atmosphere is very cool + unique, the staff is really friendly and the food is definitely worth coming back for. My girlfriend and I split the Calamari (chewy but good), the Kale and Tofu Dolsot (the rice continues to cook in the hot bowl as it's served to you - definitely a nice touch if you like your rice crispy) and finally the Kimchi Fried Rice with shrimp (this dish is incredible. The kimchi perfectly seasons the entire dish). \n\nDefinitely will be back for more!", "author": "Evan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-18", "description": "Amazing restaurant! Great friendly staff, very clean, and rustic look. Food is amazing, will return!", "author": "Hammy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-15", "description": "Delicious tofu seafood soup and kimchi fries YUM! The spicy pork ramen is great as well...definitely a hit on the block! And lemon soju tea is the perfect finish", "author": "Saba J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-02", "description": "Awesome Staff \nGreat Service \nRustic and relaxed \nMy friend and I were just checking out the neighborhood looking to grab a quick bite and have a drink or two.  We came across this awesome place and met Mike and Halio and I'm smiling as I type this. Come and experience SSAM for yourself!:)", "author": "Troy B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-05", "description": "this place is great reminds me of my time in small restaurants in korea eating some bulgogi bibimbap and wings with soju. Highly recommend anyone wanting to eat some local Korean in a quiet and cozy intimate spot this is the place to come to. Ive been here 2x already and plan on becoming a regular its that good", "author": "Billye D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "Food is decent but a bit on the pricier side for Korean food. Atmosphere is nice and deco is cozy!", "author": "Margaret H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "First time in Brooklyn and this is a great spot! Food is spicy and delicious. They have excellent service and a great drink selection. Spicy beef is my favorite! I would recommend this location in a heartbeat.", "author": "Michael O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-23", "description": "When i came in there was great lighting and seating!! I love the ambience and service!! I'd definitely come back! We ordered the blood sausage and oh Sam!!", "author": "Anna L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-12", "description": "Terrible weekend service. I was in the \"den\" and the waiters weren't attentive at all. I had to get out of the den to get their attention to place my order and to get my check after my meal. The waiters were just talking along in the front counter. Not only that, they overcharged me on my credit card. I called in to get it fixed and told me that the manager isn't in at the moment and jolted down my information to reach me at a later time. Haven't heard since. I do completely believe it wasn't accidental that the credit card was overcharged because of the variations of numbers on the keypad. Where are the ethics ? Will not be coming back", "author": "Alexander Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-18", "description": "This review is not about the food. Because I never got a chance to eat the food. There was no one to greet us or walk us to the table when we went in. There was 2 servers working and only abt 5 tables. Me and my boyfriend sat down and waited a good 5-10 mins. No water ... plate, utensils or menu was given to us. I understand maybe they're short staffed but they could have acknowledged us so we know they're trying their best to provide service to us\n\nAfter about 10 mins I decided to just get up and leave- they didn't even bother to say anything. I won't be returning to try the food.", "author": "Diana K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-09", "description": "A semblance of authenticity but ultimately it's pretty mediocre Korean food, benefits from being the only Korean restaurant in the area.  Service was extremely slow, both in person as well as delivery.  They are also not responsive when you call.  I would never order here again but unfortunately I'm extremely lazy and there really aren't any other options for Korean food nearby.", "author": "Scott R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-04", "description": "Really awesome- had the spicy squid dolsot. One of the few places that served my dolsot with a runny egg. Their dukbokki is delicious. Also great ambiance!", "author": "Adam S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-05", "description": "Came here on a Saturday night for a dinner. There was only one waiter for the entire place while almost all table were taken. We had to wait 20 min before the waiter came to take our order, another 20 min for drinks to come ( Looked like they forgot about the drink at all). When the food finally arrived the bartender came to the table and literally  threw plates and chapsticks to each of us. I was furious.  Nobody came back to our table to check on us or to ask if we need more drinks. On top of poor service the food was mediocre. I was very disappointed. Looks like this place got the good rating only because they offer a free beer for the review on Yelp. Not coming back.", "author": "Marina L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-10", "description": "I love coming here! The food here is incredible, and they also recently renovated so everything here is so gorgeous. We had a waiter, I think his name is Danny, who kept recommending the best Korean drinks they had and my friends and I clearly loved every single one of them. It's such a fun time coming over here to Ssam since everyone is so friendly and kind.", "author": "Denisse C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "Anything you get here that involves chicken or beef, you're guaranteed to be very very very happy. Definitely try the Soju, they will explain exactly what ratio to drink it with.", "author": "Yesh R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-02", "description": "We ordered this on seamless and it did not disappoint! We ordered two rice bowls - he loved the pork shoulder (Jeyook Dolsot) and I enjoyed the steak (Galbi Dolsot). We will definitely be ordering again. Note: the rice bowls come with kimchi but they do not come with soup, as noted in the seamless item description.", "author": "Kasey G."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}