{"aggregateRating": {"reviewCount": 368, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-06", "description": "My boyfriend and I were craving korean fried chicken, and Bon Chon was having a very loud wings eating contest, which I wasn't in the mood to sit through. So we decided to try out SSAM, and I was a bit apprehensive because of the 3.5 stars yelp rating. However, the food is great, the prices are on point, and service was excellent. I daresay it's better than bonchon!\n\nThe sauces are tasty, and when they say spicy, it really is spicy (much more than bon chon). I'd suggest getting a sauce on your chicken because the regular crispy is a bit too plain. We also go the spicy noodles with pork, which was delicious and a very generous portion.\n\nThe restaurant has a lot of space and would definitely be good for groups. Plus, the service is attentive but you don't feel like they're constantly hovering over your table.", "author": "Elizabeth G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-07", "description": "Went for the first time tnite and want this place to stick around. Great Korean good-which is a tough find in Brooklyn. Super addition to the neighborhood. Super service. Super dukbaegi bulgogi.", "author": "E G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-21", "description": "Love. This . Place! The service, the food, the aesthetic all rock! The Korean style chicken cutlet was monumental!", "author": "Steven P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "I went this restaurant yesterday to have lunch. There was a waiter. He was very kind and nice. He made lemon-ginger tea which is so good. I highly recommend this tea. I ordered kalbi-hot stone bowl. The bottom of this bibibam was crispy. This was first time in this restaurant and i really appreciate their serivce. I will come back for dinner next time", "author": "Yeeun L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-24", "description": "Finally, a traditional Korean restaurant in the neighborhood! This place makes good traditional Korean dishes but I have to say, it is a little over priced. I am glad that they do offer delivery and The owner is a nice guy. I'll be back when I don't feel like venturing to Ktown in Manhattan.", "author": "James L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-06", "description": "Great food and friendly service. So happy to have them in the neighborhood. We had the Babimbap and loved it as well as the fried chicken which is so crispy and delicious. Plus the glass of wine was a nice sized pour.", "author": "Sophie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-13", "description": "I think they have taken the feedback on speed of service to heart - my experience was super quick!  Came in from the cold and was greeted with a mug of barley tea right as I sat down, took my order promptly, brought out complimentary apps super fast, then my tofu soup!  Perfect!  Was just what I needed on a cold night!  In and out - great when dining alone.", "author": "Margaret C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-04", "description": "Saam has comfortable seating, well prepared Bibimbap and tasty Korean-style fried chicken.  I found the scallion pancake doughy and vegetal.  Our food arrived sequentially at long intervals, the pancake arriving at the same time as we requested the check.  This restaurant is still new - I hope they increase the number of servers.", "author": "Kari T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-06", "description": "A Korean spot is just what the neighborhood needed. The service is excellent and the food we ordered (bibimbap) was delicious! The decor is also nice---modern and clean. Definitely returning here.", "author": "Gina A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-04", "description": "am i crazy or did this place used to offer sushi when it first opened?  went there about three weeks ago and the sushi bar was completely dark...and no more sushi on the menu.\n\nthe chillens and i all ordered some form of bibimbap...mine was a cold version with raw fish and the kids both got hot bowls with beef and tofu.  the food was solid, but i found it strange that during our meal the one waitress tried to stir my nephew's hot bowl for him...he is 14 years old.  we all laughed.  the lights also mysteriously went out in the whole restaurant while we were eating and my 11 year old niece whispered in my ear that it was time to leave.  we all laughed (nervously)...then paid...then left.  \n\nfood is good...service is LACKING!!", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-11", "description": "There are a lot of great places to eat in the area. This is not one of them. We were really excited to try the bimbimbak that was advertised outside. We sat down and waited over 10 minutes to get greeted. The meal itself was well below standard. The kimchi with tofu was pretty boring, below average. The blackberry rice wine was ok. When we finally got our main dish, one squid \u0026 one chicken bimbimbak, we were so dissapointed. They definitely skimped on the meat on both dishes. Worst of all, there was so much oil on the bottom of the bowl that the rice was completely burnt \u0026 not edible. We tried drenching it in the red sauce that came along with it, but the flavor was still very bland. Overall, nothing authentic about this place at all.", "author": "Michelle T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-13", "description": "We went there because of the good ratings, although our friend told us it's not that good. Unfortunately, it wasn't good. We had the veggie bibimbap and the stir fried udon shrimp noodles and both was tasteless. It seemed fresh, but there was just no taste at all. We had to spice it up with hot sauce and soy sauce but it was still not very good. No Korean taste at all. The bibimbap was cold and not served in a hot bowl as usual which was a pitty. Service was friendly tho.", "author": "Antonia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-15", "description": "Fried chicken was pretty damn good. Only had the drumsticks but it definitely made me happy.", "author": "Matt D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-17", "description": "We had a wonderful meal in this brand new restaurant. Excellent galbi, fried chicken to die for (an order of 5 is plenty!), crispy delicious potato wedges..... Hope they do well as Korean is a much welcome addition to the standard Smith St fare!", "author": "Mark M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-31", "description": "I'm thinking 4.5 but don't have that option. Very good food, good service, and I'm not sure about the cmplaints about quantity because we received more than we could eat. My daughter proclaimed the fried chicken the best she's ever had and it's certainly up there. The hot stone bibimbap was incredible, and the soup with steak, dumplings and rice cakes was very good, only issue was the dumplings were a drop over cooked. Seaweed salad was very good and large and complimentary appetizers and kimchi were very good. Tiny issues with service, needed more staff and their \"tip guide\" on the bill is based on the check total not the pre-tax amount which is the standard--but tht's programming notrelated to the restaurant experience.", "author": "Phobe S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-14", "description": "Great place for box of lunch during work week. However, they also serve lunch on the weekend.  I think they can do better job if they have more than one waiter (-1 star).  Each disk with good portion for average adult.  The restroom (-1 star) ran out of paper towel ; (", "author": "Ken C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-15", "description": "Excited about Korean food coming to the neighborhood but was disappointed. \n1) banchan was weak: kimchee, raw cucumber (not in vinegar?), glass noodles\n2) japchae was bland and oily \n3) fried chicken did not have crispy, fried skin. Rubbery on the inside. And they got the order wrong but we didn't complain about that bc of the other issues. Definitely not like a bonchon chicken. \n4) tofu soup was bland. Had to reorder because they dropped the egg in. I don't eat egg. Not super flavorful or spicy. \n5) They served warm beer at 7:30pm. Not cool.", "author": "Anna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "Great surprise in a space that has had problems finding its footing. I had the beef BBQ and it was fresh and flavorful.", "author": "Susan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-06", "description": "Ssam's is my favorite restaurant it's the best Korean restaurant ever. My friends and I frequent here every Saturday. I love their waiter Danny he's so friendly and warm to us and the customers. They have great service here.", "author": "Tiana F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-08-18", "description": "Taste is average. \nService is lower than average.\nPrice is higher than average.\nIf you are expecting authentic Korean food, this is not a place.\nDisappointing.", "author": "Amy C."}], "servesCuisine": "Korean", "priceRange": "$11-30", "name": "SSAM", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "170 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/K9aKyrqrVGLmwG-AG1JgZw/ls.jpg", "@type": "Restaurant", "telephone": "+19179091248"}