{"aggregateRating": {"reviewCount": 45, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "I'm so glad I read other reviews, the Rayu Beef ramen was exactly as described.   The longer it sat the more flavorful it was, totally delicious.  The egg was also very good.  I'll definitely be back!", "author": "Kay E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Yes! Finally a great Poke place in the neighborhood. Also, the  Gyoza was amazing, the best I have had in a long time. They have a big back yard too. Great service, great food. Cash only but ATM on site. Will be back. Thanks.", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-28", "description": "To the management,\nPlease pay attention to sanitation when it comes to cleaning dishes and cups.\nI got the Tenichi ramen the first one menu. $13\nThe ramen itself was bland before putting some spicy sauce that placed on the table. I would give 3.5 stars after putting it in.\nWhile I was drinking water I saw the Lipstick mark on the cup but Thank god I was drinking it from another side as you can see in the picture.\nAnd I almost finished the food already. So... I just wanted to give the owner/manager heads up to keep an eye on cleaning dishes.\n\nThanks", "author": "Joo G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-18", "description": "I had high hopes for this cute new ramen place in downtown Brooklyn. We ordered takoyaki and TenIchi Ramen. The takoyaki were cute and small but I didn't really taste any octopus, almost like they really skimped on it. The ramen had great presentation and the pork was super tender but a big surprise to me was the broth, which was like weird and thickened, maybe for taste? Everything else was great, service was fast, esp bc they're new. The wall art is cute but not that great to look at, looks it was painted by school children. Not an authentic hole-in-the-wall like I was hoping for, but fits the gentrified Cobble Hill neighborhood/family vibe well.", "author": "Janli G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-21", "description": "This has got to be my new favorite Ramen place ever in New York City. So excited that they opened this place in the neighborhood. \nYou must try the gyoza which is the best I have ever had, and I also tried the signature ramen bowl, got told that everything in the bowl is homemade. I love the marrow pork bone broth with Japanese tender pork belly.\ntotally recommend this place!!!!!", "author": "Lertkiet L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-14", "description": "It is wonderful place! The wall is great!   Enjoy delicious ramen in a elegant environment!", "author": "Jojo W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-28", "description": "Food is excellent - both ramen and poke are top notch. Service is a bit odd / rude -- they make a big deal of making you wait to be seated (even when the restaurant is empty...) and not allowing you to pick where you might like to sit. A bit off putting as it feels like they go out of their way to make you feel unwelcome when you come in.", "author": "Kamiu L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-18", "description": "What a wonderful spot for a quick ramen fix that won't break the bank. The broth is tasty, good portion for the price. And top it off with a draft splendid.", "author": "Anny P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-16", "description": "OMG I LOVE THIS RESTAURANT !!! stopped by here few days ago with my friends.\nThe servers are so friendly, also Food is perfect! Now the restaurant is my favorite place. Definitely I'll come back soon!!", "author": "Mayu I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-19", "description": "I've been here several times, and I've always enjoyed myself. The staff are extremely efficient, and the food is great. I suggest the salmon miso. It's creamy and lovely.", "author": "Corinne K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Delicious!   Very happy with food options here.   Ramen was bomb.   Service was great.", "author": "Rhobin D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-02", "description": "Stumbled upon this place as they just opened. Loved everything. The decor is fabulous. The servers are fabulous in more ways than one. The food, Oh My! My daughter and I love Poke Bowls. But we pigged out and had some appetizers including pork buns and some salad. They the pokes came. I am so going back. New favorite. Oh and the prices are decent.", "author": "Tata R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-03", "description": "Decent food and ramen! The ramen broth was thick and concentrated. \nI would definitely come back!\nTheir \"wavy\" RAMEN is a bit undercooked. It was quite tough and wasn't flavorful. Personally, for the nest time, I would ask for my ramen to sit in the simmering broth longer.", "author": "Minh N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "We stopped here on a whim, and were pleasantly surprised. We ordered the beef ramen, salmon ramen and homemade gyoza (based on another review we saw). Everything was delicious and the service was good - fast and attentive. The backyard/patio area is tucked away and filled with flowers, which was a nice touch. I would recommend this place and I plan to go again.", "author": "Telina P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-11", "description": "Went in for Takeout Ramen at 9:00pm, Saturday.\nSomeone was Mopping the floor, like they were closing???, even though it was early for NYC, and they had a Party of 18 seated and eating.    Two Waitstaff were  \"Hipster don't care\" types.  I asked if Credit Cards were accepted, they said $20 min. Are you kidding me?  Fine,  I ordered the Ten Ichi Ramen, and two Pork Dumplings (that I was not hungry for) to go.  Food arrived in a bag, and I went home. At home, 20 blocks away, I saw that they had Forgotten the Broth.  I went back to pick it up, as I realize Saturday Rainy night in NYC,  I probably wouldn't have received the broth for another hour if they had delivered it too me.  I picked up the broth, went home, poured the broth into the Ramen Bowl, and......NO SPOON.\nI had my own spoon from another Ramen place.  Ramen was not great, or better than Naruto, or Wasan.  Both places have more professional staff.   IF You Don't want to be a Waiter, DON'T WORK IN A RESTAURANT.\n  On a Smith Street  block that has  2 other Japanese restaurants on it, you'd think retaining customers would be a priority.   Food prices reflect the rent, not the food quality or Service.\n   Not going back.", "author": "brett l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-09", "description": "Food was very tasty. Got the salmon poke and Ten Ichi ramen (lunch special with pork bun) and it was all great. Ramen was rich and the poke was among the best we've had in the area. The actual amount of fish you get for $16 was a little disappointing though.\n\nIt'd be a solid 4/5 if they accepted credit cards.\n\nUpdated to 4/5, they now accept credit cards! Thanks!", "author": "Jordan O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-04", "description": "The place is new and extremely clean. My girlfriend had the Tenichi and I had the tan tan and we both enjoyed them very much. This is my favorite ramen spot in Brooklyn so far.", "author": "Danny P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-24", "description": "Great new restaurant! Loved the beef ramen, even on a hot summer day. Short ribs were delicious.", "author": "Lauren V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-25", "description": "Came here on Christmas Day and we loved the food. But the service was horrible. The waitress took our simple 4 ramen and 2 appetizer order and managed to forget 1 ramen. Never came to ask how was everything. When the bill came, we gave them a credit card to charge but the waiter came back to tell us the bill wasn't correct and said he'll bring us the new bill. Instead of showing us the new bill like he said, he went ahead to charge it onto the credit card right away. He did not explain what changed in the bill. We then realize he included a 20% tip. We asked the waiter why was a 20% tip included into the bill. He said they include 20% gratuity if we have 5 or 6 people. We didn't want to stand there and debate with this sketchy guy. But we did not see this mandatory 20% tip rule on the menu. We were planning to tip 20% anyways. But the way he handled our bill made me felt like he was doing something very sneaky. He has made me never want to visit this place again.", "author": "Ada R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-16", "description": "I really enjoy their classic ramen dish and their wings! Definitely glad this restaurant opened up in the Cobble Hill area.", "author": "Tracy S."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Tenichi Ramen Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "116 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UkGi8LgZM61vmMSFTUwnJg/ls.jpg", "@type": "Restaurant", "telephone": "+19292950060"}