{"aggregateRating": {"reviewCount": 45, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-31", "description": "This is my new favorite ramen place in Cobble Hill. The ramen was solid, servers new but super nice, and the backyard seating is perfect for the summer. My partner got the Tan Tan Ramen and I got the beef ramen- both were rich, kind of spicy, and very tasty.  I meant to take a picture for this review, but the food looked so good that I forgot :) Prices were reasonable especially for the area.\n\nThe place is still new, so it's byob, which was nice because it made the bill cheaper. Not sure how long that will last. Also the restaurant is cash only. \n\nUpdate: this place is still amazing, but they now serve alcohol and you can pay with card.", "author": "Kayla G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-05", "description": "The food was pretty good for the money ...ramen was tasty and authentic \n\nI would have given them 4 or 5 stars but they receipts / tips seems a bit confusing at best and deceptive at worst \n\nSee from the first receipt picture that they already added significant (20% tips) then on the signature page they use that total and have a \"check for tips easy calc box\" for even more tips\n\nIf you had checked the 20% box you would be tipping 40% !!!\n\nI could see customers in a hurry not double checking and then just checking a box and double tipping \n\nThis needs to be fixed ASAP and customers please beware", "author": "Ting L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-06", "description": "Rounded up, but I'd put this at a 3.5. Went for dinner on a weekday, and had to request not to be seated between two other occupied tables. A quarter of the restaurant was empty but they wanted to pack us in together? Doesn't make sense to me. \n\nOrdered the Tenichi ramen, takoyaki, chicken wings, a duck bun, and a pork belly bun. The ramen was decent, the broth was flavorful and not too oily but the noodles were a little lacking. Tastes like they skimped out and used packaged noodles. I have definitely had better takoyaki elsewhere. Barely found any octopus and the surrounding batter was just mush. The chicken wings were nothing notable, maybe even over breaded. The buns were a little saucy for my taste but otherwise pretty good. \n\nOverall a nice little ramen spot while not too overpriced, which is hard to say for the neighborhood", "author": "Rachel W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-02", "description": "This review is solely based on my first and only experience at this restaurant\n\nTo make a long story short- I came here for a nice NYE dinner with some friends and we all ordered chicken ramen. By the end of the night we all puked and/ or had bad diarrhea. Food poisoning at its finest. Happy New Year to me. \n\nSuch a shame because the place and staff seem very nice.", "author": "Nic C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-24", "description": "Nice spot for quick ramen. Good for families and couples. The ramen doesn't disappoint. I also enjoy their appetizers.", "author": "Shirley W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-28", "description": "Tenichi Ramen called out to me on a rainy Monday night, beckoning its warm cozy tables and large bowls of brothy noodles. While I picked it on a whim, Tenichi delivered solid ramen and exceeded our expectations. \n\nEven on a Monday at 8:30pm, Tenichi was about half full. With a small well-lit dining room, diners are comfortably seated at about dozen tables (no bar seating). I can imagine there may be lines on busy winter weekend evenings. The waitstaff quickly got us situated at a clean table with a compact menu and fresh water. \n\nWe ordered:\nTakoyaki - MUST get. They have the official little pan which yielded a soft octopus batter with a slightly crisp crust, covered in bonito flakes and pickled ginger and with kewpie on the plate. Husband said it was the best takoyaki he's had.\nTenichi ramen - classic umami pork tonkatsu broth, rich, salty, and soothing. Really outstanding, solid, classic ramen. \nRayu Beef ramen - if you like beef teriyaki, this is your jam. Slightly sweet, with a hint of spice, the beefy stock pairs with wavy noodles and fresh veggies. \n\nPortion sizes and prices are fair. If you're hungry, get an appetizer or two. Service was great.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-18", "description": "4 stars for location and the ambience. Lost one star because the ramen was good but I have had so much better at other places. Just because you get popular, doesn't mean you should water down your broths and food.", "author": "Foodie N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-03", "description": "There's a big ramen hole in my heart, and Tenichi is here to fill it.\n\nThere hasn't been a ramen shop on this end of Smith St since Dassara closed a few years ago, and the next closest option was Ganso, which also recently shuttered.\n\nSo it's a perfect time for Tenichi to pick up the reins. The space is awesome. There's a bunch of seating, a backyard, and awesome artwork on the walls.\n\nI have this theory about the history of ramen in NYC. I think we're in the third or fourth wave. The first wave was back when ramen was only available in places you've never heard of (mostly in Chinatown), that did multiple types of Asian fusion, grouping ramen together with other Asian dishes like udon and wonton noodle soup. Very few of these places were noteworthy or still around.\n\nThe second wave was when David Chang disrupted the entire culinary landscape with Momofuku, introducing ramen to a whole new audience, and removing the stigma of eating ramen. People started lining up for it.\n\nThe third wave was after ramen was the \"it\" cuisine, and Japanese exports began opening in the States. Your Ippudo's and your Setagaya's which have been forever (in restaurant years, at least). Ivan falls under this category as well.\n\nAnd then was the third wave, which was kind of a mirror image of the first wave - a lot more lower-tier places tried to cash in on the ramen craze after mainstream acceptance and expectation was proven. A lot of them served other types of food too, but the ramen was usually just acceptable. Like the first wave, many of these places have come and gone. Survival of the fittest.\n\nAnd now, I think we're in either wave 4 or wave 3A - where the hype has died down, and the public isn't really clamoring for weekly ramen. But when they go out, they'll stick to the best or the most convenient places.\n\nEnter Tenichi - centrally located in the heart of BoCoCa (a shorthand I despise, but will use for its descriptiveness). Their ramen is more than good, though don't expect anything mindblowing. Their namesake ramen is in a rich (but not too thick) pork bone broth, loaded with giant hunks of chashu and your regular fixins on top. Very solid bowl of ramen.\n\nThey stray from the basics, but I haven't tried everything (yet). They have chicken broth, beef broth, vegetarian option, and even a miso-glazed salmon ramen. I can't say if they're any good, but they certainly have enough options to appease any discerning appetite or dietary restrictions.\n\nI also had a roasted duck bun, which was a perfect appetizer.\n\nPaired all of this with a refreshing little can-sized bottle of sake. I wish more casual places offered single-serving sake.\n\nAll in all, Tenichi = good. It's in a great location and the ramen selection merits repeat visits. I really hope they stick around!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-19", "description": "Wow I was not aware they have a backyard. Easily a $16 dinner for a bowl of noodle. Hmm that's for you to judge if it's expensive or now. For me, it's cheaper than a $20 cocktail and definitely a lot more art and work. \n\nHow does it taste? I love the broth. I can taste the time and effort to make that thick broth. If you order a spicy noodle, you ruin the taste. I love spicy but not really in ramen. It's like putting a screen protector on an iPhone screen. What a waste. Anyway, i suggest the egg. If not in your noodle selection, you can ask to a dd it for some $$ of course. \n\nRamen is really good. Here and also for your belly. Portion is a bit enough? I will always complain about portion being small thou. It's enough to make you feel happy but not totally full. \n\nI was here at 7:30pm on a weekday and it's totally empty or maybe another table leaving. Ever since that other ramen place  closed 6 blocks away by Hoyt, this is probably the only one left in the area or at least one of the best. I wouldn't come often because I don't spend $16 on casual dinner everyday. I am a make my own dinner or go for the $5 gyro kind of person. In the end, I think you should try this place. It's delicious.", "author": "Kevin Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-12", "description": "One of my favorite restaurants.\nI just wondered past this place a few weeks ago and I have been back 4 times in 3 weeks. Clean, consistant, very nice staff. I never give a restaurant 5 stars but this one is superb.", "author": "Mark D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "I loved this place ! They done have a huge menu but what they do have they are doing right. I love that they have vegetarian options such as veggie ramen with a vegetable broth rather than a miso broth because I feel like a whole bowl of miso broth is too much for me. The veggie ramen broth was rich and flavorful and I loved the texture of the tofu in the veggie ramen and the different kinds of fresh mushrooms that they also topped it with. I also tried the rock shrimp tempura with fried shishito peppers they were crispy perfectly cooked and came with the spicy mayo on the side so you could choose how much of it you wanted on the shrimp and peppers. The service was great and the severs were attentive filling our water glasses whenever they saw we needed a refill and clearing our dishes at the right time too giving us time to enjoy our meal. Would definitely come back again.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-03", "description": "Nice lunch spot. $15 can buy you A choices of ramen and a decent appetizer.  Try their Tenichi ramen and the pork broth is thick and creamy.  They made their own ramen with is the thin noodle style ( my personal preference is the wavy ramen) .  I'm looking forward to try their veggie ramen with soy broth on next visit.   The baby spinach salad is beyond my expectation, it's a full size as the regular appetizer order and it is delicious.  From that salad, I'll try their poke bowl on next time.", "author": "Kammy F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-09", "description": "Was crazing ramen and this place definitely hit the spot. I had the beef ramen and it was amazing. Broth was flavorful and the homemade noodles was delicious. Also for appetizer we had the rock shrimp which was great as well. Our waiter was super friendly and knowledgable too. I definitely recommend this restaurant.", "author": "Austin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-27", "description": "Came here after work to grab some soup during the cold day. I had Ten Ichi Ramen which is their signature. The broth was nice creamy and rich. Noodle was al dente. Nice texture ( the staff claimed that they are homemade noodle which is nice). Staffs was friendly as well. Overall excellent dinner. Will come back!", "author": "Aimmie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-24", "description": "I came here for the lunch special since I was in the mood for ramen. They seemed to have a good amount of customers whenever I passed by and their lunch deal was enticing so why not. I tried out their tantanmen and chicken wings. I look for a few things in ramen and that is a flavorful rich broth paired with al dente noodles that cling onto the broth well and this place nailed both of those things. The chicken wings were crisp and tender. Overall a good experience.", "author": "Phil L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-23", "description": "Finally stopped in on Saturday for lunch. Quite pleased!\n\nWe sat right down and the staff was very friendly. Since it was lunch, we ordered the special (select ramen and a \"snack\" - and app for $15) Ten ichi and the Rayu Beef (at the waiter's recommendation- beef not part of the special).  The snack was the pork gyoza.\n\nSnack came out fairly quickly. 4 little fellas - very tasty. (I always wish for about 45 more dumplings.) Then the ramen was delivered! Oh, and we ordered a side of noodles for our toddler. They brought kids chopsticks*, which were awesome. \n\nTen ichi - Overall, a very good bowl of ramen. I thought it was a slight bit too salty, but my wife (a salt lover) thought it was perfect. We both wished that the \"crimpy\" style of noodle was inside - instead it was the whiter one that look like tiny spaghetti. Perfect with the table hot oil also. \n\nBeef was ok at first than fantastic. The complexities of the broth and the total flavor were really great. Had the preferred crimpy noodle style. The eggs in both bowls were up there with the best \"ramen eggs\" that I've ever had. \n\nPrice was fair - seemingly about average for ramen in NYC these days. \n\nOverall, we will definitely be back. This place has real 5 star potential. We just have to settle on each of our perfect bowls. \n\nEnjoy!\n\n\n\n*held together with a rubber band and spacer of paper/cardboard.", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-24", "description": "Beautiful spot in Cobble Hill to hit on a cold day for some delicious hot ramen. The waiter suggested a sake to complement our meal and celebrate the birthday we were there for. \n\nWe started with the pork and duck buns- tender, well-seasoned and finished with a rich sauce. For an entree, I chose their Rayu Beef Ramen, served in a bone broth and added kimchi as well as the mushrooms. There was little conversation while everyone enjoyed their meal. The broth is rich, multi-faceted and a great mixture of flavors. Staff was attentive even when the restaurant became wildly busy. \n\nIt isn't even 24 hours later and we are all itching to go back!", "author": "Anna T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-22", "description": "This is a solid, local ramen spot. It only opened a bit ago so it's nice to support a place that is \"Hot \u0026 New\" by Yelp's standards. ;)\n\nLoves:\n+ Super clean inside\n+ Very attentive and nice staff\n+ Good ramen\n+ Easy menu (like ramen or poke, what cha want?!)\n\nI don't have ramen often so I can't compare it to other hot spots in NYC, but it was a good go here.", "author": "Connie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-11", "description": "Good ramen and their lunch set is a good bargain... great rich broth and chewy noodle the way I like.. will visit again.", "author": "Diana Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-28", "description": "I live in Boerum Hill, right off of Smith St, so it's always great to see new restaurants pop up. Tried out this spot on a Monday night. We ordered the spinach avocado salad with fruit - the dressing was absolutely delicious (too hungry for a photo) and the other ingredients were standard. Also ordered the pork gyoza, so delicious with a delicate crispy outside and the dipping sauce was remarkable. As for ramen, we got the salmon miso and the spicy ground pork tan tan ramen. Both broths were very flavorful and the portions very fair. We will return!", "author": "Casey L."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Tenichi Ramen Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "116 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UkGi8LgZM61vmMSFTUwnJg/ls.jpg", "@type": "Restaurant", "telephone": "+19292950060"}