{"aggregateRating": {"reviewCount": 45, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-10", "description": "Very good ramen and pork buns. Excellent service and cleanliness. Cash only was a bit of a bummer.", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Was really great variety and all made it super fast . seaweed salad was incredibly delicious, Can't wait to get one again.", "author": "Andrey S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-12", "description": "ABSOLUTELY SHAMEFUL !!!\nWe came to that place yesterday around 10pm, they accepted us and \nlet us know that we had to order in the next 15 mn, I am a french chef I totally understand that. Once we were eating the guy came with the check on the table, than he came back 2 mn after to have the money while we still trying to enjoy are food. I always leave between 18/20% tips, but because he was insisting to get the money while we were still eating I gave him 10%. He came back explaining us the tips rules and what we were suppose to give ( we were still trying to enjoy are food).\nThe other waiter came and told us he needed to sweep the floor under our table so if we could leave, so we left didn't finish our drink and once in the street he threw us the coins left on the table and quickly close the door behind him.\nGuys to do that job you have to like the people if it's not your thing do something else, shame on you !!\n\nJust to be fair the guys in the kitchen made a good job !", "author": "Florent D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "I love the vegetable ramen, love the veggie buns, delicious, and they don't fee the need to load it with heat just because it's vegetarian. Have eaten here once and picked up many times. The atmosphere inside is nothing to speak of, but everyone is nice, good service, and they have a back yard.", "author": "Alice G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-08", "description": "Tenichi reminds me of the quick casual ramen restaurants that one would find in a food court. I mean, any ramen shop that does ramen AND poke bowl, well you know their attention is stretched thin. Ramen demands absolute devotion to get the perfect bowl. You will not find anything close to ramen perfection here but everything is fine, if not unremarkable. It will satisfy a crave but don't go out of your way to get their noodles.", "author": "Daniel Z."}], "servesCuisine": "Ramen", "priceRange": "$11-30", "name": "Tenichi Ramen Cobble Hill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "116 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/UkGi8LgZM61vmMSFTUwnJg/ls.jpg", "@type": "Restaurant", "telephone": "+19292950060"}