{"aggregateRating": {"reviewCount": 124, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-05", "description": "What can I say except, \"Easily the BEST morning coffee I have ever had. EVER!\" So I say do yourself a favor and get the Cranberry's own coffee blend, order a slice of their Quiche... holding one in each hand and rotating each to your mouth... then walk towards the Promenade (no matter how cold \u0026 windy) and get ready to form a happy memory that will last you a lifetime!       Although, regretfully, there is no real seating to speak of, I give you 5 Stars \"Cranberry's\" because for the last 2 decades I've made it a point to head for your deli whenever I travel to NY. Not a finer brew in Calif, Las Vegas or Hawaii thus far!", "author": "Melissa D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-11", "description": "Props for being one of the only places open around 6am!!  We ordered a whole bunch of bagels, coffee and hot chocolate here.  Mmmm.  You can stand at their counter, eat their food and read the paper if you want.  It's right off the subway, which makes it a convenient place to grab some breakfast!", "author": "Lili K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-10", "description": "I love this place!!!\n\nI first started coming here for coffee because it's on my way to the subway in the morning. It doesn't look like much at all and I assumed it would have mediocre coffee. Looks can be deceiving! It's super unpretentious, and there's nowhere to sit but a bench outside, but the coffee is stellar and the people are always really friendly. I also like that they have a 'medium' size, as most places only have a small and a large. \n\nThe breakfast sandwiches are quick and good. I've never had any of the pastries, they don't really look out-of-this-world to me, but that's not really my thing.\n\nI also like that they have a frequent-buyer coffee card program. It's almost embarrassing how quickly I run through them!", "author": "Lynn B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-20", "description": "Good strong coffee, not monstrously sized, and the bagels are a delicious foundation for their breakfast sandwiches! For pastries they focus on muffins and  delicious rugelach.", "author": "David P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-12", "description": "I must preface this review by mentioning that there aren't many choices in the Brooklyn Heights area to grab coffee or a quick bite for breakfast- it's one of those weird food deserts if you ask me. Anyways....I love Cranberry's for their delicious Toasted Amaretto coffee and freshly baked goods. I usually buy a muffin and they're always tasty and fresh. The staff is friendly and after a few visits remember your order (I always love that). FYI this place is cash only but inexpensive. Oh, and there is no where to sit and eat, its a grab \u0026 go joint.", "author": "Mina P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-28", "description": "This review is for the one thing I've had here... the scone.  And OH MAN is it good.  \n\nNow, when I say scone, I don't mean the really sweet kind with hardened frosting... I mean the fresh, buttery, flakey morning pastry that's perfectly paired with coffee.  Cranberry's brings the scone to a new level.  \n\nIt is important, if possible, to try and get a fresh one that is still warm.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-21", "description": "The ONLY reason this place doesn't get  five stars is because they don't have seating.  But this is a neighborhood classic, and has been here since the 1970s! \n\nI used to live around the corner and would get coffee on my way to work.  They always have a few flavors, like amaretto and French vanilla.  I was in the neighborhood last week and stopped in for old time's sake.  I had an egg, sausage, and cheese breakfast croissant with a HUGE amaretto coffee.  It was absolutely the most delicious breakfast I'd had in weeks.  It made me miss the neighborhood!\n\nAnyway, stop in and grab a cup of coffee, at the very least, before you make the trek across the Brooklyn Bridge, or on your way to the promenade.  You won't be disappointed.", "author": "J. K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-04", "description": "*Wow*  I think I just had the best scone in my life: )\nI heard Cranberry's scone is good and just had their Blueberry Scone for my breakfast.  I was not a big fun of scones before, but I think it changed just now.\n\nThey do such a great job on making it soo tasty!  It is firm outside and soft/moisture inside.  Not too much sugar.  Some big chunks of Blueberry.  \n\nI wish I had bought not just one but more.  I might travel to Brooklyn just for the scone.  My mouth misses the taste already...", "author": "Keiko T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "Wonderful toasted bagel, with baked salmon. It was so much more than I expected!!\n\nExcellent service too. \n\nBest $5 I spent in the city so far.", "author": "Raminder K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-07", "description": "The only things they have going for them are their location and their pastries (they have great pastries). Every time I go I always wonder why I went! It's way over priced, not a great selection and some of the staff are rude (I can't speak for all the staff, but I am usually served by the Mexican woman behind the register whom I've never heard a thank you from). Most of my colleagues don't go anymore because of the price (they don't even give small sides out with their sandwiches anymore...FYI I used to like the macaroni salad, and a few of my colleagues received moldy salads on a few occasions. $8.00 for a sandwich and a water...AND they have a tip jar...what?!?  Greedy, greedy!", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-19", "description": "Came here the other day before class because the reviews were flawless. I got an iced coffee, scone and almond croissant. The scone was buttery and delicious and I washed it away with my iced coffee. One thing I love most about small businesses like this one is the staff is pleasant. The boy who served me was the owners son and he was able to hold up a conversation just fine. He also offered me a coffee card, which gives you a complementary large coffee after your purchase of ten coffees. I will be returning here because of the great service and delicious treats.", "author": "Cynthia D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-10-22", "description": "Ok. Didn't eat anything myself but this is what my eyes did see.\n\nSTEADY flow of people coming in and out. My friends went here twice on our vacation. They said the coffee was great and they loved the biscotti.\n\nOur friend Joel who's a local walked us over and got himself a coffee and Tuna salad sandwich. That's a good sign right?\n\nCute place. Wish I hadn't just had breakfast.", "author": "Bree C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-17", "description": "OMG they have my favorite cookies from childhood!  You know, those ones with jelly in the middle and then one end of the cookie dipped in sprinkes?! You have to know which ones I'm talking about!  Anyways, I lost my shit because I haven't seen QUALITY ones in ages and after walking around on a cold January day, I stopped in here for coffee and left with cookies too!  I was thrilled but I don't think my thighs were very happy.", "author": "Dana B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-08", "description": "Visiting from uk and just walked over Brooklyn Bridge. Time was 2pm and Henry St Alehouse was shut so we tried Cranberrys. Warm welcome was followed by beer for me and coffee for wife. The menu is more extensive than the sandwiches mentioned. We had gumbo soup followed by pulled pork roll and smoked salmon sandwich. Sampled several glasses of wine in the comfortable surroundings and chatted with all the friendly locals. Great pit stop!!!!!!", "author": "John C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-01", "description": "two things make Cranberry's amazing - the people working there and their scones.  I didn't even like scones until I tried one from Cranberry's - they are so light and fluffy and delicious - and they carry mini scones so I don't feel so guilty getting one almost every morning with my coffee.  the best (though I understand it isn't the case for everyone)  is that it's right across the street from my apt on the way to the train - and they open at 5:45am making it perfect for a morning spot before I hit the gym!  it's so nice to walk in and have everyone know your name and greet you with a smile - sure the coffee is probably about a 7 out of 10, but for the price you really can't beat it.", "author": "Rachelle R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-27", "description": "Is it just me or does this particular stretch of Henry Street in Brooklyn Heights look a little forlorn these days? There are several vacant storefronts and the overall vibe with the scaffolding and scruffy sidewalk definitely does not reflect the fact that this neighborhood has some of the most expensive housing stock in all of Brooklyn. \n\nCranberry's has always been a convenient place for me to pick up a bite on my way to rehearsal down the street. I feel like I'm often eating empty calories, however, as the baked goods are generally so-so and somewhat on the stale side. Cheap tea though, which is great for a hit of caffeine and I've had a few good sandwiches here.", "author": "Christy V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-09", "description": "Absolutely loved my lox and cream cheese bagel from here.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-19", "description": "Living in Boston, maybe I'm just bagel deprived, but damn, there were some good bagels at Cranberry's, possibly some of the best I've ever had.\n\nI can't really see coming here for the baked goods, as it seems there's so many places with better options around the city.  But for sandwiches and what not, Cranberry's is definitely a good value.  I ordered the bagel with lox and cream cheese.  Tasty, and can't go wrong with it.  It's also a good place to come for coffee.  Also, they carry Dr. Brown's which really makes this place seem more like an institution.", "author": "Susan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-03", "description": "I walked in and swear it was scone heaven! Had a $10 bill in my purse and bought one of each. (Yep, ate all of them myself... Good luck trying to stop after one!)\n\nThe scones are fluffy, flakey and moist. Plus, they use the most delicious and plump fruits mixed in with a lovely glaze over them. A must try!", "author": "Melody w."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-21", "description": "Great little coffee shop with neat little pastries and baked goods...from croissants, to bagels, to cupcakes, to scones...they're going to have something you like.  Cranberry's is right off the High St. A/C lines and near Cadman Plaza Park and Whitman Park. \nToday, I got a regular medium coffee and tried some of their free samples of bagel with butter and one of there sweet breads.  Both samples and coffee were very good.  Prices are very reasonable and seating is available on the outside benches.  \nNext time, I would like to try the bagel with yummy lox spread.", "author": "Chris L."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Cranberry’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "48 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/MmEWtgBP5w9RYVbiVUprVA/ls.jpg", "@type": "Restaurant", "telephone": "+17186243500"}