{"aggregateRating": {"reviewCount": 124, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-27", "description": "My husband's Italian Stallion was delicious but my Rooster (grilled chicken) was dry and flavorless. Really needed some pesto or mayo or something. Service wasn't great; the cashier just kind of disappeared after we ordered, no words of confirmation spoken. Good location and good prices, however: right next to the Brooklyn Bridge Park.", "author": "Erin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-03", "description": "What an awesome place to go just after a nice walk across the Brooklyn Bridgge! Cranberrys is a Brooklyn institution!", "author": "Ziya T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-08", "description": "I'm giving this place 2 stars because the pastries I've had have been disgusting. I eat a few bites and into the trash it goes. They have such an amazing selection of baked goods that look so appealing but it tastes like Crisco is used in their scones and cookies. Yucko bucko. I won't be stopping in on my way into work anymore.", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-16", "description": "Love everything about this place. They only take cash but that keeps the old time feel for me", "author": "Mia Rose L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-24", "description": "Apart from the strange customer flow through this shop they have good coffee and breakfast items at the mysteriously affordable NYC rates.  \n\nService was fast and friendly, though our orders had some errors. \n\nRecommended.", "author": "Rich R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-23", "description": "My new go to spot for sausage egg n cheese on an English muffin. Love their ice coffee too. For the area, they have the cheapest sandwiches.", "author": "Jess W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-18", "description": "I used to go to Cranberry's after school, way back in the day, and it is still standing. In Brooklyn Heights that is a monumental feat. Since moving back I have not been by much and I wondered why.\n\nI decided that it was because of the name. Maybe I was watching Menace II Society too much, but every time I thought about going in I felt soft. For seven minutes I decided to judge all restaurant names by how good they would look in gang letters tattooed across the top of my back and Cranberry's didn't cut it. Then I woke up and walked my ass back into a childhood memory.\n\nThe store is small, but ample. The staff is extremely friendly and helpful. In a customer service world now dominated by attitudinal hipsters, Cranberry's says no to that. I ordered a sandwich with avocado and they fresh cut a new one for me without hassle at all. The sandwich I had was excellent, fresh and tasty. They have a wide variety of baked goods and I must get back with the scones that made them famous.\n\nI appreciate the history behind Cranberry's and although the tat idea is out, I plan on many returns to one of my favorite places to get an after school snack in the early 80's. Before departing there today, I grabbed two SpongeBob cookies which were staring right at me and according to my kids, they were a hit. They also thought the tattoo would be soft.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-14", "description": "Quick, simple stop for coffee, pastries, and more. Blackberry scone was great; the coffee with cream was average.", "author": "Mollie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-13", "description": "I have been coming here since it opened, decades ago. The service is always good. The food is delish \u0026 fresh. Their chicken pot pies - wow! I am happy this little Heights haven has stood the test of time \u0026 enjoys the good rep it deserves", "author": "Karen T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-21", "description": "We really enjoy going to this local place. I'm in love with their croissants, especially the chocolate croissant, which I think are some of the best in town and not overpriced like other bakeries. Coffee is good as well. Food and service have always been consistent, we have no complaints and will continue to come back", "author": "Carrie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-14", "description": "always passed by this shop but never thought to go in until recently.... the cranberry scone was fantastic and their coffee was super yummy. mad respect for the crew working there- they open at 545am! not many places can say the same... great spot that should not be overlooked", "author": "Steph G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-24", "description": "Prices are fabulous (for NYC vicinity). I had a regular coffee and a nice, large piece of apple walnut bread, both of which were $2 each. The coffee was actually really smooth and flavorful. My boyfriend had a latte which was also good, though I preferred my drink. They also sell bottled drinks, and we grabbed one of those for later. Our total for everything was under $10. Service was efficient and adequate, not overly friendly, but still good.\nCash only. I don't think that there is a public restroom. There is no seating inside, though we did take a few minutes to have a seat on one of the two benches that are located outside, which was nice on a warm evening. \nPerfect stop located adjacent to the subway station that we arrived at in order to walk across the Brooklyn Bridge. It's on the next street, but you can see it to the right when you exit the stairwell. Cute, quaint coffee shop, exactly where we needed it to be before strolling across the bridge.", "author": "Suzanne S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-16", "description": "Dear Bacon, Egg \u0026 Cheese Bagel Sandwich from Cranberry's,\n\nI love your entire face. I love no other faces but yours and I want to be with you forever. I was hungover but you brought me from the shadows into a valley full of light or something and were very reasonably priced and I'd like to give you a hug.\n\nLove,\nStacey", "author": "Stacey A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-08", "description": "I want to like this place, I do, but both times I've eaten here I've had terrible stomach pain afterwards. I've now realized their B rating and attribute it to this... however everything I've tried is tasty! And cheap! Maybe once they clean up their standards a bit more I'll return.", "author": "Caitlin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-26", "description": "Small walk-in deli/bakery they had 3 choices for coffee flavors as well as an assortment of. Beverage and lunch choices although they all looked to be pre-made. The staff was friendly and knowledgable of the products they sell! Very quaint reminder of delis back home! Will come bAck again soon!!", "author": "Christae M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-15", "description": "Bitter about waking up so early, I knew I needed a special breakfast to perk me up before meeting my colleagues. Enter Cranberry's. \n\nI live a measly two blocks from this place but have never really had motivation to try it out until I realized it was on the way to my subway for the morning. I knew I need a latte, that was a given. But then what? \n\nClearly they're used to regulars popping in here that know exactly what they want. I, on the other hand, was very overwhelmed by the abundance of baked goods that all looked tasty and I could smell more baking. The lady behind the counter asked me about three times what I wanted while I was not quite in the mood for her pushiness! Reluctantly I went with my gut and got a chocolate chip muffin which was delicious! My latte was tiny but provided the perfect pick me up. \n\nIt all came out to less than what a latte alone costs at Starbucks and was more fulfilling. \n\nI wish I would've known how good the scones are supposed to be but I would definitely come back here since it's so easy and cheap. If my work mates knew that this is what provided my morning boost, I'm sure they would be thanking Cranberry's profusely.", "author": "Cassie P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-14", "description": "I love the idea of their  unpretentious, family- owned coffee shop, but why do they have to raise their prices to match Starbucks? A large coffee is $2.50? Why? It's just coffee. I admit their scones are delicious, but they recently raised those prices as well. I would sympathize if they were paying the big neighborhood rents in Brooklyn Heights but as everyone knows, they've been there so long because they OWN the building. So why does it need to be so expensive? Please do tell.\n\nyes, fast service, and good clean family food. However the prices aren't as friendly as the staff.", "author": "Christina M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-13", "description": "Small local bakery with a lots of charm and a helpful staff. I wish they made checkerboard cookies, though.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-11", "description": "I am really not sure how this location has such amazing reviews. We stopped in yesterday to have a \"hold over snack\" before brunch. This really was a mistake. \n\nI can only speak to the 2 products that we sampled, but each of them was a bigger disappointment than the one before. We tried the in house made Hamantashen and an elephant ear. The Hamantashen was a shame for a jewish girl from LI like me. The apricot filling was overly sugared and the cookie was tasteless and stale.\n\nThe elephant ear was awful. It was stale, tasteless, and all we were left with in our mouths was a taste of butter.\n\nJudging from the reviews it is possible that we were there on a bad day or tried the wrong things, but I honestly wish we hadn't gone in.\n\nMaybe next time i will try the scone.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-06", "description": "Finally a scone I love!   Starbucks could take a few pointers from Cranberry's.   The staff was also very engaging and intelligent.   Thank you!   Can you now open up a couple locations in LA?   :)", "author": "Steve S."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Cranberry’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "48 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/MmEWtgBP5w9RYVbiVUprVA/ls.jpg", "@type": "Restaurant", "telephone": "+17186243500"}