{"aggregateRating": {"reviewCount": 124, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-26", "description": "Really cute and relaxing place, ppl there are nice and food are fabulous.\nHaving cheese steak sandwiches for breakfast then, the taste really surprising me and I'm sure I'm gonna miss that every morning!", "author": "Stephanie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-11", "description": "Found this place on our way to the Brooklyn Bridge. Got the crumble cake and it was AMAZING. If you love parties, I would definitely recommend stopping by.", "author": "Susana Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Love Cranberry's coffee, it's very smooth and creamy as coffee should be.  The blueberry scones are among my favorite.  Only downsize is that over the years the cup seems to be getting smaller (sad face), but a favorite in the heights!", "author": "A W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-26", "description": "I only had a bagel and it was just a bagel, so it was fine and prices are good\ncant say that I had the baked goods, so this review is for a basic bagel only.", "author": "Joanne D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-26", "description": "\"What would you like?\"\n\"Coffee with milk and two sugars please.\"\n\"My coffee is good. How about with 1 sugar and I'll give you another on the side?\" \n\"Deal.\"\n\nHaha. He was right. The coffee was quite good. It didn't need extra sugar. \n\nSuch a great start to my day. I went in here expecting just coffee.  What I got in addition to that was a great exchange with whom I assuming was the owner, and left with a huge smile.\n\nI loved the fact that he was a personable character. And he gave us a little history about Brooklyn. \n\nI'd be happy to come back here.", "author": "Yevgeniya A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-26", "description": "Amazing turkey sandwiches\nBest iced coffee in town don't take my word for it just come and try it", "author": "Nasir R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-27", "description": "Cranberry's is a small neighborhood coffee and bagel shop serving up fresh snacks for people on the go. \n\nI got the bagel with lox, cream cheese, red onion and capers and honestly inhaled it. It wasn't the best bagel and lox I've ever had, but it certainly hit the spot. \n\nThe thing that turns me off about this place though is the fact that it is quite dark inside and sort of grungy. But you're not there to eat-in (there's no room even if you wanted to) so it's not a deal breaker.", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-05", "description": "My favorite take out cafe in Brooklyn Heights and I've been to almost every one. Everything is great, haven't tried anything I didnt like. I especially love the chocolate croissant and other choc pastries. It also helps that everyone who works there are nice - always with a smile on their faces (or a joke or two). They actually enjoy what they're doing which is quite a rarity nowadays in New York. Lol.", "author": "Zoraya Lorena L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-18", "description": "Asked for honey turkey with Swiss lettuce and tomatoes and just got plain turkey with lettuce tomato when I made the counter girl aware of the mistake she was uninterested and walked away don't waste your money here!", "author": "Nijah C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-18", "description": "Here you can grab breakfast and lunch items.  It might not be the most healthiest thing, but it is affordable and convenient when you are about to go across the Brooklyn Bridge.  I recall getting bagels here and seeing quite a selection.  The place is like a cafeteria but smaller.  I remember someone came in with a baby, so they are family friendly.  I do know that there can be lines, so they are probably doing something right!", "author": "Polly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "I really miss this place... First place I'll go when come back to NY. :) My sister used to work here years back, she loved everything about it. And the owner is great. This place has soul.", "author": "Matt G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "Loved this bakery while in Brooklyn Heights!! Enjoyed their carrot cake muffins as well as their blueberry muffins.. loved the crispy croissants and their oatmeal!! \n\nI wished I had a bakery like this near me!", "author": "Sarai G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "Oh my god, I love this place. I come here for coffee every morning and it's always delicious. Good bagels/bagel sandwiches and their apple walnut muffin is insane. Sometimes gets crowded with tourists coming from the bridge but the more the merrier :) Please never change!!!", "author": "Elizabeth B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-20", "description": "Charming store front and awning but that's about it. Dark, dingy interior with no room to sit. \nThe drink options are sparse despite the large fridge and the deli case is awkward. You're left wanting more - not your typical epic deli case with endless food. \nGot the lox sandwich and it was very underwhelming. \nThis place is a tourist trap with a cute storefront. Don't be fooled.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-29", "description": "Five stars for this little coffee / bakery shop.\nSuper nice and welcoming staff and great pastries !", "author": "Loris C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-18", "description": "Pastries and coffee.always fresh\n I love this place, the owner and his daughter Nicole are always sincere and grateful", "author": "Russ R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-06", "description": "Cranberry's is often the high point of my morning walk with our energetic lab mix. The scones are a personal favorite, whether with chocolate chips, blueberries, raspberries or other yummy things. The corn muffins could become habit-forming, as they also come in versions featuring those aforementioned berries baked inside. The coffee cake muffins seem popular with coffee drinkers, although I am not as big a fan of them, personally. One of the other nice touches to this shop: By the time the breakfast shift is in full swing, you can also get lunch items for a very efficient one-two punch. Goodbye, hunger! Hello, Cranberry's!", "author": "Brendan H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-11", "description": "Any place that offer good coffee, and it is not Starbucks or Dunkin's Donuts, already start for me with 3 stars. Brooklyn need more places that makes good coffee, and Cranberry's is one of them. But I think that some of the dishes are little overpriced. But I am not here to decide for people how to price their products, or for customers to decide how much to spend. But what I can tell you is that the food worth it.\n5 for the coffee. \n4 for the food. 4 for the service. 3 for the prices.", "author": "Lisa M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-07", "description": "A nice place to sit and eat, in my experience.\n\nI happened upon Cranberry's after church one dreary Sunday, in search of some good espresso and a relaxed place to drink it - and that's what I found here. The folks behind the counter were quick with my coffee (which was quite reasonably priced for NYC), and then, thus armed, I took to the creaky wooden bench fronting the shop, where I sipped my brew and lazily watched west-side Brooklyn stream past - lovely! I even made a friend while there, with a charming older lady who shared my bench and some kind words.\n\nMy time at Cranberry's was a good one, and has become a good memory. So, thanks to everyone who runs the place, for providing me this priceless experience :-)", "author": "Chris S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-08", "description": "Too hyped on yelp!\n\nNow, I trust Yelp a lot and am constantly on it, but I was fairly disappointed of the rave reviews of this coffee shop.  Like the two stars state, I've experienced better.  I was a little thrown off, as this joint is more of a grab-and-go place rather than an actual bakery/coffeeshop.  There's not a whole lot of choices of desserts and drinks.  And, the items themselves seemed a little overpriced for the actual value and size.\n\nI got the chai tea iced latte after a full 10 minutes of debating what drink and/or snack to get.  It seemed like the safest decision that I wouldn't mind spending a few dollars on.  The chai was a little too sweet and tasted a lot like chai syrup rather than a latte.  Even having nonfat milk make the chai really strong.  I usually don't mind strong chai (I love Starbuck's strong chai), but this one was a little too overbearing.\n\nThe sandwiches were the only food items that seemed decent, but they just didn't look too fresh.  I was fairly disappointed by the place and sort of wished I had just gone to a local Starbucks.\n\nOne thing, I really loved the staff and atmosphere.  Locals seemed to be regulars here, and the locations is adorable-near a small park right outside.\n\nBut, really, save yourself a visit and try some other places!\n\n37/100", "author": "Kim H."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Cranberry’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "48 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/MmEWtgBP5w9RYVbiVUprVA/ls.jpg", "@type": "Restaurant", "telephone": "+17186243500"}