{"aggregateRating": {"reviewCount": 124, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-19", "description": "Service is amazing: really friendly people.  Scones, like everyone says, are great.  So far I've had the chocolate chip (pretty good) and the pecan (amazing!).  But might I also recommend ordering a ham, egg and swiss on a croissant?  Perhaps one of the best, if not THE greatest, breakfast sandwiches I've ever had.", "author": "Rebecca R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-16", "description": "The coffee is very good as are most of the baked goods -- especially the scones, which are addictive!  Everything always seems very fresh probably due to the high volume of customers this little neighborhood bakery services (lots of tourists coming off the Bridge or heading to the Promenade make their way in).  My only complaint is that the service can be rather slow, even when it's not bustling.  But overall a great place to pick up breakfast or lunch.", "author": "Karen D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-11", "description": "Love Cranberry's coffee is good but scones are to die for, great neighborhood coffee shop.  Love supporting local businesses, and they are well worth it.  Sandwiches are great too.", "author": "Brenna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-09", "description": "Cranberry's is a cute neighborhood coffee and bakery stop. I only got a hot green tea, but the treats menu looked sensational! My boyfriend got a Cafe au Lait that smelled great (and I am not a coffee drinker). Good prices (my tea was 2 bucks and his coffee was $1.75). Our beverages kept up warm while we walked on the Brooklyn Bridge!", "author": "Amy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-17", "description": "This is a great spot for a scone and coffee! Pick up and go! ! Try the toasted almond coffee!! Love it.", "author": "Michele W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-06", "description": "Great coffee and scones. Bagels are not very good. The everything bagel lacks seasoning and the bacon is salty.", "author": "Chip B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-22", "description": "I dig this place: on rainy days, it's on my walk to work from the train, and on sunny days, I use it as an excuse for a longer biking route to work. Either way, I'm in twice a week or so. The pastries are solid (maybe not the best croissants and scones you've ever tasted, but they're good and they're cheap), and the service is quick, efficient, and nice. Get a raspberry scone, you'll likely come back for another.", "author": "Jake D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-26", "description": "Everytime we visit our family in Brooklyn...we MUST have a cup of joe from Cranberry's. The price is right and the coffee is oh so good. Very friendly service too.", "author": "Danielle E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-21", "description": "Welcoming atmosphere, pleasant help, mediocre coffee (I had a chai latte, and it was kind of bland). Floor plan isn't efficient for customers; one would only hope that during the rush hour, you won't have to be in line. I went here before boarding the train needing a sweet tooth, and some of the baked goods looked really good, and many were commercialized. On-premises baking would be mo' betta. It was more homey than a Starbucks, so that was a plus. The small cup was too small.", "author": "Mark Anthony B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-29", "description": "Goof coffee!  I'm visiting, and prefer to avoid chains when on the road.  I would walk a few extra blocks for this coffee over Starbucks.  Cheese Danish was great, too.", "author": "Matthew L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "I love the coffee at Cranberry's-- it's very strong, but it doesn't have a burnt aftertaste like Starbucks.  The food is great, though a little overpriced.  There are no seating areas (though that shouldn't be an issue for those who live nearby).  Considering that there aren't many food options in this part of Brooklyn Heights, this place is as good as it gets for breakfast food and coffee.", "author": "Tom C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-05", "description": "Solid coffee/ bakery alternative to Starbucks in Brooklyn Heights. Their coffee is great, and their scones are even better. They usually have blueberry, cranberry, and raspberry scones - all fresh, soft, and delicious. The only downside is Cranberry's is cash only. There is an ATM in the back, which unfortunately is a necessity if you don't have cash. There are no other ATMs close by.", "author": "Emily A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-04-29", "description": "The mom \u0026 pop neighborhood coffee shop is not dead yet! And while such places are popping up a lot in Bklyn these days, Cranberry's has weathered the Starbucks onslaught, and survived, thanks mainly in part to the superior quality of their product. For $2 you get a cup of smashingly delicious coffee, and they have awesome flavors like Irish Cream and Swiss Mocha. They also have great pain chocoalat, pastries, sandwiches, and the like. Sometimes the notion that people don't really want to linger in the morning while getting their coffee and dashing to work seems a bit lost on some of the people that work here, but most of them are on board with the concept. They are also really friendly and a true neighborhood shop - I've ordered coffee only to find I have no cash a couple of times and they always just trust me to pay for it next time.", "author": "Justin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-05", "description": "Such good scones!  I work in the courthouse across the park and regularly stop in here for breakfast on the way to work.  Very reasonable and yummy.", "author": "Jessie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-07-14", "description": "Decently priced, great bagels, and their chocolate rugelach is wonderful. The staff is always really friendly (there was one employee who was kind of too friendly, but he doesn't work there anymore). They also let you open a \"tab\" if you're a regular, which is great because they don't take cards.", "author": "Jess G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-08-21", "description": "I don't understand the negative reviews here.  This place has lasted for an incredibly long time.  People who come to visit always bring a pound of coffee beans from here.  There's a reason.  I know it's small and there are places with a greater variety of baked products, but seriously, just try to find scones as good anywhere.  Usually I can't even bear to eat scones, but I continue to come here.  The brewed coffee here isn't the greatest, but it's pretty good for the price.  This place can't be beat if you want a little pick-me-up on a cold morning.  I love it.", "author": "Leigh M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-24", "description": "On the weekends I play the organ for a church in Brooklyn Heights. Cranberry's is the closest breakfast shop to the church, so I tend to frequent it only because there is no other choice. The food is only okay and it is certainly over priced. Often the staff has given me the wrong order. One thing that I found off-putting was that they changed my coffee club card that had only two punches left for a large coffee to one that says a medium coffee... I mean, they could have given me one last large coffee and then gave me the new card... I will have to make the extra couple blocks walk and find a new place.  Cranberry's has been on a downward slide...  I hope they can correct it...", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-05", "description": "I come here ever week and am not disappointed.  The food is good and really isnt overpriced like alot of people commented on. I would rather come here than eat a dry overpriced pastry at Starbucks. I buy a bag of their coffee beans pretty often and it makes a really good cup of coffee. Good fast service as well.", "author": "Ken S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-20", "description": "Bad coffee and unremarkable pastries.  Go to Montague Street for a real bagel, and pray that they decide to serve a better brew.  It's not worth the convenience.", "author": "sam t."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-08", "description": "The scones are delicious, the coffee is yummy, and the staff is crazy friendly. No complaints.", "author": "Alicia K."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Cranberry’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "48 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/MmEWtgBP5w9RYVbiVUprVA/ls.jpg", "@type": "Restaurant", "telephone": "+17186243500"}