{"aggregateRating": {"reviewCount": 124, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-27", "description": "Such a nice 'to-go' breakfast spot and I am so lucky to live nearby. As a native New Yorker, it is somewhat of a ritual to have a bacon, egg, and cheese on a roll or bagel on a Saturday morning. Cranberry's is one of the few places that can deliver on this in an affordable and consistent way. They have a really nice team and the store owners are often there to make you feel comfortable and at home. Thanks for all that you do.", "author": "Louis V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-29", "description": "I think this is a fairly honest review since I've been here for coffee at least four or five times. \n\nI think the staff is very friendly and work very quick and efficiently, and I'm grateful for that. The neighborhood is also really cool. I've never had any food so I won't comment on anything they cook. However my only problem with this spot is the only thing I've come there for: coffee. \n\nEvery time I get their hot coffee, it seriously tastes like toilet water. It just isn't any good. Maybe they don't clean their pot often? Maybe they use really lousy beans? Regardless, I never found the coffee to be pleasant. There's plenty of other spots for coffee in the area, so I'm not sure why I stuck with Cranberry's despite all of the other local options. In any case, don't waste your money on their coffee, you'll regret it.", "author": "Josiah B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-20", "description": "So it's right off the train and I really wanted a breakfast sand which .... I'll just say I am Still eating while I write this but am disappointed... my bacon egg and cheese has legit one piece of bacon in it ... the croissant is good and so is the egg.... but it's completely miss the bacon for $6.50 I don't feel I received my money's worth. 3 stars bc the service was fast and the sandwich would be great jf it actually had the bacon I paid for in it...", "author": "Victoria M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-11", "description": "After trying to figure out NYC's subway system and getting lost a few times trying to get to the Brooklyn Bridge, we became hangry and decided to grab a small snack to help us continue our journey. Cranberry's was nearby.\n\nThe place is small and is pretty compacted inside. They had a variety of pastries to choose from as well as a menu where you can order sandwiches, salads and other things. The customer service was okay. It wasn't superb, but it's a buy your food and dip type of thing.\n\nWe got the danish bread and it was great. It had a nice sweet touch to it and was cooked well. Definitely helped us with the rest of our journey to the bridge that's for sure.", "author": "Marc C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-26", "description": "I really like their homemade scones. Not always the same amount of butter to salt nor maybe even degree of freshness but the scones are so simple and wonderful that way. More of a giant biscuit than most scones you'd likely find really. And if you come on a weekday morning you will see how crazy it gets in the teeny shop. Cash only.", "author": "Elisa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-24", "description": "Cute little shop in Brooklyn to grab a quick bite or pick up some pastries. It seems like a go to spot for the locals. \n\nTons of pastries, sandwich and bagel options, as well as cold sides to choose from. \n\n\nLox bagel - good. Lox was fresh. Bagel was soft and fluffy. The bagel was large and half got me full. \n\nSpinach and cheese croissant - good. Perfect for a morning snack", "author": "Rose N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-01", "description": "Picked up a quick sandwich on the go - egg and pepper jack cheese on a roll ($4). Overall, it was just okay. Sandwich came stuffed with eggs but didn't have much seasoning on it. It's a cash only place and doesn't have any seating. My gf also picked up a dozen rugelach ($1.25 each), and the cinnamon and chocolate ones were amazing!", "author": "Dipika A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-26", "description": "Came here to snag some sandwiches before chilling at a park.\nThe 'gobbler' which they spell 'gobler' is C.R.E.A.M. (Cash rules everything around me, a wu tang reference)- I was expecting it to come with cranberry sauce, but they don't stock it in the establishment at all. That said, the sandwich was gangster good and I got to ride the ferry (check out my ferry review for a micturific review)", "author": "Peter A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-20", "description": "Came in and ordered a bunch of things for friends coming by including the truffle brownies, several turkey and cheese sandwiches, coffee cake muffins and their famous coffee. Everything was so good. Ps They only take cash!", "author": "Kris P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-14", "description": "The ultimate bakery in Brooklyn!  This is a quaint shop near the subway station in an up and coming neighborhood.  \n\nThis isn't a place to sit and eat your delectables, but rather take them to go.  There is a huge park just a few metres away!\n\nEverything is super fresh and when it's gone, it's gone!\n\nI had 3 medium hot chocolates and 2 cheese pastries, $7.50!  Holy cow was that cheap, after experiencing Manhattan!   I really wish I had found this place sooner!", "author": "Jessica P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-31", "description": "Just popped in to get out of the rain, and I'm so glad we did. This is THE best coffee I've ever had! Make sure to talk to Michael. He's as awesome as the coffee is! This is Brooklyn!", "author": "Nona M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-13", "description": "Scones are delicious and so are the muffins. Coffee (especially the latte) is terrific, too, and so is their loyalty card that they stamp, earning you a free coffee after buying 10. There is usually a line in the small store but the employees are friendly and move efficiently, especially during \"rush\" hour in the morning. I hardly ever see scones anymore, and when I do, they are coated in sugar - so it's nice to taste a traditional, freshly-made scone from Cranberry's (I either get the cranberry or blueberry).", "author": "Jen O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-20", "description": "One of the more reasonably priced cafe/deli spots in this area. The have both baked goods and sandwiches. Employees are usually very nice and they have a lot of regular morning coffee customers that go there. Not a lot of room to sit but you are close to Cadman Plaza if you want to grab some snacks and go sit on those benches. This is also in between the 2/3 at Clark street and the entrance to the Brooklyn Bridge walk way so would be a good spot to stop in for a quick bite if you are seeing the bridge.", "author": "Tatiana T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "CASH ONLY!!!!!! The prices were decent and the food was pretty good. Parking in that area is terrible. However, the service \u0026 food was good. The cashier guy was very nice \u0026 polite. He made our experience worth while. I highly recommend for a day in this beautiful Brooklyn neighborhood. Atm is inside!!!!", "author": "Alexis R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-28", "description": "Warmest welcome on a cold October day\n\nThe food and great! I've tasted the spinach and feta croissant and it was delicious.\n\nAside from the food, the staff is great! So nice and thoughtful, they make you feel welcomed. Also, they speak Spanish which is a plus for most tourists visiting Brooklyn!\n\nGet yourself warm there!", "author": "Isabela N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-25", "description": "Best coffee and muffin I've ever had and the costumer service was amazing. I cant wait to go back to New York and visit this place again.", "author": "Scarlett G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-06", "description": "Someone else reviewed that this was the best latte they'd had. Well I agree that this is one of the best lattes I've ever had as well! Super flavorful! We stopped. H this cafe before walking the Brooklyn bridge! I definitely recommend this spot before walking the bridge on a chilly day!", "author": "Kim D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-29", "description": "Amazing bagel sandwich! It was truly great. Filling too. Very tasty. I had an everything bagel toasted with egg whites, ham, and pepper jack for only about 4.50. However, the cashier staff lady (an older white woman) wasn't the most polite and seems pretty abrasive. I definitely prefer ordering from the Latino staff who are super courteous. Other than that, good food at least, and for a decent price.", "author": "Daniel G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-02", "description": "The best scones in New York. Two things: the hazelnut coffee with some sugar and milk, and the blueberry scones. Any of the rich, decadent, made fresh every morning scones are great but the blueberry? Divine. This neighborhood spot is a legend!", "author": "Bonnie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-13", "description": "I stopped by here while waiting for my number to be called at the nearby post office. I had a coffee cake muffle and a raspberry rugelach, total $3.50. the muffin was moist but not too much flavor. The consistency was great but lacked the flavor. The raspberry rugelach was quite nice so I'd get this again. \n\nIt's located near the Brooklyn bridge so expect tourists.", "author": "Christopher S."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Cranberry’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "48 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/MmEWtgBP5w9RYVbiVUprVA/ls.jpg", "@type": "Restaurant", "telephone": "+17186243500"}