{"aggregateRating": {"reviewCount": 124, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-21", "description": "I got the pecan scone because I didn't want a heavy breakfast. I am not a huge fan of scones because I've never had a decent one.\n\nThis scone was pretty delicious, however. It was studded with pecans and had a crispy exterior with soft insides. It was a huge size too. I could only finish half.\n\nMy friends got a egg bacon sandwich and other pastries. They all said it was delicious.\n\nThe mom and pop atmosphere is great too.", "author": "Cynthia J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-17", "description": "Pretty generic coffee and pastries type place. Nothing extraordinary.", "author": "Vandad C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-25", "description": "nice variety of pastries.. picked up a cheese danish, HUUUGE cinnamon roll, and a duo of scones for 7.75 ! great deal already, but because they were about to close, the young lady behind the counter threw in a bagel as well. super cozy, cant wait to return and try some other delicious treats.", "author": "Ana G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-07", "description": "My family and I were visiting over the the thanksgiving holdiay and really wanted to get that \"New York\" experience. So we took the train and started walking around Brooklyn Heights, when we stumbled upon this little spot. I must say that the sandwhiches were very tasty and certainly something different. We also could not help but get some cookies for our ride back home. They were so crunchy and tasty! It is very small but they have a small counter where you can stand and eat your food. I really enjoyed the atmosphere, it was very cozy. Next time we visit, I will definitely be returning to this little gem.", "author": "Michelle P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-05", "description": "Cranberry's falls somewhere between 3 and 4 stars... I find myself going here more out of convenience than craving their food and coffee. \n\nThe prices are better than other neighborhood shops, the coffee is okay, and the servers are very nice. They also do coffee punch cards. Breakfast pastries are hit or miss, but you get what you pay for. \n\nBe aware that there's no indoor seating, just a bench outside. They are also cash only.", "author": "Annie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "quaint lovely place near the Brooklyn Bridge. They have fairly priced snacks. I bought my niece hand made cartoon cookies that she really loved.  will be back to buy some more.", "author": "Thea G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-12", "description": "The sandwiches a little bland and pricey.\n\nI ordered my favorite, bacon, egg, and cheddar on a croissant. The croissant was dry, the eggs plain, and the bacon was flat, precooked, and missing some smoke flavor. It was edible. \n\nSo next time I went, I asked them to add butter, salt and pepper to the sandwich. I could see flecks of pepper on the eggs but didn't taste any salt. Where's the salt? Is there a salt embargo? Even the cheese tasted like it had no salt. How can you make cheddar cheese without salt? I think they even used unsalted butter.\n\nIt really had potential, but no amount of doctoring can make one of these as good as a deli sandwich. If you have to eat here, BYO salt shaker.", "author": "Jarrett S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-27", "description": "Note this review is only for the coffee and occasional muffin or cheese Danish: Don't be scared by the \"B\" rating. Because If you are looking for a great cup of COFFEE that's consistently good. This is the place! I wouldn't get a sandwich they sit, longingly pressed against a plexiglass prison. Albeit,\nUn-refrigerated they look tasty enough (most likely the reason for the Big \"B\"). I just haven't had the guts ( pun intended) to risk the outcome of \"summertime mayonnaise blues. \nStick with the coffee and you won't care if they had a \"D\". Or it was served from a open cauldron of coffee goodness. \n\nIf you like Cheese Danishes I would high recommend theirs. I am a little unsure of the source but they are good.", "author": "Stas L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "OK, I need to update this review to reflect my love of Cranberry's.\n\nTHEIR BLACK AND WHITE COOKIES ARE CHOCOLATE ON THE BOTTOM.\n\nSay what?!? So soft and delicious--the icing isn't super hard either.\n\nSeriously worth trying--a great spin to the traditional cookie. So good, I just can't. Do yourself a favor and get one, even for later.\n\nAlso had another blueberry scone today, and it's even better than the cranberry one, if that's possible.", "author": "Rebecca S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-23", "description": "Best cup of coffee in the city!!!! Thank you for keeping me awake.  The service is also a plus.", "author": "N B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-01", "description": "Decided to walk the Brooklyn Bridge and needed something to look forward to on the other side. My friend and I did a little yelp search, found this place to be agreeable and headed on over. \n\nStaff was very friendly and accommodating. I ordered the Rooster and preferred there be no sprouts on my sandwich and they gladly subbed in lettuce. The sandwich was lightly grilled/warmed before being served.  I wish they had asked me if I wanted any dressing on it or anything. As a pre-made sandwich I thought they would have a suggested sauce, but instead I asked for mustard when I realized it would be plain.\n\nMy friend ordered a sandwich on a sub which was enormous and looked great!\nPrice range $7-$10\n\npitfalls: There's only one tiny table in the back, BUT you can cross the street and sit in the par if you so choose.", "author": "Ari A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-09", "description": "When I lived in the area, I would swing by here every weekend. The scones are main the attraction! \n\nThe shop is just a few blocks from the promenade. Since there is no seating, it's worth grabbing a coffee \u0026 scone and strolling around the neighborhood. \n\nUnless this has changed recently, it's cash-only.", "author": "Danielle S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-25", "description": "Came here recently after a morning meeting to grab a bagel. The bagel was mediocre, and the cream cheese did not taste great, and was just slathered on. I guess it was because of the morning rush, they were rushing orders and packing them so they can get on to the next order. If I came when it was less busy, they probably would've made it right. The store itself was pretty nice, very organized.", "author": "Joseph M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-31", "description": "It's a great local shop for quick grabs in the morning like bagels, sandwiches, and coffee.  Since they open early, it's convenient for early commuters like me. I especially enjoy being able to pick up lunch on my way to work on days I forget to pack it myself.", "author": "Haena Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-11", "description": "Amazing place, very friendly customers. It's my Sunday's favorite. Joy and peace and love. Miss this place", "author": "Anna A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-01", "description": "This is very close to my apartment. The coffee is actually delicious. Sometimes iced coffee can be harsh, bitter, astringent, but theirs is great (go here instead of Vineapple). The flavors are good too, I love the hazelnut iced coffee.\nThe bacon egg and cheese is ok....overpriced and not enough bacon.\nThe people who work here are friendly and I like that it's open early in the morning. Overall I like this place. Best neighborhood coffee shop around here.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-10", "description": "We visited NYC this weekend and headed over to Brooklyn to visit the Brooklyn Bridge Park. On our walk over to the park, we stopped by your little restaurant and we are so glad we did. We had a donut and a carrot cake muffin. Both were wonderful! So glad we stopped in.", "author": "Jonathan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-22", "description": "Great option for a lunch on the go. I tried the ratatouille and they heated it up for me right there. Only $5.00 for a large bowl of ratatouille. Totally recommend for an on the go lunch!", "author": "Jazz L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-13", "description": "Excellent coffee! They have perfected brewed coffee and espresso drinks, plus great pastries and service. Will be back!", "author": "Kristin T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-16", "description": "So this gets 5 stars considering what it is--a hole in the wall, family establishment that sells your standard coffee and fluffy New York bagels. I come in here every week, sometimes a couple of times a week for my coffee, and when I want to have a big breakfast I'll get a bagel with egg and cheese. SO. EFFING. GOOD. It's cash only, but it's cheap. There's a cash machine in the back if you forget to bring cash, but everything is so inexpensive here you don't need much. The only things that suck sometimes are the cookies, but WTF are you going here for cookies?! BAGELS. COFFEE. GET OUT. Get with the program people! (ps--the scones are pretty rad, too).\n\nI love this place. Sometimes, you really don't need all the bells and whistles, especially not when it comes to a good ol' cup of coffee in the morning.", "author": "Emily H."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Cranberry’s", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "48 Henry St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/MmEWtgBP5w9RYVbiVUprVA/ls.jpg", "@type": "Restaurant", "telephone": "+17186243500"}