{"aggregateRating": {"reviewCount": 46, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "Excellent coffees and pastries. The staff was so helpful  and kind! So happy that I decided to stop in for a snack. \n\n\nDefinitely will be coming back in the future when I'm in town. !", "author": "Nicholas W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "I adore this coffee shop ever since it's opened in the neighborhood. Drinks are amazing, people who work there are incredibly nice and friendly. I just have to go there everyday otherwise I don't feel good all day!", "author": "Mika H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "Super cute new tiny coffee shop!  There are very few coffee shops in this immediate area of Boerum hill, so this little shop is a PERFECT addition to the neighborhood.  \n\nThere are very limited seating options- only three bar stools by the front window, so this is more of your 'grab your coffee to go' kind of place.  Even that being so, we were able to sit and enjoy our drinks while basking in the warm sunlight coming through the front window.  \n\nI had a delicious chai latte which I HIGHLY recommend, especially on any of these cold winter days!  My husband really enjoyed his drip coffee (this was already his second time he has been there within the last week!).\n\nDefinitely come here!!", "author": "Marjorie W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "I met the owners one day in a walk and I was so delighted with them that I went out of my way to try their place.\n\nIt was as good as I hoped.   The coffee is excellent, the muffins great and they Amber and Bart are lovely.  \n\nIt is definitely worth seeking out and buying there.\nIt's a neighborhood gem.", "author": "phil p."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-11", "description": "First time coming here and I made it just before close! This place is small but quaint and accessories here are awesome. There's a little scrabble at the table at the window and planted succulents in an old coffee can. Overall just a bunch of small cute things. \n\nNow for the Latte: I got an earl grey tea latte and it was absolutely AMAZING. perfect foam and taste. I've heard good things about the vegan hot chocolate Get and I'd like to check it out sometime. \n\nWill be coming back!!!", "author": "Marsha G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-02", "description": "One of best almond lattes in Brooklyn. Check this place out. Lots of great cakes and treats and in a cool spot of Brooklyn.", "author": "Vanya J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "I love this place! I went every day before work for a latte and it was delicious and it made my day! And the people who work there are super nice. I am so sad I don't get to enjoy this place since I moved away!", "author": "Marta K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-02", "description": "Went here with the BF to get out of the rain. The place was nice and cozy clean and inviting. The wood wall that had a hidden door was something that stood out. Barista was friendly and really easy going! We ordered cappuccinos which tasted great and had chocolates from LA!!", "author": "Geno F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-17", "description": "I stumbled upon this little gem in Boerum Hill, Superb customer service by Dot n Lines barista - Zenda. She mad me a vegan hot chocolate that was amazing !! Thanks for the experience !!", "author": "Tatyanna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-25", "description": "This is the best quality coffee we've found in NYC. Everything has a richer, fresher taste. Strongly recommend their maple latter which doesn't have any syrups or artificial flavors/sweeteners. Really nice atmosphere (love the wallpaper) and the baristas are always friendly and make this place feel like a true neighborhood gem.", "author": "Tara R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-13", "description": "Super cute, delicious , very reasonably priced \u0026 nice staff ...my 3 year old loved her chocolate croissant and 'cappuccino' which is also a plus!", "author": "Laura M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-12", "description": "This coffee tastes surprisingly bad, the environment is really unwelcoming, and it's really overpriced.", "author": "C W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-25", "description": "Cute place! $4 cold brew was refreshing on a hot day. Will definitely come if I'm ever in the area.", "author": "Emily O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-30", "description": "Beautiful and smooth latte. Such friendly staff. The milk they used was amazing. Perfect latte!", "author": "Rachel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-15", "description": "FINALLY something in the food/coffee desert between Smith and Fifth Ave. I was so excited to see this place open. Their coffee is great, the food is good, and the space is adorable. This stretch of Nevins and Bergen has been pretty desolate for awhile now, and I am happy that someone saw the potential in this space. \n\nI've also never had an unfriendly encounter with anyone who works here, which is reallllyy saying something for coffee places in Brooklyn. Proof that you don't have to be a snob to serve good coffee.\n\nThey are a little pricey, and they are not open on Sundays, which is something I hope they change. But definitely a welcome addition to the neighborhood.", "author": "Cay V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-17", "description": "a charming little place. good coffee and even better pastries. the baked goods are a tad overpriced but it's worth it.", "author": "Rebecca O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "First time here. My test for any new coffee shop is the macchiato. Well done!  Good tunes too", "author": "milissa g."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-07", "description": "So happy to have such a great place in the neighborhood! I've stopped by several times, and have met both Bart and Zenda. Really great folks, very welcoming. The coffee is excellent -great latte - and baked goods from Bien Cuit. Groovy playlist, too...", "author": "Cynthia H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-05", "description": "Great experience. I enjoyed the coffee and small swanky environment. The barista Zenda was awesome. Great cafe and nice spot", "author": "Mrken H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "My husband and I live across the street and we've been waiting with baited breath for Dot and Line to open. And it was definitely worth the wait! Finally, there is great coffee that we don't have to walk down to Smith or Court to get! Bart and Zenda are super great and asked our names the first day we went in - and we've been going there almost every day since. They even know our dog walker by now - it's like one big happy family! And the coffee is amazing too - delicious cold brew is basically what we drink every day. We couldn't be happier to have them a part of the neighborhood!", "author": "Garrett M."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "dot \u0026 line", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "253 Bergen St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3dfOwi52IMLNsrtBrMqfzQ/ls.jpg", "@type": "Restaurant", "telephone": "+19294336111"}