{"aggregateRating": {"reviewCount": 46, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-21", "description": "dot \u0026 line's tiny quaint room, soft acoustic music, and dim (but not too dim!) lighting create a comfortable place to do work and an intimate hangout spot, one of warm chatter and conversations that are suitable for reconnecting with old friends. Its antique decor adds to this timeless, uplifting atmosphere. And while the space is small, you are not limited to the constraints of its walls and shelves. Lift your eyes off your laptop and look straight out the window to mesmerize in the views of the brownstones that define modern-day Park Slope. \n\nThe workers are also really friendly. The barista greeted me with a genial grin as I stepped onto the marble floor and lay my vintage bag down on the wooden chair. When I took out my phone to capture a few snapshots before exiting the cafe at its 5 PM closure, the custodian gently gestured away of the camera's view. Then we smiled at each other as I strolled out that evening looking forward to a second visit.", "author": "Jennie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-04", "description": "A perfect neighborhood coffee spot that serves Heart coffee (one of my Portland faves!) and baked goods/pastries. \nThey also have a whole wall of other goods they sell, including cards, oatly, coffee beans, etc. \n\nI wish they had more seating, but this small cafe can really only fit the 3 chairs at the window counter. During the warmer months you can enjoy your coffee outside too\n\nCan't wait to come back for our weekend coffee fix. So glad we found this place!", "author": "Kimmy U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-02", "description": "Great little coffee spot in BK! It's right around the corner from my apartment so I go every time I'm too lazy to make my own coffee or want a little treat. They have a large range of types of milk which is appreciated! The coffee is strong and delicious, definitely a good quality. \n\nThe store itself is also really cute. They have fun mugs and things for sale that add to the aesthetic. The people are always nice and surprisingly there is almost never a line! \n\nGreat little spot :)", "author": "Kaitlin F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-27", "description": "Wow I like this place! I think one of my favorite coffee shops so far. Cute, small. Minimal seating by the window. Quirky items for sale. A Burt and Ernie Chocking Victims sign. I felt like I travelled back to ny childhood. Coffee is great, barista is nice and they play groovy reggae tunes. Happy to be so close by. Will be coming back often!", "author": "Milka A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-24", "description": "I had an errand at another small business in the neighborhood and was really hoping to find a local coffee place nearby. This was a great find. Full range of espresso bevs and cold brew. The cold brew isn't knock-your-socks-off strong, but it's not bad, and they honored my standard request for less ice. They have a few specialty drinks like a maple latte and matcha latte, but I'm fine with them sticking to plain coffee. I got a pear caramel thing because I wanted to try the baked goods, and it was also quite good, not too sweet, not soggy. The staff was friendly. The place had a constant trickle of people in but it wasn't crazed, which was nice. \n\nTheir chai is from a boxed mix, which is true at most places but always a little disappointing nonetheless.", "author": "Mira S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-13", "description": "Beautiful and simplistic decor, with some amazing service.\n\nSmall, quaint coffee shop with less than 5 seats. Minimal menu but they do a wonderful job with their espresso drinks. When I went, they had either chocolate or maple syrup flavorings with none other for lattes. They do have non milk options too. They have a small selection of baked goods and fun coffee and tea merchandise available as well.", "author": "Maggie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-22", "description": "They serve a solid cup of coffee, but to be honest, my favorite part is the little collection of children's books by the window. The Dot and the Line: A Romance in Lower Mathematics (a book from the 1960s) must have been the inspiration behind the shop's name. \n\nDot \u0026 line is definitely more of a \"grab your coffee and go\" type of shop, as it only has three seats. That said, those seats are the perfect place to relax and enjoy your coffee while playing with endless scrabble pieces or people watching.", "author": "Kelly C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-01", "description": "Pretty great little flat white you got there, dot \u0026 line. Was very impressed when we happened upon your shop in need of a pick me up. Saw the wall of nice looking beans and the battenkill creamery milk and knew this was the real deal. Coffee was perfect, hot chocolate for the kid put us both in a very happy place. Thanks!", "author": "Julie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-20", "description": "I was visiting from Portland and was REALLY missing a quality cup of coffee (haven't had the best luck in NYC) so when I stopped at this place I was pleasantly surprised! \n\nThey serve Heart coffee roasters coffee which made me feel right at home. The baristas were both really kind and the shop was small and cozy. \n\nThey also sell vintage cups and whatnot which as a vintage seller myself I really loved. \n\nI would 10/10 come back here again", "author": "Sydney H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "Really great, the baristas know what they're doing. Kenyan single origin espresso is a plus because i think thats my personal preference. Cool gingerbread financiers and they sell oatly and a bunch of cool stuff. There's not much seating but it's such a comfort sitting there with tons of fresh air and plants along with a good amount of indirect light. Good vibes and beautiful Gibraltar glasses. \n\n\nI will come back for another knowing that the coffee quality is really good.", "author": "Jenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "Came across this place during a stroll around Boreum Hill while enjoying the sunshine and a rare few hours out n about after a trip to the paediatrics with our newborn. Nestled in a quiet residential street this is an absolute gem of a place. Serves a superb flat white and espresso. \n\nThe place itself is small but quiet we were the only people there at 1pm. It reminds me of a small espresso bar in Italy or somewhere on the continent. It has a counter with some seats by the window and a bench outside. \n\nWill be back after the next paeds appointment; screaming infant contingent.", "author": "Tommaso S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-31", "description": "This is the closest coffee shop to my home. The drip coffee is good, but not amazing. I am a fan of the lavender latte! A must try.", "author": "Kim D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-19", "description": "Lovely little spot to take out wonderful AM espresso! Baristas are positively friendly: good vibes happening here. Portland coffee beans, oat milk, with little tchotchkes filling this cozy corner = 10/10 the strangely charming perks of hipster living", "author": "Grace C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-22", "description": "They serve Heart coffee. The cold brew is decent.\n\nNot a fan of places that charge extra for soy or almond milk though.\n\nOh, and they're now open on Sundays.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-15", "description": "I love this coffee shop on Bergen around the corner from Nevins St ! The matcha lattes with oat milk are delicious and they don't use added sugar !! The hot chocolate is also a hit, but I can't say much about the coffee since I don't drink it. The entrance blends well into the surrounding buildings so you almost don't see it as you are approaching but the natural wood and metal accents that can seem over done at many generic cafes are not here. There is little seating, so it isn't the best place to stay, however, I really enjoy taking my drink to go and strolling down the streets of Brooklyn. I haven't tried the pastries of anything other than drinks here but they all look very appetizing.", "author": "Allie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-20", "description": "This place is small and seems like a hole in the wall. I went during midday on a weekday and it was super quiet. There's not much seating, but have scrabble letters on their marble table for people to re-arrange and take cute photos! Their coffee was okay, nothing extreme.", "author": "Joanna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-26", "description": "Great flat white, loved the maple latte and the homemade pop tarts. Not a huge fan of the NYC prices for these items though. Small shop, good customer service, and I'm glad we stopped here.", "author": "Nellie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "Lovely seating out front to bask in the sunshine on a sunny day.  Beautiful interior space. Small little crafty good for sale in addition to a small selection of pastries.  Espresso was on point. \n\nNo space for laptop jockeys.", "author": "Kieran H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-16", "description": "Tiny coffee shop with 2 benches - outside \u0026 inside. Not too many menu items available, but nice staff.", "author": "Cece Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-07", "description": "Very good coffee. Lots of dogs in the area.\nOverpriced chocolate (but what can you do? That is the tread).", "author": "martin r."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "dot \u0026 line", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "253 Bergen St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3dfOwi52IMLNsrtBrMqfzQ/ls.jpg", "@type": "Restaurant", "telephone": "+19294336111"}