{"aggregateRating": {"reviewCount": 46, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-25", "description": "Found this little gem on the way to Wholefoods! Beautiful full bodied but smooth coffee. Gr8 decor and friendly barista. Will visit daily for caffeine fix", "author": "Susi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-25", "description": "Delicious and cozy new spot opened up in what was previously a cute coffee shop desert. Stopped at dot \u0026 line about a month ago and enjoyed a delicious cortado and an amazing ham and cheese croissant. Loved the coffee, loved the pastry, love Amber and Bart, love this spot. Try it!!", "author": "Katie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "It's true - it is as good as it gets! I happen to be fortunate and live just doors away. Walk to the next corner, enter warm and inviting shop, chat with Bart the owner, Zenda or Nick behind the counter, get nice thermos of full-bodied coffee, leave with a smile. NY neighborhood shop as it should be!", "author": "Wendy F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-08", "description": "Wonderful and cozy new cafe with delicious baked goods (i believe they're from one girl cookies). Love the ambience and they have organic marshmallow fluff! Definitely stop by and get yourself a warm treat.", "author": "Grace C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-20", "description": "Really cute \"hole in the wall\" for a great cup of coffee and really good pastries. Well-designed and simple aesthetic makes it a homey setting. But you can't stay long -- very little seating in the space. Will be back!", "author": "David K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-26", "description": "Cute place! I've been getting the hot cocoa with almond milk and some of their delicious marshamllowy topping. Browse the cute merchandise while you are waiting and take note they have New York Seltzer Co. drinks which I haven't seen since a deli in the 80s - nostalgia! Go there and get something!", "author": "Kellyn L."}], "servesCuisine": "Cafes", "priceRange": "Under $10", "name": "dot \u0026 line", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "253 Bergen St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3dfOwi52IMLNsrtBrMqfzQ/ls.jpg", "@type": "Restaurant", "telephone": "+19294336111"}