{"aggregateRating": {"reviewCount": 40, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "I ordered takeout from here and the dumplings were fantastic!! The portions were a good size and reasonably priced. The pork and chive were super filled, so were the shrimp!! Also the dumpling soup was tasty and dumpling filled. Will definitely be ordering from here again!", "author": "Carly G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-24", "description": "Wow, that is some seriously bad service. I'm not expecting white linen napkins but 25 minutes to make 8 dumplings, and when I ask after the timing, being told with a nasty attitude that they'd only opened at 11. Ummm, it's 1135 and I was your first in store customer. Their entire business is caviar and they clearly prioritize those delivery customers.\n\nHomeless man wandered in and berated me in front of my children for not buying him food. Noone in the shop asked him to leave or stop harassing me. My kids were terrified and if they'd actually served up the dumplings in a timely fashion, we would have long been gone.\n\nDumplings themselves were fine. Nothing special. I had to ask for dumpling sauce as they'd put it in a bag without any. Rude, average, slow. Not a winner in my books.", "author": "Julie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-23", "description": "This place may not look like much on the outside, but it's one of my favorites in the area!\n\nLoves:\n+ They serve a variety of dumplings, jianbing (like an egg crepe), and roujiamo (like a sandwich). All of it is good.\n+ There is a \"rainbow set\" of five assorted dumplings which is cool so you can try most of them.\n+ Good value for the bing \u0026 mo. Both like $5 each!\n+ Location. I used to have to go to Flushing for some of this stuff, and now I can just walk here!\n+ Really sweet staff.\n\nNot so love:\n- Dumplings are a bit pricey, esp considering the bing is cheaper and more filling. *shrug*\n- There are like four stools inside. It's really a grab and go kind of place.\n\nOverall, this place is a gem and I'm really glad they came to Cobble Hill. I wish them lots of success so they stay close to me! :)", "author": "Connie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-22", "description": "I had stayed away from this place for a while. Was it too good to be true? A dumpling place so close? Eventually I convinced myself to walk over. It's a small but clean establishment. A bunch of people were already waiting for orders and more came in after me. I ordered the pan fried pork and chive dumplings and the steamed shrimp dumplings. The shrimp dumplings were good, definitely tasted like there was shrimp and not just shrimp flavoring or mush. The pan fried chive and pork were delicious. Some of the best I've had in a while. Ordered from there again and got the sweet pork mo burger and the chicken dumplings. The pork was a tad dry but still flavorful and the bread was delicious. I don't normally get chicken dumplings, they seem kinda pointless to me, but these were very good! Nice to know that this place has multiple options, def recommend.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-13", "description": "Limited items on the chalkboard menu, but considering I love dumplings and this place is fairly new to the neighborhood, I wanted to try.\n\nThis small business was somewhat busy when I walked in. There's a counter with 3 stools for eating on site but it is mainly takeaway.\n\nThe menu offered Mo or burgers, Bing or sandwiches and their dumplings.\nI was pleased there were vegetarian and seafood options. I decided to order the shrimp dumplings, boiled and 6 pieces at $6.00.\nNote--for just a buck more, definitely go with the 8 piece option.\n\nThe dumplings were average in size and I doubt mine were boiled because they were a bit oily (most likely they were pan fried). It was accompanied by a soy ginger sauce.\nMy opinion was that they were flavorful but the filling was a bit skimpy. I liked the thinness of the dough \u0026 thought the soy ginger sauce complemented the dumplings well. I  also helped myself to the chili sauce for an added spicy kick. \n\nPrices were reasonable, place seemed clean and the dumplings were satisfactory in a pinch. But I definitely had better elsewhere. Still, I'd like to return and try their Bing, crepe-like sandwich.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-18", "description": "The TL;DR - The bing crepes are good. The dumplings could use work.\n\nThey take credit cards, and they're super nice. And they serve dumpling sauce in a giant glass drink dispenser, which is hilarious.\n\nI had the original bing because they ran out of braised beef (bummer). It was light and flakey, but I really had a hankering for more savory.\n\nSo I went back to the counter and ordered the rainbow set of dumplings (1 of each of their five, minus the wonton). The shrimp was the best one. The rest were just bland. The chicken was super mushy. Everything could've used more salt, or soy sauce marinade.\n\nService was quick though.\n\nNote that there are only 3 seats here, so pickup is probably the way to go.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-24", "description": "This is a much-needed addition to Cobble Hill and I am so excited it's finally here!\n\nThis is a super tiny restaurant, so it's not ideal for eating inside unless you're by yourself or with one other person (there are only 3 barstools against the bar area at the window). That said, this is the perfect spot for people who are in the mood for dim sum or Jianbing. Here are a few situations in which this is an awesome place for you to visit:\n\n1) you like dim sum\n2) you work close by\n3) you live close by\n4) you are hungry and on the way to the subway\n5) you are hungry post-work out at the many gyms and studios in the area\n6) you want some precious time alone in this crowded city and you want to eat by yourself\n\nToday was their soft-opening and you could tell. There were three guys working and they were a little overwhelmed, but that's to be expected any time you open a much-awaited restaurant here. I waited about 20 minutes before I put my order in (meanwhile, a couple people left during this time) and about 10 minutes before my dumplings were ready. They had a bit of trouble keeping up with the demand (it's a tiny place, you can only do so much at one time!), and the flow in taking orders vs cooking the orders was a bit off. (They were making a couple orders when I came in, which is why I didn't get to put my order in until about 20 minutes later.)\n\nAll that said, I honestly think it's just the first day jitters. Working in a restaurant during peak times is chaotic, so I can only imagine actually *opening* a place during peak lunch hour. I'm sure they'll smooth out the process and flow as they get everything figured out. \n\nNow, the dumplings. I had 6 boiled pork and 8 pan-fried veggie (6 for $6, 8 for $7). The veggie were by far my favorite and I'd 100% get them again. Only a few of the 8 were as seared as I'd like, but I'll attribute that to the rush and first day, because the flavors and dumplings themselves were really good. The pork were just okay to me. They're made with pork, corn and cabbage, and the green wrapper coloring is from vegetable extracts. I think I just expected more flavor. That said, I will definitely be back to try the other options (shrimp, veggie, pork, beef, chicken and spicy wonton dumplings, jianbing and various sides like congee and braised beef).\n\nI'll end this with the prices and say that they are super reasonable. Much better than I anticipated. Can't wait to go back and support new addition to Cobble Hill!", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-18", "description": "Great vegetarian dumplings here! They seem to have changed the recipe since they started and I am a fan.  The bing is nice as well and the CongYou noodles were really simple and nice.  I would like to see some Chinese vinegar or some special hot sauce to go along with it, but really decent Chinese food.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-30", "description": "All of the dumplings here are great, the chicken and shrimp dumplings are my personal favorite.", "author": "Kevin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-10", "description": "Stoked with this new addition to the neighborhood! Small space, all good. The fried beef dumplings were solid, not mind blowing, but I'd definitely get them again. But the Chinese signature crepe with braised beef was soooo good. It might be my new favorite Chinese street food item. This dish will bring me back....a lot. I'm craving it now that I speak of it. The fungi and cucumber was ok. I don't think worth the size and price. And very little fungi in my serving. Also someone posted that they have combo meals on the chalkboard, but that is no longer the case. Total bummer as I think with the combo I would try all their sides if I could. Keep up the delicious goodness my friends.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-22", "description": "Oh dumplings is oh so good! Although I didn't order the namesake, I went for the pork bing. As one of few and far in between Chinese places in the area, this one quickly takes the cake for me. \n\nThe bing was eggy, fluffy, crispy, saucy, and filling. I couldn't even finish my single order. \n\nIt does take a while for the food to come out which I could tell started to annoy some patrons. Aka, I'd bookmark this place for another day if in a hurry. \n\nI'm def keen on coming in another day to try other menu items. Congee, cucumber salad, and the oh! dumplings themselves :).", "author": "Bonnie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-12", "description": "Came here because the crowd outside drew me in, so wanted to know what the big fuss was about.\n\nI ordered the 8 pork dumplings and the bing. The dumplings had a good flavor and was surprised to have corn in each bite, which was good.\n\nThe sauce that came with the dumplings was the highlight. It was great with a nice kick that came from the pepper. The dumplings were very delicate and broke, so I would suggest making sure that they are wrapped well so that way the juices can stay inside.\n\nThe bing was okay. Maybe because I got the plain one? I am used to the ones that they have in Flushing, but this was okay for Brooklyn.\n\nDefinitely a much needed spot in the area.", "author": "Deirdre L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-18", "description": "This is my favorite little place! The jianbings hit the spot and are reasonably priced, which is hard to find in nyc. The shrimp dumplings are also always a hit.", "author": "Joanna D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-14", "description": "A casual little spot great for picking up dumplings on the way home or stopping for a quick bite to eat! \nThe service is fast and the prices damn good as well. \n\nI got the rainbow plate- a great way to try everything. It comes with one of each flavor dumpling, my favorites ended up being the pork and beef dumplings! The dumplings are filling and authentic tasting. \n\nThere's not much space to eat or chill, but that's fine, this is more of a grab and go kind of place. \n\nI'll definitely be back when I wanna grab a quick lunch or dinner on my way home.", "author": "Claudia C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-01", "description": "I go here every so often because the dumplings are pretty affordable and legit. I usually only like vegetable dumplings, but Oh Dumplings has me hooked on their chicken dumplings which I usually do not want to eat. Everything is to order so there are times I've waited a significant amount of time but otherwise it's relatively quick. Everyone who works there is really nice. Haven't been in a while but it's a perfect quick dinner.", "author": "Sacha-Avi S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "So good and perfectly fried. Glad to see vegetarian options. The Wonton soup was also really flavorful. Fast delivery!", "author": "Julia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-08", "description": "Once, what feels like a million years ago (maybe 8), I spent a few weeks in China where I had a very difficult time figuring out what to order and eat (made more difficult by my vegetarian preference and lack of communication skills). One thing that sustained me during my time there were the Bing sandwiches which I had discovered during the second half of my trip. I ate much better after I found these vegetarian (crepe, egg, sauce) breakfast sandwiches which I consumed every morning at a very rapid pace. They were oily and greasy and cost the equivalent of 25 cents and were the best thing ever. I was super excited to discover these same sandwiches (sold for slightly more than a quarter) at Oh Dumplings. They also have vegetarian dumplings! And meat stuff too for the rest of you. The place is tiny, the order might take a few minutes, the menu doesn't always reflect what's available but I hope they stick around", "author": "Lana V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-13", "description": "Pretty solid spot in the neighborhood if you're craving dumplings. Not too expensive. Can be a bit slow if there are other customers. A place better suited for to go orders.", "author": "Kim D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "Yum!  We checked out this spot during their soft opening.  The veggie dumplings were great, including tofu and a mix of soft and crunchier fillings.  The dipping sauce was also really good, with a bit of vinegar to balance it.  We also shared a bing, which was a great balance of crispy, soft, eggy, salty, and a tiny bit sweet.  The prices are also low given the quality of the food, so it's a great deal!  \n\nWe did wait a little longer than I might have expected, but everyone was nice and I didn't mind.  I'll be back soon to try other menu items and see if they speed up their service as they get fully up and running.  And I agree with the other review that some music would be nice!", "author": "Margaret W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-15", "description": "Ate at Oh Dumplings today, and went at just the right time, as the place started to get crowded as soon as we got there. There's one high bench with only 3 stools, so it's really more of a pickup spot unless you can score one of those three seats! \n\nThe 3 stars are not for service or lack of seating, but the dumplings themselves. Ordered the pan fried shrimp and boiled chicken. The meat wasn't well cooked or flavorful, and the boiled dumplings were watered down inside. They were fine for a quick lunch, but I wouldn't go out of your way for the dumplings alone!", "author": "Shane C."}], "servesCuisine": "Chinese", "priceRange": null, "name": "Oh Dumplings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "6 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/iBeWfW256J5GxzbmRTZFVg/ls.jpg", "@type": "Restaurant", "telephone": "+13477991237"}