{"aggregateRating": {"reviewCount": 40, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-06", "description": "It was really busy when I went and the store is a bit smaller so not ideal to sit there to eat. A great take out place. The dumplings are good but the filling could've had more taste. The bing was good but not as crispy as I hoped it would be. It's still a soft opening so there's room to improve and make it better, just glad for some more Asian variety aside from Thai in the area.", "author": "Tracy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-19", "description": "most authentic 煎饼 jian bing in the city, hands down. Brought be back to Beijing. Hidden jem! Now if only they made 鸡蛋灌饼！:D", "author": "Joe S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-30", "description": "Our office orders from OH Dumpling regularly. Now they have a new Chinese Vegan noodle. Awesome!", "author": "Nathaniel J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-27", "description": "Great for the neighborhood. Great location. Great for takeout. The vibe inside is a bit flustered and awkward as it's just a soft opening but I'm sure the neighborhood will keep going. They need to get some music playing in there though! Make it more comfy for their customers waiting for their meals. The dumplings were so yummy. We also got a crepe thing which was good but I could have eaten like 20 more of those dumplings. Delicious!", "author": "Abigail H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-27", "description": "Everything was cooked fresh in front of us!  Very quick.  We had the cucumber salad, chicken\u0026celery\u0026mushroom dumplings, pork spicy wontons, and then the lamb bing.  Very flavor and the szechuan spicy oil was great!  I have nothing but good things to say.  I live right nearby, and they saved me a trip to Flushing!", "author": "Kieran H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-16", "description": "Very flavorful and piping hot!  Tried just about one of everything and was not disappointed. Well worth dropping buy and grabbing something.", "author": "Susan F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-04", "description": "Tried the pork wontons in spicy oil. The food itself was quite good. The wontons were delicate and flavorful, and the chili oil had just the right amount of heat-- numbing but not overbearing. As all the others have said, the service is a little slow as the kitchen is small. I probably would avoid peak lunch hours, etc-- but if not too crowded, I recommend stopping by!", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-15", "description": "Ordered rainbow set to taste all their dumplings. As Chinese myself, their dumplings are much better than those in Chinatown!  Pork and beef are the best! So much flavor and unique.  Will definitely come back to try Bing and Mo!", "author": "Cheng K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-02", "description": "Went there on their first day soft opening. Ordered 8 pcs mix dumplings( they only have 5 pcs rainbow set now when went there second time). As Chinese myself, their dumplings are much better than those in Chinatown!  Pork and beef are the best! So much flavor and unique.", "author": "Chen Guang K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-11", "description": "I ordered the dumpling. They tasted okay. After 4 hours I feel horrible stomach pain :(", "author": "Julius S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-16", "description": "They don't advertise the dumplings have imitation crab! Why claim organic chicken or grass fed beef when you are filling the dumplings with imitation crab! Bland taste and thick dough.\n\nAlso very dirty cooking space.", "author": "chris m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-26", "description": "I thought these dumplings were absolutely delicious. Super flavorful beef dumplings with a little bit of beefy juice/soup that exploded out when you bit in to them. The bing was well cooked and had good flavor. The chili sauce could have been distributed a little more equally through the folded crepe, but whatever!\n\n My actual favorite was the cucumber \u0026 mushroom side salad. It wasn't too well marketed on the sign board -- it is called \"fungus\" there rather than \"mushroom\". I think they were 'wood ear mushrooms' -- also not sure if that name is better. In any case, that's some real Chinese food like my mama makes. Would highly recommend giving it a try - the tangy vinegar helps offset the heavy bing + dumplings.\n\nEco-friendly takeout materials :) \n\nStopped by on a Sunday night and had maybe a ~10 min wait to order and get my food. We were not in a rush (and totally understood, since the dumplings were being fried in the background / we watched the bing get made).", "author": "Iris Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-13", "description": "Been here twice now and both experiences were great. Perfect place to pop in on the way home to pick up some delicious dumplings. Crepes look great also.", "author": "Joel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "So delicious, great find! Just wandered by and were hungry - chicken dumplings are 5 stars", "author": "Katherine T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-10", "description": "The chicken dumplings and the lamb bing killed. I would definitely go back and try everything!", "author": "梣"}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-31", "description": "Got the rainbow dumplings (all six types of dumplings) and a sweet pork bing. The food is outrageously good. Terrific addition to the neighborhood. Still a soft opening so they're running out of food/not prepared to serve all the items on their menu, but I'm hopeful that they get up to speed quickly because the food is amazing.", "author": "Alex L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-07", "description": "Very creative Asian food. \"Bing\" is a must try. Dumplings are definitely not the average dumpling you think you have tried in other Chinese dumpling places. Not only it has lots of flavor to choose from. Owner have added their own secret \"touch\" to make it unique and yummy.", "author": "Tony P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-10", "description": "A welcome addition to the 'hood. Dumplings are incredible.", "author": "robert s."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-09", "description": "Very authentic and delicious Northern Chinese street food.  Small staff and kitchen, so expect a long wait.  The food is very tasty and affordable and is worth the wait.  Staff is very nice as well.", "author": "Scott R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "Ok so I was skeptical...meh dumplings I can get at any Chinese joint, but these were really good! :). They were substantial where 8 chicken ones filled me up quite a bit. The dough is really good as was the filling. I haven't been to many homemade dumpling places so maybe I can't compare to the generic Chinese take out ones, but this could be my new go-to for something quick to eat.", "author": "B B."}], "servesCuisine": "Chinese", "priceRange": null, "name": "Oh Dumplings", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "6 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/iBeWfW256J5GxzbmRTZFVg/ls.jpg", "@type": "Restaurant", "telephone": "+13477991237"}