{"aggregateRating": {"reviewCount": 304, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-18", "description": "61 Local is one of my favorite spots! I used to come here all the time for the Brooklyn Standup comedy shows on Wednesday nights. We would grab a little something to eat beforehand and the go upstairs for the show.\n\nThe chicken dish with the hot honey biscuits, OMG. So tender. So good. Everyone else at the table is usually wondering where the hell those biscuits came from and why they don't have any.\n\nI've also tried the chicken sausage and the mac and cheese, both very tasty.\n\nThe atmosphere is super fun, big picnic bench tables. Great craft beer selection, along with cider. Friendly staff and water you can grab on your own - strangely important to me in my old age. Overall a great place to hang!", "author": "Alex G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-27", "description": "Despite the capaciousness of this cafe, the chillness of its vibe, and attentiveness of the bartender, I have to leave a mediocre review for this place because they served me the worst tacos I've ever eaten.\n\nBefore this evening, I thought the taco was like pizza was like sex: great when great, still good when bad. But the bean tacos at 61 Local, with their meager teaspoon of blacks beans and sad wads of sweet potato, left me hungry as well as spiritually adrift.\n\nNo salsa, no cheese, no crema, no tomato, no lime, no lettuce, nothing. And here's the thing: I'm a taco optimist. You could wrap pretty much anything in a tortilla and I'd eat the shit out of it. These tacos, at $14 a pop, $17 out the door, were an insult to my intelligence (let's not even broach the brazen affront to Mexican cuisine). \n\nIn conclusion, I could make better tacos with a random selection of groceries while blindfolded in the trunk of a careening vehicle. Next time you're at 61 Local, enjoy your stay; stick to the drinks menu.", "author": "Dick F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-16", "description": "Great food and coffee! The staff is very friendly and helpful. Great for a quick coffee or a longer brunch/lunch. The only downside is there's not really enough seating downstairs. \n\nAlso, we had a private event here about a year ago and it was fantastic; everything was arranged for us and we could just enjoy our guests.", "author": "Sara M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-20", "description": "Everything was delicious and very hearty portions. We ordered the grits, avo toast, challah French toast, honey biscuits \u0026 chai latte.  Great spot!", "author": "Jane G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-05", "description": "This place popped up after I moved away from Brownstone Brklyn, but it's a solid place to grab a craft brew or glass of wine (or coffee before 4p) and some quiet conversation especially if you are tired of doing that at yet another Starbucks. Interesting space inside.", "author": "Scott L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-16", "description": "One of my favorite craft beer bars in Brooklyn - 61 Local will be in my heart forever.  I've been here twice, and the last time I was there, I had a birthday get-together for a group of 10+ A perfect venue to have people come and go, order their own beers, and discover different types of beer.  They appeal to IPA lovers, stout lovers, brown ale lovers, cider lovers, and have a solid food menu as well.  I tasted my friend's biscuit and chicken, and that biscuit - I can't begin to even explain except that I need to go back to taste more of it to fully complete this review.  Regardless, the biscuit was so soft, buttery, and soft.  It was like chewing on a hot, buttery, pillow, except it was a mixture of flour, butter, salt, baking soda, and I don't know what else.  If you're ever in the area, definitely recommended for a night cap or a chill, relaxing day with friends.", "author": "Hannah L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-10", "description": "Poor service, only good for drinks \nPros:\n- The space has a great vibe and feel; nice ambience\n- Lots of drink options\n- Food is decent, but there is no real kitchen \n\nCons:\n- Literally heard the server in the burgundy shirt tell the other two servers \"don't make eye contact with anyone and just keep doing stuff \"\n- They held true to that advice, because nobody made eye contact with me, until I spoke up and asked to place an order to go. Placed the order at 8:20pm, and it is now 8:52pm (only ordered 3 simple side dishes), and I have yet to receive my order.\n- Another couple at the bar ordered food and drinks, but after an hour they asked for the bill and left. I know it was an hour because I heard the gentleman say, \"we've been waiting on our food for an hour, but we're going to leave now.\"", "author": "Belle N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-21", "description": "I like this place. It's spacious and casual, good for hanging out with your friends, drinking and schmoozing. The music is at a human level so you don't have to yell. The selection of craft beers and wine is good (no mixed drinks). I had a delicious local IPA. \n\nMy complaint, significant enough to remove two stars, is the food. I ordered three tacos for $14.00, billed on the menu as a \"large plate.\"  There was nothing large about it. Technically they were not tacos, but taquitos (mini-tacos). This modest APPETIZER was worth no more than $6, and I'll never order it again, or any other food, at 61 Local. At the time, I was happy to have it because it paired well with my IPA and kept me from getting drunk. But once I got home, I still had to cook dinner!  \n\nI recommend drinking here and eating elsewhere. Having said that, I'll be back for the beer and for the chill vibe.", "author": "Pandora B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-13", "description": "Avoid coming here for any food, honestly I'm upset that I paid $50 for two disgusting veggie burgers and chips, buffalo cauliflower. The only way i was able to swallow was downing my glass of rose. NEVER AGAIN gag", "author": "Mariela E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-13", "description": "Came for a drink and food with my girl . Just passing by . Don't want to say too much just avoid the food . Sorry . But it's a cool spot . Chill. Mostly made for loiters .", "author": "Alex L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-14", "description": "I've only been here for the bar but I loved the low-key atmosphere and the feel of the place. It wasn't busy on a Friday night and I actually could get some work done. It's not packed or loud and so you can definitely have a conversation here without yelling at each other. Will definitely make this place a regular stop, almost like the Local 44 back when I lived in Philadelphia. \n\nDuring the weekends they serve brunch and it's more of a coffee shop, so I've heard. Diverse, respect.", "author": "Myles C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-10", "description": "What a cute little gem!\n\nInterior is open, very low light and large tables for sharing. \n\nPrices are standard for a coffee and the small\nMenu of food was curated for easy making to serve (they don't have a kitchen stars, just the baristas). \n\nExcited to come back :) highly recommend for someone looking to read a book, sip a coffee and have a small bite.", "author": "Herald A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-12", "description": "I love the ambience here and the staff are so friendly! Austin the barista is so attentive and always remembers my order which is a really nice touch. Food is made fresh and the space is beautiful. Great for groups of friends going out because they have big tables.", "author": "Lauren B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-28", "description": "Really disappointed to leave this review but it was such a let down. Sat down to a sticky table and a sticker menu. Ordered the BLAT, which came with 2 cold eggs and a hair on the side. Guac paste was pretty unappetizing but that's just a personal preference for proper avocado. The side of grits was bland, the coffee was good. \n\nWith so many good options in the hood, I'd skip this place.", "author": "Ciara S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-06", "description": "Came across this place while wandering around Brooklyn. Love the atmosphere, commutal tables and great vibe. \n\nCame here early on a Saturday morning with a party of 4 and didn't have trouble finding seating, but it did pick up a lot over the hour we were there. Great local coffee shop with a good selection of food. Highly recommend the grits and avocado toast. Can't go wrong with either one. Would definitely return if I'm ever in the area.", "author": "Calvin L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-01", "description": "Been here twice now for a couple of events they have upstairs. First time was for an arts \u0026 crafts session, which they allow you to bring beer from the bar downstairs. This time around was for a free comedy show Thursday evening.\n\nHad some time to kill, so ordered some grub and beer at the bar (no line). Got the Pretzel Reuben ($13) and a collaborative beer Barrier/61 Local The V.I.P. Room ($7). Love the selection on tap, with brews made specifically for this spot. Pretzel Reuben is hefty - large pretzel bun sandwiching several slices of pastrami, tangy sauerkraut, and thousand island dressing. Tender meat with balanced sweet flavor from the sauce that counteracts the salty bun. Also served with a large handful of Cape Cod chips and spicy mustard sauce (when you have too much bun left).\n\nService here is on point, never a big crowd, and the comedy show was fun. Will come back for more events.", "author": "Shaji K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-04", "description": "In the morning, this place is more of a coffee shop. They don't do flavored coffee - I got their mocha and it was pretty good. I would recommend it. Their chocolate chip banana bread was amazing too - but the price for the bakery items was a bit pricey. \nIt's a nice place to sit and do some work in the morning/afternoon, but it can get pretty crowded.", "author": "Taylor A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-06", "description": "Food: 8/10\nService: 8/10\nAmbiance: 10/10\nOverall: 8.5/10\n\nStumbled upon this place, looking for a local brunch spot.  Pleasantly surprised by the beautiful, rustic location.  Service is a little confusing at first as you're not sure if this is a cafe or full-service restaurant, but a quick glance around and you'll quickly feel the laid-back atmosphere and cafe style attitudes.  \nFood was pretty tasty, but a single gripe was that the rainy weather outside, wooden furniture, and abundance of floral elements meant there were a few bugs crawling around the table. but even for my bug-phobic gf, this was a small gripe for such a lovely hole in the wall, brunch cafe", "author": "james s."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-24", "description": "I threw my 30th birthday party here and had the best time!\n\nI worked with Marissa from 61 Local Events prior to the party, who was incredibly helpful in determining the kind of space I'd need, as well as getting my food order in and staying in touch throughout the planning process.\n\nThey do have spend minimums to reserve large tables, but the price is very reasonable and easy to meet. The food and wine were delicious, and the service was great! The manager and servers were very amenable, and everything ran smoothly.\n\nThe atmosphere on a Saturday night was also exactly what I wanted. It's not a rowdy place, but still lively enough to feel like you're out -- a nice low-key vibe, but not dead at all.\n\nI'd host another party here, and would definitely recommend it!", "author": "Antonia S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-02", "description": "Know before you go!! This place does not serve actual lunch on weekends before 4 pm. So my friend who was hungry for more than brunch at 3 pm on Saturday was forced to order off the brunch menu - consisting mostly of egg based items. She had already had 2 eggs for breakfast. She finally settled on fruit and yogurt and rejoined me at the table but then they came out to tell her that they were officially out of yogurt. Leaving her with nothing. Let's just say - service is not their forte here. I won't be rushing to come back.", "author": "Lauren S."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "61 Local", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "61 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/dIDd9QhrMDJrLaBbOPozhw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751150"}