{"aggregateRating": {"reviewCount": 304, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "We were stressing about where to host a casual post-wedding bagel brunch until we remembered about 61 Local's awesome private event space. I emailed them and received a response within a day. It was easy to coordinate to set up the event, and the day of, the staff was extremely attentive, helpful, and kind. The space itself is lovely, and everyone had a wonderful time. Thanks 61 Local!", "author": "Samantha D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-15", "description": "Have you ever been to a bar where you liked all of their beers? Like really liked all of beers?\n\nWell about a week ago, I found that bar. Are you feeling as incredulous as I am? 61 Local's beer selection is amazing and being able to try 5 oz for $3 is wonderful for people like me who want a taste of everything, without the full commitment. Not just that, but the staff are passionate about how awesome their bar is. Good beers and staff who care, it's almost too good to be true!\n\nBest of all, 61 Local introduced me to a new favorite brewery, Gun Hill and it's only in the Bronx. \n\nGuess where I'll be going next?", "author": "Rebecca H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-05", "description": "Relatively quiet, beautiful cafe just off of Smith Street when you need a break from the Cobble Hill crowds. I've been to this place a couple times and I'm always very impressed with the high ceilings, comfortable atmosphere, and spacious layout. \n\nWe ordered a melt ice cream sandwich ($5) and I got a pomegranate cider ($8). The cider was strange, not bad but not what I was expecting (less pom, would have liked more). They have a nice selections of drafts, wines, and cocktails. On the pricier range for cafes but I guess you are paying for the experience and the atmosphere too. \n\nThey serve small plates, cheese platters, and sandwiches if you are looking for a bite. Seems like a great place to get some work done during the weekday.", "author": "Maria W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-11", "description": "The space is great with the high ceiling and natural lights. \nCame in at a Sunday noon. \nLaptopers and other people co-exited in the space. Pros: \nmany seats; \nmany outlets; \ndecent coffee; \ndecent wifi;\nFood is great! Tried the avocado toast for lunch. \n\nCons: really LOUD!\nSomeone had a birthday party with cakes and songs. \n\nPs: I don't like beer but many people get bear while working on laptops.", "author": "Simeng D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-19", "description": "Really cool venue. Came here for an odd event that happened to be a fundraiser-comedy show benefitting stray animals. We were in the upstairs space, but ordered our drinks down at the bar.  I really appreciated the decor of this place which is located on a quiet street behind a relatively non-descript facade. \n\nThe scene seemed fun and lively and the event was certainly packed. The food, which I did not try this time around, looked surprisingly good for what it was. The beer options were good and the pricing in line with the market.\n\nI enjoyed my experience and would return, even without an event going on, just to grab drinks and apps with friends.", "author": "Charles B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "I love 61 local and their down to earth friendly staff. Even though they don't have the best wine (it's from tap), I'll still come back because the staff is so generous and kind. Their beer/coffee/tea/brunch is still stellar.\n\nThe space is open and community focused. There are children's books on the walls, board games, and flowers in mason jars on tables that add a nice touch to your grams. I also cant help but smile at the beautiful families with young children who frequent this place on the weekends...in my head (with slight envy), I wish: can I find a guy, get married, have children, and be you already?!?!?! Baby steps. Baby steps.", "author": "Chrissy H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-03", "description": "Went here last night for a surprise birthday party. They did a great job of serving food. Its a beer and wine bar, so no margaritas. They space is large and there are lots of tables. \n\nSome of the highlights: \n\nPretzel Reuben: This was absolutely delicious. One of the best Rubens I've ever had. The roll was a pretzel roll with pastrami, sauerkraut that was delicious and a very tasty sauce. I would recommend everyone try this. I cant wait to go back and try this again. Rating 10/10\n\nBeer: \nStoudts Bright Lager: Drank this all night, like it a lot. 7/10", "author": "Jean-Paul L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-21", "description": "I really like the atmosphere here. Its very open and has the solid coffee shop feel, but wait... There are a ton of delicious beers on tap.  Its really hard to go wrong picking out a great beer here. They also do flights for tasting if you really want to get your Untappd numbers up there. \nReally a solid place to stop by.", "author": "Andrew A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Been here so many times, both when I lived in Brooklyn and now when I visit. We've done birthday parties, happy hours, business meetings, and more in this space.\n\nThe food is great, the coffee is delicious, the beer is cold.\n\nEnjoy.", "author": "John D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-21", "description": "I like the mix of stuff at 61 Local. It tries to be everything to everyone, and it's not bad. It's a decent coffee place, has beer and wine, and has interesting non-alcoholic bevs including ginger ale they make, lemonade, tea, and kombucha. The food menu is surprisingly good. The off-hour menu is quite limited, but there's enough that someone who needs to eat will probably find something--some breakfast stuff and the truffle grilled cheese. The kombucha is okay, I wish they had flavors and it were more carbonated. The lemonade is a bit weak, but nicely flavored. The bar staff isn't looking for people who want to order, so I really needed to walk over to them--eye contact won't work. But they're friendly enough once they deign to acknowledge you. There are a ton of people with laptops well into he late afternoon. I've also played board games there with friends. It can be a bit loud for that, but the long tables are nice. The front has high tables. Here are a couple of bike racks out front, but they could use more for nice weather times.", "author": "Mira S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-28", "description": "This is a chill place. Was at a local expo at the Marriott Brooklyn Bridge and wanted to grab lunch at a craft pub. Saw that 61Local wasn't too far of a walk. Out of the sun, this place was cool (temp-wise). Looked like it was lit by natural light. It was also quiet, because people were working here; many with their apple laptops using the free wifi. The bar was simple in design and is where you order your food and drinks. They had a decent list of craft beers and you can also get a flight for $3 each. Had the Starchild Sour (grapefruit) Ale, Black Gold Stout (nitrous), St Stusan Belgian Blond (too much bubblegum flavor), and Victor Belgian Strong Ale.\n\nThe food was standard but fresh and locally sourced. I had the Reuben on pretzel bread. Never had pretzel bread, but it was delicious especially with the spicy pickle. \n\nDefinitely would recommend if you want to work and drink beer.", "author": "Tinyee H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-28", "description": "I was excited to finally come here after it being way too crowded last time I stopped in. My husband and I sat at the bar and were perusing the menu when one of the bartenders hopped up onto the counter behind the bar to change the chalkboard beer menu. She walked along the counter and then stood on top of the mat where the clean beer glasses sit while she erased and rewrote the menu. \nTheir clean glasses might have well been stacked up on the floor!! \nAnyway, we ordered drinks from their beer menu, which is good, by the way. We also ordered their buffalo cauliflower, which tasted like it was microwaved and was more batter than actual cauliflower. Definitely wouldn't recommend it. Probably best to stick to something made on their panini press or crockpot since they don't have a full kitchen.", "author": "Erin P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-23", "description": "I go to 61 Local to work on my laptop out of necessity. It's one of the only cafes with wifi around me. The coffee drinks are perfectly fine and good tea selection. The food selection is decent, I like this plate they have with smoked trout. I'd say all around it's solid... but THE SERVICE! is so bad. I often walk up to the bar to order a drink from an employee and their response is \"oh, you'll have to ask Katie or Katherine\" As if I know who that is! I get the vibe is relaxed but the service is too relaxed. \nThey need to train their employees!", "author": "Olivia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "We held our fundraising party for Forefront Brooklyn Church at 61 Local and the staff was so friendly and welcoming. They made us feel comfortable and went above and beyond most Brooklyn restaurant staffs to assist us and ensure we had everything we needed to host a great party.\n\nTheir private room upstairs is the perfect gathering place for a small to medium sized event. Their food and drink selection is always top notch. So grateful for this place!", "author": "Don T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-04", "description": "Fun place!\n\nHere for a birthday gathering a few nights ago and I must say this is a happening bar! Crowded? Yes! Lots of beer and other alcohol to choose from? Yes! Despite what my photo implies (it looks like a shaky drunk took it)...I was not drinking alcohol. In fact, I ordered the Kombucha and liked it so much that I ordered it twice!", "author": "Amina-Louise J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "Pros:\n- Great food (pretzel bun reuben, 3 sides for $11 (I go: half grilled cheese / tomato soup / side salad)\n- Kombucha on tap\n- You can start a tab and work all day (coffee - lunch/kombucha - beer)\n- Great open airy space\n- Good internet\n\nCons:\n- Seats near outlets are hard to come by\n- The guy at the end of my bench had the jimmy legs today.  Not cool man. Grab a stool.", "author": "Jake D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-23", "description": "Came here to see music upstairs but ended up getting food, too. Had the beet burger, and I have to say it was the best beet burger I've ever had. Not as much of the dirty taste of the beet, but more of the savory and sweet part of the vegetable. Paired with a buttery and perfectly crisp ciabatta bun and pickled onions, how could you go wrong? Served with a healthy portion of nice strong potato chips (with delicious ketchup on the side,  actually I liked it with the chips) and a homemade pickle (with an incredible kick to it). \n\nA little price-y for the portion size, but because it was just THAT good, I went up to 5 stars. I want to say a lot of their ingredients are local.... \n\nThis place is beyond chill and the folks who work behind the bar are never in your face. I would come here just to hang and get a beer for that very reason, but I just wasn't drinking tonight. Way too cool for the hood, imho. Also the events upstairs are so fun, check out the calendar if you have a moment!", "author": "Caroline D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-20", "description": "A hidden gem off of Smith Street.  This place has high ceiling and wonderful space.  You aren't allowed to come in unless you own an Apple computer (Macbook), sorry :(. We counted 30 computers here.\n\nThey have a cute little bar where you order all the food and drinks, there is no table service.  Menu is pretty delicious and has something for everyone! I had the avocado toast and added some hot sauce which was fantastic! The lattes and bloody Mary's didn't disappoint either.  I wanted to try their pop tarry which looked delicious but I will have to go back another time.\n\nReally cute place, definitely more of a workers atmosphere, not good for a group UNLESS you reserved a table, which you can totally do no problem. I only had breakfast here and would come back.", "author": "Lauren H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "Wow what a find! \nLocated in a busy neighborhood in Brooklyn with lots going on! Great energy!\n\nMy friends and I had Sunday brunch at 61 Local at the end of September. The gastropub was charming and spacious. Employees were friendly and helpful.\n\nI ordered the Mediterranean quiche (it was the most tasty and out of this world quiche I have ever had!) and the Challah French Toast with ricotta mousse, lemon marmalade and toasted hazelnuts. Oh my goodness!! My mouth is watering just remembering these tasty melt in your mouth morsels! \n\nI definitely recommend 61 Local! \n\nDown side - we parked 10 blocks away. Highly recommend mass transportation.", "author": "Terri L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "I love my beer and I love it here, at 61 local! \nAwesome that they have local craft brews on tap. The space is just damn cool. A great place to chill and get drinks. I'll be a regular!!", "author": "E L."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "61 Local", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "61 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/dIDd9QhrMDJrLaBbOPozhw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751150"}