{"aggregateRating": {"reviewCount": 304, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-24", "description": "Y'know, I hate hipstered moustache types as much as the next gal, and by rights I should have disliked this place - but naw, 61's all good.\n\nLovely cappuccino - someone who pulls a shot well is an asset to the planet, so that and a croissant from Bien Cur up the street made for a lovely mid-day break.  I came in during the day so can't speak to the beer or anything, and the park benches and slow-ish wifi were a little frustrating at times.  Then again, I suspect that if they did have comfy chairs and a fireplace people may not want to leave.  It's a lovely exposed brick space with lots of light and wood (and James Brown on the stereo for the win).  The vibe here is chill, social and people happily chatting, working on computers and enjoying this local gathering place.   Nobody rushed people out of here, and that's always a nice thing to see as well.  Neat place to check out if you're in the neighbourhood and need a pleasant break.", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-25", "description": "Great local beer selection, knowledgeable bartender, and attentive service. I love the vibe of this place. Almost walked right by it as the front is unassuming. The high ceilings, decor, and cool music selection make it a really relaxing and dreamy space. Will definitely be coming back to try the food and with a group since it's so spacious. Wish it was open a bit later on the weekends but I guess that's a symptom of the neighborhood.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-03", "description": "Pros: A great spot to chill for drinks with friends in the evening, and a great spot to grab a beer and do work with other freelancers in the daytimes. \n\nCons: No offense- there are a lot of kiddos and moms that seem to take over the place when I'm trying to find a nook to do my drinking at. I seriously tripped on a kid today (they were running around). \n\nIf you can handle the kids (and I can, even though I may trip on them), you're all good here. Plus Brooklyn Soda Works is another delicious alternative to beer that they have. mmm!", "author": "Kris M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-04", "description": "Excellent selection of beers accompanied by unique food...not your typical pub grub.\n\nIn warmer months, they open up the front \"garage doors\" which makes for a perfect outside feel.\n\nReally chill during the day...lots of people  typing on apple products and families with expensive strollers.  It gets a bit more lively at night, mostly a hipster crowd.", "author": "Grand B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-27", "description": "Pleasantly surprised by the quality of this spot. I was under the impression that it was just a coffee cafe w/wifi so finding beer and savory food on the menu when I walked in was bonus.\n\nThe food menu also includes pressed sandwiches, salads, and snack plates. We had the spicy peanuts and the grilled cheese, both offered unique flavors...you won't find any artificial ingredients in this place. I went with cider instead of coffee so can't tell you about the caffeinated beverages, and the brand of coffee they use was new to me. Nevertheless I am guessing they know how to brew a strong cup based on all the other positives. Prices are reasonable (there is a $20 minimum for credit cards).\n\nThe ambiance is warm despite the warehouse space. All the tables are communty style decorated with small floral arrangements, water jug light fixtures hang from high ceilings, and a skylight allows for some natural light. Music may have been playing on low in the background. The service is friendly and they keep the place clean.\n\nThe wifi signal is strong and most importantly it's free. There are not a ton of outlets though, so plan accordingly if you are coming to put in some laptop hours.", "author": "Adria C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-15", "description": "Despite years of local new mothers meeting here on a daily or weekly basis and putting lots of cash into the slow, mid-day till this establishment still has yet to install a BABY CHANGING TABLE anywhere on the premises. Yes, the bathroom is big enough. Just put any table in there and we'll make it work. I feel badly not only for the mothers who have to change their babies on the benches of your tables but for the childless patrons present who simply want to work on their laptops and not see poop next to them.", "author": "Kiki V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-24", "description": "I love this place. Great space, with interesting furniture and decor (although the tall ceilings can make it a bit echo-y and loud when it's full).  The communal tables are great for making new friends. \n\nReally interesting beer and wine selections, all locally sourced.  Pretty big menu these days (was tiny when they first opened) - sandwiches and 'not sandwiches'.  Everything I've had is tasty - but it's more of a snack food place than a restaurant I would say. \n\nI haven't been to any of the events upstairs but they always sound cool and I do keep meaning to go!", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-20", "description": "This place is comfortable, has something for everyone, and the staff is super nice.  I was there on a hot day and they had a water cooler and glasses at the end of the bar...how civilized!  I have only been in for drinks, but it seems like they may do a coffee shop thing during the day, which I would like to try on a winter afternoon.  Interested to try their food too.", "author": "Craig Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "61 Local is a great bar which serves only beer and wine. They also serve above average pub food. It's an excellent option if you are looking to do a happy hour sans hard liquor. They always have lots of awesome local microbrews on tap. Good crowds on the regular.", "author": "Mitch E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-17", "description": "My brother teamed up with Back Fat when he headlined their show here.\n\nFirst off, they packed out a room on a freakin' Wednesday! That is props! \n\nMoving on, this place is a great looking space. Everyone that knows me knows that I dont like beer and I'm not a fan or bars or pubs or bar-like lounges.\n\nHowever, I'd definitely chill here. The people werent too shabby either.", "author": "William C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-21", "description": "I like this big airy space with picnic table-like seating just off the Bergen Street F station.  It's not a bad spot for getting together with friends in the area - but I just don't really live in the area. \n\nThey have a lot of interesting beers, and for those not drinking, some non-alcoholic options too (though not sure if I could recommend the weird fennel flavored soda I had - it was definitely not my thing). \n\nThey've got some sandwiches, sharing platters, and pie.  I thought my pie wasn't too tasty, and had this very sugary mush filling.  But the ice cream that accompanied it was very generous (three little scoops), and tasty. \n\nI didn't really like how slow the service was - especially when you have to take your own order to begin with at the bar. \n\nI noticed a food walking tour came through here - so they must be doing some cool stuff with food, and there was a reading in a room just upstairs (that I did not visit).", "author": "Joan H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-11", "description": "I like the food values and the combination of a bar, eatery, gathering place, CSA pickup point and even performance space. The food's interesting, fresh and well-prepared and the space is nice, including the bathrooms.\n\nUnfortunately, having visited a number of times over the last year or two, I find the folks behind the bar to be some combination of sullen, superior and distracted. For all the unique things to like about 61 Local, the attitude makes me not want to come back.", "author": "Marie D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "First time Yelper, long time listener.  Older cranky bastard who hates what's become of Brooklyn, NYC, the death of night life, and birth of this dumbass espresso drink thing going on across the country.  I was born and raised on drip coffee (Chock full o'Nuts) and never appreciated an espresso drink until I sat across the coffee bar from this man-bunned barista, Daniel, at 61 Local.  While this guy might look like some tricked out hipster with nothing new to say, he's actually a surly Texan with a PhD in Economics or some shit and he's an absolute refreshing pleasure to talk with while I sip my latte.  Yes, I said it...this guy got me drinking lattes, and they're the best in the country.  And here's why:  I don't know how he does it, but when Daniel lands a latte in front of you, the thing is a perfect temperature, the milk is steamed to perfection, the espresso isn't over packed into the puck and pressed with some manner of contrived precision.  Unlike some dumbass,  incompetent, snobby-ass baristas in NYC, with robotic latte making styles, producing a thing of burnt milk, wrong temperatures, and requiring the latte to be left on the counter for 10 minutes before even a sip can be taken, Daniel's lattes can be quaffed in one gulp upon presentation (not that I would ever consider doing this, I sip and savor this thing of beauty, this creation of Daniel's).  And as far as latte art, Daniel could probably have a latte stand up like a Giacometti sculpture, but instead, he keeps it simple, leaving the milk to form a random Rorschach blot to be pondered and enjoyed anew with every serving.  Daniel is thee Cool Hand Luke of baristas.  Thee only fella I'll buy a latte from.  Keeps me coming back to 61 Local time and time again.\n\nUPDATE 12 March 2016:  Daniel continues to impress me with the ambit of his benevolence.  Whilst sitting outside my apartment the other night, smoking my cigar, Daniel offered up tamales made by his mother, shipped directly from El Paso, Tejas.  DANIEL'S MOM MAKES THEE MOST BITCHIN'EST TAMALES.  \n\nThank you again, Daniel!", "author": "A E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-26", "description": "A good neighborhood spot with a nice selection of local beer. It's spacious enough that it never feels crowded, even when it is, and you can even get a yummy (if overpriced at $9-$10) to go along with your drink.\n\nI used to avoid 61 Local when they were cash only (a cash only bar makes zero sense to me), but now that they take credit cards I'll be stopping in more often. Maybe the next step in their evolution to becoming a regular drinking spot is lowering their absurd $20 credit card minimum?", "author": "Katie C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-25", "description": "I have been here twice and think it is a welcome  addition to the neighborhood offering local brews. The most annoying part is they they don't take credit cards but they have an ATM in house. There is a lot of communal seating at picnic tables, it is casual and has a relaxed vibe.", "author": "Marisa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-24", "description": "I was rock climbing solo at BKB one weekend and turned to Yelp to find a snack. When I saw a bunch of Yelpers checking into 61 Local, I realized I was missing a CMYE and high-tailed it over.\n\nThis is almost like the Sweet Afton of Brooklyn, if a bit lighter and roomier. There is a rustic feel to things, and everything is locally sourced, which usually means really good artisanal food.\n\nI started with the hot ginger cider. Wow was it good. Wow was it hot, also, since it was oddly served in a glass. But my second round came in a mug like all hot drinks are supposed to.\n\nThe charcuterie plate that we shared was excellent. We all had fun building mini sandwiches and devouring them as if we had never eaten before. My entree was less impressive. I got a ham, egg and goat cheese dish that was baked and served in a ramekin. It was underseasoned and overcooked, so the egg lacked any sense of runny-ness. But the quality of the other food suggests that this was an aberration.\n\nDespite the fact that he rushed out early (presumably to attend to his exotic animal importing cartel), I am deeply indebted to Peter D. for setting this up, the free snacks, and the Yelp shot glass to add to my collection.", "author": "Evan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-13", "description": "Great spot! 61 Local has an awesome, chill vibe. I love that their menu and drink list is locally sourced with items from the New York area and along the Eastern seaboard. They have a great variety of options on their menu as well, whether you feel like a drink, cup of tea, or breakfast. The drink list in particular (craft beers, wines, ciders) is interesting and quite diverse which is great if you are in the mood for trying something new or different.  \n\nThe space itself is pretty cool. They have a number of communal tables if you feel like meeting new people or coming with a large group, in addition to bar seating and some seating for smaller parties. The super high ceilings give 61 Local an airy and open feel. Great decor as well. It's located right off the Bergen Street F/G stop. I'm not even going to comment on the absurdity that is the G train, but its a short ride on the F if you are coming from downtown Manhattan. \n\nAlso, bring some cash. There is a $20 minimum on credit cards, unfortunately.", "author": "Kaitlin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-21", "description": "One of the coolest bar spaces I've been to. It's not an over-designed type of cool. Just an interesting building with high ceiling. \n\nThere is a wonderful beer and soda selection and the service is spot on. The high end foodie bar food is worth a visit as well. \n\nOverall one of my favorite neighborhood bars.", "author": "Peter F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-01", "description": "61 Local is a decent place. They have kombucha on draft, an ok local draft list and good food. I appreciate the dim lighting. I don't want to see the bougie and fufu Brooklynites anyway. Keep it thoro.", "author": "P W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-12", "description": "Come for beer, but don't come hungry -- light snacks are all you'll find here. Also, if you're not really into beer then this is most definitely not the place for you.\n\nYou should also know that this place is almost always packed in the evenings, and it's a big hit with the stroller crowd on weekend afternoons. Don't say I didn't warn you.", "author": "C.J. T."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "61 Local", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "61 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/dIDd9QhrMDJrLaBbOPozhw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751150"}