{"aggregateRating": {"reviewCount": 304, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-23", "description": "This is easily my favorite place to grab a drink in this area.  \n\nAwesome selection of craft beers.  There was a Six Point and a Brooklyn brew here that I had never even heard of.  All the food I've tried has been great, and prices are all reasonable.  Last time we went we had pickles, hummus, and a few different sandwiches.  The staff is friendly and seem to be having a good time.  \n\nThe tables in the far back were a bit too dark at night -- could use some additional lighting back there.  Also, was borderline comical how many people were hanging out on their macbooks...felt like a Starbucks!\n\nKeep it up, this place is great.", "author": "Jimmy O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-08", "description": "Not being a beer person doesn't stop me from coming, and ordering, and staying for hours at 61 Local. I can appreciate higher than norm alcohol content for beer as, really, that's pretty much why people drink. Right?\n\nBeing the tail end of the Yelp Drinks Week, and probably the only place close enough to me at work that offers free beer. Different ones every night and choice of a 10oz of one selection or 3 decent size pours to find one you might like. Great way to meet new people that aren't that creepy.  ....I kid, yelpers in general are nice and chatty. They're just a tad more incline to talk to you if you randomly walk up to them. In an event. Which was why I was there. Glad I made it too or else I'd passed by this place like the hundreds of times before without stepping in.\n\nSince it was the last night of the week for the Drinks Week they only had the the Oatmeal Stout left. I luck out and someone was driving, but was earlier than me and got the free 10oz but can't drink it so being the helpful new friend, I choked it down. Not my style. Too.... sweet? I don't know how to say, it's like a Guinness but sweeter. I usually like sweet drinks, anything really, but this one was eh. \n\nLiquid Gold and Ramstein was the others I'd tried. Liquid Gold was a bit too light with too much bitter aftertaste. Ramstein, now this one is yummy. Paired well with my horseradish pickles (mmmm) and jalapeno pickles (only good) and the soft cheese plate.\n\nI also tried the baked ham and cheese with cinnamon toast snack plate. Eh. Filling enough I suppose after a 8 hour fast, but taste wise didn't even make it on the good scale, even when starving. So my recommendation: keep to cheese and cured meat and beer. Those can never lead you wrong.", "author": "Vicky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-07", "description": "-Came here on Sunday after finding out the event was moved to 6pm\n-got to sample  Oatmeal Stout from the Homebrew Yelp Drinks week\n-Stayed here for a while and mingled with the other yelpers\n-Oatmeal Stout was actually great, we got a nice big glass at first then the small sort of two sips shot glass.\n-Also tried the LIQUID GOLD and really enjoyed that one.\n-All in all a great sunday to be out, chatting about various Yelp Activities and meeting new Yelp Peeps like Dan R and Bill T and seeing some friends like Evan, Brian and Matteo.\n-Still 5 stars for this place. Yelp Drinks week ended on a high note.", "author": "Jordan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-07", "description": "Great bar, one of my favourites in the neighborhood, and it definitely fills a niche market.\n\nThe beers are constantly rotating and they always taste good (i.e. well-cleaned lines, fast turn-over, never a kicked beer) which is important at a craft beer bar!  However, their expertise is extended to good food and nibblies (I love their house-made pickles).\n\nTheir long hours (open early in the morning until midnight-ish) make this a common meeting point for many different groups of people - there is definitely a strong stroller contingent in the late morning/early afternoon segueing into a more young-Brooklynite crowd into the evening.\n\nThe last selling point for me is the performance space upstairs.  From what I understand, it's a rent-free space for theater and dance groups to utilize for performances.  The room is a beautiful bare-wood floor and beam construction, very neutral, allowing it to be transformed for a production's needs.  As cool as it is that they have a performance space that's well-isolated from the main bar....it's even cooler that they give the space for free, counting on drink sales as a way to off-set any costs.  Awesome.", "author": "Alex H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-18", "description": "Honestly, this place is terrible.  It is a huge space but they do not even have hard liquor.  As soon as you walk in, it feels like you are at a high class deli with awful lighting.  I really wanted to like this place but there is crappy music (if you can even hear it), the clientele is weird as hell, and the beers are just OK.\n\nI wouldnt recommend going here, unless you wear skinny jeans and love grilled cheese.", "author": "Ryan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-26", "description": "This place is awesome! It's right around the corner from me, but I never ventured in until last night when I saw the sign for the Food Systems Network NYC panel discussion, and decided to sit in on it. The concept for the place is awesome, the meeting area is great, everything I had to eat and drink (tomato curry soup and grilled cheese with a glass of riesling) was excellent, and I can't wait to go back for more events and to try more of the menu...this house-made kombucha on tap sounds very promising, indeed...\n\nWish there wasn't a $20 credit card minimum, but small price to pay overall.", "author": "Caroline K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-14", "description": "Great spot! So much space and reasonable prices. I didn't eat there, just had drink and the place is great. So are the bartenders.", "author": "Charlotte G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-12", "description": "Well that was the best shepherds pie I have ever had. Great low key vibe even though its pretty packed on Friday nights. Food is always great and craft beer adds to the Brooklyn aura. It has the right amount of tables for the crowd and you can actually talk to people without yelling.", "author": "Daniella C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-26", "description": "I love the ambiance and mood of this place, very relaxed, but not at all dive-y. Soft light. They feature lots of local goods which creates a sort of community-feel, from the beers and soft buttery lightly salted pretzels to the flowers on the counter, everything is expertly sourced. The bartender was super well-versed about the beers on tap, and was able to magically produce a sampling of a few beers from my vague and somewhat unintelligible explanation of my taste. Impressive and top-notch recommendations! Also really enjoyed the pastrami reuben which was generously layered with on a pretzel bun with tangy mustard and various pickles. My only gripe would be that we arrived a bit after 10pm and while I ordered right away since I was super hungry, my friends went for drinks first and then were turned away from food orders when they flagged the bartender for food a little later on. It's understandable that they need to start wrapping up at some point in the night, but they weren't particularly attentive and it's always helpful to patrons when a last call for food (and drinks) is hollered before it happens, had we known they definitely would have placed their orders sooner!", "author": "Zoe R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-01", "description": "I came here for a storytelling event upstairs, and instantly loved the decor here. Edison bulby, wood, long tables, and great selection of local beers at a decent price. FYI, they take cash only.\nBased on the reputation I'll have to try the food here next time.", "author": "Mario V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-28", "description": "We wanted to a have an easy-going birthday get together here for my husband, so we got a table. Getting a table requires a minimum pre-order of drinks and/or food, not including tax and required gratuity (20%). \nMy thoughts: \nThey only serve beer and wine. Their selection of beer is great. Their wine is horrible. \nTheir party platters are great and huge!\nThe crowd is great! \nThe space is fantastic; its huge, has high ceilings, doesn't feel like you're gonna die of no air. \nThe service is mediocre. Since they're so busy on a Friday night, it was hard to even get someone to give us our wine that we pre-ordered for our table.. you can even say that there was much of a 'service'. When I went up to the bar initially, they kept on telling me to go to some other bartender to ask for the wine.. and i would go up to him, and he would tell me to go ask someone else. That was pretty obnoxious. \nThe bartenders will also refuse to serve you more beer and wine if they think you drank too much. My husband went over to get a glass of beer and they rejected him. He was pretty sad because he wasn't even close to be drunk and it was his birthday. how do you get drunk of just beer and wine?..  i've never seen anyone do that before, but maybe we just have really top notch livers. but its okay because it was funny.", "author": "Jane K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-10", "description": "I probably had the worst experience ever at Local 61.  I called asking to refill my growler with Kambucha and was quoted a price of $9 dollars.  When I arrived I had my growler filled and was informed that the price would $24 dollars.  I told the bartender that I had called and the price that I was quoted.  He went off to speak to his boss who said there was no way they could charge me the $9 promised (brouwerij lane will refill for $11).  I was asked what I wanted to do and I told them I didn't want it.  They subsequently removed the kambucha from my growler and it was put away, to be served later.  Two, things were quite terrible the service and the hygiene.  I cannot believe that the manager refused to take the price given by their own staff, the callousness of our discord, and the fact that Kambucha was taken back and reused.  It was just a terrible experience.", "author": "Daniel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-13", "description": "There's a certain element of bias in reviewing places that are literally across the street from your apartment, but in this case, bias and all, the establishment in question is totally worth that rating.\n\nAs a halfway-educated drinker of beer (beer education, that is) I always enjoy the taps that they have.  There's always a delicious range of beer types, making it a great date place, a great hang place, whatever--as long as you like beer, you're going to find something awesome.  It seems occasionally they have times where they feature a lone brewery--it was my initial exposure to Barrier Brewery.  Good times.\n\nFood is great--particularly the grilled cheeses.  Nothing is complicated, cuisine-wise, but it's all delicious and certainly seems to pair well with the brews.\n\nThe space is open and airy, with big tables.  I think some people don't necessarily dig that shared space type thing, but I love it.  Also, when I'm in there earlier on in the day, for a drink and some writing, it's rarely crowded, and the vibe remains excellent.\n\nIf you're in the neighborhood, and you like beer, go here.", "author": "Toby S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-26", "description": "Good place to get a beer and the food isn't bad either. It's also a good place to do work. It can be a bit dark though.", "author": "Beth C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-19", "description": "I guess \"love at first sight\" could be real, because I really love this place, and wished that I could live close by. \n\n61 Local is clean, low key, and a great place for beer lovers to visit. It carries a very unique beer collections on tab that focusing on showcasing local and regional micro brews, Especially those crafted brews that were not up for distribution yet (as far as I can tell). It also carries Kombucha and some tasty none-alcohol local made sodas. The rosemary apple cider from the Brooklyn soda works were delicious, and perfect for taking a break in between beers drinking. \n\nI also really like the staff here, they were friendly and very knowledgeable about their collections. We were serving by Jeffery that night. He was very good at understanding our drinking preference, remembered what you had, and always made great recommendation. Simply put, he was absolutely great.\n\nWill definitely visit 61 local when next time in Brooklyn.", "author": "Neena W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-07", "description": "If this place was anywhere in Manhattan it would be a crowded disaster at all times. Its definitely a place for people who love beer. If you are looking to order a Michaelob light, don't bother coming here. Its ALL local. So local that they don't offer Brooklyn brew because its not actually made locally. Yep. Its THAT local. That being said, the selection changes often and its absolutely the BEST place to go to get the beer that you're hard pressed to find anywhere else. The food is a side offering, something to snack on while you're drinking and is all great drinking food. Local cheese, charcuterie, pressed sandwhiches and now a nice selection of scones, pastries and coffee. \n\nThe staff is beyond friendly and love to offer out tastings before you commit to a pint. 61 Local is a great place to do a little day drinking. Its a relaxing place and is very laid back and has a great evening ambiance as well.", "author": "Lizz H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-25", "description": "A local fave, I can always count on having a great time and a mediocre-to-good glass of NY's finest wine at Local 61 (i'm partial to the California grape) (ok, and the beer is awesome!).   The snacks are delicious, and I highly recommend the pretzels with cheese and the faux-gras, which doesnt taste anything like fois gras and is, thus, delicious.\n\nMy friends also seem to always find dates here, so you cant argue with that! Its very rare to get a boyfriend with a $7 beer in this city!", "author": "Vanessa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "Really cute place with good beers. Very spacious and chill.\n\nWe had great sausage sandwiches with dijon mustard and pickled radish. Love that it's a CSA drop spot. The beer and wine selection are great. The picnic tables are fun too.", "author": "Li C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-08", "description": "Lots of space, great beer selection, and their grilled cheese and tomato soup was fantastic.  Good times!", "author": "Jennie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-23", "description": "This is my favorite spot in the neighborhood. Only good things to say about the service, beer, food. One complaint: I know this is supposed to be a gathering place, but crying babies and toddlers really have no place there, especially in the evening. I don't mind the presence of kids, but they shouldn't be allowed to stay if they are shrieking; it is a place for adults, after all. The crying babies that are there post-7pm are really turning me away from here--I had to leave last night b/c my friend and I didn't want to continue working on our project with annoying kids running around. \n\nIs is possible to ask the parents *nicely* to leave if their kids aren't behaving?", "author": "Erica B."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "61 Local", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "61 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/dIDd9QhrMDJrLaBbOPozhw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751150"}