{"aggregateRating": {"reviewCount": 304, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-15", "description": "I would give this place 3.5 stars. Beautiful industrial space with plenty of seating. The service was friendly and the guy behind the bar gave us a few tastes of beer to help with our ordering. I ordered the avocado toast for my son which he throughly enjoyed. All of the food is very good and priced just right. The only complaints I have are 1) It doesn't specify on the large chalkboard that the Bloody Mary doesn't have vodka. I didn't realize 61 Local is beer and wine only so when I ordered the $11 drink I was disappointed to find out it was basically Bloody Mary mix and dry vermouth. This is stated on the menu, but if you're looking up at the board this is not specified. 2) Not a fan of the credit card minimum. Otherwise, solid spot.", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-26", "description": "Do you want a beer? Do you want coffee? Do you want a panini? They have it all here.\n\nHalf bar, half study spot and cafe, this Cobble Hill spot is great for getting some work done or catching up with friends. \n\nThere's tons of space, just get here at a good time to snag a big table if you have a large group. Otherwise there are plenty of bar-like areas to sit (and wooo there are hooks for your bags, ladies!).\n\nService is a little slow, but since there are so many people in here that's understandable.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-04", "description": "A friend and I came in after doing errands and we both thoroughly enjoyed the atmosphere. We split everything as we did not want to not be too filled. We started with the Pretzel which were just being baked and smelled delicious! We then decided on a butternut squash soup and a 'pick 3 items' of a weekend special; We chose the macaroni \u0026 cheese, baked cauliflower and meatballs which were just so perfect and flavorful. All the staff was so friendly and welcoming! Definitely recommend for meeting friends or having a coffee and catching up on emails.", "author": "Paulita P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-06", "description": "All around great place...open, lively, great food, great beer and ciders. The bar staff is a bit on the slow side but friendly ;-)", "author": "A. W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-03", "description": "I was happy to go to 61 local because my date was bringing me there for a surprise. When I arrived, I found out it was for a comedy show on the upper level. I stayed upstairs as he went to retrieve a menu for me to look at before the show started. I ordered the veggie burger (because I noticed it was a vegan option... And I am a vegan) and was told it wouldn't take a few minutes. 25 minutes later (and close to show time) I received my burger and enjoyed it until the second to last bite where I found a HAIR IN IT! I was so grossed out that I spit it out immediately and asked my date to get rid of it for me because was completely grossed out. I tried my best not to ruin our evening and I am not sure what he told them, but a HAIR is NEVER ACCEPTABLE! May go back for another comedy show, but NOT the FOOD... So disappointing...", "author": "Melissa P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-10", "description": "Look y'all. I love(d) 61 Local. I used to come here all the time. It's a great space with great food and drinks. And it's one of the few accessible places in the hood I could go to get work done on the weekends.\n\nBut a lot has changed, and it's really not for me and my needs anymore. It's expensive to live in this city, which means I take on a bunch of extra freelance work on top of my regular 9-5. And because I work 9-5 during the week, I use weekends to get all that work done. 61 Local was perfect for this, but not anymore.\n\nThe fact is that 61 Local is not friendly to people with disabilities. Or people with laptops. And I am both of those people.\n\nI get wanting to cater to the yuppy baby-handling crowd in this neighborhood. I really do. But a lot of us don't fit into that demographic. And -- considering most other places in the hood are also baby friendly but not laptop friendly -- it's a bummer to be slowly forced out of the only place I could (until now) go.\n\nThere's 1 regular table available for laptop users until 4pm on the weekends. The rest of the low tables have signs on them banning laptops. And the only other laptop-friendly spot is the bar or (I think) 1 high top with stools -- which is great, if you don't have accessibility and health needs like me and can't sit on a stool with your legs dangling.\n\nSo like I said, there's 1 laptop-friendly table that I'm able to sit at. But in the past weeks I've had (or seen) staff force laptop users out of those tables to make room for reserved parties. Which means that there's literally nowhere that I'm able to sit.\n\nI also don't understand why 61 Local is all of a sudden allowing parties to reserve the tables downstairs when they have an upstairs space for that. Like, today I witnessed a child's birthday party happening with blow up balloon animals and all sorts of other baby things. It makes sense sort of until you remember that this place serves alcohol. And most things in the space are metal and wood -- not exactly baby friendly.\n\nI think 61 Local is just unsure of what it is anymore.\n\nIt's a shame, because I really did love this place. I'm just really confused as to why they've decided to prioritize some patrons over others, especially considering the fact that 1) many of their weekend patrons are parents with infants (as previously noted), 2) infants can't eat the food they serve, and 3) I frequently see said patrons with infants bringing in outside food for their children or themselves. Meanwhile folks like me (or even regular baby-less patrons!!!), who want to sit at a table for a few hours getting work done (or just hanging with friends), will usually spend a fair amount on a food item and a few drinks in that time, but now we're forced out for the baby crowd. Realistically, who is spending more money here? I'm confused.\n\nI'm really disappointed in you 61 Local.", "author": "G C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-27", "description": "I love this place. Coffee is good. Breakfast is amazing and atmosphere is buzzing! At night turns from a coffee bar to a bar bar with a great beer and wine list. Good wifi also", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-30", "description": "Large space with picnic tables as seating. When we arrived, my friend and I were one of the few people there. Low lighting and candlelight abounded. I ordered the three kale salad, with the dressing on the side. It was fine, nothing crazy to write home about. My friend seemed to enjoy her pork tacos though very much. Overall enjoyed the ciders most! Two on tap, nice and tart.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-01", "description": "61 Local is a beautiful place that I wish I lived closer to so I could make it my home away from home. I've been there a few times for drinks, though it has a coffee/workspace vibe during the day. The staff is very helpful in describing all the local beer and wine and helping you make decisions. They don't serve hard alcohol, besides homemade vermouth (I tried it, it was fun but I'll stick to beer next time).\n\nThe space is so cozy and communal, I'd love to be a regular if I was closer. Definitely feels like a home-y neighborhood pub for a quiet drink with friends.", "author": "Luke Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-06", "description": "Perhaps the best place in the neighborhood for breakfast. They have plenty of seating and options if you are feeling like toast or a pastry. Really good coffee too! Also the staff is really friendly and helpful.", "author": "Mary A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "Very cool bar. Imagine a beer hall, but more upscale. And more local beers.\n\nGreat place to sit down and have a conversation (if you can snag a table). Tons of beers on tap. The walls are adorned with cool wood art. Bartenders are nice. Beers are reasonably priced. Also, a ton of Asian girls for some reason the night we went. Really, what's not to like?\n\nAlso, some older reviews say they don't take credit cards. They do now!", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "Great lowkey spot to meet friends when you want a chill night. Sometimes can get pretty packed on weekends, but is always a great week night spot. There's plenty of seating. When it warm out they'll have the front window open so you're able to enjoy the outside as well. One of my favorite spots in the area. Another plus is that it is like right in top of the Bergen F/G stop so super convenient to meet friends coming from other neighborhoods.", "author": "Kalyn K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-14", "description": "We ordered from the breakfast menu - avocado toast and caramelized onion/goat cheese quiche with salad. This review is really for the quiche, which is honestly the best I've ever tasted. Usually the crust is the best part, and in this case the crust was flaky and amazing, but in the creamy filling was even better.\n\n3 stars for the drip coffee, but 5 stars for that quiche.", "author": "Craig D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-12", "description": "$20 minimum for cards.\n\nNice place to sit with a laptop and get some work done. Outlets in specified areas of this large space. Went for the first time yesterday and definitely planning to return, even though it's kind of out of the way for me.", "author": "Cole M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-07", "description": "61 Local is just that, local. And that's what makes the place special --it's not Starbucks or McD's or your other favorite colorless WI-FI enabled haunt where you can clog up seats and bandwidth working hours away, spending the minimum on your drink and nosh! \n\nAll proprietors know this gig. However, there is a culture of enablement that forgets that WI-FI is a courtesy service and not a government entitlement. So, I am always surprised at how much people bitch and moan when a perk like this is taken away. \n\nThis specifically relates to the use of laptops in a bar/beer hall. I wonder if the moron, oops (writer) who slammed the place, took a moment to look around on the weekends at 61 Local and maybe, just maybe reflect on the fact that a bulk of this operations business is done on Saturday and Sunday. I don't think he/she did! Why? If this \"writer\" did, they would have realized that unlike another park your a** trender in this category --Starbucks, 61 Local is just that, a single operator with a great community concept that's local.\n\nBoo-hoo to you for not noticing the clearly stated policy on the bar (neatly framed for your high screen sensibilities) clearly posted by the front of the bar, the rear stools, by the bathroom and all over the joint! \n\nMaybe, if you took your face out of your screen and looked around your environment for a change you would have noticed that 61 Local is crowded to the gills with folks actually talking, engaging, eating and drinking, not on their laptops, engaging in spiteful and petty reviews of a great establishment. \n\nFour stars to 61 Local for your lovely and exquisite beer selection and your new nosh menu. And to the oblivious screen culture addicts who would rather slam each other on-line, there's always Starbucks. They still allow laptops on Saturdays and Sundays!", "author": "Gif A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-07", "description": "I frequent this place a lot, the coffee is perfect and the food always pleases. 61 is always hopping. The staff works their butt off and does their best to please in their chaotic atmosphere.  I couldn't imagine catering to so many clientele.  There is one girl in particular who wears a red beanie,  who is one of the cheeriest workers I've ever met. No matter how busy it gets she always has a smile on her face.   While the amount of patrons can be overwhelming  they have great coffee, great beer, great food, and workers that bust their butts to make it all awesome.", "author": "Kt K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-15", "description": "I had walked by 61 Local tons of times before finally stopping in for drinks and snacks a few separate times. I was very pleasantly surprised at what a lovely, inviting space it is, and my happiness only increased when I tried the delicious local wines they had available (some tasty red from Red Hook Winery, and a sparkling white) and shared an amazing cheese platter and , fresh biscuits with spicy honey butter with friends. The food is really much better than it needs to be, it's almost worth coming here just for those biscuits! My only (slight) disappointment is that they don't offer happy hour deals, but honestly, I'm more than willing to pay full price for the awesome local libations they have.", "author": "Maeve M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-19", "description": "Great place, awesome coffee and cookies, but why is the manbun behind the counter too cool to even respond beyond a nod?", "author": "Mick G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-13", "description": "We stopped in here on a Friday night around 10:30, got two beers, and plopped down onto one of the several picnic tables. At first we thought we had found a nice chill bar. It has lovely tall ceilings, cool decor, and a good draft list. But the longer we sat there we felt something was off. Finally the hubs hit the nail on the head: it felt more like a Starbucks than a bar. It wasn't really busy and there were people on laptops at almost every table. We felt like more people were here to do homework than hang out and have a drink. Needless to say we finished our beers and left to find a better place. We probably won't be back.", "author": "Jennifer H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-14", "description": "I'm here for a free poetry reading tonight, and i got here early to do some work. Gorgeous tall ceilings, chill music on low, communal tables for socializing or solo work. Very sweet bar staff. I ordered the Chicken and Biscuits and a coffee stout and am slightly weeping with joy -- they are both DELICIOUS. I've been looking for a cozy and delicious spot to come 'work from home' for a while amd I'm feeling relieved -- I just might have found the spot!", "author": "Cecily S."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "61 Local", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "61 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/dIDd9QhrMDJrLaBbOPozhw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751150"}