{"aggregateRating": {"reviewCount": 304, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-17", "description": "I love this place. The food is great - medium sized and inventive sandwiches and snacks. Great selection of beer and wine and the staff are super nice. This has been a favorite spot recently for either a light weekend lunch or a late dinner. I especially like the sky lights - the place is bright and airy. And there are no bar flies... You know, those crusty alcoholic people you always see at a bar who depress you even if you just stopped in for one.\n\nMy only complaint i the kids that roam around unsupervised during daytime hours. Their parents seem disinterested in parenting and think letting their offspring run around knocking into others is perfectly fine. I like kids and would not want to see a stroller ban in place because of some narcissistic parents but I hope the parents start to teach their kids they are not at home. To quote Wanda Sykes \"I don't drink in your playground so don't play in my bar\".", "author": "Maya P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-29", "description": "I like this place, very spacious. I come here sometime during the day when I have a day off from work. The only negative thing which isn't really the cafe's fault is that there is a group of people who decided this is their office, and they occupies a table and keep chatting even though there is a stranger between them.", "author": "Athena G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-10-20", "description": "just drop the $20 credit card minimum.  at this day and age it's an unnecessary nuisance.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-06", "description": "if I'm going for a beer in my hood its this place, awesome selection of local brews always on rotation. bartenders are great will let you try whatever you want. large open, dimly lit great space! very home-brooklyn feel. great finger foods!", "author": "Pan P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-20", "description": "I had a really delicious meal here.  Dig the great beer selection and the sandwiches really hit the spot.  However, as I was leaving I asked the barista (also manages food sort of like a waiter, but there is not table service) if he could wrap up the rest of my sandwich with tin foil.  I didn't think I had budged or anything, but he gave me a nasty look and said \"Ok, well that's going to be five minutes, because there are other people here\".  It was catty and rude, and put me really irritated mood. Even if I did budge, clearly I hadn't realized it!  As I watched him, I realized that the aluminum foil was a little far off and would have to go to the other end of the bar to get it.  Fine, just tell me that and don't be an asshole about it.  Of course, from what I know about how long it takes to wrap a sandwich (like 5 seconds), I'm not going to realize it takes that long unless you tell me.", "author": "Alexandra M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-11", "description": "A really unique bar right near Smith St.  I didn't get any food, so I can only review on the drinks and atmosphere.  The beer and wine selection is reasonably priced and focused on quality over quantity (specifically that the offerings are local in nature).  You won't get a long beer list, but with the strong local selection on tap there really is no need for one.  The space itself does not feel like your typical bar (and I mean that in a good way).\n\nDefinitely worth checking out.", "author": "Jason M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-18", "description": "If you love beer and only beer and only draft beer at that, then this is the place for you. The place looks amazing, feels amazing and is amazing. Bartender was knowledgeable and very plant to talk to. Love love love it.", "author": "Marquis V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-06-25", "description": "Went here the other night and expected it to be all hipster-y, but was pleasantly surprised to show up and see a menagerie of BK types spanning from a middle aged dude in Adidas track pants and sneakers, to people that looked like they worked for some hip tech start-up, to a few girls that showed up dressed like the Kardashians in tight dresses.", "author": "Pedro S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-08", "description": "Not much else to add: great looking space with drink selection and noms to match, but it also can get both busy in a way that makes people look for snotty things to say about others in the bar and pricey by way of accumulation, one perhaps related to the other, nothing that would keep me from going back again though.  Best run-on sentence of a non-review ever.", "author": "Ben Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-16", "description": "Terrific place. Excellent customer service, fab space, great food \u0026 drinks.", "author": "Sabrina G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-30", "description": "I'm writing this review so that I can remember to come back to this place!  It just feels good at 61 local.  You don't feel like a bother, like you're being looked down on in any way, or like you don't belong here.  And I say this as someone with a baby.  You also don't feel like you could make a bad food or drink choice.  I hardly go out since I have a baby, but I could see coming here again (I would just make sure to sit in the back).  Tasty dishes, great beer, welcoming for all (but keep in mind that during the day you might run into some babies there if you hate that kind of thing), and good atmosphere.  They won me over!", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-15", "description": "win some points with your date and bring her here for wine pops.", "author": "Ellen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-06", "description": "Love this place.  The space is low-key and the attitude as well.  They always have a great selection of local beers and even better, local wines on tap.  Not a ton of eats, but a good selection given the lack of a full blown kitchen.  Always reliable for a chill time and a good drink.", "author": "C N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-26", "description": "really friendly staff and insisted that we tried the beers before we decided on one. loved it", "author": "Christopher S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-08", "description": "The knowledgeable and helpful staff really puts this place over the edge. The tall ceilings and awesome woodworking help too. If you ever see a ricotta toast on the menu, you have to order it.", "author": "Saba A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-05", "description": "Don't let the beer selection fool you. This is a Park Slope-style parents' bar, full of kids. I wouldn't mind the kids if it weren't for the judgement-prone parents, who frown at you when you behave as if you're not in their children's nursery. If you like beer, there are other bars with better beer selections that aren't also daycares.", "author": "Josie R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-21", "description": "I love nearly everything about this bar. The staff is friendly, the plates are yummy, the beer selection is decent and the design is awesome. This place remedies the problem that many bars in the neighborhood have: they're either too small or too impersonal. With the family-style seating you can chill with friends or cozy up to the folks at your table. The only reason it doesn't get five stars is that it's cash-only. Total bummer for someone like me who prefers to use credit/debit. Otherwise - great bar- definitely worth checking out.", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-19", "description": "Always an interesting beer and wine selection, only downfall is that there never seems to be ample seating, other than that a great addition to the neighborhood.", "author": "Lou B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-15", "description": "I like this place for coffee in the morning, nice atmosphere, and coffee. The staff could be more friendly, and less nonchalant.  That would make it 5 stars.", "author": "David W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-06", "description": "good beer, good snacks, rustic spacious intimate feel", "author": "Al F."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "61 Local", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "61 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/dIDd9QhrMDJrLaBbOPozhw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751150"}