{"aggregateRating": {"reviewCount": 304, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-21", "description": "Open bar area, like an indoor beer garden. The decor is far from gussied up with one long bar and huge a chalkboard of beers on draft to bring back to a handful of communal tables. I would go back again during prime hours to see how the crowd gets.", "author": "Eileen Anne F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-15", "description": "beautiful bright and airy space! i love the communal tables. 61 local is perfect for many things: getting work done, meeting up with friends, relaxing with one of their magazines, lunching, getting drinks.\n\nthe food is delicious and generous. and of course there is a great selection of beer.\n\nperfectly friendly staff. cash only.", "author": "Charlene C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-18", "description": "Good beers, good coffee, free wifi, nice open spaces, and great bar food. A good place to spend the late hours of the afternoon/ early evening before heading out for dinner.", "author": "Bek C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "Great atmosphere, excellent beer selection, and the food is very good.  They even promptly mailed me back my credit card after I had forgotten it there.  The absence of hard liquor is the only reason I'm not giving it 5 stars", "author": "R F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-26", "description": "Great ambiance and set up. Good beer choices and small plates and appetizer-type food.\n\nIt takes a really long time to get your food, though! There was only waiter and it turns out that you have to place your order at the bar so this isn't full-service waiter service.", "author": "C J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-20", "description": "Really beautiful nice new bar in the area. It represents a turning point in the neighborhood: hipsters have officially invaded South Brooklyn. They no longer have to hide out in Boat and Camp... they now have a wonderfully large new place to swarm. There's a good beer selection here, but the food selection looks iffy. I came here for a poetry reading for Stonecutter Journal. It was pretty cool and you should check it out.", "author": "Jason G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-15", "description": "I kinda experience my first racism here I believe. I came to sit and meet up with a friend so a waitress came by ask me if I'm ordering something and I said not at this time and they said oh in order to sit where I was sitting I have to. So I got up an order and the (Caucasian )woman next to me was approach and she wasn't drinking or eating anything and when she was ask the same question and was told no the girl so ok take your time. (I think the girl sense trouble and end up leaving). So I called the BBB on them so they going to investigate but I've never experience this in my life until coming here", "author": "Zane M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-22", "description": "I adore 61 Local. The airy, high ceilings and long picnic tables make it a great spot for group outings. The beers are delicious and affordable, the bartenders are friendly, and I love that they have kombucha on tap! And it's nice that they offer some snacks and sandwiches that are more substantial than your usual bar food. The ricotta with honey and crushed pistachios on toast? $6, big enough for two, and out of this world. I seriously dream about it. The grilled cheese with balsamic onions is pretty spectacular, too.", "author": "Ashley F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-29", "description": "Pure Brooklyn style. Local quality beers rotate on tap and if you can't decide they do flights. High ceiling and dim lights create an intimate atmosphere even in the large space. Can get noisy at night but definitely a default for me for drinks.", "author": "Dani S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-27", "description": "this is how a coffee shop should be! spacious. non-pretentious. and serves beer! \nthe highlight of my visit was BEER FLOAT! sounds gross right? because it's really hard to get the right combination of beer and the icecream flavor. but 61 float already solves this equation. it's ... some darker beer + vietnamese coffee icecream. and it was perfect. perfect. if i live close by, i would totally come here often and get my fix of coffee and alcohol. all in one place.", "author": "Te R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-09", "description": "This place has a lot of potential.  A few problems thus far: for beer people, there is little reason to really come here.  The selection, by BGH or Strong Place standards, leaves much to be desired.  As for the food, its just not at all interesting - if I want charcuterie and cheese I'll go to The Jake Walk, or better yet, buy some stuff at Stinky and go to BGH.  \n\nThat said, the space is nice - but needs more time to feel lived in.  The standing only tables are awkwardly low for the designated purpose; i.e. standing.\n\nIt feels like it's run by a bunch of friends with no experience, the extent of who's vision was to have a big open cavern of a space.  According to one review, the bartenders know much about beer - As a beer person, while it's nice when the staff is knowledgeable, I'd rather they actually had great beers than people who know about beer.", "author": "Rye W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-27", "description": "Grabbed drinks and bar food for my 30th here. Had a blast. Food was top notch and affordable. Beer selection was local and delicious. Also- beer was served at a superb temperature - a lost art these days.", "author": "Thadeus P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-22", "description": "I don't usually care for bars but I liked this place. Drinks were good. Bartenders were fun. And food, albeit limited, was good.", "author": "D Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "I didn't order any food, so this is a 4 star review based solely off the beer and the atmosphere. It's a huge space with old wooden tables, simple stools and a nice selection of beers. Apparently there's a time when the preferred beverage is coffee, as there are as many espresso machines as beer taps. Take your friends--there's plenty of space to sit, drink and have a chat.", "author": "Nathan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-02", "description": "stopped in for a brew and some cheese.  i was immediately taken by the large open space and exposed brick.  they were in the middle of installing some a/c units in time for the 4th.  i had the ramstein blonde hef and shared the hard cheese plate with a friend.  we both agreed we liked the bouche the best of the three cheeses.  the cheddar paired nicely with the apple slices and the ascutney was nutty.  the curried almond crunch was to die for.  they didn't have to go boxes, but they happily wrapped my cheese in some butcher paper.  i'll be back to sample the soft cheeses.  \n\nnote: cash only.", "author": "Sharlene C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-26", "description": "Love this place. Such a relaxed environment, great food, and good drinks. It's popular... and thus, can get crowded during expected times (Sat night, for example).", "author": "Mike P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-12", "description": "Nice and open with high ceilings and great beer. I had the Flower Power IPA and enjoyed it. My friends had a lot of pickles and salted meats.", "author": "Ben P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-10", "description": "I did not have food.  I did not try the coffee. Beer list was great and the atmosphere was amazing. Beer cafe is what they should have called the place.", "author": "Joshua S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-09", "description": "This is a solid 4-star place if there ever were one. I love the cafe-by-day, bar-by-night, and 61 Local does this dual personality seamlessly. \n\nThe space is dramatic with its high ceilings and fabulous woodwork. The bar is long and there are a lot of tables to sit at (mostly long communal tables, with a smattering of stools and smaller nooks). The beer selection is fantastic. The bartenders are knowledgeable and pleasant. The food is imaginative and tasty. This is starting to sound like a 5-star review...BUT...\n\nThere are a few things keeping this place from getting five stars: 1. It's cash only.  2. I'm not a huge fan of communal seating (this is obviously a more subjective point). 3. The size of the space makes for some funky acoustics when it gets crowded (though you can still hear people talk and it's preferable to eardrum-blasting music). 4. They close earlier than most bars in the area on weekends.\n\nWhoever you are, I'm pretty sure you can't regret going here, whether it's for coffee and a sandwich or a local beer and conversation. \n\nWorth noting: Of all the bars in the area, this one is more ideal for groups than most.", "author": "M M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-23", "description": "Great coffee shop/cafe to work in during the day. Space (albeit a bit dark) is spacious and the atmosphere is mellow. Folks who work there are lovely.The snacks are great and the teas and coffee are superb. Bonus is that there are free refills on the coffee! And free wifi! \n\nMy only complaint is that the store needs to get a better canister to dispose of used coffee grounds. Every 10 minutes there is this loud booming shriek-inducing sound of someone banging the METAL coffee measurer against the METAL bin that just bounces off the brick walls and down through the wood floors and up into my body. It's awful! Local 61 if you are reading this, can you please do something about it!!! Thanks from a loyal patron!!", "author": "Amy S."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "61 Local", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "61 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/dIDd9QhrMDJrLaBbOPozhw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751150"}