{"aggregateRating": {"reviewCount": 304, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-01", "description": "Checked in here for some New Years revelry. Attempted to order a beer float, got a small glass of chocolate stout with a quarter-sized medallion of ice cream floating at the top. Great beer, great ice cream, poor execution. I was impressed by the decor (and cleanliness!) vis-a-vis the reasonable prices.\n\nThey've got food, but nothing fried (c'mon man)... just toast. They've got wide open spaces, but not much seating. They've got a decent beer list, but nothing too exciting. I wouldn't go out of my way for this.", "author": "Mike H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-05", "description": "$6 for a craft espresso stout? $5 for an oatmeal lager? Yes, please. \n\nPerfect bar for a casual date. Great music at the right volume, friendly staff, impressive (affordable) beer list, chill lighting and decor. \n\nI will be back. Many times.", "author": "Tatiana K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-05", "description": "Love this place.  It's just around the corner from my apartment and quickly became my favorite neighborhood bar after I moved into the area.  Great rotating beer selection with lots of regional microbrews.  Really love the open concept of the place.  Picnic tables, brick walls, dim lighting, simple but good food.  Highly recommended.", "author": "Kelly D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-02", "description": "I was meeting a group here and quickly scanned the mixed reviews before going, so my expectations were tempered.\n\nAfter visiting, I can see how it engenders disparate emotions.  It's not really a restaurant destination, beer hall or wine venue.  However they do serve some limited food (cheese plates, etc - more assembled than cooked), and a dozen or so specialty beers and wines.  \n\nThere's a nice long bar, without bar stools, so you have to stand, lean or take a seat.  And all of the seating is at big, 10-person fancy picnic-like tables.   But when I say picnic, it's by no means cheap and flimsy.  Solid wood tables and long benches, in a very contemporary brick/wood space - like a huge, artsy loft.  You might have to share, or if your group is too big, you might have to split up (no chairs to add to the ends of the tables).  It's also a big space, so your table is your island.\n\nNo cocktails.  No plastic accepted - bring cash.  There are no games, TVs and I can't recall any music.  If you told me all of this ahead of time, I might have not gone.  That said, I had a really good time.\n\nWhy?  Somehow the simple design compels you to talk with and engage those next to and across from you.  Nobody is watching the game.  You aren't rubbing elbows with nearby tables... they are too far away.  The bar scene is no scene and your tablemates are not engaged with the latest Jay Z beat.  As such, you end up being more intimately focused with your grub, drink and fellow humans.  I had more interesting conversations in one night than I've had in weeks.\n\nSo I'm not quite sure how to classify 61 Local.   Not exactly a bar or food destination.  There are better places for beer or wine explorations.  But if you want a casual place to meet a small group of friends or have an informal date, this place seems designed for casual comfort.   In other words, if you want a beer and don't want a crowded, loud scene (but still be in a styling joint), this is your nirvana.", "author": "Jonathan E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-15", "description": "The staff's overall friendliness and service has improved so much over the past year and I am so glad. The attitude used to be the one thing keeping me away. Now I'm here many times a week and happily try different items on the menu. Thank you for hiring kind friendly people with good attitudes and keeping them.", "author": "Myrna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-10", "description": "Nice clean bar with grape Kombucha! My friend Kim and I rode our bikes to Park Slope/Carroll Gardens today and we had to make a stop here. The staff were super cool and they let us sample the different kinds of sodas and Kombucha. I really wanted to try the tart cherry one, but they were sold out. \nThe bathrooms were really clean and had a cute mirror with a rhinestone u on it to make it seem like a cheesey smiley face haha\n\nDidn't try the food, but I must come back herre! They are open during the day now too. That was definitely noted.", "author": "Jerrica J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-18", "description": "This bar has everything terrible going for it--it's a precious NY-state-only barn popular with the 1st-birthday-party set. And yet! I always find something interesting to drink here, and there's always a comfortable picnic table available. And those toddlers you're sharing the table with, they are pretty cute (and nattily dressed). I am always grateful for a public space in which to read a book and drink an excellent beer.", "author": "Pamela B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-05", "description": "YES. This is how it's done.  Fantastic beer, great layout (need to meet a variable number of people someplace where you can eat and drink and it won't be a bother if a dozen extras show up? This place is PERFECT for those nights).  \n\nI have no recollection of my sandwich (I had had too many delicious beers) but the folks with me said that it looked/smelled delicious.", "author": "meli l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-22", "description": "Love the ambiance, music, and beer selection.  Haven't tried the food yet, but the grilled cheese plate smelled amazing.", "author": "Austin A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-13", "description": "Beautiful atmosphere but ridiculously overpriced food \u0026 drink. People are retarded for buying a $15 cheese plate with enough food for 1/2 a person let alone to share among friends. Hipster cache somehow trumps good sense.", "author": "Matthew M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-30", "description": "Went here on a Saturday night with a group of friends at around 10pm.  It was really crowded and the women sitting next to us really wanted to have a turf war on our bench.  It was unpleasant.  The bartenders were also very unpleasant.  They underpoured my husbands drink and he called them out on it, and if they could have spit in his drink they would have.  It was a cool space, but the people seemed to suck.  Maybe it's gotten better with time...?  I don't think I'll be back to find out though.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-22", "description": "Great food, coffee and beer selection with locally sourced seasonal ingredients. Awesome staff, communal atmosphere and plenty of community events to get involved with, in addition to a beautiful rental venue.", "author": "Leslie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-22", "description": "I love this place!\n\nThough sometimes the baby population gets to be a bit much. Parents - don't let your kids crawl on the floor ... it is a bar at night.", "author": "Ms. C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-02", "description": "A bunch of us from work used this place as our office for a few days during Hurricane Sandy.  What a great find.  Awesome food, service and a wide selection of craft beers.   Atmosphere is terrific with high ceilings and open space.", "author": "jim s."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-31", "description": "When 61 Local opened, like many people I was taken aback by the bar as a welcome addition to the neighborhood - high ceilings, lots of light thanks to expansive sky lights, communal picnic tables, a nice rotating local beer selection, friendly staff (don't expect experienced bartenders, expect a girl who knows cupcakes and also pours beer) , and some decent food to munch on that was naturally over-priced.  It seemed like a great little quiet spot away from the Smith and Court St bars.  So I guess it isn't fair that I am largely basing my review of the bar on the people 61 Local attracts - the insufferable, numbskull, douchebag, first-time parents who take over 3 tables (tables people eat and drink off of) and transform them into a crib for their drooling, crawling, pooping babies.  61 Local has essentially become Home School Recess Bar.  I keep waiting for Zack Galifinakas to trip in the entrance or to find a map of Portland on the wall.  \n\nI have no problem with kids, or with parents who want to go out for a few drinks, but the rest of us shouldn't have to suffer as new parents get silly and parade their kids from table to table like it's an hors d'oeuvre platter.  Considering 61 Local's set-up and menu, this is the kind of Cobble Hillian that they are catering to.  Hopefully it means there will be a few more seats available outside at Abilene now.\n\nThat aside, the space does look awesome, but the beer portions are small and over-priced anyways - $7 for 12 ounces of LOCAL draft?  I probably couldn't afford more than a drink or two, but I usually want to leave half way through my first beer thanks to all of the crying parents.", "author": "Bob N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-23", "description": "The\nSneak peek\nHad a great\nSelection of\nBrooklyn beer and food steps away from Smith.", "author": "Justin L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-01", "description": "We stopped in here for a quick drink- very clean, and bright with lots of beer on tap, the cider I had was fantastic and fresh- but cash only always gets a star taken away.", "author": "Lauren G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-05", "description": "I'm reviewing this place so that I can remember to go back! They had some fun hibiscus soda when I went out with friends. I like everything about this bar.", "author": "Roxanne K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-07", "description": "Showed up here on a lovely monday night after having dinner elsewhere, this place is legit because the setting itself is alluring, getting drawn in, ofcourse I was completely impressed by the rotating drafts as well as the open kitchen right at the bar. Love the hand sewn lamps, the paper napkin signs on the bathrooms and Love Love Love Jared, the bartender, super cool and chill, he definitely made our night with his silly humor and knowledge of beer. Thanks Jared, this one's for you :)", "author": "Crisy N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "Great bar with excellent beers and wine on tap. Also they have incredible salads, seriously check them out. Then why, do you say the four stars? No happy hour! That's all the bar needs to take it over the top.", "author": "Matt D."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "61 Local", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "61 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/dIDd9QhrMDJrLaBbOPozhw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751150"}