{"aggregateRating": {"reviewCount": 304, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-15", "description": "I personally:\nDon't care about wine;\nDon't care about beer (I don't even drink it);\nDo care a great deal about coffee;\nDo care a great deal about pastry and sandwiches. \n\nIn that sense, the pastries served (tried all of them today, they don't list them in their menus) are out of this world. They are wholesome, just sweet enough, perfectly baked and incredibly tasty. Whoever came up with the recipe of the Honey Ricotta Toast and the Smokehouse Toast (I heard it was their chef) should be awarded something. The coffee ($4 for a huge french press) was bold and semi-acidic, didn't even care to ask what the blend was - I will just go again and drink it again.\n\nI did a mid-Sunday snack attack and the place was quite solitary; a few couples, nice music, beautiful atmosphere. I definitely recommend this place for an after-brunch visit after a nice walk around the neighborhood.", "author": "I.C. O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-18", "description": "Came here to check out the place with my boyfriend. The space and decor is very cool - very dark, lots of brick, the details are cute. Very large ceilings. Tons of space. Few large tables (feels like a biergarten).\n\nI was hungry so I ordered the meat plate which consisted of bread, spicy mustard, pickles, pate, and 2 other cured meats. It was pretty good, except I would've liked the bread warmer and the pate was very hard which made it difficult to spread. The plate was one of the more expensive items on the menu ($14) which is a bit overpriced for items you can just pick up at a grocery store. My boyfriend ordered a mozarella sandwich which looked just okay.\n\nWhat I didn't like is that the kitchen is right at the bar - I saw that my water came directly from the tap (I don't mind drinking water from the tap but I don't need to see the sink that you get it from). And I didn't like seeing the bartender make my boyfriend's sandwich (and that the mozarella sauce was poured from a huge container of sauce he got from the fridge).\n\nNext time I will sample a few beers (the guy seemed to be able to make a good recommendation when the beer my boyfriend originally wanted was out of stock) instead of coming with an empty stomach!", "author": "Siv L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "Great, laid back bar. The high ceilings, rustic decor and sparse seating makes this place seem huge! The lights are kept low to keep things intimate and the bartenders friendly to make your wooing more successful.\n\nDoc's Cider for me, craft beers for you. \n\nCash only.", "author": "Julia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-19", "description": "I didn't have the greatest of expectations when I learned that we were having a friend's surprise birthday party at a bar, but when I walked in I was delighted by the cavernous yet intimate space, the minimalist decor, and the friendly ambiance.  Scattered around the place were patrons reading by candlelight, a young family enjoying dinner, and even a professor making her way down a stack of final exams.  Granted that it was a Sunday night, but this was such an appealing, low-key atmosphere that I'm sure I'll be back again.  To top it all off, the bartenders were friendly--and even brought over three free desserts for the birthday girl without anyone asking--and the food was amazing.  I didn't get a chance to try the lauded grilled cheese sandwiches, but the Veg Out and Capricious Bruschetta were amazing.  \n\nIf you're looking for an old school bar vibe or any type of deep fried food (the closest the helpful bartenders could approximate my beloved cheese fries was buttered toast), I'd suggest trying elsewhere.  But if you're in the mood to something different, I highly recommend 61 Local.", "author": "Iris H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-22", "description": "An ideal bar. Such a gem in the neighborhood. It seems like every new parent in the area flocks to Local 61 for some kind of adult connection and just to get out even in the rain and snow. Plus there is so much room, little junior can sleep in the stroller while daddy chugs a few beers. Mommies will like the selection of beers and cider, plus little snacks. So just warning you, if you're without child, coming here in the late afternoon, you will have to maneuver around stroller city. But that is why I like it here. Plus, something about the white noise in the room, baby passes out instantly. Bonus.", "author": "Kitty B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-07", "description": "Great beer, great prices.  Very clean yet cozy space - I love it here!  They have beers other places don't have like Ithaca Flower Power.", "author": "Jen K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-11", "description": "Yay for a fun, new, reasonably-priced neighborhood bar that brews their own beer! Everything is on tap, so everything tastes delicious.  I hear the wine on tap is out of this world, but I've only tasted the beers.  My favorite has to be the flower power beer, a light brew with a sweet kick to it.  \n\nThe limited food menu is awesome as well -- we split the hard cheese plate and the chicken liver pate, which came with 4 or 6 house crostini crackers and these spicy pickles that I could've eaten an entire jar of.  \n\nThe ambiance is cute and minimalist.  It's like a long hallway with 6 or 8 long picni-esque tables, which make it a great spot for group.  I also dig the exposed brick.  Ian, the owner/main beer connoisseur was very friendly and knowledgeable. \n\nCan't wait to come back!", "author": "Jenny W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-13", "description": "This place is fantastic.  I love the events that come through (poetry! plays!), I love the menu (yum, the vegan walnut \"foie gras\" on whole wheat bread), the beers, the kombucha, the Brooklyn Soda Co.  Seriously, the beer selection here is fantastic and has so many interesting choices.  Love this bar/venue/place to grab a bite.", "author": "David W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-02-22", "description": "Chill place to get drinks with friends or even a date.  Dark, intimate lighting, cheap drinks, lots of hipster-esque peeps.  Docs hard cider on tap my fave :)", "author": "Amelia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-09", "description": "The place is amazing, the food and the beers are  delicious. Unfortunately, the server is a cad, extreme rude. It's the 3rd time that he gives hard time to my friends or myself, rolling his eyes if we ask for a coffee, being rude on the fact we have a stroller and that it's not Tuesday ( mothers' day). I hope that he could have a attitude as cool as the place because this is the only thing that makes me put only 3 stars", "author": "mylene a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-21", "description": "Im so excited about this place! how cool...everything they have is local or at least ny produced....\ni had a great sauv blanc and delicious chicken liver mousse on local bread with local pickles....amazing all of it and at a ridiculously great price for such particular ingredients..$5 bucks for like 4 good sized crostini..\n\nthe jasmine kambucha on tap was out of this world good. ive never had a more mellow and friendly tasting kambucha.\n\nall drinks are on tap including wine..which means you will virtually never get a old opened a day ago taste with the wine here.. they have locally brewed soda pop, i tried the apple ginger which was amazing.\n\nthis place has so much potential and is serving such a great cause supporting local artist and food/bev producers...its like a farmers market at night you can chill out too. \n\ngreat ambience so far...could be cooler with rotating art etc...\nlove the big glass lanterns throughout the place\n\n I do have some suggestions...\n\nbeing a bartender and foodie and artist i think..you could.....\n\nhave amazing rotating art shows in there which decorate and draw attention to the place....\n\nhave a you pick cheese and meat/veg type deal on the menu with small and large plate options so people can easily and comfortably try all the things they want at the quantity they can afford...\n\ncould have an amazing cocktail program in the future using locally grown fruits for syrups and purees...and hopefully locally brewed liquor.\n\nid love to get involved with this place and will definately be back..", "author": "jen d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "Great place for relaxing brunch. Very cool but not overly crowded. Food is delicious (had avocado toast and fisherman's cure), staff is friendly, and vibe is chill. I'd definitely go again.", "author": "Carlos M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "I went into this place for the first time the other day. I just moved to the neighborhood and was looking for a nice place to relax and work for an hour. The guys working behind the bar were really friendly and the kombucha on tap was so good. It's awesome to find a place where you can sit and hang out without having to spend a lot of money, but that still has good quality food and drink for sale!", "author": "Katie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-29", "description": "61 Local is a wonderful spot to grab a coffee (I had a wonderfully done flat white) and seems to accommodate laptop mavens and newly minted moms in equal measure during the day. The ambiance is industrial with soaring high ceilings, bare wood panelling and muted lighting so it's equally suitable for daytime coffee or evening (beer and wine) drinks. The downsides were a limited menu (mostly sandwiches) and no happy hour", "author": "Bernie Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-02", "description": "great beers on tap - and a plentiful list to choose from. \ni have frequented 61 local as part of a \"mom meet up group\" in the afternoon (beware of the stroller mafia people!) and have gone with friends and coworkers past the bedtimes of children for more adult setting and environment.\nthe communal tables make this a great group get together spot.\nsimple plates for noshing (cheese plate, sandwiches).", "author": "Maia D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-27", "description": "I really wish that we could give half stars, because I'm torn between 3 and 4.\n\nOn the one hand, the beer was cold, tasty, and very reasonably priced. \nOn the other hand, the food was (mostly) good but nothing special. The chicken liver was an exception (in that it was delish), but most of the other small plates we tried were just OK.\n\nAlso, is there a rule that says that the word \"dust\" must be used multiple times? Really? IT IS OK to just call crumbled up pistachios, crumbled up pistachios. Especially when they're going on top of an otherwise ho-hum ricotta concoction. Which honestly, is kind of a sad use of the fresh local ricotta they're using from Salvatore Ricotta. \n\nThe boy was also seriously aggravated by the seating to people ratio. It seems like a weird/bad use of space. \n\nBasically, this has turned into a rather grumpy sounding review of a pretty good place to grab a beer. Just not 4 stars good...", "author": "Saskia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-13", "description": "Two enthusiastic thumbs up.  Awesome beer hall type spot that fits in perfectly with the nabe.  The map on the wall behind the bar is super cool and the bartenders were friendly, knowledgeable, and had great recommendations.  Was crowded but not overwhelmingly so for a Saturday night.  \n\nMy only complaint?  They need another table or two.  There is an entire waste of open space in the back that makes no sense.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-06", "description": "Something about 61 Local that keeps us coming back.  Although it's always packed and cash only, I love how they're constantly rotating beers.  And their ricotta toast is the perfect snack after a couple drinks.  Yay!  I really am a fan.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "I thought the atmosphere was nice. The beer selection is very good, but the price was a little much. They do hold local brewer meetings which I think is great.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-10", "description": "Cool spot to get some work done in a place other than starbucks! Good food and delicious kombucha on tap. The internet was a little sluggish, but I believe that was a one-time occurrence and issue with their provider. Nice spot!", "author": "Tora T."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "61 Local", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "61 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/dIDd9QhrMDJrLaBbOPozhw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751150"}