{"aggregateRating": {"reviewCount": 304, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-27", "description": "I'm in love, I'm in love and I don't care who knows it!\n\nSeriously though I'm in love with this place. I've been eyeing it for a while (it's located just off of the Bergen subway stop on the F line) - the window are always open and there's a buzz coming from inside that carries to the street. I always thought this was just a coffee shop that also had beer based on signs I'd seen but, turns out, they have a seriously amazing brunch menu and some of the best food I've had in Cobble Hill and, just maybe, Brooklyn in general.\n\nMy boyfriend and I stopped in for brunch around 2pm on Sunday and there was a decent crowd but still a number of seats available. There are probably 8 seats at the main bar, lots of big, communal type tables throughout, and a couple walls that had bars and stools lining them as well. We were pretty confused when we first walked in as no one really greets you, but we just went straight to the bar and asked how it worked, and the waitress told us we order at the bar then find a seat.\n\nWe ordered the biscuits and hot honey, southern grits bowl and truffle grilled cheese. Carbs, carbs, carbs, and also the best decision I've maybe ever made. Literally I can't tell you enough how amazing each dish was. The biscuits are house made, cooked just right so that they have a nice crisp outside but a just-doughy-enough inside, paired with butter and actually spicy honey. Then the grits. Wow. I'm from the south and have grown up on grits so am always a little skeptical, but these were ten times better than I imagined they would be. They were cheesy, thick, not grainy, and just the right mix of flavors (they come with an egg, kale, tomatoes, chicken sausage and buffalo sauce). The buffalo sauce added a really nice kick. And the grilled cheese. Also wow. It's made with raclette cheese and truffle butter, then pressed on a panini press. So freaking good. I would've loved more cheese but, honestly, who wouldn't?\n\nThey have quite a few local beers on tap as well and the waitress was awesome at letting us try a couple (we didn't even have to ask!). I cannot wait to come back here for dinner and to just grab a beer in the afternoon.\n\nMy new favorite spot in the city.", "author": "Kaley R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "We had our day after wedding Brunch at 61 Local. We worked with Marissa who helped us determine what we needed in terms of food and beverages. They let us come in early and add some décor. The staff was amazing. We came in tired and low energy from a weekend of drinking and dancing and staying out late. The staff was warm, accommodating, and understanding. The food was beautiful and delicious. The quiche was out of this world! The kale salad a nice counterpoint to the rich decadence of the quiche. It was reasonably priced and was just perfect for what we were doing. We highly recommend having your event there!!", "author": "Madison C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-21", "description": "This bar's got great space. It's got a huge lower area with wide picnic benches and lots of seating, and the bar has a good selection of draft beers. They serve nibbles like cheese and hummus as well.\n\nThe place really shines as a venue though. They have an upstairs area that's perfect for meetups. Brooklyn.js does their meetups here regularly, charging a cover but giving out drink tickets to make it worth the bar's while. It seems to be a common practice, as the walls in the back are plastered with flyers from other events that they host.\n\nIt's conveniently located off the Bergen St FG in Boerum Hill right off of Smith St, so it also makes a good after-dinner drinks spot if you're checking out the restaurant scene on Smith and aren't in the mood for cocktails at Clover Club or wine at Pane e Vino.", "author": "William J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-03", "description": "Love this space for getting a beer or doing work on a weekend. Lots of light in the daytime and cozy at night. They restrict usage of laptops during brunch time on the weekend, which is understandable.", "author": "Annie Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-07", "description": "Was a little confusing walking in here. No hostess or staff to greet you and direct you to the seat.  We were just a little lost and nobody was paying any attention to us.  We were about to leave but we saw a staff member walked by so we asked him how it works here and he said we order at the bar and then they will bring us the food.  After ordering the food took awhile to come.  We were getting a little disappointed with how the dining experience started with the confusion in the beginning and food taking almost 30 minutes to be prepared.\n\nWe tried their chicken and biscuit, quiche, and ricotta, artichoke, and olive focaccia.  The quiche was interesting but a little on the cheesy side.  The focaccia was a little on the cheesy side as well but was tasty and fresh.  The best dish of the night was the chicken and biscuit.  The chicken was a rotisserie style chicken and was moist.  The meat was falling off the bones and flavorful.  The red pepper sauce made the chicken tasted even better.  The biscuit was pretty good also with a slight honey flavor.\n\nOverall, the food is pretty solid.  Would definitely come back to try more of their food.  Was a little disappointed in how the night started but the food made up for it.  Hopefully the food comes out quicker next time", "author": "Jason L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-15", "description": "Reposting this from my google maps review since I haven't yet heard from anyone. \n\nI visited and posted on 5/19/18:\n\nThe restaurant has an open, airy decor with plenty of space between communal tables, which I loved! The service, however, left much to be desired. I stepped away from my reserved table and went to the bar to order a drink. I ended up waiting for over ten minutes before being able to give my order, and watched three others get served before me - including a man who walked up to the bar after I did. I essentially had to ask for someone to help me place my order before being told offhandedly that the bartender would take my order. I can't be certain what was going on, but multiple people were working the bar at that time, including two or three active bartenders. Quite a few people behind the bar walked past me as I waited, with no one acknowledging I was there....and I'm the only person who looked like me that was standing at the bar at that time. \n\nMy friend - who was celebrating her birthday - frequents this spot and loves their food and the concept. It was my first time attending, and I'm very disheartened that this was my experience. I didn't feel like it was the type of place I could give honest feedback about my experience, and did not feel comfortable until I left. I won't be coming back. \n\nRated as a two because I'm not sure why such a serious slip of customer service could happen with so many people at the bar at that time. The redeeming quality was that the bartender who came to serve me adjusted the price of my drink due to missing ingredients.\n\nMy review link: https://goo.gl/maps/m7CiUeaU7Er", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-25", "description": "I chill place to hang with friends or work on your laptop. I really enjoyed the truffle grilled cheese w/ tomato pesto soup. Also their tomato,pesto, feta cheese melts in your mouth delicious! The salad was great and side order of chicken garlic sausage too! They have a variety of beers and wines. The only oddity was they shut down their espresso machine at 4pm?? I find that if your calling yourself a cafe why would you not have an option in the evening for a cappuccino too?? Bizarre!", "author": "DW W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "Just had my daughters baby shower here in their 2nd floor private room. Wonderful space that fit 45 people at a sit down brunch buffet.  We were allowed to set up and decorate 1 hr before the party which gave us plenty of time though admittedly I had my sisters and family with me and I knew exactly what I wanted to do. Marissa, the event coordinator was fantastic and available with any requests or questions. This shower became unusual because my daughter had given birth just 4 days before...5 weeks early! Then the baby had jaundice and was admitted into the ER hours before the party which meant none of the guests of honor were going to be there!  So much drama! But the show must go on and everything worked out! Food was delicious and Marissa and staff replenished as needed. They packed up the leftovers for my daughter! Everyone had a great time!", "author": "Esther W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "My new favorite coffee house, the feel of the place is so relaxed, it's communal seating so get ready to share your table with a total stranger (this is part of the charm) I've been wanting to check this place out for a while just a few blocks from my place and they have avocado toast...what's not to love! \nThe staff is chill and super nice, the space is open and airy...and the prices (I've never paid so little for brunch). My laundry place is across the street, this will be my new hang out while I wait for my driers to stop.", "author": "yolanda c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "This place has a calming ambiance,  spacious and nicely dim lighting. They had my favorite sour beer on tap, Mikkeller raspberry blush-  which scored them a lot of points. My two friends and I ordered the spinach dip, buffalo cauliflower, and truffle grilled cheese. All of these dishes had distinctive flavors integrated in every bite. I would go back for sure, preferably for brunch.", "author": "MissHelen _."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-02-20", "description": "The space is nice, but I was expecting something different. Kinda more of a coffee house feel than a restaurant or bar. All orders at the bar, bus your own table. Everyone in the place had their head buried in a laptop. If that's your thing this is your place.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-14", "description": "Excellent service, sweet and polite personnel. Perfect coffee always. Great bites for breakfast and lunch. Ambiance, music, all well balanced. Opens very early which is great before work starts....will keep on coming here.", "author": "Maria K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-20", "description": "I am a retired computer scientist from UC Berkeley. \n\nThis place is extremely anti-laptop. They have all sorts of weird rules, like no laptops at the bar itself, but you can use it at a table unless it's on a Sunday during brunch. What the actual f%^\u0026*??\n\nNo hard liquor at all. Just beer and wine. \n\nMy girlfriend did get a breakfast burrito from their extremely limited menu that has no meat on it - not even poultry.\n\nShe described it as a hipster coffee shop that's full of themselves.\n\nWe escaped from this place to go to O'Keefe's about a mile away where we felt much more comfortable and relaxed, and they did not mind our laptops at all..", "author": "John B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-01", "description": "Large space, high ceilings but none the less very cozy. It's quite inviting; the environment is warm, light wood walls, ample coat hangers, and a diverse crowd engaged in conversation. It's a great place to find refuge on a cold night if you're looking for a little bit of energy.\nPlus, they're big fans of the Brooklyn community, which is always nice too see. They appreciate what's close to home, including making their own ginger ale in house. I wasn't imbibing that night and had to resist their ample list of beers, but I got said ginger ale and was blown away. I'll go back just for that", "author": "Will H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-15", "description": "Went there last night and was super disappointed 61 Local's Tuesday Comedy Open Mic, Moon Babies, isn't happening any more. It's an old story, because Comedy Open Mics don't really bring in any money, even if they bring in a ton of comedians. Another problem is hosting, as hosts don't get paid for what turns into a 4-hour shift. The original hosts passed the baton onto some replacement hosts, and I lost track after that. \n\nFor a while there, I was a steady customer on Tuesdays for their open mic. Their Helles Lager is 5 dollars all of the time, which was great, although after a bit I had to pee if I had too much to drink. I haven't seen any liquor here, so that might have been a culprit. Why not find an ultra niche off beer that's similar to Helles and give out a large for $4? You could get Utica Club from Upstate New York for about that much, it would taste like swill for a cheap price. \n\nI've been to other great shows in their upstairs, and just like my review of Fawkner's, which is a neighborhood Bro bar also off of the Bergen Street subway stop off of Smith Street, 61 Local basks in the hugeness of Brooklyn -- that you have a ton of space that is mostly impossible in Manhattan. 61 Local is a great space for doing work, because you can spread out on the picnic tables. There's been more than a few times when I was waiting for the open mic that I worked at the tables. \n\n61 Local in addition to entertainment in their upstairs, and I guess a \"local\" service to customers as a neighborhood bar, often has a couple of tables for local farmers in their downstairs, in a miniature farmer's market. This is obviously hipster-yuppy and for the now 40-year-olds who live here, but I was always charmed by this table. \n\nCheers to 61 Local and I hope you guys have many continued years of success.", "author": "Gordon E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-03", "description": "The space is great; unfortunately the people are not. The service is shockingly horrible.\n\nSpace: it's a really open space with plenty of bench tables. If you need to get some work done and don't mind popping in some headphones, this is the place to go!  They don't have a great AC system, so I'd avoid on a hot day.\n\nFood: Generally small portions (even the large plates) so don't expect to leave stuffed. This is the type of place where you go for drinks and maybe some bites. If you choose to dine here, the chicken and biscuits are good.  I'd avoid the tacos: for $12, you get three meager, bite sized tacos.\n\nDrinks: they have a wide selection of great beers for great prices.", "author": "Brandon P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-10", "description": "Our company recently had an event here in the private space. It went incredibly well and the staff, Marissa, especially, were really helpful to making sure it went smoothly. She was in frequent contact before the event, answered all my questions, and helped with choosing food and drinks for the number of people we had. Would highly recommend them!", "author": "Lauren C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "My husband and I just had our wedding here, and we could not be happier with how it all came out. The staff were really wonderful - caring, kind, and attentive the entire day. Before the wedding we primarily worked with Sarah on the planning side, and she always got back to us promptly and always had helpful information. She even pointed out that we had over-ordered at first and suggested we pare back a bit to save money - and she was totally correct. We loved working with her! The staff on the day of were great, as well; everything ran smoothly, for which I was very grateful.\n\nThe food was fantastic; we got rave reviews from our guests (the Reuben sliders, quiche and avocado toast were all especially great, but really, it was all delicious). We used their private party room, and they gave us some time to get in early and put up a few simple decorations. There was a small snafu with the number of chairs for guests, but the excellent staff scrambled and were able to help us find and set up a few more quickly -\n our guests never knew there was an issue. The venue folks were also really flexible about giving us time to tear down, which we appreciated given how much we had on our plates that day.\n\nOverall, I was incredibly happy with how things turned out. 10/10 would hold a large event there again.", "author": "Luciana L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-12", "description": "We have been wanting to try this place after walking by numerous times. It seemed like an interesting concept as we walked in and saw a sign that told us to sit anywhere and order at the bar. First, we ordered the Syrah and a lemonade to drink and the curried squash soup and cheese board to eat. The soup was delicious, and the cheese board was a 2.5/5- for $19, I expected the cheese to be of higher quality and have more more flavor. Then, we ordered the chicken and biscuits to share and this is where our meal went south. The dish was placed in front of us and we sat there for a second without silverware or share plates thinking maybe someone would come back. So my GF goes up to the bar and asks for \"share plates and silverware\". We get one set of silverware.... so I go back and ask for another. At first, I appreciated the low key concept of ordering at the bar but at this point, we were annoyed. At least keep the silverware and water accesible for me to get myself if it's not part of anyone's job to make sure we have it....  anyway- the chicken and biscuits was so salty, like random crystals of salt or something in there. Not sure if we'll come back for food, but it might be good in the future for a drink.", "author": "Diana S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "I've now come here twice: once to zone in over lunch and then for Sunday brunch. I love the high ceilings and the large sun roof brings in natural light. It's a good place for laptop time and writing a novel. \n\nWhat I had: \n\nthe Chicken \u0026 Biscuits. Wow. What more can I say? It's easily the smoothest chicken I've had in New York. They slow roast that thing for hours, cook it some more and then blowtorch it for the finishing crisp. The biscuits hidden underneath it are well made and flavorful. Get this.\n\nThe Brooklyn breakfast sandwich: a lot on it for $8. Real solid.", "author": "Safi A."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "61 Local", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "61 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/dIDd9QhrMDJrLaBbOPozhw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751150"}