{"aggregateRating": {"reviewCount": 304, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-17", "description": "Great pub and atmosphere (lots of space), with excellent beer too! Bartenders are probably a little too hip for their own good though.\n\nDefinitely going back.", "author": "F. A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-19", "description": "No table service and still - so expensive. Why does a mediocre carafe of rose cost $45?!?!  Come on... If we have to get our drinks at the bar on our own at least price them fairly.", "author": "Yoni H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-18", "description": "I was here for an engagement event and stayed afterwards to finish my beer. It's a nice venue and wasn't crowded. I didn't appreciate the 2 guys on staff interrupting me, ten minutes after I approached/introduced myself to 2 beautiful women, to indicatively give attitude and belittle me in front of others. The staffer asked if I was outside carding people, which I did to tease one individual that looked very young, but I immediately said \"I'm kidding, I'm too small to be a bouncer\". He wasn't interested in my clarification and gave a lot of attitude, despite my honest demeanor. You simply don't talk to guest that way unless you want them to feel unwelcomed or like a pariah.", "author": "Sammy G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-27", "description": "61 Local is a rare balance of trendy and homey. The high ceilings create a sense of openness and the brick walls create a sense of warmth. The food is prepared with fresh ingredients and never disappoints. Their take on the avocado toast fad is the best around (and there's plenty to be had in Brooklyn). The staff is always friendly and efficient. I am a teacher, so spending my summer afternoons here will be missed come Fall. The food is a bit on the pricey side, but it's still five stars for me.", "author": "Tommy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-05", "description": "This was amazing, mostly because several impromptu cartwheels of varying quality happened and was cheered on in the party room upstairs before the birthday girl's friend slid down the last few steps, landed on her butt, dropped the remaining birthday cake and then was handed a HUGE and intact bag of ice by the bartender to help with the injury.\n\nAs for the actual place, I was there for a friend-of-a-friend's 30th birthday party (hi, Julia!). The place is huge and there's even more space upstairs for private events/parties. The venue supplied a cheese/fruit plate with crackers and a whole other set of snacks that I now forget. The host was given a set of tickets to hand out to party guests (I guess this is the happy medium between open bar and cash bar...?). Downstairs is a lot of space at the bar that's further supplemented by several tables around the periphery and towards the back. I didn't even get as far as looking through the menu that carefully but I love this place so much already that I'll definitely coming back.", "author": "Steve L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-22", "description": "Cool space, great beers, espresso and iced coffee. Service friendly but spotty. Good grub, avocado toast, salads, pretzels etc...", "author": "David D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-16", "description": "Surprisingly chic and spacious. I love places with hooks underneath the bar, it just goes to show how considerate they about about the hoarding human behavior. If you ever try their homebrews, it is flavorfully stout, especially the oatmeal stout. I wasn't really craving alcohol too much that day, so I got their apple ginger soda on draft. It tasted so refreshing, except for the icky ginger taste (I don't like ginger).\n\nBut wow. Draft soda. I feel so hardcore. Like a Sim at the drink bar. Dude.", "author": "Lesie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-19", "description": "This place has a very prominent hispter vibe which is a little more unusual for the Cobble Hill area. The restaurant has an industrial vibe with hugely tall ceilings. They have a small lunch and brunch menu with very tasty items. I got the truffle grilled cheese and tomato soup and my friend got the mac and cheese and my other friend got the reuben. The grilled cheese was amazing! Great flavor with the cheese and the caramelized onions with a hint of truffle oil. The soup was quite delicious as well. The mac and cheese was rich a creamy and delicious. I did not try the reuben but my friend was it was amazing. During the week this place gets packed with people who do work on their computers during the day. Prices are pretty comparable to most places in the area. They also have an event space upstairs. Scheduled throughout the month, they have live music and other events. I can't wait to come back and try the brunch!", "author": "Joanna V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-20", "description": "Great place to chill and work or have a casual meeting. The space is really nice, plenty of power outlets and people seem to be respectful of keeping the volume down. There is a great selection of coffee, snacks, wine and beer so it can be a go-to any time of day.\n\nStaff is friendly and helpful - and fun. Skip Starbucks and get something good over here.", "author": "Ben K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-25", "description": "Workspace by day, beer \u0026 wine pub by night.\n\nThis place is a spacious venue with long communal tables, upstairs, and often hosts events.\n\nDuring the day many are here with their laptops working/studying with a cup of coffee. This place has great latte art, pastries, and sandwiches.\n\nAt night, this place turns into a beer \u0026 wine hall. Don't come here looking for shots.\n\n\nFREE WIFI\n\nCASH ONLY / $20 minimum", "author": "Katrina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-26", "description": "Great space, great coffee. Came in to answer some emails and get a start to the day while tagging along with my boyfriend at work. Walked in and everyone was in front of their computer screens working while enjoying a little breakfast, and it's an awesome space to do both. In addition, there's an event space, which I'd love to learn a little more about. \n\nThe menu is cute and larger than I expected - everything from a ham \u0026 Brie croissant (which we shared and was delicious) to full fledged sandwiches that looked great. In addition to coffee and a nice selection of herbal teas and not chocolates, they also serve wine \u0026 beer. \n\nWe sat and sipped on our coffee for over an hour and no one bothered us once. Very cool and laid back. I'd love to come back and stop in for lunch one day soon!", "author": "Katie H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "I'm both glad and concerned 61 Local exists in Cobble Hill. On the one hand it's a fun addition to the already incredible bar/cafe scene. On the other hand, it's a bit too hipster-y/Williamsburg-y for the neighborhood. If you live in Cobble Hill, which is more mature than Williamsburg, you know what I mean. \n\nAnyway! I've been a few times for drinks and while I appreciate the whole drink-and-eat-local craze, the bartenders are a bit pretentious about it. And if you're craving a cocktail, as my company was, keep in mind 61 Local does not have a full bar. \n\nThe bar munchies are super yummy though. I definitely recommend the beef jerky.\n\nIt's also worth noting 61 Local doubles as a cafe for reading and studying during the day. It's one of those few places where you'll find 20-somethings, young parents, and their kids all having a good time.\n\nFor what it seeks to accomplish, 61 Local is doing a solid job. But I'd rather get my wine-fix somewhere a bit more classic.", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-08", "description": "I've had Manhattanites tell me beer is for Brooklynites.\n\nAnd however you may personally interpret this potentially loaded statement, 61 Local would certainly smile and simply take this as a compliment.\n\nWith both beer and Brooklyn pride on full display, behind the bar is a giant chalkboard in the shape of Kings County, the names of almost-exclusively New York brews available on tap scrawled across every inch. Surrounding this huge block of BK wall art are outlined neighboring regions and states, disproportionately smaller than the featured borough front and center. Yes, even Manhattan - appearing here no bigger than the size of Coney Island.\n\nFrom Sixpoint to Southampton, Ithaca to Ommegang, 61 Local's got you covered with Empire State favorites, all pints at a pour of no more than $8 (bring your bills, it's cash only). New York State wines are also available, as are local specialty sodas and coffees for the non-drinking crowd. And yes, that's most definitely a Beer Float on the menu - Ommegang Abbey Ale (a delicious and recommended selection all its own) topped with Steve's vanilla bean ice cream.\n\nA series of sandwiches, sweet and salty snacks, and cheese plates are served as well, making this a truly well-rounded beer-lovers' experience. I ordered The Mozzilla Grilled Cheese (DiBruno's fresh mozzarella and pesto on focaccia), a $6 sandwich sliced into three pieces, best enjoyed when dipped into the ramekin of tomato sauce with which it's served. For such a simple selection, mind you, expect to wait a while for food, as it naturally plays second fiddle to fillin' pints and kickin' kegs.\n\nThe high ceilings, exposed brick, picnic table seating, and water-cooler light fixtures (not to mention, the thirty-second walk from the Bergen St. subway station) allow for a very convenient, comfortable communal drinking environment, much-appreciated breathing room not exactly easy to come by around these parts. Sure, beer may be for Brooklynites, but if so, it can beat running into hammered hussies bouncing around crowded Manhattan clubs spilling cocktails on their own stilettos. And don't get me wrong, there are nights for such hussies. But with that not always on the agenda, 61 Local can be just the right speed.", "author": "Dan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-10", "description": "Low key place to grab a drink or catch up with friends.  Been here on a first date and it was the perfect atmosphere for that.  Would definitely come back.  good stuff", "author": "Brian S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-02", "description": "Let me start by saying, I like this place.  But, it could do better by easy fixes.  That is why I am posting this.\n\nThe last time I visited, I waited a really long time to order my beer -- like almost ten minutes.  I noticed that other people had a similar problem.\n\nThe culprit?  Inexperience on the part of the bartenders.\n\nOn a busy shift with two bartenders, the trick is to split the bar and never cross the line.  What I mean is that the bartenders decide where the border is and never cross that line in the sand (or the non-slip mats, to be more accurate).\n\nWhat happened at 61 local was that the two bartenders focused on the customers at the middle of the bar and disregarded those on the periphery.  This caused the customers to mass in the middle of the bar = no good.\n\nThe key to good bartending is to always know the order people arrive at the bar to order and take their orders in that . . . well . . . order.  While taking an order, you look around to see if anyone else is also looking to place an order.  You make a mental note of those people while serving your current customer.  If people start to line up behind the customer you are assisting, you don't take their order if customers in your periphery were there first.\n\nThe lesson to take away is not to create a single location on you bar where the customers believe you will give a preference.  That creates a back-log, frustrations, and lower tips -- which is  a lose-lose for all parties involved.\n\nSo, I say visit this place.  They have great beers and great food.  But I advise the owners and employees to work on their service skills.  It will result in a truly great location.", "author": "Ed W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-05", "description": "61 Local is what I see in my mind's eye when I wish for an intimate, casual conversation bar with tasty food. \n\nThe space is far more open and expansive than you would guess from the street, and its soaring ceilings and many tables offer room for you and any number of friends. \n\nThere's not much lighting besides a few candles on each long table, so it does have a very intimate feel. Also the acoustics are such that you are free to have a personal conversation without the fear of being overheard, yet it's not too loud to talk to your companions. \n\nThe beer selection is outstanding and is reasonably priced--$5 or $6 for 12 oz, $6 or $7 for a pint, depending on the beer. \n\nMy friend and I got the chili and loved its full, smoky flavor, as well as the accompanying crusty bread. The $10 price tag was a little steep, and it was more like soup than chili, but it was delicious nonetheless. \n\nI can see coming back with a large group of people and taking over one of the long tables, or just coming back with my boyfriend and enjoying one of their desserts and some beers for a low-key date.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-05", "description": "All I know is everything is good here.  All of it.  Every last thing. \n\nThe good food and beer and coffee!  \n\nThe yummy grilled cheese's and the best coffee. \n\nThe staff is the best!  Friendly and fun!", "author": "Amanda P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-09", "description": "What a great bar.   High ceilings.   Really friendly staff.   Party room upstairs.   Many different beers.   This place has a really nice vibe to it.", "author": "Willie C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-16", "description": "Ambience is pretentious hipster. Food is good and so is the beer list. No buybacks after 8 beers, which is a thing in Brooklyn. I'll gladly take my business elsewhere as there are many options which hit me in the wallet less. Buybacks mean much bigger tips and also more local business.", "author": "Christopher M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-21", "description": "Very cool spot with a unique setup and vibe. I love the big open space with casual picnic tables that you have the freedom to sit down at wherever there's space. I went on a Saturday afternoon, and the place was pretty packed because there was a big party for the local Accordion club (who knew that actually existed? Gotta love Brooklyn!), but there was still plenty of space for a few people there catching up with friends and others on their laptops working or whatnot. Overall, a very casual \"coffee-shop\" feel, but has an awesome selection of beers and great snacks! We shared the Plaidman's Picnic and Mezze plate, which was a ton of food for 2 people but we managed to eat most of it. I'll be back for sure!", "author": "Tiffany F."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "61 Local", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "61 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/dIDd9QhrMDJrLaBbOPozhw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751150"}