{"aggregateRating": {"reviewCount": 304, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-26", "description": "Excellent space, vibes, selections. I had an amazing Bien Cuit apple cardamom danish (seriously before fully biting in I knew it would be orgasmic). Only thing holding the star back was the latte. It was made a little too hot losing the milk's natural sweetness. I know this sounds like such a petty thing, but it makes a huge difference. Will still go back!", "author": "Saki W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-01", "description": "My bridal shower was held in the private room upstairs and everything was fantastic! Food was good, the space is excellent - I'm a fan! Thank you to everyone at 61 Local who was part of the execution!", "author": "Dae K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-03", "description": "Caught my eye as I was walking past, but found the place very confusing after walking in. Long bar with no stools? Huh? So I asked the bartender how does this work? I just wanted a beer and a quick bite to eat. I was nicely told to order and pay at the bar and they will bring it to my table, Wasn't exactly what I was looking for as I glanced out into the open space to only find communal tables, but oh well. I'm here might as well deal with it. I mean it is Brooklyn, right? Have to try to fit in. \n\nBeer list was impressive and the Greenport Harbor Black Duck Porter ($5) excited me. Nothing jumped off the food menu so I asked for a suggestion. She said the Imperial grilled cheese ($7) is really good so I figured ok what the heck I will take the recommendation. I paid the bill and took my draft beer down to the end of an occupied table and sat by myself. About 5 minutes later my sandwich arrived with a side of mixed olives. Olives were quality and a nice surprise, but the grilled cheese was bs. Still scratching my head as to how they call it grilled cheese. Two slices of non melted raclette cheese with a tasty tomato jam on two thick pieces of parma country bread. Now, it wasn't disgusting or anything. It tasted ok, but was not really grilled cheese in my book.  The cheese should be melted.  Grilled cheese 101 people.  Get with it.\n\nOverall the space was large, but didn't seem put to good use. There was an entire section selling local produce. Reminded me of like a PTA sale back in the 3rd grade. Granted I can be close minded at times because I grew up on Long Island. Sometimes I don't understand the hipster, free spirit frame of mind, but I have been to better places. It's ok for a snack, but don't plan on eating dinner here. Eating at the bar is not even an option.  61?  More like 86 it.", "author": "Mike D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-09", "description": "The brand-new hipster category was invented to catergorize this spot.  Everyone has a plaid shirt, wacko shoes and a beard (including the ladies).  It's a little \"too\" open-aired to have an intimate feeling and the denizens of the \"shared\" tables aren't so much into sharing.\n\nThat said...the wines are tasty, the staff is great (after a wierd incident) and the sammies are mothereffing partying in my mouth.", "author": "Kelly T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-24", "description": "Just had celebrated a big birthday upstairs in the private room.  Emily was super helpful in organizing the menu, being super responsive with any questions I had, sending a floor plan etc.  The food was great and the event staff was very helpful with some last minute assistance we needed with decorations.  Was really a great venue with great staff.", "author": "J N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-17", "description": "Cool place! Really large space for a coffee shop but I can see how it can be utlilized for events and such. The large beer garden style communals give a unique feel and it's sort if like a indoor coffee garden. \n\nGreat coffee doesn't hurt either.", "author": "Tony M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-26", "description": "Threw a baby shower for my daughter in the upstairs event space.  Place is really upbeat, clean and attractive.  The staff and management couldn't have been any nicer, pleasanter or more accomodating.  We planned this shower from out of town and 61 Local were attentive to every detail so I had no worries. Answered email and calls promptly throughout the process.\nEmily, Stephanie and Jessica deserve a special callout for their help.", "author": "Maura G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-21", "description": "My neighborhood haunt since the day it opened. I live around the corner and make it my office space because it is more comfortable and has far better beer than my apartment. \n\nConsistently excellent local beer on rotation. The menu is limited in a near flawless way - no kitchen but the panini press goes for miles - and the prices are reasonable to boot. Love 61 Local and hope it never changes.", "author": "Chris V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-14", "description": "With its big tables, many electrical outlets, fast free wifi, and great espresso-based drinks, it is an excellent place to study. However, evenings can be quite loud as many small.groups come for drinks. They also boast a wide range of local beers on tap.", "author": "Jeffrey C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-13", "description": "I've been to 61 Local a few times now and always been pleased we did.\n\nAs the other reviews mention its a nice atmosphere in the evening low lighting and bench style tables. On one occasion it was pretty busy and they could've done with more people working on the bar but it wasn't a terrible wait. \n\nWe went this weekend with friends for brunch quite by accident as the place we had intend to go was packed, we forgot all about 61, walked passed it and went on a whim and it worked out great.\n\nWe shared the Farmers Melt and the Green Market Salad and both were delicious, generous portions that made a really nice brunch, coffee was good too.\n\nIts not a huge menu but everything that was coming out of the kitchen look really good.  We'll definitely be back.", "author": "Erin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-18", "description": "Great place to have coffee. Also good eats. The space is amazing. Unfortunately no computer allowed during the weekend.", "author": "Tomas G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-19", "description": "Woodsy but industrially crisp like a clean version of country western music minus all the twang (taylor swift?) The space feels open with wide ceilings and the warmth created by all the wood is illuminated by water barrel encased light bulbs. For environment alone this place is a winner in my book.\n\nThey offered us an olive mix and pickles even though the kitchen was closed. They have several varieties of Kelso brewed beer on tap. A fun place to feel like you're in a retreat away from the city scene. I'll be back for food for sure.", "author": "Mary P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "Came here for a date and really loved this bar!  The ambience and decor are pretty ideal for an intimate and casual meeting with friends.  And they have a pretty extensive beer menu that's not too pricey.  \n\nThe space is open and the front usually opens to the sidewalk so you can peep in next time you're going to trader joes.  I came here on a Saturday night at 8 and there was barely anyone here.  There are long oak tables and the bar is candlelit for that whole Brooklyn organic/industrial look.  The only thing is that you can tell it would get loud if packed because my date and I talked louder than we normally would even though there weren't too many people there.", "author": "Biqi C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-24", "description": "Very cool. I was here for some events, and I love the purpose, vibe, and offerings. They have kombucha and soda for the non-drinking crowd should you be spending an evening here (much appreciated) and the staff were really nice.", "author": "Pam S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-14", "description": "61 Local, you served me beer with a spoon. I also bit into something crunchy in that same beer, and love you for it. The reason for the above: beer (ice cream) floats!  While initially skeptical, the regional NY brews paired with Steve's Ice Cream Co make a great combination - the choices of beer and ice cream flavors were well-thought out and equally executed. Especially tasty were the (Greenport) Black Duck Porter with the Maple Porter Pecan and also the (Six Point) Diesel Stout with the Beer Pretzel Caramel (hence, the crunchy beer experience mentioned earlier). Many of the beers were offered in either pints or for $1 less, 12oz glasses - sometimes even a pig like me actually wants a smaller drink, so having the option is really nice. \n\nIt's hard not to mention the interior of this spot; totally open space, big communal tables, and appropriate lighting as well as music (thanks for the Sharon Jones) that's not too overbearing - all allowing one to actually have a conversation AND see who the hell you're talking (not shouting) with. \n\nThe menu is full of regional supplied foodstuffs, and I like how they have separate soft and hard cheese plates. Although there is just something off to me about keeping the panini press \u0026 sandwich station right behind the bar, the area looked clean and well maintained. The only thing keeping me from giving 5 Yelps is that it's cash-only. BUT you can keep a tab with a card, and there's an ATM right @ the corner (a grueling 50-step round trip? Waahh!)\n\nBetween the GREAT beer selection, easygoing crowd, SPACE to move around inside, and pretty friendly bartenders (who ACTUALLY know about the beer!) I will make it a point to be back.", "author": "Daniel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-08", "description": "Ok, so if you like service  with a smile, come during the day. Much friendlier staff and they have pretty tasty sandwiches.\n\nAnd it nice a quite during the day as well if you want to meet someone for a small bite before an event.", "author": "Madeline Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-27", "description": "Is this a library during the day? I've felt so awkward a couple times coming her for an afternoon beer with my friends. You walk in and not a soul is talking. No exaggeration. They are all tapping away on their laptops. All tables are occupied at either corner so it's not really inviting to sit in between. Is it not a possibility to designate a table or two \"laptop free\"? Otherwise I like this place and it's certainly more lively in the evenings.", "author": "Alissa C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-22", "description": "Laptops are now banned there on the weekends. \n\nMeaning they will *actively ask you to turn off your device or ask you to leave, even if you are paying for food and drink.* It was very uncomfortable, especially since the rule is new.\n\nThere is a lot of potential at 61 Local, but feels like they are having an identity crisis between community space, coffee house and restaurant -- and fumbling through the customer service as they communicate changes, even to their loyal paying customers.", "author": "Pat A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-06", "description": "Happy I stumbled into this place. Great addition to the neighborhood. The menu items my bf and I tried were really tasty - the \"Hamster\" sandwich, the ricotta bread, pickles and the spicy nuts were all delicious.", "author": "Jasmine M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-23", "description": "Met up here with a few friends for happy hour. Since my two friends aren't beer drinkers, I wasn't sure what to expect, but as soon as I walked in, I was pleasantly surprised.\n\n61 Local is amazingly spacious and big (by city standards). The ceilings are high and the lighting is dim, which made me think at first it was going to be pretentious, but it was anything but. We got there around 6 and the place was consistent but not crowded. There was plenty of space to sit, and we had a large table in the front all to ourselves. \n\nBeer dominates the menu and, given the area, most of it is local: Barrier, Kelso, Sixpoint, etc. The beer list is displayed prominently above the bar and there are also menus with more thorough descriptions. They also offer wine for those who prefer it. They don't have liquor - and I saw a few complaints on here about that - but come on, if you want that, there are plenty of other options in the area for you. \n\nThe menu is simple yet tasty: again, lots of locally sourced ingredients, prepared right behind the bar. There are a variety of options for carnivores, vegetarians, and vegans: sandwiches, salads, and small plates. M liked her veggie burger and appreciated that it came on a bed of greens instead of with a big bulky bun. C's grilled cheese looked amazing. I ordered an egg and ham sandwich, which came with a side of pickled carrots, and it did the trick to fill me up and soak up some booze.\n\nThe bartenders were nice enough and although I didn't need help picking a beer, I could hear them making recommendations for others who did. \n\nThe clientele ranges from after-work dudes in ties to casually dressed people like us. \n\nLike others have said, it is cash only, which is my only gripe. But given everything else, I'll suck it up and hit the ATM to sample local brews and shoot the shit with my friends in a nice atmosphere.", "author": "Denise C."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "61 Local", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "61 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/dIDd9QhrMDJrLaBbOPozhw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751150"}