{"aggregateRating": {"reviewCount": 304, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-06", "description": "Went to this place 2 or 3 times while studying for the bar exam. It's not bad but they could use some work. \n\nPros: lots of space,  free WiFi,  good coffee\n\nCons: a couple of unfriendly staff members, wifi sucks,  and people love to take up extra tale room the don't need and the outlets to charge their 82 devices", "author": "Garynn N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-05", "description": "We had our wedding rehearsal dinner in the private upstairs space over Labor Day weekend and everything was fantastic. Marissa and her crew were very attentive, easy to work with, and promptly answered all of our questions both before and during the event. When planning the event, she really took the time to listen to our needs and to customize the menu, alcohol quantity, and event timeline to fit our needs. The private space was perfect for our group of around 70 people - simultaneously intimate without being too crowded or feeling claustrophobic. The room set-up was lovely, and the combination of cocktail and banquet tables worked really well for a mixture of seating and mingling. We received multiple compliments on the venue and the food. The cost was also pretty reasonable for hosting a private party. It was the perfect way to kick off our wedding weekend. Would definitely recommend 61 Local for private events in the future. Thanks again to Marissa and the whole team!", "author": "Margaret W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-19", "description": "very airy, large space - rare for NY. Great selection of bears. Nice place to go with friends or by yourself. Can set up your laptop and work, Kind of feels like you're in another city.They let you try beers and you can order them in a small size or create a sampler.", "author": "Summer J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-24", "description": "Great staff great choices (went for breakfast); brought my 10 year old; we had a great time chatting with our server and finishing our yummy food before setting off for our day.", "author": "Beth P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "Been meaning to try this place for years. A real versatile spot: good coffee, good microbrews, and tasty bites. \n\nGood lunch spot, though not sure I'd say it's quite a dinner spot. Definitely suffers from \"coffee tenants\" who order a cup and then camp out for hours with their laptops. I'm not sure who's worse: the web surfing trust fund babies or the entrepreneurs who have their mail delivered there. Together they keep the place from feeling like a true restaurant. \n\nAll in all though, good food and drink. Pork sliders are tasty, as the sauce has both nick and tang. Beet veggie burger slider is also quite good. Kale kimchi salad was a little light in kimchi. Also, why does no one offer flat laccinato kale?\n\nHouse ginger ale and kombucha are really solid.", "author": "Food Jerk X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "Great place to do work during the day. Plenty of plugs, reasonably quiet and great long tables. Their coffee is reasonably good and you get $1 off for refills. \n\nFood is good too. I got the 3 sides option (tomato soup, half cheese sandwich and chicken sausage) for $11 and all of them were tasty.", "author": "Alex W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-20", "description": "I was looking for a place to kill time so I stumbled upon 61 Local. They have a great selection of craft beers and local beers. I really enjoyed the Dark Chocolate Caramel Corn. Went really well with the Captain Lawrence I was having. The lighting really caught my eye. \n\nOverall the place is cool. Perhaps it was just a slow night because of the rain.", "author": "Violet P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-18", "description": "Great cappuccino and great vibes. I love these hybrid cafe work spaces. I liked this one just a lil more than the Brooklyn Roasting Company by the Manhattan Bridge...sorry BRC.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-13", "description": "I enjoyed this place. Tons of craft beers to choose from, water with cups that you can refill on your own, long communal tables, a very industrial-like interior. What's not to like?!\n\nBeer prices are fair and they also offer food, however, we went elsewhere for the latter. I really liked how laid back it was on an early summer evening. The bartenders are also very nice and don't rush you to choose a beer the second you get to the bar.", "author": "Kristy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-24", "description": "EXTEND YOUR ESPRESSO SERVICE PLEASE!  All true cafes should have espresso after 4pm.  \nOther than that, you have been a beloved neighborhood institution.  Great food \u0026 drink, and a wonderful work spot for freelancers.", "author": "Peggy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-11", "description": "Fun, rustic, hip. The beer is excellently curated, and the small plates are delicious. Go on Monday nights and you might catch the talented bartenders preform!", "author": "Mark R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-13", "description": "I really don't know how I haven't reviewed 61 Local. I go there a couple times a month, and it's always excellent. Great selection of beer (including the amazing Other Half) and really, really good food.\n\nFood is a little pricey but everything is local (how appropriate, given their name), so you can indulge your inner-yuppie by supporting the nearby purveyors of fine edible goods. Service is always excellent and all the employees are SO nice.\n\nCharcuterie, cheese, Middle Eastern plate...all things you can't go wrong with. I think we got the suasage last time and it was excellent!\n\nThey also have great iced coffee (on tap) that you'd be a fool for not trying. Coffee, pastry, booze, dinner...it's a one-stop-shop, and 61 Local does it right.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-24", "description": "This place has top notch people working for it!  I was planning to be married outdoors in prospect park, when all the sudden the weather forecast turned sour just 3 days before my big day!  I emailed the events people to see if I could be squeezed in and they got back to me in under an hour trying their best to accommodate.  \n\nThankfully we had amazing weather, but I'm sure if I didn't have a safety blanket in 61 local it would have rained cats and dogs.  Thanks 61 local for saving my marriage!", "author": "Dylan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-25", "description": "61 local is convenient, fun, reasonably priced with an attentive staff, plenty of options for food, drinks, locally grown products, incredible coffee and lots of space for you and your laptop. I get something different every time and have never been disappointed.", "author": "Ken C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-26", "description": "Nice selection of craft beers. Very spacious and high ceiling. Wooden and brick interior.\n\nCommunal table is nice", "author": "Patrick N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "Stopped here for a quick bite and some great beer. Sat at the bar and had a Chef's Choice Meat and Cheese Board. Definitely recommend! Staff was very friendly and welcoming!", "author": "Kelsey B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-04", "description": "Fun bar with lots of character and cheap drinks. It's a lot bigger than most bars in the area, so you feel less guilty if you want to sit for a while with a book or doing some work. They seem to have a good selection of events as well, so I'll definitely be going back.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-30", "description": "I really love this place but wish they didn't have a minimum for credit/debit cards. The coffee is always good and strong, and the food is yummy and fresh! Not sure what my issue is, but the three times I've gone I always forget to check my wallet before I order a simple cup of coffee to go and later realize they don't accept card payments under $10, so I end up having to purchase $10 worth of items which isn't the end of the world but kinda sucks a bit especially when I've already had breakfast and just want coffeeee! Lol. But besides that, this place is great. The vibes are cool, the staff are nice. I had mentioned a while ago that I felt the girl with the beanie was very cold to me several times and very friendly to her coworkers and her attitude seemed to change entirely since then. I think 61 local really values their customers, their opinions, and their experience.", "author": "Bree R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-02-27", "description": "Really bad experience here. Bad service, bad prices, lumpy cream in my coffee and they basically shrugged it off. Wifi is iffy. The space itself is nice and big, but when it filled with children running around, it was extremely loud. Not my favorite, but I gave another star because my friend who suggested we meet there really loves it and said they have interesting classes and things. But I probably won't return.", "author": "Cassidy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-25", "description": "Awesome food in a very relaxed environment. You walk in and you see a juice/tea bar with a little bit of drinks. The overwhelming big tables seem a little intimidating because of the shared communal eating concept, but it's actually very warming and inviting when you actually sit down and have your meal. They even have an event space to accommodate bigger groups. The food here was excellent \u0026 and their teas as well. I had a lavender/hibisques loose tea, and I just wish the cup was bigger for me to enjoy it. My husband had the veggie beet burger which he said was delicious. It came with a side of little sweet potatoes crunches. I had pulled pork tacos and they were delicious. The slaw was a little too sour for my taste, but that could just be me. \nOverall, I would definitely come back here for lunch, or a work date with my laptop and a good tea.", "author": "Daniela T."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "61 Local", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "61 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/dIDd9QhrMDJrLaBbOPozhw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751150"}