{"aggregateRating": {"reviewCount": 304, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-05", "description": "Lots of beers I'd never heard of and the bartenders were super-cool about letting us try as many as we needed until we found just what we were looking for.  Gorgeous, cavernous space.  The bamboo picnic tables are very nice too.  I would suggest they get some coat hooks going so there aren't coats all over the tables and floor (no chair backs on picnic tables), but that's a suggestion, not a complaint :)", "author": "bigblank b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-13", "description": "Went for their opening party and was really taken with the whole design of the place.  Big, lofted ceilings with exposed beams and the exposed brick was very cool, but even nicer was the attention to detail - using large growlers for light fixtures, for instance.  The communal bench/tables are spread out like a beer garden with ample room to stand as well.  (Think Barcade.)  Staff was very friendly and very knowledgeable of the beer selection.  Speaking of which, I respectfully disagree with the couple of reviews have been down on the beer selection.  There are around a dozen taps with a wide variety of beers from NYC and the surrounding states.  They had Six Point (different Six Point, mind you, not just Sweet Action or Righteous Rye), Kelso, and Victory, but also a few others (names I'm forgetting), and all covering the gamut from light to dark, really something for everyone.  And again, very sweet, knowledgeable people serving.  So there is plenty of variety, albeit of the more local kind, versus a GBH which has a lot from around the country and beyond.  I did not try the food but what I saw (and smelled) looked good.  I do agree with @bigblank b that coat hangers are very necessary - my party had to keep our coats on the floor.  That seems pretty easily solved though.  I will definitely go back soon!", "author": "Evan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-17", "description": "Awesome rotating selection of local beers on tap.  They also have locally produced wine and kombucha on tap!  The folks who work there know more about beer than any beer bar I've been to.  This is an awesome addition to the neighborhood!", "author": "hop h."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-22", "description": "cool vibe.  huge space for brooklyn.  excellent beer selection.  accommodating for families, singles, couples and even solo workers looking for a space to plug in for a little while.  having first experienced 61 local as a young married couple who went out for a late beer after work, we loved the beer, and the food was okay.  (mostly a pressed sandwich, and they havent changed the menu that often).  now that we have a kid, we love going here to meet up with other families and grab a great beer.  they are very accommodating, although i agree with one reviewer who described the bartenders as aloof.  i must disagree with the other reviewer who complained that the local mom meet up ran her out of here.  yes, we neighborhood moms love 61 local.  we come here often.  with kids of various ages.  we actually purchase food and drink.  and we tip our bartenders.  we also come when we want a little area to work when our kids are at day care, with the babysitter, or a play group.  and then we appreciate the big tables, and free wi-fi.  on a whole, 61 local fits the bill for various needs in the hood.  the true meaning of your local pub.", "author": "A M."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "61 Local", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "61 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/dIDd9QhrMDJrLaBbOPozhw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751150"}