{"aggregateRating": {"reviewCount": 304, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-15", "description": "Great space. I often come here to study. The staff is friendly and the food is fantastic: I've never ordered a dish I didn't like.\n\nMy only caveat: a (surprisingly) large number of patrons feel that it is appropriate to conduct conference calls and Skype meetings in the venue (without using headphones). I wish Local 61 would enforce some sort of policy with regard to etiquette (though they do implement a no-laptop policy during weekend brunch hours).", "author": "Sophia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-27", "description": "LOVE LOVE LOVE!\n\nWe were all sooo excited to get to live within walking distance to this new and GREAT local wateringhole that ONLY serves local products. May I add that they have WINE ON TAP! Love that!\n\nQuite a business they have going here. Everything is prepared by the bartenders behind the bar. You will truly pay for what you are getting. You get awesomely friendly service, great food, and great local beer and wine. Nothing better!\n\nBe forewarned...this is a place where you may leave there spending a good amount of $$. This fact is totally worth it when you factor in that you are helping local businesses. BUT, you will have a great time munching on cheese or meat plates, almonds, pickles, etc. Nothing wrong with that!\n\nLooking forward to our next trip to 61 Local.", "author": "Pamela S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-06-26", "description": "Good bar.\n\nWent here for an event featuring Barrier Brewing Company. ( http://youtube.com/watch?v=MgjNY7Xa8_o\u0026hd=1 ) and had a good time.\n\nIt was quite loud and crowded, but the place handled it well. If I lived closer, I'd go frequently. \n\nMaybe you should, too?", "author": "Ian J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-07", "description": "Really liked this place!!\nThe atmosphere. \nThe bartenders.\nThe beer tasting ability.\nThe local beer selection is unbelievable!\nThe House Made  Kombucha! (on tap??)\nMy friend took me here and it was awesome!\nThe entire setup was great. \nThe location was perfect!\nWill go again...and I look forward to it :)\n\nPS...didn't eat there the food (paninis and such) did smell VERY nom!", "author": "Jenn H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-02", "description": "I LOVED this place. I was celebrating my friends birthday, but she wanted a low-key place, and we happened to go to a small art gallery opening right next door, so we dropped by to get a beer afterwards. Being in Manhattan all the time, I liked how spacious this place was, and given how big it was, that it was quiet and not too loud. It was definitely more of the birthday girl's scene, which I was grateful for. \n\nWe stayed there for a while with our beers. The only downside was that she wanted tequila shots, and they didn't have any hard liquor. After a couple beers, she just wanted something else (she didn't want the wine), but she agreed that she really liked this place. If I'm ever in that area again, I would definitely be down to hang out there!", "author": "Grace W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-14", "description": "I am rating this a daytime spot, I've rarely been here at night. During the day, very relaxed and easy place to work from/meet for a coffee. I love their coffee and selection of teas. Also, their beer selection is pretty delicious!\n\nThe negative is the food. I have been disappointed with every single item I've ordered for lunch, whether it's a sandwich with next to nothing in it or the pastries they serve before the makeshift kitchen is open. But I don't feel as though they are trying to win us over with their food in any case...  If only they would have some sort of egg/bacon/cheese bagels option in the morning!Right now, this is a place to go if you are not hungry.", "author": "Satya A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-05", "description": "Sterile personality\n\"Flavor of the half-year\" hangs from its every structural fiber\nService knows the joint is favored right now\n\nI had high expectations and an open mind, and yet 61 Local elicits one of my worst compliments: it was \"nice.\"\n\nThe bartender brigade was aloof.  The selection was tasty.  The beer float was pretty good - a special offering, but not a must-repeat sampling.  The space was bland, blase, and mono-many things.  \n\nI even had a good hook - I sat down and immediately made an acquaintance - some dude who'd done his undergrad near where I now reside.  OK, we can be immediately cool.  And as his buddy works player magic on a semi-nearby lady?  Good, polite spectator sport.  We supported and discussed options.  We strategized 3rd person.  We (he) took a smoke break and discussed potential outcomes Choose Your Own Adventure-style.\n\nAnd still - with a mildly special offering, a solid drink rotation, and a fun story to tell, the bar was just a-ight.  These are the makings of A-OK.\n\nPeace unto thee, 61 Local, and I bid you good luck until your next iteration.", "author": "Ben S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-30", "description": "61 Local is my jam. It's got a relaxed vibe and great service. They serve local beers and wine on tap - no bottles. No liquor (save for their house-made vermouth). Their food menu is large and interesting. The bartenders are attentive and nice. They host tons of events in their very-cool upstairs event space. What's not to love?", "author": "Megan S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-25", "description": "The good: decent beer selection, quiet working space (I love beer + work), early afternoon space to chill out with a friend\n\nThe bad: aloof baristas/bartenders, credit card minimum (isn't that against your credit card processing contract?), weird smell (wasn't fresh, sort of stale). Not great if you're going to have food or want to smell your drinks. \n\nMeh is right.", "author": "Ingrid C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-12", "description": "I've been to this place a few times.  Its been hit or miss. Sometimes its crowded and sometimes its not.  Its a cute place.  Not very comfortable though.  More like its trying to be hip.\n\nThe menu is good and bad. Bad as there's a very limited selection.  Good as the sandwiches are pretty enjoyable.  \n\nStaff not very helpful or friendly.\n\nDon't get coffee or tea here. Its not good and a big hassle to get it. They act like its a huge favor to get someone a non-alcoholic drink even though you order food and are with a bunch of drinkers.\n\nFiance and friends seem happy with the beers.", "author": "Cori B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-05", "description": "A gem in the neighborhood. A great spot to work for a few hours. It has a pretty substantial food menu, plus a large selection of beer, wine and cider. Nearly everything is grown, produced, brewed or baked locally and its celebrated throughout the menu. The space is really large and almost always has room for more. If you're needing an outlet, I suggest bringing an extension chord!", "author": "Miriam K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-03", "description": "61 Local has a great space -- high ceilings, nice light during the day.  I like the communal tables as well.  Their food is only okay -- a little sloppy and gloppy.  The wine list is good and -- while expensive -- the pours are generous.\n\nBut their policy of no-laptops on weekends is absurd if people are actually ordering food and high-margin items like wine, beer, etc.  I've seen the waitstaff ask laptopped people with plates of food to move to another area to make room for people who are just chatting over cold, 2-hour-old tea or hanging out with their kids for hours.  Part of me likes the very democratic way they approach the business, but I don't think it should matter what people are doing as long as they are paying customers.", "author": "S_Z_ C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-06", "description": "Is there service here? Because I still can't find it. Took forever for them to take my order and then ended up charging me the wrong prices. Food was good but not worth the hassle.", "author": "John S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-10-21", "description": "This was my favorite place for years! Great coffee, pastries from Bien Cuit, and awesome food (the Afternoon Special is my fav!)\n\nBut... Finally returned after a long spell and realized why I left- the afternoon mom meetup. Nothing quite like settling in for an afternoon of work to get run out by a loud group of mothers and their crying newborns. \n\nFive stars on a quiet day.", "author": "Allison E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-12", "description": "Came here to do some studying after class. Just ordered a simple tea to sip while I worked, though they do have coffee \u0026 food as well. Lots of long tables towards the back with people working, fast WiFi. Does get a little louder past 7PM with people coming in for drinks \u0026 food and they have music events at night. Very friendly baristas.", "author": "Christine L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-06", "description": "I am a local of 61 Local for nearly 2 years and it is funny to witness price inflation with their drinks. Well, not exactly because the price stayed the same but the portion size decreased significantly (-50%?). The food quality and portion size are the same except the drinks. I really don't know why. Like one of you have said, this place is in fact great for date nights due to its warm but louder atmosphere and lighting. Other than that, you will empty your wallet in a blink of an eye.", "author": "Mark A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-14", "description": "This is a huge open space which is great for meeting up with groups of people. Lots of communal tables. I was surprised to see how many people were in there with their laptops doing work though. I came here tonight for drinks and some food. They have a great, reasonably priced menu (most things are under $10). Tonight, they also had people selling fruit and vegetables inside. My friends ordered the mozzarella melt and I ordered the brooklyn brat which was the bratwurst sandwich and it was good but it was missing some flavor. Still good though. Very fresh bread and fresh sauerkraut. It had a laid back feel with very much a Brooklyn hipster following (meaning me and my black pencil skirt/yuppie work attire was not welcome for happy hour). \n\nMinus one for being cash only. (UGH)", "author": "Jane R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-01", "description": "Don't get the tea, whatever you do. \n\n61 Local is so intent on living up to its Brooklyn artisanal mission that they forget logic sometimes. Instead of teabags (which are so low brow), they have those tea strainers that sit on top of your mug for their fancy loose leaf tea. Fine, in theory, except that they have cheap thick-walled diner coffee mugs that already hold 1/2 cup of coffee, and when half filled with that stupid strainer proceed to give you a shot-glass amount of over-brewed cold tea (for $3, I might add). \n\nAlso, if you want to use the place to read or work, bring a headlamp- their need for \"ambiance\" extends to keeping the lighting so low you will go blind unless you're working on your back-lit Powerbook. (It's hard enough to work already without the play group of screaming children in the background, but that's any coffee shop in Brooklyn, so I can't blame 61 for that...)\n\nThe staff treats you like it's your great privilege to have their exceptional expertise, but if you can't learn how to brew a cup of tea, it's time to go home.", "author": "Pr P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-06-06", "description": "Not laptop friendly on weekends. You'll buy a coffee and food and then they'll kick you out if you open a laptop. \n\nSomething about \"brunch service\" but the place was empty.", "author": "Kim B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-10", "description": "Love this place from the tasty beers to the vegan food options for those of us who are into that sort of thing. However, it needs more outlets for us daytime dwellers! I don't want to have to go home half-way through the day because my laptop is running out of juice.\n\n[edit] This place has become my absolute go-to to get work done. They cover my needs all the way from caffeine in the morning, to delicious snacks in the afternoon, and of course great local beers all around. Could still use more outlets but it's manageable.", "author": "Arno F."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "61 Local", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "61 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/dIDd9QhrMDJrLaBbOPozhw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751150"}