{"aggregateRating": {"reviewCount": 304, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-28", "description": "Super cute/hipster bar in Brooklyn with family style tables (my fav). The bacon popcorn is pretty good too!", "author": "Jessica K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-18", "description": "I love Local 61! I am a regular there for coffee in the morning on the way to work, and its my go-to spot if I need to work remotely or meet up with friends for a drink. They have a really strong menu of breakfast and lunch/dinner items. They really focus on supporting local vendors so you really get the best of Brooklyn at 61 Local. I love their new house-made quiches, their salads, and the veggie burger.\n\nThey also have a very nice selection of beer \u0026 wine on tap, both of which you can taste.\n\nDuring the day, it is mostly people on their laptops working and new moms gathering with babies. The evenings and weekends are more social (and no laptops allowed).\n\nStaff is friendly, none of that I'm-too-good-for-you hipster attitude that some of the other local coffee shops seem to cultivate. Great baristas!", "author": "Janna G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-14", "description": "Loved this place! Had a game night with a group of peeps and the long tables were perfect for that! Excellent choices of beer. Nice and friendly staff. Great relaxed atmosphere and not overly crowded! Looking forward to visiting again.", "author": "Hien L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-10", "description": "Great place to meet and hang out with friends/family.  Laid back with great coffee/tea/beer selection.  Each time I've ordered food it's been delicious too.  Serves a crucial market that's missing in this area.  Coffee shop/beer is a good combo!", "author": "Food E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "A local favorite. I assumed that it would be really crowded on a Friday night, but was able to find a space for 5 people to meet up with for hours! The ambiance is really chill but vibrant, and not crazy despite it being a bar/Café. On weekends I go after church to study and it's been a great place to do work. It's a great space and the bartenders are very attentive. The veggie burger and quiche are great! You can substitute the chips for the salad which is always better :)", "author": "Cabrina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "I'm from Seattle.  I love coffee.  I like it when people get all pretentious about coffee...it makes me smile.  Because I LOVE COFFEE.\n\nSO, when I happened upon this place (introduced to me by my buddy Michael), I was really happy.  Expensive coffee from exotic places.  Place is super cute, good natural lighting- if this was in Seattle, I'd come here all the time.\n\nCoffee.", "author": "Knathan R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-28", "description": "I really wanted to give this place 5 stars, but the service was unnecessarily slow given how busy the place was(n't).\n\nI went here for a birthday party the other night, and I my friend had the whole top floor/room reserved. It's a great space with exposed brick and you can bring your own music and plug it into their speakers. Great amount of dancing/mingling space there too. \n\nThey served nibbly food which looked delicious, but I was so full from the 3 other parties I had previously hit that I couldn't try any of it. BUT, it did LOOK good. Also, not sure how much or what package deal my friends got for the party, but they had tons of drink tickets that they were handing out for the wine and beer which was nice. We just took a ticket to the bar downstairs and grabbed a drink. MAKE SURE TO TIP YOUR BARTENDERS!\n\nThe only real downside was that as I mentioned, the bartender was a bit slow. Not terrible, but I'd be waiting at the bar a minute or two without acknowledgement, and the place really wasn't that busy, even for a Saturday night. \n\nPretty cool that both the wine and beer are on tap too, with a fair selection on both sides. I'd go back if I were in the area for sure.", "author": "Remi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-06", "description": "Baa....baa...\n\nWhen I first walked into Local 61, I felt like a lost sheep!  Came for the Yelp Drinks Homebrew event but I didn't see Peter D!  Luckily, I ran into two fine gentlemen, Dan R and Matteo R, and together we asked the bartender if the event had started as we thought it was at 4:00 pm.  She told us it was six and we were kind of puzzled because we were sure it was four*, until Leslie H showed up and read a message saying it had been rescheduled!\n\nNever one to walk away from beers, we intrepid Yelpers decided to drink on and we were given a 2 oz glass of beer from the bartender for our troubles.   Peter D showed up shortly after to let us know that the homebrewers who were coming needed to reschedule so we all sat down to have beers and wait.\n\nWhile waiting, we played cards and had food. The Cured Meat Plate was good.  We also sampled the hummus plate. Pimento dip (puree?) was a party in the USA**, but the hummus to me was very bland...we're talking Taylor Swift bland, and that ain't good.  Additionally, the toasted bread squares were quite good, however the nuts were a little soft and soft nuts are not my favorite. \n\nLeslie H taught us a card game, using some sweet Yelp! cards and then proceeded to beat the pants off of everyone.  (Figuratively speaking, of course.  No pants were actually removed while I was there)\n\nWe proceeded to have some more beers.  I had the Captain Lawrence Liquid Gold, Barnacle Brown Ale, Ommegang Aphrodite (surprisingly good for a fruit beer).  When the homebrewers arrived, we sampled the Oatmeal Stout which was great.\n\nBy this time, Evan R, Jordan W. and Vicky C had showed up so the event was in full effect.  I think everyone had a nice time.  \n\nThe space is nice, very laid back and welcoming with big communal tables and a very nice bar.  Lots of families with kids (watch for toddlers underfoot!) and groups of friends.  This is a good meeting spot with quality beer and tasty food.   And next time, I know I won't feel so sheepish when I walk in.\n\n_______________________\n\n*I haven't lost two hours since the Belgian Beer festival at Jimmy's No 43.  I'm still wondering how I got back to the west side....\n\n** Go Miley! http://youtu.be/M11SvDtPBhA", "author": "Bill T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-08", "description": "We didn't end up reserving this venue for my Sister's Bridal Shower.\nMain reason:  over our budget.  \nBut in case you wanted to know..we were estimating $2,000 for Venue, Food, Drinks, and Decor..", "author": "Marie T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-27", "description": "Don't really know what to make of this place. First time here, the beers were great, staff was totally aloof. Second time here, staff mostly great, beers great, but the patrons couldn't have been worse had they been wielding Park Slope badges and strollers. Seriously, had they felt any more entitled I'd have expected them to be carrying cards seeking special stickers for \"good jobs\" and \"great effort.\"", "author": "Shana S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-23", "description": "Spent $55 including tip for 2 sandwiches and 4 beers. \n\n5 minutes from the Cobble Hill movie theater. Good date night combo.\n\nSurprisingly very good. I say surprisingly because at first glance it looks like a hipster haven and I feared pretentious mediocrity. \n\nThere was a CSA market there on a Tuesday night. I was like \"Oh boy, brace yourself...\"\n\nBut, the beet burger was very good. Stayed together well, tasty, flavorful. The beet flavor was certainly prominent but not overwhelming. Served with a very generous portion of Cape Cod style chips. The Reuben was also apparently very good.\n\nThe wine prices keep it from 5 stars. I'm not spending $11 or $12 for a glass of wine. I can get a bottle for that. Organic whatever whatever whatever, it's too expensive for a glass of wine.\n\nThere was, however, a $4 lager.\n\nPicnic style seating. You'll be seated with strangers, which can make having a private conversation hard, but I suppose that's why we have homes. You are in public after all.\n\nQuick service. Friendly staff. I'd go back.", "author": "John J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-15", "description": "Oh, 61 Local. \n\nI can always count on you to have a great (locally brewed) beer on tap. Or seven (Barrier, Sixpoint and more). With your friendly bartenders, high ceilings and low lighting, you are easily one of the best bars in the 'hood for a quiet beer with a friend. \n\nAnd once I've had too many beers* quietly and I'm threatening to get loud, you are right there with delicious snacks that will shut me up again.\n___________\n\n*They add up quickly though, so I do wish they accepted plastic. As of right now though, it's cash only.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-27", "description": "Great vibe in this coffee shop/restaurant/pub! I came mid-morning on a Sunday for a post-wedding brunch (there were a few trestle tables reserved with brunch-y items provided), and it was a very chill, easy-to-circulate-in sort of venue, with plenty of space around the tables to walk, congregate, chat, and switch. The food itself was great (especially enjoyed the yogurt and homemade granola, with which I created my own parfait with fresh berries) and the coffee strong. If I lived nearby, I'm sure it's somewhere I'd hang out often.", "author": "Sarah A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-28", "description": "Cool place to hang out. Loved the warehouse loft ambiance. Food is surprisingly affordable for Cobble Hill. Had the Quiche and House Salad. Smoked ham and cheese with a side of the house kale salad was only $7. Great deal! Nice place for people-watching and more.", "author": "Brownstone P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-15", "description": "Nothing but good things to say about this place. I've been here many nights for happy hours, dates, etc. and it has great atmosphere. Classy and hip, but also rustic and casual enough for jeans and a tee. Amazing selection of beers and local wines, always something new to try. Overall good vibes, and definitely a great date spot. \n\nI didn't realize until recently that this place is basically a cafe during the day, and I wish I had known sooner. Went early in the morning on a weekday to study, and it was a great spot with big tables. Ordered some nitro cold brew at the counter along with the Brooklyn Breakfast Sandwich. GET THIS. Probably the best egg sandwich I've ever had and reasonable at $8 ($7 for vegetarian option). Great menu of breakfast bites and excellent work atmosphere. Only complaint is outlets aren't that readily available. \n\nLove this place! Such a hidden gem.", "author": "Allison Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-30", "description": "The beer list and menu are winners. Interesting local foods and assortment of craft beers.\n\nOn the flip side, the place does not feel like a bar. It's a different concept. The place feels cavernous, lacks decoration. Popping in on the weekend, I found the bank lap top users a major turn-off, feels like a work station in an office. If I'm going out to drink, eat and socialize, I don't want to be reminded of work.\n\nThe space is wide with high ceilings, it has tremendous potential to create a really interesting atmosphere that would make me want to drink and linger- think lounge. The laptop zombies and picnic tables is a bit too basic for me. I was bar hopping and would have stayed for at least another round, because of the beer selection, but the bleakness made me move on.", "author": "Sergio V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-07", "description": "Good atmosphere, excellent coffee, very friendly staff. They have menu for breakfast and a separate one for Lunch-Dinner and nice menu for beer. Lots (if not all), local beers. \nMany people sit during the day with their computer to work and you have to squeeze in to sit and eat/drink.", "author": "Focci L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "Our church, Forefront Brooklyn, had a fundraising event here for a 100 people and it went very well! 61 Bergen was an excellent space for everyone to mingle; bartenders were friendly; and the private space upstairs was great.", "author": "Sarah N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-01", "description": "I really like this place whether it's getting coffee and working, grabbing a bite to eat, or a beer from their extensive selection. It is a pretty open space and the atmosphere is quite nice. The wifi is decent, although it can quickly get crowded with people working on their laptops. They also have a vegan burger, which is pretty good. And at night, it is sometimes hit or miss whether it is really crowded or not, but I'm a fan of their drink selection.", "author": "Emily L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-29", "description": "I'm coming home, I'm coming home, tell the world I'm coming home.(To the tune of J.Cole's song that I can't stand)....actually I'm NOT coming home! Yet.  Perfect local spot to stop off and have a couple locally sourced brew dogs!  Bartenders are nice, atmosphere is chill, definitely a spot that I'll delay my coming home with.\n\nNow cue that song stuck in my head for the rest of the day. ARRHH!", "author": "Mike S."}], "servesCuisine": "Cafes", "priceRange": "$11-30", "name": "61 Local", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "61 Bergen St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/dIDd9QhrMDJrLaBbOPozhw/ls.jpg", "@type": "Restaurant", "telephone": "+17188751150"}