{"aggregateRating": {"reviewCount": 287, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-13", "description": "This is actually my first review of an establishment on Yelp, but it's not entirely due to my experience at Heights Cafe, because I've intended to review various establishments for some time. \n\nAs for Heights Cafe, the one-star rating is due to my significant disappointment when my two sisters and I  stumbled upon it during a trek through BK Heights. I'm a big fan of the neighborhood and I wanted to like this place, but perhaps years of experience in the restaurant industry have set my expectations too high. \n\nIt was a recovery day, because we had just celebrated my little sister's 21st birthday the previous night. I covertly mentioned this fact to the hostess, and she promised a desert with a candle. Not too much to ask. She was actually really cute which is the only reason my rating is two stars and not one. She did, however, forget all about it and our desert was enragingly sans-candle. That was after an entirely forgettable meal, I asked the waitress about the rigatoni bolognese, to which she responded \"Its one of our most popular dishes\", which is server-speak for \"I know nothing about the dish you mentioned, I have no personal recommendation, and in fact I don't even think 'bolognese' is English\". I had to flag down several servers for cocktail refills, which is kind of unbelievable because Service 101 says that in the interest of your check average, a cocktail should never be empty, not to mention I had to request water refills, plates be cleared, etc. We sat at a dirty table for more than 10 minutes, and that is simply unacceptable. \n\nI resisted the urge to point out the hostess's lapse, because I thought it may seem weird to make her feel like an asshole for forgetting my little sis's 21st birthday then ask for her phone number. \n\nUnfortunately, I won't be back. Like I said I wanted to like the place, I like the location and it's set up nicely; lots of booths, cozy, and overall a nice aesthetic, but the big fat ZERO they scored on service precludes any future visits. I hope I run into that hostess on Montague St cause I'm not setting foot in the Heights Cafe again", "author": "Mike D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-26", "description": "Horrible. A friend warned our group (four people) that this place is known for bad food. We didn't listen. The patio was so appealing we thought it couldn't be THAT bad. It was! \n1. The wait was beyond what is typical for a busy brunch spot on the weekend.\n2. When the food did come it was random small portions. It looked like someone had just thrown things together. \n3. it was all cold. What's worse than cold Eggs Benedict with crusty hollandaise sauce?\n4. The food was so bad it was hard to choke it down. The bread was stale... think airport and hospital food. \n5. Payment - cash and American Express only. Very random for a fully operating restaurant. There was no warning or signage.", "author": "Nena G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-10", "description": "Slow service, food was clearly frozen and re-heated. Overall less than ok. Don't bother.", "author": "Chris W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-05-09", "description": "Not that good---service was fine---food second rate---we had a \"fresh'\n\nmozarella sandwich made with processed cheese---not really very good", "author": "sammick d."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-11-10", "description": "Great place for those who live nearby.  Food is very good, not much to draw crowds from other neighborhoods, but if there are few \"hits\" then it must also be noted that I've never had a \"miss\" here.   The atmosphere is great too, very Brooklyn Heights--laid back while being casually sophisticated and understated.  \nOn the apparently controversial \"kids\" question, there are plenty of dishes that would appeal (burgers, pizza, penne with marinara).  It's a moderately quiet place, but Heights residents tend to be fairly family friendly.", "author": "Kate T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-05-27", "description": "Honestly, for their brunch menu I didn't find much choices.  I'm an egg person, particularly omelettes..yet their selection of omelettes was like 2 option.  Huh?  What the hell.  I ended up ordering one of the two omelette choices, the Grilled Zucchini Omelette.  I was surprised it was good, since my friend ordered something that looked not quite as appetizing.  \n\nThey gave a hefty portion of a variety of bread before the meal.  I didn't try it but my friend said it was pretty good and proceeded to JUST eat the bread, order coffee, and nix ordering since the omelette selection was a bust.  \n\nService was..bleh.  Not great not horrible...took some time to refill my coffee though.  I hate that crap, especially if I have to ask a second time.  \n\nAlso, what's with American Express only thing? Wow.  Overpriced menu also.  \n\nAt least there's outdoor seating for beautiful days.", "author": "anita h."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-05-07", "description": "Solid great place to eat and socialize. The best part is the outdoor seating in the front. This is one of the better if not best place to eat on Montague Street. \r\n\r\nThe food tastes great, a basic but versatile menu. My brie and ham panini was excellent but the star of the menu was the sweet potato fries. It's a must. The 4 cheese pizza was also very good. Even the bread basket is good. Service is good too.\r\n\r\nI wouldn't necessarily make a trip from Manhattan to go to this place but if you happen to be in Brooklyn, it's a great place to visit.", "author": "Jen L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-18", "description": "I've been coming here for years and the food was a lot better before the  renovations really disappointed in the new chef. Also the best thing on the menu the  mussels were not there anymore . Really need to bring them back", "author": "Dom C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-18", "description": "Neighborhood was great...food and drinks okay.  Service wasn't outstanding either", "author": "D A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-15", "description": "I've been here for weekend brunch a few times.  It's always been good, and it's a pretty nice space.  I thought the service was fine, though when it gets busy it drops off a bit.  Overall recommended.", "author": "Jordan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-24", "description": "Probably the nicest outdoor seating setup on the Montague strip, but no space for our party of 7, oh well.  After 2.5 years working down the street I finally got around to trying this place.  The food was unexpectedly good - a colleague and I went halvsies on the bbq pulled chicken sandwich and the daily special turkey panini with a few exciting ingredients in it, including pear, yum.  The dining space is airy and clean too.  The only real downside was the waitress, who we could never find every time we needed her.  (3.5 stars)", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-24", "description": "My husband and I came here for brunch on Sunday. We went early (around 11am) so it wasn't very busy yet.There was nothing was too spectacular about the restaurant or the food. However, I did enjoy the complimentary bread and the English Muffin from my crab cake breakfast sandwich. My husband wanted a mimosa, but apparently, you can only get mimosas after 12pm. We weren't not sure if that's a restaurant rule, Brooklyn rule, or NYC rule, but that it was odd. Overall, I had a quaint experience here, and it filled my brunch void.", "author": "Cathy C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-09", "description": "Dismal food, dismal service, and overpriced. Really, a disgrace. Let's start with my entrée: a pork chop with sautéed vegetables on the side. No potato, rice or pasta. Not even any garnish. It looked like nuked left-overs. Then there was my daughter's risotto. It tasted more like cheesy rice. We both agreed it was terrible. I told the server who indicated they often got complaints about it and did offer to bring something else. But my daughter is 15 and a little shy and was very hungry and didn't want to ask for/wait for something else. Did the server take it off the bill? No. Did she maybe offer a complementary dessert? No. Did she make any adjustment to the bill at all?  No. Oh and let's talk about the decor. This is post-renovation. It looks like a restaurant you would find in an airport. Cheap and soulless. Never going back. Don't waste your time or money.", "author": "David A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-27", "description": "I've had an array of experiences here and would rate my overall experience somewhere between two and three stars. Most recently, I ordered an omelet and found myself quite disgusted (resulting in a loss of appetite -- rare for me!) by the fact that a portion of it was still raw. I moved the raw egg to the side in order to display it to the waitress. She acknowledged the issue and apologized, but when the check arrived, the omelet (which I had barely eaten) was still listed. I asked the waitress to remove it and she took 1/2 off. Although she wasn't rude, I felt as though given the inedible quality of the meal, it should have been removed from the check entirely. I will not be eating here again.", "author": "Ally B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-01", "description": "1 saving grace: sidewalk cafe\nThe food is pretty average, but so is the food at all the other restaurants on Montague St. \nI only go there because my boyfriend lives nearby and its a good place to have dinner, but nothing special.", "author": "Sabrina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-04", "description": "Great food. I had the chicken paninni which was great. Good quick service.", "author": "T W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-27", "description": "Love this restaurant, great place near the prominade.", "author": "Lorrie G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-11", "description": "A solid average place - nothing to go out of the way for, but if you are hungry and in the area... The brunch menu has a decent variety - I went for the meatloaf sandwich which was HUGE. Seriously, meatloaf for breakfast? The roll it was on- forget it, just toss it over the divider for the pigons. Trust me- you'll have plenty to eat.", "author": "Erik C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-14", "description": "Went there with the fiance for brunch. Food was delicious, but bad service can really mess a good meal up. It was the waitress we had. She disappeared at one point after we asked for a refill. And then she did it again when we wanted the check.", "author": "Ulysses G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-14", "description": "I have been eating at this cafe for at least eight years and yesterday I had the worst service ever. I was seated ( inside)at $4:45pm ,so it was not busy, and was not given a menu , since all the waiters and the pregnant greeter were busy chatting, until I asked for it. After I asked for the menu, the woman delayed it to finish her conversation.  and then brought it with an attitude. Waiters use to be very polite and ask for the drink order first and woman did not. The bus boys were doing their job( filling water glasses, asking if we wanted extra plates since we were sharing food, cleaning up quickly,etc.) but waiters were busy socializing amongst themselves...4-5 of them were standing around chatting.I was never asked if I wanted coffee or dessert.I see many new waiters and it is evident that they need training and supervising.\nFood was never the greatest but waiters were pleasant and polite. What happened??\nBring back old menu ,larger portions of salad, and professionalism.", "author": "Elizabeth V."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Heights Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Gtqea5YJjWmv9-NRFz9eTQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186255555"}