{"aggregateRating": {"reviewCount": 287, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-03", "description": "Less than mediocre fare.  The only redeeming facet is Sierra Nevada on tap.  I come here every 3-4 years since I'm right around the corner, but I never seem to learn my lesson.  Let my repeated poor experience be your cautionary tale.\n\nAnd... the next morning my wife and I both had stomach aches.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-29", "description": "We had lunch there today and the food was very good.  We each had a different chef's daily soup (I had the roasted eggplant pea soup [I think that's what it was called] and my husband had the celery root mushroom), after which we both had the portobello mushroom frittata.  The bread was also very tasty.\n\nWe arrived at 12 noon and were able to snag a window table, but the entire restaurant was filled by the time we left at 1:00 p.m.  The back room is bigger, as are the tables.  We really enjoyed looking out through the large windows on a cold/sunny day while eating good \"comfort\" food.\n\nThe service, on the other hand, left something to be desired; it was very inattentive.  It was also disjointed, in that one person took our order and never again appeared; two different people brought out our food orders; and someone else (presumably) refilled water glasses.  We asked one of the latter for more water and he never brought it, so we waylaid someone else and he was much more responsive.  It's not that the service was unpleasant; rather, it was totally inattentive.  The reason why I'm giving four stars instead of three is because the food warranted it and because we enjoyed the physical setting.\n\nAnother reviewer mentioned that the only credit card accepted at the Heights is AmEx, but - at least now - they also accept MC and Visa.", "author": "Susan L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-31", "description": "This place is reliable and satisfactory. I've been here a few times with my bro I visit in BK Heights, and this is the spot we always go to on Sunday Brunch. I get the Crabcake Sandwich for lunch and love every minute of it---and then regret it for the rest of the day for injecting my daily caloric intake in one albeit tasty sandwich.\n\nThe service here works, sometimes more times than others. One of the waitresses is really sweet and reliable but there are a couple that just kind of disappear a lot.\n\nThere is a pretty nice manager dude who is always there and seems to be helpful in keeping the place running efficiently. \n\nIf you go, get the crabcake breakfast sandwich though. It will make you smile.", "author": "Mark J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-31", "description": "They can call themselves a cafe all they want but make no mistake about it, Heights Cafe is a diner. So like all diners, the food is just barely edible but you appreciate it for the convenient location and for being open when everything else is closed.", "author": "Lana V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-16", "description": "A great place to eat at in Brooklyn Height. It i super close to the promenade, which makes it convenient and a perfect way to spend a Saturday night, without having to jump on the Subway.\n\nI really love sitting in the outside area. The inside area is OK, but the atmosphere outside is lively and full of good energy. \n\nThe service is 5 star. On every visit, we have always been looked after really well. The wait staff are very welcoming and attentive. Food service is also very quick, and efficient.\n\nThe food is also really good. I highly recommend the calamari, nachos, pizza and the NY Strip steak.\n\nWe will definitely ba back. A great local spot.", "author": "Markus H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-07", "description": "If you want to find a large spider in your food, then come here. Yes, there was a spider that was a good 3 inches long with legs at least 4 or so inches. The food is subpar both times I went. The best way I could describe is as a diner trying to be a lot more than that. They do talk advantage of the location. If this restaurant was just a block or two from montague on say, Remsen or Joralamon, it wouldn't be nearly as busy.\n\nI will never go to this place. I suggest Jack the Horse Tavern. It's only a 3-5 minute walk away. And it's much, much, much better.", "author": "Feed Me Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-23", "description": "Wow. For a cafe this place is really something. I'm in the neighborhood for jury duty and don't know it well. I expected decent food at a decent price but got something better. \n\nI had a jalapeño chicken noodle soup that was fantastic. Soup is such a boring part of a meal normally but this was really delicious. Then I also had a southwestern turkey wrap that was better than expected. They proved once again that you can never go wrong with adding avocado. \n\nAnd the service was prompt and pleasant. I would absolutely recommend this cafe for lunch.", "author": "Eric R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-11-05", "description": "Heights Cafe is an average restaurant in nearly every respect. \n\nExceptions include:  \n\n1. The server, who exhibited above-average grace in the face of my friend repeatedly and loudly insisting that there be no cumin in the mushroom gravy that accompanies the meatloaf. It's not as though he has an allergy, merely a feigned misconception about how that spice is pronounced. \n\n2. The location in beautiful Brooklyn Heights, with leaves turning and a post-dinner walk on the Promenade a foregone conclusion.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-30", "description": "Food: I can't speak for the rest of the menu, but my lobster ravioli tasted like cat food wrapped in wax.\nService: The server gave me a lot of water. Thanks, random man! The waitress gave me the stink eye. But, in her defense, I probably started it.\nAlcohol: $30 for a bottle of Malbec? At a restaurant? And it was delicious? Well, alrighty then!\n\nConclusion: Don't eat here, but feel free to get reckless with your liver... especially if someone else is paying.", "author": "Uyen N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-13", "description": "Great spot to stop off for brunch on your way to check out skyline views at the promenade. The atmosphere is spacious and comfy, and I'm pretty sure they have tables outside when it's warm. Service was attentive and friendly.\n\nOur meal started with a basket of delicious cinnamon bread. I ordered the sausage frittata which was delicious if not a bit overload. It was the size of a personal pizza, no joke. My date ordered the crab cake benedict burger. Crab was super fresh.\n\nOnly downside was that I realized upon viewing the bill that they charge for iced tea refills. Bummer. It always irks me when restaurants charge for refills on beverages that must cost them a few cents per glass. Despite this little tiff, prices are reasonable, food is yummy and I would still recommend it.", "author": "Elizabeth P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-03", "description": "Stopped at Heights Cafe after an afternoon around downtown Brooklyn for a late lunch (around 4pm). Glad this open-air cafe was available for our tired feet to rest, relax and enjoy food (that was better than expected). From past walks around the area I remembered Montague Street to be filled with a variety of restaurants and cute cozy places, unfortunately, besides the handful of fast food chains, dessert places and Asian food places there wasn't much of a selection.  Luckily we decided to walk one more block and found the Height Cafe. \n\nI didn't expect much from the menu and the place since it was our last resort for a place to eat. I ended up ordering the steak sandwich and was thrilled they asked how I wanted it cooked. I asked for it to be medium (just in case they overcooked it) and it was wonderful. The food came out piping hot, and the sandwich had some thick and juicy pieces of steak. Like literally they cooked a piece of steak to medium, rested a bit and sliced it into strips. It was delish. The onion rings were good, not overly battered and tasty. Bf ended up ordering the burger at medium wellness and it was nice and meaty. \n\nPros: Restaurant is right on the corner; light foot traffic, has a neighborhood feel to it (locals dinning) and a small groups  of tourist; close to the Promenade.", "author": "Angela N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-08", "description": "Heights Cafe is an old standby of mine in Brooklyn Heights. My four stars here really only apply to lunchtime as I've never been for dinner. Recently returned after a long hiatus and they did not disappoint. We took in a late lunch on black Friday. While I'm sure work wasn't a first choice for the restaurant staff that day, they were all delightful. Salads were crisp and fresh, cocktails better than average. Quesadilla special was OK but lacking in taste, needed some kind of flavor bomb, maybe the sweet caramelized onions they put in the fluffy omelets, or perhaps some chopped jalapeño. Either way, can't  wrong here, nice place, good service, and outdoor dining in the warmer times of year.", "author": "Ian K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-20", "description": "3.5 star rating... I come here 3-4 times a year, and have decided to move away from the omelette dishes off the brunch menu, and now order sandwiches (cuban, lobster roll, etc.) which never disappoint.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-20", "description": "Being the wine enthusiasts that we are, my gf and I don't enjoy our diner without good wine, whether we dine in or at a restaurant.  So having good wine is as important to us as having a good meal.  Well, Heights did not disappoint on both accounts. The service was very good and so was the food.  However, the wine selection was truly extraordinary!  First, I should mention that their wine list is not only diverse, but extremely informative (has ratings and tasting notes by well known critics), and very reasonably priced.  In fact,  their bottle list offers an unbelievable selection so we will definitely have to come back with another couple and share a bottle :)  We've dined here a couple of years ago and don't remember them having such nice wines.  Anyway, I had a nicely flavored \u0026 juicy Roasted chicken paired with the Edna Valley Cabernet,  which was true to the varietal - very tasty, well balanced and smooth. The gf had fish with the Prosecco (which was rated 90 by Wine Spectator) and loved both. We'll definitely be back for the bottle LOL!", "author": "Michael S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-11-23", "description": "My kids \u0026 I came here one friday evening after doing a little touring of the area. It was kinda reccommended by a friend. \n\nWe got seated quickly, out on the street. It was a nice late summer evening, so the warm summer breeze was nice! Waitress took our order quickly, drinks \u0026 food were delivered promptly. My kids tried some of the seafood \u0026 loved it! (They are VERY picky eaters.) I ordered a mushroom pasta dish (I forget the name of it), but it was OK. I was slightly disappointed with it, as I had misread the details...so I give my dish \"OK\". When I re-read the details of the dish, I thought, well the chef delivered exactly what it said..like I said..my own fault. \n\nWe lingered for a few minutes as we geared up for some more walking, waitress said no problem. As they began to get busy, we left. All in all, it was good evening here.", "author": "Cherie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-30", "description": "Fun and cozy little bistro, cafe that serves as a good little date spot for an intimate time. \n\nThe food was very good although I would try something different if I went back again.\n\nFor appetizers, the calamari was pretty dman good. Served with 3 different dipping sauces (red, aioli, and a mustardy thing) which I love. \n\nThe veggie/goat cheese quesadilla was also decent, a little rich though. \n\nI had a dinner special which was a blackened shrimp ravioli with mushrooms and peppers, topped with feta cheese.\n\nIt was good. The shrimp were blackened and seasoned well, but somehow the feta didn't mesh the best with everything else. \n\nThe service was polite but flat out unattentive besides the water boys. They never asked how our food was or anything of that nature but certainly made sure we drank enough water to cross the Sahara. \n\nI loved the lighting though, dark and intimate.", "author": "Bobby C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-27", "description": "Sign on the door today says it is closed for renovations. Windows are covered in brown paper.", "author": "Sheila R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-02-28", "description": "This place is not what it used to be. We used to order from here once a week, and now it's about 1 every 3 months. Now I remember why. Ordered a burger, it didn't come with a top of the bun, and no fries (which it comes with). When I called to tell them they forgot these things, I was met with attitude.  Nice.", "author": "Lisa B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-29", "description": "First of all, and most importantly, I'd like to point out that this place ONLY accepts American Express.  I think that's pretty ridiculous.  In any case, all credit card loyalties aside, Heights Cafe appears to be very popular.  The brunch menu looked appetizing and I decided to order the brunch strudel, which was basically an omelet wrapped up in filo dough.  In theory, this sounds pretty amazing, in reality, it was under-seasoned and the red pepper coulis didn't do much to compliment the strudel.  The flavor seemed almost too strong for something on the bland side.  My friends seemed to enjoy their food more than I did.  Service was fine.  Nothing to call home about.", "author": "Victoria K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-18", "description": "Food was awful, our waitress was nice, however after she took our order she disappeared, the old guy that brought us four cold pieces of bread and cold butter barely answered and or acknowledged us when we said thank you. Over all I would not returned to the restaurant even if I was paid.", "author": "Tania B."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Heights Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Gtqea5YJjWmv9-NRFz9eTQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186255555"}