{"aggregateRating": {"reviewCount": 287, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-06", "description": "ordered linguine shrimp campi, about 22 bucks (+ tips)\n\nlove the linguine, typical not too hard not too soft.\n\nshrimp was meaty but not jumbo :p\n\ngarlic and olive oil was there but the bread crumb on top overkill it.\n\n**\nwill i come back for more , absolutely, \ngreat vibe for couple, friends meetup, family gathering.", "author": "Grace N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-28", "description": "It's hard to enjoy a quiet lunch with crappy music pumped in way too loud. Someone finally requested some jazz (yay) and I thought I was saved until (I guess) they just changed to another crappy station. If I wanted Z100 I'd go to the gym.\n\nOkay, the music is SO bad, I'm going to 1 star. Now it's this moody euro-trash synth... kind of like you are trapped in a hip club in Russia.", "author": "Robert B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-12", "description": "Came early before the Mothers day crowd. When we came in the restaurant was only half empty but we had to ask one of the busboys to help us find our waitress. Adea came by with an annoyed attitude and took my order. She came by once and never smiles...does she want to be here? I think not.\n\nFood here is a little above average. They offer free bread basket.  Food presentation is always nice actually. I had the potato cauliflower soup, a little sour but not too bad with some salt. My egg Benedict with crab cake was pretty tasty. \n\nToo bad the service is terrible or will be visiting more often as it's in my neighborhood.", "author": "S.H. L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-02", "description": "It's truly sad that this neighborhood spot is such a disaster and a huge disappointment. It's never been a \"go-to\" of mine, but it's always a nice option due to the convenient location. \n\nI went here after wanting to meet a friend and bring my newborn out for a quick bite.. the afternoon lunch date turned into a true catastrophe which was only because the food was inedible and the staff is ridiculously out of touch. \n\nHad a turkey burger and sent it back after it tasted like metal. My friends burger tasted like bacon and meatloaf... on a bun. I then order a veggie burger after being terrified to eat the meat again and it was also a pile of mush that took 3x as long to come out?\n\nOn top of the food - the staff is A JOKE - our server disappeared and never came back to check on us. Then the two hostesses were on their phones the entire time we sat at our table.. taking selfies, talking.. then one more selfie...since they forgot they were at work, I guess? The entire staff acted like high schoolers after I asked for the manager and the hostess argued with me as I tried to explain my experience to the manager. \n\nIf you're a neighborhood newbie - pass on by this disaster and if you're a tourist you'd be better off going to Starbucks for some decent service. ‍", "author": "Lucy R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-30", "description": "The space and location merits 5 stars. But the food--average at best.\nI used to frequent Heights Café more often in the past since it has been in the same location for years and I always enjoyed my dining experiences.\n\nDoing some serious walking (17,000 steps to be exact) today on this glorious Spring like day, my friend and I were looking to grab a brunch bite (it turned out to be a belated birthday treat for me from my friend. Sweet). \nWe adore Brooklyn Heights and I thought a revisit to Heights Café was a good suggestion. With plenty of outdoor seating and a massive indoor space, we sat semi-outside or near the open window. The waitress was prompt and our order was taken minutes later. \n\nFood is standard American fare. For brunch, omelets, griddle options, salads and eggs Benedict summed it up. My friend and I both chose the artichoke, mushroom and mozzarella cheese frittata and requested salad in lieu of the home fries. Iced coffee accompanied our frittata (we had twin meals).\n\nService was attentive and food arrived shortly thereafter. The frittata was pretty good. Salad was skimpy. Overall, food was average/nothing memorable. But I would consider returning another time, possibly dining al fresco in the warmer weather.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-27", "description": "I'm always looking for more restaurants in Brooklyn Heights, but for some reason our culinary experiences just aren't that great. We ordered: \n- Beer $7\n- Crispy Calamari $15\n- Pappardelle $17\n- Heights Burger $17\n- Rigatoni $17\n\nEverything was fine. The calamari was large but a bit overbreaded. The pappardelle and rigatoni were pretty standard but a little bland. Overall, probably a good place to come for some bar food and to watch the game on one of the ten TVs, but not a destination if you are looking for good food.", "author": "Judy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-15", "description": "A surprise: a bit off-beat menu; a bit expensive for neighborhood, but pleasant location, attentive staff, and interesting menu. We had eggplant, tomato, and lentil soup (a bit under-seasoned), mushroom papardelle with chicken, cherry tomatoes,?and asparagus(unusual) and tres leches cake with coconut and stawberries (delicious). This is more a special event place rather than week-night too-lazy-to cook choice ( because of price!!).\nBet highly recommended.", "author": "Marty F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-10", "description": "This restaurant in Brooklyn Heights is two blocks from the Promenade. It is very popular during brunch and whenever the weather is warm enough to set up the sidewalk tables.  We come here regularly for a quiet weeknight dinner.  Besides the chicken dinner in the photo, I also eat the rigatoni often.", "author": "Corey B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-26", "description": "We came on a really cold Friday evening. It was not crowded so a table for two was readily available. The service was really good, everyone was really nice. The calamari was really tasty. The burgers were just okay. They were dry and could be better. The apple tart was really tasty too.", "author": "Fenn N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-22", "description": "Very cozy restaurant in a picturesque Brooklyn area. You can enjoy both food and view, since this place has big glass walls. Of course everyone who walks by , also enjoys the view of you eating.lol. We've been there in winter, and it's really warm inside. Staff is friendly. Food is tasty. If you're in the area for sightseeing definitely include this place to your itinerary.", "author": "Luolin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-09", "description": "I would not suggest ordering any meat here. The chicken was cheap and unchewable. I tried multiple different pieces and had to spit them all out. Same quality chicken you would get at a halal stand. Not what you expect at a restaurant in Brooklyn Heights. Shame.", "author": "Maria R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-28", "description": "3 1/2 stars is what I'd really give it.  The food (sandwiches, salads, paninis etc.) are just fine. Nothing exceptional. The pizza however is quite good.  But overall, nothing exception so I'd give the food a 3 stars but I'd four stars for the vibe, the outdoor seating and its location.", "author": "Hao W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-26", "description": "Decent place to eat. Tommy the bartender served up some cold drinks for us.  Being quite frank,  the food is good but not great.  I had a chicken sandwich with French fries. Pretty decent.   I would definitely go back and try some other dishes.  \n\nFor ambiance and environment this is a nice spot.   Near the Brooklyn Promenade you have nice nearby views and the inside is nice and quaint.   Check em out.", "author": "Stacy F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-12", "description": "This is a warm and welcoming restaurant, especially when it's cold outside!  The booths are plush and comfortable.  The waitstaff is attentive and friendly.\n\nThere is something to be said when a place goes out of their way to accommodate people with food allergies.  They did just this and without complaining or saying no.  So thank you for that.\n\nThe waiter we had was kind and ensured we had everything and was willing to fix anything if it was incorrect or not perfect.  He also went out of his way to surprise the special bday girl with a creme brûlée with a candle!  You sir are the epitome of outstanding customer service!", "author": "Jennifer P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-18", "description": "Great spot to meet some very nice people. Food is good, but a bit pricey.  George is one great bartender. Way to many stroller people. Really a nuisance,  but not the restaurant's fault.  Last night there was some guy sitting at the bar with his kid in the stroller,  blocking everyone while he was drinking scotch.  Really?", "author": "Adventurous P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-14", "description": "I just ate the Blackened Chicken Sandwich and I already can't wait to come back and have it again. The food was DELICIOUS, the service was great, and the atmosphere was very clean and welcoming.", "author": "ToniAnn M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-01", "description": "My husband and I went for brunch one morning. We saw the reviews but thought that it was kind of like the diners in New York- not rated really well but actually good. Well our experience wasn't that great. We were the only ones in the restaurant but our food took a long time to come out. The food wasn't that great. It was ok. I got the special omelette that was supposed to be sausage, peppers, and onions. There was a lot of egg and onion and very little pepper or sausage. We shared pancakes too and they were ok. It tasted like they used frozen blueberries in them. We then waited a long time to try to signal our server down to get our bill.  It's unfortunate that it's not a better place as it is in a great location and a cute place.", "author": "Bailey A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-22", "description": "Went in for a glass of wine and winded up ordering food. Say at the bar - bartender Alex was a gem who made me feel super comfortable. Her service was amazing and some of the rest of the staff seemed friendly as well. Spacious place with outdoor seating. \nThe burger and fries were good - not the best burger, but I finished it. I ordered it medium and it came out medium rare. Nobody died though. I would return when I'm back in the area", "author": "Wesleyan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-01", "description": "Great food and amazing service. Love coming here for brunch!", "author": "Anna L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-21", "description": "I love this neighborhood spot. It is not fancy in the slightest, and it is consistent in every way possible. Servers are polite and nice, food comes out fast, and the food is good! Nothing to complain about.\n\nFood: I alternate between getting their Caesar Salad or their Cheeseburger. First off, their cheeseburgers are so dang good. I actually think it is one of my favorites in all of NYC, and that's saying a lot. Their burger patties are thick and juicy, and without fail a trail of grease will run down my hand (a good sign for a great burger). You can choose what kind of cheese to put atop your burger, and they have delicious caramelized onions you can add too. The fries that come with it are delicious as well, and you can ask for them to be extra crispy if you'd like. A Caesar salad is as standard as they come, and if you ever get a bad one, it must be really bad. I like the Heights Cafe's salad because it comes with anchovies, and I either get salmon or chicken to go on top, and sub out the Caesar dressing for a balsamic vinaigrette. \n\nService: Good attentive and fast service. They always give you a bread basket to start. \n\nAmbience: Hip but casual at the same time. Not a distinguished spot at all with very little \"character\" but is a good local/neighborhood restaurant for when you want to eat out but don't want to go out of pocket from Friend of a Farmers, but don't want to eat at Five Guys.\n\nTip: Sit outside during the summer!", "author": "Jin C."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Heights Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Gtqea5YJjWmv9-NRFz9eTQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186255555"}