{"aggregateRating": {"reviewCount": 287, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-02", "description": "Pros: Food, service, quality.\nCons: Ain't got one.\n\nI called in for a group of ~15 and they were more than accommodating.\nWe were greeted by the cute servers, sat our already made tables, and shortly after that, we got bread. I mean we got a ton of bread, fresh bread (butter rolls and rosemary bread - go for the rosemary bread, thank me later). We ordered calamari and nachos chips w/spinach dip.\nThe calamari was lightly battered and came with a chipotle marinara sauce which went deliciously with it. The nachos w/spinach dip was great as well. You can tell they made both the chips and dip in-house. Fresh and flavor and not too cheesy. I ordered the shrimp linguini which was crazy delicious. A generous amount of juicy jumbo shrimps! You don't usually get a good helping of jumbo shrimp for lunch, especially in a linguini. I f's with shrimps so believe me. The linguini was cooked perfectly with bread crumbs and leafy garnish. It wasn't dry, there was a taste of a squeezed lemon and maybe olive oil, but w.e it was tasty. It was a good amount of food.  This is the 3rd time I been here and with large groups and never was disappointed. Always god food and service at Heights.", "author": "Karim A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-21", "description": "A great location just beside the spectacular (especially at night) Brooklyn Promenade, the Heights cafe is a very friendly and comfortable local restaurant. Being with family, including a baby in a stroller, we were shown to a table with plenty of space to accommodate said stroller. Clearly the staff are well used to family groups such as ours. We came for brunch first thing on Sunday morning just as they opened. Different members of the group had spinach omelettes, waffles and avocado toast with, variously, bacon or fresh fruit on the side, all eaten to much acclaim. I had their take on huevos rancheros which, I have to say, were pretty good although I was less than taken with what tasted like crisp bread on the side. Lashings of coffee and juice completed an all round positive experience  warranting a repeat visit in the future.", "author": "David F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-01", "description": "Updating my review after having brunch here. Mediocre at best. I had the omelet special which came with a side salad. The salad was just a few pieces of lettuce with dressing. Our other meal was the same, just ok. A side of FF came with that omelette and there were probably 15 little fries. At $15 a pop, I won't return.", "author": "V M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-03", "description": "Fantastic food and even better service. Loved every minute of our dining experience. A must if you're in the area!", "author": "Joe G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-29", "description": "Very good ambiance. The food is very good, not extraordinary but very good. They have great deserts! Felt a little rushed at times but otherwise service was quite attentive and well timed. I don't like to give out five stars right away, so I gave it 4 stars instead and would have given it 4.5 stars if possible. I recommended if you're in the neighborhood and I will return.", "author": "Vinny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "Great spot in bk heights. Super low key and food is awesome. Got the salmon w veggies and it was cooked to perfection. Our waitress was super nice too. Def would return.", "author": "Cait M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-17", "description": "Excellent Saturday brunch! We both came here quite hungry and after exploring literally every menu on Monteque Street. The space itself was very inviting and open. It was extremely hot outside so we weren't interested in the great outdoors in the heat, which turned out to be a wise decision since it started to downpour. \n The menu for brunch had so many options which can almost be tedious when you are really hungry. The non-brunch menu looked really interesting as well but it was already 2 pm and we hadn't had a bite all day and face it, breakfast is good almost any time of day. I decided on the artichoke fritatta which included mushrooms and mozzarella and a side of greens and extra side of crisp bacon.  DELICIOUS! \n  Our server was so sweet and attentive. We had typical brunch cocktails, bloody Mary  ( made extremely well I might add) and my pal had a bellini. We will go back for an outdoor dinner for sure when it cools down. This is a wonderful find.", "author": "Lorraine D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-17", "description": "Nice place but very bad service. After being seated with lunch menu, they pulled them out after just 5 minutes and we decided on a lunch only item. The waitress was very rude and made not the slightest effort to accommodate to our choice. Since it was only 5 minutes after lunch menu I made a snarky comment of the restaurant taken all lunch ingredients out until next day. The waitress reply \" yeah that how we are in New York\".  She then proceeded to ignore me (party of 4) for ordering. I'm sure this person has no pride or sense of ownership to work with customers. Sad!", "author": "Luis M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-03", "description": "I love this place. I've been coming for years with my family every weekend. Consistently great food, kid friendly, and a really nice staff. And the location can't be beat, especially sitting outside during summers. It's the first restaurant my father-in-law wants to eat at when he visits.\n\nI also get the feeling they treat their employees well. The staff has been pretty consistent through the years and always seems happy.", "author": "Elizabeth R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-01", "description": "Love this neighborhood spot! \n\nIt's the perfect blend of casual and classy, has great food, great service, and a great crowd. It's always filled with locals but is the perfect place for those exploring the neighborhood to drop by. I'd recommend every time.", "author": "Mathew S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-03", "description": "I live less than a block away and eat out a couple times a week but very seldom go to the Heights Cafe.\nAs remembered, the place is attractive and the food is fine but the service is still just not welcoming, not even for having a meal at the bar.", "author": "Mark H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-07", "description": "Set in a prime location, Heights Cafe was the common sense answer to where are we eating after coming from the promenade. Service is quick - we were greeted and seated within minutes. \n\nI ordered the lobster and shrimp mac and cheese. I could easily see myself taking this dish to go. It was filled with huge chucks of real lobster. My dish only had two shrimp. I'm not sure if that was the standard (my best guess) or it was the luck of the draw, but with the amount of lobster served in the dish, I'm not exactly complaining. As opposed to the regular mac and cheese, the lobster and crab is served with a cognac cream sauce. I've never had the regular to compare, but I didn't taste anything uncharacteristic of regular mac and cheese.\n\nMy boyfriend had the salmon burger, which he didn't finish. I didn't have a taste myself, but it seemed dry and unremarkable. The salmon burger came with a salad that I ended up eating and complemented ny pasta well.\n\nI was a little buzzed from the glass of wine, and made a mistake ordering the wrong wine, but our waitress remembered what I had and sent me what I meant to order. \n\nThe reason I give three stars is because there was something missing. We've been going to a lot of great places lately and our meals here, while meeting expectations, lacked a certain wow factor. Like I said, I'd definitely order a dish to go, but it's not high on the list of places to revisit.", "author": "Julie L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-08-30", "description": "Overpriced food, subpar service. Lobster Mac and Cheese was one claws worth of meat with store-bought pasta topped with Trader Joe's cheese blend and was thrown in the microwave for 10 minutes on high.", "author": "Ulysses M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-21", "description": "We've been frequenting this place for years for their  good food and service. There's a bar, bit this is primarily a classy restaurant with moderate prices. I recommend it.", "author": "James O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-28", "description": "Great location in a terrific neighborhood, too bad this place is such a fail. We had to wait 10min+ for our waiter, didn't get all of our drinks, got the wrong food, and those who got the right food got cold food. \n\nThe only nice part was that the manager came and apologized at the end, but isn't he supposed to? \n\nSkip it.", "author": "Drew B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-05", "description": "No complaints about this place. The locations is so nice because it's only two blocks away from the Brooklyn Promenade so you can get a great view after having a great meal. Service is efficient and the food is delicious. A bit on the pricier side but it's worth it.", "author": "Gabriella C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-27", "description": "I used to live in Bklyn Heights and back in the day this Cafe was the place to go especially in the summer: eating outside was the place to be and be seen. So today I was meeting 3 friends for brunch and a movie. 2 of my friends live in the Heights and suggested we eat here due to the proximity of the Regal Court Street Theatre. I must admit I perused the Yelp reviews of the Cafe to get up to speed on how well this Cafe has held up over the years.\nI really wanted to disbelieve it but sadly most were accurate.\nThe decor has held up but the service and food have not. One of my friends ordered the breakfast burrito special: bacon undercooked. My other friend ordered the chicken salad with avocados. I think she counted 1 sliver of avocado \u0026  asked for more avocado and was told it is an extra $3!. My other friend ordered the French toast and liked it. I ordered the Thai chicken salad with peanut dressing which surprisingly was tasty ( if u want a better version of this rush to Cheesecake Factory for the same price of $16.95 you get epic portions which I always take half home. I feel like Elaine from Seinfeld \" do they serve a big salad?\") But I digress! I had to order extra dressing on side due to a drizzle of peanut dressing on my salad.\nThe service is slowwwww which is a disconnect due to being opened on Easter Sunday the cafe should have been prepared for a busy day.\nThe menu is comprehensive: fish, burgers, pasta etc.\nIf you want a dining experience that is slow and have 2 hours to spend sitting this is your place.\nNext time my choice is Carroll Gardens where the eateries are hipper and have a wider variety of cuisine choices.\nMontague Street needs a much better selection of places to dine especially due to the proximity to the Promenade.", "author": "Fawn G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "I stopped in Heights Cafe on my way to Brooklyn Bridge Park. My husband and I ordered the Mediterranean board to start and it was delicious! The hummus and pita tasted super fresh. For entrees I ordered the heights burger and my husband had the southern fried chicken. Both dishes were great. Super tasty food and friendly staff. Overall it's a great neighborhood staple and I'll definitely be back!", "author": "Alexa R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-04", "description": "Overpriced and service was bad to the point it felt degrading. \n\nFirst, we did see the price and did not come in expecting cheap dishes. Neither did we expect fancy dishes because it's a \"cafe\". We ordered the mushroom pappardelle, salmon burger and lobster roll. The first two: not bad. The lobster roll, on the other hand, is priced about $18; it comes out with 2/3 plate of potato chips, a little coleslaw and a tiny lobster sandwich that is just slightly bigger than my fist. The bread is not particularly special either. I guess it was nice how the lobster was served in actual chunks, and that may justify a bit of the price. But honestly, it didn't feel good when the dish was brought, especially knowing it cost close to $20.\n\nI'd like to give the benefit of the doubt; however, my experience was not tainted by one possible mistake but several. And while I don't like to usually attribute it to racism, it felt like it. All other tables who were non-Asian seemed to be served much better than ours. My family and I walk into this cafe. (1) While it's possible that the waiter just wanted to give us a booth, there were many nicer, brighter seats by the window. We were given a seat right next to the restroom. Ok, let's say we let that slip. (2) We're a table of three. The busboy comes over, and for some reason takes away two sets of cutlery and plates. We think he'll bring one back but until after we've ordered he doesn't. He's hanging out literally right by our table the whole time, but doesn't notice at all. We finally ask for a set, but rather than a proper cloth napkin that matches the other sets, we're given a flimsy paper napkin and no plate.  (3) I walk over to the bathroom, and notice a family is being seated. They receive a bread basket immediately. I think maybe they forgot. So I wait back at the table. The food comes. No bread basket. So I ask for it, and finally we get one. We didn't walk into this place expecting superb service, but it particular spoiled our experience when we noticed other tables were being served better. We had to ask for most things once we noticed some things missing.", "author": "Jung Joo K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-01-07", "description": "The defining feature of this restaurant is its location. Mainly because it was there when I needed it. I had a soup that was good and my friend had a yogurt that was also good. The bartender was ok, the decor was oddly fake and dated. The crowd was also a very odd mix. I am not sure what this place was trying to go for but it definitely missed my mark.\n\nIt was perfectly acceptable but I was not go back unless I was stuck in the area and needed some soup ASAP.", "author": "Andrew B."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Heights Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Gtqea5YJjWmv9-NRFz9eTQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186255555"}