{"aggregateRating": {"reviewCount": 287, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-28", "description": "Brooklyn Heights is a great place to live, except everything costs the world and the food sucks. \n\nHeights Cafe is a prime example, where there's food that would be considered tired in 1993 on the Upper East Side is brought with a side of mild incompetence. There were several mix-ups with the beer selection, with the additionally auditory complaining to other members of the waitstaff. \n\nI knew coming here that I wasn't going to get the most innovative fare. But there are dozens of places in borough that show that American comfort food can be done right. Here it's a heavy, overcooked burger and mushy fries.\n\nFor the rents paid by the business and the clientele, management needs to offer something more. I advice walking into Carroll Gardens or up to DUMBO for a decent meal.", "author": "Jon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-12", "description": "Really solid food (omelets, chili, calamari, and roasted veggie \u0026 goat chese sandwich are among my favorites), great for lunch on a patio. A bit pricey though ($2 for BBQ sauce - really?). They do have a decent (and not as pricey as you'd guess) drink menu, though! And the bread basket is delicious. \n\nA very nice find in the Brooklyn Heights neighborhood on a charming street. Outdoor seating is great for spring/summer/fall. Service is hit or miss speed-wise.", "author": "Meg M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-28", "description": "it was cold and we had the kids with us and ducked in out of necessity.  Its bad enough to serve old coffee cold, but when I said so, she just gave me old coffee, but microwaved.  That just makes me mad.  Servers were nice enough otherwise and the food wasn't awful, but this place could really try harder, especially given the other choices we could have made in this neighborhood.  I certainly wouldn't go back.", "author": "Mark G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-03", "description": "This has been our go-to spot for brunch, lunch or an easy dinner since we moved to Brooklyn.  We havent yet tried anything from the menu we don't like.  The drink selections are good and the service always great.\n\nThe ambience is just loud enough that you know you are in a public place but you speak in a normal voice.  Usually there is no wait.\n\nMy wife loves the bread they put out on the table.", "author": "Matt M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-24", "description": "The first time I came here was great: the shrimp linguine was one of the nicest I've ever tasted. The second time was very disappointing. The food was salty with no flavour. There are too many good restaurants in the area to get away with such bland food.", "author": "Stephanie T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-26", "description": "It's a good spot to check out in the neighborhood. I stopped in with the family after seeing a movie at the Court St. movie theater. Didn't feel like fast food or a chain restaurant so we opted for the diner for some kitchen food. The service was great and wait staff very accommodating. I enjoyed my food choice: lobster \u0026 shrimp mac n cheese. While my family enjoyed their selections as well. I would have liked some more seafood in my mac n cheese, felt like I was eating a regular pasta dish. But it was good for what it was. My mom enjoyed her salmon platter but felt the size was a bit small for the price. But hey for a diner in Brooklyn Heights with very little wait time, outdoor dining, and a nice ambiance it wasn't a bad experience.", "author": "Vanessa K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-24", "description": "Had dinner here tonight and enjoyed it very much. \n\nMy fiancé and I were visiting his great uncle who has an apartment down the block. He spoke very highly of this place and insisted we have dinner there and after a quick peak at the menu I couldn't say no.\n\nWe were seated right away around 6pm. The windows were open wide and there was plenty of seating outside. Due to the rain, despite the rather large awning, we decided to sit inside. \n\nWithin the blink of an eye our water glasses were filled. Our waitress awkwardly stood around as we made small talk while browsing the menu. She probably should have walked away but stayed and asked if we were ready which we clearly weren't. Eventually we were ready to order but she was clearly unaware of the menu which was strange. I ordered the scallops (the only ones on the menu) and she asked which scallops. Odd.\n\nWhen our food arrived plates were put down incorrectly. Literally every plate was put in the wrong spot. Not good at all. But the food did look good. And, it was! My fiancé loved his NY strip steak cooked very rare with shallot butter and fries. He ate the entire plate. It was also reasonably priced considering the size and quality. His great uncle really enjoyed the blackened chicken. Smelled so good! As for me, my scallops were perfectly cooked. I enjoyed the accompaniments as well. I wish the plate of food was hotter but I finished the entire thing so I guess I can't complain to much.\n\nThe server needs a little help but other than that a great meal in a great neighborhood.", "author": "Shira F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-17", "description": "Most of what this place has going for it is the location. Super cute spot, and lots of outdoor seating.\nThat said, when we went there weren't many people and still we had to wait more time than you would expect when the place is empty. Didn't feel too warm or friendly.\nFood was ok, meh.\nDefinitely pricier than I would have expected given the quality and the chill vibe it has.\nToo bad, I waited a long time to try this place and I'm really not sure if/when I'll be back. As I said, the location is quite appealing!", "author": "Ilaria T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-07", "description": "Nice location for a dinner.  The place was busy but not crowded.  We have seated right away.  \nRoom atmosphere and service are just what you would expect of something you could see as a local - friendly, attentive and not over polished.\nWould come back for sure.", "author": "Alex R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-18", "description": "Had the lobster mac for $20. Sucks. Lobster might be real, but real....frozen and tough. Halfway through service, a server drug a huge plant from outside, through the bar area and into the kitchen. Super disgusting. Wont ever be back.", "author": "Jeremy Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-20", "description": "Loved the atmosphere and the vibes of this cute cafe!Lily the bartender was very sweet and amazingly helpful when I found myself sight seeing alone.Had the chicken sandwich and chicken with mashed potatoes and green beans for dinner, very tasty and juicy!Even helpful with the train directions and company since I came back to watch the football game and for dinner!Lily you rock thank youuuuuu from California.", "author": "Melissa Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-05", "description": "Heights Cafe seems to be a fairly popular joint in my neighborhood, so plenty of folks must like it. Although it's not in my top 10 favorite dining spots in Brooklyn, I like the place and will definitely make return trips--especially if I'm not in the mood to travel very far and am looking for some American style grub that's a step above diner food.\n\nHeights Cafe's menu features steaks, gourmet personal pizzas, burgers, sandwiches, etc. They also offer Sunday brunch with breakfast favorites like omelets, pancakes, etc. In fact, my most recent visit was for brunch, and I ordered their Crabcake Breakfast Sandwich, which included both a crabcake AND grill ham, a fried egg, tomato, and hollandaise sauce served between a sliced English Muffin. Tasty indeed!!! Fries were served on the side, and these were tasty as well. To be honest, I looked around at other folks' plates and was glad that I ordered what I ordered--other breakfast options I observed didn't appear nearly as plentiful as what I ordered... but, remember, I'm a size queen... so, I'm typically disappointed if I order an entreé that ends up being on the small size.\n\nAs for atmosphere, Heights Cafe features has more of an upscale cafe feel inside, but it's definitely a relatively casual place. During warm months they also offer sidewalk dining, which can be nice.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-23", "description": "With the closure of Siggy's on Henry St., I lost my neighborhood standby. It was really disappointing, because the food at Siggy's was hugely better than everything else around.  Now I go to Heights Cafe instead.  I'm not saying Heights Cafe is the equal of Siggy's.  But I am saying that I feel comfortable bringing friends here for brunch, lunch or dinner, knowing that with such an extensive menu we will all find something good to eat (and drink) and we'll all be happy. For instance, I've had their delicious Nicoise salad and my companion really enjoyed a frittata that was so big she took half of it home.\n\nAnother difference between Heights Cafe and the late great Siggy's is that Siggy's was a hippie joint with cramped quarters and little wooden tables where the specialty was healthy smoothies. Heights Cafe on the other hand has a more upscale vibe and makes a mean martini.\n\nHere on Yelp I'm reading complaints about everything from food to service, but I can honestly say that my experiences have been the opposite. Service has been consistently friendly and solicitous. My experience regarding service everywhere is that we get what we give, and not treating the server like your personal slave is always a good idea. Just sayin'.\n\nMontague St. is not the food mecca it ought to be, and Heights Cafe is not a 5-star restaurant.  But it is a very good 4-star restaurant and I'm sure I'll be back.", "author": "Pandora B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-21", "description": "I must have lucked out, as I don't get the 2 star reviews...that's just me.  Showed up on an early afternoon on the weekend, and brunch menu was still in effect.  I will say I was a little concerned by the fact that the place was half full, but was with others who had been and enjoyed the place.  One of the benefits of a half-full restaurant:  hostess asked us if we wanted a booth or a table.  \n\nOnce we were seated, a basket of bread and breadsticks showed up.  There was some crusty raisin bread included which definitely hit the spot while we looked over the menu.  The brunch menu had a good combination of hearty breakfast foods (lots of egg-based options as well as french toast) in conjunction with salads and sandwiches.  \n\nI ended up going with the poached eggs, which were nestled on top of corn waffles and  pulled pork.  The eggs were topped with a salsa verde.  A very interesting riff on eggs benedict.  I thoroughly enjoyed it and found it to be just the right amount of food.  Another diner enjoyed the turkey cobb salad, which is definitely larger than appetizer size (IMO) as it is listed on the menu.  \n\nPrices were fair, the server was friendly, and food came out in a reasonable period of time.  I'd come back for sure.", "author": "Danielle F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "I've eaten here a couple of times, and from a simple coffee to lunch fare, it's never disappointed. Friendly, prompt service, delicious food and fresh ingredients. Will definitely be back.", "author": "Jade H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-29", "description": "My husband and I come here regularly now. I think they have changed their menu within the past couple of years and their food and drinks are spot on now! Try the Turkey burger- probably the best turkey burger I've had! Their peach martini is also very delicious! Happy it's part of the neighborhood.", "author": "Saddia P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-22", "description": "Was in the neighborhood craving a burger! The burger here is hefty,  and made pretty well with the onion,  tomato,  and lettuce on the side (smart doesn't get the bun soggy or Wilt the veggies) I had sweet potato fries instead of reGular and was ridiculously full at the end.  The WHOLE experience I'd say was pretty average,  I did like the size of this monster,  took care of that craving but wasn't so delicious that I'd be back.", "author": "Sadia H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-23", "description": "Eh....... Got the lobster Mac and cheese, not a good decision. Bland, 2 whole pieces of lobster, and oh dud I mention bland? Adding grated cheese and red pepper did not help.\n Kind of pricey for the quality of food.\n Service was nice, French fries were French fries.\n\nI miss the old diner that used to be here.\nI would have given it one star but the busboy kept my water filled so I had that going for me", "author": "Michael L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-28", "description": "Great location for lunch after visiting this cute neighborhood. It is a little walk from the park, but we did the walk. \nThey have outdoor sitting which make it a great place if it is a sunny day.  I had the salmon burger which was good, but not amazing. Just like everything they offer here. Everything is good.\nFor my personal opinion, their prices are but high, but it is up to you if you are willing to pay it. \nCute neighborhood location.", "author": "Yona L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-25", "description": "Friendly, accommodating staff. \n\nGreat burger (no fries, delicious spinach instead). \n\nBLT stack was good. \n\nComfortable location.", "author": "D M."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Heights Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Gtqea5YJjWmv9-NRFz9eTQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186255555"}