{"aggregateRating": {"reviewCount": 287, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-18", "description": "Lovely spot despite mediocre food.  I understand this isnt a Mexican restaurant.. Hindsight 20-20.  That being said, avoid the fish tacos.  They were horrendous.  It tasted like a frozen chicken (despite being fish) finger in flour tortilla with pre-made frozen guacamole.  Margaritas were okay minus the lack of limes?  Who  serves a margarita without a lime.  Right, not a Mexican restaurant.  I would return though for the lovely outdoor space and beet salad.", "author": "Kara A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-30", "description": "I don't even know why I'm giving this place 2 stars, but lets say because I haven't tried their bar area. After dining in tonight at Heights Cafe I was very surprised how this place is still in business. Lets start from the beginning. The staff is decent, not very nice, but can't say that they were rude - not very attentive. We ordered a fried calamari appetizer, and mostly tasted only calamari flavored breading. I decided to go with a Mixed Green salad and added a grilled chicken to it. Lettuce was obviously not very fresh, brown in some spots, but it wasn't the biggest problem. My chicken tasted like 3 days old, super dry, and almost impossible to cut through pieces. After tasting just one little bite, I moved it all to the side of the plate and never touched it again. Usually I don't like to complain at the restaurants due to my over 5 years experience in restaurant business, but expected the server to ask if it was anything wrong with my meal, since I almost didn't touch it. Instead, they just took our plates and asked if we want anything else. At this point, I decided not to say anything and let it pass. We took our bill, payed, and will never come back.", "author": "Kamila S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-08", "description": "As someone else mentioned, this place is in a great location and it is reliable- I used to come here for brunch often but to be honest the food is just so-so.  Think diner food with small additions...it is cute and because its a decent place in the hood it gets quite full, especially during weekend brunch- but you will not get that amazing meal here.", "author": "Caterina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "Great food, okay service. Delicious tilapia wrap, I now get it a couple of times a month. Quick delivery in the area, too. Worth a visit.", "author": "Nataliya S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-13", "description": "Soft, flaccid, dull-  nothing crispy, smart or sparkling.  Tried the peach-papaya soup: tasted like melted ice cream. The eggs lacked punch. The home fries seemed to be boiled potatoes with yellow powder seasoning on them. Nothing to recommend here....There was outdoor seating and the weather was nice....", "author": "david a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-29", "description": "I have been eating here for over 20 years...Quality of food \u0026 service is great !!!!\nIt's a great place to bring a group of people because there is something for everyone one the menu.  It is my favorite Brooklyn Heights restaurant.\n\nHelene", "author": "Helene S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-22", "description": "A nice spot for brunch, the service was very attentive. and friendly.   The food is quite good, but nothing exceptional. My BF had the poached eggs and found them good, I had the veggie burger which was good but nothing that memorable to come back for and order again.", "author": "Tara K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-12", "description": "What is all the hoopla about? O yea and NeVeR Ever ever get their risotto.    Service was good though", "author": "Jerome G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-14", "description": "Deep fried crab cakes?  Soggy fries. Wait staff too busy chatting to pay attention to customers. Outdoor seating is its one plus.", "author": "Hal B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-03", "description": "Came here on a nice out after taking a walk by the promenade.  We walked in and waited for one of the girls at the front to realize we would like a table.  We chose to sit outside since it was cool and not too hot but it was a table in a very dark corner in front of the closed store next to the restaurant.  It was really difficult to see our menus or food once we got it; I would suggest small candles or the flame less candles (to prevent any accidents).   We were very hungry so we enjoyed the  bread basket provided; the garlic bread was a little salty but the butter mellowed out the saltiness.  We started with the chicken skewers with tandoori peanut dipping sauce.  The skewers were good; a little charred but it was okay.  \n\nMy husband ordered the salmon burger and I got the pan-roasted chicken.  My dish came with mashed potatoes, spinach with corn and shitake gravy.  The mashed potatoes were ridiculously salty; I could not eat it alone, I needed to mix with the corn for some sweetness.  The chicken was a little burnt on the outside; the meat was cooked and juicy but the skin was definitely burnt.  The spinach was not anything special, it was just a huge heap of spinach with not much flavor; I think they should have put less spinach in the dish and more of the delicious gravy.  My husband loved his salmon burger; it came with a mixed green salad, which I devoured since I wasn't too happy with my meal.  \n\nWe didn't try any of the drinks, neither of us were in the mood for alcohol so we just had water and the bus boys made sure our glasses were always full.  I don't have any complaints with our waitress; she constantly checked up on us.  Overall, it was an okay meal; don't know if we would return.", "author": "T G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-25", "description": "A delightful neighborhood cafe that gets an extra star for fabUlous coffee! Don't know if it was the water, the rarefied air of Brooklyn or simply well roasted coffee but it was SO very good! Nice to be in a place that was comfortable on a cold winter day. The interior was bright and pleasant and the staff efficient and attentive. Prices were on the higher side, but the food was quite good. We started with their soup special, cream cauliflower (I think) and it was delicious. Moved onto a grilled chicken sandwich for me and a salad for my partner. Both were well executed and quite good though nothing out of the ordinary.\n\nThis cafe is everything the chains are not and can never be! And the coffee.....yum!!!", "author": "David B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-21", "description": "At a glance it appears just another diner, on another corner in New York City. Yet unlike most New York diners that are either way too pretentious for their own good, or deliver substandard muck to the table, Heights Cafe is a happy middle road of down to earth attitude and consistent food.\n\nHad the calamari which was so soft in the middle and crisp on the outside. Judge a place by the quality of calamari I say - this dish is easy to cut corners on quality, by Heights pulled it off perfectly.\n\nRoom atmosphere and service are just what you would expect of something you could see as a local - friendly, attentive and not over polished.\n\nWould come back for sure.", "author": "Paul D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-18", "description": "I give this place an ok if that... The service was good, the place looked nice and clean but the food was not good. I had the worst mozzarella sandwich I ever had along with a pizza that tasted nothing like pizza... If it was my choice I would never eat there again..", "author": "Aimee M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-05-08", "description": "Dear Keith McNally, \nPlease take pity on the denizens of Brooklyn Heights and open a restaurant here. I have a suggestion in terms of real estate -- what about the malodorous Heights Cafe? I know, I know, it is packed with customers eager to sample the subpar airport food, but maybe if they could just experience a decent bistro they would come to appreciate non-airport tasting food. I know, I know, it's hard to imagine Brooklyn Heights without inspid overcooked Penne, or stringy, fishy seared tuna in a revolting sweet and sour sauce with mushy fried rice. Yes, we will be impoverished, but maybe in our deprived state you could offer us succor with properly cooked food, in a non-maladaptive environment -- could you? PLEASE? \nYours Sincerely, \nDavid A.", "author": "David A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-07-01", "description": "I've only eaten at the Heights Cafe once and it was years ago. It wasn't a bad experience like some people have had but it wasn't something that said, \"I need to go back.\" My meal was paid for by somebody's Dad or Aunt so I can't really complain about the price. I believe we were celebrating the new apartment of a college friend who had been living on my floor for two months so I was enjoying the idea of this celebration.\n\nHis Aunt lived in Brooklyn Heights for years and they thought this was the spot to entertain. I had the ravioli in a cream sauce with pine nuts. I believe it was a special and thought it was alright. The scene was very neighborhood spot and had a little ambiance that said romantic but I'd never go there for that. I do believe its proximity to the Promenade has helped this place out over the years.", "author": "carl g."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-03", "description": "wow im really surprised i haven't yelped this yet. This is kinda the restaurant i have grown up in since i was a kid - Its classy and chic yet casual\nits romantic but perfect for family outings and the food is amazing\nand the best part is u can sit outside in the summer", "author": "lauren c."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-02", "description": "Service was fine, food was terrible. why can't there be a good restaurant at this location?", "author": "A H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-23", "description": "Great location, food and service. I frequent this restaurant for brunch and it has yet to disappoint. The challa french toast is delicious. Definitely worth checking out!", "author": "Jared A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-04", "description": "The menu looks good, sounds good, and is not good.  I think they are just trying too hard to be different.  They would do better just being a quality diner.  The pizza place they just opened next door is equally underwhelming.", "author": "Scott C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-06-13", "description": "Nice location and good atmosphere for a sit down lunch.  The place was busy but not crowded.  We were seated right away.  Service was fine.\n\nI split an order of calamari with my friend as an appetizer.  It was a large order that was hot and crispy so no complaints there.  The calamari was very good.  I had the curried chicken sandwich.  It tasted fine but it didn't have as much spice as I hoped it would.\n\nA neighboring table ordered a sesame encrusted tuna that looked like it was cooked medium rare.  If coming back, I may have to try that.\n\nWhile there is a large variety of menu selections, nothing really stands out in terms of the food.  It's good but I wouldn't necessarily make a special trip unless I was in the neighborhood.  They do have a full bar.\n\nThe Brooklyn promenade is 2 blocks away.  On a nice sunny day, if you plan on just having a sandwich for lunch, you might be better off just stopping by a deli on the same block.  You can sit on a bench overlooking the water and Manhattan skyline.\n\nThis is a nice casual place for lunch.\n\nCheers!\nN", "author": "Nelson X."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Heights Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Gtqea5YJjWmv9-NRFz9eTQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186255555"}