{"aggregateRating": {"reviewCount": 287, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-08", "description": "Heights cafe is my kind of place always get treated well here, heights burger with fries really hits the spot along with a good bar they set up owners really have it down packed. The servers are awesome Connor, Angie, Radka, Lilly \u0026 Joe are at there incomparable best make the heights cafe what it is nobody on the block really does it better then them will be back soon.", "author": "Frankie K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-08", "description": "The first place I ate at in Brooklyn after my walk on the bridge. It happens to be one of our friends that lives in NY took us here for lunch. Heights Cafe is a home comforting cafe in a cute residential area. Luckily they were able to accommodate all 12 of us. You have an option to sit outside or inside. \n\nOn the menu they have a variety of brunch items. All of us ordered something different so we can try a bite of each others. I took the pleasure of ordering the Smoked Salmon - on seven-grain bread with lemon caper mayo, tomato, red onion and cucumber. The outcome? Yum. I also enjoyed a bite of the Brioche French Toast with pear raisin compote. Overall a great place to have brunch at or to enjoy a cup of coffee.", "author": "Kathy V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-15", "description": "Good:  laphroaig on the self.\n\nBad:  worst ceasar salad I've had to go.  Ever.  Zero effort.  \n\nSorry but your place is uninspired, generic and boring.  At least make a decent ceasar.", "author": "peter c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-13", "description": "Great location for outdoor eating/drinking on a warm summer day.  A quick walk from the promenade or Brooklyn Bridge Park and the street is quiet enough.\n\nI had the salmon burger and my friend had the turkey burger.  Both were yummy.  Nothing spectacular, but a great meal for the price.\n\nMy only real problem was that the service was very hit-or-miss.  In fact, the bus boy was way more attentive than our two main waiters.  The first seemed a little bit snobby when we told her about our dietary restrictions (dairy free).  The second waiter was continually nowhere to be found when we were ready to order more drinks or pay the bill.\n\nHowever, I would still give it another shot since my interactions with the rest of the staff were all pleasant.", "author": "Danielle H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-28", "description": "GREAT fresh salmon burger!\nThank you for using fresh salmon and making your own burgers :-)\nLove the floor-to-ceilling windows!\nCheerful \u0026 efficient staff :-)", "author": "Edward A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-27", "description": "Basic menu. Basic restaurant. Really more diner like without the booths that you are used to seeing at diners. I came here for Sunday lunch with around 6 friends. We were quickly seated. The menu is one which allows everyone to find something that they like- this is difficult when you are trying to make 6 people happy. At the same time, there's not much in the area of excitement on this menu either. \n\nThe have a full bar, so if you require mimosas instinctively because the calendar tells you that it's Sunday like me, then this will make you happy as well. I ordered steak and eggs. Decent enough. I'd come back if passing by.", "author": "Nyota W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-14", "description": "I wanted to like this place more. I live in the area and I'm in the market for a new go-to brunch spot, and sadly, this wasn't a winner for me. This place is just okay. For what you're paying for, the quality of the food reminds me what I would've been served had I chosen to eat at a cheap 24-hour diner. I believe I read that a side of fruit was over $6?! No thanks. \n\nThe two stars are for the service. Our server was very sweet.", "author": "Adriane C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-12", "description": "Food was alright, service was.............interesting. After having a really epic failure of a morning the boyf and I decided to hang out in Brooklyn Heights and get some brunch. We were supposed to go on a day trip out of the city and missed our bus due to the MTA sucking, blah blah blah, but I digress.  Heights Cafe came highly recommended by a co-worker so we stopped by and the outdoor space looked promising, as well as the huge bar indoors. We sit down and I ask the server if I could get a bloody mary, you know to drown the sorrows of being stuck in Brooklyn for the day. The server replies \"Sorry, we don't serve alcohol until 12!\" I look at her and I'm like \"Man bummer, I really wanted a drink. What time is it now?\" And she goes \"Lol, I don't know the time I'm stuck at work all day!\" WTF kind of response is that? \n\nAnywho, we sit for a while and the food came out and it was mediocre at best. I would have enjoyed my dry frittata a lot better if I had some booze to soak it up in. The mac and cheese was a lot better, I probably should have ordered that. We pay the bill and the change we get back is larger bills instead of ones....another -_- moment. It was then I also noticed some customers having wine and mimosas and it was only 11:40 AM, which really irked me. Overall, Heights Cafe was a serious disappointment and I probably will not return.", "author": "Adina F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-04", "description": "Nice ambiance. The bar area was pleasant to sit in and the TVs weren't obnoxious. My lunch partner got the Butternut Squash and Sweet Potato soup which they devoured happily. I got the granola topped with greek yogurt, banana and berries. It was a really nice portion and very tasty and refreshing. The Granola has a cinnamon sugar sweetness to it. I'd certainly eat there again!", "author": "Leah W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-27", "description": "Delightful little spot in Brooklyn Heights - my friend had a beer, guac, chips - I had a Kale salad. Good prices. Really friendly service.", "author": "Jonathon F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-19", "description": "Very good Bellini!\nPrecise service, delicious food, maybe a little bit more expensive than it values. The atmosphere is casual and comfortable. Free iced water once you have a seat is definitely a goodness during summer time.", "author": "Enrico A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "Went here on Friday night with a good friend and the place is really nice.  The Pros: food was good, the service was great, the setting amazing, right down the block is the water so it has that going for it that and I almost forgot they make a real drink not a watered down version.  If you are in the mood for a gourmet meal this may not blow your mind, however it is a great date night spot.  I want to try some of the other eateries on this block as well.  But if you have not tried Heights give it a shot and decide for yourself I think it is worth it.", "author": "Sue Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-11-16", "description": "Came here on a whim w/ a party of 5 because we were hungry! Ambience that evening was laid back \u0026 chilled. \n\nI ordered a Maine Lobster Roll that came w/ coleslaw \u0026 chips. Honestly my lobster roll was salty! The coleslaw just looked untouchable and just gross. \u0026 my chips looked like it came out of a bag of wise potato chips. \n\nThe other party had ordered a burger that looked like they just slab the items on top just to make it. \n\nThe only thing that looked enticing was the Lamb Entree and Mac \u0026 Cheese! \n\nNonetheless our waitress was great and attentive. But as for the food... I don't know maybe it was that particular night but food wasn't that great.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-03", "description": "Great place for people watching by sitting outside and VERY close proximity to the promenade. Service was also very attentive. For that it gets a 5. However, the food was a little bit skimpy, Ordered the lamb chop from the special menu.  It was basically a marinated cube left on a bone and looked like the rest of the meat was removed. IT came with a few string beans and some pretty good roasted potatoes. I am pretty generous with my reviews,  but not when I leave hungry. Suggestion, order a burger or sandwich. Someone on another table had that and the portion size looked pretty generous.", "author": "Thomas F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-16", "description": "I concur with the general consensus, that this place is totally average and acceptable. It's there when it's late and you need something quick. But I wouldn't make this a destination.", "author": "Claire F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-23", "description": "Stopped in to warm up after walking along The Brooklyn Heights Promenade for something hot. The carrot soup didn't disappoint.  Especially with the Rosemary bread to dip in it. The spinach dip was a warm fuzzy as well. Beautiful quiet atmosphere. So glad we dropped in.", "author": "Angela A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-29", "description": "*Outdoor Seating is Great.. Servers and Host were very pleasant.. Ordered Ice Tea it was horrid, asked for a lemonade after.. it was good.. My family ordered sandwiches and they look great, I prefer to order things I'm familiar with when I try a new spot. Ordered a omelet, it was stuffed with everything I wanted and it was awesome. Def a good lunch spot. Not a huge array of choices but the food is good :-)", "author": "FoodieJunkeyz F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-04-09", "description": "Appearance can be deceiving as the food is like more of an upscale diner.  The bathroom is clean and well maintained.  Recent visit with my good friends whom I met at my long-time Meetup was for dinner after attending a \"Stomp Out Cancer\" event at St. Francis College.  The burgers and pasta are good.  I didn't see anything that spark my interest.  It's leans towards American cuisine.  There is only one large TV yet a full-service bar.  They only offer Watermelon Martini for flavored Martini's as any flavor is better than Dirty Martini.  My Cosmopolitan was tasty.  Personally, I didn't see anything about this restaurant intriguing as I always look for something different on the menu.  Heights Cafe does not spark my interest, just an upscale diner.\n\nHeights Cafe is very particular in the form of payment as they only accept Amex or cash only.  No Visa, Master Card, or Discover are accepted.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-14", "description": "Great location, nice outdoor seating too. But lacks atmosphere inside. Plus the service was ridiculously slow. Just because I'm a solo diner doesn't mean I want to be ignored! Food was fine though, good selection and average prices.", "author": "Emma H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-22", "description": "Great brunch spot in brooklyn heights!  Came here with the family and everything was delicious.  The eggs benedict and breakfast platter are must haves.  Highly recommend!", "author": "Matthew V."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Heights Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Gtqea5YJjWmv9-NRFz9eTQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186255555"}