{"aggregateRating": {"reviewCount": 287, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-23", "description": "This was a very nice restaurant. I had the sea scallops dish and my company had a burger with heights fries, which consisted of sugar, salt and vingar spread on the fries. Service was great but dare i say it teethered on being too many check-ins, but i do appreciate the young lady being on her game. I would definitely come here again. Nice neighborhood as well!", "author": "Laur D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-21", "description": "Had a delicious lunch and experience @ heights cafe yesterday. \nMy co worker and I decided to try heights cafe and were pleasantly surprised. \nThe menu is filled with delicious, health conscious and affordable choices. \nI had the mac and cheese and asked the waiter to add bacon and they gladly did.. it was amazing and cheesy. My coworker had the pasta and shrimp and she loved it. \nService was great, we felt comfortable and taken care of. The place is clean and tidy and has indoor and outdoor seating which I love, always good to have options. Will be coming back soon. Thanks", "author": "Christine H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-27", "description": "Last Semester, my group and I chose Heights Cafe for our final project since one of our group members is a server here. I came here with my boyfriend at 5pm on a Saturday when my friend was working at the cafe/restaurant.\n\nIt's located in the heart of Brooklyn Heights and is in a beautiful location because it's just a short walk from the Brooklyn Promenade. The restaurant/cafe has a warm and cheerful atmosphere as there are maroon-like leather seats at the booths and majority of the seats and tables are made of sleek wood. The walls are decorate with paintings from local artists.\n\nMy friend greeted us with a warm and friendly smile and asked what would we like, gave us recommendations, and etc. We were given a bread basket and we also started off with drinks:\n\nMy boyfriend ordered the Angry Orchard and I had a Watermelon Martini. The watermelon martini tasted almost like a Jolly Rancher candy in a liquid form and with alcohol in it. I have to admit it was a little strong for my taste, so unfortunately I didn't drink the whole glass.\n\nFor appetizer, we had the Warm Spinach Dip with Corn Tortillas. We typically order fried calamari as an appetizer, but this time I wanted to try something different. The dip was a delight, not too cheesy and you get spinach in every dip and bite. Chips were crunchy and fresh, definitely not stale.\n\nMy  boyfriend the Wild Mushroom Ravioli from the dinner specials menu for the evening we went. It's definitely a little more expensive than ravioli we've had in other restaurants. The wild mushroom ravioli was accompanied with an olive oil garlic sauce, sauteed shrimp,  asparagus, and cherry tomatoes. \n\nThe dish is definitely vibrant, but I didn't really see why there was a need for shrimp, asparagus, and cherry tomatoes. I would have much preferred wild mushrooms around the dish. The ravioli itself was delicious and super filling and I would have preferred more sauce.\n\nI ordered the Lobster Mac \u0026 Cheese since it sounded amazing. The lobster mac \u0026 cheese was bathed in brandy lobster cream, Parmesan, Gruyere, and cheddar cheese. I liked it for the most part, tasted more like cheese than lobster-like. \n\nI actually had trouble finishing the lobster mac and cheese because there was so much cheese and cream that I got full instantly. The cheese was just a little overwhelming.\n\nOur bill came out to be more expensive then what my boyfriend \u0026 I typically pay for when we eat out. However, I really liked the service and the attentiveness from the other servers before my friend arrived to our table. I also really like the atmosphere because most of the customers are locals, tourists, and/or family. I also like that there's a warm and welcoming atmosphere here.\n\nI think if I am in the area and in search of warm and delicious comfort food than yes and maybe if for a birthday dinner and etc. If a friend or someone asks me for a good Brooklyn Heights restaurant recommendation, Heights Cafe would definitely be on my top list of recommendations.", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-21", "description": "* (( Rating scale from lower score: A, to higher score: AAAAA ))\n\nMust eat: \nBrunch - poached eggs with Smoked salmon \u0026 poached eggs with crab cakes.\n\nTaste: AAAA\nInterior design: AAA\nClearing: AAA.\nService: AAA.\nPrice: $$\n(Tasted in June 2018)", "author": "Love F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-25", "description": "Really good location and friendly staff. The buttermilk fried chicken was way better than I expected, give it a chance!", "author": "Chris K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-24", "description": "Very fast service. Brunch pancakes are excellent", "author": "Dolores B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-09", "description": "Disappointed. Service is bare average and the food is definitely not value for money. Had breakfast here and ordered a spinach omelette and some cob salad. Cob salad had hair in it. Left early and never coming here again.", "author": "Yar R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-03", "description": "Large, lovely interior with great music and plenty of outdoor seating. We visited the Heights for Sunday brunch promptly at 10 am, and were surprised an hour later to discover that the spot was mostly empty.  Service was fast, pleasant, and attentive, but the food and drinks were merely adequate. We ordered a latte, two Bloody Marys, the omelet special of the day, and a poached egg dish called \"The Chesapeake\". My husband's crab cakes looked dry enough to choke on, and my Bloody Marys were a watery letdown. Still, I'm open to giving this spot another stop given its outdoor seating and proximity to the Brooklyn Heights Promenade.", "author": "Phoebe B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-03", "description": "Average food.  Lots of room / tables but kind of dull environment.  Staff was polite and courteous.  More trendy menu would be attractive.", "author": "M A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-10", "description": "Same stupid attitude that I hate about this place.  The waitstaff isn't nice or accommodating or smart and they don't pretend to be nice either.  While the  food=fine, the prevalent attitude is that this is a \"fancy\" place...really?  Oh please it's just that Brooklyn Heights has nothing else, but don't confuse that with being \"fancy.\" I take guests there out of necessity, but I would never ever go there because I crave it.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "This is a great place to take your parents who are in town visiting the city. It's not far from subways and SO close to the Promenade. The food is pretty good -- your standard brunch fare, and the prices are decent considering the area. There are lots of TVs if you are looking for somewhere to watch sports, but it doesn't feel much like a sports bar at all. There are a few downsides, though -- they don't take brunch reservations and when I called they were not honest about the wait time. You have to get lucky to get in sometimes.", "author": "Kelsey W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-05", "description": "This place is so bad. The service was terrible and I've heard they treat their employees terribly. The sweet potatoes aren't even that good and that's what they are supposedly known for. Portions are really small and overpriced.", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-03", "description": "I came here for brunch with my family and loved it! I ordered their Bellini to drink which didn't really taste like a Bellini but it was definitely heavy on the bubbly so totally worth the price ($8). I ordered the chicken and waffle which I was initially skeptical about but it totally blew me away. The chicken breast was boneless and perfectly crispy, and the waffles were nice and fluffy, not chewy at all. They give you just the right amount of chicken to waffle, which is appreciated especially when I've had chicken with wayy too much waffle. They give you maple syrup and a bbq sauce on the side so you can dip/pour as much as you want. The maple syrup wasn't too thick and the BBQ sauce had this nice smoky flavor to it. My mom ordered the quiche, which I had a bite of and thought it was very flavorful. I was expecting the quiche to be hotter (temperature wise) when I took a bite because my chicken and waffle was very hot when I got it so I'm not sure if they have them premade and heat them up or it was just sitting on the counter while the rest of our food was being prepared. My dad and sister both got burgers that they seemed happy with.  My dad didn't like the fries because he thought they were overcooked but said the vegetables were very fresh. My sister ordered an iced latte and said it was warm and the ice had already melted when it was served. Additionally I've previously ordered their creme brûlée and it was the best creme brûlée I've ever had, no joke.\nOverall a very enjoyable experience. The service was good and they have a lovely outside area when the weather is nice. The one thing that turned me off was there were quite a few flies buzzing around. Price wise it was reasonable. I would definitely come again.", "author": "Antonia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-21", "description": "Tasty burger with lots of trimmings and very good omelet. Loved the service, friendly, efficient and just the right level of relaxed (in a good way).  Recent bathroom renovation is well done. Cozy booth. Will return soon!", "author": "Rie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-23", "description": "Underwhelming, disappointing; but they had a solid Cobb salad.\n\nOne of my first times in Brooklyn and after train mishaps and shutdowns this was a spot not too far from the subway.  \n\nThe atmosphere was clean and decent, nothing special. \n\nThe server seemed a young gal inexperienced in service. Reminded me of a high school student who did her job w the minimal amount  of expected service but who really didn't want to be there and was not really happy in making guests happy or accommodating requests.  \n\nThe A/C was too high so it was uncomfortably cold and when we asked if we could sit outside they were breaking down the tables so that wasn't an option the server said. Server did not make any suggestions for us to move or make it more comfortable.\n\nDrinks. No drink menu. I was hot and tired when I arrived (until shortly after frozen by their A/C) and realized I am not used to not having a menu to guide me in my drink choices. I asked if they had Mezcel. No. \n\nCobb salad.  When I asked if they could have something else instead of iceberg which I do not eat - said sure, and when I asked what she recommended she she likes iceberg because it is crunchy. Wait, what lettuce is not crunchy. Ok, moving along realizing she is not one to ask for suggestions so I asked if they had romaine. Yes. Done . \n\nAfter taking time I decided  on an old fashioned thinking that is a simple drink to make. Ordered and when it arrived, not good.\n\nCobb salad was served, looked good, but without dressing. \n\nCold, looking for her to ask for dressing and to add a little something to my old fashioned, she was nowhere in sight . Wait, she was in sight, gabbing away w her co worker across the room . After 5 minutes I was ready to go get her personally, she walked over to give someone else a menu and I was able to get her attention .\n\nI brought up not having dressing and asked what they typically served with their Cobb salad and she looked at my salad saying there was blue cheese dressing on it already. I nicely told her that Cobb salad came with blue cheese on it but that was not dressing and asked for a vinaigrette. \n\nI asked if she would have the bartender sweeten up the drink since I was not sure how to improve the flavor but sweet generally will make me happier. \n\nNow I'm feeling like I'm asking for the world because it's 3 things and she is not making big efforts to correct. I'm worried she will put something terrible in my drink for inconveniencing her. \n\nDrink came back, sticky sweet syrupy and even more awful. I had given up. \n\nThe positive: Cobb salad with romaine instead of iceberg was great. Fresh avocados, eggs and the right ratio of all the ingredients. \n\nWould not go back, and was more disappointed when I saw intriguing cute places a little further along the stretch, but if I lived in the area I would get a Cobb salad for takeout.", "author": "Lisa F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-06", "description": "Good bread and fries. Mediocre food. Do NOT get the Mediterranean platter, awful. Basically don't come here", "author": "Kubair D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-14", "description": "Iceberg lettuce because it's really a diner and $14 because... I guess being overpriced is the cache? The salad was okay but I definitely expected more. Worth noting the service at the bar was great.", "author": "Robert P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-18", "description": "As mediocre as they come. The one plus is the location and spacious interior. Otherwise, overpriced, average food. Would go across the street to LPQ", "author": "Ron G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-27", "description": "We came here for a evening dinner right after work. He did well with picking this place because I fell in love almost immediately once I saw the ambiance \u0026 genuine smiles on the fellow diner's faces. He has a thing for candles \u0026 windows. Who am I not to oblige?\n\nHeights Cafe offers a memorable experience  with the pleasant hostess, amazing food \u0026 wooden furniture. I have a thing for wood especially Cherry wood. \n\nOur waitress gave us ample amount of time to place our drinks \u0026 entrées. We started off with a Blueberry Martini \u0026 Watermelon Martini. The drinks are strong here. Not strong in a good way either. There was no flavor whatsoever \u0026 tasted like rubbing alcohol. Flavor, where art thou?\n\nHe had the Penne Pasta which he added Chicken \u0026 Italian Sausage with fresh grated Parmesan Cheese. I had the Lobster \u0026 Shrimp Mac \u0026 Cheese with Breadcrumbs on top. It was delicious! Both entrees actually. My Mac \u0026 Cheese was piping hot I almost burned my tongue \u0026 finger trying to get to the gooeyness. \n\nThe reason for the 4/5 stars is because the waitress brought the check back requesting more money. I thought that was terrible \u0026 tacky. Let me just put it out there that he's not a bad tipper. \n\nShe said, \"it's a 15% tip\". Not that it was suggested on the receipt but how dare you come back for more money. We are firm believers that your tip reflects your service. Why should you get 15% if your service was less than? The true gentleman that he is he gave her more money although we were both taken aback by her rudeness.\n\nHe mentioned that HC has brunch so we'll be back for that one day.", "author": "Briaunté W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-11", "description": "Oh Heights Cafe, how you let me down.  We were in the neighborhood to take in the scenery. Two separate people stopped us to recommend this place to eat.  I would rate the members of this community five stars if I could! People were so friendly.\n\nI ordered the lobster roll.  It was on a very mini hotdog bun.  It was a decent portion of lobster, but had a spice on it that was not good.  The chips were okay, but once again had a spice I just didn't like.\n\nThe person I ate with ordered the pictured chicken sandwich.  He said it was very plain and way too small.  He ordered sweet potato fries, which were our favorite part.\n\nOverall, we'd skip the place next time we're in the area.", "author": "Chrissy H."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Heights Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Gtqea5YJjWmv9-NRFz9eTQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186255555"}