{"aggregateRating": {"reviewCount": 287, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-05-30", "description": "Subpar service and poor food ruin a great location and outdoor space at the Heights Cafe. \n\nUpon arriving, everything seemed just fine. We were greeted well and seated quickly in the great outdoor space they have in Brooklyn Heights. Shortly thereafter, events steadily became worse. Some of the silverware was dirty; the focaccia bread was absolutely stale and inedible; our calamari appetizer was from the freezer and over-fried in dirty oil; our salads were small, not fresh, and the chicken was so dry we couldn't eat it; and the server never bothered to ask why we obviously weren't interested in the food. \n\nThe Heights Cafe is little more than a diner with a nice outdoor seating area and a bar. If you're expecting decent food, this is not the place to go.", "author": "Jason S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-24", "description": "I definitely recommend arriving early to this popular BK heights brunch spot. The service here is friendly and quick. I had the steak and eggs and it was really delicious. the meat was perfectly cooked to medium rare and the eggs were fluffy. Such a relaxing spot.", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-18", "description": "Had a nice lunch here. Lobster roll was very good, but portion was small. Burger was pretty tasty and fries were thin cut and tasty. Steak in steak and eggs dish was overcooked (asked for medium rare and got well done).  Overall, nothing out of this world, but definitely worth trying.", "author": "Mike D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-18", "description": "I went to the heights cafe and must say it was very impressive,the service was on the money. The food was excellent.i have to say it was a great experience. Can't wait to go back.thank you mr. And Mrs. B. Sturman.", "author": "Bruce S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-12", "description": "Service was a little inattentive and slow, but my roasted chicken was great---tender and flavorful.  The menu is standard American fare.", "author": "Nicholas S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-19", "description": "Love this restaurant.\nOk- it's not a cafe (as in you cannot get a croissant and coffee to go)\nBUT you can sit at the bar with the friendly regulars and bar tender and get a great sandwich during lunch- like the steak sandwich or their amazing burgers w heights fries.\nIf you come in for dinner I recommend the pizza appetizer, it's thin, crispy and tasty. I love the Salmon burger and the specials are usually pretty great too- items like Osso Bucco or Lobster Ravioli frequent the specials list.\n\nDon't be afraid to try something new, good food and good prices, especially for the area- seeing as how it's hard to find affordable, delicious food in the Heights.\n\nBon Apetit!", "author": "Tara S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-14", "description": "We stopped at this place for brunch before heading to the BK bridge. The food was delicious and the server was very perky. I am giving a 4 because they were very slow and did not have enough staff to manage the crowd. Other than that I would recommend it!", "author": "Natalie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-31", "description": "I came here w/ the mister and the food/service was good!\n\nfor app, we had the artichoke spinach dip --was a lil blah to me, but filling nonetheless.\n\nfor entree - i had the pan roasted chk w/ mash potatoes and sauteed spinash. i truly enjoyed this meal. the chicken was o so good...tasty!!! Mash potatoes was good too...nice and creamy but not heavy. The portion of the meal was just the right amount to. felt full but not stuffed. \n\nmister had the crabcake entree, which was decent from what i tasted.\n\nOverall, the waiter was attentive and provided all a waiter should provide.\n\nI'd def go back!!!", "author": "Lyn D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-18", "description": "Trust me as an individual who has lived in Brooklyn Heights for over 10 years \nMOVE ON!  This place is the worst!  For some reason they hire staff who:\nA.  The staff confuse the orders so when the food finally arrives it's NOT what you ordered.\nB.  The staff are not friendly and appeared socially retarded - if you ask them a question or expect them to have manners - FORGET IT.\nC.  The staff are not able to function as a team of waiters thus causing service to be slow and making the dining experience unpleasant. \nD. The manager I spoke to doesn't care was very rude.\n\nHow this place continues function is truly amazing with such horrible service and food.\nThis is a place for the unknown visitors who are seduced by an \"outdoor cafe\".\nYOU have been WARNED!", "author": "Warren C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-11", "description": "Wonderful place for brunch....not crazy over the top food, but the food is tasty, the staff is attentive the drinks are tasty and prices are great. What more do you want for brunch after strolling the Heights?", "author": "Don H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-14", "description": "Visited this place three times and with every visit the service and good got worse.\n\nFirst visit was superb, the food was on point, the servers were prompt, the outdoor seating was ideal for my beagle and I. \nSecond visit was with my coworkers for a quick lunch....the drinks were watered down and the service sucked. Third visit was the worst of all. The pork chop was tasteless, drinks were slow and packed with ice....not to mention there seemed to be a problem with their bathroom.\n\n*cash and credit*", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-25", "description": "Service was a bit hit and miss but apart from that the food was ok! Not the best but you pay for what you get , ordered steak strip with garlic butter and chips. Steak was good for the price and wasnt chewy was cooked correctly. Would go again but only for a quick lunch would not do dinner here agin.", "author": "Wallis P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-23", "description": "Yeah, the 3 star avg is accurate: Not bad, not great. Okay prices... Bloody Marys for brunch were TINY compared to most other places. Service was \"okay\" (got my Huevoa Ranchers order wrong). And It's a pet peeve of mine when the server doesn't check back to see how our food is (she didn't...) Prob will only go back out of necessity, not desire (my b/f told me it wasn't \"stellar\" and since it's so close to his place I thought, \"it's more time we can spend together.\")", "author": "Glennznyc R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-19", "description": "A very comfortable and friendly place, nice atmospheric lighting and pretty well rounded menu.  Mixed green salad was very fresh with very flavorful balsamic dressing, and entree was the boneless fried chicken with mashed potatoes and cole slaw.  A very pleasant experience, and the wonderful Bossa Nova music playing in the background was a personal plus for me !", "author": "Michael R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-09-20", "description": "I was very impressed with the brunch offerings and the food itself, as well as the space inside and outside the restaurant, but the service on a Sunday morning at this upscale diner/cafe at 10am was a little too slow.  \n\nI ordered the Chicken and Asparagus Quiche with cheddar cheese and bacon ($10.95), which was VERY good.  And my friend had the Brunch Strudel ($9.95) with an added side of home fries.  I do wish the entrees came with a free mimosa or champagne to accompany the meal.  \n\nI'd like to go back and eat outside on a sunny day, and maybe try the Chile Rock Shrimp Frittata for brunch.  Or the Turkey Burger for dinner.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-03", "description": "The staff was very kind, however we discover hair in the fried calamari \nThe waitress advised the manager. He never showed and apologized. \nThat was very rude from them.\nI will never get back...", "author": "G. B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-14", "description": "Terrible. Terrible. Terrible. \nMy wife's eggs were precooked. No jam or jelly for toast. \nThere was some liquid, hopefully water all over my plate that my food was sitting in. \nYuck. \nNever going back. \nThis is not the place you want to go.", "author": "Ben P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-06", "description": "Stopped in here for a Guinness and a burger. Great service and food, couldn't have been happier", "author": "B S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-18", "description": "We came here for a Sunday brunch.  Service was extremely slow, and food was mediocre.  The bonus was the little basket of bread and butter they give you.  Hmmm, maybe they gave it to us knowing that our food was going to take 45 minutes to cook.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-02", "description": "Nothing fancy.  Not over priced like most restaurants on Montage street.\nThey have full bar and plenty of tv's if your looking to catch a game. Its a good place to sit down if you don't have other options and you want to grab a quick app and entree in expensive Bklyn Heights.", "author": "David L."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Heights Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Gtqea5YJjWmv9-NRFz9eTQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186255555"}