{"aggregateRating": {"reviewCount": 287, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2011-08-08", "description": "I would describe the food here as depressingly average, but the the location and terrace are nice, so if you've eaten somewhere else this could be a nice place to stop for a drink. After attempting a few lunches and dinners I would never eat here again, though. It sounds good when reading the menu but the food is invariably disappointing.", "author": "K D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-02-27", "description": "This restaurant has decent food and I love the location because it is so close to the promenade.  I also really like their bread.  \n\nI find that I enjoy their brunch food a lot more.  On their dinner menu, I usually get the Salade Niçoise and it is pretty good. The one thing on their menu that I wouldn't recommend is their Chopped Mediterranean Salad simply because it is a bland chopped salad and not Mediterranean in any way.", "author": "Lia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-14", "description": "The Heights Cafe has a winsome neighborhood vibe that I love. No pretense, just locals hanging out and sharing good food and drinks.  The menu is interesting enough, with lots of fresh ingredients.  I love their arugula salad with candied walnuts, the calamari, and the daily soups (especially the butternut squash).  While the food won't blow your socks off, it's consistently good which counts for a lot.  The service is great as well - very attentive and helpful, not rushed, just awesome.  All of my meals here have been enjoyable.", "author": "Allison N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-27", "description": "Had the crab cake breakfast sandwich, which was pretty good.  Problem is that this is child central -- why, I dont know.  One mother even had her kid come inside with a little bike and park it at the coat rack.  Probably a good place for a meal at night, but I would stay away during the day if you and your wife arent into screaming kids.", "author": "Optimist O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-02", "description": "i'm going to round up an otherwise truthful 3.5 because i'm in love with brooklyn heights.\n\nperhaps it was the proximity of Heights Cafe to the promenade, the welcoming hum of patron chatter, being surrounded by beautiful brownstones, or the passerby hobo telling my boyf how pretty **i** am, \n\nor a combined effect of all of the above..\n\nthat turned boyf's tuna steak into titillating,\nmy meatloaf with gravy a little classier,\n\u0026 had the (otherwise mediocre) merlot making me a little more lovedrunk.", "author": "Julia S. J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-10", "description": "I will say that it is on a fantastic street in Brooklyn Heights. However, I have to keep it real: I should have gone somewhere else for lunch. I ordered the omlette with prosciutto, mushrooms, and mozzarella. It was really rubbery and did not taste good. The service was also slow and inconsistent. In fact, someone who was seated after me, was served and left before I ordered. Yeah, I  will be sure to pass this one in the future.", "author": "Greenbean O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-06-04", "description": "I've eaten at Heights Cafe 3 times now, the first is the reason I've been back.  That was about 4 years ago.   I had one of the most delicious french toast I've ever had- a corn-flake crusted piece of heaven.  \nI've been back twice since and I'm guessing the restaurant has come under new management because they've never had it on the menu since.  \nThe last time  I was there was this past Sunday June 2nd.  It was terrible.  I mean TERRIBLE!\nMy wife ordered a platter with soft scrambled eggs and french toast.  It's either these guys have never seen a soft scrambled egg in there life or they were using eggs from a carton.  I'm pretty sure they were from a carton.  I had eggs Benedict, the canadian bacon was about 1 inch in diameter- no exaggeration.  the hollandaise sauce was so-so and potatoes were bland.  My son had pancakes which I swear tasted like bisquick mix. \nWe live in jersey now and were looking forward to a good breakfast in the city.  The Heights does not deliver!!\nOther reviewers have called it a diner I call it a bad diner.  Not what you expect from a restaurant in one of the best neighborhoods in the city.", "author": "Dwight B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-09-05", "description": "I went for brunch. Maybe other meals are good, but I suggest you stay away. Scrambled eggs were bland and over cooked. Sausage was very dry, almost impressively so. The latte was very much not worth it. Seemed clean, but there were flys around. I couldn't possibly suggest you go there for brunch. Perhaps other meals are better.", "author": "Jim S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-06", "description": "A nice neighborhood cafe, right near the pretty promenade and, perfect for a cozy romantic date.  I went with my aunt and cousin.  They got us seated right away even though they were very crowded, and took are order quite quickly.  I had one of the dinner specials, a New York rib-eye steak with Potato au gratin.  It was delicious, the steak was marinated in an amazing ancho chili bordelaise sauce.  I also got a yummy arugula salad with ginger citrus vinaigrette and gorgonzola!  The crabcakes were delicious as well, nice and crispy.\nFor dessert we tried the Chocolate flourless torte with a brandy sauce (soooo rich and wonderful texture), and a pumpkin spice layer cake with caramel cream cheese frosting.   I need to come back here for lunch to try their amazing lamb sandwich!   Oh and there was a great sapphire gin and tonic that evening as well", "author": "Elan K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-02", "description": "I live in Brooklyn Heights and I've lived here for years.  I'm proud of my neighborhood except for the Heights Cafe.  I find it incredible that it stays in business with how hideous the food is.  Okay, a personal pizza...well, you can't ruin it but why order one if you can eat at Grimaldi's on the other side of the Heights?  Basically this is a tourist trap for those strolling romantically down Montague Street.  The brunch is boring, the scallops and salads and burgers for dinner have absolutely no innovation or it's overly innovative.  Spices don't blend and it's almost as if they can't find their groove.  I secretly have to say that I go once a year b/c I SO want the food to be better b/c the ambiance is lovely and the bathrooms are clean.  Too bad it's the only two good things.  Oh, one more, Annie makes the best Cosmopolitans and you'll have to have a few to get through the dinner.\nThey only take American Express!!????!?!?!?!!!", "author": "Valerie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-22", "description": "I've been to the Heights Cafe a few times for dinner, but it's been a while so this review will focus on brunch.  \nThe Heights Cafe serves a standard bunch, the food comes out quick and the kitchen doesn't take too many chances.  Buttermilk or whole wheat pancakes and waffles; eggs benny; frittata's; and a gaggle of sandwiches.  I ordered their French Toast, inexplicably topped with a pear and raisin compote that really added very little except for a punch of sweetness as cooked pears and raisins on top of French Toast is akin to a sickly sweet Crumbs cupcake.  I asked for bananas on top, which arrived uncooked and mandoline sliced...and actually helped cut the taste of the compote.  \nMy friend had the arugula salad with almonds, Gorgonzola and orange, which she said was decent.  \nOverall, Heights Cafe does a decent brunch that won't break the bank and is steps from the Brooklyn Promenade which affords great views of Governors Island and Manhattan.  \n\nn.b. AMEX only.", "author": "E W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-07", "description": "A totally safe option to bring friends, work colleagues or new acquaintances for lunch, after work drink or dinner. The outdoor seating makes an especially nice impression in the summer. The weight staff seemed a bit distracted but our food came out right away (perhaps even too quickly!). THEY ONLY TAKE AM EX so come with case or the appropriate card. The setting an ambiance is their strong suit - the food was good but was nothing more than great diner-type fare. I enjoyed my glass of Italian Pinot Grigio however. The prices were reasonable (I believe dinner for two with wine came to $25 each, including tip).", "author": "Lis K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-07-18", "description": "I have been here twice and both times i was impressed! the food is so awesome from appetizers to main course. the first time i went for lunch and had a hummus appetizer which was awesome and chicken sandwich. it was very very tasty. i am usually very picky as to where i get hummus so i was pretty impressed with them. for dinner  i shared an appetizer with my boyfriend  which was mussells soaked in coconut milk all i have to say is OMG! it was awesome!  then i for my main course i had salmon on top of mushrooms was so tender. my boyfriend had roasted chicken  he really enjoyed it! i cant wait to go back to have breakfast there! the only downside is they only take american express so if you dont have that card besure to bring cash! for 2 people we spent about 70 dollars with tip and alcohol ( 2 cups and 1 beer)", "author": "Tahani O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-22", "description": "i'm never in bk heights. but jeezus what a beautiful part of town.\n\nme and the gf needed an affordable brunch after a particularly unfulfilling  (yet entirely respectable) Unitarian church service.\n\nused the yelp iphone app but couldn't really find anything we were in the mood for.  on the way back to the car we stumbled upon what looked to be casual outdoor seating and after peeping the menu we committed.\n\ni got steak and eggs for $12. the steak was a really juicy piece of sirloin that was quite phenomenal for the price.  well seasoned and the temp was nailed. it was accompanied by a heaping mound of scrambled eggs that tasted EXACTLY like 4 star hotel restaurant eggs.  and i say that not as a criticism but in disbelief that the eggs could evoke such vivid memories of staying at a semi-swanky hotel while attending my step-cousin's bar mitzvah.\n\nthe gf had eggs benedict that were tasty and accompanied with a rather uninspiring gaggle of orange homefries.  totally like a hotel would make.\n\nthe whole brunch was like $20 and was filling.\n\nunlike everyone else on yelp i couldn't give a rat's patoot about brunch. so i can't speak to how it stands up to other joints.  but eat here if you're tight on cash or love hotel eggs.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-23", "description": "greatest thing about this place in outdoor seating.  Food is okay, some things are overpriced for what you get.  The service was fast, but maybe not as personable as other places.  Coffee was good, brunch selection was okay.", "author": "Rhonda W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-07-05", "description": "I ordered the Texas meatloaf it was wrapped with bacon, and came with string beans, mashed potatoes, and onion rings. The meatloaf its self was not chop meat, it was more like a steak, the portion was decent. The string beans were undercooked but the mashed potatoes were very good and the onion rings are a little different than how you would get them in a diner, but they were okay nothing spectacular. I also tried some penne a lavoda  which I must say was excellent. The food here is okay, the menu is type short but there is much better out there.", "author": "Heather L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-04-23", "description": "This place was alright.  It's on a nice street (we were unfamiliar with the neighborhood) and we were just looking for a simple outdoor restaurant for a quick lunch with our baby.  It wasn't that crowded and seemed kid-friendly enough, so it fit the bill.  The food was good, nothing spectacular.  And while WE didn't order any booze, I noticed the beer glasses were a tad skimpy, and I would be upset if I ordered a beer and it came in that delicate little glass.  The service was polite, not overly friendly, and kind of did the bare minimum required, but we never waiting an absurd amount of time or had any issues with them.  Just a mild experience, I would come back and sample a different sandwich or salad to seal the deal!", "author": "Kristina G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-08-05", "description": "one of the lousiest places i've ever eaten.  went there last year and ordered the pulled pork sandwich.  whatever it was that showed up on my plate was definitely not pulled pork.  the meat looked like pork, but the flavor of the sauce was something completely unidentifiable.  i had my boyfriend taste it and we were both like, wtf is that?  i told the waiter and he sort of shrugged his shoulders and took the plate away.\n\nlast week, we were in bklyn heights, it was late, we were hungry and decided to give it another try.  this time, i had the roasted chicken with vegetables and while it was edible, it was nothing special.  my boyfriend had the roasted chicken special, but we were confused as to what the bird was on his plate.  we poked at it for a few minutes and decided it was some kind of game hen.  we asked the waiter what it was and he cheerfully said, \"oh, it is a chicken.  a baby chicken!!\"  we were like, \"oh.\"  wtf is a baby chicken?  i'm not a vegetarian, but even i can't bear the thought of murdering immature birds (i never even eat veal).  anyway, it was a total turnoff and he didn't eat it.\n\nit's amazing that a large room like this, with a prime spot on the corner would have such a crap restaurant.", "author": "Kim T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-01-03", "description": "i really only like the hot chocolate, i've never had a \"great\" meal here, but it serves it's purpose as a meeting/brunch place when need be.  It's cute \u0026 convenient, and the bathroom is always clean :)   but honestly--the food is eh", "author": "sveta k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-03", "description": "first, i am shocked that no one has reviewed this place yet. do no yelpers live in bk? \n\nthis place is great to sit outside and have a nice leisurely meal. the staff is friendly and the wine list decent.\n\nlast time i was there i had the mushroom ravioli without the chicken and it was really good and satisfying. \n\nthere are plenty of hooks in the bathroom! woot!", "author": "Kenna T."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Heights Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Gtqea5YJjWmv9-NRFz9eTQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186255555"}