{"aggregateRating": {"reviewCount": 287, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-15", "description": "While this cafe is located in a really nice spot, it's location is all it has going for it.  Sitting outside is quite nice.  However the food and service leave much to be desired.  I had their omlette which was utterly crap.  It was rubbery, probably sitting under the heat lamp for a while, and the add-ins such as feta, veggies, etc., were very skimpy.  \nThe servers are nice, but incompetent.  Asked about my eggs I gave an honest answer to be greeted by a blank stare.  Okay, finally offer to make it again, but no.  At that point water and coffee refills had been spilled all over by their staff with no real clean-up.\nTo be precise:  This was a Sunday brunch.", "author": "Sven P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-04", "description": "I had a typical breakfast: egg whites, bacon, \u0026  home fries. It was a large plate, and very tasteful. My girlfriend had the buttermilk pancakes: she said it was one of the best pancakes she ever had. So food was great. The service was below par. I felt like I was bothering the waiter for things I should have been offered i.e: ketchup, and sugar for the coffee. Breakfast for two: $30.00 before tip.", "author": "Francisco T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-19", "description": "Dine here often when working in the area, mostly for sake of convenience. Nothing earth shattering, but it's good, with reliable service.  Cash or AMEX only, which is annoying.", "author": "Edward O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-08", "description": "Food is GOOD would give 3.75 stars\nWait staff is TERRIBLE no stars.\n\nI brought my cousin who was visiting to this cafe while we were walking through Brooklyn Heights. I had been here once before in February and had been impressed with the moderately priced dishes and comfort of the establishment and food was delicious - salads fresh and well balanced, soups hearty and creamy.\n\nSecond trip made me question whether I need to find another place to eat in Brooklyn Heights. No one came over to seat us when we entered a bus boy finally said to sit wherever we liked he even brought over the menus and water. Waitstaff was congregating over by the wait station in a group chatting (several times through out the meal). When our blonde waitress finally came over she had no clue what the soups of the day were. We had to wait for her to go ask another waitress before we could order. We ordered an appetizer and 2 small entrees to share and I asked for a wine menu. Waitress came over later and asked if we wanted our food with our appetizer we said no we preferred it after. She never brought the wine list over and the runner brought our appetizer and shortly thereafter while in the middle of eating it they also brought our entrees. Our tiny table was totally full of plates and I couldn't decide what to eat as my soup was getting cold. Waitress tried to take anyway appetizer before we were half-way done with it. I never received a wine list and my glass of water went empty a few times while there. The couple next to us went into great detail telling their brunette waitress that she was a celiac and asked about gluten free options. After they worked out her order the runner brought over a entree that was not what she specified and had gluten all the main entree. They came back 5 minutes later with her entree (fixed?) but I think we were all wondering if they could really have removed all the gluten from her dish...I hope that lady did not get horribly ill afterwards. Her husband had to ask the waitress to refill his drink as well as she walked away before even asking.\n\nIts hard to say if I would come back now. I loved the food although the soup was a tad salty and the service was deplorable for a place full of staff and only about 5 tables. They certainly weren't doing a very good job of keeping anyone there satisfied. Also they aren't doing the owner any favors by underselling as I never got that glass of wine I was so craving. Bus boys should get a raise as they are the only ones who seem to be working here.", "author": "Malorie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-03-27", "description": "so here i am, strolling through the heights of brooklyn and the individual i was with said 'the weather's nice, let's sit outside someplace on montague.\"\n\nenter the brooklyn heights cafe.\nas far as atmosphere or ambience, i guess it can't get any better.  but the food wasn't spectacular.  i had a turkey burger, and i couldn't help but wonder why it came with what seemed a gallon of ketchup.  then i bit into the burger and discovered it was because bland as all get out.\nhowever bland \"get out\" actually is, i'm not sure.\n\ni will give this place a decent amount of stars, and here's why.  i want to love this place.  and maybe the turkey burger wasn't exactly what i was looking for.  so i will go back, and try others.  i mean, sitting outside on a quiet warm tuesday night in the heights?  that's pretty cool.\n..if indeed, you can sit outside on a warm night and be cool.\n\n..enough already.  try it.  but don't be upset if the turkey burger leaves you asking for something else.\nlike the chipotle down the street.", "author": "Kimberly K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-07-20", "description": "Awful service, mediocre food, and over priced.  The only reason to go is to sit on Montague Street with a drink.  This place needs to go out of business.", "author": "sam t."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-05", "description": "This is an average neighborhood place.  We go for weekend brunch to get the Pancakes-- which are pretty good.  But I think the weirdest thing about this place is the bread basket.  It's absolutely awful.  How can you make bread taste bad? It's like stale cardboard and its the same every time we go.  I really wish they would get a new bread vendor.", "author": "Hungry Brooklyn Mike C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-02-17", "description": "Food is good, but prices are higher than you'd expect.  We used to eat here a lot but that was before we discovered Teresa's next door (we almost always go there instead now.)  Still good for brunch with friends on the weekend though.  Their dinner specials are usually yummy (as long as you don't mind the price).  Note: they only take Cash or AmEx (but there's a Citibank \u0026 Chase just down the street at Montague/Clinton if you need to run to the ATM.)", "author": "Alicia T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-02-09", "description": "This place is pure bland mediocrity. Nothing special. The food is OK: not terrible, but not spectacular. Atmosphere is equally bland. Prices are OK, but a little high for what you get.\n\nThis is an OK place to go if you are uninspired to venture out of Brooklyn Heights, since most of the restaurants on Montague Street are boring, mediocre and overpriced. When the weather is warm, sitting outside is pleasant.", "author": "Rrose S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-05", "description": "I stopped in for dinner. I'd recommend the New York Steak, quite delicious. I don't remember my waiter's name but he was cool, excellent service. If you're in the neighborhood, great place for a bite.", "author": "Tesfa L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-09-17", "description": "It's a nice place, good feel to it, but the food doesn't always back it up. Great tarragon/squash soup, but just ok curried chicken sandwich. Good eggs, but cold home fries. Great salmon on brown rice. Busboys are more attentive than the servers sometimes. Too many yuppies bringing  their kids (no there is no room for your stroller), but that's not their fault. Good from time to time; definitely not a habit place.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-21", "description": "I had coffee and \"dessert\" (in lieu of a cake selection) here. It's more of a restaurant / bistro than a cafe but overall not bad for coffee either. The only card they take is American Express. Apparently I'm not high-brow enough to be their customer with my Visa cards!", "author": "Kai B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-08", "description": "Decent American food with nice service - a bit pricey and they only accept AmEx.", "author": "Dan P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-08-12", "description": "Fine neighboorhood establishment.  I enjoyed my turkey burger with coffee BBQ sauce a lot.  Not sure I would make a trip specifically to go there, but if hunger struck while I was strolling on Montague, I'd definitely consider stopping in for a bite.", "author": "Meryl C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2005-10-29", "description": "With high rents the norm in this Brooklyn neighborhood, it's difficult for a truly innovative and interesting restaurant to move in, so Montague tends to be dominated by fairly standard, run-of-the-mill places. Heights Cafe is perfectly nice, with a large bar on one side and lots of tables on the other. The food is safe - great value in the personal pizzas and wide range of appetizers. I recently enjoyed a tasty goat cheese and caramelized onion pizza with a friend partaking of the seafood salad - rare slices of tuna and salmon stacked high on mounds of mixed lettuces. A little more flavoring would have been nice. Worth a visit if you're in the 'hood, but nothing stellar.", "author": "Christy V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-12", "description": "If you know how to \"do\" this place, it is The Best. First off, the only professional bar tender in the entire vicinity is at this location - Todd. Only go when he is there. Secondly, this is not a hip joint, it is definitely Jurassic Park at the bar, that said, don't let that stop you because the people are engaging and interesting and always have insightful stories to share - there is more to the eye than what you see. Thirdly, eat the following dishes and you cannot go wrong, ever: Teriyaki Salmon (I am not a teriyaki fan, I hate sweet sauces - but this combination is divine), a Mixed Green Salad with Margherita pizza - add extra basil to this; the pan roasted chicken, or the grilled chicken sandwich and switch the fries for red bliss potatoes. These four dishes are truly as good as it gets because they are a staple there and always perfect... I'm hungry now...", "author": "Heather B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-05-16", "description": "I had a really nice meal here. This isn't a destination spot simply because of the no-frills atmosphere (chain-like) but its a nice option if you are in the neighborhood or want to eat outside. I had the Pan Roasted Chicken with sides of spinach, mashed potatos, and misc cooked veggies. It was blackened and topped with a corn salsa. Delicious!. My friend had a less desireable experience. Her red pepper and mozarella sandwich was grilled on the outside but cold on the inside, not to mention a little bland tasting. I also had a bloody mary. Aside from the fact that it was served in a small juice glass, it was okay. Out total before tax/tip was $35.", "author": "Will S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-28", "description": "Corner upscale restaurant/bar sporting floor to ceiling glass windows,\n  a large curvy bar staffed by the best bartender in NY (In Todd we Trust!), seafood specials to die for, what else could you ask for, oh... well maybe great owners and staff to boot.  Joe and Greg always make you feel good walking in the door, Stephanie, Marissa, Carrie, Kristin, Charity, Kate, Liz and all the other great gals and guys working those tables with smiles and the right attitude make this place a great one for lunch or dinner.", "author": "Robert V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-01", "description": "Stopped in here for a warming Irish Coffee during a cold winter walk. The staff was friendly and helpful, ready with coffee refills. But, I do have to say it was the Irishest of Coffees I have ever had. Only the brown color betrayed the presence of coffee. But, the coffee refills helped to tone down the whiskey.", "author": "Elizabeth H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-03-03", "description": "Not only does this place have one of the best burgers in NYC, it has excellent service, and a comfortable setting. I frequent the Heights for lunch and have never been dissapointed. I can't recommend this place enough.", "author": "Flemming S."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Heights Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Gtqea5YJjWmv9-NRFz9eTQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186255555"}