{"aggregateRating": {"reviewCount": 287, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-01", "description": "First Impression: Its dark in here, are they open? The ladies eating out front with the pearls tells me this place might be expensive.\n\nUsual Platter: I don't remember the name of the entree. I know it was fish \u0026 sauce with mixed rice \u0026 vegetables and a sweet plantain. My boyfriend had the lamb. Both entrees were DELICIOUS!!\n\nOverall Review:\n\nAtmosphere: Cozy. Slightly trendy. \n\nFood: WONDERFUL! The food is just so good. The presentation is fabulous. The flavors burst in your mouth and the colors are beautiful. They serve various breads in the bread basket which is very nice. Heck, even the water it great. \n\nService: Friendly and attentive. \n\nThumbs down for: Nothing that I can think of; its great. \n\nThumbs up: THE FOOD! THE FOOD! THE FOOD! \nThe location; right by the Brooklyn Pier that over looks the Hudson and Manhattan. The neighborhood and surrounding architecture are lovely as well.\n\nI'd love to go again. The food alone leaves an impression.", "author": "Kassandra O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-14", "description": "Came here for lunch on a weekday and ordered the Cobb Salad. Unfortunately, I came with someone who I was meeting for the first time, so I couldn't really stuff my face (the only way I really know how to eat) and only managed to pick at my salad...\n\nOverall, no gripes about food or service, but nothing really memorable either. I did request ranch dressing for my salad and was told they didn't have it. ... WUT. But oh well, the rosemary bread I nibbled on made up for it.", "author": "Alice C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-04", "description": "I stumbled upon this quaint corner restaurant and decided to try it out. I had the Rigatoni Bolognese which was delicious, like any other rigatoni dish, but it didn't stand out far from the norm. Prices were reasonable but beware if paying by credit card, they only accept American Express. The waiters are sure to check your card first before leaving your table to run the card, if they're going through that much trouble, why not accept other major credit cards?\n\nHeights cafe gets a 5 for aesthetics. I loved the indoor/outdoor seating arrangement.\n\nCheck out the two pictures i posted for the cafe!", "author": "J S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-08-17", "description": "I passed this place a few times and finally decided to go in. Big mistake...There are so many other great places to eat on Montague street. Our waitress did say it was her first day, but i doubt it, I just think she was stupid. We had to give her so much time when ordering, and she didn't even know what a root beer was. The bread in the beginning was forgettable and the food was as well. I don't mind paying a lot for food if the place has a good ambiance or if the food was great, but it was neither. If you're a cafe, get some cafe prices. Suggestion: Skip it", "author": "Matt M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-18", "description": "Inedible food. Overcooked pasta (how do you -every single time-overcook rigatoni? A fourth grader can set a timer) a raw burger ordered medium sent back that the cook *refused* to put back on the grill.  soggy, greasy pizza, quesadillas not much better. The chopped greek salad is good, but having ordered it more than once, no once can seem to figure out how to put the chopped chicken *in* the salad, instead of serving it as a separate meal on the side. This place, given its locale, will survive in spite of the food. It shouldn't. I have tried, but everything I've ever ordered here i would never order again. give up.", "author": "laura K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-13", "description": "It used to be better, before the redesign of the menu and the decision (completely unreasonable) to try to become more upscale.  Never mind the too attentive service (if I was asked once more whether everything was all right, or how was I enjoying that banana pudding, see below, I was going to stick a fork in someone's eye).  I ordered the roasted beets with arugula, goat cheese and walnuts to start.  Good enough.  But then the burger.  It shouldn't be that hard to do a burger, a good one.  But the glop of greyness atop the patty and cheese masquerading as caramelized onions depreciated whatever value the burger might have had, and the fact that someone in the kitchen thought it was a good idea to cover hot fries with a cold salad of mixed greens in oil/vinegar...I was left hoping for dessert.  I was told that the banana pudding was wonderful.  How can you go wrong with banana pudding?  You can, horribly, if you decide to reimagine it as, I'm not sure what it was, some sort of banana-flavored stuffing with a row of bruleed unripe banana slices in front of it.  And the server of course telling me that she could eat it morning noon and night.  Go right ahead, deaar; have mine.\n\nWhatever happened to the reliable quesadilla and the pizzas and the serviceable burger?", "author": "Clyde S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-04-03", "description": "I have been here a few times for the simple reason that anytime anyone from out of town comes in they want to see the promenade/Brooklyn Bridge and this is right on the way there or back so it is easy to pop in. \n\nIt's not that this place is bad necessarily-it just has very mediocre food for how expensive it is. In the past, I have typically come here for brunch and there are so many other great brunch places in the area, that unfortunately Heights Cafe just can't compete. I noticed the other day when I was walking by that they were closed for renovations-maybe the quality of food will improve after the remodel. \n\nI have not experienced the bad/rude service that others have complained about, although it has been slow a couple of the times I have been here.", "author": "Molly H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-10-05", "description": "This place was not good.  \n\nWe were visiting some friends in Brooklyn and ordered in from them because it was right across the street.  We ordered two sandwiches, and when they finally arrived, they were both completely soggy (despite the fact that they were being delivered from about 200 feet away) and generally tasteless.  The fries that came with the sandwiches were also soggy and tasteless.\n\nThe real kicker, though, was that I had asked for grilled chicken to be added to the veggie mozzarella sandwich, and the woman on the phone told me that would be $2 extra.  When the delivery man arrived, I looked at the receipt and realized it was actually $6 extra -- which was all the more ridiculous in light of how gross the sandwich was. \n\nMaybe it's just the sandwiches and the fries and the delivery that need to be avoided, as other folks seem to have had better experiences dining in.  But I definitely regretted ordering from them.", "author": "Breezy Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-19", "description": "After a nice stroll on the promenade on a beautiful sunny Sunday, I was ready to eat. It was around 3 o'clock in the afternoon, and we came across Height's Cafe. There was so no wait, so we jumped on it.\n\nThe brunch menu was pretty standard. You've got your pancakes, waffles, french toast, eggs, sandwiches, etc. I got the eggs benedict and my friend got the brioche french toast. I always have a crisis when it comes to brunch. Sweet or savory? Oh, the hard decisions I face. Good thing they taught us about sharing in kindergarten. Both dishes were very tasty, and I was able to find peace of mind in the balance of sweet and savory. A third friend ordered a chicken salad. It looked very fresh, but she said it was only \"alright\". The portions are pretty big here, I was stuffed for the rest of the day.", "author": "Julia Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-24", "description": "While exploring Brooklyn Heights, my sister and I stopped in for a brunch/lunch/quick bite.  First, the food was extremely bland and unimpressive.  The menu LOOKED good, but was poorly executed. My omelet was the most boring meal I've had in months and was slightly under done in parts.  My sister's chicken was dry as a bone.  The waitress never even asked us once how are meal was.\n\nOn another note, great for families.  If you have loud children, they will fit right in at brunch.", "author": "Heather W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-13", "description": "Nice outdoor seating and ambiance. Lobster sandwich and mussels were good.", "author": "Artime M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-10", "description": "Service was great and so was the food. Decided to sit outside on a lovely day. I started with the soup of the day, which was lentil I think, but it was just okay. Then I had to get someone's attention because I noticed every other table (except ours) had bread and butter, and we seemed to be forgotten. But after that I had a mouth-watering charbroiled burger and it was delish! And my date devoured his steak, so dinner ended on a good note and I'd probably return for the burgers because I'm such a carnivore.", "author": "Kate S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-21", "description": "Once again, I found myself looking for a place to sit outside and drink wine on a nice Spring evening. We stopped in at Heights cafe and I did BOTH! That's all I could have asked for.", "author": "Renee E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-17", "description": "It's ok, attitude of restaurant in general isn't great. Overpriced and underwhelming.", "author": "Aaron D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-18", "description": "I have never been impressed by this place because the food and service are quite average, but last night a friend and I decided to stop in for a simple dinner since it was on our way home. We were seated and given menus and water. When my friend picked up his glass the bottom fell out of it and the entire glass of ice water poured all over him. Okay, it happens, but here's what doesn't--there was no reaction from any of the restaurant staff. There were only about 8 other patrons in the restaurant, and THEY all turned and looked--it wasn't exactly quiet. My friend immediately stood up, drenched, and looked around for some help. Then I stood up. Still none of the staff as much as looked at us. The waitress/hostess who gave us menus was no more than 8 feet away in direct line of sight, but running her mouth with the bartender. We finally flagged over a bus boy and he picked up the bottom of the glass from under the bar and walked away. No towel offered, and none of the other staff even noticed. How is this possible in a mostly empty restaurant with the noise that the bottom of a glass makes first falling on the table then clattering to the floor. After standing there for a couple of minutes looking around for some assistance, I finally suggested we just leave. As we were walking out the waitress/hostess turned and looked at us briefly, then turned right back to the bartender and continued talking.", "author": "Allison P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-15", "description": "It's pretty much a glorified diner. The atmosphere is slightly (just slightly) nicer than a diner.  Food was fine (edible) and they were open on one of the major holidays (maybe Xmas eve?)  Would I come back here?  Maybe if it was July 4th or some other major holiday and I was too lazy to cook.", "author": "Anna K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-13", "description": "If not for the fact that you can sit outside (weather permitting) and enjoy Montague Street this may have dipped down to a 2-star review.  The food is not very good and certainly there is nothing special about it, but the place is nice looking and when I have eaten here the service has been ok.  I refrained from reviewing it prior to now because it was so unspectacular, I didn't even know what to write.\n\nThis is what my review from my last visit would look like: I ate a veggie burger, it was decent.\n\nI was home in the rain with my kids tonight, however, and we needed some variety via delivery and then came Heights Cafe try #3.  I ordered three appetizers : calamari, quesadilla and marinated chicken skewers and one entree : rigatoni with sausage and bolognese.\n\nCalamari - came with three sauces, all were very avg. to below avg. The actual calamari was just ok, unspectacular, but not bad.\n\nQuesadilla - Someone please tell NY as a whole that a quesadilla is not a form of a grilled cheese made in a circle and lightly toasted on lighter tortilla-like bread.  This was not a quesadilla, it was awful.  It was the size of a pizza, lightly toasted limp bread with cheese in the middle, sour cream drizzled on top like a cake and then a scoop of guacamole just tossed in the middle.  Every part of the flavor of every part of this alleged quesadilla was bad, it was not close to a real quesadilla.\n\nMarinated chicken skewers - n/a because I got a grilled chicken sandwich instead.  It is in the fridge so I can't say whether it was good or not, but it was not what I ordered.\n\nRigatoni - pretty decent overall for a diner or bar.  The pasta was boiled correctly and the sauce was alright, but there was barely any sauce actually there.  The sausage was good however and there was plenty of that.\n\nSo why after all that do I feel bad even 3-starring this place?  I grew up going to whatever this place was in the late 70's and early 80's so it is still nostalgic for me, as a location.  I still want those sunny-side up eggs on the toast from back in the old days.  Also, I like the look of this place, it seems to be full of potential, but the food just does not match up to the venue, physical location or prices.\n\nI still want to like you Heights Cafe.  Maybe we can friends someday, who knows?  But we can never date, you just are not my type.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-11-06", "description": "I chose to come here for brunch primarily because of the great location. My aunt was visiting Brooklyn for the first time and the restaurant is only a couple of blocks from the promenade.\n\nI had the Poached Eggs with andouille sausage, hominy, peppers and onions in a crisp tortilla cup with avocado coulis. It was an interesting option at an American restaurant but it was not too bad. The flavors were great but I'm not sure if I like my poached eggs with crispy tortillas. Additionally, as mentioned in prior reviews, the service was a little slow.", "author": "Elaine C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-18", "description": "Sitting at the empty bar with a few older regulars and ordered a pint and a pizza. 45 minutes later on my third pint still no pizza. Terrible kitchen service. Bartender was nice enough to buy me a beer but I won't be back. Atmosphere is like being at a IHOP frankly.", "author": "Rich R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-26", "description": "Great lunch spot during the middle of the day - especially when you can sit outside. We all enjoyed our meals and my salad was so filling that I ended up taking the rest home for dinner - definitely prefer this to Teresa's next door.", "author": "Heather F."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Heights Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Gtqea5YJjWmv9-NRFz9eTQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186255555"}