{"aggregateRating": {"reviewCount": 287, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2009-04-09", "description": "The food....ok. Service....sucks. Our waitress took our beverage order. Never bothered to ask if we wanted an app. Finally when she came back, we ordered our apps and dinner. The crab cakes were worthy of \"negative stars\" on this thing. Sesame crusted tuna was boring. Food was below average. So..food runner brings the meal. The waitress comes back a few minutes later to refill our drinks. That was the last we saw of her. Food was finished, cleared, and 15 minutes went by. No waitress. I went up and asked for another server so we could pay the bill. On the way out, i asked the hostess where our server was and told her we hadn't seen her forever. She asked \"what did she look like\" ...i told her I'd forgotten since it'd been so long. NOT going back here and definitely wouldn't recommend!", "author": "Lisa S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-21", "description": "A decent spot for a meal in the Heights. Easy to get a table, and the food is fine, not great. Very crowded with kids, but great if you're with one.", "author": "Emma H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-11", "description": "For the life of me, I can't understand why this place gets so much business. The food is incredibly mediocre and decor is subpar and cheesy. This location SHOULD be home to a good restaurant, since it's prime real estate in Brooklyn Heights, at the intersection of Hicks and Montague, with great retail adjacencies and a block from the Promenade. Perhaps that's precisely why Heights Cafe isn't any good - it doesn't have to be. I have only been to this place twice - once before I moved into the 'hood, and then another time for brunch when we had no food in the apartment, Jack the Horse wasn't open for brunch, were too lazy to walk to Smith Street. There's much better food available, people! Seek it out.", "author": "Jenn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-15", "description": "First of all, to all the naysayers in this review column, the restaurant has been in operation since November 1995, 14 years, no small feat in a city where resturants open and close with alarming regularity.  Yes, they only take American Express, and for that I am very happy.  It is a local place, supported by the locals.  Yes, in summer, they do get a tourist trade, but in the winter, if you go regularly, which I do, you see the same faces.  The food is good, not off the charts, but reliable.  It is not fine dining, if you are looking for that, go to the River Cafe.  I love ot and I am happy it is in my neighborhood.", "author": "Angela D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-04-10", "description": "The Heights Cafe sinks to new depths. You may want to think twice before patronizing this resturant. Our recent visit on Monday, April 9th, 2012 was disappointing to say the least. We had seven adults in our party and went there for lunch. The resturant was not crowded and we were still  made to wait for our table. Our waitress although courteous was very inexperianced. Our initial drink order was short two drinks and if that wasn't enough when our entriees were delivered one was missing to which our waitress was clueless. When we informed her of this ( and after looking like a deer in the headlights) she said it would be out in three minutes. Fifteen minutes later when everyone was finished eating, the entree was delivered with no apology or explantion. Ok.....there's more! We put the issue behind us and inquired about a cake with writing on it for our celebration. We were told we have a choice of two cakes and were advised to chose a certain one of the two we didn't want because it was easier to write on. Once again we graciously agreed. We asked for the price with a possible reduction for a show of customer satisfaction for the extreme lateness of our entree. We were told they had to call the manager and get back to us. There seems to have been no one wanting to take charge and the inmates where running the asylum, however there was a waitress with dark hair and a ponytail that seemed to have a lot to say behind our backs and visibly a disgruntled person and not an asset to this business. After a long wait we were than informed that cakes are only sold by the slice at $6.50 each and there was nothing they could do. We tried to be understanding and asked for a possible discount for customer satisfaction and some of our party where neighborhood residence. We were told once again they would have to call this mysterious absentee manager. After another prolonged wait the check was delivered to the table with no explanation. When we once again inquired about the discount request we where told the manager via phone said no. The clueless waitress seemed uneasy and nervous but said she would take the preset gratuity off the check. This was a nice gesture on her part but we left her a tip anyway. THE POINT IS; DO YOUSELF A FAVOR, DO YOUR FAMILY A FAVOR, AND DO YOUR FRIENDS A FAVOR: DO NOT GO TO THE HEIGHTS CAFE!!!!! You may want to try Theresas', its right next door.", "author": "Michael Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-01-03", "description": "i went here for brunch one day, went to highschool in the neighborhood and always wanted to try it. i wasn't that impressed with the food....and that shocked me because how do you not excel at brunch food?! anyhoo, the service was great which is why i gave them 3 stars.", "author": "Jenelle P."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Heights Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Gtqea5YJjWmv9-NRFz9eTQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186255555"}