{"aggregateRating": {"reviewCount": 287, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-19", "description": "Really enjoyed this place.  The atmosphere was lovely.  There is a front area that is more pub-like with a bar and TVs and a back room that is more of a formal dining room.  The wait staff was very attentive and friendly and the food was good. \n\nI live in the area and will definitely return to this place.", "author": "Bevin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-21", "description": "Sat outside on a beautiful day with my spiced chicken salad sandwich for brunch. My friend had the eggs benedict which was really good. Fun people watching and good service. It was a wonderful brunch. Servings are a little large, I had the other half of the sandwich for dinner.", "author": "Sneha P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-02", "description": "The bread basket for brunch was awesome.\nwaiter was nice. food was good. felt a little out of place, but hey, good stuff.", "author": "Adrianne E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-28", "description": "While the food was very good, the service was fine, but there were 12 of us, so fine is pretty good!\nWe all enjoyed our late lunch/ early dinner and they accommodated us very quickly.  The wines by the glass were good as were the beers on tap. As a group and as an individual we will return to the Heights Cafe for sure.  Tell Joe that Peter sent you!!", "author": "Peter H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-08-04", "description": "As others note, it is rare that a restaurant like this survives this well in a neighborhood like this.  That really is significant, and the reasons it has survived are reflected in the decor, food and service, but that said, it could use some polish.\n\nI was in here for lunch with another foodie friend.  We were on a business excursion, our stop was unplanned, and we weren't looking to put a lot of effort into getting lunch.  I had the salad Nicoise, she had a tilapia wrap.\n\nMy salad was far above par--the greens were fresh, properly dressed, with the requisite potato, green beans and hard boiled eggs present but not overwhelming the dish (like a lot of places do, turning it into a tuna chef salad),  The dressing was tangy and sweet, but not cloyingly so.  The tuna, which I requested medium rare, was thoroughly-seared on the outside and warm pink in the middle, just as it should be.  This dish held together beautifully, which means it is not a menu throwaway afterthought, added to give nouveau-cred to a bar menu, someone cares about getting this classic salad right, and they do.\n\nMy companion's tilapia wrap did not get so much attention.  It was under-seasoned and forgettable.  Not bad at all, don't misunderstand me, but it fell short of the excellence of my salad.  It was served with a side of potato chips, which were good, nicely-done, unevenly browned for a wide variety of flavors from the caramelization, but we clearly got the bottom of the bag, or the bin, served mostly small pieces of broken chips.\n\nYo, save these for the crew, don't serve them to a paying customer. \n\nThe service could have been more attentive, and the food took a long time to come out.  I could see the kitchen from my table, and since I spent 11 years as a line cook myself I can tell a bit about what was going on.  They seemed swamped with take-out and delivery orders, and this was slowing the service to people like me.  \n\nOuch.  That's not fair to their waitstaff.  They're they ones who get penalized for food coming out slowly, particularly at lunch.\n\nSo, while the salad was good enough to make a return trip, and the tilapia wrap wasn't disappointing enough to keep me from doing so, I'm enough of a restaurant snob to take issue with the lack of attention to detail here, and the inconsistency that can be attributed to a too lean kitchen staff, an inattentive executive chef, creating an inadequate staffing model and inconsistent lunch menu.  They're probably doing okay because of the volume they see, but they sure could be better.\n\nPolish, that's what this place needs, polish.  They're coasting, they need to pick it up and get enthusiastic again about what they're doing here,  There's reason to be.", "author": "Richard D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-13", "description": "Went here for lunch and....um, yeah. Don't go here, at least not for food. Below average food. But decent service. And great location. Maybe come if you're tired of walking on the promenade and need to sit down and have a soda or something.", "author": "Haj da P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2007-04-02", "description": "One year ago, I visited the Brooklyn Heights Cafe.  One year later, I'm still thinking about it, as it was the most appalling dining experience of my life, and citysearch wouldn't have a word of it.  They never posted my honest, factual review of the experience.  We know what really matters to them.\n\nFor lunch, I ordered a mediterranean chopped salad.  The salad tasted good, and I inhaled it a minute too fast.  After one too many bites, I noticed an inconspicious green worm tucked under a bite of (green) salad.  He was the size of an olive.\n\nYou'd think that a restaurant who carelessly lets a worm slip on your plate would comp the ($40) meal, right?  Ha!  They took the salad off the check, but charged us for everything else.  \n\nFinally, I'm just glad to have a voice in a place where posting a review is not contingent on advertising money!\n\nps.  I give it zero stars.", "author": "Brigitte T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-13", "description": "Been going to this restaurant for years now.  Always have a good time here when I have the money to spend as it is a bit on the expensive side.  The pizzas they offer are rockin'!  I have always found the wait staff attentive and friendly, especially George who is always a pleasure. \n\nHowever, my complaint is the man who hovers over my shoulder waiting for any sign that I may be done with my meal so he can take my dish away!  On one occasion he came over to me about 3 times within a 10 minute span asking if I was done, and I still had a lot of food on my plate!  I thought I was on a hidden camera show or something!\n\nThe place is good to grab a few drinks too.  The bar is usually not that crowded and the people sitting there are usually mellow and chill.  Todd the bartender is awesome!", "author": "Dean R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-09", "description": "Echoing the sentiments of everyone else on here (except for the one guy who gave it 5 stars, but he's clearly the owner), the food is mediocre. I've had everything from the Sesame Crusted Salmon and Tuna Salad (which is, strangely, light on the salmon and tuna) to the Nicoise (less than fresh) to the burger (overcooked), but everything has been just \"meh.\" But the Heights Cafe is a great place to sit outside on a clear night, and if you're strolling down Montague with your puppy (as I often am), it's a decent place to sit outside and grab a bite--as long as you're not expecting anything special from your meal.\n\nAmex only.", "author": "Michele W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-03-03", "description": "Only two things are worthwhile on the menu:\n\n1. The burgers.  Large juicy, on a chewy roll.  Fries are shoestring, deep fried past golden brown.  Nicely done.\n2. The BLT served at lunch.\n\nThe rest is entirely disappointing -- fuel for the belly, nothing more.\n\nOne note: Amex or Cash only  -- No Visa or MC.", "author": "O U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-07", "description": "Hassle free brunch.  No wait on a Saturday morning.  Good number of tables outdoors and plenty of tables indoors if you prefer a cool dining environment.  I ordered the salmon sandwich and it was delish!  I'm basing the review on my order only because my other friends thought their food was only average (basil pizza, zucchini omelet).", "author": "Thompson L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-10-12", "description": "I really wanted this place to be a favorite place to grab food in b-heights, but unfortunately the food was only \"so-so\". My pulled chicken sandwich was lacking in flavor, particularly in the bbq area, and, yes, the coleslaw does come on the sandwich, not on the side (as per our waitress). Soup was okay and so was my boyfriends chicken caesar. Waitress was kind of void of personality, but then brought it out at the end (maybe it's her gimmick right before she gives you the bill and you're calculating your tip, or maybe her day was lame for awhile...I won't judge). \n\nSo, unfortunately, I don't see myself running back here anytime soon. Again, I wish I could give them a half star here, but if I'm going to go by the verbiage next to the rating box, \"meh, I've experienced better\"", "author": "Michael B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-11", "description": "Mediocre uninspired. Terrible menu choices what more can I say good location nice staff .", "author": "David W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-05-21", "description": "Dined her for dinner over the weekend randomly. Pretty unimpressive. She had the scallops, I had the lamb. The scallops seemed really un-fresh (relatively.. not fresh is okay for this price, but these were kinda bad). My lamb was pretty well-done and the spinach under the corn was a bit of a surprise. It seems like they'd do better with simpler menu items, I guess.\n\nOh, and if \"Takes credit cards\" means ONLY American Express, then yes, it does, in fact, take credit cards. I shoved my Mastercard into the credit card thing on the bill and was told only Amex. I just wonder how many times the waitress has to say \"there's an ATM in the grocery store the next block over\" in a day. If I wanted sub-par food and to be in a grocery store, I would have just cooked for myself!!", "author": "Grant H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-22", "description": "I came upon the Heights Cafe after strolling along Brooklyn Heights and looking at the fabulous view.  The outdoor seating looked inviting and so my friend and I decided we would grab some dinner there on a Thursday night.   \n\nMy choice of the evening was the Fresh Mozzarella Sandwich - grilled multigrain bread, roasted peppers, tomato, basil pesto, grilled eggplant \u0026 heights fries - $8.95.  It was yummy and delicious as I recall, but it was just too much.  (I had a Junior's cheesecake not too long before arriving, so I couldn't fully enjoy my dinner.)  My dining companion had the Trout with Wild Rice Pilaf and Snow Peas.  He seemed content with his meal as well.  \n\nThere was just something I really liked about this place.  It's casual and I would love to have a restaurant like this in my neighborhood.  And that's what it is, a neighborhood restaurant.  Looking around, you would guess that the diners probably lived within walking distance of this eatery.\n\nI could imagine myself joining the masses for a busy Sunday brunch here.  Yes, it's not a place one purposely seeks out just to have dinner.  But if you're in the neighborhood, definitely give it a go!", "author": "Teri C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-07-27", "description": "I tried this place on a Sunday night for a quick/casual bite.  The menu looked good, and there was a steady stream of people coming in, so all signs were positive.  \n\nI ordered the marinated grilled chicken sandwich at the recommendation of the waiter -- and it was horrendous.  Extremely dry and bland, and I couldn't eat more than three bites of it.  What was the marinade -- water?  The fries that came with it were not worth eating.  \nWe also ordered the vegetable quesadilla to share/start.  It was also dry and bland but at least this was edible.\n\nPerhaps the other things on the menu are better, but if this place is supposed to be a neighborhood cafe / bar \u0026 grill, and they can't get the basic grilled chicken right, that's a bad sign.  Also, the service was sub-par.", "author": "Cynthia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-24", "description": "the whole wheat pancakes and waffles were kind of awesome! And considering the location extremely convenient. It was kind of empty in the morning but it started to pick up. The decor is not very personal and you feel like you're in a hotel restaurant. But the food was good and so was the service.", "author": "Ainsley R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-26", "description": "My dear friend and I decided, after years of neighborhood neglect, to try this corner cafe just across the street from her Brooklyn Heights apartment.  Our hopes were not high, but if for some reason this cafe was indeed a winner, or even just decent, it would lend itself for a close food fix.  Outside dining was also appealing on this sunny day in late August.  We walked right in as we were in a bit of a rush an sat down at an empty table for two in the sidewalk dining area.  We were handed large laminated menus by a faceless women who made no polite gestures or introductions.  Small white plates, filled the tiny table for no apparent reason.  I decided on my go-to brunch favorite, eggs Benedict.  The quality of hollandaise sauce alone will determine our return.  Lee ordered granola with fruit and yogurt, pretty fool proof.  I ordered an Americano and she ordered one iced.  I took a few sips of my water as we waited.  A large man came by to fill up my glass, a proper act, but this task was done with such vigor and carelessness that ice cubes went flying into my bag of return purchases and my legs enjoyed an impromptu bath.  He silently handed me some napkins.  The drinks showed up, both hot.  The man that delivered them was very confused about the notion of an \"iced\" Americano, but eventually one made its way to our table.  When the meals came, the nameless server did not ask if we needed anything and quickly sauntered off.  The poached eggs that sat on the sad slab of ham were not the picture of Sunday Brunch Dreams, but rather the after thought of a lazy house frow.  The beautiful, rich and delectable hollandaise sauce I was hoping for was replaced by a snot rocket of yellow.  The \"home fries\" I asked for (well done) were a heap of white potato shred.  If you crushed some Idahos while wearing Timberlands and picked the shit out the soles you could easily recreate this side oder.  It was all unappetizing to say the least.  The lack of sauce was so foolish, I should have taken a picture.  I apologize.  Honestly, it was notably funny.  SInce I wasn't sure who our waitress was I told some girl the sauce situation was greatly lacking.  Without even letting me finish my sentence she ran away wreaking of attitude.  I shouted, \"and ketchup!\" after her.  Some other lady came by to see if I needed anything.  Too little, too late lady, whoever you are.  The sauce and ketchup returned along with the attitude.  We ate just enough to satisfy our hunger and peaced out, with no fair well from anybody.  The \"A\" on the outside of the door is clearly for Attitude and NOT the quality of service.", "author": "Kerrin G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-01", "description": "After reading several reviews I was excited to try Heights Cafe. I wish we would've went somewhere else. I ordered the Benedict and my food was cold. I asked the waiter to please heat it up and even after all that it came back luke warm. Service was slow and we didn't see our waitress for the entire meal, conveniently she came by to drop off the bill. I would maybe try the place next door.", "author": "Drea A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2007-11-29", "description": "My bf and I stumbled upon this place when we were walking along Montague St on a Sunday afternoon after attending open houses.  We wanted to have a light lunch and didn't really see many affordable lunch places on Montague, so ended up here instead. It was still pricey, but we decided to give it a try since there were more people here than other restaurants.\n\nWe shared tarragon/squash soup, plum tomato pizza, and curry chicken wrap.  The soup was much different and not as good as I thought it would be, but it was still decent.  The curried chicken wrap didn't taste that good at all - it had no flavor at all.  I had to add salt and pepper when I took it back home.  The plum tomato pizza was really the only thing that I liked.", "author": "Caroline C."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Heights Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Gtqea5YJjWmv9-NRFz9eTQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186255555"}