{"aggregateRating": {"reviewCount": 287, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-30", "description": "We got here at noon, right before the lunch rush, so we had our pick of tables.\n\nI got a Mediterranean wrap with fries - I don't like fries but these were yummy! The wrap was delicious as well. Outdoor seating was a huge plus. Our server was a bit.... meek in that he didn't really say much, but he was overly aggressive when he took my plate even though I was obviously resting my bread on it! \n\nBy the way, the bread was YUMMY. Yum yum YUMMY. \n\nIf I'm in the neighborhood again I'll make a return trip to Heights Cafe! \n\n(PS- Photos courtesy of Thomas O. of Honolulu)", "author": "Ollie D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-04", "description": "I've lived in this neighborhood for years and rarely go here--a generic and uninspiring spot. Finally decided to give it another go and had brunch. The fritatta bore no resemblance to that dish but was more like a disc of (overcooked) egg with some veggie toppings, as if on a pizza. If it was un-fritatta-like but tasty, then fine, but was not, sad to say. Brooklyn Heights has a lousy reputation for restaurants, precisely because of mediocre places like this.", "author": "marian b."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-06", "description": "I went here for dinner with a friend of mine who lives in the area.  I had never come out to her area before and she is moving back into midtown so this seemed to be my last chance.  We went to Heights Cafe for some bar food and definitely fulfilled that expectation.  The waitress forgot to put in our order for spinach-artichoke dip but it ended up being unnecessary anyway since the portion are huge here.  I had a pizza that had a variety of meats on it and my friend had a burger with fries.  I finished the pizza only with the very smallest amount of help from her and she only finished half of her burger although I helped out by eating some of her fries.\n\nThey only accept Amex and cash which was slightly problematic since I had just spent all of my cash in Vermont.  My friend ended up having just enough cash (including quarters) to cover the meal/tip so we didn't end up having to run to an ATM.  After dinner we walked down to the water to look at the skyline which was a great way to end my visit to Brooklyn Heights.", "author": "Jess K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-15", "description": "Came here for dinner with my girlfriend on a Wednesday night. We were seated right away. The menu had a pretty standard variety of options to choose from. We got the spinach and artichoke dip which we devoured right away and the veggie burgers. The black bean salsa was amazing but in retrospect, I would have preferred to stay away from the wheat bun as the whole burger had a very dry feel to it. Overall, great dinner spot in BK Heights, very reasonably priced, and we were able to enjoy a walk on the nearby Promenade right after so definitely a plus.", "author": "Manosai E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-12", "description": "Nice pleasant brunch in an outdoor location. Nice fritata, nice salads and very spicy Bloody Marys.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-18", "description": "Had the Blackened Chicken Pizza. Not bad...\n\nService was good, waiter was handsome and attentive, atmosphere was awesome and lively. I would've loved to have sat outside, but they didn't have the patio area set up that day.\n\nDecent place to stop at after exploring Brooklyn Heights.", "author": "Derek D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-05", "description": "I was not expecting much of Heights Cafe, thinking they would rest on their location and coast on \"meh\" cafe food but I was oh-so wrong.  I ordered the pizza special one night--a pizza with eggplant, fresh mozzarella, spinach and mushrooms--expecting some delicate, cracker-thin crust pizza.  What I got was a robust pie that I totally could have split if I didn't want to stuff my face (if that ever happens, I'll be sure to make a note of it) and I was ecstatic.  The crust was chewy and fully supported the ample toppings, and I was impressed that the whole thing stayed together as I made my way through the slices.  \n\nMy mom got the gnocchi, which was very overcooked.  I'll give them a pass because I have yet to find a place that treats gnocchi right, but still.  If you're gonna boil it into oblivion, why even serve it??  \n\nThe grand finale, dessert, was a warm banana bread pudding...WHOA.  It was just so awesomely gooey and homey I couldn't stop eating it even though I had already eaten my whole pizza and half the bread basket before our food arrived.  \n\nI will definitely be back to the Heights Cafe, but I'll probably wait until someone else is paying again", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "Food is much improved! Good drinks for reasonable prices. Fun neighborhood place with great outdoor area", "author": "Maura T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-07-03", "description": "I think we got some of the worst service we've had since moving to NYC.  \n\nThe food was average at best and it wasn't cheap.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-07", "description": "Came here in the evening for dinner on a Saturday, were seated outside, had Amazing Salmon Burgers! We really enjoyed ourselves. Good food, good service :)", "author": "Nala H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-09-25", "description": "The onion rings are tremendous. cripsy and light  A+ \n\nnice outdoor seating area; you don't feel like you're right on the street. \n\nBrunch is reasonably priced. \n\nA safe bet in Brooklyn Heights", "author": "Vinny N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-02", "description": "First off, great area. Really sets the tone.\n\nAmbiance is great, has this mellow feel to it. I'm a mellow guy so its right up my ally.\n\nStarted off with the artichoke dip, awesome and not too thick.\n\nMain course I had the goat cheese ravioli, really nice. I wish there was a biiit more sauce but it was still really good.\n\nDesert, creme brulee, best part of the meal. I'm still thinking about it.\n\nNice service, hopefully next time i go its nicer out and i can sit outside.", "author": "Chris F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-27", "description": "Bad service. Food - nothing special - below average.\nWith a steak I got sour (musty) mashed potatoes.\nA price not correlated with a service and food quality. For this kind of food and service - very overpriced.\nIt was the first and the last time i ate there.", "author": "Arcady L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-23", "description": "Hmmmmmmm, crab cakes. And close to a beautiful promenade along the river!\n\nThey came fried golden, atop corn and wild rice and with half of a caramelized plantain sliced lengthwise. \n\nHowever, my date wasn't that pleased with his BBQ chicken sandwich. I think it had coffee in the sauce or something.\n\nThe service was OK. The waitress seemed like she was in a hurry to get us out, even though there weren't many people in her section. We weren't taking up any seats from people who needed to be seated.\n\nThe food was delish (at least mine was) and the price was right, so I'll be back.", "author": "Zenovia E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-07", "description": "I recently moved to the neighborhood and really enjoy this restaurant! I came here with some friends and we sat outside drinking cocktails and munching on some appetizers. The meals being served around us all smelled amazing. I will definitely be returning to enjoy a full meal!", "author": "Allison J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-12", "description": "My boyfriend and I recently moved to the neighborhood and we wanted to give Heights Cafe a try. I had seen people sitting outside with their dogs so I didn't think it would be a problem to bring ours on a beautiful Saturday. Well not only were they not accommodating of our dog (they sat us in a back corner of the outside patio that had a gap in the partition and any time our dog came through the gap they would sternly say he had to sit outside the partition), but the food was bland and way overpriced. The service took forever, we were not the only table complaining how slow it was. We ordered before the table next to us and it took 15 more minutes for us to get our food. And the check took a full 20 minutes to come. It was a very bad dining experience to say the least.", "author": "Carly B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-07", "description": "i really liked this place. I live in Tribeca so i don't normally travel out to BK for food, but was meeting a friend close to her apartment and I was pleasantly surprised.  Very laid back solid staple food for a really good price.  They have a huge outdoor area and we sat outside. I got the Salmon and it wasn't too dry, capers really added to the flavor. My friend got the hamburger which was very juicy but not too greasy. Wait staff was pleasant, it was during the week during the day around work lunch time but we didn't feel rushed at all.  Over all a pleasantly surprising nice place.", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-29", "description": "Just came here for the first time today and it's definitely a good place to hit up for brunch. Very clean and well kept establishment with a friendly staff. \n\nI had a chicken sandwich with fries which was pretty decent. I'll come back to sample other things on the menu and will update my review accordingly if required. The only reason I am not giving this place 4 stars just yet is because I wasn't wowed by anything in particular but I might be once I sample other things on the menu. If you are in the area definitely check this place out, you may really like it.", "author": "Harry B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-03", "description": "Came here for dinner. The fish (cod fillet) was excellent. Cooked perfectly, skin was crispy, dish not over seasoned. The bed of rice it was sitting on was slightly sticky, which was great, with really tasty fresh vegetables and mushrooms. Portion size was perfect, not too big, not too small. Boyfriend seemed to enjoy his steak and the three cheese grilled appetizer with guacamole was really good; fresh and not too heavy. \n\nWine list OK. Good selection of wines by the glass, though I didn't really enjoy the Malbec the waiter recommended, but that's nobody's fault. Service was friendly and attentive. Decor is nice; dimly lit and cozy with booths and tables. \n\nOverall, enjoyed our time here as well as the meal and would come back if in the area again. Block away from the promenade. Would definitely try this place for brunch.", "author": "Olga P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-06-01", "description": "Their service is HORRIBLE!!\nBut other then that, I've always ordered their pulled bbq pork sandwich and cheese quesadilla (don't order it with chicken, it isn't that great in my opinion and I could do without the Guacamole)\nIf they could just improve on their waiting services, this could be a pretty perfect place.", "author": "Naty M."}], "servesCuisine": "American (New)", "priceRange": "$11-30", "name": "Heights Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "84 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/Gtqea5YJjWmv9-NRFz9eTQ/ls.jpg", "@type": "Restaurant", "telephone": "+17186255555"}