{"aggregateRating": {"reviewCount": 128, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-30", "description": "I have no idea why this place has so many stars. Friendly service and that's about where it ends. I got the 3 roll spicy combo that comes with tuna salmon and crab. Well I couldn't tell what roll was what because there was 10 pounds of spicy mayo slobbered all over it and that's all I could taste. Unless your one of those people that pours a bottle of hot sauce on ever thing u eat avoid this place at all costs....", "author": "Dave R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-22", "description": "I stayed at the St George dorms when I was in college and every Tuesday, a whole group of my friends and i would come here!  A few years later, I moved down the block with some friends we still came here, this place always had us coming back. It's small and very intimate which is great! And plus, their spicy tuna is OUT OF CONTROL! It's SO spicy!! It hits the spot!! If you're in the area, or want great sushi for a good price, try this place!", "author": "Olivia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-20", "description": "A hole in the wall with great sushi that is incredibly fresh and the mom and pop service from Mr. and Mrs. Cho are tops. We had a phenomenal meal there particularly some of the eel-spicy tuna and shrimp tempura combinations. So its near the subway, this is New York not Peoria so what's the big deal if the food and service are first rate.", "author": "joshua k."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-11", "description": "Really like the quiet and quaint atmosphere. Spicy tuna and California were my favorite rolls. Fire cracker roll was too much cream sauce spread on it.", "author": "S C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-05", "description": "Don't know why I avoided Sushi Gallery for all these years. It's very good. Frankly, it's the best sushi I've had in Bklyn Heights (gasp, yes, better than the nabe beloved Iron Chef located one block away, which IMHO is average). \n\nPerhaps it's because the restaurant is technically located in the Clark Street subway station that weirded me out a bit. But I heard good things from nabe friends, it's recently been awarded an \"A\" health rating, and walked by their refrigerated vending stand a few weeks ago and thought I'd give it a try as a post-gym dining option. I grabbed a few eel/avocado and spicy tuna rules and some miso and was pleasantly surprised. \n\nAnother surprise was the decor. It's very small inside, but also very cute, cozy and clean. The husband and wife team are super polite and pleasant. And they are opened until 11pm, which is gold in this area. \n\nWent back a few nights ago and the uber-courteous husband/wife team rolled me a few fresh ones, which were excellent.  The third time I tried them, the sushi was delicious and fresh, and the Udon soup I had was very tasty, with perfectly al dente noodles.\n\nVery inexpensive--about 30% less than area sushi joints, and better.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-05", "description": "this out-of-sight sushi place not to call it a restaurant since it does not have the strong scent of a restaurant, serves one of the freshest sushis in town in a cosy atmosphere. Not a top-class one, but never lets you down for what you pay.", "author": "Volkan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-24", "description": "I've lived in the Heights for a little over 2 years and only recently discovered this gem.  Frankly, I avoided this place like the plague as I mistakenly assumed that anything connected to a subway station was infested with the cooties.  But one evening, perhaps feeling emboldened by the NYCDOH \"A\" stamp of approval, I went in and ordered a yellow tail handroll, salmon skin roll and salmon roll.   I was seriously blown away by the fresh taste and quality of their fish.  Since then I have been ordering take out from them weekly.", "author": "Charles L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-31", "description": "This is a great little find especially in BH. The fish is very fresh and all their other dishes are equally as tasty.\n\nIs it Blue Ribbon Sushi, Hibino or Sushi Yasuda? No, but it does the trick.\n\nGreat Mom and Pop vibe. Mom does the hot foods, while Pop handles the sushi.\n\nI have yet to try their Korean dishes, but I hear they're quite good too.\n\nThey also have one of the largest hot sakes I've ever seen!\n\nAlso, when they get really busy, because it is tiny, they will turn away take out customers to focus on the in restaurant clients. Nice call.\n\nI've been apologetically turned away from the sushi bar when they've been packed because they didn't want me waiting for food. NIce call.\n\nThis place is a great local joint.", "author": "Hank M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-10", "description": "Best sushi in NY! We lived in the Brooklyn Heights for 3 yrs and went to Sushi Gallery every week. Everything is fresh and the miso soup is the best I tried. The best part are the owners, such great people. They make you feel welcomed every time. Sonya and Quan, if you read this: Alex and Nadia wish you all the best!", "author": "Nadia D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-19", "description": "Sashimi was good; rolls and service were less than stellar. One of the rolls was little more than a piece of cooked salmon atop a bit of sushi rice; not very flavorful, and it wasn't even cut. Maybe they forgot? Plus, we were told after our meal that they weren't accepting credit cards, even though their signage clearly indicates that they do. Keep looking...there's better sushi to be had", "author": "Brett S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-20", "description": "granted the sushi is nothing amazing BUT if you're the type or person who wants to support the \"mom \u0026 pop\" stores of this world.. \n\nYou MUST do yer best to snag some take-out rolls and support the literal mom \u0026 pop team doing their best to make a living at this hole in the wall on Clark St. They're the nicest husband \u0026 wife team you'd ever wanna meet. \n\nI wish Tampopo would make a sequel featuring these sweet folks..", "author": "d l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-10", "description": "The sushi here is really good and always tastes fresh. The lunch specials are also a really great deal. Healthy, tasty food at an affordable price is a definite must visit in my book. Location is rather secluded but if your goal is not about the dining experience then check it out.", "author": "Dingin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-05-03", "description": "The best sushi I've ever had. I've been here so many times I've gotten free food, they've known me for so long. \n\nIt's located right outside of the Clark St train station (2/3) and run by 3 Japanese people who couldn't be kinder or more courteous. The atmosphere is peaceful, relaxing, and tranquil. About 6 tables, and the sushi bar to sit and eat as you watch the guy prepare the food. \n\nThe menu is robust and plentiful, and everything tastes amazing (and the price isn't bad either!). My favorites are the volcano, tropicana, willow, clark, and so many more I can't think of right now. The salad and miso soup are delicious as well. \n\nI absolutely love everything about this place. It's well worth the trip.", "author": "M L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-16", "description": "There should be more places like this in every neighborhood.  I stop by here a few times a month for takeout / grabbing food on the way home from work. There's no bells \u0026 whistles or pretense, which keeps the prices very reasonable for decent neighborhood sushi...no, it's no Sushi of Gari, but it's still reliably and consistently good food.  I've also had some of the hot food (such as the bim bim bap), which again, it's not like going to a spot in K-town, but still pretty good.  \n\nBut most importantly, it's run by a very nice couple . - exactly the kind of people you want running small businesses in your neighborhood.  They are pretty quiet, but thoughtful - e.g., they usually have a stack of magazines for customers to peruse while you wait (which is never really that long anyways) for your takeout food - and there was one night when it was pouring and the wife saw me standing right outside the restaurant, along with other people who just got off the subway, waiting for the rain to let up - and she came out and offered me an umbrella - she said she knew I would be by soon enough for food and sent me along my way.  Very nice people!\n\nP.S. They are closed on Sundays - the couple needs a day off!", "author": "Lexi T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-10", "description": "Family owned, super fresh sushi and great service, not like that piece of crap restaurant across the street. They barely speak english yet have never gotten my order wrong. how is that possible! love sushi gallery for affordable fresh sushi in brooklyn!", "author": "Mel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-27", "description": "What a hidden gem in NYC.  The reviews were appealing so I decided to trek from the UES to see; and I was not let down.  With only me and myself I didn't have an opportunity to try a wide array from the menu, but what I did have (1 Clark roll, 1pc. tuna, 1pc salmon) was wonderful.  I find typically many sushi restaurants feature to much tempura, or sushi in razor thin slices, but this was not the case at Sushi Gallery.  I had more than enough options from the sprawling Roll menu, and the sushi was quite thick, all for a reasonable price.  The mom and pop reviews seemed to be right and the place did look right out of Tokyo, which I really appreciated.  I look forward to my next visit soon regardless of the long journey!", "author": "Chris W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-30", "description": "This is the cutest little place! Found it by accident one night and I'm so glad I decided to give it a try. They have really good rolls at very reasonable prices. Their miso soup is also really good. If you decide to stop by, try their New York roll! It's super yummy, it was by far my favorite! Definitely going there again.", "author": "Simona R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-27", "description": "Best sushi in Brooklyn Heights.  Service is great, it's never too crowded and the food is delicious!", "author": "Bevin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "I can't say much because I've only been here once, but the bibimbap is outstanding...addictive, even. Very reasonably priced. Tiny place, only a few tables, very nice staff. Clean and quiet. Looks like a mom and pop shop. It's NOT in the subway, it's at ground level.", "author": "Craig G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-12", "description": "Had lunch here another day and came out more then satisfied. From outside place doesn't look like much as a matter of fact it doesn't look like much inside either but u just have to give it a try. Its run by a very nice couple, attentive and polite. Its a small place about 5 tables and few bar stools however the menu is pretty extensive. From simple sashimi to lots of special rolls. I had a mushroom soup that was soo flavorful it felt that they just picked them from the forest. Its not a fancy place, just a place to come and eat fresh, tasty food.", "author": "Nika K."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Sushi Gallery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/w9fIg-_3-eo8xE88eOKl6Q/ls.jpg", "@type": "Restaurant", "telephone": "+17182220308"}