{"aggregateRating": {"reviewCount": 128, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-28", "description": "This sushi place is located within the 2 train Clark St Station. I was pleased to find out it was more of mom and pop place run by a couple. I ordered the salmon avocado and eel avocado. They both came out in great portions with fresh ingredients, simply delicious. The rice was soft but not too chewy. Direct and prompt service. Ended up ordering another round of eel avocado. 3 rounds of rolls came out at $16. Very affordable. Would certainly return to the area when in the mood for sushi. At least I won't need to go outside in the cold.", "author": "Annie T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-19", "description": "After walking by Sushi Gallery for years I finally decided to give it a try. Not sure what took me so long... the sushi is amazing! \n\nFor one thing, the rice is exactly the right temperature. So many places serve it too cold, but they get it just right.  I love all their rolls. My favorite is the spicy salmon.  I usually avoid California rolls but they make really good ones here. Highly recommend. \n\nAlso, they have some unusual drinks like Asian Milk Soda, so if you're feeling adventurous, this is the place to go. \n\nThe couple that runs it (owns it?) are friendly. This is a true neighborhood gem.  If you're just visiting the area, definitely check this place out!", "author": "J L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-17", "description": "Owners are nice and respectful. Every roll I've had has been great.  Lots of bang for your buck. Definitely visit!", "author": "Victor R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "Sushi was reasonably priced and absolutely delicious!!!! It is not a quick meal as they make all the rolls right in front of you (so it takes a little more time). We also got their hot tea and it was perfect in the cold weather. We will definitely be back!", "author": "Bailey A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "My friend took me here the other day. This has been her sushi spot since she moved into this neighborhood. It felt cozy and the food was good. I love that it's a mom-and-pop business. I would definitely return.", "author": "Cherry S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "Hands down our favorite sushi. We are regulars! Love to support a local mom and pop (quite literally!) - the duo that run Sushi Gallery are truly lovely. Expect meaty, delicious, great-value-for-your-sushi-buck. They also offer black rice which is healthier and delish. 5 gold stars for our favorite spot!", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-10", "description": "Outstanding sushi spot despite being located in the Clark st subway station. The price is spot on and the service is friendly, quick and efficient. They also have some pretty good sushi to go options which makes this my go to when I'm coming home late from work.", "author": "Thomas M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-05", "description": "Utter disappoint considering the high reviews.  Food is reasonably priced for NYC cost of living standard, but quality of sashimi is mediocre by Mom and Pop owned and operated.  Upon entering around 5:15 pm Saturday evening as Power of One (me, myself and I) I was not properly greeted and there was no hospitality or ushering me to a seat by a restaurant hostess.  I was not given a menu as there was no smile to welcome me-- this is a food service/ hospitality business and there was no basic customer service of being properly served attentively!!  I am a white collar/ pink collar customer service/ hospitality worker for over a decade and was fend off as unwanted or rejected.  Since it is family owned and operated the owner's adult daughter had her child running amok and wreak havoc in a business environment rather than provide child care in a home environment.  This is a small restaurant with a minimum of five tables and was not extremely busy when I was dinning.  Thankfully, no TVs are pinned against the wall for sports addicts.  Evidently, I used the takeout menu to place my dine-in order.  Sushi Gallery is a combination Japanese and Korean restaurant and the takeout menu had many penned cross-outs for discontinuation rather than spending money to print new menus.  I never saw the dine-in menu because I was NEVER given one.  I left dispirited.\n\n* Sushi deluxe (10 pcs sushi and 6 pcs California Roll served with Miso soup and salad) $20.00 - the sashimi was mediocre as the rice completely fell apart when dipped into soy sauce.  The yellow mayonnaise sauce for the California roll is extremely spawn hot spicy.  The table soy sauce was extremely high in sodium content and no low sodium soy sauce was, unfortunately, not an option.  Amid, considering all the health conscious options in 2016 era (gluten free, vegan, lactose free, peanut free, soy free, etc.) yet Sushi Gallery does not offer low sodium soy sauce.  I specifically ordered Sushi regular (6 pcs sushi and 6 pcs California roll, non-spicy) $16.00 but I ended up Sushi deluxe, ergo messing up my order!!\n* Chilled white wine $5.00", "author": "Tina C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-12", "description": "I came to this place on a weekly basis for several months. Despite being turned off by the location in the subway station, I came because the food was consistently good. \n\nHowever, this changed when my boyfriend and I sat down at our usual table only to find a live cockroach crawl across the table.\n\nWe got up and immediately left and have not returned.", "author": "Cim B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-04", "description": "We slid into this place as refugees of the post- 4th of July fireworks human stampede to the subway entrance.\n\nWe were greeted right away and seated at the last table. The restaurant is very small, in total there's about 6 tables. I wouldn't recommend this place for groups of over 4, you would be taking up half the restaurant if you decided to dine here.\n\nEven though the restaurant was full the food was served in a quite reasonable amount of time, however service could be improved. We had only one menu and one set of chopsticks and our server (the only sever) had to be reminded. She also took a while to take our original order and never followed up to ask how the food was.\n\nSushi was of larger caliber in size and definitely of quality. Pricing was very cheap for NY. $20 for 2 with drinks, rolls, and miso soup.", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-10", "description": "Our go to for sushi due to awesome quality and price.  The usual we get is the spicy combo, which has more of a kick than other spots.  While it is a small restaurant with a half dozen or so tables and bar seating, we have never experienced a wait.  A great mom and pop operation that works like clockwork as shown by their attentive service.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-30", "description": "My GF and I ADORE this place. Don't be turned off by the location (inside of Clark street subway).   The sushi is always fresh and simply prepared. The wasabi is house made. We always order extra. \n\nNeighborhood favorite for sure.", "author": "Jordan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-22", "description": "This is a perfect sushi place. A lovely young at heart couple runs the restaurant. They prepare their food with love. The sashimi pieces are fresh and at perfect temperature. It is worth a trip from Manhattan (subway line 2)", "author": "John T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-30", "description": "Can't believe I lived right by here and ignored this place for as long as I did. Total mom \u0026 pop operation with a lotta love going into the food. I always get it to go but their spicy scallop roll is the best I've ever had. The portions are nice and the fish is fresh. Don't sleep on this place!", "author": "John L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-18", "description": "Sushi Gallery is an amazing spot run by the sweetest couple.  I've eaten and taken out from here a couple dozen times in the past year.  \n\nTheir tempura udon is is delicious.  Hands down the best I've had.  All the sushi is fresh and they have a good Sake selection.  Love this place", "author": "Evan B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-16", "description": "Lovely meal at Sushi Gallery. If this were our local, we'd be thrilled. Nice rolls, good portions, excellent service...I'm giving this 5 stars as a perfect place for takeout sushi or a quick sushi dinner. Not a date night or fancy high end sushi experience - there are other places for that. This, however, really hit the spot for exactly what it is: a lovely neighborhood sushi bar.", "author": "Julie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-05", "description": "I attended Pace University and lived in the EHS dorms next door. I had never eaten sushi as I am a 'country boy' from Virginia and was never exposed to the cuisine. One night my GF made a visit to me at my dorm and brought some sushi rolls. Being in NYC I was opening myself up to different foods, within means, and experiences, also within means, and I took a taste of the sushi. From then on it is history. I now have my own apartment on the cusp of Lefferts Park/East Flatbush and I make a visit to get some spicy tuna and salmon rolls say every month. \n\nThe owners are nice and converse to a degree but if you know Korean/Japanese culture you won't take it as an offense if they don't continuously talk with you as they are preparing other peoples foods. (I've read other people's reviews on \"Hospitality\" and other things which in my opinion these people are....well no need to go there).\n\nBottom line if you want fresh food, inexpensive prices, and good yet healthy portions of food make a visit here. You may like it, or better yet love it and be back time and time again.", "author": "Lawrence S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "I have been eating at sushi gallery for about 10 years now .. by far the best sushi around .. humble husband and wife duo make incredible fresh and delicious sushi ! I come so often I sit down and they already know my order by heart .. don't let the subway vibe fool you this place is awesome !", "author": "Soner O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-26", "description": "Hardworking couple. Decent sushi. Nothing to write home about. But definitely stick to the sushi. Gyoza is microwaved. Udon was overcooked.", "author": "Sea K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-31", "description": "This was one of our orders of sushi! This place is amazing, the sushi was delectable! It's so good, my bf in the background couldn't keep his chopsticks out of my plate :-). Try it for yourself, fantastic!", "author": "Kristina W."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Sushi Gallery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/w9fIg-_3-eo8xE88eOKl6Q/ls.jpg", "@type": "Restaurant", "telephone": "+17182220308"}