{"aggregateRating": {"reviewCount": 128, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "Talk about hole in the wall. This tiny place serves up some of the best sushi I have ever had (and I eat a lot of sushi). The rolls are fresh, delicious, and incredibly satisfying all at a reasonable price. \n\nAgain, it is an incredibly small place with no more than about 5 tables and a little bar seating so it provides an intimate setting. However, we went on a Sunday evening and it was not packed at all. Overall, GREAT SUSHI.", "author": "Guy V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-11", "description": "an absolutely amazing place, with continuous unwavering clean, deliciously prepared meals. It is like your mother cooking for you at home, and it is that fresh, and delicious. Happy that they are near my place. I have been to many high-end sushi restaurants, and this place is one of my favorites more so because I feel that they prepare the meals more like a family than as a business. I generally don't fully trust restaurant food the same as ones made at home, but I can trust this place 100%. I go there partly nostalgic of my mother's meals.\nThe owner (a very nice couple of professional chefs) always keep the integrity of high food quality regardless of how busy they are, if they cannot keep up with the order, they just let go of them--the fresh quality food, which never changes. That is why people keep coming back.", "author": "Soo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-12", "description": "Excellent sushi place hidden inside the Clark station of the 2 \u0026 3 subway line.\nThe restaurant is run by its owners who are the ones that cook and serve you. Mom and pop, like they call themselves, are a true example of a well established shop that has build their clientele over the years because of the fresh food they serve and the top quality of the ingredients.\nThe menu is extensive and has a lot of great options that I believe you cannot go wrong with any choice. We ordered four rolls and it was plenty of food for two persons... And we were hungry! All the rolls either simple or special are generous in size and consistent. No falling rice or rolls that dissolve in the soy sauce. You can tell they are very well constructed and they don't skimp ingredients. You get big pieces of sushi and fish. And top quality!\nWe had the Alaska that was bigger in size and ingredients than any other Alaska roll I had in my life.\nThen the Big Mae is delicious but a little bit overwhelming since it comes with every seafood you can imagine so the five pieces you get are huuuuuuuuuge. Anyway, the flavor is amazing!\nThen the stars of the meal were both the Firecracker roll and the Tuna Love roll. They were heavy on spiciness but the taste... Oh my god, astonishing!! I guess if you can ask for mild spiciness then it would be a blast! Unless you like a little bit of numbness in your tongue.\nThe grilled step of the Firecracker is a very nice touch and the sweetness of the Tuna on the love roll too.\nNo doubt this is one of the best sushis in town!!", "author": "Sebastian K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-16", "description": "Best Sushi in Brooklyn Heights...  Don't let the location turn you away (Clark Street subway station 2/3 line). A favorite of ours for take out.  If you don't live in the area - it's fine for dining in.  The decor is simple.", "author": "Frankie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-16", "description": "Really big, fat, delicious, and fresh sushi rolls in the most unexpected of places: a small sushi restaurant attached to Clark Street subway station.\n\nYelp pointed me here, and my boyfriend and I ordered the following rolls: Volcano, Alaska, Explosion, and Romantic Sunset.\n\nHoly sh*t, the special rolls, particularly the Volcano, are amazing and filling. I mean sure, you don't get the ambiance of a nicer sushi restaurant, but if all you care about is the food then you will be more than satisfied. The special rolls are priced around $10-15 (comparable to other places) but much bigger, and they are generous with the fish.\n\nIt's owned by a couple and they appeared to be the only ones cooking, so it took a little while for the food to come out, but it was worth the wait.", "author": "Valerie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "From the outside, you wouldn't dare venture in but I'm telling you it's worth it! \n\nIt's a cute mom and pop shop located inside the Clark St subway entrance. It's an ideal ideal spot for a date, especially if you're a college student living in the Brooklyn Dorms. The prices won't burn a hole in your pocket and you'll be treating your date to a meal they won't forget!  \n\nDon't mind the times listed, usually your best bet is to head in around d 4 - 6 pm when it's not as busy or 10 - 11, right before they close. \n\nNotes:\n  1. Their spicy tuna and spicy salmon is a tad spicier if your taste buds are new to spicy foods.\n2. They no longer serve hot foods minus the dumplings, soup and edemame.\n3. They accept credit cards! \n4. They have alcohol!", "author": "Emily J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "Just came back here after a loooong hiatus. It's even better than I remembered. By far the best sushi I've had in New York, and it also happens to be among the cheapest. \n\nGet the Big Mag roll. Yum. Good luck fitting it in your mouth, though!", "author": "Hayley A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-21", "description": "Besides service being slow because only 2 people working it was sooooo good!!! Small place but great quality! And for the price, even better. Highly recommend explosion and volcano roll", "author": "Lyss G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-28", "description": "Mom and Pop sushi spot.  I love it here. really fresh, great prices.  They have black rice, which is high in protein which is fun to test out.  I had a black rice kimchi roll (owners are Korean) which was a cool snack.  These guys kill, I wish they were closer to Cobble Hill.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-16", "description": "So comfortable and cozy inside. Love this place.  Very fresh and inexpensive a great place to pop in for a little taste of fish at a good price.  The fair pricing doesn't mean this place is mediocre, it is quite good.", "author": "Daniel S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-05", "description": "Definetely the best sushi I have had in a while.!! All the fish is fresh and the staff is amazing!!! This place is a must come if you are around the area!! Yum", "author": "Clubby Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-18", "description": "their rice bowl with sashimi - hwedupbap - is sooo good. their hot tea and miso soup top it off for a great lunch. It's fresh and savory at the same time. the place is run by a couple, they know what they're doing and they're good at it!", "author": "Sheena H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-20", "description": "It was just ok . Based on the reviews I was expecting a bit better . The sushi left me with a heavy feeling and a bit of bellyache . The rice was so mushy, their green tea tasteless , miso soup did not taste fresh and so much mayo and sauces on all the sushi ... nope , although very convenient ...this is not a traditional sushi house but ready a pit stop for students who wants to stuff their tummy with cheap sushi .", "author": "Cristina M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-29", "description": "Last Update: BEST PLACE TO GO FOR SOJU BOTTLES. But actually. What would normally cost $18 in Koreatown is only $10 here (and bigger!).", "author": "Judy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-16", "description": "The rolls are huge! High quality tuna and fresh avocado all around. There's no wrong item to get, but the Explosion Roll and Firecracker Tuna Roll were some of my favorites.\n\nDefinitely the best restaurant in Brooklyn Heights.", "author": "Jarrett S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-31", "description": "A hidden gem. Came here two days ago for lunch and returned tonight for dinner. Be prepared to wait a little bit if it's busy, because it's a literal mom and pop restaurant in which an adorable Asian couple does allll the food prep/serving/etc. The miso soup was delicious to start, and the woman serving was attentive (when we came, we were the only ones here). I ordered the spicy tuna roll and the East River roll. Both were amazing. Really worth it for the price you pay. Definitely plan to become a regular!", "author": "Jimmy K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "I only come to the city on weekends but on weekdays I crave Sushi Gallery. It's a seriously strong craving, like Harold-and-Kumar-Go-To-White-Castle-strong. \n\nIt's a family-owned establishment located in the subway station at Clark Street, so it's unassuming and simple, yet clean and classy.\n\nThe basic rolls that I've had (spicy tuna roll, spicy yellowtail roll, spicy salmon roll) are spectacular and very reasonably priced at under $5. They are the new standard in which I judge other sushi. \n\nI've also had the Romantic Sunset roll (bbq eel, avocado, cucumber with salmon on top). Mouthgasm, would recommend. The Henry roll (spicy tuna, shrimp and avocado on top) was equally delicious. Also shelled out the $22 for the Sushi Gallery roll (spicy tuna roll and spicy salmon roll topped with tuna, salmon red snapper, white tuna, crab, eel, shrimp, yellowtail and avocado) which came with 12 pieces of craziness. A little too much going on but was still very enjoyable. My undistinguished palate could not really differentiate between all of the various fishes. Still, I was more than full and satisfied and it came with a free miso soup.\n\nFinally, as Judy S said in her review, $10 bottles of soju. SOCHEAP", "author": "Dennis C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-20", "description": "Awful. I walked in and felt like I had just walked into someone else's hotel room by mistake.  They didn't say a work to me.  No joke.  The weirdest experience ever.  I walked out!!!", "author": "Kyle B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-30", "description": "We went on a Sunday for lunch and the place was pretty empty. Despite this it took some time for us to get someone to take our order. However, the wait was worth it. The sushi was delicious and pretty reasonable (sushi is expensive, so this isn't cheap, but it is reasonable for good sushi). I was surprised by the quality of the sushi pieces themselves (nigiri, not rolls or sashimi). The chef was very generous with the fish.\n\nI would definitely recommend this place and plan to be back very soon. I would also note that they will ask for ID for sake even if you are clearly over 21. I haven't been carded in sometime but since I didn't have it no drink for me. Sake is pretty reasonable, starting at $4 for the cheapest option.", "author": "Eric W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-15", "description": "This cute, cozy (and clean) little sushi place is attached to the 2/3 Clark subway stop in Brooklyn Heights. Totally unassuming from the outside, but once inside, you'll find a nice quiet and relaxing spot to have lunch or supper. The Korean couple who own and run the restaurant are really sweet. \n\nTwo of my favorites so far are the chirashi (a bed of sushi rice topped with slices of sashimi) and also the Sushi Gallery roll. Prices are totally reasonable considering that the portions are rather generous. If you're on the go and don't want to wait, they have a refrigerated section with already prepared vegetarian and non-vegetarian makis.", "author": "Heidi C."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Sushi Gallery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/w9fIg-_3-eo8xE88eOKl6Q/ls.jpg", "@type": "Restaurant", "telephone": "+17182220308"}