{"aggregateRating": {"reviewCount": 128, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-06", "description": "The location was quite small and nondescript, but once I started eating I was extremely pleased. The food was beautifully presented and absolutely delicious. \n\nFor the price you really get a lot of food. We were quite surprised by how stuffed we were at the end of our meal- something that does not usually happen with sushi!\n\nI got the spicy combo and really enjoyed it. We also loved the spider and shrimp tempura rolls!\n\nI will definitely go back and recommend it for someone looking for a nice little sushi place with great food!", "author": "Jennifer P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-02", "description": "Delicious sushi rolls. Huge, creative, and lots of fish in them. My favorite is the Explosion Roll. Adorable presentation. Relatively inexpensive too. The best sushi in the neighborhood.", "author": "Lauren S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-16", "description": "Quite dissapointing, considering the high reviews. Everything was big, and reasonably priced for NYC, but Everything tasted bland and boring. We started of with some apps, which were all mediocre. We also ordered a few sushi roll combos, and a Korean rice and sashimi bowl. The rolls were alright, but the Korean bowl was poor, with bland rice, and strange warm lettuce. Additionally, there were fake crab sticks; never a good sign of a sushi restaurant. Service was fine for new york, we had to get our own soy sauce, and interactions were brief, but our server proactively split checks. 2.5 but I'll bump to 3.", "author": "Onik R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "This place is fantastic. I'm a sushi fanatic and good quality sushi is something I obsess over. This is a small mom and pop shop that serves excellent sushi. I've lived in Brooklyn Heights for three years and this is THE place for sushi. Very reasonable prices. I frequent this place constantly and must have eaten here over twenty times. The sushi was excellent each time and I have nothing to complain about. Give it a try, you will not be disappointed!", "author": "Tom O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-10", "description": "Favorite sushi spot to eat in Brooklyn. Run by a wife and husband. Sushi is always very fresh and the service is fantastic.", "author": "Jape D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-21", "description": "Love this unpretentious mom and pop shop! No Mexican making sushi or deliver take outs just this lovely old Korean couple. Food is good, not the best but the owners and the atmosphere deserves a 5! A classic nostalgic family business you see in some Japanese movie in a small town. So rare to see in NY!", "author": "Roxie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-14", "description": "A very comfortable, casual sushi bar that serves sushi rolls that are fresh fat and very pretty to look at. The tea they serve is also very nicely brewed(which is frequently refilled by the friendly owner), which complemented the sushi I had. \nKorean couple who run the place are very friendly too. Will go again!", "author": "Hye L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-14", "description": "Probably the most adorable sushi spot in Brooklyn. \n\nNestled in the Clark St. subway station, this little gem serves a plethora of treats I love. It may not be wholly authentic Japan, but nothing outside Japan really us. The menu isn't daring by any means, but everything is delicious and the owners make you feel like you're eating in their home. Love coming here whenever I visit the Heights.", "author": "Evelina R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-01", "description": "AMAZING! When I moved to Brooklyn a friend of mine recommended this spot and I was a bit skeptical with it being in the subway station, however, this is the best sushi I have found since moving to the city. They owners are fast, sweet and the rolls are delicious! I will most certainly hitting this place for lunch after I move.", "author": "Cassi J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "My go-to place for Hwe-Dup-Bap (sushi rice bowl?). It may take a little while for your order to come out, but its reliable, local, and good. I'd pick this place over the other \"sushi\" places on the same block. Owners are great and if you're a regular, they will remember your order. I'm a fan.", "author": "E L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "I chose the place randomly and was quite surprise with the food. Very good place. I think it is a family business. The wait was a little bit as we were the only one in the restaurant but it worth it. They are very generous with the fish. It was more authentic then ozy that it is on the other side of the street. I never hang out there so it will be difficult to go there but will return if I am in the area.", "author": "Thalie L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-04", "description": "I've tried a lot of sushi places and sampled some good rolls, but this place is beyond comparison so far. Its a cozy, warm inviting place for the intimate couple. There is a little wait, but only because its one person making the sushi and he takes his time. Its always worth a try to find a new place and explore its menu. \nP.S they usually take cash over cards.", "author": "Khamesh P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "The sushi is cheap compared to the other sushi restaurants on the corner (there are three) and bonus it's also way better quality.", "author": "Kaitlin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-05", "description": "I couldn't believe the reviews initially here on Yelp. How could a sushi restaurant that's attached to the subway be in any way good? I figured the fish would taste like the water that collects under the subway tracks. I was completely wrong.\n\nThe place was nearly dead on a Saturday night, but that just meant we were served even quicker. We ended up getting a Philadelphia roll, Clark roll, Hicks roll and the Black Pepper Tuna roll.\n\nThey were absolutely delicious! Freshly prepared, arranged beautifully (see posted picture), flavors we had never had before in sushi (BBQ Eel!) and the sake helped quite a bit.\n\nThe prices were extremely manageable, especially for NYC sushi. Supporting this little mom and pop business is even easier now because the overall experience was great. I know I'll be going back, or picking up some sushi on my way home from work.", "author": "Bay P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-07", "description": "Sooooooo fresh. I read some comments about ppl complaining about this place not being gourmet enough. But they have the best rice in town! Everywhere I would get this hard cold rice that you can't digest well. If you put ready made sushi in the fridge they normally become so stiff. At sushi gallery the rice is sooo soft, you could taste how much ingredients they put in the sushi. Seriously they are not salty with the amount of ingredients. The rice stayed soft,(not as soft as when it was made), even after putting the fridge over night. The only downside is that it opens at three. cuz I want to eat more!!!!!!!!!", "author": "Cecilia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-09", "description": "Simply Amazing.\n\nThis place opened up my perspective so much of NYC restaurant. I believed because it was in a subway stop it could not be good, but then one day my GF brought me a Spicy Tuna roll and that was it. Hook, line and sinker. I have been back so many times. I stayed at the Dormitory and then moved to Boro Park Brooklyn, but I still come to BK heights just for the Sushi (and the convo with the Chef and his Wife is great as well)\n\nTry it. You will not be disappointed..", "author": "Lawrence S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-08", "description": "Yay!! Found another hidden gem in Brooklyn Heights near Promenade. Loved their volcano roll and explosion roll. It was my second time eating sushi rolls in my life and I got to enjoy eating it more. Will visit again:", "author": "Nuri H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-25", "description": "Absolutely delicious! Fresh, large portions and inexpensively priced. This place is not as fancy as the neighboring sushi establishments but tastes much better. It's not about the decor and pretentious atmosphere; it's all about the food!", "author": "Anna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-28", "description": "Honestly at first I was apprehensive about going. But after being taken there it's going to be my go to spot in the area. Very good sushi, nice place, no frills but authentic. And great price. 10/10 would recommend.", "author": "Shayam P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "I absolutely love this place. It is a small intimate restuarant connected to the train station but makes the best sushi. I have been going to this place for 4 years. I always bring out of town guests and they love it.", "author": "Angelina M."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Sushi Gallery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/w9fIg-_3-eo8xE88eOKl6Q/ls.jpg", "@type": "Restaurant", "telephone": "+17182220308"}