{"aggregateRating": {"reviewCount": 128, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-24", "description": "Sushi Gallery is a very nice, cute spot located in the awesome Clark St station.  As everyone else has stated, it has a sweet \"mom \u0026 pop\" vibe to it and the chefs/owners are very friendly and efficient with their work.  I haven't dined in the place yet; I've only gotten takeout, but the sushi is always very fresh.  I've been going here for a little over a year now and it seems to have gotten even better over time.  The miso soup that you receive with your entrée is always hot and delicious.  They always get your order right, and even if they're about to close at 11PM, they still happily answer the phone and take orders at or after 11, which is a rarity for Brooklyn Heights restaurants.  Usually restaurants stop taking orders 15 to 30 minutes before their stated closing time, and most close at 10 sharp.  I've had nothing but good experiences here and it will remain my convenient spot for those sushi cravings!  Oh, and the prices here are remarkable for the quality and cuisine, especially as compared to Ozu across the street.  It's also worth mentioning that Sushi Gallery is the only restaurant I've found in Brooklyn so far which has Korean items on its menu, and quite a few at that.", "author": "Vaughn G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-18", "description": "From the sidewalk, this place just looks gross: It's in the St. George Hotel, within spitting distance of a subway turmstile. And it's in Brooklyn Heights, where there seems to be an unwritten rule that Every Restaurant South of Cranberry Must Suck. This place doesn't. A long time resident of the Heights suggested I try it, and I was totally surprised. I've lived in the Heights for 8 years and would have sooner eaten an errant hot dog lying in a puddle of dog piss before getting sushi here. In fact, it's much better than Iron Chef, quieter, friendlier and comparably priced. It's easily the best sushi in the neighborhood.", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-10", "description": "Aftern living a block away for over a year, I finally tried Sushi Gallery over my wife's objections (subway sushi? Ick!) This is a lovely little Korean restaurant that serves the best sushi in Brooklyn Heights, vastly superior to any of its competitors. To do better, you'd have to venture to Hibino in Cobble Hill. The fish is consistently very fresh, and expertly prepared. The only reason they don't get 5 stars is that  they stopped serving their delicious bibimbap and bulgogi, and they are sorely missed (though still on the menue for some reason) They do still serve my favorite Korean dish, Hwe Dup Bap, a sashimi salad with spicy sweet sesame paste. Don't be put off by the location - this is the real deal.", "author": "Zando E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-26", "description": "Our favorite secret little sushi gem in Brooklyn Heights. Fish is ALWAYS super fresh and very delicious - have tried many rolls on the menu, all very well composed. The place is small and cute, very clean and has a very nice NY kind of feel to it. It's my sushi place to go to.", "author": "Coco C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-18", "description": "A little pearl in the rough. Wonderful tasty food prepared by sushi-mom and sushi-dad. They are so friendly and attentive that you just wanna stay. The decor is hideous but quite charming and it such a quiet place that me and my friends just hung out for 3 hours taking and feeling right at home! Once again the food is great and the taste is wonderful. Not a wild display of color and fancy Japanese flamboyant food magic, just real sushi and other delicious courses prepared with love and soul so that it taste lovely. Thank you!", "author": "Kasper B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-27", "description": "Their website and their voice mail say they open at noon, but their door sign says they open at 1:00. That's pretty late for trying to get lunch. I like their sushi, so today I went in at about 1:10. They told me they weren't open yet, and they wouldn't be open for another 20 to 30 minutes. It seems like a bad way to run a sushi restaurant when there are two other sushi places with good lunch deals directly across the street - Ozu and Iron Chef.", "author": "B R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-13", "description": "The food is very good here and reasonably priced. It is indeed a mom and pop shop, everything's very fresh, and the decor and atmosphere are lovely, including the music. It's my favorite sushi place in the neighborhood. The only reason I am giving it a 4 star rating is because once my udon soup came in a little too fishy. It was a delivery order, so I didn't change it. But I have eaten here multiple times and the quality was consistently high otherwise.", "author": "Allie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-11", "description": "I tried this place bc the owner was very friendly whenever I walked by. I soon realized his friendliness is as limited as the seafood in his seafood soup. I ordered said soup with noodles specifically because i wanted seafood. When I asked what seafood was in there he couldn't really specify, but assured me it was a \"bunch of different stuff.\" After waiting like 20 minutes, I finally got home, starving and excited only to find that after paying like 16 bucks, the \"seafood\" in my soup consisted of 3 mini mussels and one piece of calamari. I called Sushi Gallery and they were clearly annoyed. The owner wasted alot of time telling me noone has complained before. When I brought it back for a refund (would have been equally happy just to get some seafood added, but that didn't seem to be an option), they continued haranguing me, saying that the soup doesn't come with alot of seafood..for 16 bucks???? really?? They snatched the container, gave me attitude and a refund. Never again. Too many other sushi places like Ozu across the street (excellent service) to be bothered with that nonsense.", "author": "Milly M."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Sushi Gallery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/w9fIg-_3-eo8xE88eOKl6Q/ls.jpg", "@type": "Restaurant", "telephone": "+17182220308"}