{"aggregateRating": {"reviewCount": 128, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-21", "description": "We happened to be walking to the subway when we realized we were hungry and stumbled into Sushi Gallery. We were there as tourists so I'm not sure how this would compare to other places in the area, but I absolutely loved the volcano roll. Perfect amount of kick and I liked the flavor after having been grilled. My boyfriend got the caterpillar roll which didn't sound great to me because I'm not a huge fan of avocado but even he thought it was an avocado overload so that was disappointing for him. Regardless, this review is based on my personal experience and I thought the edamame and volcano roll were delicious. The selection is also large, however they didn't have any smoked salmon so that was a let down. A lot to choose from, decent prices, overall an enjoyable experience. Even for my boyfriend who got to finish mine off since I couldn't on my own!", "author": "Jordan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-13", "description": "Sushi joint inside a busy subway station?  While that may deter you from going in, stop thinking that nonsense! Good things happen when you least expect it.we need to support more of these mom and pop shops. The couple is so friendly and welcoming.  What's awesome is that if you're on the go, they have some pre packaged sushi for you to pick up. Price is really reasonable. Spicy tuna/salmon roll for 5 bucks? Bingo. Sushi is fresh and simple. Sure they have the assorted special rolls but if you want something simple as you hustle and bustle on your way in or out of the subway, this place is zen. Yes, I just equated biting into a spicy salmon roll as zen. ::cue the gong::", "author": "Wing L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-06", "description": "Lovingly nicknamed \"Subway Sushi\" this is on of our favorite spots. Reasonably priced. Delicious food (Henry and Clark Rolls are great). When you eat raw food you don't want to mess with a place that keep their place clean...so Most importantly thing is they are IMMACULATELY CLEAN! From the bathroom to when you walk out the door..Clean! Look at their history of cleanliness ratings from the health inspector and they have basically every Brooklyn sushi place beat. They are a sweet couple that are there day in and day out. Also a good take-out sushi spot for a lunch on the go!", "author": "Lindy E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-27", "description": "Don't Judge a Book by its Cover.  \n\nGiven all of the rave reviews, I was eager to try Sushi Gallery but when we arrived on a Friday night at 8:30pm and the place was empty, my husband backpedaled and wanted to go elsewhere.  However I trusted my Yelpers and insisted that this next to the subway joint was worth the try and BOY were we glad that we did.\n\nWe were the only people in the restaurant but plenty of customers came in and out for take out.  \n\nWe were given complimentary miso soup to start.  \n\nAs for the sushi, the salmon melted in my mouth. Extremely fresh and extremely well portioned.  This place will be our go to restaurant for sushi.  \n\nThe rolls were also delicious. We shared the spicy tuna roll and the Fireball roll which was hands down our favorite.  The Caterpillar roll on the other hand was a bit bland\n\nI can't wait to go back to try the bimbimbap with raw fish and sushi / sashimi dinners!", "author": "Kathy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-18", "description": "Pretty nice place. Interesting, well balanced rolls. Good sashimi. A good value (which from me is high praise.) Cozy atmosphere.", "author": "Aliz C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "Great fish quality and intimate, unpretentious setting. Shame they dont deliver but they have a take out window!", "author": "Arielle N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-03", "description": "Best Sushi in Brooklyn I say! Ow how I missed this place. I used to take it for granted when I lived in this area but coming back reminded me of how good and simple the sushi here is. For the price and freshness it can't be beat! \n\nTake it togo and walk over to the water at sunset for an amazing view of the city. Don't forget the mango mochi or red bean ice cream!", "author": "Frank C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-27", "description": "High quality restaurants can be found in surprising places! (Sukiyabashi Jiro?)\n\nSushi Gallery is no exception - located in the Clark St Subway station, with it's main entrance facing Clark Street.  It is run by an impeccably clean, hard working Korean husband and wife couple.  \n\nThere are better sushi shops out there (Blue Ribbon, etc), but there is NO WHERE in Manhattan or Brooklyn where you will get personalized service, a restaurant to yourself, and food of this freshness and quality at such a price.  \n\nIneed, their Korean menu items are sleeper hits!  The Hwe Dup Bap really rocks the house - it is basically a sashimi salad over rice with Korean sweet chili paste.  Easily big enough to feed two, I usually finish things off with their excellent green tea ice-cream.  BulGogi and Chirashi also recommended, as well as their delicate mushroom soup. \n\nFood quality is very high, innovation is low, but the personal service and peaceful atmosphere are really exceptional and way above expectation - 5 stars considering the whole package and pricing.", "author": "Adam F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-08", "description": "Best sushi in Brooklyn Heights. My favorite place. Small, comfortable. Excellent inexpensive sake.", "author": "Nikolai R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-19", "description": "The best sushi in Brooklyn Heights. The owners are super nice. And they have ready made take home rolls, super yummy and affordable. Dinners are the easiest when I pick up several on the way home from work.", "author": "D K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-24", "description": "Poor decoration, warm room, cheap fish, there was even bones in my fish, the rice was overcooked and the service was awful + unfriendly. Run away!", "author": "Truth T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-16", "description": "Good sushi, a little quiet and chill. Might be too quiet for a date, but food was top shelf.", "author": "B R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-03", "description": "Sake for sake and won for won the best and greatest sushi deal. You'll feel like baddest mammer jammer Dolemite after getting a bottle of cold sake for $4 and some of the freshest sashimi for $10 that includes a maki.  I never roll out of here anything less than satisfied.", "author": "Tom C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-07", "description": "Not much I can mention about Sushi Gallery since unfortunately their (frier/stove) was not working so they could not prepare any hot foot. Decided to just order some rolls anyway (spicy combo tuna/salmon) and I was very pleased.\n\nThe miso soup was fresh and flavorful. Usually I don't even bother having the soup, but it looked good and tasted good as well. The rolls were fresh and had this orange colored sauce placed over the rolls that looked to be for presentation, but added a nice taste to the rolls.\n\nI myself usually have the rolls with soy sauce, but the very last one I decided to try without the soy and it was pretty tasty as is.\n\nI will definitely head back and hopefully they will be able to make hot dishes again. They mentioned that it might take a month, but I will be back before that just for the rolls and whatever else they can whip up.", "author": "Raymond T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-01", "description": "The best sushi place in Brooklyn Heights!  Sushi is fresh and delicious.  The service is warm and inviting every time. Prices are very reasonable!", "author": "ToniAnn A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-14", "description": "we love sushi gallery! we make it something to look forward to and order from here every tuesday. it's quick, inexpensive, and fresh. our favorite is the black pepper roll and spicy combo!", "author": "Grace B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-18", "description": "The reviews didn't lie. This is a great place to get some sushi. Family owned and very small but cozy. I always feel awkward eating in places like this but they never neglected me nor bothered me. I got two rolls Alaska and Spicy Salmon and they were HUGE! For a tall guy who eats a lot the sushi pieces were big enough to fill me. If you've ever encountered the problem of a sushi meal not satisfying you a ten dollar tab will fill you up and you will be willing to pay more. Very affordable and a great way to have a good meal. Will start eating there regularly. Eat here!", "author": "Josh J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-10", "description": "Love this mom \u0026 pop local sushi restaurant. Inside the space is small, yet cozy. All of their sushi is really fresh \u0026 well priced! They have a fridge outside the place where they keep grab \u0026 go sushi (made fresh) if you want it quick on the go!\nOne of my favorites in Brooklyn", "author": "Chris K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-08", "description": "By far, the best sushi in all of NYC~!\nFriendly Family owned \"Mom \u0026 Pop~!\nI travel from Manhattan to enjoy this gourmet eatery!\n\nHands down 5 Star with reasonable prices", "author": "Stephanie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-05", "description": "When I called to order around 5pm, they are out of what I want. I choose an alternative, out of that too. Voice message says they're open from 1-7pm everyday, called at one, they tell me they open at 2pm.", "author": "Jen S."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Sushi Gallery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/w9fIg-_3-eo8xE88eOKl6Q/ls.jpg", "@type": "Restaurant", "telephone": "+17182220308"}