{"aggregateRating": {"reviewCount": 128, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-28", "description": "Was pleasantly surprised by this place... We ordered for pick up late on a Tuesday night, and the staff stayed until we arrived, which ended up being at least 15 min past the closing time. Not to mention, the sushi is delicious, served in large portions, and is extremely affordable.", "author": "Gil M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-28", "description": "Since I will probably never make it to Japan to eat at Jiro's in the Ginza Metro station, I am glad I live right by Sushi Gallery in Clark St Station!\n\nIt's a small, quiet spot with the in restaurant dining largely empty. Most people seem to pick sushi up to-go at the small window by the station. \n\nPrices are fair and there's a ton of appetizer and sushi options. We got a few rolls, gyoza, and dumpling soup and spent less than $40! The sushi is fresh and there's a ton of fun fish and topping options. I loved every roll with salmon in it. \n\nMy friend who told me about this place mentioned the family who runs it and how they've been there for years. It definitely has a local/neighborhood feel. I also love that they bring you hot tea instead of water with your meal!", "author": "Jennifer D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-20", "description": "Usually I would be quick to raise my eyebrows at the idea of eating raw fish in a restaurant attached to a subway station, but then again, the world's best sushi restaurant is located inside a Japanese subway, so what do I know?\n\n\nTake a breath and don't panic as you open up the menu - it is definitely long and plentiful. I personally was excited to see more than just the two traditional Japanese soup options of miso and clear soup on the menu and went with the mushroom soup made with enoki and shiitake mushrooms. The broth had a really nice flavor, and for just $3.50 a cup, this soup was the perfect start to the meal. \n\nAs for the sushi itself, the fish is fresh (special shoutout to the yellowtail here), the rolls are beautiful, and the prices are more than fair for the size of the portions. The Clark Roll and the Explosion Roll both left me satisfied, but there are over 60 rolls on the menu (yes, I counted, judge away) so I look forward to trying quite a few of the other options.\n\nThere are a few negatives, but obviously not deal breakers for me. You will not get water unless you ask for it. When something is described as spicy, this place really means SPICY - don't be a hero. That is by far my biggest complaint, this place seriously needs to chill out on the spiciness of their rolls. And lastly, what is a Rainbow Roll? I have ordered this roll in many different restaurants and states, and it has always been a California roll topped with raw fish - solid go-to option when you're not in the mood to read a lengthy list of roll descriptions. Here it is simply an avocado roll topped with raw fish. Kiiinda lame.\n\nWith all that said, this is still exactly the kind of hole in the wall sushi spot that I've been hoping to find in Brooklyn. Turns out I don't need the glamour as long as the food quality is there. Don't be a snob and check them out - not leaving the subway station just might end up seeming like a perk now that winter is officially here to stay.", "author": "Nataliya M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-11-05", "description": "I totally did not expect to find a good sushi spot here, but apparently there is! \n\nThe entrance/exterior decor certainly does not scream out at you, so it took me a few mins to find it even though I was standing right in front of it. (It's right outside the Clark St. subway station.)\n\nPrices are super decent for Brooklyn, and the menu has a nice variety of standard and special rolls. I ordered the Clark and Big Mag rolls. They were rolled a bit loosely, but they were both tasty! \n\nMy stomach felt a bit funky later that night, but it was nothing serious. Overall, I would stop in again for reasonably priced and tasty sushi!\n\n*11/6 Update- My stomach was upset again after my second visit even though the sushi was still yummy. Dine at your own risk!", "author": "Nataly N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-22", "description": "my sis has always raved about this gem.... and once again, she did not lead me astray! reasonably priced sushi made with fresh fish and generous portions. seems to be a mom and pop operation as well. for so many years, i went to miso in dumbo....i declare that sushi gallery is the new official go-to sush spot when I'm in town!", "author": "Steph G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-30", "description": "A sushi restaurant in a train station? Where have I heard that one before?\n\nOf course, Jiro this isn't. But for sushi made out of a very small kitchen (they use a toaster oven to \"grill\" things), they have an extensive menu and their prices are perfect.\n\nI stopped in after work on a snow day after skipping lunch due to not wanting to brave the elements. They have really weird hours (I believe they open at 3pm every day and are closed on Sundays), which makes it weird that they do takeaway sushi in a cooler in the hallway of the Clark St station. If that's not for the lunch crowd, then who is that for?\n\nAnyway, I sat down at the counter and ordered two things -\n-Spicy combo ($13) consisting of spicy tuna, spicy salmon, spicy yellowtail rolls\n-Volcano roll ($11) grilled roll with crab, avocado, and cucumber\n\nLet's just say, I felt like a fatass afterward because it was SO much food. Each of the spicy rolls was good, though my favorite was the tuna. And for \"white people sushi\", the volcano roll was good. Fresh crab too.\n\nService was good, but their weird hours will always be a problem. For lunch, I recommend Iron Chef House down the block.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-28", "description": "This is my very first review. Ever. \nSushi Gallery is my favorite sushi place in all NYC. I travel all the way from Upper West Side to enjoy sushi, although there are plenty of sushi spots in my area. The owners are very welcoming and accommodating. I've been frequenting this spot for the past 10+ years and I will continue to do so.", "author": "Ari H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-29", "description": "This place is tiny but cute and comfortable! Groups of 2-4 are ideal. There is a wide array of sushi options, all very low priced! If you want to go out on a budget, I recommend this place! The employees were very polite and quiet. It's a quiet little restaurant not ideal for kids, and it's located right next to the subway station. I got the eel avocado roll and the LA roll for a total (with tax) of $10.68. They accept card and cash, and they'll split the tabs for you. Would love to come here again!", "author": "Josalynn W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-06", "description": "Placed a delivery order via Postmates, and I am very disappointed. Ordered a Gyoza, a Vulcano Roll, and a Fireball Roll which did not look anything like the photos on Yelp. The food was super spicy and the rolls was broken and smushed. Never again.", "author": "Giuseppe A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "This is my favorite affordable sushi in New York. I come to Brooklyn Heights largely to walk along the promenade and come to this spot for their Marshall Roll and avocado salad with their creamy, incredible sesame sauce. Reliable and always delicious.\n\n5 stars!!!!!!!", "author": "Bonnie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-12", "description": "Excellent sushi, I highly recommend - amazing prices, convenient location, excellent service from a true 'Mom \u0026 Pop' shop.  The miso soup is noteworthily good which is saying something - I love the spicy combo!  I come here regularly (weekly) and the kiosk is a temptation each time I prepare to board (or deboard) at the Clark St. Subway station.\n\nThank You!", "author": "John V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-21", "description": "I have been to Sushi Gallery more than a few times, and it is usually a staple for inexpensive, competent sushi (despite being in a subway station). \n\nDuring my last visit -- upon entering a nearly empty restaurant -- the owner wouldn't seat us as he said that he was too busy with takeaway orders. When was the last time you were turned away from an empty restaurant because the owners were \"too busy?\" Me either. \n\nIf you're looking for sushi in a pinch, check this place out, but don't expect much beyond base functionality.", "author": "Kevin P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "Can't believe we only JUST found this place! It's my new favorite spot. Kind, quaint, great food and even better prices. Highly recommend this mom and pop hideaway.", "author": "A F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "For sushi at a subway station I definitely give this a 5! In price and in quality this sushi stop was a home run!! \n\nThe black rice is a must try - it sounds scary but it is tastier and is more nutritious than regular white rice as well.\n\nWhen I'm hungry going to the city or even coming back, this is my first stop. There is a sit down restaurant that has very particular hours but I prefer to grab it on the go. For about $5 or so a roll, its a cheap meal and delicious!! \n\nDefinitely a neighborhood favorite! Nice to see mom and pop spots still exist.", "author": "Melissa F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-03", "description": "I'm literally writing this review while I'm here.... it is SO GOOD. Let me start with- I worked at one of the top sushi restaurants in Los Angeles for 6 years as a server then a bar tender. Rarely do I write reviews and especially about sushi spots. I would put their fish up against the best. Honestly, the environment of many sushi places can make you think it's better than it is. This place might be in a subway, but it is worth it. If you are considering it, DO IT. Just FYI- I ordered salmon \u0026 eel sushi, spicy tuna roll and the volcano roll. Super happy", "author": "Travis B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-08", "description": "My favorite sushi place in Brooklyn! Great prices and quality is superb. Small little spot run by two kind people who know how to make amazing food! Love it so much I visit often enough that they know my order without question. I recommend this spot to anyone visiting downtown Brooklyn!", "author": "Elle K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-07", "description": "We are always on the look out for casual sushi spots so when the BF came across the well-rated Sushi Gallery on Yelp just one stop away via metro, we knew we had to go!  Little did we know it was located within the Clark Street Dumbo MTA station.  Normally I'd be a little wary about sushi in a subway (this isn't Japan), but this stop is a bit more polished than most and has quite a few decent looking food vendors.  We were also happy to see a few normal looking patrons sitting down at the sushi restaurant, so we were feeling good.\n\nLoving  how husband \u0026 wife (assuming) run this small sushi restaurant (I believe it's Japanese / Korean).  The sushi was fresh and very affordable.  Only downside is they didn't have my favorite ginger dressing for the green salad (only a mayo based one).\n\nWill definitely come back!", "author": "Danielle M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-25", "description": "I really like this mom and papa shop. I really liked their sushi rice and miso soup.\n\nI have been there a few times and have tried the black dragon roll and salmon rolls. Having tried the nearby Ozu and Iron Chef House, I have would definitely recommend this place over the other two.", "author": "Phyllis J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-14", "description": "Sushi Gallery\nNY BK Brooklyn Heights\n2pm Tuesday 10th January 2017\nFive Stars\n\nAfter seeing Jiro Dreams of Sushi, I thought there would not be any stigma of a subway station restaurant but I was hesitant to try this sushi spot next to the Clark Street Station. The inside was nice, plain, and a bit of Japanese decor. We sat at the bar and these two amazing people ran the entire business. The man made the sushi. The woman helped prep everything and served. I had the lunch special Hwe Dup Bap ($12 for lunch only), which was a bowl of white sushi rice, lettuce, and variety of toppings: fish, tomago, tobiko, avocado, and daikon with a side of Korean chili sauce. It was huge and delicious. It came with soup, salad, and barley Tea. I had the sushi appetizer which was $8 for pieces of sushi. The rice was warm, loosely packed, slightly sweet. The tuna was pink. The salmon has thin horizontal stripes of fat. The snapper had a nice coloring. The ebi/shrimp was okay. Tiffany had the chirashi ($18) which was rice with 14 pieces of sashimi. It was much nicer looking but less filling. I really enjoyed this place.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "A lovely, adorable spot for sushi! A great atmosphere for a small restaurant located so conveniently in the Clark St. Subway station. The sashimi and sushi combo was a perfect size with just the right assortment of fish types and good pairing roll pairing. Will definitely be gokng back for more!", "author": "Jen N."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Sushi Gallery", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "71 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/w9fIg-_3-eo8xE88eOKl6Q/ls.jpg", "@type": "Restaurant", "telephone": "+17182220308"}