{"aggregateRating": {"reviewCount": 65, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "Went in randomly looking for some cheap priced takeout, but ended up staying and repeatedly coming back for more of their ramen. The atmosphere is nice, comfy, kinda like Starbucks-esque if only because the mood it leaves you with is a relaxing at home laid back type. Anyway, it's become my study spot now, loll. Ramen and studying, the perfect combination for any grad student. Oh and their taro tea is not half bad either, it's a great complimentary drink to go with my ramen... Yeah I know what some of you may be thinking.. Ramen and tea??? Whatever, lol, I'm a trailblazer. Definite 5 stars.", "author": "Edin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-17", "description": "I was walking home and I passed a strip of nice looking stores across LIU. One of them was Chau-down, I have to say that the combo meals/menu and the overall ambience of the restaurant is targeted for college students, this does not mean it is lacking in personality, its just that it has a very collegiate feel. I wanted ramen but they ran out of the noodles. The guy already charged me but he was nice enough to refund me and give me a free onigir/rice ball. With that being said, I do not know if they make the onigiri in house and wrap it (because it was very warm and the plastic package on it appeared like it was freshly taped) or they just heat it up, either way, it was fantastic! I got the spicy salmon, and as I finished it and about to head out, i decided to get another one, spicy tuna. Oh and the asian guy who works there was really nice.", "author": "Jean P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-02-26", "description": "I wanted the Nutella hot chocolate but they did not have it so I ordered the white hot chocolate. It was good but it wasn't what I wanted. The bubble tea isn't that good because it tasted like watered-down milk tea. The drink was made quickly and I sat down to enjoy it. They recently changed the setup of the place but I liked the other setup better. They were out of some drinks which was a disappointment. The cashier was friendly and offered me a stamp card.", "author": "Sally L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-31", "description": "This place is right across the street from where I work don't usually go in but I tried it because I saw a sign for onigiri which I love. Brought a shrimp tempura onigiri and sat down to enjoy it in my office.  Took the first bite no shrimp, second bite no shrimp, by the time I was done noticed that even thought I had a slight shrimp taste had no seen one shrimp. Step up your onigiri game want help see YaYas restaurant in China town best onigiri I ever tasted. Very disappointed. Service was good and the taro milk tea was very good. But work on the onigiri.", "author": "Yovanka G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "This place is great.  I started coming here when it was Celbritea, just to grab a cup on my way into the city.  They were really nice and the tea was good.  Eventually I started to notice more and more specials, homemade japanese soup, etc.  I guess they're so awesome that they ditched the franchise and now they have this new clever name and much more variety of asian food.  Everything I've had has been delicious.  Can't wait to try the ramen, which I saw a sign for today.  If you use the Dekalb or Nevins St subway stations, or go to LIU, you need to know about this place.  If you're in the neighborhood at all, I would hesitate to recommend it to anyone.  It's rare to see this level of commitment.  A real feel-good spot.  For a little place on the avenue, this is truly as good as it gets.  I fully expect them to open a fancy joint nearby soon.  Meanwhile scarf up the Onigiri, rice balls, bubble tea, and home-made macarons!", "author": "Jed X."}], "servesCuisine": "Asian Fusion", "priceRange": "Under $10", "name": "Chau Down Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/yaLuYZjwAemg0avmuWeWMg/ls.jpg", "@type": "Restaurant", "telephone": "+17188580330"}