{"aggregateRating": {"reviewCount": 65, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-04", "description": "Food: 5 stars - surprisingly good. Swang by this place early Sunday morning without too much expectation but our Musubi and Donburi turned out to be super yum.\n\nNot enough seats though. \n\nEven though there were just us two ordering, it took a while before food's ready.", "author": "Bilbo L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "This is literally a hidden gem! I went during lunchtime and I can still order breakfast. I love that deli feel.\n\nThey have a big selection of quick Japanese food options and drinks plus they have spam and all of its glory. \n\nFood was quick and the Onigiri is customizable! \nYou gotta check this place out", "author": "Karl Vincent B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-19", "description": "came here for musubi combo.. a musubi with small bubble tea.. i was disappointed at both the green milk tea and musubi. Its bubble tea.. the boba is too hard and not chewy at all... the tea is alright.. but if the boba doesnt taste right it ruin the entire drink..i would say even michigan Bambu bubble tea taste better than the bubble tea at Brooklyn.. its spam musubi.. i have been to japan and also hawaii for their musubi.rice is too hard just kinda destroy the vital ingredient of the musubi.. disappointed.. the only thing i can compliment is its service and its price.. small bubble tea with a musubi cost only for 5.50.. it is pretty good considering it is located in New York", "author": "Michele S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-10", "description": "Lose yourself by Eminem on the speakers, sold.\n\nAlso, the staff is awwsome. Really really awesome.", "author": "David R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-07", "description": "Great food tasting amazing and interesting menu choices with a lot more room for experimentation now. The Asian burrito is great especially the gyu one with beef. It is very large tho so make sure you are hungry an for some reason they don't cut burritos in half zap it could be challenging to eat. They don't carry the ramen any more unfortunately. And the main thing make sure not to come after the schools over or you ll be waiting an hour", "author": "Iryna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "This place is like a hole in the wall! After class one day I walked by and decided to try it out and it was amazing. I had taro milk tea and it was better then anything I ever had. There staff is super friendly and the environment is nice. I definitely recommend the taro milk tea and there rice balls. Better then yaya and formosa rice ball. When you take a bite of the rice ball the flavor just explodes in your mouth. If you haven't try this place definitely come by and try it. I really like it.", "author": "Irene Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "Came by to kill time before picking my bf up from work one day. \n\nThe decor is pretty cute and the workers are friendly. \n\nI ordered the salmon rice ball but they didn't have anymore salmon so the worker suggested the spicy tuna rice ball instead and WOW was I pleasantly surprised. It's cooked tuna but it's not dry at all. The spicy tuna rice ball was surprisingly generous with the spicy mayo and I LOVED IT. I even bought another one to bring to my boyfriend afterwards and he really liked it too.\n\nAlso had a green apple green tea with rainbow jelly. Not bad :)\n\nI've heard that the ramen here is pretty good too and the price is decent. Will come back when I'm in the area next time to try it!", "author": "Ashley C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-20", "description": "This place closes at 5:45, showed up at 4:30 and was told  the kitchen  was closed. Ive never heard of a place that closes their kitchen 1.25 hours early.  Apparently this is normal and there were other upset customers. I  will update this review if they change this policy (since I actually like this place) but this is just a dumb business decision.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-28", "description": "If you are in a rush, I wouldn't suggest coming here. I ordered a peach tea with pop mango (they ran out of tapioca) and waited almost half an hr for it. Same for their onigiris. They almost always have ingredients out of stock and the employees spoke rudely.", "author": "Miyoko L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-11-24", "description": "The food and drinks are okay. I like their concept. HOWEVER, IT TAKES FOREVER FOR THEM TO MAKE FOOD AND THEY ARE ALWAYS OUT OF SOME FOOD!! So why would they put the food on the menu when they are always out of it. If you run a business shouldn't they make sure the delivery of food comes here on time!!", "author": "Michael N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-14", "description": "Origini is good to get here, it's made relatively well. I also recommend their Nutella milkshake. A decent place to hang out, the service could be a bit quicker, but mostly a cafe worth visiting more than once.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-20", "description": "This spot has really good quick ramen. It's like fast food ramen. The taste is on point and not to salty or watery. The inside of the place is pretty small so more suitable to eat alone or a date (nothing romantic, just cute). You can also take out and the ramen still taste fresh. Also, the taro bubble tea is the best, ask for a little bit of ice.", "author": "Court L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-11", "description": "Pretty underrated place! Their \"rice ball\" is eccentric yet delicious! Awesome lunch special and student discount for those that go to LIU.\n-1 star for messiness in the kitchen.", "author": "Natalie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-28", "description": "Came here a few times before work to grab a quick onigiri for breakfast and a coffee. My review is solely based on those onigiris. The onigiri was just okay - too much rice and the rice wasn't very savory as I would have expected for $3. One time they ran out of most of their onigiri fillings, so I was limited to choosing the same toppings as the time before. Pretty average. Hoping next time I visit that they have all toppings available!", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-09", "description": "My go-to bubble tea is the Lychee Slush with Lychee jelly! The guys there know how to make it the best texture compared to lots of places and they're pretty helpful with questions. Definitely worth stopping in if you're around.", "author": "Marisa C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-13", "description": "Chau Down Cafe. I came here alot when they first opened to see how they would do, and also quite often in the summer, but not anymore. Why ? Explain later.\n\nMost of the people that work herr when I go are friendly, offer good information if you have any question. Great customer service in general. One girl, teenager like a lot of the staff gave me a look while I was looking at the menu like \"come here and order right now\" which is a big no no.\n\nTheir drinks and bubble tea wise are actually pretty decent compared to other bubble tea cafe's that I've been to. I've had my typical grapefruit and passion fruit bubble tea's as well which I always think are awesome, unless you somehow manage to screw that up. (Update : Grapefruit was taken off menu)\n\nThe food is however, is meh. I've had breakfast sandwiches, macarons, and onigri.\n\n- I remember ordering a sandwich with egg, spam and avocado and all it came with was tiny and soggy slices of bread, avocado, hot sauce and spam. It tasted okay but was messy and expensive for what you got.\n\n- Onigri is actually pretty good. Only had an order mistake once with that.\n\nOther downsides are that they can be really slow at times (orders can take upwards of 15 minutes and up to 20 mins) and the boba can be too mushy sometimes.\n\nThis place will be crowded by BTHS and surrounding HS kids after school hours.\n\nUpdate : No more daily deals :( Whyyyyyyyy\n\nOverall, I'm going to give Chau Down a 3.5 out of 5. If you're craving boba or any tea based drinks, give them a chance.", "author": "Jenn Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-24", "description": "First time here.  Looking for some vegan options but don't feel like walking a lot.  The guys here don't what is vegan on their menu.  I had to ask for all the ingredients and hope for the best.  They ran out of tofu.  I was told this after I paid!  So I agreed to get a bowl of veggies.  It was good (about $2 overpriced for the size).  I had it with the kbbq. Service is not fast.  I'd have given them 5 stars if their menu specified which items are vegan (and they moved faster).", "author": "Cristine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-22", "description": "Their staff is always super friendly and the food is delicious! I always order their bubble tea no matter what entree I order.", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-05", "description": "Great and underrated place to get lunch! It has onigri and bubble tea with a variety of flavors to choose from. I personally recommend the Surprise; leave it up to fate if type 2 diabetes kicks in! The seats are also cushioned and the scenery is calming.", "author": "Jeeper K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-27", "description": "I have 1 compliment and 2 complaints about this place. First, the compliment. It is well decorated inside, has soft chairs and a nice ambiance. Second, complaint #1... What kind of hours are 9am to 4pm? You don't open early enough for the people who want to sneak in for a drink before work, and you close way too early for students who want to stay and study for a while What kind of business model is this? Third, complaint #2... I came at 10am one day and wanted some hot food but they said \"sorry, we only have smoothies for now\" and I was like WTF, I came here b/c i wanted to eat, but I was forced to get a strawberry smoothie, which wasn't even that good. If you're going to restrict the menu just to drinks, at least make a good strawberry smoothie... it's not that hard, guys.\n\nEdit: Okay, now I realized I came on a Saturday and their normal hours are 7am to 6pm, which is slightly better, but what about the students who want to stay after 6pm? 6pm is really early to close for a place that caters to people who like bubble tea--bubble tea is often a late night type of venture.", "author": "Alan T."}], "servesCuisine": "Asian Fusion", "priceRange": "Under $10", "name": "Chau Down Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/yaLuYZjwAemg0avmuWeWMg/ls.jpg", "@type": "Restaurant", "telephone": "+17188580330"}