{"aggregateRating": {"reviewCount": 65, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-04", "description": "Yes we will do a lot more stuff in our house tomorrow morning so we will be home in a little while so we will be there tomorrow dude", "author": "Paola C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-02", "description": "This is by far the grossest milk tea I've had in NY. It tastes like 1/8th tea, a splash of milk, and the rest is water. The tapioca is good but it's not amazing enough to save the rest of the drink. Go to Chinatown or ktown and spend the extra .50 cents.", "author": "Symone H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-12", "description": "My sister stopped here on her way home from work. She called me to ask if I wanted bubble tea and of course I said yeah. Who doesn't love bubble tea? So she ordered herself a mango tea with lychee jelly and an original black bubble tea. Worst mistake ever. My bubble tea was absolutely disgusting. It tasted like dirty water and milk. I knew something was wrong when she walked through the door and it was very pale in color. I forced myself to drink it but after 3 sips, that was it. I threw the drink down the sink and ate the tapioca. Her mango tea was also watered down but not as bad as the milk tea. She said when a store/restaurant is empty that their food isn't good and she sure was right. If you stop by make sure to taste your drink before you walk out. The customer service was spectacular but unfortunately the drinks weren't. I'm giving a star for the wonderful service and another for the tapioca in the milk tea.", "author": "Josephine P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-05-25", "description": "This place is next door to Smashburger, which is my to go place! Decided to give this new place a try yesterday since I was craving something aside from a salad and burger.\n\nThe inside of Chau Down is not remarkable - a little bit run down with some small wall tables and about 5-6 red cushion seats that lined next to the wall tables. I came here around 2ish and ordered the riceball combo b - which consists of two rice balls and a bubble tea for $8.50.\n\nI ordered the mango yogurt bubble tea, with one avocado and one spicy kani salad riceballs. Overall, the quality of the food was mediocre. The avocado and spicy kani salad filling for the riceball was yummy - however the texture of the rice was hard and not fluffy which usually happens when the rice sits for a long time. \n\nGrowing up eating rice, this is very disappointing. The bubble tea was yummy, except for the bubbles wasn't chewy either. The staff was friendly, hopefully the quality of the food increases next time I come back!", "author": "Jenny L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-08", "description": "Stopped by for what I thought would be a quick bite at a solid BK joint. 45 minutes later I'm filled with regret. Quick cap:\nIt somehow took 25+ minutes after ordering to make a subpar wrap with rice, meat and some veggies inside. Did they have to harvest the rice or...?\nSpeaking of the wrap, the wraps are bottom shelf tortillas. Think: soft cardboard  \nThe only component that makes it \"sushirito\" is the KBBQ sauce I asked for\nWrap was the size of a soda can - am still hungry \nThe atmosphere is bleak. No music, sad red design, and the chairs are literally the most uncomfortable chairs that have ever been paid for. I could feel my butt under the \"cushion\" (see: there was no cushion).\nTo top it off, each wrap is $10...?!\n\nJust go to chipotle or a deli", "author": "Jojo M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-04", "description": "Loved the shrimp tempura burrito I got my first time here. Service was extra shaky but I put it to the back of my mind since I enjoyed my meal. I have eaten here once and every time since when I've tried to stop by (friDAY, saturDAY,etc) it's closed or close to closing despite signage saying otherwise. \n\nOn my latest attempt, I stopped by on a Friday a half hour before they closed. Thinking I had more than enough time, I was all ready to give my order. Upon greeting me, the confused counter person waited until I placed my order for food to tell me that the grill is off and they would not be able to make me my burrito of choice. I then asked what could I get and was told only bubble tea. Maybe if you are deciding that you are pretty much closing early you should start by telling me the items that are still available. \n\nSo frustrating because this has happened on multiple occasions. This place does not want my money and sadly I will have to except that.", "author": "Tash B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-12", "description": "I ordered the onigiri (rice ball) as a quick snack and since coming here last time their service improved. Last time I was here, the gave me the wrong order and I waited quite a while for the onigiri. The only difference was the staff and the place was empty (post lunch rush). \n\nThe onigiri is a quick fix for some rice and meat, but one isn't going to fill you up. They had a variety of foods from their menu including bubble tea and even donburis (rice bowls). What turned me off from getting the donburi was that it was $10. I could go to other shops that also had rice for less (and probably more meat).\n\nThe staff was very cordial. I wasn't sure if it was the lunch rush, but they had a blank stare and they looked lethargic. However, they took my order and handed me my food without really any stalling or emotion, so I don't really have much to complain about. \n\nThe space is right across from LIU, which made it a convenient place to go. The seating there is limited, so don't go with a large group intending to sit and hang out there. The onigiri was okay, but if I am a little bit hungrier I would try somewhere else that is less expensive.", "author": "Anthony L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-17", "description": "My son had the donburi rice bowl with gyu beef and curry sauce yesterday (Sat, 2/16) for lunch and got severe food poisoning (15+ hours of vomiting, diarrhea, cramps, nausea).  There's no way to reach Chau Down though their website to advise them, so unfortunately having to do this on Yelp and Google and hope they see it.  They need to throw out all their contaminated ingredients and do a big sanitation scrub.", "author": "Janet C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-03", "description": "This place is ehhhh. The place looked really rundown and just unclean. The service was okay. I had a mango iced tea and found it tasty. I don't think I would be back though just because I wasn't amazed or wow by it.", "author": "Miriam W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-20", "description": "$10 for a burrito the size of a baseball, mostly rice. Tasted good but really overpriced for what you get. Onigiri might be a better move.", "author": "Aaron R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-23", "description": "Chau Down is an Americanized onigiri and bubble tea shop. The space is lacking, with limited seating and bare, red walls. There is maybe half a dozen counter seats, with fabric bar chairs that are stained from spilled boba (at least I hope). The cooler at the front is pretty much empty too, with a very limited selection of baked goods. There is a sizable number of onigiri and burrito fillings and your standard boba flavors. The fillings are Americanized, as I said, with fillings like beef and avocado. You will not find traditional fillings like umeboshi here. \n\nThe prices for combos are very reasonable. I was charged $6.50 for two onigiri and a small bubble tea. I asked for the gyu (beef) and salmon with tonkatsu and spicy mayo sauce on the side. As I waited, I could hear the beef being cooked in the back. The onigiri came out warm, so the seaweed wasn't crispy after removing the plastic wrapper. The sauce also wasn't on the side, but whatever. I got a taro bubble tea and it tasted very floral to the point of soapiness. \n\nNot sure what else to say other than that Chau Down was pretty subpar. The concept can definitely be improved upon, but the space will have to be redone to be more inviting and the execution of their offerings changed to be tastier.", "author": "Jung-In S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-06", "description": "The space is small and the AC barely works. I got a shrimp tempura bowl and it was eh. I think the prices doesn't add up to the portion size. I paid $11.50 and received a little over a cup of rice and 3 pieces of shrimp. I also order a red lion drink which was also bland.  I wouldn't recommend eating here. If you want a rice bowl for lunch go to Wei which is 2 blocks away.", "author": "Crystal B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-06", "description": "I ordered a Donburi with brown rice, shrimp tempura, cabbage, cucumber, and sriracha sauce. This bowl cost $11.00 and it was the smallest portion ever. It had a little more then a cup of rice, 3 pieces of shrimp, and maybe 3 shredded strings of cucumber. I could not even physically see the cabbage. The bowl was drenched in sriracha sauce. The place itself is tiny and extremely hot with barely any ac on a 90 degree summer day. The cashier seemed clueless taking orders and the man preparing the orders seemed annoyed with the cashier constantly yelling at him. Bottom line is I will never be coming back.", "author": "Benek K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-04", "description": "This is the jasmine bubble tea. Absolute disappointment! This is literally water and tapioca. The tapioca is not even sweet! How dare they market water as a bubble tea drink and price at $3.50. Highly recommended that you go elsewhere!", "author": "Alex B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-06", "description": "Good onigiri and selection of bubble teas. Local favorite. Just not comfortable to sit, more of a take-out place.", "author": "Katja T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-04-15", "description": "Space is extremely limited compared to what it used to look like. They no longer have a bathroom for customers and there's only about 6 seats for customers. It gets pretty crowded around hours when kids end school (since it's close to Brooklyn Tech). It sure has shrunk from when I first started coming here 4 years ago. \n\nSo far, I haven't been disappointed by their flavored teas but my friends have told me that their tea came out watery. They run out of tapioca sometimes, which sucks because it's mainly what I'm looking forward to whenever I crave bubble tea. \n\nThe onigiri looks bigger in size compared to the ones at Yaya Tea Garden, but it's also way flatter. It was not as filling as I expected it to be and I was disappointed because it was a little more expensive as well. \n\nOverall, I recommend the bubble teas, but maybe\nnot the newer foods they added.", "author": "Wenley M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-02", "description": "A hidden hole-in-the-wall with great onigiri and decent bubble tea. \n\nThis place is right across the street from LIU so I run over occasionally to fill a lunch or snack craving. I absolutely love their custom-made onigiri (rice ball wrapped in seaweed sheet) with salmon, tuna, etc - you choose the fillings, sauce, etc. This is also a decent spot for a bubble tea with milk tea options too. I find that their boba pearls are nice and chewy which I really like. \n\nMinus a star bc there's not much atmosphere and it's usually got a strong smell of fried food that will cling to your clothes. But overall a great, inexpensive place with really nice employees!!", "author": "Heidi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-31", "description": "Delicious onigiri and cute stickers to seal the deal! I had the shrimp and salmon. Two onigiris plus a boba drink made for a vey filling meal.\n\n-1 star. I came in one Sunday afternoon about an hour before closing and was bummed to find their kitchen closed and out of boba. I had the mango pop instead which was disappointing. \n\nI must come back to try the rest of the menu.", "author": "S B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-10", "description": "This review is only for its bubble tea. I was so disappointed in my drink because I heard that this place sells good bubble tea. I walked in and to my surprise, there weren't any asian workers. There were two white guys behind the counter and for a second, I thought i walked into the wrong store because I heard it was run by Asians. But that doesn't matter and beyond the point. The guy who took my order, i'm guessing he was new because he didn't seem to know the menu that well. He was telling me all the drinks on the menu were all green tea and when i ordered the Thai drink he called it Thai green tea and I work at a bubble tea store as well so i know that it shouldn't be green tea. Anyways, i know what thai iced tea tastes like because it is my favorite drink, but when I tried it, it was legit all milk! There was absolutely no thai tea flavor at all. The drink was orange like it should be but i was literally drinking milk with bubbles. They probably added way more milk than they should have. The reason for the 3 stars is because the bubbles were actually good. REALLY good in fact that it made the drink a little bit better. Idk if i will come back here for the drinks, but I am interested in trying their onigiris!", "author": "Ada C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-30", "description": "In my experience the staff is helpful, and quick. I've been coming here since my school is directly across the street. My usual: Coffee  a major plus is the 50 cents off your purchase once you check in on Yelp (I've used it twice).", "author": "Emily S."}], "servesCuisine": "Asian Fusion", "priceRange": "Under $10", "name": "Chau Down Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/yaLuYZjwAemg0avmuWeWMg/ls.jpg", "@type": "Restaurant", "telephone": "+17188580330"}