{"aggregateRating": {"reviewCount": 65, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-20", "description": "Great service, very friendly cashiers. I ordered a Gyu Donburi (which is their beef and onion rice bowl) with unagi sauce, and a Thai Iced Tea with bubbles. The food came quickly and tasted great. Would definitely recommend for anyone hoping to grab a quick and tasty bite!", "author": "Byron L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-05", "description": "Meh. I was excited to see a new bubble tea place, so I hurried along to check it out. The waiters were chilling and acknowledged my presence a few minutes upon arrival.(cool, it was hot today.) I'm assuming its just a replacement for Celebritea?(the older spot) Anyway, I ordered a medium bubble tea: only $3. They were handed me my tea, without much to say. \n\nThe tea was too watery. I hate watery tea. Rather than a creamy taste, it tastes watered down. And not enough boba. Will I make my way back down here for their tea..not sure. \n\nIn short, it's sort of just celebritea. Their tea is okay if you are absolutely craving it, otherwise it doesn't taste too good.", "author": "Ani T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-03", "description": "The onigiri is good that's why it gets two stars. Unfortunately I had to wait an hour in this tiny store infested with teenagers. Got there at 3:30. Didn't leave until after 4:45 waiting on 2 ONIGIRI. I couldn't believe my eyes when I looked at the time and saw how long id been waiting. The staff didn't give me any update on where my food was or how much longer. It was just an annoying experience. I'd have spent less time taking the trek all the way to Yaya Tea Garden", "author": "J I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-14", "description": "The food here is decent. I especially like the onigiri. The ramen is decent though expensive in regards to the quality. The bubble tea is also average. What makes this place low rated is that on multiple occasions, all my orders take FOREVER to be prepared. I have even ordered when I'm the only one there and it still takes a long time. I don't normally complain but straw that broke the camel's back was yesterday, I basically went over my lunch break waiting for my food. I actually started hearing people that ordered after me get their food. If you don't ask, they don't bother telling you. They go by their schedule and they are really inefficient with their food orders. the drinks come out fast, usually I am done with my drink well before I get any of my food.", "author": "Kaity H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-10", "description": "Let me start off by saying that you will not receive your bubble tea in a mason jar, despite the pictures outside that first drew me in. Also, there's just something funky about the milk or the tea that they use. I just can't put my finger on what's throwing me off. Do yourself a favor and definitely do not get the taro bubble tea. The onigiri is decent.", "author": "Karen C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "Tried the ramen. Only one word comes to mind , and stomach! Delicious! Stop by for some delightful snacks or  cool refreshments!", "author": "Michael W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "Although there is no real comparison between Ramen to go and actually sitting in a restaurant to enjoy it, this place was pretty good. The only option is to go, so it's basically fast food Ramen. The ingredients seemed fresh enough, and the broth was delicious! I would probably go back here again, if I did not have the time to go somewhere else and actually sit to enjoy my food. I was really excited to see you that they had bubble tea though! Have not been able to find it anywhere else in this neighborhood.", "author": "Megan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-13", "description": "Cute decor and all but why did I wait 10 minutes for 3 onigiris? Ordered a black iced coffee, got it with milk and sugar. \n\nDisappoint.", "author": "Alice L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-16", "description": "Best taro milkshake in the area! 10/10 Better than Vivi's. The employees are polite which is a bonus. I will definitely return!", "author": "Megan M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-13", "description": "Awesome f*ing place, I love the onigiri (Japanese rice ball) with the mango bubble tea. I've returned for the salmon onigiri but they never have it so I have only tried the tuna. I believe that one day I will experience the joys of salmon... One day.", "author": "Crystal G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "I work directly around the corner so I tend to come here often to grab a bowl of ramen but no matter what you get here it's gonna be good.", "author": "Jona W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-15", "description": "Worst dining experience ever...waited much longer than usual for ramen especially when I was the only person in the restaurant.  I ordered ramen without egg... after waiting a while for my much desired meal, sure enough their was an egg in it...no biggie...I truly wasn't even bothered by the egg.  As I went to walk back to my seat I slipped on a piece of food on floor and spilled my ramen all over myself and table.   Instead of trying to help me and attempt to make the situation better, I was looked at as if it was my fault.  They cleaned the table and walked away.  Again not the biggest of deal but that, along with the fact that this was awful ramen, just set this dining experience to the lowest I have ever experienced.  Not only was it lukewarm which is great for me since it spilled on me, it was extremely salty and had a every different unpleasant scent to it. I am usually the bottomless pit, and will finish my meal, but I actually had to walk away from this meal. I truly hate writing bad reviews and have never ever written one before but this ENTIRE experience was just unbelievable. All of my other reviews have been 4 stars and above since I believe in promoting good businesses but this was just one thing after another.", "author": "Bernadette D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-21", "description": "Pretty good place. Onigiri is freshly made and the bubble tea isn't half bad. However,I'm here to talk about their ramen. For a little cafe in downtown Brooklyn, I would say their ramen would have a good rating in my book. I bought the tonkotsu ramen and I was surprised about the broth. It was not too thick and had a lot of flavor. They infused it with sesame seeds which gave the soup a nice texture. The noodles were nice and light,not too heavy. I would day though that the atmosphere is a bit lacking, but that doesn't matter when the food is good. The employees were also friendly. Four and a half if I could add the half.. Lol", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-18", "description": "Friendly staff. They know their bubble tea. The drinks are great and i really felt like the baristas take pride in the drinks they make. The food is also very good. Try the onigiri!  Favorite drink is the taro bubble tea.", "author": "Timmy W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-07-27", "description": "Bubble tea is hit or miss. Some days the tea is not sweet and others it is just right. They frequently run out of bubbles and rice even. Once I substituted lychee jelly which is a great alternative! Great special on the rolls and bubble tea ( $5). Spicy tuna is tasty, shrimp tempura is awesome and curry chicken was ok.", "author": "Crystal A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-26", "description": "Best taro milk tea and their ramen is the best compare to the city the price range is good. Only $8 for a bowl of Japanese ramen. Not to mention their popcorn chicken in rice is the bomb. Always had a good experience when I come here.", "author": "Jayden Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-12", "description": "I haven't had the food there but I can say the coffee is better than great and the guys dishing up the macaroons were awesome, friendly and provided me with great service!", "author": "Jandriod P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-12", "description": "Discovered this place after shopping nearby. Have craving rice balls but didn't want to go all the way to the city but I'm glad I found this place. They have many different types to choose from. I was going to only get one but I saw that they had a 2 for 5 promotion going on so might as well! Got a curry chicken and a shrimp tempura. It was so goooood. Washed it down with a taro milk tea, one of the best i've ever had, didn't taste powdery like other places. Before I left, I took a look at the food menu again and they have RAMEN!! Definitely need to come back and try that! \n\nBottom line: The rice balls were yummy, drink was great and the workers were very friendly and patient while I was figuring out my order. Definitely will return.", "author": "Jean L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "Simply some of the nicest staff I've ever encountered. And the caramel macchiatos are delicious. Yumm", "author": "Anna Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-07-17", "description": "the wait is ridiculous, this place really needs to get it together since the food and boba is really good, put more people on the clock!!!", "author": "Sophie D."}], "servesCuisine": "Asian Fusion", "priceRange": "Under $10", "name": "Chau Down Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/yaLuYZjwAemg0avmuWeWMg/ls.jpg", "@type": "Restaurant", "telephone": "+17188580330"}