{"aggregateRating": {"reviewCount": 162, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "I was ecstatic about this restaurant. We ordered the meat platter (with 3 veggies) to share. Each individual flavor was distinct and delish. I occasionally find Ethiopian spots lack in the service dept, but Awash excelled. Generous, happy engagement by waitstaff and the chef/owner. I will be back next time I'm in Brooklyn. RAH!", "author": "Sue H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-22", "description": "Went back -- one year later -- with guests who wanted Ethiopian.\n\nThe slight overpricing hasn't changed since last year.  Neither has the weak service.  A little slow, a little inattentive, a little unhelpful with the somewhat exotic dishes.\n\nI had the lamb dish.  While the flavor was nice, the lamb was again overcooked.  And this time there were razor sharp, hacked-up pieces of bone in the the mix.  IN. Actually dangerous.\n\nChili lentils were good. Greens were good. Generally, the flavors are tasty.\n\nThe injera was soggy and slimy on half of my dish.  As were my companions.  \n\nAlso, if you ask for utensils, expect a little attitude.  Paper napkins? This is FINGER food. for $15/ entree.\n\nGet the Meta beer -- it has a slightly smoky, honey flavor.\n\nAwash is ok.  It just doen't get me excited about getting Ethiopian again.", "author": "Julio R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-13", "description": "My first ethopian experience and I loved it!  When we(my boyfriend and I) walked in there were only two other groups of people.  The waitress, who was very sweet so much so that my boyfriend insisted that we give her 25% tip, told us to choose our seats.  We ordered one appetizer and one entree each.  The apps and entrees were served with this fermented bread that I found delicious but my boyfriend didnt care for (too sour he said).  Our entree was served together on top of the bread and came with a side of the same bread.  We were supposed to eat with our hands and dip the bread into the food.  My  boyfriend asked for a fork to avoid eating the bread and was happy.  We were stuffed after a 51 dollar bill.  Not bad for two people.  I will come back here again for sure.  Next time I will order the vegetable combo.  Another table ordered that and it looked amazing.  \n\nIt is warm in the restuarant.  I wore a t-shirt underneath my sweater and was fine when I took off my sweater.", "author": "Noam P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-12", "description": "I've struggled with Ethiopian food, tried it three different times in three different countries (none of them anywhere near Ethiopia).\n\nAfter the first two I was convinced that it consisted of nothing more impressive than salty baby food on a sour pancake.\n\nAwash changed that. The njera was nice, thin, strong enough to scoop the food and spongy enough to absorb the flavors.\n\nGet a combo dish: you get to try a lot of food and pay a regular entree price.\n\nThe Awash Chicken was rather boring. The mushroom tibs appetizer was spicy, juicy, not terrific, but worth ordering again. The spicy lamb was decidedly un-lamb-like, which was rather pleasant. I enjoyed a dish of ground chick peas that did not resemble anything like hummus, despite its description. All this food went well with a Sam Adams. \n\nAwash ain't too bad a spot.", "author": "Zachary G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-03", "description": "Lunch size portions?\n\nI came here using a groupon which I thought was a pretty good deal. $35 for 2 appetizers, 2 main courses and 2 glasses of wine.  Whenever I have had ethiopian before, the 'main' would come with two sides. They didn't do this here. That was fine. My dining partner said he was really hungry and wanted to order 4 meals. Ahh. I was so embarrassed that they would think we were gluttons (we are, but still.) Anyway, the food came out and honestly, it was fine. It wasnt an overwhelming amount of food by any means. The portions were so small (like maybe 4 bites of meat per \"main\" course. \n\nWe ordered:\n\nAppetizers: Sambusa with mixed vegetables and mushroom tibs. The sambusa was a super deep fried very bready \"pastry\" with a little filling (greens and onion) inside. It was tasty but I wish it had more filling and less pastry. The mushroom tibs were really flavorful. It was a large portion of mushrooms and onions and served with injera. Beware though, it is REALLY GARLICKY. Like don't order this on a date garlicky. I love garlic and even I was like whoa. I thought it was one of the best dishes we ordered.\n\n\nMain Course:\n\nYebeg Wat - had like 4 bites of lamb in it total. Wish there was more? Very good from what I had. I was expecting boneless though. \nGomen Besiga - this was mild flavored lamb with spinach. The lamb flavor was very strong in this dish. This was a bigger portion size, but I I would have been hungry if this was all I ordered.\nDoro Wat - the gravy was sooo good. Another best dish of the night. Unfortunately it was just two small pieces of chicken on the bone with an egg. Where was the rest of it?\nAwash chicken - this was kind of dry and not that exciting. The portion was on the larger size of the 'meals' we ordered here. I ate what I thought was a large slice of green bell pepper and quickly realized it was a jalapeno. It was practically raw and then my mouth was on fire!\n\n\nWe had the cabernet...eh. I wouldnt order regular wine here again. It wasnt a very good selection.  I would try the honey wine instead, but it wasnt included in our groupon. \n\nI think maybe you are supposed to order the meals like in pieces or something. I really can't get past the portion size. Maybe I was supposed to order one meat, and then two vegetable dishes in order to have a full meal.  I dont know. Or maybe I'm just an american used to everything being supersized. ::sigh:: perhaps this is why the skinny jeans are feeling extra skinny lately :)\n\nOur server was very quiet and seemingly shy. I couldnt even hear her some of the time. Also our check came and it wasnt very clear. She seemed nice though. Just very quiet.  I would come back as I enjoyed the food better than at Ghenet. I guess now I just know to order more than one meal. .", "author": "Sharon K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-13", "description": "Really enjoyed the tasty food - red lentils, lamb tibs, etc - and the speedy and friendly service. Romeo - yes, that's the manager's name - was a great guy and their new bartender Stanley was testing out some delish cocktails that they generously shared with me. I highly recommend this place for its food, drink, decor and welcoming atmosphere!\n\nClark J.", "author": "Clark J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-07", "description": "Definitely one of my favorite restaurants! My husband and I have been coming to this restaurant for several years now and we both love it. The flavors are amazing, I can't get enough of this place! We usually order the combo for two which is more than enough. We get the red lentils, beets, collard greens, Awash chicken and Yebeg Alicha (lamb), all of which are delicious! I highly recommend this restaurant to all my friends living in BK.", "author": "Jackie Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-13", "description": "You should read the \"HELP WANTED\" sign on the door as a warning label. \n\nIt took 45 minutes for our drinks to arrive, and we had to ask for them twice. So did the table next to us. Not that I mind a generous pour but when they handed me my wine and the cup was filled to the brim it was clear that our server, though a perfectly sweet person, was inexperienced. \n\nOnce the food arrived an hour after we sat down we were asked if we wanted to order more food, because though we had ordered the combo platter for four, they served us (someone else's) platter for three. Not wanting to complicate things any further we demurred and just gobbled our food and got out of there. \n\nI nearly always leave a 20% tip, 15% if service is substandard, but this was so bad I only left 10%. I wrote a note on the check apologizing for the miserly tip but explained some of the shortcomings we experienced that I felt forced me to do it. We had out-of town-guests with us and it was embarrassing to make them sit through such poor service.\n\nThat being said, we did enjoy the food itself and thought that the flavors were stronger and sharper than at the other nearby Ethiopian restaurant, Ghenet, so hopefully this place will get its act together before their amateur service drives them out of business.", "author": "Ben P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "After a recent remodeling of the restaurant (same owner/management) I decided to see how it was going. I have to say I like the new look!  Awash has finally made the old Quercy space their own.  A modern, upbeat Brooklyn twist on the traditional Ethiopian restaurant decor. Very nice! Hosting live music and dance is a great touch. The food is fantastic as always. Fresh fresh fresh! I recommend Awash for those looking for something new and exciting for a night out.", "author": "S F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-26", "description": "The food at Awash is always absolutely amazing no matter what you order. We tend to get the vegetable combo for two and everything it comes with is delicious, the collard greens are some of the best and the Berbere spice is wonderful. Just be sure to ask for extra bread as it is your utensil and there's no way to finish the platter without it.", "author": "Sean N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-29", "description": "I love Awash. The food is amazing. I am a meat eater and find most meat dishes to hit the spot. I love the Special Tibs dish the most. Full flavor. The spicy lentils are great too. The staff is really nice and they were welcoming of our little one too. My one complaint is that they say they offer delivery but I have always had trouble when I have tried to order delivery. And you can't really order extra sides you have to buy the entire meal.", "author": "Gretchen C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-20", "description": "Delivery took 2 hours. If they had Ethopia's Haile Gebrselassie run the food 3/4ths the circumference of Manhattan and back to Brooklyn, I would have had it sooner. \n\nSurprisingly, my doro wat was still warm. For what was largely an indistinguishable pile of mush with a couple of small pieces of chicken and a generous helping of injera, it was fairly tasty. \n\nBut being an hour past the stated delivery window is -1.5 stars (but since I can't post half a star, I'll be generous and round up). The food was decent but not worth the wait.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-15", "description": "I came here on a Saturday night with three companions, after getting a tip on their 2-entrees-and-1-app for $33 deal.  We sat at a lovely corner table in the pleasant dining room, and decided instead to do the dinner for 4 combo option, and started with an order each of the veggie and meat sambussas.  They were flaky, buttery, and delicious, and both the meat and veggie fillings were tasty.  For the combo, you get to choose 2 meat dishes and 3 vegetable dishes, so we chose the beef cubes cooked with onions and jalapeños, the chicken with berbere sauce, the collard greens, chickpeas, and red lentils.  Everything was very tasty, and the chicken was pretty spicy but not to the point of killing your tongue entirely.  \n\nWe washed it all down with some Ethiopian beers and by the end were pretty uncomfortably full, since you end up eating tons of ingera along with all the other food.  I look forward to going back and trying some more dishes!", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-29", "description": "Terrible business practice prices in seamless don't match the prices when you go to pick up your food I had a create your own combination and when picking up it was more money there was no delivery person to Deliver food  and the women argued with me that she had to charge me more will not be going back that's just bad business to expect to pay one thing and get charged another", "author": "Tony H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-06", "description": "When my husband and I were dating and living in Ann Arbor, we once tried an Ethiopian spot called Blue Nile. The experience left much to be desired, but that was more than 4 years ago. The husband admitted he was curious about the new spot in our own 'hood, and so we decided we'd give it a try. We remembered almost nothing from the previous dally with this cuisine aside from the way you eat it. \n\nWe started with this avocado salad to share. I'm not sure it was authentic, but it was delicious. I could eat that a few times a week. Onions, jalapenos, chunks of fatty avocado, nice dressing of acid for balance. Great start. Then we shared the meat combo for two. I don't know if I was full in the end because I can always eat a lot of bread or if the platter was just the right amount. The Doro wat was a bit spicy for my husband, but we agreed we liked one of the beef dishes best. Unfortunately, I'm looking again at the menu, and I can't tell you its name. And anyway, it tasted a lot like lamb. The staff was friendly, and the food was interesting. \n\nI see a lot of reviews describing terrible service. I guess we just went at the right time. We were hungry, we were denied Pok Pok and Awash hit the spot.", "author": "Cara M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-06", "description": "This place is small but beautiful. I noticed it first when i was walking around the neighborhood looking for a job. And did a double take and went \"woah\". 2 weeks late i took my friend and we went inside. As soon as I walked through the door I was greeted warmly like I was an old family friend. There were 2 waiters in the front, both native Ethiopians. I came with a friend around 7pm. Prime time for dinner. There were only 3 other couples sitting and eating. I was given the menu and all my questions were answered when I wasn't familiar with an item. I was given water right a way. I came with a friend, and am glad I did.  Everyone in the restaurant came with someone. \n\n the presentation of the food was unique. Everything was presented on one round metal tray with the Ethiopian bread Teff Injera like a thin pancake underneath the food. Then the food was spooned by the waitress on both sides of the bread.  The only thing that I didn't like was that I had to ask where my drink was. They gave drinks to everyone else in the restaurant right a way, but I had to remind the waitress of my drink. Both people waited on us and everyone else. It was a team effort. The way the drinks were presented was unique. The waiter opened my can of soda himself and poured it in the glass. It looked artistic and was a very thoughtful gesture. When more people came in then it got more difficult to get a hold of either one of the waiters. They are way too understaffed for a decent dinner service\n\n this is what we both ordered:\n\nSambusa- which according to their menu are \"pastry shells filled with spiced mixed vegetables or meat\".\nMy friend and I ordered both varieties. Each consisted of 3 Sambusa's. The meat one was very nice. The meat filling which was ground beef was delicious. However the pastry shells were too oily. \nThe vegetable ones were fried better. However they were too spicy for my taste. They consisted of spiced chickpeas and potatoes mostly. \n\nAwash Tibs- This is grilled \"sliced spiced beef marinated in wine and awase\". This was mildly spicy. I actually enjoyed this with the sour bread blanket on the platter. It had a sour spicy taste overall. \n\nYebeg Wat- this is an Ethiopian \"lamb stew seasons with onions, garlic, and berbere sauce\". This was extremely spicy. Also there was more sauce in the stew than lamb itself which was disappointing. The lamb itself was cooked very well. It came off the bone and was soft. \n\nWith both dishes they added complimentary seasoned chickpeas and collard greens\n\n\nThe restaurant is small but very neat. It is full of ethnic pieces and paintings that made me feel like I was sitting in a family home in Ethiopia. Nothing was out of place. Even the bar was beautifully arranged and very neat and clean. On one side there is a long leather bench from one end to the other. Tables are arranged along side it with chairs on the other side of each table. Then there is a window along side the entrance with some more small tables and chairs. The entrance itself is covered in a beautiful burgundy colored curtain tied back into a very Middle Eastern look. The overall look is very authentic to the food they are serving. In the background Ethiopian music was playing. The owners did an excellent job putting the place together.\n\nThe cost of food was a pleasant surprise and very reasonable. The Sambusa's were $8.  Each dish was from $15. However they had a daily special where you can get 2 entrees and 2 glasses of wine for $39. Also there were combination options where you can combine several dishes and the cost would be under $15. They had an impressive wine list as well and the price also isn't bad.  Overall it's a very affordable place to eat.", "author": "Larisa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "Loved the food and the ambiance. And the service was great too. I now have a go-to Ethiopian spot in Brooklyn and in the city.", "author": "Martine L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-04", "description": "My husband and I used to live in DC in the neighborhood with a ton of Ethiopian restaurants - DC has the world's largest Ethiopian population outside of Ethiopia. Awash transported us back to our old neighborhood. The food was delicious and plentiful (I don't understand the reviewer who said the meal for 2 wasn't enough for 2 people...it's a ton of food. For what it's worth, our favorites are some of the lamb dishes, the collard greens, and the lentils.).The service was incredibly friendly. Overall, it was a nice dinner out. We'll be back!", "author": "Lauren C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-28", "description": "I've never had Ethiopian food, so I have no frame of reference.  I think, however, that Awash captures the food and spirit of Ethiopian food very well.  The Awash chicken was far better than the beef tibs, but I must say the chicken was not all that unique.  The fun part and the draw is eating with your hands.  The Injera is supposed to be somewhat spongey and gummy, so if you like that texture, you'll be pleased.  The spicy food is not all that spicy, or at least not spicy enough for me.  A nice place though and I highly recommend you try this regional cuisine at least once.", "author": "Undercova A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-31", "description": "Seriously good. I've been to some of the more known Moroccan places in BK, but this one is the best so far. The atmosphere is elegant, yet welcoming. The injara is so soft and tasty. The meat super tender and delicious. Get the spicy one- I can't remember the name. The waiter was very kind and smiley. I'll be back.", "author": "Pedestrian C."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Awash Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "242 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/GZd6Ey3PkGKy0GiTb8vQaQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182432151"}