{"aggregateRating": {"reviewCount": 162, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-05", "description": "Sorry, but I totally concur with the negative reviewer.  We, too, were really excited to see an Ethipoian restaurant come to the neighborhood, as they seem to be few and far between in NYC.  I have had some amazingly tasty Ethipoian fare in Baltimore, DC and (yes!) the absolute best I ever had was in Boulder, CO.  In moving into the old Quercy space, Awash basically put up four new paintings and opened the doors.  They did nothing to physically change the space or give it any new ambiance or flair.  My partner arrived and waited several minutes before a puzzled waitress finally offered to seat him.  Once I joined him, it took another long wait for anyone to help us or offer water or anything.  We opted for the meat combo for two (at $28.95) so we could get a good sampling of a lot of what they have to offer.  Once we ordered, another waitress asked us to pick up our glasses, table cover and napkins and move ourselves to another table so they could make room for a party of four.  The place filled up pretty quickly, so have to give some forgiveness to the two waitresses trying to wrangle it all...but then you could say, \"why only two waitresses???\".  It is new, so yes...they have kinks to work out and service issues can be overlooked.  However, once the food finally arrived (a good 30 - 40 minutes later)...we were presented with 6 tiny dollops of food on a tray of injera.  The meat dishes each contained one tiny piece of meat.  My partner said, \"this isn't so much a dish for two to share as a challenge to fight over who gets to actually eat!\". The lamb was excessively gamey and extremely tough and almost inedible.  One of the beef dishes did have a nice spice level and was pretty good.  The other beef dish was, again, stringy and tough and the one tiny morsel on the platter was mostly bone and gristle.  All three of the vegetable dishes were pretty bland and sub par...and again, when lentils are about the cheapest thing on earth next to rice...couldn't you at least offer us a couple more spoonfuls of that one, if not the meat dishes?!  These were the smallest portions I have ever seen.  Our waitress never filled our water glasses, and we had to hunt her down to get the check- then waited another 20 minutes to actually get the check.  We opted to cull the spare dollars we had together just so we wouldn't have to endure waiting for a credit card to be run...fearing for how long that ordeal could take.  As we left, my partner said, \"it can't be a good sign that right now I am craving a hamburger- right?!\"  Uhm, no.", "author": "David B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-05", "description": "I had a totally opposite experience at this new addition to the very vibrant dining scene in Cobble Hill. I consider myself in possession of a sophisticated palate and have dined in Ethiopian restaurants in DC, Boston, and Manhattan. The fare here was nothing short of exciting, seasoned with a melange of spices across the full spectrum of Ethiopian cooking, packing heat and sweetness in alternating mouthfuls enrobed in the wonderful sourdough tef  injera that is a signature of the cuisine. Our server was beautiful and polite and helped us with our choices including an amber beer that was out of this world. The only thing I can say is that restaurants, unlike plays, do not have a period of previews where they can iron out kinks before the lacerating comments of reviewers take them down. I would hope that would-be customers take what the previous customer said with a grain of salt--which you won't need to heighten the taste of the food here since it was seasoned to perfection. Give it a try! You be the judge!", "author": "Mary Z."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Awash Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "242 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/GZd6Ey3PkGKy0GiTb8vQaQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182432151"}