{"aggregateRating": {"reviewCount": 162, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-07", "description": "Came in hungry and grumpy, left full and happy. Scrumptious, soul fueling, complex flavors. Our waiter was attentive and kind. I got the vegan platter with the cabbage, collards, red lentils, chickpea and lentil, and caramelized green beans and carrots. I was full but had to finish. My partner got the pick your own meat sampler with the tibs beef and a spicy chicken, also on the platter were beets, green lentils, and collards.", "author": "Ro T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-15", "description": "Was feeling adventurous one day so I decided to treat my daughter out to try some Ethiopian fare. I've always wanted to try Ethiopian food, especially injera bread. \n\nWhen we walked in the restaurant was pretty empty except for two, maybe three other families, it's was a pretty nice resturant and they were playing what must have been Ethiopian music. We were seated immediately and given water and menus. The families around us were eating very enthusiastically, so I couldn't wait try. We ordered a meat combo, an it was brought out rather quickly, and it looked great.\n\nUnfortunately we both hated It.  We didn't like it at all. It was like  spoonfuls of stage three baby food dropped on this putrid, sour, spongy disgusting bread. We didn't like the tibs, beets, or collard greens. I felt bad when the waitress came around and asked how did we like it, and both just shook our heads. \n\nI'm not sure if it was the resturant or our taste buds...but I do know I can't personally recommend, but I alsobcan't give 1star until I've tried Ethiopian food at a different spot.", "author": "Chantel E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-27", "description": "We really wanted to love this place. I mean, Michelin rated? C'mon, even our AP Human Geography teacher from high school taught us how valuable that award / recommendation is. But we were severely disappointed and we left full.\n\nFirstly, we didn't know we were supposed to eat with our hands. No, we're not ignorant (Filipinos and Indians eat with their hands all the time), but I'd never seen a restaurant in NYC actually instill it. Also, the texture of the food is different from what we're used to (like rice). When I asked for utensils, she assumed Tristan was African HAHA. I couldn't stop laughing because he's actually Jamaican and Indian. \n\nAnywho, we got a meat platter for two. For two, buddy, and we still were not full. The vegetable mixes lacked veggies and had 2 spectrums- either tasteless or spicy flavoring. IT did resemble baby food, and the meat was disappointing and sparse. I thought it was tolerable and stayed positive, but Tristan wanted out ASAP. \n\nNeedless to say, the customer base was lacking that evening and so was its food.", "author": "Natalie Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-22", "description": "I enjoyed my meal greatly.  It came with three kinds of lentils and some meat(lamb, chicken, beef).  There was plenty of spongy bread that came with our food.  It was delicious!  The waiter was really patient and nice.  We took like 10 minutes to figure out what we wanted since it was our first time here.  This establishment has a romantic date night feel to it.  :)", "author": "Polly H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-19", "description": "Let me start by saying I'm a huge fan of Ethiopian food and can be quite picky with it. My favorite is Queen of Sheba in Manhattan, but awash is a close second. I can only vouch for the vegetarian platter - always flavorful and hearty. I took 1 star off because service is hit or miss, as is delivery. I've tried other Ethiopian restaurants in Brooklyn and this is my favorite in the borough.", "author": "Melissa T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-24", "description": "Not a huge variety, but fresh, quick, friendly service. It is a shame that more people in the neighborhood don't go here. Maybe they need to offer brunch? Anyway, everyone was happy with what they ordered, from fish to vegan sample to chicken.", "author": "Michael B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-03", "description": "I ordered takeout from Awash last night, I think they take the crown for best Ethiopian food I've ever had. \n\nIn fact, I'd stopped eating Ethiopian food for some time, because it always caused some drastic gastrointestinal distress, and the bread always gave me this delayed coma that Carlin Y mentions in his review. \n\nI didn't have either of these problems with Awash, in fact, it was so good I reheated the leftovers a few hours after dinner and polished them off. Delivery was fast, hot, with a smile. I'm putting these guys in the regular rotation.", "author": "corey m."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-12", "description": "I eat from here about twice a month, but always the same thing. I think I am legitimately addicted to their food. Withdrawal symptoms tends to kick in by day 6. The veggie options are fantastic (especially the shiro, the yellow split peas, the berbere lentils, and the cabbage/potato/carrot dish). They lose one star because once the yellow lentils were undercooked and every so often they dish is over-salted. The amount of food you get for take-out is probably good for 2-3 meals, if you can handle that many lentils.", "author": "Jacqueline K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-06", "description": "My God. SO FULL.\n\nBeware the bread. It's like a delicious disease: it has a little bit of a sour kick to it that works well with some of the curries and soaks in the sauce, and it slowly creeps up on you and before you know it, you're lying passed out on your bed from food coma.\n\nAt first glance, I thought I was going to still be hungry after the meal. I mean, honestly, it just looks like a big pancake with a couple measly spoonfuls of sauce tossed on there, so I drank like a gallon of water while waiting for the food...\n\nLittle did I know that the bread expands like 3x its size. Don't make my mistake. Save yourself from the delicious suffering, and only drink when you have to wash down too much good food.\n\nThat said, service was decent, a little slow for the food to come out. The food itself was pretty delicious, although certainly has a stronger sour flavors in its curries. I'd suggest asking about the flavors ahead of time; it's hard to guess just from the description.", "author": "Carlin Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-11-23", "description": "I love Awash.  I love all locations of Awash. Ethiopian food is one of the most delicious choices for vegetarians dining out, but Awash is particularly delectable.  The vegetarian combo is filled with diverse and wonderful flavors.  This is true of Awash locations across town.  But I'm choosing to review this location for two important reasons: \n\n1) It's in my neighborhood and I want everyone to know about it and give them some love so they never, ever close. \n\n2) I like the atmosphere of this spot best, it's very 'that nice Ethiopian family honored us by letting us come over for dinner.'  \n\nIt's just all around wonderful.", "author": "Jeanette D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-29", "description": "If you've never had Ethiopian food, you're missing out on an awesome experience. The dining room of an Ethiopian restaurant is usually filled with round mesob tables made of colorful straw and the menu is an enticing mix of proteins served on top of and eaten with injera bread (I like to think of it as a cross between a tortilla because it's flat and a crumpet because of all the bubbles, thoughts?).\n\nI was recently invited to Awash in Brooklyn Heights and had a wonderful meal. The owner, Boge, an Ethiopian native, greeted us warmly and offered us a glass of the traditional Sheba Tej wine made of honey. While the blackberry version tasted a little like Manischewitz (anyone?), I quite liked the white varietal. It's a bit reminiscent of sherry or another alcohol-infused wine.\n\nWe started with an avocado salad ($10) which was oddly like a deconstructed guacamole, but hey, I'm not complaining. You could feed me avocado till the cows come home and I'm happy. \n\nThe best way to attack the rest of the menu is to share because the food comes served on a giant platter. We opted for the Awash Chicken ($16) marinated with garlic, ginger, and other spices, cooked with tomatoes, celery, onions and jalapenos and the Vegetable Combo for 2 ($30.95) which included the following: Key Sir Alicha (red beets, carrots and potatoes); string beans and carrots cooked in a seasoned garlic sauce; Gomen (collard greens cooked with onions, garlic, and jalapenos); Yemissir Kik Wat (split red lentils cooked in Berbere sauce); and Yater Kik Alicha (yellow split peas cooked and seasoned with onions and herbs).\n\nStarting in September, Awash will offer an Ethiopian Tapas Tasting for $18 per person which includes Sheba Tej paired. Also, if you visit on a Monday in September with at least one other person, you will get a free appetizer.", "author": "Yael M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-16", "description": "Service needs improvement...food was ok...but seating could be better...If you are looking for value...skip this...unless you must only have Ethiopian food on Court St. in Brooklyn...", "author": "Vinny W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-21", "description": "I thoroughly enjoyed my visit to Awash. It is one of the best Ethiopian restaurants in NY. I ordered the doro wat chicken and the lamb stew along with the veggies. The berbere sauce on the doro wat chicken was phenomenal. I can't wait to visit again!", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "What a gem in Brooklyn!  The place has been renovated and seems to be under new management.  I think they did a superb job in creating a cozy restaurant ambience; one can dine while appreciating the beautiful paintings, My wife loved the bar...We have tried both vege and meat platter and it was authentic. To top it off, service was impeccable and i only hope they will keep up to their standard\nWe look fwd to coming back on our next trip to NYC", "author": "E M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-29", "description": "I used to visit the East Village location of Awash every time I had a craving for Ethiopian food since I wasn't too impressed with other Brooklyn Ethiopian restaurants.  When I found out Awash opened a spot in Brooklyn I was extremely excited.\n\nThe service at this location is extremely friendly and the food is excellent.  The prices for the combos are also very good.  During my time in Brooklyn this was on my list of regular places for dinner as I could count on an overall great experience every time.", "author": "Maura L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-09", "description": "Sometimes the delivery is a long wait. However the food here is amazing. If you go to the restaurant food comes out fresh and at a considerable time frame. So I've learned not a delivery place BUT a great restaurant you dine in", "author": "Ann C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-10", "description": "Food was very good and fresh as I expected from visiting the other awash locations. What sets this restaurant apart is the nice bar and modern open decor I really liked it.", "author": "Ola H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "Tasty food, nice people. The service can be slow at times, but the ambiance is nice, particularly after the remodel. Veggie combo for 2 and an order of veggie sambusas is our go-to Thursday night meal.", "author": "F J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-04", "description": "Just had dinner at Awash. Such a pleasurable experience. My wife and I were headed somewhere else, but stopped in here. Laid back, friendly, delicious, affordable. Will be back.", "author": "Lynn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-20", "description": "Very good.  The Sambusa appetizer is great.  I ordered the vegetable dish and they gave me every vegetable ingredient on the menu with the same price.  The only thing is I wish they gave us a wet napkin or something since we have to eat everything with our hands.  The food are more spicy than I think, not to mention adding vinegar to make it surprisingly sour.  Great place to start if you never try Ethopian before.", "author": "Samuel W."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Awash Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "242 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/GZd6Ey3PkGKy0GiTb8vQaQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182432151"}