{"aggregateRating": {"reviewCount": 162, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-15", "description": "I have always gone to the Upper West side location but decided to try this location since I had a Groupon. I have to say the food here its just as good. As appetizer I had the vegetable sambusa and the mushroom tibs. Both were really good but watch out for the spicy peppers in the mushroom tibs in case you are cant handle heat.\nMy friend and I shared a combo which consist of Doro Wat chicken, beef tibs, Shiro (mushed chick peas) , yatakilt Alicha (potatoes with cabbage) and Gome (collard greens)\n\nThe beef tibs, yatakilt alicha and Shiro were my favorites. I didn't like the Doro Wat had a weird medicine taste to it.", "author": "Isabel J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-18", "description": "This weekend I had a reservation for 10 for my birthday dinner. Somehow the reservation wasn't written down correctly when I called earlier in the week, and so when we walked in they were NOT expecting so many people. But despite the surprise large party, the staff were very gracious and helpful, got a big table set up for us as quickly as possible and we were seated within 10 mins of the original time I'd reserved. Then, as usual, had a wonderful dinner and a lovely evening. I love this place! As an added bonus, it's about a 15 minute walk from the Brooklyn Heights Promenade with views of lower Manhattan, which is always a nice way to end the evening. :)", "author": "Daniel H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-09", "description": "Tremendously good Ethiopian restaurant capped off by caring and knowledgeable staff who were attentive to our needs. I've had a lot of Ethiopian food, and their selections were good. Every possible taste is catered to including vegans (tofu tibs, anyone?). The stars here are the Yetamatim Fitfit (an ingenious dish involving chopped up injera, tomatoes, garlic, and onions served ironically with more injera); Awash Chicken; Yemissir Kik Wat; and Doro Wat. The combo platters are the way to go.", "author": "Shyam S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "So glad that we went here for dinner.  The food was amazing and the service was great.  We started with the mushroom tibs appetizer which was very tasty and then had the vegan combo for 2.  Did I mention that we're not vegan/vegetarian?  When the food's that good you don't miss having a piece of meat/poultry/fish with it.  Still thinking about the injera.  Will definitely go back!", "author": "Stephen A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-25", "description": "One of my favorite restaurants- I've been to the ones in the city as well. I haven't been back to this location since the remodeling until this past weekend and I was pleasantly surprised. The space is beautiful and the food is delicious! My friends (who are new to Ethiopian food) and I had the combo platter which comes with a mix of meat and veggies. Sufficient portions and a good sample of different things for newbies. We also tried some Ethiopian honey wine- it's as sweet as it sounds but I enjoyed it.\n\nThe only negative part of our experience was that we were sitting towards the back and could hear loud music coming from what I assume is the kitchen. It was louder than the Jazz music that was playing out front. Please tell them to turn it down or turn it off! \n\nAll in all, though, I love Awash and will be back!!", "author": "Juana R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "First time here, definitely will return. As other reviews state, you will leave full.\n\nStaff was friendly, helpful, and the food came out pretty quickly. \n\nEverything was tasty. Shared the combo for two and we didn't even finish it due to being too full. Considering it was under $30 for two people, you really can't go wrong.\n\nIf you try it and aren't sure what things are, they'll be more than willing to explain / recommend options.", "author": "Ian J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-01", "description": "You have got to try the beef tibs! It's flavored perfectly and  absolutely delicious!", "author": "Beverly C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-01", "description": "1 star overall\n3 stars for the food\n0 stars for the service\n\nThis review is based on multiple visits. Such a same that there service is terrible because the food is actually pretty good. Not the best Ethiopian food but, this is cobble him, so I will take it. More on the food later. \n\nThe service is bad in so many ways, and I keep suffering their terrible service because I love Ethiopian. I've been to Awash about 10 times and nearly every time there has been poor service. \n\nOn one visit, after waiting for 75 minutes for our food to come out, we sent a dish back for being spoiled. The fish used was clearly old. They said they would remake it but we absolutely did not want more of the same bad fish and we were all ready to just eat and leave. The bill came and they charged us for the dish. Honest mistake? No. I asked the waitress to remove the charge and she just stared at us. Completely unapologetic. She said we ordered it and it was not her fault that we sent it back. After a lot of back and forth we ended up paying for the dish but left no tip to account for it. \n\nOn a another trip we brought a groupon. We presented the groupon before ordering and the waitress accepted it. But ... she clearly huffed at as for using a groupon. We ordered and the food came. The portions were all halved from the normal amount. This being my 4th or 5th trip, it was obvious that they just gave less food. \n\nThe most recent trip, we went at noon on a Sunday and ordered about $70 worth of food for 3 people plus one child. First, the waitress asked why we did not order food for the child and we told her that she would just share with us. (I'm sorry but a 5 year old does not need a $20 lunch). She scowled at us and then asked if we wanted wine or beer. \"No thank you\", we replied and then she said that we could not have our bottle of green tea in the restaurant. I asked her if they had iced green tea and she said no but they have wine and beer. I told her that I absolutely was going to drink my tea. We're spending a lot of money here for lunch and I am rather in the mood for green tea. She persisted that we cannot have the green tea in the restaurant. We got up and left. We will NEVER go back and I will now be telling as many people as I can that they should not go. \n\nI wish this place would learn that people come for the food but return for the service. I know I said that I would get back to the food but why bother.", "author": "Gavin G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-24", "description": "I wanted my family (there were four of us at dinner) to try a different cuisine so, I decided to take them to Awash. It was their first time eating Ethiopian food, but not mine. I live in the DC area where there are an abundance of Ethiopian restaurants. I found a groupon deal where you pay $30 for $50 worth of food (this is for the Brooklyn location). I'll discuss the food first, and then I'll discuss the service:\n\nFood--before I start, I'll state that I'm not an Ethiopian food connoisseur, aficionado or expert--I had it just enough times to make a decent comparison. We got the meat sambusas and the yater kik fitfit for appetizers along with a round of St. George beer. The sambusas were delicious as was the yater kik fitfit. My mom and cousin order honey wine--my cousin loved it. Next, we ordered our entrée which was the vegetarian combo platter because my step-father is pescatarian and I didn't want to cross-contaminate the platter with meat. The veggie platter was disappointing. The key sir alicha (red beets) was salty, which made me sad because I love beets (my mom thought it was salty too). I was not feeling the gomen (collard greens)...I can't really put my finger on it, all I know is that it wasn't good. The yatakilt alicha (cabbage) and yemissir kik wat were okay, just okay--nothing memorable. The best thing on the platter was the shiro (chickpeas). I didn't like the injera--it was thicker than I care for, and after a while, I noticed that I had this grittiness on my fingers (I later talked to an Habesha friend of mine and he told me that they probably didn't let the injera air out long enough).\n \nNow, let's discuss the service. The waitress greeted us and seemed pleasant. The waitress offered us forks--my step-father and I declined but my mom and cousin took them. Every so often, she would ask us how we were doing. She asked us if we wanted more beer, which we did. Here is where things go wrong: we asked for the check and I told her that I have a groupon. She said \"you have to present it at the beginning\" and I replied \"well, I'm showing it now.\" She repeated herself like five times as if I didn't hear her the first time. I told her that I don't live here so I need to redeem it now. At this point my mom just wants to leave and is like forget the groupon--my cousin and I refused to back down and the waitress said that she'll call her boss but that she can't promise anything (that old chestnut). She called her boss and then told us that she will accept it. I tried to give her the printed copy (the app on my phone isn't working) but she insisted that I use my phone. I had to find the email, log in via the mobile website and pull it up from there (as she was hovering over me). I couldn't understand why she was griping over the fact that I didn't give it to her at the beginning. I know, I know, the voucher says to pull up groupon, present groupon and enjoy but all vouchers say the same damn thing. Furthermore, I've been several places where I presented the groupon at the end and it wasn't a problem. Also, I read the fine print--I made sure we went on Thursday (it was only valid Sunday thru Thursday), we spent way more than $50 worth of food (try $161 before groupon discount) and it was before the expiration date. She made a big deal for essentially $20. She never gave a reason as to why the groupon had to be presented at the beginning--I can only deduce that the service would not have been the same. In fact, everyone I told pretty much said the same thing. I actually thought that my mom would never try Ethiopian food again but she said she would--just not Awash.", "author": "Jessica B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-29", "description": "The best Ethiopian food I've ever had!  I got the vegetarian platter and my boyfriend got the beef.  The veggie sambusa was my fave.  \n\nWe used a Groupon and am a fan.  Will definitely go back!  Great service and location.", "author": "Rebecca R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-11", "description": "Awash recently renovated their space and are now under new management. That can be the death knell for a restaurant, but I'm thrilled to say they're just as tasty and authentic as ever. The former owner's son is now running the place and serving up delicious vegetables, grains and meat dishes on generous platters. \n\nHave dined here a dozen times or more and will continue to do so. Highly recommended!", "author": "Rich J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-01", "description": "This place is a GEM! Absolutely love it. They recently renovated so it has a hip modern feel. I'm a huge fan of the art work - most are for sale, and all are imported from Ethiopia. Food is delicious as always, love their avocado salad! The service was warm and inviting, and the huge bar is very welcoming :)  you should def check out their new signature cocktails, soooo unique. Will for sure come back here.", "author": "Tsega T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-04", "description": "The only thing that used to keep me from going in here was the fluorescent lighting, but the recent remodel has brought a sense of cozy calm. \n\nThe food is uniformly excellent in my experience and extremely fairly priced. As I remember, the combo with lamb and chicken for one was $16 or $17 - really reasonable for the quality and amount, which could easily feed two. Will definitely be going back more often. Love the new direction this place has taken.", "author": "Ian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "Pretty good Ethiopian food in the Cobble Hill neighborhood - yay! We came in on a Saturday evening, and it was pretty packed. Seems to be a popular spot here. \n\nInjera was pretty un-americanized, aka was super tangy/sour (as it should be) and not made of wheat. I like that, but others might not - my boyfriend had trouble with the sourness of it, but it's authentic!", "author": "D L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-19", "description": "This was my first experience with Ethiopian food and it was lovely! Arrived early on a Friday night and was seated right away. The restaurant was pleasantly full and not too loud and well-decorated, with pretty paintings on the walls. (My only complaint was that it was pretty dark.) I ordered the Vegan sampler which allowed me to try a lot of food for only about $16. Every dish was well seasoned without being overpowering and really delicious! My boyfriend and our friend shared two meats and really enjoyed the chicken. Every server was friendly and the menu featured Ethiopian beers and wines, which were also really good. It was nice to share foods and eat sort of family-style without doing tiny plates of tapas, which usually make me feel like I spent a lot of money and didn't get a lot of food. Try Awash!", "author": "Ashlyn R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-12", "description": "Went on a cold and snowy day. All I wanted was kitfo, and it did not disappoint! The only thing missing was the ayib, but it came with gomen and misr wat.", "author": "Ragina A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-27", "description": "Great food? Check. \nFriendly service? Check. \nHappy to have this in my neighborhood? Check. \n\nI'll be back a bunch.", "author": "Lukus E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-04", "description": "Brought my kids here for dinner, I have had Ethiopian before and they have been wanting to try it.  We had a platter of 2 different meats and three vegetables.  The service was amazing and the meat perfectly cooked and plentiful.  The vegetables were spiced perfectly.  We were so full but couldn't stop eating.  \n\nOn top of it being so yummy, this is a really affordable place to eat.  I see a lot of visits here in the future!", "author": "Deb W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "Great food, nice atmosphere, and a very polite staff! Their two person combos were surprisingly filling.", "author": "Lamar F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "Great choice in Brooklyn for Ethiopian cuisine. I've lived near DC, so I was spoiled by the great Ethiopian spots in the capital. This one is very good. Simple and tasty. The injera bread is done well and the sambusa filled with beef was on point. Crust was flaky and the filling spicy but not overwhelming. I enjoyed the beef tibs and the Awash chicken, and all the sides that accompanied them. I LOVE the beer that they serve from their home country. Its called Meta and it goes down so smooth.", "author": "Michael D."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Awash Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "242 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/GZd6Ey3PkGKy0GiTb8vQaQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182432151"}