{"aggregateRating": {"reviewCount": 162, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-28", "description": "In my opinion this is probably the best Ethiopian restaurant in New York. I would like to start with the ambiance. It is cozy, friendly and youthful. The quality of food is excellent and has maintained high standards since Milka and Romeo took over the restaurant. If you want to try authentic Ethiopian cuisine then this is it. The vegetarian meal is sumptuous, healthy and nutritious for those who are health conscious. You can also enjoy a variety of tasty and unique cocktails. Moreover, the incredible service and friendliness of the staff is one of the hallmarks of Awash Brooklyn. Finally, the owners, Milka and Romeo will make you  feel at home and give you the kind of excellent service you deserve and expect. They are always courteous and efficient to a fault and you will not be disappointed.", "author": "Liz M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-19", "description": "Awash has really good Ethiopian food. I came here with friends from work to celebrate. The atmosphere is very chill, allows you dine in and still have tons of fun and laughter. The Ethiopian beer Walia reminded me of back home in Trinidad \u0026 Tobago. However, it was the honey wine that sealed the deal. Beautiful taste. The service was really good as well. They didnt disturb us too much during the meal. Prices on the higher side but it was a great experience.", "author": "Darren B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "An EXCELLENT place for a large group of happy traveling companions! \n\nJust get the platter and worry about nothing else. My waiter's eyes sparkled when he recommended the beef over the chicken (and I am usually really not a beef fan) but the SPECIAL TIBS. So juicy and tender and flavorful! \n\nEveryone was able to eat to the point of pain. \n  \nThey also have cool drinks like a spicy herbal tea! But mainly ambiance and the lovely shareable platter made the evening so familial and chummy and warm.", "author": "Nancy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-24", "description": "Enjoying Ethiopian cuisine was the perfect way to finish a date that started with the amazing Black Panther movie. But fortunately you don't have to take a plane to Wakanda to experience incredible African culture. \n\nThe mango drink my date ordered was refreshing and beautifully presented. The spiced tea's aromatic blend of cinnamon, cardamom and other spices was unexpectedly special.\n\nThe Vegan Combo for two gave us a generous assortment of classic Ethiopian staples (berbere lentil stew, greens, potatoes and cabbage, etc) with the classic injere which makes everything better!\n\nWe'll be back to enjoy being AWASH in friendly service and flavorfully satisfying dishes again!", "author": "Rasool B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-25", "description": "Awash is sooo good! The first time I tried Ethiopian food was in Washington, DC a little over a year ago, and after I came back to NY I knew I needed to find an Ethiopian spot here.\n\nAwash has become my Ethiopian spot. With amazing service, and a relaxed atmosphere with beautiful art hanging on the walls, you have to ask yourself how can it get any better?\n\nThen the food comes. Delicious stews of meat, cabbage, and other vegetables come in little assortments all over the table sized place of injera bread (soft, porous, and similar to sourdough). Get ready to eat with your hands! Take some of the stew soaked injera and wrap some meat and vegetable, then, plop the sucker in your mouth. \n\nSo delicious, so homey, and consistently a good experience! 5/5.", "author": "Charles R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-25", "description": "Amazing Galentines day brunch experience at Awash. I was very happy to had such a lovely food experience with all my girlfriends. \n\nThe ambience was super chill and our host was very friendly and helpful. We each ordered their spiced tea to begin with, and it was super flavorful and delicious. Smelled like Fall, so you can just imagine the beautiful aromas of the cinnamon and cloves and other spices in the tea. \n\nFor our appetizer we ordered the veggie and the meat Sambusas. They were super delicious and flaky. Just perfectly seasoned and not too spicy. For our entree we ordered the 4 person combination platter, which was a mix of different veggies and we chose the chicken and lamb as our meat combinations to go with it. Because we had two pescatarians with us, we asked our host, if he could separate the meat from the veggies, and he did so very kindly. The food was divine and we are very happy to say that we will definitely be coming back to try more food there! \n\nHonestly I was very surprised at the B rating the restaurant has, because everything seemed very clean and neat to me. One thing that stood out to me was the beautiful paintings they had all around the restaurant. Overall a very fun time. Great food, drink, company, service and ambience, which for me is 5 stars", "author": "Tahini R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-06", "description": "This is my favorite Ethopian restaurant. It's cute and trendy.  I've been to a fair amount of other Ethiopian restaurants and I'd say this one is a little more hipstery and less authentic than the other ones I've been to aesthetic wise, but I feel they work with it well. They also have a different take on cocktails, but still created with honey wine so you get a taste of the country.  \n  The food itself is a high flavor profile, it's very complex.   The injera is nice and firm and slightly tart.  \n\n  Every time we come in, it's usually busy yet service never lacks. They're always quick on the uptake, will offer more injera without even asking and they're incredibly friendly.  This has become my place of choice when I visit my boyfriend in Brooklyn. It's worth traveling to another boro for!", "author": "Lauren F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-21", "description": "Last night I came here for dinner and the food was just delicious. I shared the meat platter which consisted of different meats and veggies such as lentils, chicken, stewed lamb (delicious), cabbage and more. Traditionally you eat with your hands at times I was tempted to use an utensil. I love his new experience of using your hands. The platter is served with a rolled up sourdough called injera. The injera was a little sour for my liking but after a while you get use to it. The food was good without but then again who wants to pick up pieces of dice meat with with hands. I also had their version of a hot toddy which kept me warm on that cold night. I also tried their merlot from Ethiopia. The decor here was decorated with African art and plants spiraling around the ceiling. This cute restaurant is perfect for a date or a small group of friends. Plus the music was on point( Afrobeats and S", "author": "Geraldine E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-14", "description": "Absolutely fantastic Ethiopian food.  When I was young (2010) I unfortunately had a negative experience in Washington DC with an Ethiopian restaurant named Meskerem which regrettably contained a lot of bugs.\n\nBut Awash has blown my mind away again and again and has shown me just how exquisitely delicious, yet rustically unpretentious Ethiopian food is.  \n\nAll Ethiopian food is served with Injera, the leavened Teff flat bread of sourdough heaven, and is combined with myriad stews of Lamb, Chicken, Lentils, and Vegetables.  \n\nThe must try meats are Yebeg Alicha and Doro Wat.\n\nYebeg Alicha is a mild garlic-ginger lamb stew that pairs perfectly with Injera and Doro Wat is a spicy onion, spiced butter gravy laced with Chicken, egg, and fiery Berbere (a spice blend that is not too firey but I have the spice tolerance of a tropical rain forest bird and love Ghost peppers and the such) that just makes you salivate for more. \n\nI highly recommend Awash to all to enjoy some delicious and authentic Ethiopian cooking.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-16", "description": "I was meeting my daughter's boyfriend's mother for the first time.  Where to go that we ALL could agree is good??\n\nHere! It was here!!\n\nWe all love Ethiopian and 4 out of the 5 at the dinner are vegan/vegetarian so this is the most obvious option.  I had not been here yet, but my daughter and her BF love it.  \n\nThe food was absolutely fan-tas-tic!!  We ordered Kategna to start off with and I ended up polite fighting with my son-in-law for the last pieces.  I love him, but it was so flippin' delicious....\n\nThen we ordered two vegan combos for the table (they feed 2 people each, so it was definitely enough for the 5 of us after appetizers).\n\nIt was SO GOOD.  Plus the owners are so incredibly sweet!! I cannot wait to go back!  It was worth braving the arctic weather (thanks Lyft!!) to come here.", "author": "Carla L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "Ordered the bunna martini  which the bartender suggested and it was AMAZING. A must try.\nMy friend and I shared the Goden Tibs which our server told us is a new menu item and it's so yummy! \n\nGood music. Good vibes. Great food and service.", "author": "Kasiya N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-20", "description": "Entirely love this restaurant - food is super tasty and the atmosphere is relaxed and fun. Romeo is a great host, very welcoming and social. The decor is also beautiful! My only complaint is that everything is so delicious that we always eat too much!", "author": "Rebecca H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-28", "description": "I ordered take out from awash and the food arrived still very hot and tasty ! There was plenty of injera for all of the food provided. I ordered a veggie combo which filled more than two people well ! The spices used were delicious and well balanced ! The only criticism would be that there was not much heat that I am usually accustomed to when eating Ethiopian food. \n\nI am excited to visit in person because I hear the restaurant is cozy and inviting !", "author": "Allie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Who, besides Ethiopians, know out of the gate that Ethiopian food is awesome? Don't be scared by the fact you don't have utensils (it's actually a nice throwback to when you were a kid). Do wash your hands very well before eating (you should anyway). \n\nAfter a beautiful renovation a little over a year ago you feel the quality of those place come out in the ambience and not just the food. \n\nIt'll be hard to figure out what you may like so opt for a combo with meats. Extra spongy bread will help you soak up all the goodness. The sambusas are a crowd pleaser to start (particularly for the kids). If you drink give their specialty cocktails a try or the Ethiopian beer. \n\nI'd also recommend coming here on a weeknight as it can get packed on the weekends (I think the word is out). Itd be great if they had more help during those peak times but if you're patient it's worth the wait.", "author": "anthony r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-04", "description": "The best Ethiopian restaurant with the best Tire Kitfo in NYC ! \nI've been in many other Ethiopian restaurants within the different boroughs for the past couple of years and it's a place like no other.\nFrom the quality of the food to the coziness of the place it deserves a 5 star.", "author": "Linda J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-18", "description": "Friend and I came on a Saturday evening and wasn't too crowded. \n\nWe ordered meat sample for 2 people for $35. Really tasty and filling although it would be better to have some sauce for dipping the gursha, but meant to wrap around the meat and veggies.\n\nDefinitely try the honey wine. Sweet and not too strong.\n\nStaff, ambiance and location good for parking on Saturdays.", "author": "Alvin H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-12", "description": "Best restaurant in Brooklyn!! Ambiance is awesome and food is super delicious! Owners and staff ate very friendly!", "author": "Alexander R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "Awash, where do I even begin. You GOD DAMN gem of a restaurant that stole my heart and satisfied my taste buds. \n\nI have had Ethiopian food all across America but this was just different, truly Brooklyn in spirit without the watered down spices. The cocktails were fantastic and the overall ambiance of the place solid.\n\nI am late writing this review but I needed to add my two cents. Will def be back when I am back in NY.\n\nShrimp tibs", "author": "David H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-13", "description": "I was here today celebrating Mother's Day and I couldn't wait to review! The food is nothing short of amazing! Please, please try the Gomen Besiga and the Shiro! The drinks are wonderful and the beers are especially easy to enjoy. \n\nTheir decor is inviting and beautiful; the art is a wonderful addition to look at while enjoying your meal. The staff is lovely and the facilities are fastidiously clean. I will definitely be back!", "author": "Eve B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-14", "description": "No utensils - you eat by grabbing the food with a small piece of injera (a spongy Ethiopian flat bread). The food is delicious and wonderfully seasoned. The injera was not rubbery. My wife got the vegan combo, and I got the meat one. A great sampling of the cuisine. We have been to Ethiopian restaurants before and this one is one of the better ones. Also a good inexpensive choice in the Cobble Hill area.", "author": "Darryl R."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Awash Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "242 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/GZd6Ey3PkGKy0GiTb8vQaQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182432151"}