{"aggregateRating": {"reviewCount": 162, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "Before coming here, I had never tried Ethiopian food. I didn't have the slightest idea what it was. But after eating at Awash, I urge all my friends to try it. The food was absolutely delicious!!! Everything was so flavorful and seasoned to perfection. Make sure you get a platter so you can get a little taste of everything. The decor and artwork was so beautiful too. It added to the overall cozy ambiance. The service was excellent. I recommend everyone to come to Awash for an amazing cultural experience!", "author": "Farah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-21", "description": "Great location on Court Street - excellent Ethiopian food! Try the honey wine and the Doro Wat.\n\nA combination platter is the way to go for groups - makes eating a lot more entertaining!", "author": "Derek K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-15", "description": "Ethiopian cuisine.  Ok where do I start.  The avocado salad was the bomb as an appetizer, the mushroom tims amazingly mouthwatering.  I left their full but wanting more.  Oh yeah the cocktail I drunk had bourbon mixed with red wine and other ingredients was really good.  Highly recommend this place, the staff was great as well.", "author": "Madd M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-11", "description": "I rarely post a review. We have been regulars  and enjoy the food. We made a reservation for a Wednesday night ( in August) for ten plus people. We were bringing our own wine and willing to pay the $25/bottle corkage fee. \n\nWe brought two magnums. They wanted to charge a total of $100 corkage fee. The hostess called the manager who wouldn't budge. \n\nThe place was empty. We left and went down the block to Indian Table where we have eaten many times and enjoy the food and fabulous hospitality. \n\nWe walked in with 10 people. They charged us no corkage fee and we had a fabulous meal. \n\nPenny wise, pound foolish Awash!", "author": "Melissa G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-20", "description": "My boyfriend was out late for a work event and I could pick what I wanted for dinner without any complaints. Ethiopian food here I come! I ordered the create your own combo with Angkor wat chicken and special tibs (~$21 with tax). It came with 3 veggie sides (beets, mashed lentils, and collard greens) and ample injera bread. Ooo I've missed that tangy spongy injera. As hungry as I was, this was enough for dinner and lunch the next day. The chicken and beef were a bit tough for me, but I tend to like my meat extra soft, so ‍. I thought the chicken had a milder spice taste to it, but everything else was much more spiced. Surprisingly, I liked the lentils (haven't touched it since my 1st try). It was a textured mushy (like refried beans?) with some heat. Overall, everything was delicious with plenty of food.", "author": "Jamie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-22", "description": "This is our favorite spot when we come to Brooklyn to visit family. Enter through an unassuming doorway to this amazingly cozy spot decked with colorful Ethiopian art from wall to wall. When you  dine in Awash, your 5 senses come to life. Enjoy the art work, listen to eclectic music - from jazz to reggae to old school jams, smell the aroma of food as it makes it way to each table, taste the flavorful food while feeling the texture of injera and wot with your fingers.  This is what i call a dining experience......amazing ethnic joint!!!", "author": "Mikki A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-10", "description": "Had another amazing meal at Awash tonight . Somehow the food seems to be getting better \u0026 better.  Almost as good as the food are the warm smiles from the friendly staff.  If you have not been I highly recommend visiting.", "author": "Rusa J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-27", "description": "I cannot even begin to try and explain how amazing this place is. It is my favorite restaurant in Brooklyn and I think I could probably eat there every single day and never get tired of it.\n\n1. First their staff is amazing-so friendly, so helpful, and more than willing to make recommendations. Especially when it comes to firstfirst-timers experiencing Ethiopian cuisine.\n\n2. Great bar selection with variety of original drinks. Besides the typical liquor and beers, I would recommend trying their honey wine.\n\n3. I can honestly say that I never had a dish here that I wouldn't recommend.\n\n4.if you never had Ethiopian you definitely have to try it at least one time. For the first timers make sure you go with a group of people who don't mind sharing food with one another.", "author": "Clay H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-21", "description": "Food is soooo good!!!  The playlist is on point.  And the staff is super friendly.  I don't eat fish but everyone that I've brought here that gets it says it's fantastic.", "author": "Danny P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-18", "description": "Quality of the food is mediocre. Great staff, warm hospitality but I wasn't blown away with the food. It tasted very bland almost like a canned food but with some authenticity. They have Ethiopian beers which is cool.", "author": "Rose W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-03", "description": "I've been a longtime fan of Awash in Brooklyn! Living up the street, it's my go to restaurant for lunch or dinner any time of the week... the vegetarian sambusas \u0026 the vegan combo platter with extra gomen (--the collard greens which are freakin' life changing!) are my regular order with my love. We've become Ethiopian food junkies... I've gotten to know the owners really well, they and their staff have become friends. Watching the restaurant's remodel was super cool with it's new vibe -- and more importantly, with all of the take out we order, they just changed their packaging -- it's eco friendly! I'll be there again this week.\n\n\"...yefik'iri migibi, yefik'iri migibi, izīhi inē sēti lijiwotini iwedalehu.\" - Tsegaye Gabre-Medhin", "author": "Sm K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-03", "description": "After craving Ethiopian food for a few months, I am in a position a lot of 1st generation Habesha (Ethiopian/Eritrean) people find themselves in. Our parents make the authentic thing at home but we were not taught how to make it for ourselves, so there you have it. I have been in NY for half a year and away from the home cooked meals (insert sad face with tears here...and a tiny violin). \n\nSo I ventured on Yelp to find a place with good food, good portions and good service, especially from trustworthy Yelpers (a lot of reviews, friends and pictures). This is where my dear search left me. Auto correct insisted I call it a \"dear search\" go figure.\n\nThe place looks just like it does on the photos, very beautiful. Great location because it is right across the street from Cobble Cinemas and looks like a lot of nice places to explore in this area. \n\nMy waiter was the best! He was Indian...his name sounded  something like Query or Keeri (sorry for botching it up). I came with my daughter who just turned 5 and LOoooOoves attention. He was excellent in keeping her happy that I had to grab her from following him to the other tables lol. \nI was very impressed with how quickly he took my order and how quickly the food came out. I ordered the veggie combo so I was able to try five veggies! \n\nThe food tasted great! Veggies were properly seasoned with the right textured injera to complement each flavor. I ate until I was stuffed and was looking forward to eating the rest for lunch the next day. I asked for the bill and a to go box but he didn't hear me ask for the box and it was already tossed. I was super sad so he offered to recreate what I had and I felt super relieved and happy. The epitome of excellent customer service. The busboy was awesome, joking with the little one about her obsession with the wet napkins and cleaning the chairs with them for her entertainment lol. Every interaction with everyone was positive. \n\nTo sum it up, I highly recommend you give it a try. And yes, you can trust my review (Yelp Elite stamp).", "author": "Gabriella D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-18", "description": "Would probably give this a 3 and a half but that's not an option. As we walked inside the restaurant we could almost sense that we would have to wait. The tables were completely packed down to the last square foot. My friends and I decided to wait, which took about 15 minutes. We walked up and down the street and when we came back our table was ready. I had been to this restaurant before, and it used to be really trendy. There used to be no authenticity to the food, but tonight was a little different. The room as a whole was neat and tidy, as were the bathrooms. \n     \nI was dying to eat a sambusa, a meat filled pastry. My friends and I shared the dish, and it was delicious. As greasy and filling as it was, it was very flavorful, especially with the sauce it came with! For our entree we ordered a meat sampler, and a vegan sampler. Two of those meals came with berbere (a tasty spice). Of course the whole meal had injera (spongey bread) included. All in all, the variety of dishes completed all of our appetites, and satisfied us to a great extent. \n     \nAwash Brooklyn is still a trendy restaurant, but at least you can taste the Ethiopian culture in the food.", "author": "Richard V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-04", "description": "And you thought I was moody from my previous batch of anti-grade inflation reviews... this place gets a #MERLINFIIIIIIIVEEEEE (again, obviously with vowel elongation and a high pitch that I couldn't possibly carry in real life.)\n\nOn the surface, Awash seems like any other Ethiopian restaurant. Like \"Golden, Happy, Elite, Fortune, etc.\" for Chinese restaurants, \"Awash\" seems like a go-to word for Ethiopian stuff. But the internal decor is definitely different from your modal Ethiopian joint: lots of wall art, a neat layout, 'hip' mason jars to hold water, etc. I was worried! This violated my \"the dumpier it looks, the better it cooks\" rule for ethnic restaurants. I grew concerned, too, that we were getting a watered-down Ethiopian meal that panders to the 'unrefined' pallette (sp).\n\nThankfully, that wasn't the case here!! Everything tasted great. I shared a vegetarian platter. Even though the menu says you have to pick 5/8 or something, they just gave us a little bit of everything, which was actually way better. (Haven't you read the business school studies that show choices overwhelm and stress out customers?! No?! Well, I just saved you some time because that's the basic takeaway.)\n\nGuy who served us was really chill, refilling the injera and water constantly and very friendly. I like the upscale ambiance, even if it's slightly different from the \"dump\" feeling at your typical top-notch ethnic restaurant. Will come again!", "author": "Merlin C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "My first time trying Ethiopian food. I don't think it's fair to give this place anything less than 4 stars because I learned that maybe Ethiopian food isn't for me. My friends and I came here to celebrate a friend's birthday. She had spent some time in Ethiopia and wanted to introduce us to the food she had while she was there. The place is nice and cozy with a bar space on one side. Service was quick and friendly, they were ready to answer questions if we had any. We ordered some sambusas, both mixed vegetables and and beef. I think the homemade sauce that came with it went perfectly with them. I felt like it was a little chilly, so I decided to get their spiced tea, similar to chai, but the flavors were lighter, which I liked about it. We also tried the honey wine, which was very sweet, but could probably get you drunk without realizing it.  I liked it. It reminded me a little of plum wine. \n\nFor food, we ordered a couple of platters to share, which included the awash chicken, doro wat, tibs and different vegetables. We also ordered a shrimp dish, which was pretty good too. I liked the berbere sauce because it gave everything a bit more flavor. I liked the variety in vegetables, made the bread better. Before we got there, my friend already told me I probably won't like the bread (injera)...and she was right. Served in the form of rolls, they're slightly spongey and sour. I liked the texture, but the sourness is definitely an acquired taste. It grew on me throughout the meal though. Overall, a nice option if you want to give Ethiopian food a try, but I probably won't be a regular.", "author": "Geekar L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-02", "description": "Don't believe the negative covfefe in a couple of these reviews, folks. This place is insane.\n\nSpace is simple and not showy, and the lighting is good thanks to the big window. \n\nStaff is incredible. If you go for lunch you'll be treated to various menu recommendations and friendly conversations, especially if you are alone. \n\nI loved the awash chicken and a red beet salad, which is of course served with a perfect injera (you can smell the flatbread when you walk in the door, especially when the weather turns cooler). The lamb is perfect and there are multiple options for vegetarians and gluten free injera if that's your thing. \n\nMy favorite new place in the neighborhood.", "author": "Neil B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-22", "description": "I have to say hands down the best Ethiopian restaurant in New York. My friend and I were craving Ethiopian, we have tried other restaurants in the city and in Brooklyn but nothing really wowed us. The ambiance of the place is like no other, it's so cozy and warm with great music playing in the background. We sat at the bar, I ordered a Moscow mule and my friend got one of their signature cocktails- boy the bartender knows what he's doing. We got the combo platter with doro wat and special tibs and an order of the special kitfo. Everything is well seasoned yet not over powering. This place will definitely be our go to restaurant! Even just to sip on their delicious signature cocktail and enjoy the music.", "author": "Brook M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-16", "description": "Amazing food, service and ambience. Was such an enjoyable experience. The best Ethiopian I've had in NYC thus far.", "author": "Jessica R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "The Vegetarian sampler was great! The Doro Wat was the best I've had. I would definitely choose Awash over other Ethiopian options in Brooklyn  (e.g., Ghenet in Park Slope).", "author": "Phil C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-14", "description": "Good service, great vegan options, definitely one of my top Ethiopian restaurants in Brooklyn! I wish I lived close enough for delivery but I am happy to take the trip out to eat here.", "author": "Dani C."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Awash Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "242 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/GZd6Ey3PkGKy0GiTb8vQaQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182432151"}