{"aggregateRating": {"reviewCount": 162, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-09", "description": "I cannot recommend Awash strongly enough.  I've had Ethiopian food all over the U.S. and Awash is the best I've had, hands down.  I always order the meat platter which comes with plenty of veggie sides piled high on the injera.  \n\nService is fast, prices are reasonable, atmosphere is bright and friendly. Reservations are accepted but usually not necessary even though the place is usually bustling during peak hours.", "author": "Michael S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-17", "description": "Pretty sure I left my credit card there a week ago. I've been trying to reach them and they don't answer, they don't return my messages and when I finally got someone on the phone they said call back in 10 minutes and hung up on me. They didn't answer 10 minutes later. Now their mailbox is full. Service wasn't any better when I was there. \n\nIf you like spicy Ethiopian food with bad service this is the place for you.", "author": "David B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-20", "description": "This was a wonderful introduction to Ethiopian cuisine. I came here with a group of Yelp Elites and we had a fantastic deal of one entree, along with unlimited drinks (non-alcoholic for me) for a total of $30. \n\nThe restaurant is airy and spacious with plenty of natural lighting from the massive window in the front. There is a fully stocked bar with wooden tables and colorful paper straws, cool paintings throughout, hanging plants, and a back area with bright lights, where a traditional coffee ceremony was set up. Thanks to the lovely and friendly owners, the ambiance was very inviting and welcoming.\n\nI tried 2 different drinks. The first was called Spris which is a beautiful, layered concoction of papaya, mango and avocado juices in smoothie form. Served in a glass mason jar and orange, green, yellow in color, it looks like sunset. The taste is bursting with fresh fruit flavor and I loved how thick it was. However, it is extremely filling so I had to save it for after my meal. During my meal, I enjoyed a mocktail that was prettily pink and delightfully sweet. \n\nFor an appetizer, we ordered sambusa which is a large deep fried rectangular pocket filled with chicken and veggies. This was soo tasty and the outer shell was perfectly crispy.\n\nFor the entree, I shared a combination platter so that we could sample more items from the menu. Out of the meat, we selected Awash chicken, special tibs and lamb shank. Just as I was about to list the vegetables we wanted with it, our waiter said he would bring us all of them! \n\nThe combination platter was served on a huge plate on top of inerja (their version of bread), along with extra inerja on the sides. The inerja was quite spongy, soft and tasteless so I didn't have much of it. I understand that the idea is to wrap it around the food and eat with your hands, but I didn't feel comfortable doing that so I requested utensils. \n\nThe lamb shank was in the center and there were 4 different types of vegetables surrounding the 2 other meats. The lamb shank was huge and the meat was so tender it fell off the bone. The sauce was slow cooked with onions, garlic, ginger, turmeric and the restaurant's homemade butter. The combination of seasoning in the sauce was really good. I also loved Awash chicken which was marinated in garlic and ginger then cooked with tomatoes, celery and jalapeños. The chicken was incredibly juicy and flavorful. Then there was the special tibs, which were beef cubes marinated in spicy sauce but I didn't find it to be spicy at all. The beef was nicely succulent, but wasn't as well seasoned as the other meats. I thought I would like the beef more, but it didn't really wow me. \n\nEven though the waiter mentioned he would let us try all the vegetables, that wasn't the case. There were a couple that I would have preferred over the ones we were given, but overall it was still a good variety. Collared greens, beets, chickpeas and yellow split peas were the ones I tried. Out of these, I liked the collared greens best, but all of them had great seasoning and herbs which were yummy and mouthwatering.\n\nMy favorite vegetable side was the cabbage, carrots and potatoes which was actually not on my plate. This was seasoned with garlic, ginger, onions and turmeric. The vegetables were all cooked to the exact consistency I like - Soft, yet still firm and there was a ton of flavor in each bite. \n\nThere were only a couple of desserts and we had the tiramisu, which I thought was interesting since it is Italian. I would've liked to try a traditional Ethiopian dessert. Also, I am not a huge fan of tiramisu but I was pleasantly surprised by it. Served in a round bowl on top of a long plate, there was an outline of a fork on the plate which was super cute. The cake was light, fluffy, moist and soaked with strong espresso and rum, while the top part was creamy, velvety smooth and delicious! \n\nAfter our meal, we were privy to a traditional coffee making ceremony which was a real treat. There is a lot of time and care that goes into roasting the coffee beans and preparing everything. We got to taste a small cup-full and it was amazing! Full bodied, pure, robust flavor, with a hint of licorice and not bitter at all, it didn't need much sugar or any milk.\n\nThe service was top notch. The husband and wife team is warm, personable and very knowledgeable about the menu. My friends and I spent the whole afternoon there and  they were eager to please and easy to talk with throughout. They ensured we were always taken care of with drinks and everything requested. I would definitely come back to try more of the menu!", "author": "Kathy X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-20", "description": "I've not had the opportunity to try any of their other locations, but I can tell you, this is, hands down, the best location.  From my two experiences at this locale, the food is \"da bomb\"!  Seriously, from the supreme service to the cocktails, to the chicken, the beef or the vegetables...outta sight man...or woman.\n\nThe decor I hear is an upgrade, thanks to the husband and wife team: Milka \u0026 Romeo, investing in a much needed renovation.  Either way, the space looks modern with a twist of hominess.  It exudes touches of cultural aesthetics and informative boards.  The bar is of average size with whatever your heart desires.  From their specialty cocktails to their original Ethiopian beer, you're in for a great ride!\n\nCocktails: my date had a few of the Yadero Arada cocktail which includes honey wine, gin, mint \u0026 OJ.  He enjoyed it immensely.  And I had a few IPA, pretty standard stuff.\n\nMust try app: their sambusa, choice of veggies or chicken.  Go with the chicken - with a light flaky, melt in your mouth pastry shell and perfectly seasoned protein.  You will finish every last bite!\n\nEntrees:\n1. Goden Tibs: Prime boneless short ribs cooked to perfection. Sautéed with our secret blend of spice onions, ginger, garlic, tomatoes and jalapeños.  Served with beets and collard greens atop injera, of course, with additional injera served on the side.\n\nMy date could not stop eating!  He has a rambunctious appetite, and couldn't finish; tried his darn best!  So much food! \n\n2. I went with make your own combo. You have a choice from three options, one of two chicken and/or one beef.  I selected the Awash chicken and special tibs.  I thoroughly enjoyed both, especially the beef tibs.  Reminded me of mom's beef curry, ahh memories.  Served with two types of lentils and their signature collard greens.\n\nI was stuffed, and I never eat that much!  We simply couldn't help ourselves!  Eating here is guilt free anyway, because mostly everything on the menu is good for you.\n\nNOTE: Keep an eye out for an UYE at Awash BK hosted by yours truly!", "author": "Beenish H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-21", "description": "So I had a great time a Awash. The vibes are amazing and the people cool.\n\nI went for an event so I didn't get to try all I wanted. I def be back to try the other things in the menu.\n\nI loved the Sambusa with chicken... it's great fried flaky-ness... on point. \n\nOther than that I tried the collard greens wrapped in Injera. I didn't like it....\n\nThis was my 1st Ethiopian food experience so I didn't know it would be cold. It was such a surprise lol\n\nThe next two Injera wrapped items I were great! \nLentils and beets (I think it was beets) by then I gotta we prepared for cold. \n\nThe avocado snack was the perfect starter\n\nLooking forward to going back and trying the food the way it was meant to be eaten. And the other options like the Lamb", "author": "Rashon B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-03", "description": "Can't love this place more than I do! \n\nThe last time I visited Ethiopia was in 1997 and then again in 2011. A beautiful country with the most gracious people and incredible food. Sadly what we are shown in the media about Ethiopia is NOT the whole sum of or even a fraction of what is Ethiopia!\n\nThis gem of a place is beautifully decorated and inviting. The owners are bar tending and greeting guests as they arrive and visiting each table, making sure everything is to their liking as they sit and eat. The rest of the staff are also super attentive and warm too! \n\nForgo the forks and do as the natives do and eat with nature's utensils, your fingers!\n\nTotally vegetarian friendly and hugely a carnivores delight and for this omnivore it was pure nirvana :)\n\nOrder the meat combo that comes with 2 meat selections and 3-4 veg as well. You get to try a bit of everything and for the price you get sooo much! If you plan to share it, there is a $9 additional charge, which I think is very fair. Their steak tartare (special kitfo) is well balanced in flavor and spice and so silky in texture. The Doro wat, their signature braised dark meat bone in spicy chicken dish is a must order, succulent and spicy! The lamb yebeg tibs was perfectly cooked where the meat was not stringy or tough. The vegetarian options were so nicely seasoned and flavorful, we could not get enough! Try the Key sir (beets \u0026 carrots), Gomen (chopped collards), Yatakilt Alicha (braised cabbage \u0026 spices), Yater Kik (braised yellow split peas), all so good!", "author": "Jenn S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-19", "description": "This is my first time having Ethiopian food so I honestly didn't know what to expect. \n\nMy thoughts:\n\n1. I like the overall vibes of the restaurant. The painting on the walls were amazing and the lighting was awesome. Creates a nice laid back relaxing mood with great afro music playing in the background. \n\n2. The waiters were attentive and friendly and give some good recommendations. \n\n3. I had the honey wine which had a sweet taste but not too overpowering. But this drink is a creeper! I recommend it. \n\n4. The injera. Very interesting taste of a spongy type of bread. I enjoyed using my hands to eat it with my meal. \n\n5. They are very friendly to vegans!\n\n6. They have good combos as well for groups or if  sharing food. Which is a plus!\n\nI would definitely try them again. I enjoyed my first Ethiopian gastronomic experience!", "author": "Alicia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-26", "description": "Went here to celebrate a birthday and to try a new cuisine; the restaurant is pretty and the servers are attentive. The vegetarian curries are delicious and they are thin in terms of consistency but they are what I enjoyed most - lots of flavor. The sourdough bread injera was not for me and my boyfriend, the sour taste did not mesh well with the curries or by itself and was just not for our tastebuds. The meat curries are slightly sweet which was not expected, but they taste good, not better than the vegetarian ones however. I personally like the lentils the most. \n\nThe combo platter was more than enough for two people and it was truly delicious. I would absolutely try more from this restaurant, but I know now what I like and dislike about it. Fair prices and definitely worth trying.", "author": "Julia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-13", "description": "Ahh the lovely Awash restaurant! So glad to experience your services which I can describe as warmth, and welcoming hospitality. I would of never knew about this place out if it wasn't for yelp and other yelpers.  \n\nI first went here for an elite event which was nice, but wanted to check it out on a random day myself. Luckily some yelpers got together on a Saturday to experience their welcoming service, but was only able to get a brief taste. I didn't order a meal but enjoyed an appetizer (Sambusa), coffee, mimosa, and dessert. Everything was great and memorable, but didn't get what I came in for. So again, gotta come back here for a full fledge meal. \n\nWas able to bring a couple of friends for dinner here. They love Ethiopian food, but never heard of this place. They were excited to try it out. Shoot I was excited too. We started off with appetizers. Then we went straight to the meals. They got the vegan platter for 2, and I ordered the make your combo for 1.\n\nMy combo cam with the dorwat chicken and special beef tibs. The sides included beets, collard greens and lentils. They flavors were amazing and strong. Nothing I've had before. The bread had a tangy aftertaste, but not sure if that's the usual taste. I'm not used to Ethiopian so everything was a new experience for me.\n\nThe drink I ordered was their White Russian spin off drink. It was delicious. Taste like I had spiked coffee with their original flavors and garnish inside. As a big coffee person I really enjoyed it. I think I may have a bust of energy for the rest of the night. The pairing of the drink complimented my beef, but not so much the chicken, which was fine. I was able to savor my drink more after my dinner. I'm just the food is so filling you've gotta just sit back eat and enjoy. \n\nThe ambiance of this place was lovely and chill. You can go for a refreshing lunch or relaxing dinner. A lot of decor of lighting, plants, and traditional items. \n\nBringing back to that Saturday they had a coffee ceremony. Hopefully I can come back to see it.\n\nThey have happy hour but it's only until 7pm for the beers and wine. It's not a hefty type of happy hour, but they have beers I've never heard of so worth giving a shot. \n\nWould I come back? Yes, definitely and then some, but probably not for the plate. The bread taste didn't convince otherwise, but the meat and appetizers were really good. The owners have something good here, and hope it last a long, long time.", "author": "Diane D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-17", "description": "Came here for an early dinner and so glad we did. The ambiance is so nice with a modern Brooklyn yet traditional Ethiopian vibe. I got the spiced tea without sugar and it was perfect for a cool evening. We shared the vegetarian Ethiopian combo platter and while it was filling, we felt it was a little bland for us. We asked for the hot pepper spice and once we sprinkled that over it was perfect. The service is great and so glad it's in the neighborhood.", "author": "Shivani S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "Romeo and Milka have been so gracious to us. Allowing us to hold a brunch event and pester them all morning and evening long. They were champs. Even put on a coffee ceremony for us. I've been dying to try Ethiopian Food for some time. I love the vibe here and can't express enough how grateful I am that they hosted us wild Elite Yelpers. I knew when I came here for an Elite even I'd be back. Especially for brunch. Not sure if it's casually offered but it was much needed. Whatever you guys do, make sure to order the sambusas (chicken preferably) and the tiramisu. This will definitely be my new date spot lol.", "author": "Amira A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-31", "description": "Five years later, I'm still not sure that Ethiopian food is really my thing...but you know what is, increasingly? Awash. \n\nHere are some things I like about Awash:\n\n1. The injera. As a caveman at heart, I love the practice of eating everything with my hands/this spongy flatbread, and Awash's injera is as good as it gets. Also, I love the idea of getting a whole host of colorful and flavorful items atop an edible plate.\n\n2. Giving out gurshas left and right. A gursha is when you scoop up a portion of food and place it in the mouth of someone at the table. It's an act of friendship and unity, and I've found that it's better to let someone know before you give them a gursha otherwise you could just be mashing food into someone's face. Also fun, but not an act of unity if it's my wife.\n\n3. It's so vegetarian/vegan friendly. It is probably a sign of personal growth, but I am no longer horrified by people that consume nothing but poor defenseless plants. I've even made some vegan friends, and Awash is a great place to take them.\n\n4. Broadly, the combos. All I ever want is to eat all the things, and they give you all the things.\n\n5.  Specifically, the Awash chicken (I've found the beef to be dry on occasion, the chicken is better), the sambussas, and especially the Bunna martini they make with coffee and Kahlua. That thing is tasty as hell, if not the manliest thing to drink.\n\nHere is one thing I didn't love about my last visit to Awash.\n\n1. There was a lady using the men's room when I went to go, so I had to wait. And honestly, I'm totally fine with that. They are single use bathrooms and there's no reason not to use the free one if the other is occupied. And lady, I don't even care if you have to poop in the men's room. But for the love of Pete, at least flush properly. \n\nHere are some things are still true:\n\nIf you are particularly enamored of Ethiopian cuisine, you'll love Awash. \nIf you've never had it, Awash is a great introduction. \nIf you don't really like Ethiopian food, you probably shouldn't go, and you probably should've stopped reading this review a while back. \n\nBut then again, I didn't really like Ethiopian food at first, and now I like Awash, so give it a try.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-11", "description": "Off the hook!\n\nPrior to Awash, I've never had Ethiopian food. In fact, I didn't even have an idea about it. But now I understand what I've been missing for so many years. \n\nIt's kind of hard to explain the food. It's simple and complex, it's sweet and spicy, it's soft and firm.  It's all of that and it's delicious. \n\nWe ordered a lot. And it was all good.  The Sambusa was hot, crispy and flakey. The Doro Wat was the perfect blend of flavor and heat. The Awash chicken was delicious. But the star of the meal was the Goden Tips (shouts to the staff for the recommendation).  It was just perfect; and if there is one thing to get there, then this was it. \n\nAs a side note, I was surprised by how many of the ingredients were similar to what people in Eastern Europe would be familiar with (Beets, cabbage, potatoes). \n\nAnyways, broaden your horizons. Check this place out.", "author": "Alex L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-20", "description": "One of the nicest place for euthopian cuisine. If you are trying this cuisine for the first time than Awash is probably the right choice. We went for a bday party in a group of 10-12 people. The service was good and the food was really great. \nIt is definitely vegetarian friendly. They have tons of vegetarian options.", "author": "Lajja M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-22", "description": "Amazing food! Great service!! This is definitely the best Ethiopian food I've had in New York (and I'm Ethiopian) Love the vibe! Love the art! I'm very happy with my experience and will be back (:", "author": "Meron M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "I had one of the best dining experiences in a while at Awash.\nThe food was outrageous, I highly recommend trying this place.\n\nThe bartender/owner was extremely friendly and also gave us a few new cocktails to try on the house.    It was delicious!\n\nGreat food, amazing staff and excellent atmosphere.", "author": "T J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-18", "description": "Good Ethiopian food that's not too expensive with decent sized portions (in comparison to my other experiences w Ethiopian platters that have had small portions). The sampler (we got the meat sampler) was enough for two with an app. Cool vibe inside but expect to wait for a table at peak dinner time.", "author": "Alex D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-03-23", "description": "Was a good experience. Would recommend the doro wat chicken!\n\nCame here with the girlfriend to try the meat sampler. Of the selections, I believe that the doro wat chicken was the tastiest. It was spicy, tender, and full of flavor. The lamb and beef were a bit less flavorful for me, but not bad. The veggies were excellent! This spot looks like an amazing place to hang out with friends and have a drink. I do wish that the meat portions were a bit bigger for the price!", "author": "Raymond F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-19", "description": "don't really think Ethiopian food is my thing so don't think its really fair of me to make any assessment of the food, but oh well just a quick disclaimer i guess, my opinion shouldn't really matter.\n\nstepped in and was taken aback by the hip and cool vibe that this place had, scattered along the restaurant were these really cool african art pieces while still giving a uber hipster brooklyn vibe off, really nice spot for a chill night out.\n\nthat being said food was just okay, i ordered the injera bread to start as an appetizer, bread was too sour and spoungy for my taste and the chilli and spices they used to fill the bread tasted incredibly earthy and minerally, basically it was bread with spices that really did not appeal to my palate.\n\nfor the main dish i got the meat combo, which again was just okay, the same spice they used for the injera bread they used again for some of the meat and lentils on the plate and with the vegetables they mixed it up some, but overall just nothing here really stood out to me.\n\nhate that this was my first ethopian experience........really wish there was an expert to guide me on what to order based on my palate.....but oh well can't win them all....this is still a really nice place for dinner and drinks", "author": "Roger H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-27", "description": "I just happen to be in the area around lunch time on a Saturday and I've been craving Ethiopian food for quite some time (go figure). This place totally hit the spot!! Their injera is perfect, the doro wat divine and the special tibs are so tender. The combo I ordered also came with three veggie dishes, and was PLENTY of food for lunch. I also couldn't help but order the spices Ethiopian tea, which was equally impressive. \n\nService is great, and the ambiance is lovely. Craving is now officially satisfied!", "author": "Shu Jin S."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Awash Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "242 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/GZd6Ey3PkGKy0GiTb8vQaQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182432151"}