{"aggregateRating": {"reviewCount": 162, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-16", "description": "Visited here on a rare trip to brooklyn and was very impressed.  I got the raw marinated beef on a whim, and it turned out that I loved it! Similar to a ceviche maybe or steak tartare, the beef was seasoned very well (a tiny bit salty) and was delicious with the bread.  I would totally go back again.", "author": "Naijia H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-06-29", "description": "It's pretty funny how the first positive review (which got filtered out by Yelp) is from someone who never posted before and is full of buzzwords.   So obviously a plant.   And then two more positive reviews that sound just like each other.   \n\nIf you want good reviews, Awash, address your service problems and tighten up the supervision of the kitchen.   I want you to be there and succeed, I really do.    You should be grateful for the feedback.  Without it, your restaurant would fail quickly and you wouldn't know why.  Cobble Hill is hyper-competitive and better run places than yours have come and gone in a flash.  I live right around the corner, and I am watching.\n\nUpdated:  one of the positive reviewers here (who I won't name) took it upon themselves to private message me with a scathing attack.  Obviously the owner or a friend of the owner.    Really?  I'm not supposed to review a place based on eating there? (yes, she did say that).   Get a grip.  Reviews are based on experience and this was mine.  Other reviews corroborate.   I gave specific, detailed feedback on what needed to be improved.   Feedback is a gift.  Instead of channeling your negative energy towards me, improve your service and make more satisfied customers..", "author": "Red A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-13", "description": "My first experience with Ethiopian food. Loved the ambience. Tried the vegetarian platter. Portions are huge and the food is very very good. Would definitely reccomend.", "author": "Divya R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-12", "description": "The best Ethiopian food I've had in NYC (and I've been to most all of the other places in the city)! The mushroom tibs appetizer was great, quite spicy but not too spicy. Had the Awash chicken and a make your own veggie combo, both were delicious.", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-06", "description": "I haven't been to Awash in years, and never the one in Brooklyn. What a mistake! My experience was excellent. My date and I started with the veggie sambusa and moved on to the veggie combo for 2. The combo provided a ton of flavorful delicious food. For the first time in a very long time we actually couldn't finish the meal. i can't wait for my next trip.", "author": "Noella S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-07", "description": "Very good food and reasonably priced.\nUnderstaffed though and services was very slow. Need another waitress and probably a busboy on busy nights.\nNice people though.", "author": "Mark E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-19", "description": "I came with my husband on a Friday night. We've been excited about an Ethiopian place opening up in the neighborhood since we've been having to drive over to Ghenet in Park Slope for our Ethiopian food cravings. \nThe restaurant was busy, but not full, though we could tell that the 2 waitresses looked harried and seemed behind on their orders. Once seated, we decided to be more proactive and swiftly flagged someone down (she might have been the owner) and put in our orders. \nThe food actually arrived quite quickly for us (faster than others who were seated before us) and we were pleasantly surprised! We ordered the meat combo for 2, with beets, collards and chickpeas. Everything was delicious and well-spiced, and we were promptly offered more fresh injera when we were almost finished w/ ours. The portion size was quite generous, and we were completely satisfied at the end of the meal.\nWe also had the sheba tej, ethiopian honey wine, but found it too sweet for our tastes, almost like a dessert wine.\nOverall, judging from other reviews, the service was uneven, but we lucked out and had a great experience, and the food was really fantastic. Compared to Ghenet's, I felt Awash's food was better spiced, the injera fresher (sometimes Ghenet's gets dry around the edges) and the price point slightly lower (but wine more expensive at $9 a glass). I think we will definitely be coming back here in the future for sure! (although it probably isn't the place for you if you are in a hurry)", "author": "VPacific C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-10", "description": "simply amazing!  the customer service is great, the food is authentic, delicious and the place feels cozy. The PRICES are affordable. I'm a fan guys!", "author": "Garnett A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-09", "description": "Haven't been to Ethiopian since Adams Morgan 15 years ago. After having what I thought was a uniquely wonderful experience there, I never wanted to try anything else and I just never made it back to that part of DC with the right combo of people (you have to go to Ethiopian with TRUE FRIENDS)....anyways, we stumbled upon this place by accident on a Sunday night when it was about 25% full; we were 8, 4 adults and 4 kids under 13. The staff was great, friendly and pretty attentive. No better or worse service-wise than anywhere else I'd give a 3*** rating. The food was WONDERFUL! Lamb was so NOT gamey; chickpeas and other vegies were prepared in ways I've never seen; and overall-- for the family and children we were with-- this was a very special, tasty food encounter. This is not a 5* rating or even a 4 b/c some aspects are a little off -- but none worth mentioning here. It's a solid, special place to which we will return. FYI we ordered in such a way that we all ate off our own plates, which was not possible at the Adams Morgan joint. However, we all shared a little bit and ate shamelessly with our hands-- which was a lot of fun for the kids who we're always urging to use their utensils in the proper fashion.", "author": "Micah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-20", "description": "Can't get enough of Awash, which is a good thing since its only two blocks away from me. Whether eating in or ordering delivery, the food is consistently delicious, with each of the dishes being delicately spiced to perfection.  I am positive that in injera (aka sour spongy bread used instead of silverware) grows three times it's size once in my stomach, so I usually have to be rolled out of the restaurant, but it's so worth it.  I would skip the honey wine, unless you have had it before and have a palate for it-- I apparently don't lol. But five very enthusiastic stars!", "author": "Vanessa B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "awash serves up really delicious ethiopian food in a great atmosphere with sweet and friendly waitstaff! their recent renovation is beautiful, and the food is exactly the same -- plentiful and flavorful. this is one of my favorite places to get a veggie combo platter in the city! definitely try it asap!", "author": "Lindsey W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-19", "description": "Went here on a very quiet Sunday night. Pretty good for what i've had in this area. Unfortunately, having been spoiled growing up, by an incredible Ethiopian place in Montclair, NJ, my standards are pretty high. At Awash, the atmosphere is decent, though not as good as other places in Manhattan.  Portion sizes were huge, and the yemissir kik wat and the  the shiro were very well spiced. The shiro was the better out of the two: light and fluffy, and flavorful. The gomen was alright, though i've had better. The injera was also not  the best i've had, and the large piece under our platter was not sturdy enough to hold up the remnants of the food. I remember the injera from my childhood being served warmer, spongier, and more sour. Service was okay, albeit a bit slow and not super friendly for a dead sunday night. I'd give Awash 2.5 stars. I really wish I could give this place a  better rating, as the signs outside this place always seem so inviting when I pass by! I'd maybe give it another shot during a week day.", "author": "Sarah G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-02-26", "description": "The food is good and I want to like this place more but the delivery times are nothing like what they quote.  Be prepared for almost two hours every time, not 30-45 min.  Calling doesn't help either...", "author": "Devina F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "REALLY good food! very simple, affordable and laid back. You go here for the food, not the decor, atmosphere or service. The food was GREAT. I overate, because I couldn't help myself. It was just too good! if you're a fan of Ethiopian food, do not settle for Bati! Go to AWASH instead!", "author": "Ms R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-27", "description": "pretty neat food, interesting spices with the meat. the collard greens on the side were tasteless, like they were steamed in the microwave.", "author": "S W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-08", "description": "as frequent customers of the 6th st awash my husband and i had high hopes and were not disappointed!  we got the meat combo and veg combo so we could sample a lot of  dishes.  the portions were generous.  all the dishes were good and had flavors as expected.  the string beans and carrots were divine and just like 6th st. the the beef and lamb were  tender.\n\nthey take credit card, deliver and the delivery was very quick.\n\ndefinitely plan to order again and go in person in the future.", "author": "Christine C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-16", "description": "The first time I went here the food was amazing!!! I raved and raved. The second time I went just two weeks later the exact same dish was overcooked and didn't taste as remarkable. So a month or so later I attempted to give it another chance and it says that they deliver. So I called but was put on hold for 10 minutes!!! And when I tried to call back the line was still busy. I think they perhaps they should hire more hands. I will say that the Injera was good but I need to find another spot for my Ethiopian food fix!", "author": "Elsa M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-26", "description": "My fiancee and I ate here on Saturday night and it was his first time having Ethiopian.  We loved the food here.  They sat us right away even though it was Saturday dinner rush.  The honey wine that they offer is to die for and we got one of each.  We shared an entree because we didn't want to get too full since we were going to an event later.  We got very full nonetheless and made slurping and nomming sounds throughout the meal.  Definitely impressed with the spicy beef cubes.  I can't wait to stop by here again.", "author": "Roxy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-27", "description": "We have been faithful fans of Awash on 6th Street. We were thrilled to find out Awash moved into our neighborhood! Their food is outstanding and we love Boge and Benny!! Our favorite is the veggie combo. Awash is one of the only Ethiopian restaurants to serve our favorite, Shimbraasa. Don't miss eating here.", "author": "Kristin R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-09", "description": "i ordered from this place and they estimate 30 minutes. 50 minutes later i called them and they said they needed another 10 minutes. an hour and 20 minutes later they said the guy was on his way. there are enough other places in the general area to order from - don't bother with this sub par service.", "author": "Alina K."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Awash Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "242 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/GZd6Ey3PkGKy0GiTb8vQaQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182432151"}