{"aggregateRating": {"reviewCount": 162, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "Excellent eating experience..It was beautiful-peaceful and relaxing. Staff was outstanding the food was absolutely wonderful, fresh, and properly prepared. We especially enjoyed the meat and vegetarian combination. The cocktails were really good.", "author": "Getenet L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-04", "description": "This Cobble Hill Ethiopian gives my Park Slope old -favorite a run for its money.  Only thing setting them apart is service.  Service here, though friendly and welcoming is slow.  Fantastic doro wett served super spicy and full of flavor.  The goat aletcha was very good as well.  Served with two types of lentils, beets, collard greens, carrot and cabbage, it was a big flavorful meal when scooped up with the tangy injera bread.  Prices are a bit high but order the combinations for a much better price.  Worth coming here and highly recommended but you'll need to be patient.", "author": "Anthony G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-10-13", "description": "the food is fine. had lentils. rlly amazing service tho. cute. so much good ethiopian in the city, i just wldnt go for it in cobble hill but its not rlly their fault in a way.", "author": "Haiku U."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-10", "description": "The atmosphere is nice and relaxing. The appetizers were great esp the beef sambosa. This place is great if your looking for an adventurous meal", "author": "Maria J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-01", "description": "This is my favorite food in the neighborhood! It's always so delicious and I crave it all the time. It's consistently good.They have great vegan options too.", "author": "jackie a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "Really good, spicy food and generous portions. Service was solid as well - props to the bartender for deftly handling a packed house, including table service, until reinforcements arrived.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-10", "description": "The combo for 2 was ok. The spicy chicken was really hot to handle. Eat at your own risk. I liked that they provided more bread as much as you want.", "author": "Marz S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-02", "description": "This place is EVERYTHING. We got lamb entree and veggies. Had the mushroom tibs for an appetizer - which was dope.\n\nI highly doubt anything is bad on the menu. Legitimately want to try everything there.\n\nAlso, we had the honey wine. Surprisingly good - even though I usually don't have sweet wine. If only I could quit my job, order a few cases of honey wine, and get wine drunk on a beach somewhere for the rest of my life...", "author": "Jason G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-13", "description": "Update: Went to the Ethiopian restaurants in DC. Awash is still my favorite. Hands down.", "author": "Al T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-29", "description": "The vegan options here were very good. But do not order the meat sampler. The doro wat was strips of bare chicken with no berebere sauce or egg. And we ordered extra eggs that we never received. The special tibs were okay, but the lamb yebeg alicha tasted funky. But the worst was the fact that we waited over an hour for the food. The staff was apologetic and comped us a round of drinks, but otherwise ignored us and had to be called from across the restaurant to refill the water glasses.", "author": "Virginia D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-19", "description": "This was my second time experiencing the deliciousness that is Ethiopian Food. I came here early on a Saturday night. The place was kind of empty and had no wait. I loved the ambiance, it was cozy yet spacious at the same time. \n\nAvocado Salad:\n\nWe started with the the Avocado Salad which was pretty much Avocados and Tomatoes. Cant really go wrong there. The salad was tasty but nothing special. I found a piece of plastic wrap, that apparently was used to cover it, in a piece of Avocado and although i was not grossed out completely, i was a little annoyed that no sort of compensation (in the form of a drink or snack would have been fine) was offered. This is the only reason I'm taking off a star. \n\nKategna:\n\nWe also started with the Kategna which was pretty much where my love for Ethiopian Food started. The dish came in with the Injera rolled and cut. I am used to having this dish with a light cheese, but thats not how its done at Awash. I was okay without the cheese since the dish was not as spicy as I thought it would be. A must try for first timers.\n\nDoro Wat \u0026 Gomen Besiga (meat combo):\n\nI love that this combo came with veggies that I did not have to order. The first place I tired made me order two meats and two veggies. I could care less about any part of the dish that is not meat but this was a nice treat. The Doro Wat was delish! Did not come with the egg that is customary which was nice for me. The Lamb was tasty as well. A little fatty but i will chalk that up to a one time thing. \n\nI really enjoyed my first Ethiopian experience and Awash did not disappoint for my second time around. The staff was lovely and the food was delish. If I am every in the area I will surely be back!", "author": "Tash B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-02", "description": "It was ok... I had a veggie plate so didn't venture into anything else since it was my first visit. Only a \"B\" rating so I expected more... Drinks were great!!", "author": "Lesley H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-07", "description": "We've been at this location of Awash a number of times in the past but not since the remodeling. The decor is beautiful and the paintings on the wall only add to its beauty. It does seem to be under new management. They now bring you packaged wipes to clean your hands when you are seated, which is very nice!\n\nAnd while the food was tasty, it was cold. The injera was also different. It was cold, hard, and did not have that sour taste (probably because it was cold). Also, our food was served on a smaller piece of injera than in the past, with a small portion served on a small plate. Still the ambiance was very nice and the service was excellent.", "author": "A L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-01", "description": "the cleaning solution used here has a super strong smell... and makes the eating experience impossible.  all of our sinuses were burning.\n\nuntil the management changes the cleaning solution, none of us will go back.\n\nmaybe we will get \"to go\" as the food is good, the vegetarian options clean and tasty -- I miss the spicyness of the food when I traveled in Addis Abbaba... the flavors were 'washed' down to American tastebuds....\n\nservice good, lovely staff.  though they told us \"we get used to the smell\"\n\nsince traveling in Ethiopia in 2001, I've been to every Ethiopian restaurant in Manhattan and Brooklyn that there ever was, many times....\n\nPLEASE CHANGE YOUR CLEANING SOLUTION SO WE CAN COME BACK", "author": "Rachele L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-31", "description": "While neighborhood hunting this afternoon we stumbled upon Awash.\n\nEthiopian food was recommended to me by a friend of mine who raved about the cuisine.\n\nThe restaurant itself it very comfortable and at around 3 PM was fairly busy but I suppose not so much for a Saturday afternoon.\n\nI had the Awash Chicken which included beets and red lentils. Having never eaten this type of food before I was very excited and pleasantly surprised. The chicken was amazing, I think even my husband (who got beef was jealous of it). \n\nMy husband has the Special (Beef) Tibs which was also delicious and came with a side of sauce and collard greens, which I wished came in place of my beets since I'm not a huge fan of these.\n\nThe menu itself does not indicate what sides come with what dish, all that you know that you are getting is the entree and injera.\n\nThe injera itself it very good, springy and best when served warm.\n\nThe only complaint is that the injera that my chicken dish was served on soaked up a lot of oil, which sort of rendered it inedible to me.\n\nDefinitely excites me to continue to expand my experiences with Ethiopian food.", "author": "Lisa F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-08", "description": "After living in Oakland, CA where there is a large Ethiopian/Eritrean community, the food at Awash is no match. No Ethiopian or Eritrean would want to eat here as the quality of the food is far below standard. At the Awash, I asked for specific Ethiopian/Eritrean spices, which they did not have. The customer service was mediocre.", "author": "W Bill S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "First time having Ethiopian food. Didnt know what to expext.\n\nWOW! Such great flavours. \n\nThe honey wine was great!  We had a combination for 2. This could easily feed 3 people, maybe 4 (small eaters). Will definitely recommend this place to anyone. Its great for friends, groups or a nice meal alone.", "author": "Nevon K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-26", "description": "As an abesha (ethiopian) I can honestly say some of the best kitfo EVER. Seriously, do not miss out...they have something for everyone. Even the vegetarian cuisine (saying this as a meat lover) is superb! Ahh getting hungry again just thinking about!", "author": "Natnael A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-01", "description": "Really good Ethiopian food in a pretty neighborhood. We got the combo platter for 3 and shared it, and liked the entire selection. They were also kind enough to accommodate our tastes with the vegetables included in the platter (we asked for no beets). Service was a bit slow, but overall, I would come back.", "author": "Ruchi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-12", "description": "Came here for the first time and absolutely loved it! \n\nThe restaurant has a warm and inviting feel, upscale without feeling fussy. \n\nWe order the special tibs and the beet dish. Everything was delicious, a complex mix of spices without being overwhelming. \n\nI recommend the honey wine as a great complement to the food.\n\nWill definitely be back again soon!", "author": "Julia H."}], "servesCuisine": "Ethiopian", "priceRange": "$11-30", "name": "Awash Brooklyn", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "242 Court St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/GZd6Ey3PkGKy0GiTb8vQaQ/ls.jpg", "@type": "Restaurant", "telephone": "+17182432151"}