{"aggregateRating": {"reviewCount": 42, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-23", "description": "I used to work with Thai and Lao people and every lunch time at work, it would be a communal gathering with them cooking up the most authentic and delicious meals. \nI was excited to see Isan food being offered in the Dekalb market. However my excitement stopped there. My experience was ruined by the cost and options to amend a menu item. I ordered the zaab wings and pork shoulder - which states it comes with a side of jasmine rice. On the menu, if you were to purchase the jasmine rice and sticky rice separately, they both cost $3. I asked if I could just change jasmine rice to sticky rice, and the cashier said no. So on top of the $11 wings (note on the board it states $9 but next to the cashier screen on another board it states $11), my $12 pork shoulder and another $3 for sticky rice, my whole meal cost $26 plus tax. And I had extra jasmine rice that I did not need, I did not understand why they could not just to swap the rice since they both cost the same?\n\nTaste wise, the pork was tender and had a good ratio of meat and fat. The jaew sauce that came with it was nice and the sides of cabbage, beans and cucumber is what is usually served in Isan cuisine. The cucumber however was a bit translucent, as in it looked like it was cut a few days ago and not fresh.\nThe wings were very spicy, I understand Thai cuisine is usually spicy but for me personally I was unable to enjoy it.\nThe other items on the menu look good and I would have liked to try the sour pork with rice and larb however my experience was disappointing and honestly I'm not sure if I would go back.", "author": "D M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-20", "description": "Just ordered from them. Got the Thai iced tea with lime that was on their menu. They gave us the wrong drink and when we told them it was the wrong order they told us that Thai Iced Tea with lime wasn't on the menu when it clearly was. She then took it back with an attitude and the chef even came out to yell at us for not taking the drink. I still don't understand what happened...Eventually they made our drink for us but only after we physically pointed it out to where it was on their menu. Btw they only serve four drinks so I don't know why they were all hit with amnesia at the same time, very unfortunate...After that it took us 20 mins to get our order and three parties that were in line behind us got their order before us. The food was good but def not going back to be treated like shit again!", "author": "Q. D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-01", "description": "Like many other reviewers we randomly decided to give this place a shot and have been back 3 times since for the chicken. Really amazing flavor. Also tried the mushroom salad which was very tasty. An added bonus are the register staff who have been super friendly on every occasion (one warned me on the spice level of a salad after I paid then was very friendly when I changed my order). Very happy to have this place here and made it a point to write a rare review for it.", "author": "Bkduc D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-21", "description": "I have not posted a review in at least 3 years, because, you know, Yelp. That said, you should go here immediately because it is the best thing at the food court by far and ugly baby is less convenient. Go here now.\n\nAnd to all the haters who wanna be first: this restaurant opened, like, 7 days ago. If you want to give us some hot takes on staff who are still learning the ropes, or dishes that need adjusting, do the Pete Wells and give it two or three chances before you try to slay it. This is why I stopped Yelp, but it's also why I'll dig in super hard on the one review I do write.\n\nBy the way, I had the crispy rice salad, the wings (which were a generous portion and served piping hot), and the mushroom salad. Particularly impressed by the third item, which is often a throwaway, even at some of the Qns greats. Texture, balance, spice without just being for show.\n\nNow you can go back to this being a hot takes platform for people who want to distinguish themselves in the smarmiest possible fashion from people who just happened to like a place.\n\nBe out.", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-10", "description": "What a gem! The grilled chicken is great, the sides are great, especially the mushrooms. Be ready to embrace some spicy.", "author": "Cori S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-19", "description": "What a great addition to Dekalb Food Hall! Chicks Isan let me discover a different dimension of Thai food than the Pad Thai driven version we are used to. The Crispy Rice Salad with Sour Pork was such a colorful combination of herbs, textures and flavors. Keep in mind that the crispy rice is just a texture-enhancing accent, while the pork and the herbs are really the stars of this dish. Can't wait to taste all the other dishes on the menu!", "author": "Maciej C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-19", "description": "Best spot at Dekalb, must try!! Personal favorites below!!\n-Papaya Salad\n-Laab Moo\n-Zaab Wings\n-Grilled Mushroom Salad\nGreat for lunch or dinner. Perk: you can adjust the spice level as you please!!", "author": "Jesse M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-17", "description": "I had the fried rice salad and it was ok. The pork tasted weird and overall the dish was too limey but the workers were nice.", "author": "Jeremy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-11", "description": "I really hope this vendor stays. I ordered the Grilled Mushroom Salad and it was packed full of yummy Thai flavors. The appearance of it doesn't look exciting, but boy, does this have a kick. It is spicy and the lemongrass flavor is there. It was mostly mushrooms, but I don't mind it at all because I actually don't like eating salad much. It comes with a side of rice. Also, their Thai iced tea was bomb dot com. Must get.", "author": "Ming L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-31", "description": "I've visited this new addition to the Dekalb market about three times. I was too shy to purchase any food my first two visits but got a Thai iced coffee and Thai iced tea. The iced coffee had a splash of heavy cream which I felt was perfect, if you need more milk, I would suggest telling them when you order it. The iced tea was a solid tea. My third visit, I got the laab moo and sticky rice. Be aware the the laab moo comes with jasmine rice and I was not able to substitute it for the sticky rice. The laab had just enough spice to it and I felt the portion was huge. I would definitely come back and try the rest of the menu!", "author": "Tassamai S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-31", "description": "Best food in Downtown Brooklyn! The grill chicken and the chicken wings are amazing! The spice, was legit amazing! Also, the papaya salad was so epic, legit thought I transported to Thailand", "author": "Matt G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-19", "description": "Chick is reliably good. I've gotten take out from them on several occasions. I highly recommend the chicken wings (so good!). One more thing is I'll recommend you eat the meal as soon as you receive it-- it's best when it's still hot and somewhat fresh.", "author": "Chiamaka I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-21", "description": "Chicks Isan is amazing! This is by far the best place to eat in Dekalb Market. The Zaab Wings were so tender and juicy. The Grilled Chicken and Crispy Rice Salad with Sour Pork both were so flavorful. Everything on the menu is outstanding! This place is definitely better than Som Tum Der.", "author": "Dinar P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-31", "description": "My third time coming here and I just needed to write a review: Incredible place! The food is hands down the best Thai food I've had in Brooklyn, maybe even in all of NYC. I'll be coming here at least once a week from now on! 5 stars from me.", "author": "Jeremy D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-19", "description": "Went there last night and had the papaya salad and the grilled pork shoulder. I have to say these tasted just like what I had in Thailand. The papaya salad was spicy, in a great way and the pork was deliciously juicy. Will have to go back again to try the rest.", "author": "Will M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-13", "description": "Its so good!!!! I love Zabb wings here. Its flavorful and crispy. I definitely recommend to try Zabb wing and others dishes.", "author": "Thanaporn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-19", "description": "Another hit from the team behind Fish Cheeks! The wings are amazing and Larb is not to be missed! Som Tum is great and the mushroom salad was a pleasant surprise!", "author": "BigPat P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-26", "description": "It was my first time at the Dekalb Market and I thought it was a little like the Chelsea Market but not overrun by tourists. My friend and I had heard great things about Chicks Isan so we were eager to try the food! We let the really nice lady at the register choose our food and had the papaya salad, long bean salad, spicy pork riblet soup, grilled chicken, and sticky rice on the side. Everything was delicious!!! The salads and the soup were spicy but in the way where you can't stop eating it! We couldn't  finish everything so we took it home and it tasted just as delicious the second time! I will definitely be back and would definitely recommend it!", "author": "Mercedes F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-26", "description": "Finally a Thai spot without the generic pad thai and such close to me. Tried the sour sausage and rice salad and was blown away with the flavors as well as the pork shoulders. The jaew sauce was really good. Staff was really friendly and told us to grab a seat nearby while waiting for the salad to be ready. She even brought it over to us when it was ready! Definitely a spot I'll frequent when I crave something spicy!", "author": "Jessica T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-05", "description": "Wow!!!! Amazing!!!! I had the minced pork for the second time!!! Chicks Isan never disappoints! Already a lover of Fish Cheeks in Noho, you will love Chicks Isan's quick and tasty Thai bites.", "author": "Marguerite J."}], "servesCuisine": "Thai", "priceRange": null, "name": "Chicks Isan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/V-Eh9kcMpRAdSWYDqCmQGA/ls.jpg", "@type": "Restaurant", "telephone": "+19293881131"}