{"aggregateRating": {"reviewCount": 42, "@type": "AggregateRating", "ratingValue": 4.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-12", "description": "Do yourself a favor and try their wings! Its one of the best EVER. Even my boyfriend who is not so adventurous loved it. \n\nThe pork/grilled chicken are delicious as well. Make sure you get the sticky rice. I would be cautious with the salads because they can be REALLY spicy haha true Thai style.", "author": "Gabriela D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-11", "description": "Chicks Isan might be a new go to for me at Dekalb Market Hall! With the full array of Thai flavors in it's arsenal, they pack a LOT of flavor into their food, yet the oil and calorie count is low. You walk away panting from the intense flavors, but your stomach doesn't feel bloated. Note, this is not Thai American food - no Pad Thai or spring rolls. This is the citrus, the spicy, herby, savory, smoky, and a touch of sweet. \n\nI ordered the following for pick up (20 minutes on a Thursday night):\nZaab wings - fried, dry, savory, sour, spicy. Recommend if you like chili and lime and crunchy! Tender wings.\nLaab Mu - Minced Pork tossed with Thai herbs with fresh veggies (cilantro, cucumber, cabbage, long bean). Legit spicy, perfect with the side of rice, savory and a fresh lime finish.\nGrilled pork shoulder - tender, savory, smoky, sweet finish with fresh cilantro, cucumber, cabbage, and long beans. Not spicy, comes with a sauce on the side. \n\nAll recommended, but note that they do not mess with the spiciness - it's numbing your face kind of spicy and not for the faint of heart. Stick with the grilled chicken or grilled pork if you're not into the heat. I want to try the corn salad next and the iced tea!", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-02", "description": "Glad to see this food hall refine with very authentic vendors. Chicks Isan being one of them. I've tried their wings + sour pork salad. Both are very delicious. The salad has crispy rice, fermented pork (more flavorful than it sounds, I promise!). Shallots, mint, and cilantro garnish the dish. You can create your own \"wrap\" with the cabbage, cucumber and beans provided.\n\nReminds me of my childhood where I tear up a bit from the spice. The wings were also very memorable. The dry rub is unique. I would have just preferred a crispier exterior but I'm sure if you request that they'd oblige.", "author": "Michelle V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-06", "description": "Decided to give this place a shot in the Dekalb Market !! I was iffy at first , as there's are other restaurants I love at Dekalb !! But this was definitely worth it !! I had a few things like Zaab Wings , Long Bean Salad with Pork Skin and Isan Style Chicken. So Zaab Wings were a bit too spicy for me and they were indicated as 1 on the spicy level out of 3. Next was the Isan Style Chicken , it was really good and I ordered  the half chicken portion good for 2 people . It was very soft and flavorful(really good ) We were so full and made the salad to go!! But over all it's was great . \n\nAmbience- 10/10 Dekalb Market \nService - 10/10\nPrice - 10-15$", "author": "Sajal B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-08", "description": "Authentic Thai flavors but be warned.. lots of things are spicy. \n\nI love their zaab wings. They're crunchy. Packed with flavor. Spicy, salty, sweet and tangy. There's a chili lime flavor as well. \n\nI've tried their long bean salad. Don't get this unless you can take very very spicy food!! Comes with rice\n\nThe soup with riblets was yummy and still spicy but manageable. Lots of meat and comes with rice.", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-09", "description": "I was quite overwhelmed during my virginal visit at Dekalb Market Hall that I must have spun around the floor at least three times before I settled on this stand for my lunch of choice. Sure, A Taste of Katz's would have been a slam dunk, but then I might as well apply all that luxuriant pastrami and corned beef directly onto my butt. Pierogis, arepas, and even key lime pie. No, I thought it would be a healthier choice if I went for the $14 Isan Style Grilled Chicken (Kai Yang).\n\nPerhaps it was healthier but it sure wasn't tastier as the poultry was severely overcooked - burnt skin on the dark pieces, a breast too dry to resuscitate with the marinade made up of shallots, garlic, turmeric, and coriander root (photo: http://bit.ly/2UVxzUC). Salvation came from the $10 Papaya Salad (Som Tom Thai) which came mixed with tomato, green beans, and peanuts (photo: http://bit.ly/2GD0NE4). The contrast of textures and flavors worked well when heat wasn't involved. Well, there are 39 other vendors to consider the next time.\n\nFOOD - 3 stars...disappointing chicken offset by a fine papaya salad\nAMBIANCE - 2.5 stars...seating gets packed quickly in this space\nSERVICE - 2.5 stars...kinda indifferent and forgetful\nTOTAL - 3 stars...Dekalb needs a good khao mun gai spot\n\nRELATED - Looking for dining options in Brooklyn? Here's a collection of places I've tried and reviewed: bit.ly/2MZRizT", "author": "Ed U."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-19", "description": "I went here on my first night at the DeKalb market. It was very considering how small the serving was. I really liked it. It was the best food that I had that night. The one disappointment was that there were no lettuce leaves to wrap up  the rice and pork. The serving was quite small, however, it was filling.\n\nThe lemon/mint/cucumber water was a nice touch. I really liked it.\n\nMy husband went later in the week for another chicken dish and loved it. I also like that they label their items as gluten free. That gave them the fifth star. Great food, great price.", "author": "Jacqueline F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-17", "description": "The Fish Cheeks team just opened a new concept at the back of Dekalb Market Hall, serving up a different selection of stuff from their original restaurant.\n\nThere is a limited menu so far, but the 4 choices that are available are all delicious. Definitely try the Laab Mu ($9) and the Papaya Salad ($10). I'll be back ASAP for the Crispy Rice Salad ($12) once its available.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-07", "description": "Located in Dekalb Market hall. The service was friendly at the ordering station. Food came out quickly after ordering. The menu is pretty limited and easy. Variety of Thai dishes. You have the chicken, half or whole that comes with rice and spicy dipping sauce. The papaya salad packed a \npunch in flavors and spice at medium level. The grilled pork shoulder and laab mu (pork) and seems pretty popular is the Zaab wings. We shared the half chicken, laab mu and papaya salad. \n\nI really liked the chicken. Is was juicy and flavorful. The accompanying dipping sauce added a nice spiciness to it. The papaya salad was full of flavor and plenty of umami with bits of tiny dried shrimp and fish sauce. The cabbage and cucumber added a nice level of crunch. The laab mu went great with rice. This one is a bit more watery (sauce) than others I've tried (which was dryer and slightly crispy - which I think I liked better).\n\nI will definitely be ordering more from them. I like that it seems like more healthy option if you keep from the fried wings. Spice level is moderate on the medium level. It isn't overly spicy but enough to know it is there. I tend to like it slightly hotter but you can adjust as you like when ordering.", "author": "David N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-16", "description": "Phenomenal papaya salad. Really good half chicken.  Don't touch the crispy rice with sour pork, it was pretty vile. Flavors are authentic. Though they should crush the peanuts in the papaya salad, rather than putting them in while. Loved the mint water. Overall really good. But they need to fix that crispy rice dish.", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-30", "description": "Those Zaab wings are no joke! The spice hits you after. I was crying into these wings as I devoured them. Soooo gooood. A little pricey but what do you expect from a hipster food hall?", "author": "Elsie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-04", "description": "I heard about the wings here. People said it was really good. So I got the zaab wings. It was definitely different. First of all, it wasn't super oily which I like. The spice level was one which is great because it actually made the wings enjoyable. When I bit into the wings, it was crispy outside and juicy inside. It has a light lime taste which kind of nuteralize the spicy flavor. I would definitely get it again.", "author": "Cristina L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-28", "description": "I am actually writing this review as I'm munching away on these Zaab wings. They are so delicious! At first glance, they did not look spicy at all. Upon ordering, the girl who was taking my order warned me that its really spicy. It's got a great taste of chili and lime, sweet, salty, spicy, crispy... perfect! $9 for 8 wings doesn't seem too bad.", "author": "Mimee S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-19", "description": "The back-of-house employees (cashiers \u0026 cooks) were all very nice, but the front-of-house (\"P.R. team\" \"running an event\") were all ridiculously disorganized \u0026 unprofessional (like bad interns)... Beyond that, the food we got--papaya salad (way too sweet, zero spice), pork larb (the cabbage \u0026 cucumber \u0026 green beans were the best part), mushroom salad (by far the best part of our meal), and chicken wings (too expensive for the portion)--was all very fresh \u0026 simple, perfectly fine for fast-food in a mall, but definitely not the best Isan Thai...", "author": "David L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-19", "description": "Five stars for the new Chicks Isan! Popped in for dinner on their third night, so a limited menu was being served. Opted for the larb moo ($9), papaya salad ($10), grilled mushroom salad ($12), zaab chicken wings ($9) and a Thai iced tea ($4). Let me just say I wasn't a fan of the chili lime zaab seasoning, but the wings themselves were cooked to perfection - crunchy on the outside and juicy on the inside. Loved the dried shrimps and peanuts in the papaya salad. The larb moo, minced pork with lots of chiles and herbs, set my mouth on fire but in a good way. Pro tip: order the sticky rice ($3) to cool things down. The grilled mushroom salad is a great substitute if you don't eat pork. Full of flavor and big beefy shrooms. I'll be back to try the pork cheeks and Isan style grilled chicken!", "author": "Julia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-11", "description": "Best taste ever! , Long bean salad is very popular in Thailand but In NYC it hard to find the taste exactly same as Thailand but I found it now!!! \nChicks Isan is exactly taste I had ever have.\nI'll come back pretty soon!", "author": "Minc I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-14", "description": "Rounding up since it's new and I want to give it another shot. I have a high standard for Thai food but love Fish Cheeks and live within walking distance to Dekalb market so I was really hoping I'd love Chicks Isan as well. I probably set myself up for failure when I was expecting something close to Fish Cheeks quality take out - maybe something similar to Som Tum Der which is one of my favorites. \n\n1. The grilled chicken was good (not great for $14) but saved by the jaew sauce which made the dish. 2. Laab Moo was disappointing. It was tasty but texture was a little mushy/sandy. Might have been a one-off issue since I saw some other pictures where the bits of pork were a little bigger/drier, but I'll likely opt for a different dish next time. \n3. Sticky rice was on the drier side but pretty good and the portion was generous.", "author": "Melissa M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-24", "description": "I'm giving it 3 stars because I think it's just overpriced. I'm Thai and I can cook all of these dishes. There aren't any fancy or exotic ingredients, perhaps ingredients you can practically get anywhere. Isan Food is considered most affordable  in Thailand. These prices just don't add up. I can buy a 10 pound bag of sticky rice for $5 and cook it myself. Trust me I'm not cheap, I just can't  justify these prices with this type of food. \n\nAbout the food: pretty tasty, authentic Thai/Issan flavors, chicken can be over cooked  at times, quality is fair \n\nOverall, good enough to satisfy my cravings when I'm not cooking it myself.", "author": "Pam W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-22", "description": "Another best (recent) Thai spot with North-Eastern specialty (aka Isan region). Located in Dekalb Market Food Hall which offers you variety food options but this place became our favorite. Besides the authentic flavors, everything we had were perfectly cooked. \n\n- Grilled chicken (half): Highly recommended! We love juicy chicken with the taste \u0026 aroma of herbs that they marinated. If you love spicy, eat the chicken with the house-made spicy dipping sauce. They also give a sweet chili sauce as an alternative. \n\n- Spicy wings : We couldn't decide which chicken we like the most (grilled or fried) so we had them both lol. It was also really good and different. The flavor was there. Unstoppable. \n\n- Pork larb : My best way to eat larb is having sticky rice or fresh vegetables with every bite. The intense flavor was even better blending with the sides. \n\n- Green beans salad : If you love greens and spicy, this one has everything you need. It was a good level of heat to balance out the fresh \u0026 crunchy beans.\n\n- Baby pork ribs spicy soup : Thai spicy soup is more than just Tom Yum! I personally love this soup (aka Tom Zabb). The ribs went  well with the soup. My favorite part was the onion. I wish they did another version replacing pork with mushrooms. \n\n- The staff was friendly and attentive. She asked questions and provided details about specific dishes as well as made recommendations. \n\nOverall experience was beyond satisfied. They should consider having seats at their counter bar. We can't wait until they do delivery so we can have Chicks Isan more often!", "author": "Kiss S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-28", "description": "The zabb wings themselves are really flavorful (gotta be the marinade or pre-seasoning before they're fried).  However, the harsh reality is that they're dragged down by the stuff they're dusted with before serving (like bbq- or lime-flavored potato chips - just awful).\n\nDon't let that harsh opinion dissuade you.  The rest of what we sampled is the real deal; regional Thai/Lao flavor, a rare treat.  Definitely worth a try.", "author": "Rack F."}], "servesCuisine": "Thai", "priceRange": null, "name": "Chicks Isan", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Square W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/V-Eh9kcMpRAdSWYDqCmQGA/ls.jpg", "@type": "Restaurant", "telephone": "+19293881131"}