{"aggregateRating": {"reviewCount": 24, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-11", "description": "I've spent so much money at this place. When I first found out about it, I was here literally everyday for like 2 straight weeks. It really doesn't help that this place is so close to home. Its usually busy but the line moves super fast. I don't recall ever having to wait longer than a minute. \n\nTheir pizza is delicious and like the name of the store says, ONLY 99 CENTS! It's dirt cheap but NOT at the expense of taste.  The pizza tastes delicious as is. I've never had to put additional toppings on it.  Their slices are pretty big and they use the correct ratios. I just HATE when my pizza is all sauce and no cheese. ugh! I'm usually not a crust eater, but I eat their crust. Its soft, doughy and is the perfect ending to the perfect slice of pizza.", "author": "Marla B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-12", "description": "Fast. Cheap. Huge variety of quick, 6 dollar  meals on the menu. Practically every thing you could think of. If its fried; breaded; smothered in marinara sauce; contains cheese, or can be placed on a bun, they sell it. \n\nThe only thing I was never happy with was the riff-raff clientele which always swarmed all over this pizzeria. Trashy.  But hey, with just a block from Fulton Street Mall, can I really complain?\n\nUnfortunately I have to report it has just today, closed. Man! The cash register in this place rang non-stop all day. Can the economy even kill a joint like this?", "author": "Jorge G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-15", "description": "Best. Most. Consistent. Ly. Good. Dolla. Slice. Down. Town. Brooklyn.\nYou pick the pizza up off the plate by the crust giving it a light fold for the initial bite-- caressing at the crust and taking a nip out of the pointed end-- and it doesn't droop. Solidly baked pizza, not to excess. EVERY TIME. Sometimes they play good music too. Sometimes you get to share a table with another person and you both have to look at your phones just to make sure you do not make eye contact with one another. And, having a pizza that is architecturally sound really helps because you don't have to use your other hand to assist in folding or making sure cheese doesn't fall off. You can keep on going not looking at people.\nReal nice dolla sauce too. standard 2.75 for 2 slice and soda. soda comes in purple also. I have gone here twice a week for a year straight and it has never failed me. If you go late on a Wednesday (pretty sure) is when there's a guy who puts a lot of cheese on, if you're in to that.", "author": "Carl W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-17", "description": "You cannot complain about a slice of pizza for one dollar. Their slices are thinner compared to other places but what do you expect for a dollar. Friendly quick service.", "author": "Gabriel M."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "99 Cent Fresh Hot Pizza", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "51 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/S7KxBcnznjzYlX_wZlVaXw/ls.jpg", "@type": "Restaurant", "telephone": "+17187973841"}