{"aggregateRating": {"reviewCount": 24, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-11", "description": "This is based on my experience in September, 2018. The pizza crust here, which I think of as the defining characteristic of new york pizza, was flavorful and good. The seating was limited, but overall I would say this was a good example of ny pizza in my current understanding, after spending a couple of months in nyc last year and getting pizza at different places once a week.", "author": "Todd D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-23", "description": "If you think about the fact that a plain slice in only 99 cents, it is excellent. There are many better slices for about 2 dollars, but for 99 cents, this may be the best.", "author": "José Ignacio O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-27", "description": "When I heard there was 99 cent pizza in New York, I had to get one to try for myself. Coming from Cali ... I had pretty low expectations, but this pizza kind of blew me out of the water.\n\nThe crust was thin, cheese was not \"plastic\" tasting and it was all GREAT. When I was in New York, I tried 3 types of pizza price points.\n\n$5, $3, 99cents. And I got to say... the 99 cent one at this place, was the best O_O. I have no idea why...\n\nThe service was quick and very efficient and we got a cheap snack for a cheap price! Way to go NY.", "author": "Martin N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-19", "description": "This is your basic no thrill pizza that will get your tummy full.  You get what you pay for.   The .99 cent pizza doesn't have much sauce or cheese and not much tatse.  It's hot and fresh.  I really can't complain.\n\nIf I only had a few bucks, I'm getting myself a .99 cent pizza.  There are a few tables inside.  Service is quick and efficient.  I would at least try it once.", "author": "Eric W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "So, for 99 cents, you can't realy ask for much, but theu actually deliver. There's plenty of cheese on each slice, the line moves quickly and it's relatively clean for a cheap slice joint. $2.75 gets you two slices and a soda. Easy snack or a quick lunch in the area.", "author": "Jeremy Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-30", "description": "Worst pizza ever! The cheese tasted like pure vinegar! As soon as I walked in there was a lady passed out at the bench with a whole slice in front of her. It was at least 100 degrees in there and that explains a lot of things. The sour pizza and the lady who fainted while eating.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-15", "description": "They get the job done, decent dollar pizza, good service, ample table space and standing space, and good freshness. I haven't had the opportunity to try the more \"gourmet\" options, but so far I'm really liking this place, and it is a very convenient lazy option when I need some cheap, fulfilling lunch. Despite the famed term \"dollar pizza\" permeating what people think of New York City, there isn't really that many dollar pizza spots left.\n\nI really don't know how to stretch this review any longer, just remember you can't really get any better than this for a dollar in the neighborhood. Make sure you try it!", "author": "Wayne C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-10-29", "description": "I had $1 pizzas all over NYC and my favorite have to be Percy's on Bleeker. Twos bros isn't bad either. \n\nThe slices here are ok but I prefer two bros. It does the job. The slices here is very greasy. It's so greasy that the oil drips down your arm. It taste ok. The pepperoni pizza here looks bad and they put a lot of cheap cheese in it. The guys here provide fast service. It is what it is. Cheap greasy pizza.", "author": "Orange P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-03", "description": "This place is where any \"Food Mercenary\" new to the cheap food scene should cut their teeth. I stop in here for lunch quite frequently, I'd say once a week. The classic order is the two cheese slice and a can of soda. It is $2.75 which is a cheap little lunch.\n\nYou hit those bad boy slices with some garlic, some oregano, some hot pepper flakes, and some salt. Now you got a gourmet lunch.\n\nThe pizza is better than most. It is no brick oven $25 dollar mini pie from the hipster restaurant down the street. However, if you think in volume like I do, you can have a little more than three extra large pies for the $25 dollars you'd spend on your \"farm to table vegan paleo chakra aligning\" pie.\n\nCheck it out. The ambiance is neighborhood pizza, tables and standing room. Gets crowded at lunch. Sometimes people ask you for a dollar there, buy them a slice instead. Pass on the good vibes.", "author": "Joseph N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-23", "description": "Not to bad for a dollar pizza. Fresh dough, lot of cheese. For 4 $ you have cheap and fast lunch. I would recommend it.", "author": "Michał G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "As far a .99 cent pizza joints go this place is a notch above the competitors.  for my .99 cents this place is definitely better then comparable pizza like 2 bros.  I always judge a pizza place by the plain regular cheese slice and this place does it right with a well balanced not over or under cheesy slice.   The dough is also more flavorful then most cheap pizza places can provide. \n\nThe other non plain slices are also worth trying.  I got the mushroom and buffalo as well which were better then expected.  The employees were nice.  The one thing that keep this from a 5 star is this place is pretty grimy.  I understand a certain levels of brooklyn grimmyness to give you that true brooklyn pizza joint panash but this place could use so updating.  \nNone the less 4 stars for you my cheap pizza friends.", "author": "Ryan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "What's not to love about a slice of pizza in New York City for the low price of $1? Service is quick and efficient, especially given the college student clientele in close proximity. Great topping options, ample seating. Thumbs up!", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-26", "description": "99 Cents... 1$..people do realize there's a difference right ? Ay, it's a sales technique. Guess which one people will opt for ?\nSorry, just wanted to say that.\n\nDecent pizza place. They carry pizza flavors that you would find at other pizza places. Regular slices, vegetable slices, beef patties, etc.\nI used to come here quite often after school or just when im walking around and so on for a beef patty or slice of pizza. The pizza is pretty good and the beef patties as well, but I personally prefer pizzas with more  sauce and cheese.\nWhy don't I opt for here anymore ? The food had managed to give me abdominal aches quite a few times. I do have food intolerance but not to pizza or beef, and my sis has gotten abdominal aches as well, so it comes down to freshness or cleanliness.\nWhy the 3 stars.. Idk actually. Feels more like a 2.5\n\nThe staff are quick but don't really acknowledge you / talk to you. Ok service. (Always expected at grab and go places like this)\n\nBtw, not much seating and will be crowded during after school hours.\n\nOverall, If I'm really hungry and craving pizza as I want something quick, I would come here. Other than that, there's alot of other food shops around to eat at.", "author": "Jenn Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-09", "description": "this place....decent pizza for a cheap price, cant really complain. It a convenience for lunch or for a quick stop if you dont have a lot of time....only thing is i wish the store was made with seats...too many people at times just stand there eating their slices and the store isn't big enough for that", "author": "Zen K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-30", "description": "I ordered two slices from a piping hot pie fresh out of the oven. Cheese and sauce were good and crust flakey. Toppings were available for an additional cost. You share seats with fellow customers, but the cleanliness inside the restaurant needs work. However for $1 a slice, you really can't go wrong.", "author": "Julia W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-07", "description": "Crispy on the outside, soft bread on there inside, cheesy, tasty, $1, how can you complain???", "author": "Joe T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-21", "description": "5 stars for a 1.00 pizza. It is better than you expect. It's not grimaldis , but for 2.75 you get 2 slices and a drink. Unheard of in NYC.", "author": "Juan J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-28", "description": "Crap pizza but what do you expect for a dollar. I doubt that its even real cheese. Stay away and put out another dollar and get a real slice of NEW YORK PIZZA.", "author": "Tracy P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-16", "description": "99 cents for a cheese slice...  How could you not be a fan?!!  Really, what's there to complain about?  As long as you don't come here expecting the best slice of your life, you'll leave satisfied, even congratulating yourself for finding some really cheap eats. Also, contrary to another review I read, they do use real cheese here.", "author": "Jaszon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-14", "description": "I know, right you are thinking 99 cents pizza, but this one is one of the better ones.  I am not kidding, there are some that really taste like sandpaper. For a buck, this actually has a lot of cheese and a good enough taste to it, I am going to say. I try to always get a slice when I am in the area, before work usually.  I agree, don't expect the best slice in the world but it is technically better than most other 99 cents pizza joints. Check it out for yourself, next time in Brooklyn. It is right near the Jay Street subway station for the A,C, R,  and F line.", "author": "Jordan W."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "99 Cent Fresh Hot Pizza", "address": {"addressLocality": "New York", "addressRegion": "NY", "streetAddress": "51 Willoughby St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/S7KxBcnznjzYlX_wZlVaXw/ls.jpg", "@type": "Restaurant", "telephone": "+17187973841"}