{"aggregateRating": {"reviewCount": 31, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2014-12-10", "description": "I love a good Diner and I have to say I was a bit disappointed with this place. They have a extensive menu, but I settled for a soup and a sandwich, White bean and chicken salad. Not good. The soup was canned and the sandwich uninspired. Disappointed, but maybe I will go back and try a burger, because my lunch companion had and she didn't complaint!", "author": "Oswaldo C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-25", "description": "This little diner is somewhat hard to judge for me. The food looks good, and the price is great. They have a huge menu for both breakfast and lunch, and with both American and Mexican food.\n\nNow, with that said, I have a rule of thumb: when I go to a restaurant for the first time, I like to order the first specialty item on the menu, which, in this case, happens to be the chicken enchiladas with mole sauce.\n\nWhat I got was a set of three tortillas rolled up with mole inside, and then sprinkled with chicken and lettuce on top. It actually wasn't too bad, but just not at all what I was expecting.\n\nI suppose if I were at a fancy restaurant, and they served the exact same thing, then I would have told myself that I just received some \"deconstructed enchiladas\" and convinced myself that I just received something fancy to eat, but alas, at a little diner, no such mind tricks are available.\n\nIn all, this isn't a place that I would walk more than 3-4 blocks to find, but it does serve some decent eggs and other diner foods at a great price.", "author": "David Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-27", "description": "We place orders as a group at work.  Today we ordered from Livingston diner.  I ordered chorizo tacos.  They sent breakfast sausage, cut up in a taco shell w/ shredded lettuce.  When I called to complain \"manager\" Omar said \"that's how they make it here\".  I explained you can't make breakfast sausage chorizo.   There was no remedy given.  However, my remedy will be we will never order from there again. Horrible.", "author": "Jocelynne R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-01", "description": "I've worked a block away from this location for nearly five years, so i knew Livingston diner before it was a diner, just a mom \u0026 pop Spanish/American restaurant. With ALL of that said, I've had some ups and downs with Livingston. \nI normally order yet my partner does enjoy sitting down in a spot, so I've experienced seated dining as well. \nThe food is typically decent IF your order is taken correctly, which normally it isn't over the phone. Several times after calling back due to a incorrect order, after tipping a delivery guy to walk a half of a block and waiting 30+ minutes for that walk, i get attitude..... Now... i do believe this is a typical foodies pet peeve.... DON'T F UP MY FOOD!!! And.... if you do, please take responsibility for your job!! This never happens at Livingston diner!\nI have stopped ordering there once before due to this issue. But because I'm a nice gal, I gave them a second chance... that was my last order to them! Last this I want is an attitude due to someone Else's shortcomings! Thanks but no thanks Livingston diner!\np.s on a lighter note: the burgers are good (as per my girlfriend)... the home fries are bland", "author": "Innocence D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-04", "description": "Over an hour wait for a completely incorrect order. Dismissive when I called to see what happened and if they can swap out the order, another almost hour long wait for bagels and coffees.", "author": "Caitlin S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-18", "description": "They had messed up my order a number of times. The young guy who works the front counter seems very unappreciative. Never says thank you and has this demeanor like he's disgusted. Only reason I come here is b/c I never carry cash and they don't have a card minimum. Otherwise I would go else where.", "author": "Danny S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-25", "description": "I can't think of anything worse then being hungover and ordering from this establishment. After a fun night out I want my food delivered to my apt within AN HOUR! I also would love the delivery guy to pull it together and walk up the stairs, because if I wanted to put on pants I would've gone out. The saddest thing after I put on pants was that my order was wrong. Instead of hash browns I got frozen fries!", "author": "kelly f."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-14", "description": "I also had a really excellent burger. It was soooo fresh. And the bacon was really good  too. The food was hot... And the waitress was friendly. Would highly recommend this place.", "author": "Joshua O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-17", "description": "Chili con carne taco salad. Lunch win.", "author": "Jim S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-04-07", "description": "I hate writing bad reviews but today I was at my last point. It's been going on for some time. Whenever I come downtown brooklyn, I usually come here to get a plain bagel or an egg on a roll. It's a nice spot to sit and eat breakfast but the customer service is way off. Like I had mentioned I forgot his name, there is a short guy who works there and there is another guy who is average height who works there as well. The one who is short always seems like he is having a bad day. Maybe once I felt he was polite. I ordered an egg on a roll and I stood in front of him. This is not the first time when I order something he ignores me after that.  He never looked at me after that. He went around picked up the phone and addressed the other customers that had already. His brother or cousin came from the kitchen or cooking area to address me. I would have given it one star but there is an old lady in there she is very sweet and there is a young girl I think she is there during the weekend she is very polite. She always says hello and have a smile on her face. Customer service is very important to me, if you hate your job or its stressful leave. I am going to share this review on social media and take my money somewhere else! Thanks for reading!", "author": "Savana H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-28", "description": "I really enjoy coming to this place. The food is good, the people are friendly and the prices are great. I go there almost every week. It's a good chill out spot.", "author": "Albert C."}], "servesCuisine": "Diners", "priceRange": "Under $10", "name": "Livingston Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "372 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/HfrXpoOrYzYvLymmxeLayw/ls.jpg", "@type": "Restaurant", "telephone": "+17185226941"}