{"aggregateRating": {"reviewCount": 31, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-02-15", "description": "For a quick breakfast, lunch maybe dinner  afforable this is my to go spot enough portion for one person and filling. Small spot but very nice ppl. Wish they were open later somethimes.", "author": "Jasmine B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-02", "description": "I ate at this place for lunch and loved it!! It is an unassuming well priced place to eat. I had the grilled shrimp salad, it was really amazing.", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-19", "description": "I had a job interview not too far from the location. I asked one of the workers for a good place to buy breakfast and they recommended this diner. When I got there the menu was easy to read. I ordered the breakfast bundle (egg whites, home fries, wheat toast and an extra side of bacon). You had the choice of tea, coffee, and orange juice. I chose the orange juice. They asked if I was staying or going. I was in no rush so I decided to stay. He told me to sit anywhere I wanted. I found a comfortable looking booth. They brought out the orange juice (picture attached)...I was just confused as to why I got a children sized cup of juice but a tall glass of water. The food came shortly which I would say was delicious. When I was finished, I went to the counter and paid. \n\nHonestly, if I'm within the area and just need breakfast then I'll go there. But I wouldn't really go out of my way to go there. The workers were polite but I just didn't get that welcoming feeling to keep returning.", "author": "Kiara W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-15", "description": "This place is the epitome of not judging a book by its cover. \n\nIt's a small mom and pop shop/diner whatever you want to call it. To each is own.\n\nFood is exceptionally good. A+\nOrder ahead of time. They do take a while depending on what you order. Especially their fried stuff. \n\nIf you want to dine in , NP. I just prefer take out and eat at the comfort at my office desk \n\nIts ur typical hardhat clientele - for the most part. \n\nHowever they always acquiesce/ accommodate to my weird order requests. \n\nAnd their prices are VERY affordable for the quality you get. \n\nSOMETIMES - their toast is way too hard . And it's hard like stale hard or it's been re-toasted.  Hmmm.  Yummy food for the pigeons. \n\nOH and their hours of operation is wrong.  They close at 6pm. Sometimes at 5pm. So always call ahead of time to find out.", "author": "Katrina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-19", "description": "Quick and easy drop-in, with little wait time and decently fast service. Plenty of seating, too. I ordered a pizza bagel and it was yummy, and not super fancy (exactly what I expected). The pricing was good, and the fries were thick. My only complaint would be the cash-only policy, as that is a little inconvenient.", "author": "Kate J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-26", "description": "I get a food delivery from this place at least 2x a week same address same order same time of day and I consistently have issues. The delivery driver can not find the same location, and it happens every single time. I am so confused to why this is. The driver calls you tell him where the place is still no order... it's a shame the food is good!", "author": "Mike P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-14", "description": "This place is definitely not what I expected. I walked in thinking it would be trash but I was wrong. The food was outstanding and the customer service was great! It is definitely a place I would go to again! I highly suggest this place to eat!", "author": "Rylee M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-28", "description": "This update is only for the soup. I was craving soup and Livingston pops up. It's close and quick so I say why not. Online order showed two soup options but I was given two of the same soups. Although I craved the split pea and lentil I read online, the white bean soup I received instead did not disappoint. -1 star for the false advertising (update your online order options please). Now that I know they only have white bean soup I won't get my hope high for something I want.", "author": "Clari B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-30", "description": "This is one awesome place found it after walking the Brooklyn Bridge I had a Philly Cheese Steak and my Wife had 2 medium eggs, bacon and home fries. All very delicious and would fully recommend this place. Staff are very welcoming.", "author": "Richard S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-02", "description": "Usually order here when I want something quick, this will be the last time I order from here.\nWhile eating I found a old metal twist tie wrapped in my food. For those of you who are not aware of what this is, it is the small thin wire used to wrap around bread or bakery when not in use.\n\nThis is gross, just the thought of where this twist tie was located prior to landing in my food. :( Very disappointed and disgusted.", "author": "Jamila P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-27", "description": "Clean, fast and delicious food. Warm atmosphere from the hostess. Family friendly place. Not expensive at all. Recommend it highly.", "author": "Carla V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "I have eaten here several times a week for the past 3 years. Morning time is their busiest and if you don't order ahead prepare to wait awhile for your food order. I personally use grubhub and the pickup option and am in and out in less than a minute. Their breakfast special is hard to beat. Home fries eggs and your choice of meat with toast, coffee and juice included for $5.75. The special ends at noon. Their burgers and sandwiches are also delicious.", "author": "Fausto G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-08-08", "description": "I've stopped in a couple of time for breakfast and it's decent.  They make a good bacon, egg and cheese.  The iced coffee was better than I expected.  The muffins on the counter were not very good.  They were dry and crumbly even though they looked big and delicious.\n\nI've also had a cheeseburgers there.  Slightly over cooked but still better than  a McDonalds or Burger King.  It's a very standard greasy spoon dinette. They have all the normal diner offering but also a good smattering of Mexican food.\n\nIf pressed I might come back to try the burritos but other than that I'll stick to the things I know they do well.", "author": "Drex H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-15", "description": "You would think turkey bacon, egg and cheese on white toast was rocket sciencethe way 4 people who came after me got their sandwiches. I tell the genius behind the counter I have to get to work and I guess in an effort to provide the worst customer service ever instead of lighting a fire under their ass at the grill tells them to cancel my order. Really? Shameful cuz the burgers are great.", "author": "Brielle W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-21", "description": "No, no, no! Seriously, what were they thinking sending me that crap? Okay, we ordered on grub hub and got mozzarella sticks, chicken quesadillas, and a chicken gyro. Ten minutes later I get a call saying that they ran out of chicken for the gyro and only have lamb. I don't want lamb, I ordered chicken. So i ask for other suggestions, and he says he can make me a grilled chicken sandwhich. My face is like o_O because he just said that he ran out of chicken, and there was no issue with the quesadilla, but fine.... maybe they use different parts of the chicken, white vs. dark or something. Whatever, i'm hungry... just bring me some food. \n\nThe delivery time wasn't bad, but omggg the food. The mozzarella sticks were okay.. but just that.. OKAY. The sauce that came with it was more like tomato soup.. but much more  watery. Sauce is NOT supposed to be that consistency. The top to the container was broken and therefore dripping into the bag. Thanks a lot. \n\nNow on to the quesadillas... seriously??? The WORST excuse for a quesadilla EVER. It was soggy, and there was no chicken in it. I mean, there was... if you think one little chicken cube per quesadilla is enough to be considered a CHICKEN quesadilla. I mean it was really ridiculous. \n\nThe sandwhich was BLAH. Chicken was dry. Very UNDERwhelming. I was extremely disappointed and will never order from here again.", "author": "Marla B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-07-03", "description": "Livingston diner is a waste of time and money. This place serves dry burgers when you order it to be medium rare. Their fries are soggy and disgusting, and do not even dare try their chicken tenders. What I got for the \"chicken tenders\" was the most appalling thing I've ever had the displeasure of tasting. The strips stretched out about 3 inches because the chicken was so fake and disgusting.", "author": "Joon Hee C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-04", "description": "The food here is amazing!! \n\nIt's such a friendly environment and and the prices aren't bad. \nMy faves are the burritos and a chicken salad!\nBut I also love the hamburgers!\nWell I really love everything we should also try out the breakfast too!! \n\nYum yum nom nom nom :)!", "author": "Annie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-23", "description": "I work around the area and my favorite is the grilled chicken burrito .. It tastes real good . If you around downtown Brooklyn this is the spot for a good breakfast too.", "author": "Diego T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-29", "description": "Since I Work in the area, there isnt  much of a breakfast option around here. Basically a hit or miss there where a simple breakfast sandwich 2 eggs ham and cheese turns into 1 egg on a roll. Happened 1 too many times. You have to physically watch and guide them making sure your order is right.", "author": "Marcos M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-30", "description": "Came here on Sunday for a low key classic diner brunch. Everything hit the spot. Service was amicable, tentative and quick. Price is extremely reasonable for the breakfast special. Environment is well kept and clean. If you're looking for a no fuss traditional diner, this is the place to visit in downtown Brooklyn! We are so happy to have found this neighborhood jem!", "author": "Vicky J."}], "servesCuisine": "Diners", "priceRange": "Under $10", "name": "Livingston Diner", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "372 Livingston St", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/HfrXpoOrYzYvLymmxeLayw/ls.jpg", "@type": "Restaurant", "telephone": "+17185226941"}