{"aggregateRating": {"reviewCount": 111, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-05", "description": "Needed a quick breakfast fix; awful, just awful. Food was not hot, service was slow and unfriendly :(", "author": "Erica K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-25", "description": "RUDE\nSat and waited 10 minutes. Walked up to host stand to ask for server. She was standing there chatting with the host. She said, \"I'll be there\". That's it. She came and took my order like a robot. No smile. No friendliness. No thank you. Brought and poured my first cup of coffee but why does the pot say 'decafe'? \nFood \u0026 value are always great at IHOP, but in a nearly empty restaurant why the bad attitude?", "author": "Edward K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-02-03", "description": "Very slow, poor service. You wait 25 minutes for only an unsweetened ice coffee. People here are lazy and inefficiency.", "author": "Victor L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-18", "description": "Came here for IHOP 59th Anniversary to get the $.59 pancakes. Service was good but that was also because I came here as soon as they open. There wasn't much people here. However I could imagine on a regular day it would be very busy and service would be a little slow. This is not my first time at IHOP, but first time at this new Brooklyn location. They use to be two block up before. Although, I am giving them 4 stars, it's mainly for the pancakes and today's service. Always LOVED their pancakes and always will.. However, IHOP overall needs to improve on their services, which has always been slow..", "author": "CJ D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-31", "description": "This location was the worst Ihop that I've ever been too.... The employee in the front (I'm assuming the floor manager/supervisor) was rude,nasty, and a hard face to look at, her coworker with the red wig was just as unprofessional.... If you dont like your job then quit... your job is to deal with the public..... All over a booth.... really.... cash me outside how bout dat..... Never again...", "author": "Jennifer M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-05-06", "description": "I was really exited to go to IHOP until this IHOP visit. First we entered to a friendly but complaining staff about the lack of booths available. We were seated at a regular table which was fine. Then we waited and waited before our waitress came to take our orders. The wait time for our orders was almost 30min. My mom ordered a burger that she was unable to eat because it had a terrible smell like the meat was going bad. We were horrified they served spoiled food. She spat it out right away and we told our waitress who offered a different meal and an apology. My meal turned out ok but we were already completely turned off by the whole thing. The emptiness of the establishment should of given us more pause. We weren't impressed by the service or the food. We won't be going back. I would strongly recommend not going to this IHOP until they get it together.", "author": "Trecia N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-17", "description": "A good stop n quick breakfast this week unlimited pancakes. Love you combo meal and cleaning then most Ihop in nyc", "author": "Troy M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-11-18", "description": "The food tastes good, if you ever get it. I went here late night and had to wait 5 minutes to get seated cause the hostess was on the phone giving directions to Uber Eats drivers. After being seated, it took nearly 20-30 minutes for the hostess to acknowledge us and after taking our drink order, she took an additional 5 minutes, and got it wrong. There were barely any other people in the restaurant and the other booth actually stood up to find the waitress and place their order. One of the employees was really sweet but seemed like she was carrying the weight of sole customer service provider. She adopted our table as her own. Aside from the lack of late night service, the tables were not clean. There was a bunched up hair knot under the table and sticky syrup on the tables. I know late night crews can be tired, but automatically incorporating a 15% tip into the bill seriously seems to strip associates/wait staff from meeting the most basic of needs.", "author": "Serena G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-08", "description": "I received dirty utensils, half ass waiter...complained to manager and he never returned. I honestly believe my pancakes tasted \"funny\". It was weird taste kinda like dirty dishes if that makes sense. If you've ever eaten at IHOP you know their pancakes have a distinct taste...these pancakes did not taste like the pancakes I've been eating for years!", "author": "Tee P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-08", "description": "Standard IHOP.\n\nFun fact: There was an IHOP directly across the street that was absolutely horrid in terms of the staff and service. They replaced the manager and it was drastically improved. Then they were immediately replaced by another business who bought the space.\n\nThis IHOP has none of that old staff, and falls squarely in the 'average' field in every category: Service, Food, Decor. There's nothing noteworthy, but there isn't anything wrong either.", "author": "Richard C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-09", "description": "2nd time coming by this location says it closes at 10 I'll get there around 9:15 \u0026 it's closed. No sign on the door or anything. Just wanted some takeout.", "author": "Natasha J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-14", "description": "The customer service women was very rude loud and need better trading to deal with customers. The wait was very long even tho there was multiple  empty tables.", "author": "Shon F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-10", "description": "The service wasn't bad, it was good. However when asking for what we wanted, I asked for orange juice and was brought apple juice, my boyfriend asked for his stake rare and it was brought to him very well done.  I feel it's important that you listen to customer how we want to eat certain things because everyone is different and I don't want to ask for a request to have it ignored.", "author": "Raven M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-06", "description": "I came at about 8:00 or so and it was really slow, there weren't many customers. I was escorted to my seat by the hostess where she put me at a small table. I requested to get a booth to have space to work on some stuff before work. Now, I understand, it's just one person, so getting a booth is usually for at least 2 people but there was maybe 10 customers at the location. I figured it wouldn't be a big deal. \nNope. It was a big deal. \nThe hostess asked me if it was just me dining today. \nShe told me I couldn't sit at the booth in case it got busy. \nHow long was I really going to be there? I just come to eat then leave \nIf the hostess acted this way, there was no way I was going to move forward with my meal. I ended up leaving and going to the diner up the block. \nStaff was not friendly or inviting. Other customers were seated at a booth alone. But it was a big deal when I requested.", "author": "Lauribel P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-11", "description": "I was VERY wary of this place when I read the terrible yelp reviews. Unfortubately, I was already sitting in the restaurant. Yikes!! Fortunately for me my experience could not have been more different than the reviews I read. My sister and I were greeted politely at the door and immediately taken to a table. This was about 9:30 in the morning on Veteran's Day. They weren't packed l, but they were doing good business. Our waitress, Shanequa, was prompt, charming and very efficient. No long wait for our meals, sirloin tips for my sis, and the pumpkin spice waffle for me. The food was\n\n hot, delicious and fresh when it arrived at our table. All in all, great experience. No rude serving staff. No-one hanging around gabbing on their phones or to each other instead of working. I would definitely return if I'm in the area and feel like some waffles.", "author": "Tarita H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-02", "description": "Went to this location on the 18th of last month one of the manager made the experience horrible that i left. On that Monday I called a spoke to another manager who was very sweet and helpful she got me in contact with their DM he also was very helpful and respectful. He offered my daughter and myself a meal on him. I went back today and the manager on duty and stuff were so great. I will say the stuff is always friendly and so sweet. But today was such a different and great experience compared to my last I went in spoke to the manager on duty explained what happened and that the DM offered a meal on him. She was sweet and right away was aware of what I was speaking about and told us to enjoy and have anything off the menu. The server is was wonder I fed made sure to leave her a tip. Even with dealing with multiple tables she made sure to make us feel like she aware and we were important. I want to thank the two managers,the DM and staff for making up for a bad experience due to one person and making me not regret going back into their location I will definitely come back. I definitely appreciate the customer service that you all provide. Keep up the great work and the greedy food it was delicious", "author": "Clarissa F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-04", "description": "Went here with my daughter. Slimy eggs and old chicken. This place needs a food inspector on-site. Won't be coming back here. Go to the diner at the corner across the street from BBQs. Only good thing was the waitresses attentiveness.", "author": "Matthew S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-15", "description": "The food? 5 stars. You can't go wrong with all you can eat pancakes. The service? Ehh, could be better. When you first walk in no one really rushes to seat you, you have to stand around awkwardly before someone feels obligated to come over. The restaurant overall looks pretty sad. Don't recommend coming here to celebrate but for a quick bite it'll do.", "author": "Lira K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-28", "description": "Went in to get a takeout order, it took about 20 minutes which isn't bad at all BUT our food was cold I walked five minutes to work while my mother walked across the street I opened it as SOON as I got there, we purchased the chicken fajita omelette which I have had before and 3 pancakes both were just ehh, maybe because it was cold. I also asked to have the pancake mix removed from the eggs the hostess told me that it's pre-mixed which I haven't heard of since I requested that at a Manhattan ihop and had no issue they even gave me egg whites. The service was basic. Needless to say I won't be back anytime soon.", "author": "Andria A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-07", "description": "They told me they didn't have burgers, chicken tenders, or the specialty cinnamon buns. Service was horrible and then they tried to charge me for items the waitress never brought. I couldn't believe that a billion dollar restaurant didn't have burgers or chicken tenders.", "author": "Vijhae M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "IHOP", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "253 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/HrlZnV0lZvld6LETx6T6qg/ls.jpg", "@type": "Restaurant", "telephone": "+17182224467"}