{"aggregateRating": {"reviewCount": 111, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-03", "description": "Why is it that the whole ENTIRE RESTAURANT is empty but I have to wait 20 minutes to be seated then another 15 minutes if I want a booth? Why?\n\nI didn't sit down and actually eat this time I just walked out after the girl was about to seat us at a table and I said can we have a booth. She said it would be a longer wait because it's only THREE SERVERS....Three servers in an iHop in the middle of downtown Brooklyn come TF on! It's TUESDAY early in the afternoon there's no reason anyone should be waiting in that ihop!", "author": "Kareh L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-14", "description": "I ordered the easiest thing on the menu because I was in a rush to get to work. Literally scrambled eggs and bacon. 25 minutes later it still wasn't ready. When I got the bill - $4.29 for a soda.  Are you kidding me...$5 for a drink?  Avoiding IHOP for eternity now.  Today confirmed what I think I already knew - IHOP is an underwhelming shithole.", "author": "Brooke S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-12", "description": "Our Seating Was Ok but I'll Ignore That Because the Staff Was Awesome..\nOur Server was Very Nice..\nShe Kept Checking on Us..\nFood Was Good..\nI Got Caught Off Guard with A Birthday Song from the Servers LMFAO!\nMy First Time to This Location and I'll Say It Was A Good Experience :-)", "author": "FoodieJunkeyz F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-12", "description": "Short Stacks of pancakes were hot but not the service. The Denver Omelette Burger with free fries refills was ok.\nWe placed the order of fries. \n\nWhen we asked about our free refill order of fries,\n our waitress informed us, 1/2 hour after we placed a refill order of \"endless fries\" that this promotion should have not been offered today.\nREALLY?!!\nOther patrons were still getting the promotion menu, after 5pm. \n\nWe were able to get one refill of fries while we dined.\n\nSHAME, SHAME on this business practice.\n\nSo,\n\nCome if you have lots of down time.\nIf you want to wait in the Waiting Area for over 15-minutes to be seated.\nThen another 12-mins for your order to arrive.\n\nI feel bad for the Hostess who's pregnant.\n\n2 stars rating for the Fries because they were served hot.", "author": "Patty N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-03-04", "description": "The reason I give it two stars is at less the food was good but the service was terrible. The manager was there and did nothing to help. He gave no f**ks if the service was good or not. I ask for lemons never got it ask for appetizer sampler didn't even bring it then try to charge me for it SMFH. Then I had to wait for the check even when I ask for it 15 min.", "author": "Gamal R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-03", "description": "After Entering this ihop and wait over 10, 15 miuntes. We finally our waitress who goes by the name of Maria came to wait on out table and came off very rude.", "author": "Niasia M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-31", "description": "Bad Service the hostess take pleasure to make customer wait while there are empty tables . She walking around going to chitchat to people while not doing her Job. She's too comfortable . I was with my friend left due to that", "author": "R R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-26", "description": "i fell in love with their stuffed french toast combo (i've tied other menu items but finally the stuffed french toast combo was it for me)..shocked and disappointed when i learned they discontinued it....they now offer seasonal specials....currently they offer this kings Hawaiian frenchtoast...i've tried it twice....crap...did not care for the taste or the bread.......all my orders are for p/u vs. dine in......the staff are never the most professional and food is so so. The only thing on the menu i enjoyed was the stuffed french toast.....on the menu for yearssssssss n the fools took off dumb dumb dumb....this summer they had this big promo attempting to be known for hamburgers attempting to compete with denny's..", "author": "Chase J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-01", "description": "This location is lovely! The good is simple but it's good.If you want a simple breakfast it's worth coming to and free refills on ice coffee!!", "author": "Tiffany H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-17", "description": "I have visited many Ihop restaurants before, and this location wins the nominee for the worst service EVER! Just about everything about this location hit the spots of being the worst place to come to. From the first step in the door, to the last step out i was not satisfied nor was my group of 9. Upon entering the receptionist was disgustingly rude and disrespectful. Every time she calls a name for people to be seated and they do not respond instantly she automatically goes n sits the next group down. The receptionist refused to let my group of 9 to be seated because the 9th person was still 1 minute away. Upon seating we were handed the menu. Our waitress did not come back till at least 20 minutes later. We were ready to give in our order but she refused to take it now as she was ready to take drinks order only. What would have been the harm in taking both orders? Anyways, we requested water with lemon, and when our drinks came it came with no lemon and she claims they ran out of lemons. We went for brunch at 12pm, so you telling me your out of lemons? After placing our food order, the food took about 15 minutes to come. I ordered the all you can eat pancakes, and they only come 2 pieces at a time and you have to keep requesting more. After she gave me my first two, the waitress never came back to the table until everyone was already done eating. \n\nThe pancakes may be all you can eat, so hopefully all you can eat is just two pancakes. I wish you luck trying to find your waitress for another order of pancakes as she would just disappear. The waitress was also very rude, and when i was asking her questions about a substitution she was talking very disrespectfully. I asked her to please not talk to me in that way as i am a customer and she continued to give attitude. I do not appreciate coming to a place with my family hoping to have a good time and spending my money just to have horrible service. \n\nI absolutely don't see my self coming to this place ever again. There are numerous ihop locations and i would gladly visit another location than this one.", "author": "Fahmida M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-15", "description": "Surprisingly fast and pleasant service here! I was seated for a table for one right away on a Saturday morning. Not bad, I'll probably go again.", "author": "Xenia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-29", "description": "I was pleasantly surprised that it was not a full house for Sunday brunch. As soon as I walked in, I was greeted by smiling female employees whom I later advised that my party had not arrived. I love the comfy seating that was located nearby for customer waiting on their party or take-out. \n\nSoon as everyone arrived, there was no wait time for us to be seated. Had a wonderful time over a nice, warm waffle and eggs with turkey sausage. My mouth is just watering as I write this review. Great customer service. I am so glad they finally reopened after having to relocate due to across the street after the land was sold for the construction of new residential/commercial buildings. \n\nForget about the IHOP in Canarsie, I'm definitely sticking to the one in downtown Brooklyn.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-26", "description": "I was appalled to discover that this IHOP only offers Military Discounts to the individual who serves our country and disregards the sacrifice made by the family. We would have understood this decision had the check been split. In this instance however, we were on one bill. I would not have chosen this location if I were aware of this in advance. I am on active duty and made great sacrifices in the defense of our freedoms and was insulted to have my time with my family marred to such a degree. Sunday breakfasts at ihop had become a tradition for us. It is one that will not continue at this location.", "author": "Tara V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-05", "description": "Looks like a nice spot for breakfast and sweets but there's no teamwork here.  If they're not your server, they ignore you.  The majority of the waitstaff is in the back loudly socializing while doing prep work as if the entire restaurant is void of patrons.  One skinny young hostess was really nice.  She greeted me while others saw me and continued to talk and said, \"Have a nice night\" when I left.  That was more service then what I got from the 2 waitresses I had because of a shift change.  The tall slender manager was considerate in making sure the tables were all attended to but he's got his hands full managing a wild bunch.  I was also given an old pot of coffee that later made me sick.  \n\nI would like to come back because I love waffles and pancakes but they need to keep the good staff and get rid of the ones that do not care about the patrons or their jobs.", "author": "Ny'ker C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-04", "description": "That one star is because the staff is nice and because *my* food turned out fine. \n\nBut no one should wait 15 minutes for a table in an empty restaurant. \n\nOr 15 minutes for toast you ordered after all of your food arrives. \n\nOr when cutting into your egg you find out it's runny with it is supposed to be over medium. \n\nThe service is abysmal, even if the servers are nice.", "author": "Jonaya K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-19", "description": "Good morning ! \n\nMy other half \u0026 I started off with iHOP! \nOkay so I never had iHop and all my friends been going all the time! So I kept asking him to take me to iHop. We finally went today! Yay time to eat!\n\ngreat customer service! \nI didn't have to wait a long time for a table. Servers were Avery kind. My partner \u0026 I believed the Egg were not done well. It looked like the eggs were sitting on the table before it was given to us. But we let it slide this time. We started off our morning well! I ordered the breakfast combo which was scrambled egg, two turkey sausage which were really small , hash brows \u0026 great cheesecake pancakes. The pancakes were my favorite! \nHe ordered a omelette with avocados on top , hash brown and plane pancakes. He didn't like the omelette because it didn't have much flavor which SUCKS !! I need my omelette to be delightful!! \n\nThey didn't rush us to leave which was great ! \nGoodbye", "author": "Jannu B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-08-29", "description": "Still working the kinks out. This IHOP opened a couple of weeks ago and it's clear they're still working through their service training. Food was good, service was slow, staff was polite. \n\nI'll give it one more visit, but in two trips it's been exactly the same.", "author": "Dan P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-06", "description": "Not a great experience ...The food was horrible  bacon was cold and chewy and pancakes were dry ..I felt very uncomfortable there and will not return , extremely disappointing !!!", "author": "Ruth K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-18", "description": "I've been to this IHOP three times. I always go in hoping for a good experience and always leave disappointed on every possible level. The service is poor. A long wait to be seated is forgivable on a busy weekend, but it is unforgivable when it is a mid-week midmorning; and the place is virtually empty. Food takes a long time to come out of the kitchen and it usually arrives at room temperature and not plated very nicely. The food in taste and appearance is only just a notch above caferteria food. Finally, I like to hear a good jam with my java, but I'd also like to hold a conversation and hear my companion. The music is always blasting (as is the A/C) beyond a comfortable an acceptable level. I've had really good experiences at IHOPs in other states. I just wish I could have a similar experience at the location that's in my own backyard. One star and three strikes you're out IHOP; Livingston Street.", "author": "Adrienne M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-08", "description": "Came for breakfast with my boyfriend Saturday morning and I haven't been to ihop since I was probably 10-11 years old so everything was new to me. I ordered a California Platter (think it was that) it was Mexican style eggs with avocados \u0026 tomatoes. It was made perfect. Loved it. The pancakes was too buttered but still good. The service was nice. Our waiter was Kimberly.  Had a good service overall.", "author": "Starr Ann H."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "IHOP", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "253 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/HrlZnV0lZvld6LETx6T6qg/ls.jpg", "@type": "Restaurant", "telephone": "+17182224467"}