{"aggregateRating": {"reviewCount": 111, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-24", "description": "THE WORST CUSTOMER SERVICE EVER. This is one of the most unprofessional and unorganized IHOP that I have ever gone to. I had been sitting at the table for an hour, not one waiter came to my table, after an hour of sitting there I had asked the front desk about who is waiting my table. With an rude and non interested attitude. I dont recommend this place.", "author": "Tatiana W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-17", "description": "Let me start by saying, the service here is always great and speedy.  I come here with my family when they come to visit.  But as of late, with all the expansion, portions and food quality have slightly declined.  I think there might be a new company supplying the chicken because it tastes slightly different and the thickness of the tenders are slightly bigger than skinny cuts of schnitzel with lots of crunchy breading. The waffle was tasty but lukewarm.  \nMy bf got the Poblano omelette and it was fantastic (though the ingredients were not evenly dispersed), and it came with 3 hot fluffy pancakes (or some other side).  Overall, we would come back if we are in the area and have a hankering for IHOP, otherwise we could have an easier time finding parking and having a consistent plate of food at another location or restaurant.", "author": "Farrah B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-12-27", "description": "For the last couple of days, I was having an odd craving for IHOP, and yesterday decided to head there. Many people were sitting in the waiting area, and I thought this may be a bad idea, but the man upfront said it would be only a 15 minute wait maximum. We were seated in probably less than 10 minutes, but everything went downhill from there. \n\nAs we sat there for 10 minutes, the waitress passed by and assured us it would be just a minute. However, that minute felt like an eternity because it was almost 12:15 and none of us had eaten. She comes back in about 8 minutes, but decides to help the people in front of us and take photographs for them! She takes our order, and was relatively abrupt with us. Now the waiting part ensues...... without exaggeration we waited at least 20-25 at least for pancakes, eggs, grits, and a appetizer sampler that never came! Mind you, she didn't even give us water either.\n\nThe manager comes by and apologizes and says they were backed up in the kitchen and the kitchen crashed. Whatever that means, we were there at least 45 minutes with no water, no breakfast, no sampler; he says he will give us the sampler for free to go (mozzarella sticks, chicken fingers and onion rings)\n\nFinally the food comes, the grits were soupy, the eggs didn't have much taste... the pancakes were fine. However, I was so soured by the wait time and the poor excuse about the kitchen because I saw a few people get their food before we did, and we were seated first.\n\nOverall, I'll visit IHOP in the future, but maybe just not this location. I've previously eaten at IHOP; when they were located about a block away a few years back, and had exceptional food and service. I don't know what the heck happened!", "author": "Jason R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-22", "description": "Staff is horrible , tables are all wobbly. Feels disgusting. Worst experience ever and I love pancakes", "author": "Vladimir B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-30", "description": "Came here on a Tuesday @ 8am. Empty tables all around and after 10 minutes the staff did not even acknowledge my party and I. While seated, multiple waitresses walked past us. Once we decided to get up and leave, all the waitresses were by the front flirting with the manager up front. Then have the nerve to ask \"would you like to take something to go?\" No thank you! We'll take our business else where! :-)", "author": "Lauren M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-15", "description": "This will probably be the last time I go to this IHOP, aside from slow service ( which was probably a result from them only having two server's on staff on a Friday afternoon) that seems barely present throughout the course of the meal my girlfriend and I both got sick from our food. THIS was probably the first but hopefully the last time I ever get sick from an omelet especially one that's themed after the Grinch.", "author": "Michael C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-28", "description": "Horrible. I called over 4 times for the location of the parking lot and each time I got a different address. Worst service ever. Then we parked in the wrong lot. Then we got there they informed me that I could not a high chair because they only had two servers on. I will have to wait or take him out and put in the booth with the car seat. I will never go here again", "author": "Nakeshia D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-07", "description": "Ordered a bunch of food here and all of it was pretty decent. \nLoved the endless coffee.\nService was friendly and quick.\nStill a little overpriced for diner food. (5 dollars for a large glass of OJ?!) \nStill looking for a real diner though-they're so rare in this part of Brooklyn.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-16", "description": "Bad Service. The food was cold. And the manager refused to accept our 15% of Yelp coupon. Also the bathrooms smelled like weed.", "author": "Akiah B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-26", "description": "Not a nice place to eat , no parking spot very deorganize and not to clean. Not please to welcome you in and cold food.", "author": "Arelys R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-30", "description": "The wait here was ridiculous. First they told us there would be a wait for a table to accommodate 6 of us, the waitstaff was rude and not very helpful the first Ihop i've been to and the food was not OK. We had to wave down the server to settle the bill so we could get out because she was busy with her phone.", "author": "Jenn M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-23", "description": "Dominican hostess can't be bothered to greet guests. Multiple tables with dirty dishes in a 20% full space because the hostess isn't quick enough to bust tables resulting in an unnecessary wait to be seated. Took 10 minutes to be greeted. Server was so trash I can't even be bothered to put his name. Doesn't know how to multi task at all, would hate to see him in actual busy section. Didn't ask how food was. Didn't deserve a tip in the least. I was going to regardless until cousin reminded me that they are paid hourly to serve and tip is extra. The guy didn't even bother to say bye as we left because he was on the phone with a co worker further proving his ineptness. It made me actually glad nothing was left. Food shrunk in size which is good for my weight so whatever. Do yourself a favor and skip.", "author": "Lola C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-26", "description": "The name needs to be changed to IRATCHET. scary looking servers. Mediocre food. At least the music is good.", "author": "Marz D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-18", "description": "I would have given more stars if the service was better. The server introduced himself so I thought we were in for good service. WRONG! When he brought our food, he just set our plates on the table and walked away. I've never had a server bring my food and NOT ask \"do u need anything else?\" Or \"Enjoy!\" Cuz had he not walked away I could have told him he forgot my side of soggy bacon. (When I finally caught him to tell him he returned with soggy bacon) But at least I got 5 pieces rather than 4. (The silver lining, lol) He never checked on us.  Usually I get annoyed by the server coming by too much. So, I've been a server so I never stiff anyone. I left 11%. Which I think was generous.Maybe he was having a bad day cuz bad tips but it was reflecting and just making it worse. The food was good tho. .", "author": "Xandria B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-03", "description": "This location needs to hire people who wants to do their job. Our waitress Maria came off to be very rude and obnoxious. Her customer service skills are awful.", "author": "Shane V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-12-29", "description": "I went here sometime last week for dinner. \n\nI want to first say that I felt that the restaurant was very unsanitary. My utensils were not washed at all that I had to send it back and ask for a new set. The plates and cups also seemed a bit unclean. \n\nI ordered a breakfast sampler with a  chicken steak on the side and a hot chocolate. \n\nThe breakfast sampler included pancakes, bacon, ham, eggs, hashbrown, and sausage. The pancakes were not soft and fluffy at all. It was hard and very sticky...as in it just all stuck together (not sure how to describe this). The bacon, ham, and sausage were very salty and I understand it's to be expected. The hashbrown tasted like charred potato bits put together, was not like the hashbrown I was expecting. \n\nThe chicken steak, surprisingly, tasted really good. Surprisingly, I didn't taste the steak at all. The breeding wasn't too much and was thin enough. The gravy that came with it added to the flavor as well.\n\nThe hot chocolate, in my opinion was too watery and not sweet enough. It came in a small cup also. I did not think this was worth the $3-4 I paid for it. \n\nThe waiter was nice, attentive and always gave us time to decide what to order. Although this may have been because there were barely any customers. However, my order came out wrong and I had to send it back to get it right. \n\nOverall, wouldn't come here again or would try another a location for IHOP.", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-10", "description": "This is my first time going to Ihop and it was for the free pancakes on March 7th aka National Pancake Day. This is a really big and new restaurant. It was clean and the waiters eventually provided the free pancakes. \n\nOverall, I don't have much to say for a chain restaurant serving breakfast styled food.\n\nOh yea, please tip the waiters. The food is free but their service isn't!", "author": "Wendy C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-18", "description": "Worst experience I ever had at an IHOP. Went for the first time recently, the ambience was dead...You could count the tables that had people, I counted 10. The lady at the door make us wait like 20 mins, beginning with the unnecessary waiting time I decided to track our journey there.\n\nHere is the timeline:\n\nGot here at 5 o'clock \nGot seated at 5:20 (many tables empty)\nWaitress came at 5:30\nNever brought us water\nShe then sent another waitress to do so...got the order wrong.\nIn the meantime the girl who seated us passed by so pissed off and spitting bad words. She threw some menus at an empty table and said out loud \"mother fu%$rs, they must be fu%$ing kidding me\" (she was talking to herself, but the whole restaurant heard her, even her co-workers)\n5:45 we finally got our food \nOther tables that came after us already finished eating and are leaving.\n6:04 she brought the bill \"with no rush\"\n\nWe left happy because the food was good. But unfortunately the customer service at this particular location is really poor.\n\nBuild it up IHOP! Sorry no sorry!", "author": "Wendrich J. M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-11", "description": "The wait was bad (even for a Saturday morning). The waitress was rude and jaded. She made one of the cooks carry food for her while they flirted. The food wasn't very good and it was cold (she forgot an order of hash browns). There was a small cockroach that appeared while we were eating. Thankfully they gave us the meal for free after I complained about the cockroach.", "author": "Valerie Q."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-19", "description": "On July 18 I visited IHOP to take advantage of their 59 cent / stack anniversary sale.  I arrived at 8:35 AM before the restaurant was very busy. The people who greeted me were very nice and my server Nakeema was also helpful and friendly.\n\nFor 59 cents a stack, my pancakes were very worth it! in fact I ate two stacks! \nIf it were any other day and I was paying $7.25 a stack, my enthusiasm would have been a bit more tepid. Their pancakes are light and well made but nothing special. I also had a pot of coffee that was a little weak but otherwise fine. The highlight of IHOP as a kid was their flavored syrups. They are still on the tables but perhaps because I am no longer a kid, they seemed overly sweet. \n\nAs others have pointed out, this is not a restaurant to come to if you are in a rush because service is a bit slow...which for me was fine because I had my morning paper to read! \n\nThe restaurant is clean and modern but the condition of the restroom was less impressive. One stall was taken (not their fault) and the other had some buckets in them (their fault :-)\n\nSo the next time they have a great deal, I will be back again!", "author": "Neil B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "IHOP", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "253 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/HrlZnV0lZvld6LETx6T6qg/ls.jpg", "@type": "Restaurant", "telephone": "+17182224467"}