{"aggregateRating": {"reviewCount": 111, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-11", "description": "I walked into this place with very little expectations, since it was my first time it's only fair that I let them leave a lasting impression, for better or for worse. Tends out that this experience was not for the better. I walked in with my Dad to grab some breakfast and we notice that the tables near the door were available. There were about 4 tables that were free and only one table currently being occupied. We asked the host of we could sit there and she said sure, so we sit down and she proceeds to grab the menus, however before she had an opportunity to bring us the menus her manager tell her that the section isn't available and we'd have to be taken to the back. Well all in all that was the start of a disaster. Burnt Bacon is no bacon at all, server takes the bacon and brings back the same bacon, What? You think I wouldn't notice that it was the same bacon I just asked to have replaced? Well then some \"new\" bacon was brought back but it was at room temperature so the implication is that in 30 seconds the bacon lost all of its heat, yet it was \"fresh off the grill\". You guessed it, I didn't eat the bacon, 3 trips to the kitchen for the same thing isn't recommended. All in all, I was disappointed and will not be returning to this location. No one should be made to move from their seat after being told they can sit there, especially while there are people occupying the section. This is My 2 Cents! I try to be as honest as possible. Hope this review gives you some insight before you choose to come here and be disappointed.", "author": "Cristian G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-02", "description": "This particular IHOP is very clean, and the staff are very courteous. The waffles and sausage,eggs were delicious. The food was serve very promptly and just how I requested.  My first visit to this particular IHOP and definitely will return. My waiter Theos was on point with my order, and check on me frequently to insure all was well.", "author": "Julian L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-30", "description": "Although the food was good, the wait was long and we asked for the pork sausages to be switched with turkey sausage due to dietary restrictions. Ended up getting charged 4$ for two teeny tiny turkey sausages and we weren't told it was going to be extra. We had to ask for the bill 5 times until we finally gave up and walked up to the register only to be told to go to our server again.", "author": "Iz W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-04", "description": "Ihop is a sort of tradition for myself and some friends, any Ihop would do. But, when I came to THIS ONE... man it really stands out. It's always playing the BEST MUSIC. Like, I need this playlist in my life, and while eating, even better. Best Ihop ever.", "author": "Parnia N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-12", "description": "Surprisingly, this has to be the best IHOP in NYC.   I know that it's still a new location, but their customer service was really good.  The other locations need to take a page out of their book.   From the greeters to the wait staff to the manager --- excellent.    Also, this has to be the roomiest location!   You're not on top of each other like other locations.  It is very spacious.   The wait time for our order was not long at all.   Omar was our waiter last week.... Courteous and very pleasant!  The manager also took time to walk over to various tables to ask how everything was going.", "author": "Paula W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-18", "description": "Okay the best part about IHOP is the server Amanda. She is the best!!! But there are some cons. The chocolate chip pancake was not circular and the whipped cream was half off the plate. Although the red velvet pancake was nicely done they also they messed up our friends order. In addition, the hash brown was not the best. We disliked the hash brown texture. Anyway, I would go ONLY FOR AMANDA :)", "author": "Vickie Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-24", "description": "I tried this new location with my sister and her boyfriend and had quite an unpleasant experience. First, we had a stroller and there are steps as you walk in. Two employees argued over whether I was allowed to use the elevator or not. I didn't mind carrying the stroller down the steps, but it was uncomfortable to stand there as they argued only to conclude that the elevator was for wheelchairs only. Then we were sat in a lonely corner, as the host stated, to allow me extra space to accommodate the stroller. I normally would like that, but it caused our table to get little attention. First, our food took one hour to get to us. The server came once to explain that they had a new staff so it was taking longer to get food to us. But everyone around us received their food first and paid and left despite getting there afterwards. As we got up to leave without getting our food the server appeared with our food. It looked like scraps. Worst food I've tasted in a while. Then as I went to the bathroom to change my son's diaper there were two workers in there on their phones. And finally, before we were about to walk out my sister's boyfriend asked another waitress where our food was and she snapped at him saying we weren't her table. She was so rude! I didn't get her name but she had an accent and seemed to be middle eastern. We won't ever come here again and we'll be sure to stop our friends from coming here.", "author": "Carmen C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-29", "description": "Worst iHop I've ever been too. My Server Tracy Ann had the worst customer service , she gets me the wrong drink, then wants to catch a attitude when I asked for the drink I wanted in the first place , then I ask her to get me plastic utensils and she asked the Host to get it for us .. Um aren't you our server ? gives us NO napkins and didn't even ask us once is everything okay. The food was dry, like if it was sitting there for hours. They need to get better experienced friendly servers. Will not be coming back.", "author": "Sara C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-29", "description": "The service here is absolutely terrible.  The waitress took about 25 minutes to bring our drinks to the table, got it wrong, \u0026 served coffee without milk.  I asked if she could please bring milk \u0026 water; but this never happened.  She returned to the table once every 15 minutes to tell us she was going to bring milk \u0026 water (3 times), but I ended up having to flag down another server to get it.  She did the same thing with our food order - told us it was ready and that she was going to get it (and didn't).  It took one of us telling her that we'd been waiting an hour for food for her to finally bring it to us.  One of the orders of eggs was ice cold.", "author": "Rachel K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-26", "description": "I came for lunch me and my wife the waffle was so delicious and and the drink so good", "author": "Ahmad M."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "IHOP", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "253 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/HrlZnV0lZvld6LETx6T6qg/ls.jpg", "@type": "Restaurant", "telephone": "+17182224467"}