{"aggregateRating": {"reviewCount": 111, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-18", "description": "Delivery- I waited 3 hours and was told it was going to be on its way. Cancelled and bummed! I am normally very patient but this was kinda crazy!", "author": "Breezy M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-04", "description": "Understaffed from the get go, there was a 15 minute wait with over half the restaurant empty. The order was wrong, the eggs weren't as ordered, and I had to wait an extra 10 minutes after the food came for toast. Ten minutes for toast. I usually love IHOP but this location is awful from start to finish:-(", "author": "Ryan R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-07", "description": "The service is abysmal.  It's slow and non-attentive. At my visit there was a chlorine smell in front, which could be due to the fact it's new.", "author": "Jonah F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-13", "description": "Went in with a friend to eat. Asked for a table and the counter person said that if i want my food to stay it'll take longer than if I want it to go.  There were only 8 customers in the restaurant at the time. While she was telling me all this she was looking down. It's extremely disappointing. Not sure what it is that caused her to do that.", "author": "Ali F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-01-05", "description": "This was by far the WORST IHOP we've ever been to \u0026 we love ihop . For starters the place is EMPTY !!! There was no wait time we got seated as soon as we walked in . The waiter passed us \u0026 said \"I'll be with you in 2 mins\" , after 5mins off waiting he finally came to us didn't greet us nor tell us his name . In fact I greeted him he still didn't mention his name so I proceeded to place my order . Myself \u0026 my partner get the SAME THING EVERY TIME sirloin tips with eggs which comes with hash browns \u0026 2 pancakes WE DONT EAT EGGS so we ALWAYS ask to substitute the eggs for another pancake . Surprisingly the waiter told us we can't do that , ok so I said forget the eggs can we get a short stack , side order of bacon (4) , 2 berry splashed hold the orange juice \u0026 a hot chocolate . Now usually we always get our hot chocolate first this time that wasn't the case the , we waited another 5 mins \u0026 he brought out the 3 drinks we declined the hot chocolate . The splashes tasted like Seltzer water with 2 strawberries at the bottom also he didn't bring the y'all spoons that are usually in the cups to stir the strawberries in . After this he disappeared so I had to signal the manger who's name wasn't visual that the drinks don't taste too great \u0026 gave her a brief complaint on out server who's name we still don't know . She apologizes \u0026 said she's going to fix the machine . Now it's time for out food which was a disaster . He brought out our food with an attitude I'm guessing his manger told him what I said , this  time he forgot our side order of bacon . Also we ordered steak WHERES OUR A1 SAUCE ???? I had to get up \u0026 get my own condiments . I asked for warm syrup he brought it back 10mins later at this point my pancakes were cold \u0026 we still didn't get our strawberry splash drinks  NOT EVEN WATER \u0026 we were still waiting on our bacon  . The manger came back with a fresh set of drinks for us which tasted like the 1st set of drinks that came our way we told her it didn't taste right she took them back then brought us water by this time we were halfway through our meals . The manger then brought our bacon which we kindly declined as well due to the fact we were almost done eating . She finally brought our drinks out 3rd times a charm they got it right or fixed their soda machine . Now we were don't eating sitting \u0026 talking trying to enjoy our late drinks \u0026 the waiter then brought the check which we didn't ask for . . . . Overall the experience \u0026 service was horrible . The manger needs to properly train staff on customer service . 1st \u0026 last time going to this ihop location !!!!", "author": "Shaun O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-01", "description": "I went yesterday for the first time new yeard eve, Bad service started from the door. Unprofessional hostess very lazy. After promise of a ten min wait.( 45 mins later). When to sit and a bunch empty seats. Place order another 45 mins and alot of pissed off customers as well . Food came, Omelette terrible. Hard harshbrown, steak tough and pancakes taste like a cheap brand mix. Customer asked hostess next to me why u sitting me in a section with a dirty floor. She ( hostess) was sucking her teeth at customer huh. How is the servicer for another table going to come out the kitchen with food for his customer eating food in his mouth . he couldnt even talk when asked a question. Did i mention the front foor handle was coming off lol.", "author": "Alicia J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-04", "description": "Normally I am an IHOP fan, but this was my first time at this location and it wasn't great. Our waiter was very nice, but the food was not. They were out of waffles by six p.m., which is pretty ridiculous for a 24 hour breakfast restaurant. I got the breakfast crepe which was good, but the mozzarella sticks were cold and the cheese was the consistency of a ziploc bag. I was never asked if I wanted a refill, and I had finished my meal before my boyfriend ever got his. Our meal was fifty dollars, which is ridiculous for the low quality of the food. I also had to get up and get my own sugar, which doesn't really bother me but I specifically asked for it and it was already at the other tables.", "author": "Ember O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-08", "description": "Nope Nope Nope Nope. Someone wrote on their review that there is no teamwork here and that is correct. I came on free pancake day. I waited 1 hour and 30 min until i got my pancakes and 90% of that time i was at a table. I got fed up with trying to be patient, watching several different workers walk by me many of times and not one ask was I ok or what i was  waiting for. I got a girls attention and ask her how long would it be and she's like \"oh your waiting on pancakes\" and I'm just thinking like duh, do you think I'm sitting here for my health. Also no one was at the front to seat people on top of that waiting 15 min to get seated and there were way more than enough tables available to sit everyone that was there. It seems like they have no organization and make their jobs harder on themselves. They need some new direction, because whatever is going on here isn't it", "author": "Morgan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-24", "description": "Was in the mood for pancakes today. Boy this hit the spot. Not all that expensive and the service is good.", "author": "Benito P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-03", "description": "The service sucked. The manager and the waitress had bad attitudes and wasn't cooperative. Lastly it took me 2 hours to get my food after i had ordered it", "author": "Lamont D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-19", "description": "This is by far the best Ihop I've been to. From the hostess to the servers. My experience was great! I was seated immediately. I had hot coffee at my table when seated.The meal was delivered fast and was super delicious . I am looking forward to visiting again next weekend!! What the heck, since it was so good, I may treat myself and make a mid week visit! Thank you IHOP Livingston, keep making the people happy!!! Thanks for coming back to the neighborhood. Bigger Better and Stronger!", "author": "Nikki C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-24", "description": "As they say in France, IHOP is king.  This location definitely proved that centuries old statement to be true.  Let them eat pancakes!", "author": "Ryan S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-11", "description": "This place is an absolute joke I am a manager in the food industry and have been for years and I can tell you this is by far the worst experience although my server was nice it took 25 minutes to be asked if we wanted drinks almost an hour for our food which came to us ice cold we then told our server that everything was cold he replaces the order only for half the order to be over cooked and I mean French toast that could've chipped a tooth. The manager is laughing and hanging out like its a park staff are sitting a chit chatting I mean you might as well close now and save the money that's going to be lost.", "author": "Marie P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-05", "description": "this place sucks , waited 20 minutes to be seated , 20 minutes after waitress appeared then 30 mins later food arrived. colddd !!! cold food ..  def calling the health of ny", "author": "Nabin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-27", "description": "This is supposed to be the rebirth since the health department closed down the one across the street.  This is an abortion, service is slow and ghetto.", "author": "Bubba C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-17", "description": "Unbelievably HORRIBLE! I went there Saturday afternoon and the staff was DRUNK! SERVERS, MANAGERS and probably the COOKS because my food got sent back about 3-4 times. I don't know if the server shaniqua was just slow. Or the cooks was drinking too. I went to the restroom I had the pas the back area where in guessing the staff hangout at. And it smelled like LIQUOR .. I see 2 ladies dressed in regular clothes so I'm guessing they're managers just laughing and drinking too. Now I see why this place gets the complaints it gets. I'm sooooo over this place", "author": "Bethany C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-11", "description": "Only giving 2 because the food was what you'd expect from an ihop. Classic diner food. This is probably the worst service I've ever had. Food took a long time. Waited 45 minutes for the check after we finished eating. It was partially the waitress on that one, but manager played a role too. Find better management.", "author": "Sarah L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-19", "description": "The Service at the door was exceptional but after being seated the unprofessional hostess was extremely lax, lazy and unorganized.  My sons and myself were served our meals over 15 minutes apart.  One of my sons finished his meal while I and my other son were waiting diligently for ours.  By the time we received our meal, it was cold and undesirable.  The waitress never asked us about the quality of food.  Patrons that arrived after us, were served their meals completely before we received ours.  I complained my discontent to the front door hostess and she gave me a coupon for future visits.  Unlikely, that I will return.", "author": "Lou M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-22", "description": "Terrible experience. I don't even know where to start.. The hostess told us to wait 5-10 min with empty tables all over the restaurant. I understand sections system and getting equal covers - worked in restaurants, but I went to the restroom and empty tables were all over the restaurant, it wasn't just one closed section. Fine, I'll wait.. We got sat (right by the bathrooms! with all those tables to choose from!), no server in sight. Waiting, waiting, waiting.. Yes! Nice girl shows up! Smiling.. polite.. Good start. We look at the menu, everything looks good! I want it all! lol I love ihop, I've been customer for very long time so trust me it breaks my heart. With all other chain restaurants getting worse and worse, IHOP never disappoints. We order drinks and food. Busy with two kids at the table and engaged in the conversation with my friend I still notice that it's taking long time to get our orders. Food comes, half wrong, drinks never arrive. Send the wrong dishes back and asked for drinks. This whole time the waitress is very nice and everything is yes, yes, yes. But that doesn't mean you can forget half of my order and keep smiling. The bill comes without being asked for (!!!!) and of course needs to be adjusted ugh. She starts cleaning plates of the table while we are still eating! Easy! lol Everything in between takes long time, everything needs to be asked for. We just gave up, gave the girl two credit cards and told her to fix the bill. I hope she did, because she never brought it back, just the credit card receipt. The whole time server was very nice, but not admitting she did anything wrong or didn't do her job or at least saying \"I'm sorry, my bad, let me fix it\". Fake smile glued to the face, that's why so many actors are waiters so they can practice their craft lol. Me and my friend were rolling our eyes the whole time. The management needs to start training their staff properly, because it makes first of all them and the rest of the company look bad. The fact that I worked in restaurants and know the business made me hold back and not to call the manager over to the table and complain. Next time I won't hesitate. It always could be worse I guess lol. We left the tip for the server and left. P.S. IHOP on Ralph avenue has much better trained servers with so much more personality!", "author": "Roma S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-01-18", "description": "Server--Sakeem--was great. Very courteous.  Went on a Sunday afternoon and they were a little understaffed.  Just expect to wait a long time to get seated, and for the food to come. But, it's bright inside.", "author": "Aj B."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "IHOP", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "253 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/HrlZnV0lZvld6LETx6T6qg/ls.jpg", "@type": "Restaurant", "telephone": "+17182224467"}