{"aggregateRating": {"reviewCount": 111, "@type": "AggregateRating", "ratingValue": 2.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "The three of us showed up and showed out. We had a great meal and a great time.\nOur Server was a little off but that may have been because of the place being busy. \nMia loves eating there and we will be going back soon.\nThanks IHop.", "author": "Cassandra R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-04-30", "description": "I live too close to this IHOP to have never gone, so I finally committed last Sunday. This is your run of the mill IHOP with the typical interior. \n\nIHOP has a much more intense menu than I remembered, but I stuck with the basics and got the ham, cheddar, and avocado omelette. As my side, I upgraded my pancakes and got the Harvest grain. The omelette was ok - not particularly amazing or delicious. The pancakes were SO good - I really recommend this flavor!\n\nOverall the service was ok, the seating and ambiance were ok (its a little dark and dreary), and the food was better than I expected. \n\nI enjoy visiting chains like IHOP from time to time as a novelty. I'm not making IHOP a tradition, but I can't say I won't be back.", "author": "Katey G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-09", "description": "Update: Food poisoning.  \n\nOriginal Review:\n\n\nI walked in at 4:25AM. I got seated by clearly some manager's grandmother. She had a limp and wasn't very nice. Nevertheless, I sat down. At 4:45 a server took my order. I waited 20 minutes to order a Mountain Dew and their Fried Catfish. I asked for my eggs poached, which is standard fare in any diner, but she initially thought the head chef was incapabale of making poached eggs. She came by to the table and let me know he could. It's 4:49 and she just dropped the soda off. Apparently, it takes 4 minutes from order to soda fountain. The average wait at a service bar in a restaurant is less than 2 minutes. Here we are at 4:50 waiting for food. Also, side note: I just had an insect walk across my table. But here I am - waiting on catfish and eggs that probably won't be right. I also order mozz sticks to quell my appetite - 5:00am and still waiting. I have worked in restaurants for 20 years and even on slammed nights, they might take 5 minutes. The bodega next to the IHOP makes them under 3 minutes.  And still... I wait. Sidenote: i noticed this place only has like a 2 star rating on yelp and might be the worst rated place near me. It seems like that rating is right. Furthermore, ownership and management are too bitch to respond to their Yelp reviews because they truly dont care.  ...and 4:03, still I rise. This kitchen is slow as molasses. Maybe the chef died, in which the dishwasher might possibly cook the food better.  I'm expecting some really overcooked mozzarella sticks at this point. It's maybe 15 tops in here. This makes no sense. Kill me now.\n\n...and yet, again. Here we are. I just recieved my mozzarella sticks and they gave me a side of marinara in a plastic ramiken with a plastic top.  Bro, eff this. This is extreme laziness at its finest.\n\nAdmittedly though, the mozzarella cheese sticks were good. They were pre-frozen and probably from sysco, but they were good. Not necessarily crispy, more elasticity but good.  Had 2 and just started waiting for my real food.\n\nThe suace was still cold. Pretty trash, but I did like the consistency of the sticks. \n\n5:10 and still waiting for an entree.\n\nI can kinda tell their chef definitely doesn't care. I wonder what culinary school he attended?\n\n5:11, my food comes. \n \nHonestly, growing up in the south and eating catfish regularly. I have never seen it smell or look like this.\n\nEggs weren't poached, yet soft boiled. I just saw ANOTHER insect run across my table.  Still waiting in hot sauce and pancakes. :(\n\nIt's 5:15 and I am thoroughly disappointed. My waitress still hasn't brought the hot sauce I requested when i ordered, nor my pancakes.\n\nThe table next to me is having a drunk conversation about eating pussy and keeps banging into my booth.\n\nLet me finish my review - SHUT THIS PLACE DOWN NOW", "author": "Jeremy Q."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-10", "description": "I have been to IHOP in Florida many times. IHOP is IHOP.\nWent to Brooklyn IHOP on Livingston St. $8.00 for 2 cups of 6oz coffee. REALLY!!! Not even Starbucks charges that much. A total ripoff. I will make sure to post this on all social media. I forgot to look in the bottom of the cup. Maybe there was a Gold Nugget.", "author": "John L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-30", "description": "Mikayla our server was so nice! Food is typical ihop food. Nothing out of the ordinary. I am here just to give a 5 star review on our server. She was wonderful", "author": "Estela S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-18", "description": "This was the worst dining experience. Firstly we were told to wait though the restaurant was empty with only a few people in it. So, we waited. Finally we were taken down to the restaurant and it was absolutely filthy - dirty dishes and food everywhere. We were directed to another table and I pointed to the waiter it was covered in someone's else's lunch so he grunted and directed us to another table. We finally ordered and our food came out and it was disgusting, I couldn't finish it. We left majority on our plates and decided to leave. Then when I asked to pay - no one could help me and kept bouncing me between different people. In hindsight I should have walked out.\nAvoid this place. It's dirty and absolutely the worst service ever. THIS PLACE WILL PROBABLY GIVE YOU FOOD POISONING", "author": "Poppy S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-07", "description": "The food is standard but the service is so slow. I mean slow. Expect a good 15-20 minute wait for your food. I even asked for a glass of water and it took forever. This is IHOP and the food is not worth waiting that long for. I did not even want to tip my server because of the long food wait time. However they will hand you the bill as soon as possible. If you are thinking of going to this place, I suggest you bring an activity cause you will be sitting there for a long time.", "author": "Raymond Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-26", "description": "IHOP is my comfort food hideaway. When Im craving for pancakes I come here. When Im down I come here. When I burn 600 calories in day, I come here. Its sort of my happy place. You get food here in abundance and it is good. I usually do IHOP on vacations where I have to hike, it gives me the energy to reach the top of Mt.Everest (Just Kidding). This IHOP location is convenient to me. The customer service is awful. Most of the employees here are nice but it does not look like they like their job. Every time I come here the service is slow, they get our orders wrong and once this waitress just splashes water on us while she puts the glass on the table. But anyway, I will continue come here when I have my cravings and all I can say is that I love their pancakes and omelettes and yes they will make you go fat but who cares.", "author": "Aishwarya S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-09", "description": "IHOP is ihop. We go here for the breakfast mainly because my kids like it. Ordered the melt sandwich, silver dollar pancakes and the pancakes breakfast sandwich. Not to thrilled about the pancakes sandwich but everything else was ok. The service was ok but it could be better.", "author": "Ana L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-02", "description": "RUN.. right when you walk in they just ask for your name. NO HI, GOOD AFTERNOON ETC,  the lady who took us to our table, just left the menus on the table and walked away...\nTo boot the seats and the table had pancake crumbs all over it.  We asked a young man if he could give us something to clean it and he came cleaned it for us ... wish I had his name to say thank you again.Now the food was good and our waitress Fani was awesome! If it wasnt for her the entire IHOP experience would of been disgusting... And finally the young lady who took us to our table originally ended up giving a wonderful service to the table next to us which I think was a little bias. Sooo IHOP shame on you guys for hiring people like this in your establishment.", "author": "Diana M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-29", "description": "I don't know why i went to ihop expecting a 5 star experience . I got a waiter who looked bothered the entire time(2dollartip) who gave me a cup of chocolate with more whipped cream than chocolate , when I finally scooped off all the damn excess ... the chocolate was sweeet as fuck ! I ordered their soul food menu option the fried catfish with grits and scrambled eggs ... was skeptic but I said let me try something new ... the eggs and catfish were okay .... just like the rest of their preheated food ..... the grits were drowning in butter and were sooo uncooked hard .... I asked her to take it back and bring me pancakes instead ... Poor pregnant me .. my baby i was hoping that at least the grits would be yummy .......\n\nWell she gave me my bill when she brought the pancakes ... and i well pull out her (2dollartip) before I was even out of my seat to leave she asked me if we're good ,.. I said yes ..........\n\nAdding to that .. I asked her for a cup of water and the lady didn't even refill it ..... not attentive customer service and horrible food ... shoulda payed more and went elsewhere", "author": "Raisa V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-01", "description": "I don't know if it was the time / day I went, but I think this IHOP location has stepped it up. I went in this afternoon (on a Tuesday around 5ish). I was seated right away and waited to be served for about 5-10 mins. Since then I was given appropriate attention and service from the waitress. I wish I knew her name to give a shout out! She asked how was everything and made sure I got what I needed. Also I changed my mind about something right after she wrote down my first choice. She was nice about it and just made the changes I wanted to my order. No fuss and a great attitude. \n\nUsually IHOP downtown Brooklyn you're waiting so long; you might get judgement day before your meal lol. With this location and time, it wasn't the case. Now I won't go here on a Friday or Saturday though cuz I feel my experience will be different. I might just stick to the weekdays when I have a craving during or after work.", "author": "Diane D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-14", "description": "1 star I would put 0stars if I could. We waited over an hour for our food then only to find out the kitchen was \"broken\" and no one came to tell us. When the food came it was horrible.the waitress was good the eggs were slimey and the food just tasted bad. Don't come here.", "author": "Nicole L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-14", "description": "Carolina, the worst waitress in the world. I politely ask for butter and she ignores my request and goes on to sing songs and clean tables right next to me. I set my own 10 minute timer on my phone and still didn't receive it. The whole restaurant was empty too so it's not like it was busy and she didn't get to it. Never again eating here. Plus my bacon wasn't even cooked I could still hear the pig squealing", "author": "Ryan I."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-03", "description": "Ok so I was about to spaz out because I HATE WAITING. They said it was a 45 min wait so I decided to order to go. 15 mins go by, 30 mins go by and I'm about to flip the table over now because I'm asking how long before I get my to go order and I can't get a clear answer. So I start to raise my voice and ask for a manager. She comes out and apologizes and gives us something for two complimentary meals to use in the future. Not to say that I expected much of the establishment, but Jesus Christ how does it take them 30 mins for a to go order?!", "author": "Jihan M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-01", "description": "Every weekend they ONLY have 2 servers. Like what kind of nonsense is this. The ENTIRE restaurant is empty but its a 25-35 minute wait because the ONLY 2 servers cant handle more than 4 tables at a time each. Ridiculous. We drove to Olive Garden instead.", "author": "Lola V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-19", "description": "I came with my family for lunch and the service was absolutely terrible. It was empty and my first thought was I shouldn't take long. I waited 20minutes just for someone to take my order, the food took 40mins and no one was walking around asking if I needed anything else. I highly don't recommend this IHOP", "author": "Andrea V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-17", "description": "Worst service ever an my eggs were brick cold when we got them!  The new eggs came an were just the old ones heated up! I will NEVER go back to a ihop again!", "author": "Terry N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-26", "description": "I love this ihop. It's very big i just don't like sitting in the back because there's no phone service it sucks. Sometimes i hate waiting but you know first come first serve.", "author": "Shade B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-07", "description": "WORST IHOP EVER! I will not be giving them another penny of my money. First off, the place was empty so I figured we'd get a table right away. Oooh nooo, the emotionless monotone kid they call a host informed us that there would be a 10-15 min wait because THERE WAS ONLY TWO SERVERS! Like seriously???? He actually had us waiting about 25-30 mins smh. Absolutely ridiculous but the madness doesn't stop there. The food took forever to come out and mine was over cooked, my aunts eggs were under cooked, there was a white spot on one of the spoons and a long hair wrapped around the A1 sauce. Our waitress Maria was great and very helpful. She's the only reason why this crappy place is getting 2 stars and even that's pushing it. Although the bathroom was clean, they didn't have any paper towel or hand dryer. The purpose of washing my hands before my meal was defeated when I had to open the door with one of my fingers. NEVER AGAIN!!!!", "author": "Altamease R."}], "servesCuisine": "American (Traditional)", "priceRange": "$11-30", "name": "IHOP", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "253 Livingston St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/HrlZnV0lZvld6LETx6T6qg/ls.jpg", "@type": "Restaurant", "telephone": "+17182224467"}