{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-28", "description": "This is my favorite restaurant in New York City. Every day, there is a new special posted. The staff is amazingly helpful, kind, and generous. Any special roll is delicious. If you like new and innovating appetizers, try the sushi pizza, grilled oysters, tuna tar tar, spring rolls, or whatever special is. Try the udon, lobster dinner, or if for two, try the love boat! \n\nEverything is fresh and creative. The old style of sushi is mixed with the new. Oh and try the green tea. Also: Fried Ice Cream.", "author": "Eric L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-22", "description": "I would say this is the best sushi spot in Brooklyn Heights. Everything is fresh and delicious. The quality has always been on point every time I've gone. They have a good lunch special. 3 rolls for 11. Can't beat that considering the quality.  My only complaint is that they don't have a full bar. They do serve saki, wine and beer. Overall I would go here if you feel like sushi and are in the area. Provided you dont want a cocktail.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-21", "description": "Iceland appetizer had a delicious cilantro mango sauce with spinach. Lobster special was fresh and very, very tasty. \"You Never Know\" rice was soooo yummy!!! I'll be back! Thanks Alice for your recommendations and service", "author": "Beatriz K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-25", "description": "I was yelping a sushi restaurant and stumbled upon this iron chef house and I must say this is the best sushi restaurant I have been to thus far. Came here for a date night and we both loved it very much!! \n\nI love trying the specialty rolls and I must say this restaurant has the best special chef rolls. \n\nWe had the monkey roll and hard rock roll and sushi and sashimi platter and it was delicious the sushi was extremely fresh and my favorite was the hard rock roll which is wrapped in a  rice pancake I recommend it to everyone we also had plum wine and it wasn't overly sweet which I recommend as well.\n\nStaff is super attentive and very friendly the restaurant itself is nicely decorated and its located in a very nice neighborhood. Also, brooklyn bridge park is nearby! \n\nI definitely see myself coming back here again!!! Looking forward  to trying all their special unique sushi rolls!!", "author": "Nabila M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-24", "description": "This popular sushi place is not ran by Japanese owners.  This is place is ran by Chinese chefs and workers.  This is not what I consider authentic in any sense.  The food was decent overall but for westerners but Asians who want sushi should go somewhere else.  The shumai dumplings were from the frozen food aisle of Asian grocery stores.  The sushi fish itself was not the freshest in my opinion.  It's a decent place to go when you do feel like going into the city for authentic sushi or for take out.", "author": "Wilson L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "I just moved to Brooklyn heights \u0026 came across this restaurant on yelp \u0026 its nearby my apt. It's a really cute restaurant I ordered the sweet potato sushi which was fresh \u0026 delicious. I also ordered the noodle curry soup so very, very Delicious \u0026 probably the best I've ever had with so much seafood. I definitely recommend trying this place out \u0026 I will be coming back to try there other dishes as well.", "author": "Christina G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-03-10", "description": "I am SOOOO sad about this place . For the longest time this was my go to when I don't want to cook but the quality of the food has just really gone down. The fish is not fresh and the sushi is all rice with very small fish . So sad", "author": "Erika C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-16", "description": "This place is a true hidden gem. It's so small, but super packed that I had to wait roughly 15 minutes for an available seat; totally worth it, though. Do yourself a huge favor and always order the MONKEY roll. I'm not a huge sushi or restaurant person in general, but nothing is stopping me from coming back. Great food, great staff, great vibe, great atmosphere, great company. \n\nBest sushi place.", "author": "Richard Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-09-09", "description": "Great lunch spot in the area. Awesome lunch special, for $10.50 you get soup, salad, a roll of sushi, sesame noodles, two dumplings and an spring roll. The food is delicious and the service is fast and friendly. Highly recommend it!", "author": "Antoinette R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-28", "description": "This is my second time ordering from YELP and my orders are wrong. I was proven wrong by my order receipt but I know for a fact what I pressed because I wouldn't order something I don't like... but Iron Chef's quality is not what it was. Today my shrimp tempura roll tasted like it's been sitting out all day and the sweet potato roll spoiled. Basically I paid over $30 for good sushi and my meal was ruined because it was the wrong order and the food did not taste good.", "author": "Sarah S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-14", "description": "* PROS *\nThe menu was very unique when it came to the mix of ingredients, especially the specials! \nSpot is small, but very cute and cozy. \nThe sushi itself is very fresh \u0026 delicious! \n\n- CONS - \nHorrible customer service \nOne lady killed it for everyone in there. We had dinner that was worth a lot, and payed a descent tip that we thought was appropriate even though we were asked to basically leave the restaurant because we were taking long. Long meaning the people that were there next to us an hour longer then us, we're not being told anything. THE LADY WITH SHORT HAIR UP TO HER CHEEKS WHO WAS NOT EVEN OUR WAITRESS RETURNS AND ASKS US FOR MORE TIP!!!!! Are you kidding me? We ate over 130+++ food and tipped double digits even with her being so rude. \n\nYour food may be good, but our night was ruined.", "author": "Daniel D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-06", "description": "I was originally going to meet a friend at Jun Shokudo about 15 minutes away from this place, but that ended up being closed on Sundays. She was really craving sushi, so we looked for what else was within walking distance, and found the Iron Chef House! Definitely worth the extra half mile walk. \n\nIron Chef House is a small restaurant, but it's cozy and comfortable. We were seated immediately and the waitstaff was very attentive. The sushi was incredibly fresh and flavorful, and they had a nice variety of interesting maki. It was exciting to find a Japanese place not too far from me conveniently located by the Clark Street station. I will likely be returning in the future!", "author": "Michelle A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-23", "description": "One of my best friends recommended this restaurant to my boyfriend \u0026 I about a month ago but sadly, I was sick for a while and didn't start feeling better til two weeks ago, so we finally gave it a try today.\n\nThe restaurant is somewhat small but I did feel warm and welcomed upon entrance to the restaurant. It's spacious, warm, and has a very modern Asian vibe and look to it. Even the bathroom is very nice! The service was top-notch, my boyfriend \u0026 my dish was quite big so since the table next to us was empty, our waitress helped push the table closer to us so we have a little room for our dishes and food,how nice of them! \n\nFor appetizer, we got a BBQ Squid - a rather simple dish but overall, pretty good and tasty. Lunch, My boyfriend got a Chicken Noodle Bowl and it was a pretty big  bowl of noodle soup with eggplant, udon noodles, chicken and other vegetables, very tasty and light! I loved it.\nI got a Salmon Teriyaki Combo box, it came with an assortment of food and it was very good, that I finished almost the whole darn thing.  Gosh I'm a pig.\n\nI am totally coming back here! Top-Notch Babyyy!", "author": "Jessica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-14", "description": "My friend and I ordered take out from here a couple nights ago. We both loved it! I think you get what you pay for and the quality of the dishes we bought were superb. Definitely a must try for those in the area. Very friendly staff too.", "author": "Lindsay C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-02", "description": "The portion sizes are obscene... in the best sense of the word. Friends took me here, and I was blown away by the taste and value of the sushi! \nNow, if you're a sushi purest, you might not agree with me. In that case, stick to the sashimi or traditional sushi section of the menu. \nBut if you're into genius flavor combinations, and want to fill up on sushi, this is your place. \nOishi!", "author": "Kat H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-24", "description": "a lot of yummy food for a reasonable price.  friendly attentive service.  whats not to like?", "author": "Nathan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "I've been meaning to update my review of Iron Chef for about 2 years now. Mea culpa, mea culpa.\n\nIron Chef is a cozy little Japanese restaurant/sushi bar located near the heart of Brooklyn Heights. After experiencing all of the sushi restaurants within a 10 block radius of my home, I must say that Iron Chef House has now become my favorite sushi joint in B Heights. After switching to brown rice sushi, I have found that nobody else makes brown rice as well as they do. It's fresh, fluffy, and obviously not made in a microwave.\n\nOften I go to ICH for their Saturday lunch special to enjoy a peaceful, cheap meal of yummy sushi. Their lunch special is 2 rolls for $7.95 which comes with soup and salad. Brown rice costs $1 extra per roll. My favorites are their spicy tuna roll, the Rising Sun roll (eel roll topped with salmon and cavier), spicy salmon roll and any other special roll combos. I think they excel with rolls more than they do with nigiri or sashimi but that is just my opinion. I also love their miso soup but it's hard to screw that one up. Plating is always nicely presented and service is attentive. ICH also has a nice sake list which is decently priced for the money conscious drinker.\n\nIf you do go for dinner, please note that the environment becomes completely different as it can be extremely crowded and LOUD on a Friday/Saturday night. This past weekend was no exception as my friend and I snagged the last table available and saw a line of people waiting outside to get into this little place. Prepare to have people practically on top of you on either side as they are trying to fit in as many tables as possible.\n\nOne of these days I need to throw all caution to the wind and order the Sakura Roll (spicy tuna and salmon roll, topped with king crab meat) and the Special Lobster Roll (spicy lobster, crunchy flakes and avocado on top). Yummy.", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-13", "description": "Generous portions. Nice ambience. Clean bathroom.\n\nService was fine though we had to ask the waitress several times to be seated. Once seated things moved great.\n\nI am not a fine taster of sushi, so all I can say was that the salmon, tuna, and spicy tuna all tasted different. And I was full on the Triple Roll option 3x8 pieces for $12).", "author": "Jason H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-26", "description": "What a cute little place, I can't and won't comment on the sushi. I will however talk about the spicy seafood soup that was really good. The broth had tons of flavor and a good amount of heat. It had all kind of seafood in it as well as celery. I also had a bottle of the un-filtered sake that had hints of coconut.\n\nOverall a fun place with yummy soup\u0026sake.", "author": "Christopher C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-03", "description": "Great place. Great service! Everything was amazing. We ordered hot sake, soups, the spicy sushi combo and the monkey. Defiantly take the Monkey.", "author": "Moran A."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}