{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-07", "description": "Gave this place several chances.  Always have either experienced delays or mistakes with food.  Consistently the worst service I've ever experienced in a sushi restaurant.", "author": "Bipin S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-08", "description": "Iron Chef House has been a main go-to for us since I started working in the area. I've always really liked their tuna teriyaki--good portion size, good quality, tasted quite good, and for a great price you also got a soup and salad.\n\nWell, I don't know what happened, but they overhauled their menu and everything kind of went to shit. The price of the tuna teriyaki increased by around $1--about 20%. No more salad, just soup. The portion I got was tiny and the quality was really mediocre--it was dry, overcooked, and just wasn't that good.\n\nMy coworker got a combination box, and they didn't slice his roll! The waiter brought him a knife, but have you ever tried slicing a sushi roll with a serrated knife? It's near impossible.\n\nHonestly, I don't think I'll be going back. This experience was beyond disappointing.", "author": "Dylan K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-11", "description": "I wish I still had jury duty so I can go to Iron Chef House for lunch again! \n\nI had the 3 roll lunch special, $11, at Iron Chef House. This 3 roll lunch special is served with the lightest and yummiest miso soup I ever had and with a nice sized side salad too. \n\nI picked the salmon skin roll, spicy tuna roll and the eel avocado roll. The salmon skin roll was the best salmon skin roll I ever had. Most of the time I don't like to order the salmon skin roll because it's too soggy and not crisp enough. The salmon skin was freshly crisped up at Iron Chef House. It was the most memorable lunch I had near the Brooklyn Federal Courthouse. \n\nIt's actually diagonally across the 2,3 subway train station on Clark Street.\n\nNow I have to figure out if I can take a train to Clark Street, get back in time during my one hour lunch. I think I am going to try one day!! Yeah, it was that good!\n\n...my jury duty lunch adventures continue...", "author": "Sally W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-15", "description": "More like a 3.5 but will round up on this one. \n\nHad dinner here and got the following:\n\n-Spicy Seafood Soup $5.25\n-Monkey Roll $10.95\n-Crazy Dragon Roll $9.25\n-Brooklyn Roll $12\n\nThe soup was delicious with a variety of seafood and a generous portion. It also had a great kick to it.\n\nThe fish in the rolls was good and fresh, but I was not a fan of the sauces. They took away from the fish. I wish I got sashimi or nigiri with no sauce. Maybe next time.", "author": "Tim R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-02", "description": "This place is known for their monkey rolls and it was the BEST ROLL I HAVE EVER HAD. Tried the sushi deluxe platter and was utterly disappointed. Dry fish, dry rice. And I know my sushi. From what I saw, the rest of the rolls looked on point. If you go here, just get rolls.", "author": "Joan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-16", "description": "I ordered take out from here after a long day, I walked in ordered and literally had my food in hand 10 minutes later. The staff were very friendly. The sushi was exceptionally fresh and the gyoza dumplings had actual pieces of shrimp inside. I would definitely return next time I'm in Brooklyn.", "author": "MJ E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-15", "description": "This was great! I came here with two of my coworkers for the lunch specials. It was late and I was REALLY hungry, so I got the sashimi +sushi plate with an extra eel roll, with brown rice. \n\nIt was amazing! I loved the freshness. You know that one \"meh\" sashimi piece one always gets from lower priced sushi joints? That didn't happen. \n\nI also wanted to eat the leftovers from both of my coworkers AFTER I finished my food...which either means I am a total pig or this place is really good. I am going to just give this place 5 stars and hope that it was the latter...", "author": "Diya L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-10", "description": "Hungry? This is the place to go and satisfies greatly! It is close to the train station too. I ordered the seafood curry udon and sweet potato tempora roll. The curry was described to me by my waiter John as spicy as spicy mayo. It gave me the confidence to try it since i only take mild spicy. I really enjoyed the soup. It was creamy and just the amount of spicy i liked. The sweet potato roll was what i expected. Why I give this place 5 stars was to top it off the service was amazing. They gave me a battery pack to charge my phone bc there was no room to put my outlet. I reccommend this place highly for being affortable, great food and great service!", "author": "Daryl T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-09", "description": "One of my favorite places in the entire world. Best service and best food. Service is always on top of anything I need. Food is always top notch. My favorite place for lunch or dinner. Such a gem. Will never stop coming :)", "author": "Sasha L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-19", "description": "It's such a tough spot to be to write this review. Sashimi game is so on point. And all of the entree's I've gotten (Seafood soup: best $5 dollar soup ever) + udon is good...but their rolls are lackluster. I've tried quite a few and everything tasted sort of bland and blah. \n\nBut great location and affordable sashimi. Can't beat that.", "author": "Michelle V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-27", "description": "First time ordering from Iron Chief House, never had much faith in sushi delivery but Iron Chief did an excellent job! Having had countless amazing sushis in Tokyo, my standards for sushi are quite high...thus, the sushis alone I will give a 3-star. However, the delivery is very fast and the delivery person was super sweet. The tempura and and duck roll are crispy and hot, miso soup and noodle are decent as well. Everything were well packaged; will order again!", "author": "Qoë D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-11", "description": "I absolutely love this place and it is one of my lunch favorites. Delivery is super fast and they are always accommodating, considering where I work. Their sushi is so delicious, particularly the monkey roll which has become my favorite. They have so many meal options that I sometimes have a difficult time deciding, but beside the sushi, my second favorite is the salmon meal with udon noodles. The portions are colossal, but the taste is still very present. I love this little gem!", "author": "Janice W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-18", "description": "I've been in this area for about 2 years now and just now discovered this hidden gem! Everything we tried here is delicious. The servers are very friendly and attentive. I definitely recommend this place for anyone looking for their sushi/ramen fill.", "author": "Christy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-06", "description": "Following a Saturday afternoon of poetry and prose in Brooklyn Heights, as the Power of One I came here to be immersed in Sashimi $17.00 and steamed pork Gyoza $4.75 with the culmination of one Plum Wine $6.00 of a moving, inspiring poetic performance. Staff is attentive but appears very disgruntled, overworked and underpaid with a extremely weary look.  A café size restaurant intimate small but produces good quality sushi and Sashimi that is fresh to eat my fill.  Assorted Sashimi regular platter comprises of a choice of soup or salad. Choice of hot Green Tea or water is offered. My hot Green tea was invigorating to the senses with fresh loose tea leaves rather from a standard mass produced tea bag.  Atmosphere is very dim and the ceiling lightening fixture captures one's attention as art which surrounds the company banner logo.  The business name originates from the popular Japanese competitive cooking TV show 料 理 の 鉄人 Ryōri no Tetsujin (\"Ironmen of Cooking\") to bring the Japanese cooking spirit to Brooklyn Heights.  The sushi bar is openly visible with four men behind the counter rolling, cutting and attentively crafting sushi or Sashimi edible art.\n\nNote:  Staff are Mandarin Chinese but do not allow it to deter you from merriment of good quality Japanese cuisine and libation.  No business cards are available but takeout menus exist.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-11", "description": "Consistently fresh and tasty sushi and sashimi served by pleasant helpful waitstaff. House special fish soup is a favorite of ours too as are the cooked entrees.", "author": "Suzanne M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-06", "description": "This would've been 5 star if the rice to fish portion was great. The fish portion is a somewhat too little. Other than that this place is amazing! The special sushi are great, even their miso ramen is well made! There service is also very great! Our tea was never left empty for too long! \n\nDefinitely recommend! Special if you want sushi after jury duty!", "author": "Guy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-18", "description": "Found Iron Chef through the 4-star yelp rating which set my expectations high. And although the service was great,  the food was just \"good.\"  It's a hole in wall spot that has decent sushi and reasonable prices--nothing to rave over. A definite strong 3-star and good place for take out but no where near a 4 (or somewhere to convene a work meal after a rewarding day).", "author": "Nancy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-11", "description": "I had jury duty around the corner for 2 week (yeah thats right TWO WEEKS) and ended up eating here multiple times. \n\nIt is average in terms of price and quality and has great lunch specials. The sushi is fresh and you get a lot of stuff with the lunch combo deals (rice, noodles, salad, spring roll etc). \n\nIt was fairly busy around lunch - it seems I am not the only one taking advantage of the specials - but I always had a seat and quick service.", "author": "Jennifer S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-01", "description": "I'm knocking this down from previous review of 5 stars from 18 months ago. The service, food, and even the sanitary rating (B) have all taken a dive.\n\nStill a cosy little neighborhood spot for dinner but not nearly as great as it used to be - seems that I'm not the only one thinking so as is nowhere near as busy as it used to be. So unfortunate.\n\nWill be looking for a new sushi go to nearby", "author": "Paul W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-20", "description": "Overpriced and mediocre. Go to Hibino instead. The spicy tuna roll isn't spicy, it's totally bland. The samon avocado roll is mush. It's unfortunate that when we let the restaurant know that the sushi did not live up to expectations, they were unreceptive and insinuated that our opinion is wrong because they've not received any complaints in 10 years.", "author": "Mary B."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}