{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-12", "description": "This is the best Japanese restaurant in the North Heights. Very fresh, well cleaned and prepared sushi. I'm eating mostly vegetarian now, so always order a couple of veg rolls and some edamame. \n\nThey make a sweet potato sushi that is truly heavenly. It has a crispy layer just inside the rice layer that adds texture and bite to the creamy potato beneath. And the avocado rolls are a good counterpoint. Very nice staff too. \n\nThe place is tiny and often crowded, so go early. It can be a bit claustrophobic if you are squeezed into a middle two top.", "author": "Bonnie M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-20", "description": "My boyfriend and I literally walked in to this restaurant about ten minutes after starting a conversation about what to grab for dinner. We were in Brooklyn for the weekend and were staying at the nearby Marriott so we really didn't have a clue where to go. We passed Iron Chef House and noticed it was PACKED. On a whim, we walked in, saw the pricing was good, and were seated within two minutes. Aside from some seriously rushed service, everything was outstanding. And honestly, once our orders were in, the hurried \"do you know what you want yet?\" attitude dissolved more into the \"let me clear that chopstick wrapper for you\" kind of vibe, which was nice. We collectively ordered:\n\nMiso soup\nVegetable Gyoza (dumplings)\nEdamame\nMonkey Roll\nShogun Roll\nSalmon Sashimi\n\nThe vegetable gyoza and edamame were fine, and exactly what you'd expect. The miso soup was actually some of the best I've ever had - it was a bit stronger in flavor than what I've gotten at most places, and just really good. Both sushi rolls were great; I prefer the Monkey Roll but I would definitely re-order both. What really stood out was the sashimi, oh my god...I decided to order it rather than sushi on rice and am so glad I did. It was two pieces of the thickest, freshest salmon - to the point where I got three bites out of each, which essentially makes it a roll in my opinion. The fish was cut exceptionally well, was chilled and NOT room temp, and had a wonderful flavor that was not \"fishy\" at all.  It gave me one of those idiotic permasmiles and honestly, thinking about it now is giving me cravings for Japanese for dinner.\n\nOverall, definitely recommend, and very glad to have randomly walked past it.", "author": "Mari C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-10-17", "description": "I went on a Friday evening with a few girlfriends. As soon as we sat down 4 different waiters came within 1 min time in between to ask if we were ready to order. Highly rude. Then once we ordered (after the 5th waiter came) it took them about 25 mins to bring us the food. They couldn't even do special sushi orders. Sad. The food mediocre given the time of wait. Only 1 of my friends like their meal... A lot. Overall probably won't come back. But it was a fun place to sit... For a long time.", "author": "Kimberly P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-07", "description": "Had the sushi and sashimi dinner. It came with miso soup. Can't go wrong. It is priced right as well", "author": "Joel W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-07", "description": "I won't say their sushi is super awesome, when you see a sushi restaurant is mostly famous for rolls, you know that it's Americanized and most of the time, non-Japanese own. I would highly recommend the spicy iron Chef sashimi appetizer and I think the lunch box is great for the $$ you pay", "author": "Micco W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-08-23", "description": "3.5 Stars. \n\nI was working in the Metrotech area and got really bored of Panera, Cafe Metro, and all the other lunch places in the area, so I decided to take a walk and give Iron Chef House a try. I'm happy that I did. It's a solid affordable lunch place minus the crowd from the courts and other businesses near the Marriott.\n\nThe salmon teriyaki lunch special was only $7.35, and it came with rice or noodles, soup, and salad. The meal could have been better. The teriyaki sauce was watery, which I think came from the steamed bed of veggies under the salmon. The salmon itself was a little overcooked, but then again, at less than $8, I don't expect too much. I chose the noodle option, expecting udon noodles, and was surprised when I found spaghetti noodles instead. Regardless, they were dressed in a tasty sesame sauce and perfectly cooked.\n\nAll in all, I would return. The service is fast, and the staff is friendly and polite. I called in my order for pick up, and after a 7 minute walk, my food was waiting for me. If it's a nice day, take the walk -  it is approximately 15 minutes from the courts and back, at a leisurely pace, and it's away from the hustle and bustle during lunch hour.", "author": "SukMon C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-17", "description": "Came here the other night for takeout to bring to Brooklyn Bridge Park for a little evening picnic. Me and my boyfriend ordered 4 rolls: the spicy veggie, the fancy spicy tuna, the monkey roll, and the 2008 roll. I don't usually even like shrimp, but the monkey roll was amazing. The veggie roll was good although I was wishing for some crunchy asparagus to balance the softness. I liked the texture of the 2008 roll (I think because of the multiple layers of rice paper), but the flavor was a bit bland. The spicy tuna was solid. We also got the Pork Shumai, which was delicious.\n\nLuckily we had four other people at our picnic, because these rolls were so rich and filling that we couldn't even come close to finishing them. Everything was packed beautifully and was easy to eat on our blanket.", "author": "Meredith F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-16", "description": "This place is so great!  Reasonable prices but really outstanding quality, plating and service.  Lots of unique menu options that I've never seen before.  Will definitely be back!", "author": "Andrea G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-09", "description": "It's a Friday night after work and this is my last weekends grabbing sushi with one of my close guy friend in NYC!! We always wanted to try sushi around Brooklyn but we failed.. Since we are spoiled with the food in Manhattan.. So we kinda ignored Brooklyn...\n\nSo after work.. We just went into Iron Chef since they have an A rating and also higher rating than Sushi Samba (which I heard they have good ratings but overprice).. hmm.. Looking at the menu.. The dinner set caught my eyes on it... My guy friend said he is gonna order that... As for me.. I don't like to order the same thing as my friend does.. I love to order something different and just grab a bite of my friends portion.. (so you can have more variety right??) So.. I look at their special sushi which cost about $10.. I am hesitating whether or not I should order it as for the dinner combo is only $17 with soup, noodles, xiumai.. and you are able to choose sushi, sashimi.. and a few more which I don't remember... As I said I don't like to order what my friend does.. I look at the other specialty.. The sushi and sashimi combo caught my eyes but I am afraid I can't finish it!!! \"You are not gonna be full with just a special roll..!!!\" that's what my guy friend told me... As I remember I can eat a lot of sushi when I was in Malaysia.. hmm... so I finally make up my mind in ordering the sushi and sashimi combo.. It also comes with a bowl of salad..\n\nSalad.. the greens that they used are fresh and the dressing is really special as I can feel that the salad dressing and the greens are blending together and the \"freshness\" just went into my mouth.. The miso soup that my guy friend had looks pretty good.. I can't comment on it since I did not try it.. As for the sashimi and sushi that I ordered.. The sashimi is really fresh and clean.. Since it's raw.. So I am really picky on it.. They are really generous in their sashimi as you can taste the fish.. where some of the restaurant will just give you a tiny little bit of sashimi since it's expensive.. The sushi is pretty normal but it's really huge and I can't finish it.. As for my friends dinner combo.. The xiumai tasted really bad.. I think they just bought it from some cheap asian store and just steam it.. :S Other than that.. It's pretty normal but the price is reasonable and if you come to think of the food and the dollar value.. This place is definitely the best sushi priced place!!! (Sorry for my bad English)\n\nAs you may wonder why do I give 4 stars instead of 5 stars. well.. Since the price is reasonable and the portion is huge.. The place is clean and the raw fish that they used are clean but it might not be in a good quality.. As I can feel it in my mouth.. (I guess it's because I had been to Hatsuhana where the raw fish they used are really fresh but it's way more expensive).. Well.. you can tell it right? I don't think they will price it that cheap if they are using the best quality fish!! \n\nOther than that.. I have to say this.. My guy friend claims that after this.. He lost his appetite the next day!! which I don't really believe it since I am totally fine.. (I guess I have a better \"system\" in my body.. :P)", "author": "Shing Yiing O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-30", "description": "I was skeptical about trying this place at first, because I never liked the taste of sushi. I ended up giving it a chance about a year ago, and I'm so glad I did! it was absolutely delicious and now I love sushi! \nThe 2010 roll and the monkey roll are my favorites, and I'm never disappointed.\nExtremely friendly staff and great environment. \nLove to go back as often as I can.", "author": "Bridget B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-26", "description": "i dined here with a huge party on a Saturday night and I have to say the service was impeccable.  I was a tiny bit worried how they would handle us but everything was great.  \n\nThe food was fantastic - a few things to note that really stood out:\n\nRaw beef appetizer - to die for!  almost ordered a 2nd portion but decided not to fill up\nYellowtail Jalapeno appetizer - outstanding!\nFresh Scallop Sashimi was served with a cucumber disc, a very nice touch.\n\ni would definitely go back if i were in the neighborhood.", "author": "mackenzie a."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-08", "description": "I hesitate to review a place after only stopping in for an app but it was a hell of an app. Name tuna with avo, shaved almond, mustard sauce and mango gets my highest recommendation. This among the top places I have found in the dumbo/ bk heights area since getting a job here and I will certainly be back for a full meal. The beer selection is standard Japanese flavorless stuff, Hitachino would be a nice addition but no restaurant is perfect.", "author": "Ross W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-11", "description": "i absofuckinglutly love this place. I have been to many sushi spots in NYC and this one is by far one of my favorite. The prices are very reasonable and the cocktails are not to expensive considering the area it is located. If your ever in Dumbo and craving some awesome sushi make sure to stumble upon this place. OHH and make sure to order the Monkey Roll :p", "author": "Jairo M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-11", "description": "There is a reason that I regularly opt to stay in and watch Law and Order instead of going out to some hot restaurant with my friends.That reason is Iron Chef House. \n\nWhy? \n\nIt could be the amazing prices. Or maybe the outstanding house rolls (ahem...the monkey roll is to die for, not to mention a major diet-breaker). Or possibly the generous portions. Or even the super-speedy delivery.\n\nWhatever it is, one thing is for sure: I'd rather sit at home with Benson, Stabler, and Iron Chef take-out than at an all-expenses-paid dinner at Nobu.", "author": "Daniella M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-02", "description": "Absolute favorite Japanese restaurant.\n\nCozy little place with excellent service and excellent food. It can be a bit pricey but I always think it's worth it.\n\nThey close in the middle of the day between lunch and dinner time which is odd but not a big deal so just plan accordingly.\n\nTheir service is great, the staff is very knowledgeable of the specials and the dishes offered regularly. They are nice, patient and know how to do their job. I haven't been there during an extremely busy time yet so I can't say anything about how they are then, but the countless number of times that I've gone, I have been met with excellent service.\n\nTheir food is just amazing. You have to HAVE TO HAVE TO try the Monkey Roll (shrimp tempura with three blend spicy sauce) and the lobster roll, both amazing. You also need to try the grilled rice balls (filled with pork and bonito flakes). I have yet to try any of the entrees other than the chicken teriyaki (which was okay) as I made it a mission to try all the specialty rolls first. But will update once I go again and try a few entrees.", "author": "Andrew O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-22", "description": "This is the best sushi in Brooklyn Heights, or Brooklyn for that matter. The food is always fresh with new and fun special rolls. The service is top notch and its an absolute pleasure to dine in and a breeze to order delivery. \n\nI loved their sister restaurant Jpan in park slope and was so excited to hear they were affiliated. ORDER THE MONKEY ROLL, you will not be disappointed. The Lotus root appetizer is also delicious!\n\nAn even better perk: they do lunch specials on Saturday 12-4. \n\nBe a good Brooklyner and support Iron Chef! It will love you back!", "author": "Jen F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-11", "description": "i come here once a week to get my sashimi fix\n\nfish is fresh and you get 12 pieces of sashimi in the regular order for 16 dollars! last night i went back and actually had 14 pieces for the same price. :D\n\nmy bf and i were starving yesterday so we had the seaweed salad, fried duck roll, he had the bento box (17 dollars for salad, dumplings, soup, and 2 mains! he chose the sashimi and tempura combo)..wait we also had the sashimi regular (because i must have my own order) AND a nigori sake. happy fatties. \n\nstaff is friendly nand always recommending specials.\n\nthe tables around us all order really pretty rolls but i'm on a low carb diet and prefer straight up fish but i hear good things about their lobster roll.", "author": "Tiffany L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-09-29", "description": "Best sushi I've had in the area. Reasonably priced and every piece we had was delicious. The chefs place all the sushi in a decorative way on the plate and take special care in creating the rolls and sushi pieces. We live in Manhattan so we will come back to Brooklyn just for this restaurant!", "author": "Lucky S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-22", "description": "My top 5 sushi places in New York right now. Great price for lots of quality sushi. Will definitely be back again soon!", "author": "Steph M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-19", "description": "The fish is so fresh and tasty.  Rice is fresh and well done.  The rolls are all nice, but don't waste your time... Go for sashimi and sushi.  Also tried the curry udon.  It is coconut curry; spicy with tons of seafood.  Really nice.", "author": "vanessa t."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}