{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2006-09-27", "description": "I used to have a weekly rehearsal right down the street from here and we would often stop in at Iron Chef House for an after-practice bite. The staff loved us, so much so that certain members of the group got to create new rolls and name them. I didn't attend the evening meals half as much as everyone else though, so I never got to name a roll, but J's Monkey roll is one that lives on in infamy. Shrimp tempura and a spicy sauce were components of it and it was very, very tasty. \n\nThe fish always seems fresh here and the staff is the best. Very hospitable and always welcoming.", "author": "Christy V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-30", "description": "i've come here multiple times since the first. always delicious and doesn't break the bank.\nnew favorite: curry udon, fantastic.", "author": "X Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-26", "description": "Simply amazing!!! Everytime I've gone here they were dead on. The food was cooked perfect and awesome taste. Service was quick enough to run over for lunch from downtown Manhattan and back in an hour's time. Can't say enough about this great establishment.", "author": "Wittle Joey C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-09-23", "description": "I'm not as hot on this as Henry B., but this is definitely very good.  (That's what three stars is for me...four is excellent and five is spectacular).  I wouldn't call it amazing x 4, but rather very good. The rolls are extremely creative and unique.  You'll find variations you don't see everywhere else.  In the case of some of them though, there's just too much going on. \n\nThe seared yellowtail platter is a delicious appetizer with ginger, garlic and a lemon/ponzu sauce.  Yummy. Also surprisingly good is the eel fried rice.  \n\nThe fish, overall was extremely fresh.  If you are particular about the sushi rice, however, this was average in my opinion -- somewhat too overcooked (mushy rather than the optimum sticky but each grain still maintains its integrity) and it also was lacking the traditional rice wine vinegar, which is part of what I love about the plain sushi experience.   Tuna sashimi was excellent.  \n\nThe environment is adorable, comfortable, social and modern. A great neighborhood place if you live nearby or find yourself in the area and craving sushi.  If you're going out in DUMBO, say, and you want sushi...go here.  Do NOT go to the Miso place in DUMBO...it's gross.\n\nSo, my review amounts to: go here if you're in the area and want a great vibe, creative and unique rolls and fresh fish.  If you're looking for impeccable quality of ingredients and preparation other than the fish alone, you can do better in this sushi mecca that is NYC.", "author": "Stephanie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-24", "description": "I'll tell you what's good here are the vegetarian sushi rolls.  For those veggies who are sick of the standard cucumber and avocado roll while their friends chow down on exotic raw fish dishes, this place is a godsend.  Sweet potato tempura rolls, marinated tofu folls, asparagus, and spicy mixed vegetable are some of my favorite.\n\nAlso... Why isn't Green Tea Ice Cream more popular?  I would totally buy that sh!t from a Mister Softee Truck.", "author": "Ernest F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-02-13", "description": "Sushi is always the best quality and super fresh! Easily the best sushi place in Brooklyn Heights. Very reasonable prices.", "author": "Devon A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-03-30", "description": "I haven't had an OMG Takeout Sushi night since Robongi in Hoboken (check out my past reviews) Enter a night in Brooklyn Heights for Gossip Girl and wine and a quick take out is due. This place is right next to my friends apartment and he RAVED about it. \n\nI went with the Sushi dinner which was more than enough. And fresh? Fresh doesn't describe it. Mouth watering best sushi I've had in a long time.\n\nAs I can't rate the service, the take out was QUICK. 10 minutes and we were good to go. Impressive for a busy Japanese restaurant in the heart of BK Heights.", "author": "Kristin M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-15", "description": "Great spot for good sushi. The rolls are creative and there are so many options on the menu that even if you don't like sushi, you can still dine there. I'm a fan of the tuna dumpling which is basically avocado, crabmeat and crispy panko flakes wrapped inside of fresh tuna (not your typical dumpling). My friends enjoyed the monkey roll and I really liked my NY roll. Can't wait to go back.", "author": "Alka J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-10-18", "description": "Best sushi! Great price, great ambiance. Unfortunately, it's soo far away from me.. sigh! *I'm in San Francisco Bay Area*\n\nMy friend introduced me to this place 2 years ago. Back then, I thought.. man, this is the best sushi I've ever tasted (I've tried some in LA and SF). Now 2 years later, after trying more sushi places in Bay Area, I still stand firm on my previous statement. Cannot believe they don't charge more for the food.\n\nI love their monkey, spring, and 2005 rolls and.. I think it's called hard rock rolls. Their yellow tail and tuna appetizers are good too.", "author": "Poof S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-19", "description": "I had dinner there last week for the first time because of the Yelp 4 stars rating.  The appetizer was unique. Even though the dressing was tasty, but it covered the natural sushi flavor.  I am a sushi lover and I was disappointed at the sushi...for the 1st time, we did not finish our sushi.  The taro was not fresh at all. I will not return.", "author": "K C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-08", "description": "Just begin your experience by ordering the spicy tuna roll, it is fantastic! The wait staff are very attentive! I must try the dragoon roll on my next visit. The dining area is a little small but the size of the space adds to the overall charm.", "author": "William C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-24", "description": "Iron Chef was my first sushi addiction : )   \nThe decor is clean and unique, with a great ambiance.  The servers are always friendly and accomidating, and will be very honest about what is the most fresh and tasty fish.  I feel like the more often you go there, the larger some of the rolls get, which is always a plus in my book.  Cooked food here is very good too- They serve the standards but they serve them with a consistent quality that is hard to find.  Overall I give it a big thumbs up, though the wait is often 30-60 mins on a weekend (less in the summer months).", "author": "Christina O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-10-08", "description": "I'm writing this while sitting on the toilet - that's how strongly I feel about giving this place a bad review. Maybe it's my own fault for ordering the sea urchin. That aside, the rest of the sushi was still atrocious. The rice was packed solid and it was like chewing gum. The fish was not fresh (on a thursday night). \n\nI don't understand the hype. Maybe it's just one of those places people in the neighborhood feel like they should support. \n\nWhile waiting for the bathroom, I also witnessed one of the sushi \"chefs\" sneezing and hacking all over the food, which made me feel even better about this place. Spend your money elsewhere even if you think iron chef sushi is good value.", "author": "Ack J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-11", "description": "Great lunch specials and nice ambiance! The rolls are super fresh and a good sized portion. I thought they would be tiny like any other lunch special roll, but they are eight yummy pieces each. The spicy rolls are actually not mayo based, so if you are ordering those, then just be aware of that. If you have a regular sized appetite, two rolls is more than enough. The salad is also nice, but the lettuce could be cut up a little better. The miso soup is extremely tasty too. I am not even a miso soup fan, I find it usually bland, but this had a little citrus kick to it. Definitely worth coming here for your lunch sushi fix if you are in the area!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-26", "description": "Good rolls, creative and very good.  \n\nRoti roll (basically a deep fried roll) and the hana roll are my favorites", "author": "Adam B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-20", "description": "We found this place randomly after taking skyline pics from the promenade. We were able to get last minute reservation on a Sunday night. The place was filled with happy customers. Really good fresh fish sushi. We ordered the triple fish sushi platter, several rolls, mushroom soup, and wine. For 3, the total was $92! Such great food and great service (joileen) and affordable! Wow", "author": "Shira S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "I have been going here for 12 years. It's amazing. Just go. Order anything. You won't regret it.", "author": "Brian B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-11", "description": "You're crazy if you don't give this place 5 stars.  Iron Chef House serves up the best sushi I've had since moving to New York.  I was hesitant to write this review because I didn't want it to get too crowded.  But, sushi lovers need to know about this place.  I recommend the 2011 roll if you like lobster.  I also recommend Hard Rock, Hana, Spicy Yellow Dragon rolls. The Nabeyaki Udon is also one of my go-to orders.  Wash it all down with some ice cold Sapporo.  And that's how it's done! The place is relatively small, so I recommend calling ahead during peak hours.  Smaller parties are usually easier to accommodate.", "author": "Matt B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-17", "description": "My husband and I began our Tour of Asian Yum Yum weekend with Iron Chef House.  While not the best Sushi I've ever had, the food was tasty and service was attentive.  With the added bonus of reasonable pricing, I can see us revising the establishment and ordering for delivery.", "author": "Su S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-07", "description": "If you are looking for a quick delivery...this is your ticket. Ordered Teriyaki Chicken  and vegetable Tempura, flavors were great and fresh!", "author": "Alix L."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}