{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-09", "description": "Been ordering from here for a long time (10 years?). Eat in occasionally. Best sushi I've found in the neighborhood -- certainly the most consistent. Other local places are *sometimes* just as good as Iron Chef House, but then half the time their dishes are sub-par. Life's too short to eat average sushi...", "author": "Jason O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-17", "description": "WOW... WOW ... WOW.\n\nThis is place is most certainly WOW worthy. I came for lunch on Monday expecting a mediocre meal...and I left completely satisfied. First off... $6.75 for Salmon Teriyaki? Did I misread the price? I must've... Wait, what? That also includes a miso soup AND a salad? Alright, stop your games. \n\nShockingly though, Iron Chef House wasn't playing games. Oh, yeah, I forgot they also serve that salmon teriyaki with a side of rice or noodles and over a bed of mixed veggies. Yeah, I know.. too good to be true. But wait, there's more... They didn't just give me a small piece of salmon, no, they gave me a whole salmon steak. How often is it that you get served a dinner + sized meal at lunch prices in Cobble Hill? Really? \n\nI'm still amazed by the portion to price ratio. But size doesn't matter... taste, presentation, service... they matter. (Ha, who am I kidding - size is pretty important too!) The food not only was a ridiculous amount, but it tasted great too. The salmon teriyaki wasn't drowning in sauce and furthermore the salmon wasn't overcooked. The rice to sauce ratio was superb. The vegetables consisted of a nice assortment of asparagus, squash, carrots, broccoli, and celery. The salad's ginger dressing wasn't watery and the greens were fresh and crisp. The miso soup had chunks of tofu... \n\n... this is exactly the lunch spot I was searching for when my company shipped me off to Downtown Brooklyn this past summer. I almost don't want to post this review in fear that my new favorite hot spot will be overrun by mangy hipsters. Please don't overrun it... I beg this of you, whomever you may be...\n\nWOW.", "author": "Heather S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-18", "description": "I live near this place.  There are three sushi places 30 seconds from each other.  I recommend going to this one over the other two.  The place is small but I like the decor.  They have good specials, a nice selection of platters and very tasty sushi.  The service is quick but friendly.  I never tried Ozu but it currently has a B health rating right now.  For sushi restaurants, I recommend only going to A rated restaurants because they deal with raw fish.  Those are my two cents.  Try this place out.", "author": "Zachary D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-29", "description": "My sisters and cousin brought me here for my birthday. We ordered soooo many rolls. We ordered so many that I couldnt tell if I was eating the same roll twice in a row since they all looked similar. However, the sushi was very good! The presentation of the sushi is also very nice.\n\nIt's a small restaurant but good for small groups!", "author": "Jessie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-01-20", "description": "3.5, rounded up to 4 for a very special reason - Iron Chef House is single-handedly responsible for making me like raw fish. \n\nI used to be a simple \"sushi\" girl. I'd either get cali rolls or shrimp tempura. Basically, the fake sushi.\n\nI came here with a friend. Atmosphere is somewhat typical - low lighting, kind of modern asian looking. We sat down, she ordered a tuna appetizer with ponzo sauce, avocado, and mango. She got it. She told me to eat  it - and I did so, very hesitantly. I loved the thing!!! I get cravings for it all the time now. Also, when talking to a few friends in the neighborhood, oddly enough, it turns out they all get cravings for this dish. It really is special. A bit busy, but amazing.\n\nI've since come back several times and tried various sushis. They have all been for the most part, very good, with the exception of the scallop - it was pretty terrible and rubbery.\n\nA word of warning. Service here is almost invariably crap, especially when you come at lunch, when it's emptier. There are a few waitresses who literally will come back every 2 minutes to ask your order, and I've had to be bitchy to a couple of them so I had a second to look at the menu and have time to decide what I want.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-23", "description": "The rest of the food came quick. Only six small dumplings per tray. Miso soup was way too salty. Menu was too confusing for some at my table. Dumplings take at least 15-30 mins. Then our order was confused.", "author": "Henry F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-19", "description": "After having spent 6 weeks in Brooklyn, eating sushi essentially on a nightly basis, I died from mercury poisoning.\n\nBut before that happened, this restaurant proved to be the best sushi restaurant in Brooklyn. Even something as simple as the miso soup is just better. The Teriyaki steak is delicious if sushi is not your thing (why would you go there if that is the case)...\n\nThe top roll is the monkey roll. I mean, it has everything good about sushi in it. I wish I were eating it right now. But like I said. I'm dead.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-25", "description": "Pros:\nGenerous portions for the sushi and sashimi combination. I finished one and was stuffed! The best thing was the super white tuna. \n\nThe Monkey Roll Special roll was very delicious as well. Not too spicy but very delectable. \n\nThe vegetable gyoza had a nice crisp and the filling was delicious. \n\nCons:\nThe Tuna Tataki appetizer was mediocre and was swimming in the sauce. Also the tuna and fatty tuna this evening was so so. \n\nComments \nThe place has a nice atmosphere without getting too loud. The place fills up quickly so you might have to wait a few minutes. Definitely one of the highest quality sushi around.", "author": "Mark A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-07", "description": "Delicious, good price. Service can be strange, they're either never at your table or there every 5 seconds. Overall, a favorite spot for sushi, udon and teriyaki. Teriyaki sauce is awesome.", "author": "Danielle C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-13", "description": "We are regulars at Iron Chef House. We eat here 1x a week minimum, or order for delivery. I think the food is a 3 but the service and consistency makes the overall experience a 4. It doesn't compare to top sushi places in the city, but more than holds its own as a neighborhood joint and the prices reflect this. We usually order the chef's squid salad, the shrimp gyoza, the shrimp udon noodle soup and spicy tuna rolls which are amongst their most consistently delicious items. For some of the hot items quality is MUCH better when eaten in the restaurant but that's to be expected. A shout out to Alice who is always greets us with sincere enthusiasm- she is a huge asset to the business.", "author": "Molly P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-22", "description": "The sushi here is fresh and delicious. Their specialty rolls are awesome. I always get the seafood udon which comes with a boat load of seafood in a coconut curry based broth. The servers are accommodating, but the restaurant itself is a bit small.", "author": "Melanie T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-04-08", "description": "The seafood special soup was fantastic.  Other than that, I was not overly impressed by anything else we ate.  The place is tiny and service is pretty good.  I'm guessing there's a shortage of sushi joints in the area....lack of comparison is the only reason I could muster giving this place a 4 star rating.", "author": "Chris S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-23", "description": "The four stars I'm giving Iron Chef House belongs almost solely to their monkey roll. I've both eaten here and gotten takeout a number of times. The food is fine -- really, the usual assortment of sushi and rolls. But the fried shrimp, avocado and saucy rice roll they call the Monkey is fantastic. I can't  get enough of them. Oooo! Ooooo! Aaaaah! Aaaaah! Pass the Monkey, please.", "author": "Nathan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-21", "description": "Order something off every part of the menu -- appetizers, salads, sushi and hot appetizer/entree. SO DELICIOUS. Even save room for some fried ice cream.\n\nthe wait is daunting", "author": "Sara H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-12", "description": "Love this place. I've been going there since they opened. They look out with extras all the time and change their specials on a regular basis. Its the best in the neighborhood. They will customize the rolls if your sensitive to shell fish like I am. Also if your going on a Friday, make reservations, because the place gets packed.", "author": "David I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-03", "description": "Build up an appetite by taking a walk over the Bridge and head to Iron Chef House. Incredible portions, fresh seafood, and good service. You won't forget this place after your first visit. It's worth checking out. Seating seems easier in the afternoon.", "author": "AJ V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-04", "description": "Iron Chef is always a great experience. \n\nEverything on the menu is delicious. Their fish is always fresh, and they have new specials every week. My recommendation is have your waitress pick everything for you. Their staff will ask you the kinds of fish you like and really try to understand your pallet. I guarantee they will find exactly what you like. \n\nI only deal with Allison who is a waitress at Iron Chef. She is remarkable, and the friendliest person. If I tell her I'm in the mood for Tuna, she will not bring me out a regular plain tuna roll. What I would see on my plate would be something that looks amazing and tastes amazing. \n\nWhat I love here: Seafood soup or Spicy lobster soup. The Roti roll, and the hardrock roll. \n\nAlways a five star experience.", "author": "Gabriel G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-21", "description": "Wow. Jackie, Jackie, Jackie. You need to get out of the service industry. I adore this restaurant and am very sad to give such a poor review, based on the amazingly rude service of one server. Things I love: cheap yellowtail that melts in my mouth. Things I don't: a server who tells me I have half an hour to order because they are closing soon, then raps the table and leaves without so much as looking at me. Also not a fan of being checked on 2 minutes later with a brusque \"You ready?\" \u0026 then again a minute after that. Some other behavior I wouldn't endorse, should a server be looking for a tip: checking on whether I've signed my bill 5 minutes before closing and when I haven't, says, \"sign that for me.\" What the what?! Who directs their customers like that? He came over shortly after that  and checked if i had signed-- ****by opening the check holder, and when he saw i hadn't, flipped it shut and walked away without looking at me or saying anything!**\n\n His response to my gentle expression of dissatisfaction at being pushed through my meal was priceless: \"yeah, yeah, I get it.\"\n\nListen, I get that he wanted to get out as soon as they closed, and to be fair, I did come in a half hour before closing. But the dude expected me to be done and bill paid at 11pm sharp. I was treated as if my presence was a burden. Absolute worst service I've ever had.\n\nThe sushi rice tonight didn't taste like real sushi rice, either. Not tangy/sweet as it's supposed to be. Harumph.", "author": "Lisa R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-24", "description": "Just ordered delivery. And received a tray or slop. Awful.", "author": "Dick W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-12-03", "description": "This is my go-to sushi delivery place.  The people are super nice and fish is always good and fresh - which, sadly, you can't say for many places in the city.  The salmon, especially, is often melt in your mouth good.\nDon't get me wrong - this isn't special sushi. It's delivery sushi.  But for that it's pretty good.", "author": "Katie Z."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}