{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-25", "description": "Saturday night around 8:20 - made reservations for 2 because everyone said we needed them, but there were a couple of empty tables. We sat in a corner by the window. I knew this place was small, but I didn't realize how small! It's pretty tiny.\n\nServers are nice, but leave you alone most of the time. Service isn't really too quick, which is both good and bad. Even though there weren't a lot of people there, we waited quite a while, but on the other hand, it felt very casual. No rush.\n\nOur server made some recommendations according to our preferences, which was helpful.\n\nWe ended up getting:\n\nIron Chef Spicy - tuna, fresh scallop, avocado, caviar - caviar on top was great\n\nHana - salmon, tuna, eel, avocado topped with seared white tuna - this was delicious! The seared tuna was particularly fantastic\n\nAlso a spicy tuna roll, cucumber carrot roll, and a side of white rice.\n\nThey don't have a crazy variety of stuff and much of it is pretty run of the mill, but everything tasted great, seemed fresh, and was a pleasant experience. Would go back if I were around the neighborhood.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-28", "description": "This place is SO hit or miss. This evening was a total miss to the point I won't EVER order from them again. Warm food was cold and sushi was warm after waiting over an hour and a half for my order. Whoever sliced the fish was a damn butcher. The rolls were a mess. Talk about a waste of good tuna. It was like cat food. Absolutely disgusting. Go somewhere else.", "author": "Lisa G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-11", "description": "This place is a neighborhood favorite! Great to dine in and fast delivery for take out!", "author": "Maria G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-11", "description": "Probably one of the best places to eat sushi in Brooklyn. Prices are very reasonable. Also the ambiance is really nice.", "author": "Doruk Ö."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-02-19", "description": "I chose this place based on all the rave reviews, some are even by people I actually know, but was severely disappointed when we came here in September for a quick lunch.\n\nTwo words. FOOD POISONING.  \n\nThe grade letter \"B\" from the health department glaring on the front door should've been a warning sign but the three of us figured a B doesn't seem too bad so we went in anyway. \n\nHaving looked up the regulations later it's not the same as getting a B in school. You have to fail inspection on multiple occasions!!! Anyway, now I know. \n\nIf it wasn't for the food poisoning ALL THREE of us experienced only a few hours after dining there, I'd say the food is still just ok. Not sure why it's 4 stars over much better restaurants in the area. \n\nLet me qualify this review by stating that (1) I used to live in that neighborhood for several years so I have reasonable dining quality expectations for the area and this place was sub par (2) I've been eating Sushi and other raw foods for over 15 years now and this is my first food poisoning from any restaurant ever (3) it wasn't severe food poisoning but I suspect it's because I have a generally strong constitution for these things considering its my first one ever. \n\nI don't normally leave negative reviews but I feel like its imperative in this case and hopefully it'll force them to keep more sanitary conditions and to warn others who may have weaker stomachs!!! Mind you, we think ours wasn't even from the sushi but the miso soup.  Probably some sort of bacterial contamination in the kitchen or maybe inadequate refrigeration, who knows.", "author": "Lana A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-14", "description": "Found a staple in my food!  I decided to order here after seeing so many good reviews.  I ordered the miso soup (very good) and edamame (good as well).  I got more than half way through the spicy tuna roll when I discovered a staple on my roll.  I'm lucky I was paying attention and not just dunking the roll into the soy sauce without paying attention.  I called the restaurant and they offered me a credit for a roll and an appetizer with my next order.  But I don't think I'll ever order food from there again.  Yikes!!!!", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-24", "description": "Love this place.  It's my go to spot when I'm in a sushi kind of mood.  It's usually busy, yes, but it moves fast.  \n\nI agree with everyone that the monkey roll is where it's at!  I almost always order it although lately I've been trying new dishes and they are all also really, really good.  \n\nPrices are great, servers are fast and efficient.  Love it and really glad it's within walking distance from my place!", "author": "Monks C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-17", "description": "I orders the lunch special for $12.00. Got soup, salad and for the sushi your allowed to order three types of sushi. I ordered the spicy salmon and tuna, California roll and spicy crab along with something else. It was pretty good fresh but not the best I've had. I will order again for lunch one day but I also plan on visiting for dinner in the near future.", "author": "T H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-24", "description": "Unremarkable but not bad. Sushi rolls have too much rice \u0026 the fish could be fresher. Still, the service was fine.", "author": "Mira M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-21", "description": "Amazing local gem. I've been many times and haven't tried anything on the menu that wasn't delicious. The portions are more than fair. Bento boxes are big enough for two. I've enjoyed sushi and traditional dishes. The ingredients are fresh and not overly processed. The chef comes out sometimes and asks how the food is. Very pleasant service. The place is small and cozy. Be sure to get a reservation during busy times. The prices are very reasonable. Please keep it up!", "author": "Lina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-23", "description": "good service, attention to detail, fresh fish, at a good price. \n\nthis is everything you want for an inexpensive sushi meal!\n\nUpdate August 2017: Once again, some of the finest, freshest sushi from this little unassuming place. I've had better meals here than Blue Ribbon.", "author": "Roger A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-16", "description": "This is simply a good restaurant. It's probably my favorite place to go to in Brooklyn Heights area. \n\nI've been here for lunch and dinner multiple times with both my friends and my girlfriend. \n\nThe ambiance is pretty nice, the service great, and the overall atmosphere comfortable. While obviously japanese, the restaurant doesn't have too many frills. The old woman who runs this place is really nice(they are Chinese though) and the sushi actually tends to be fresh.\n\nThe restaurant tends to be packed at peak hours for good reason, locals have realized this is the go to place to eat even in an area with multiple japanese restaurants. As someone whose tried Ozu, Ani sushi, and a couple of the other sushi places near Iron Chef, I can say this is the best place for Japanese.\n\nTheir lunch combos are a ton of food and in terms of recommendations, you can't go wrong with the monkey roll.\n\nIron Chef is a neighborhood gem.", "author": "Dawei L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-27", "description": "Finally came here after wanting to try this place for the past 2 years! I came here on a Friday, made reservations for 9 and my date and I got seated right away. We got one appetizer to share (monster) I believe it's called and some hot sake to start off the night. We decided to get 3 special rolls ( monkey, 2011 \u0026 2015) and they were all so delicious!! I don't think I've had such great sushi in a long time. The service was great, the waitresses kept coming by to check up on us. I'll definitely come back here!", "author": "Itana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-28", "description": "Amazing sushi and very affordable. Everything was top notch here. We got 4 or 5 special rolls to split between 4 people and were very full. We were late for our reservations due to having a hard time finding parking (which might happen depending on when you come there). However, they were very nice and we got a table within 10 minutes of waiting there. The presentation of our sushi was very nicely done and everything was excellent. Do not remember the names of the rolls but from my experience all of the rolls are good and can't say a bad thing about any of them.", "author": "Julie A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-09-24", "description": "Iron Chef has superb quality for its price range. While I've had better sushi before, it was considerably more expensive, and not in such a pleasant laid back environment. Hands down, great fish. The lunch specials are fantastic deals also, and there are quite a few vegetarian options.", "author": "Josh B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-01", "description": "This is one of my all time favorite spots. \n\nThe bathrooms are very clean and well decorated.\n\nThe portions are very good, the food is fresh and the wait staff is very professional and nice. I have never had a bad meal here.\n\nOn the weekends it gets very crowded and noisy though around 6, go early or late if you want to avoid the dinner crowd. I prefer the corner tables, it blocks some of the noise when it gets busy.", "author": "Anna H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-22", "description": "The appetizers are AWESOME. 5/5 for the appetizers.\n\nThe sushi is OK. It's not nearly the best quality fish you can find in some other random sushi spots, but its not bad. It's ok.\n\nThe presentation was great, but the rolls themselves were nothing special. Also they use the fake cheap ginger. Meh.", "author": "Ilya M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-08", "description": "Sushi smushi.... Yes this place does standard sushi - but if you really want an experience that will take you're breathe away you have to try the following. ...\n\nStart- monster! Wow!\nNext - 2011 roll (lobster roll) delicious. Ask for more sauce on the side. \nVolcano - bring the fire!!! Crab and avo on fire. \nBanana roll - mind bending. \n\nThis is without a doubt the best value for money and flavor filled sushi experience in NYC. \n\nEasy commute as it's one stop from Wall Street on the 2/3 train. 60ft walk. \n\n$45 for two unbelievable \n\n\nService is always amazing friendly and delicious", "author": "Evan K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-19", "description": "MY FAVORITE SUSHI PLACE IN BROOKLYN!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Everything here is so delicious and yummy. The service is attentive, the rolls are DELICIOUS and the ambiance is very cozy! Love, Love, Love!!!!! My faves include: \n\n-BBQ Squid\n-Spicy crabmeat salad\n-Kirin Roll\n-Hard Rock Roll", "author": "Olga T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-08", "description": "Recently came for a late lunch with friends. We were local and found the info on Yelp.\n\nIt definitely met our standards. Good food, good service, and a good experience.\n\nThe only thing lacking was the restroom. It was hot there! lol", "author": "Chavon W."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}