{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-04-24", "description": "Let me start by saying that I used to love this place.  Love might even be an understatement.  For about an eighteen month period, my fiance and I ate or ordered in from Iron chef at least once a week, sometimes more.  Snowstorm causes the office to be closed the following day?  Put on your boots, we're trekking to Iron Chef in 10 inches of snow and enjoying $5 glasses of wine with ridiculously (sometimes dangerously) generous pours.  \nSomething happened though.  After a while, it seemed like a lot of the staff left and was replaced by people who just didn't seem to care.  We'd wait 10 minutes for soy sauce only to give up and just ask the table next to us if we can bum theirs.  Then another table would ask us for ours.  We also noticed the quality went down.  The rolls started getting mushy.  Unappetizingly so.  \nThe funny thing is, I also work in the neighborhood and my co-workers and I have come here a few times for lunch.  Lunch is still pretty good.  Good service, good sushi.  I told my fiance about this  and he agreed to give it another shot.  We ordered takeout for dinner.  Picked it up on time and ate it almost immediately after getting home.  I had to spit a piece of sushi into a napkin.  I don't know why there is such a discrepency between the quality of their lunch vs. the quality of their dinner.  I'll still go for lunch a few times a year if my co-workers or friends who work nearby want to go.  I went vegetarian eight months ago so I can no longer comment on the quality of their fish, but  their veggie rolls are very good.  Especially their spicy mixed veggie.  My fiance, however, is done.  In my opinion, Ozu and Tenda are much more consistent in their quality and service.", "author": "Ali S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-20", "description": "all this love for this place? \n\ni know the decor is nice but --come on, son...the emperor wears no clothes. hint: if a \"Japanese\" restaurant serves..\n\n1) Golden's yellow Yankee hotdog mustard with your goyoza or..\n2) comically HUGE display plates with your sauce drowned apps or..\n3) miso soup out the instant packet from Gristedes food mart..\n4) sushi that tastes like the rice came from leftover Chinese take-out..\n\n..you MAY be in a sub-par \"Chinese/Korean\" Japanese restaurant.\n\nWish it was good. This area needs some good sushi like a fat kid needs cake..", "author": "d l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-11", "description": "For the price you'll be hard pressed to find better sushi in Brooklyn. This place makes the mean spicy tuna roll and a wonderful shrimp tempura roll. The pieces of sashimi are cut slightly thicker than at other places, but the quality of the fish is excellent.", "author": "David D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-01-07", "description": "We've been there three times.  The first two times were a good experience but the third time was less than desirable.  We had reservations and had to wait outside in the cold while parties with no reservations waited inside.  We waited 25-30 mins to be seated with a reservation.  It took them forever to take our order, after they took the order of the party that was seated after us.  They brought my dinner guest's entree 20 mins before mine and never even noticed or apologized.  The food is still very good but the service was horrible.  I suggest going on a slow night.", "author": "Jennifer G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-17", "description": "consistently excellent. went for dinner in the past and more recently for lunch - orderd the box lunch. very fresh food and nice decor inside. i will return again.", "author": "J P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-29", "description": "By far, this was one of my best sushi experiences ever.\n\nIt's sometimes hard to compare sushi places because most average sushi is more or less the same, but at Iron Chef you get amazingly fresh and delicious sushi for an amazing deal.  My friend and I both got the sashimi lunch special recently.  $8.50!  I mean... seriously?!  The other time I was there I went with a few rolls and I loved every minute of it.\n\nThe place itself is also beautifully decorated, and I would rate their bathroom one of the nicest ever... which is sort of a weird compliment.  Be warned though, apparently girls don't have the same admiration for a urinal in a unisex bathroom.\n\nThe staff was friendly, although you might feel a little rushed if you go during lunch because the place definitely fills up quickly and they obviously don't want to keep people waiting for a seat.\n\nI would go back in a heartbeat and brings friends.", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-02", "description": "Ok, the food is good. Not the best sushi you can find in New York though. But the restaurant is terrible. We went for dinner last night. The place is a little smelly. The service is below standard. The menus are dirty and worn down. The waiters are rude and it takes forever for you to get what you ordered. When I asked the waitress that we've been waiting for our main course for 15 minutes, she said \"everyone is waiting for their food, sorry its' a little crazy tonight!\". And the restaurant was only 2/3 full! Additionally, there were too many mosquitos flying around us and our food and we were bitten several times by the mosquitos. Again we told one of the waitresses about it and she said \"I know, it's because the doors are open!\" These guys do not even know how to talk to their customers. I'll never go there again and would recommend you to only order to go if you want to try their food.", "author": "Payman R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-16", "description": "Everything I've had here has been wonderful. I LOVE their chirashi and sushi/sashimi meals. This place is actually priced more cheaply than I would expect for the quality. The salmon here is melt in your mouth delicious, which is my test for great sashimi. By far the best sushi place in the heights.", "author": "Sara S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-12", "description": "Oh Iron Chef - I remember when you were a pizza joint back in the day. Anyway, I love this place BUT... they seem to have a lil' mosquito problem in the summer and a gnat problem year round - fix that please? Once you get past that annoying feature (imagine yourself in an exotic land and get over it because...) the food is always awesome. Also, Alice is the best server on the planet - truly - get to know her, she is a party animal although one would never know she visits Vegas several times a year! Anyway, I like the shogun roll with crunch, am a big fan of the teriyaki chicken here, the avocado salad, any of their spicy fish dishes, and their chardonnay is good. You can't go wrong at The Chef.", "author": "Heather B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-22", "description": "I love iron chef house.  My boyfriend and I eat here at least once a week.  We most always order the special rolls.  The roti, sakura, chicago  and hard rock are all delicious.  Weve tried the udon as well and that is very tasty and fulfilling.  I would say there have only been maybe 2 times out of 50 that ive been there and felt the sushi wasnt super fresh.  Its most certainly my favorite sushi place yet and I highly recommend it!", "author": "emily m."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-06-02", "description": "This place is pretty disgusting actually, so I am a bit surprised by the ratings. Sushi Gallery on the same street, but closer to the subway is cheaper and way better. At the Iron Chef, the quality of the fish used for sushi and sashimi is quite low, as is the quality of the rice. moreover, the noodles taste like cheap chinese food from the cart. I've given them a few tries, and each time the food was on the low side of mediocre.", "author": "Allie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-01-06", "description": "I live just a block away and this is my favorite Japanese restaurant. Highly recommended is the white Tuna which is not available else where. If you have 3 or 4 people order their buffet style Sushi/Sashimi boat. Can't go wrong. Nice assortments and reasonably priced. The restaurant is somewhat small but intimate. \n\nReservation recommended especially for dinner. Can be very busy!", "author": "Michael l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-17", "description": "my sushi place - constantly crave it.  for some reason it seems to taste better when I eat at the restaurant versus delivery, but maybe that's b/c of the cool decor and plates and serving dishes.  Love their veggie rolls all the time (sweet potato and avocado) and spicy tuna.  Seaweed salad is good, but small.  But do NOT let them convince you to get the dinosaur egg appetizer.  Such a waste that was.  Gotta stick to what you know!!  The service is whatever and some speak English better than others...", "author": "Jessica H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-14", "description": "The best sushi restaurant in Brooklyn. They always have fresh and new rolls that make you return time and again. If you like eel please don't deprive yourself of their eel fried rice! It is an absolute must, the service is always impeccable and decor soothing to the eyes and palate.Don't  forget to order the Red bean fried ice cream for dessert.", "author": "Lea H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-28", "description": "Iron Chef House is good neighborhood sushi place that knows exactly how to make the best product at a certain price point.  It's not out of this world, but it's also not terrible, like the 2 other sushi possibilities in the immediate area.  This is consistently good fish at a reasonable price.", "author": "David G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-04-25", "description": "A great sushi joint....nice menu, new specials daily, cute and friendly service. Its always crowded and thats a good sign, meaning the fish is fresh", "author": "Michael A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-30", "description": "I am a new fan of this place. I usually go to other sushi places in Brooklyn but decided to try a new one. I went here the other night with a friend and we had a great dinner. I would recommend having the Love Boat (for 2 people). It's $45 and we even left a few pieces on the place (and I can usually eat a lot of sushi). It's chef's choice what is on the \"boat\" but the waitress asked us if we liked spicy or not and they brought out everything we liked. It came with a nice assortment of sushi, sashimi and a ginormous roll that was delicious. There is really only one reason I am giving it a 4 - we ordered an appetizer special called the \"sushi pizza\" and they forgot to bring it. We even asked our waitress twice when she took our order but they didn't charge us for it and honestly, I am glad we didn't get it. I was just curious what it would look like. I will definitely go back here and recommend it to friends in the area.", "author": "Jammy M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-30", "description": "our go to spot for sushi.  we've tried ki sushi which was good, but way more expensive.  iron chef is local, has a cute intimate atmosphere and friendly waitstaff, and the fish always tastes fresh.  we've tried a ton of different roles and the hard rock continues to be our favorite.  i so badly wish it were BYOB, and then it would be perfection.  regardless, we still go here about once a week.", "author": "Brenna G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-21", "description": "Their fish was well selected, fresh and melts-in your-mouth quality. Highlights were the Tuna Name (Seared tuna morsels with a maybe too sweet sauce, but still sublime; and an inventive \"sushi\" spring roll. Sashimi maybe a better bet than sushi here; next time I would try the chirashi. The best was wild-caught salmon sashimi--a special of the day, and not unreasonably expensive . The Curry Udon soup was tasty and satisfying but not superb. A white seaweed sushi was very good. They will make any rolls you request--we wanted a scallop roll: they made a simple one with avocado that was very good. A special \"Suge roll\" had perhaps a little too much going on as noted by another reviewer. We had to wait a bit outside on a Sunday evening. Its not a place to sit at the sushi bar and interact with the chefs--this is in my experience the best way to get the best cuts. They are visible but on a high platform,--there is no bar to sit at. All-in all, its more than the usual neighborhood place because of the quality of the fish.  The service was fine. Try the Tuna Name and look out for what Sashimi they have on special.", "author": "Michasiu B."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}