{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-06", "description": "Knocking this down from a 5 to a 3. Seems ownership, management, or something changed. Portions seem smaller, perhaps even a little sloppier. Cool neighborhood place. Always stop in when in the area. But something is amiss, and I think our visits will be less frequent.", "author": "Andrew B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-10", "description": "I suspect that this would pass for good Japanese cuisine in Canton, OH.  But in Brooklyn?  Try again.", "author": "Jonathan K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-21", "description": "After a long walk across the Brooklyn Bridge, I stopped by for some sushi here. I liked the decorations of this place. The food was average and did not stand out to me amongst the many sushi places that I have tried. Also, they didn't have some fishes that I wanted to order which was disappointing.", "author": "Jack S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-17", "description": "Absolutely best sushi in NY!!!!!! Always fresh, always delicious. I have been coming here for over 15 years, it never disappoints. Hot food is amazing as well. I recommend this place any time, but make reservations if you are trying to come in at a busy time. Sashimi, rolls, sushi, everything is great!!!", "author": "Boris F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-04", "description": "I can only speak for their delivery service, but it was top notch! Sushi and entrees for 4 people ordered around 2pm on a Saturday was prepared and delivered to our place on Tillary Street (normally a 10 minute walk away) in under half an hour!\n\nTheir menu is friendly to vegans, vegetarians, and people who don't even really like fish or sushi, which is great when eating in a group with varied tastes and diet restrictions.\n\nI ordered their Spicy Mixed Vegetables roll, Sweet Potato Roll, and Avocado Roll all made with brown rice, which they were happy to oblige. Three rolls filled a large box because each roll was cut into 10 pieces (instead of the normal 8) and was more than enough food for 2 meals, or one extremely hungry one!\n\nI was the only one in our group who did not order an entree, but they still gave us 4 miso soups which were warm, had big chunks of tofu and seaweed, and was not salty like many Japanese restaurants make it.", "author": "Stephanie S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "This is my very first yelp review and I'm giving it to the Iron Chef! Best place to go when you just get off Brooklyn Bridge and want something nice and cool.", "author": "Yiting Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-22", "description": "Some how I always find myself moving to different areas but one thing I need in my life is a sushi place that I can frequent. Sushi is fresh, people are nice, the prices are incredible, I'm a huge fan!", "author": "Sofia A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-04", "description": "The sushi apps and dessert are all delicious and taste fresh. \n\n As much as I love coming here the cramped space is a hassle when they're always so busy. Even if you make a reservation you come in and wait kind of on top of everyone else who's eating their meal while they sit you down. \n\nBeing a neighborhood staple sushi spot they really need to expand !!!!", "author": "Kayla D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-06", "description": "Love Iron Chef House! The service, ambiance, and of course the food are all amazing.  I've been a patron of this restaurant since I moved to NY and was lucky enough to live around the corner from this sushi hot spot - 9 years!  The sushi is consistently fresh, creative and delicious.  There's only space for about 20 people in the restaurant, but the decor is super fun and the wait staff are amazingly friendly and attentive.  I think they filled my water glass religiously (I drink a ton of water) throughout the night, never letting it get to more than half way gone.  Highly recommend for a great date spot, place to catch up with friends, good place to take visiting parents - basically an awesome spot for anyone who loves sushi!", "author": "Katie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-28", "description": "This place never fails me!  Very consistent with quality, service,  and the setting of the restaurant.  The spicy mix is to die for!", "author": "Tiff J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-22", "description": "My go to spot for sushi in the brooklyn area. Can't really go wrong with this place. Def recommend the tuna dumpling !", "author": "Leona L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-28", "description": "Sashimi and sushi combo lunch special for 11.50 with tax was A-OK but the portion left me hungry. Not a do-over for lunch but I would go back to try their specialty rolls.", "author": "Jenna S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-04", "description": "Strolled in here after I got sworn into the Second Department Courthouse around the corner, and was very pleasantly surprised.\n\nFood: The sushi selections were incredibly inventive. The miso soup was better than the typical store-bought stuff most places serve. We had a salad special, made up of tuna, eel and I think mango. Next we ordered a roll with lobster, salmon and yellowtail in a sauce of ginger and apple sauce. The fish was very fresh and delicious.\n\nService: The waitress spoke great English and was very helpful as we asked her what all the menu items were. The food came out quickly.\n\nAmbience: New age architecture inside - colorful and chic.\n\nBottom Line: Wonderfully fresh and inventive sushi in Brooklyn Heights.", "author": "Adam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "Generous portions and very well priced. Besides the value of it, it's really really good food/sushi. They close at about 3 and reopen for dinner, It would have been nice and convenient if they were open within those hours. I would definitely go back when I visit NYC again...", "author": "Nadia M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-11", "description": "I travel around the country to all the major cities and this place is always on the list when I'm in Brooklyn. The sushi and sashimi is always on point and the prices are very reasonable. The service is very good and I recommend getting there before the dinner rush.", "author": "Brendan M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-14", "description": "My chirashi had too many attempts at creativity going on to really appreciate the star of the dish, my fish.  All the too-sweet sauce got in the way of enjoying the actual flavor that is the point of a chirashi bowl. Also my shrimp was clearly frozen before and only partially thawed.", "author": "Misha T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-08", "description": "I love this place. The staff is wonderful even when they are very busy. The prices are very reasonable and the seafood is always fresh. I steer clear of the wacky rolls with a million ingredients and usually opt for classic sushi or sashimi. The miso soup is the best I ever had. The special appetizers on the board are also great. \nThis is a perfect date night kind of spot. \nOn Friday nights you will need a reservation. \nOr expect to wait over an hour for a table.", "author": "Bianca G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-15", "description": "Food was too sweet. The sushi was messy and it wasn't authentic Japanese. Will likely not come back.", "author": "Laura P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-14", "description": "This is a wonderful place with great food, service and decor.\n\nWe will definitely come back here, when in the area.", "author": "Alexander Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "Okay, so I know people in generally like to knock the Asian fusion and, let's face it, Chinese-run Japanese joints, but I've got to hand it to you, Iron Chef House knows how to do Asian fusion right. \n\nHere's the rundown of our menu selections for three people: \n\nIceland appetizer: Mostly a green-colored dish that doesn't look like it would be super flavorful, but don't be fooled. Sweet, savory, and perfectly balanced (white tuna and mango combination FTW).\nMonster appetizer: A mix of everything awesome. I detected mango, salmon, crabmeat and avocado. \nYellowtail cheek: The meat was fatty, succulent, and savory, with the perfect refreshing balsamic accompaniment. \nSapporo roll: Soft-shell crab with jalapeño and roe. Delicious.\nUni: I'm not even a big fan of uni, but this stuff was ridiculously fresh-tasting and buttery, like a sea foie.\n\nThe ocean roll was the only dish that I found a little bland, especially next to the other dishes. Also, the salmon sashimi features the biggest slices of salmon you've ever seen (I guess whether that's a pro or con is up to your discretion -- I love raw salmon, so no complaints here). \n\nBeing that I'm sort of a purist when it comes to sushi, I hesitate to award this place five stars, given that its cuisine seems more of a riff on sushi-based traditions. But I definitely got a good slap on the hand for entering the place with preconceived notions. I shall be returning.", "author": "Irene P."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}