{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-19", "description": "Everything in this restaurant is AMAZING. Stop reading this and go eat. And you will  enjoy. Peace.", "author": "Catherine D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-09-30", "description": "Good sushi place. I'd definitely go back. Price was right. Sushi was fresh - not the best quality but great for the price. You should also try their cooked food -- the cod is great.", "author": "Captain G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-12", "description": "I used to go to this place all the time, but recently they seem to be cutting back on the fish and bulking the rolls up with rice. I'm staring at the roll in front of me and feel a bit ripped off. It wasn't always like this.", "author": "m l."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-10-12", "description": "For Brooklyn heights this place is great. The sushi is always fresh and delicious, at times the rice is not perfect. I love the Osaka roll. Also the green tea ice cream and fried banana is bangin. The place has a great vibe, very comfortable, great waitresses and a local crowd.", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-01", "description": "I've been here twice and had great experiences both times. The love boat is fantastic and the thing to get - they pack on a lot of sushi for $20 per person and it's all the best, tastiest rolls and sashimi. The shrimp tempura roll is delicious. The crunchy spring roll appetizer was a tasty starter. The staff is very attentive and the lighting is great.", "author": "Debra F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-26", "description": "I fear that I will spend the rest of my life searching for sushi as good as that at Iron Chef House.  I used to live right around the corner from this cozy sushi shop and visiting here regularly was like getting my weekly sushi vitamins.  Although they do carry delicious nigiri that is always extremely fresh, the reason to come here is the taste explosion that results from their creative sushi rolls.  I have never found anything that danced such a tantalizing tango upon my palate.  Anything on their daily specials list can be expected to be fantastic.  There are unique sauces and creative additions like toppings of dried cranberry and crushed pecans, which sounds bizarre but actually is spectacular.  The seared hamachi is likely my favorite dish, but really so many make my mouth water as I sit here on the other side of the country basking in memories.  \nNot only do I love the meal, but the service is always warm and friendly.  Even now when my visits are reduced to twice a year, due to my relocation to California, instead of once a week the waitresses still greet me and ask about my new life out west and chat warmly. \nThis is the kind of place where I almost desire to give it a horrible review so that I could keep it a somewhat hidden treasure, but I suppose since I cannot visit it so much myself spreading the wealth is not such a bad idea.", "author": "Lindsay S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-11-06", "description": "This place was a very pleasant surprise. Prices are pretty darn good, $3-5.50 for a roll, and wonderful special rolls. We got the shrimp tempura roll, avocado roll, spicy tuna (as always), and their special which was a spicy lobster avocado roll at $13.50-a splurge but it was AWESOME! Next time I am in the area I will for sure go back. Good service and a nice atmosphere. Good for 2-4 people. Also good for dates.", "author": "Seth C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-28", "description": "This is a great go-to sushi place. Nothing crazy, and the prices are just right. I love their Monkey Roll. It's huge, so be prepared. The Green Roll is good too, a little funyky looking too, haha.", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-31", "description": "Tiny but accomodating, food is nothing to rave about, but still a nice atmosphere, decently priced...small bathrooms!!!", "author": "Jenna P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-12", "description": "Had I known about this place when I lived in Manhattan I would've either moved to Brooklyn or made the trek a lot sooner, instead of eating at Nobu when and if we were ever lucky enough to get a table or be able to afford it.  Now I can satisfy my cravings for sushi on the regular since I live across the street and eat here several times a week.  Indeed, I just got a take-out Bento Box lunch special today which comes with soup and sald for $10.05!  You can't beat that!  I must say, though, their seared yellow tail appetizer is melt in your mouth fantastic and my go-to dinner is either the dinner combination box for under $20 (which I can never finish no matter how hard I try) or the Monkey roll.  The wait-staff is always pleasant as are the chefs.  I can't believe a previous commenter said something about not getting thrown something for free after years of service.  At these prices, do you really need to?  You're getting a steal of a deal.  My husband and I regularly have lunch here together and our bill is always under $25 with the lunch specials.  Can't beat the price, the quality, or the coziness.  When we were thinking about moving we looked at each other and said:  can't live without Iron Chef House (or Mister Video next door).", "author": "Ann Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-15", "description": "I've been eating at the Iron Chef since it opened, replacing a truly awful, roach infested pizza place. Even though it's gotten more difficult to get a table, this has remained our family's local \"let's treat ourself\" restaurant. The prices are pretty average for a sushi place. I have never had the sushi, since i don't eat it, but i have heard nothing but great things, and I really enjoy the cooked food. They have a variety of tenpura, noodle and meat dishes. The food is presented beautifully, especially the sushi. The place itself is so cozy but modern. The chef's wife does different decorations for each season and holiday. The people are friendly and remember you when you come back. We love it.", "author": "Kaitlin F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-23", "description": "Utterly bang up job every time. Quality and meticulous arrangement is stirring and truly compelling. Miso soup and crab crunch roll is a constant reminder of how nice it is to live in Brooklyn and have a Sushi Specialist next door.", "author": "Kyle D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-12", "description": "Small and cozy and oh so good!  The fish is fresh, portions are generous and food presentation is done well too.  Huge selection of specialty rolls, for instance, a \"special\" spicy tuna roll which was topped off with tempura flakes.   The prices at Iron Chef House are insanely low and comparable to many other sushi joints in the Brooklyn Heights/Carroll Gardens area which lag far behind Iron Chef House in terms of quality and restaurant ambiance.   I forgot how good this place is until I came here this past weekend.  Now I  won't go anywhere else  in the Heights for sushi.", "author": "Jeanne E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-09-09", "description": "Went for lunch and my salmon roll was the fishiest I ever tasted... yuk.\n\nNot sure why this place is packed, maybe the ambience? It is cute and cozy inside and they do have interesting window displays. I really wanted to like this place but still can't get that fishy taste outta my head to go back and try again.", "author": "Nell C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-29", "description": "No complaints here.  Good california rolls, good miso soup, fast delivery, decent prices.  Can't comment on other food (I always get the same thing) or waitstaff (I always get delivery).  But they've never given me underripe avocado or tough crabmeat or lousy miso.  Recommended.", "author": "Debra D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-07-25", "description": "the exterior of this place is sort of deceiving. given its unremarkable signage and the fact that it's in an area that isn't exactly, how shall I put it, \"spectacular\" as far as chow goes, I was expecting this place to be pretty divey. when I decided on takeout the other night and ended up giving this place a try, I was surprised to walk in and find a nice and even somewhat hip sushi place. not to mention that it was pretty packed for a weeknight.\n\nthe sushi I ordered was fresh, and the steamed pork dumplings were sufficiently tasty. I'd definitely go there again.", "author": "Caroline N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-29", "description": "super bomb, try the monkey roll! they're friendly and delish, not too expensive either", "author": "Peter G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-23", "description": "After taking a hiatus from ordering from iron chef, I remember why. My dinner tonight has turned me off to sushi.  The fish does not appear fresh. Neither does the ginger.  Every roll has cucumbers added to it. It was just plain off disappointing. I have had better, fresher sushi from a supermarket.", "author": "Rebecca O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-08-02", "description": "This was the first time my wife and I ordered here. My wife was so excited because she hasn't had sushi in a long time due to her pregnancy. The price was reasonable, delivery was fast but the sushi was average. I think we hit a bad night because we read the reviews and were a bit disappointed. The tuna was not good. The spicy tuna and the tuna roll were very bad. I ate a few pieces and warned my wife to stay away, but she didn't. She spit out what she ate. On the bright side, the Salmon roll and Banzai rolls were great. I don't think I'll order from here again. I hate writing bad reviews, but they shouldn't serve sushi that is off. It's like going to a steak house and they overcook or kill your steak.", "author": "Chris V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-31", "description": "My wife and I always love eating here. The staff are fantastic and the sushi superb. Try curry udon on a cold night \u0026 anything on a warm summer evening.", "author": "Thomas C."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}