{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-04", "description": "Great neighborhood sushi place plus they have pretty good soup dumplings. This place has a good atmosphere and the quality is very good. If you are in the neighborhood you should definitely swing by.", "author": "Atticus K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-26", "description": "Two words. Kobe. Roll. End of story.\n\nNo, but in all seriousness, that may be the best roll I have ever eaten, and I eat a lot of sushi. I have tried re-creating this masterpiece when I have made sushi at home, but nothing comes close to Iron Chef's roll. I have never seen an equivalent roll at any other restaurant either. If you like salmon and lemon, this will be your new favorite roll too.\n\nThe rest of the menu is solid (to be fair I haven't tried any of the noodle dishes.. the sushi is just too good). I haven't had a bad roll and I have tried quite a few of them. I love the (seemingly senseless) names. 2005 roll anyone? The spicy crabmeat salad is excellent, their miso soup standard but delicious. The prices are fair and I refuse to go anywhere else in Brooklyn Heights when I'm craving sushi.", "author": "Halle D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-09", "description": "I used to work and live right nearby and now that I moved away, I miss this place terribly.  One of the rare gems in Brooklyn Heights, a Brooklyn neighborhood that can't seem to get its culinary stuff in order.  \n\nThe space is cozy, dark, and somewhat modern looking.  The tables are scattered throughout the small space, but not too close together so you aren't on top of each other.  Lunch is a bargain whether you order a box, entree, or the sushi specials - $8 for 2 rolls or $10.50 for 3 - which all come with soup or salad and may sound quite ordinary, until you have a taste and fall in love.  House special rolls are also very reasonable for the quality of the fish.\n\nDinner is definitely more hectic.  So make sure you come before the rush if you don't want to wait, which gets to be unpleasant when you are out in the cold, as there's no real space to stand.  \n\nThe ladies who serve you work hard, friendly, adept, and know how to treat a regular.  Sushi crafters are also diligent in readying your oh-so DELISH and FRESH and TASTY!", "author": "Jenny M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-06", "description": "Iron chef has fantastic sushi and the service is beyond impeccable! While the restaurant is small and seat only a few tables, the intimate feel is part of the appeal.  Food options for both sushi and non-sushi eaters and also traditional drink options.  Great bang for your buck with delivery available too!!!", "author": "Ali F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-14", "description": "Incredible. I love sushi, and have had a lot of different sushi from a lot of different places, from NYC to Boston, and the sushi here is probably the best I've had anywhere. The fish is fresh, and the special rolls mix different sauces and flavors together to create a truly unique taste and experience. The service is great and the choices are amazing. From salmon skin salad to fried calamari and duck appetizers all the way to the desserts, everything was stellar.", "author": "Chris H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-22", "description": "Ok - I have no idea where all of these 4 and 5 star reviews are coming from.  Did these people eat at the same restaurant? Ordered delivery, about $50 worth of sushi - appetizers, standard rolls and speciality roles.  None of it was very good.\n\nThe appetizers, shrimp shumai and edamame, were nothing special.  Have had better shumai from the frozen section at Trader Joe's and for some reason it came with regular yellow mustard - no dipping sauce, very odd.  The edamame was barely cooked and cold, no salt and bland.\n\nThe sushi was mediocre.  The rice really makes the sushi and in this case the rice was cold and hard, not fresh tasting.  The spicy tuna roll was the best of the worst, but had an odd artificial bright red coloring which was a bit off-putting.  The salmon sushi was chewy (never a good sign).  None of it looked fresh and natural. \n\nSorry, this is a no-go and won't be going back.", "author": "Scott P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-28", "description": "Of the three sushi places on the block, Iron Chef House is easily the best. Good variety of rolls, great app selection. Not much room for groups though so watch out for that. Good for to-go orders as well", "author": "Kiefer S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-06-17", "description": "Unpretentious, awesome service, and the incredible Kobe roll which is the only roll I will cheat on my salmon avocado with. \n\nThey serve drinks but you can also BYOB.", "author": "Jackie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-08", "description": "This was so good and there were so many rolls that I wanted order. Everything we ordered was delicious beginning with the edamame to the specialty rolls. M boyfriend and I live in Cobble Hill and we will def be back.", "author": "M K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-03-14", "description": "Went here for dinner last night.\n\nGood ambiance, great fresh sushi. I wish I didn't live in Manhattan or this would be my go-to spot.\n\nI had a hard time reading the menu, I think it was a combination of the lighting and the font on the menu, or maybe I'm just becoming an old fart.\n\nIf I was being nitpicky I'd say they could have more Sake selections, but in reality a large house hot Sake is all I need.", "author": "Jason B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-02", "description": "Pretty decent food, had the udon with soup and it was HUGE. Could not finish it. Their spicy salmon roll was pretty good as well. Not a very large dining area, waited about 20 minutes for a seat. Service was good.", "author": "Eugene L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-23", "description": "This is my sushi place in the Heights. \nI also like the Sushi gallery, but it tends to be closed when I have a sushi craving.\n\nIron Chef is an unpretentious sushi place that delivers solid quality. I usually get rolls and a miso soup and I leave fed and happy.\nThe spicy salmon hand rolls were especially delicious, but everything is satisfying.", "author": "Antonella P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "Great sushi, decent service. Nice little cozy spot. Plus they have Nigori sake which is always a plus.", "author": "B R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-13", "description": "Though it's a lengthy walk from school, the quality of ICH's sushi is worth it.  Their prices are higher than the other Japanese restaurants that litter Brooklyn Heights, but their chefs know what they're doing.  I opted for three roll lunch special (spicy tuna and spicy salmon), and the size of the ceramic dish caused me to choke on my water, but lo and behold, the dish was spotless within a few minutes.  Start with their crisp and lightly-salted edamame and then work your way to their sushi and sashimi.  You won't be disappointed.", "author": "Hooney H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-26", "description": "Iron Chef House was once one of our favorite sushi spots to visit. However, after our experience last week, we will never be going back. We ordered 3 sushi rolls and were shocked to see that all of the tuna and salmon still had scales. My roll came out with weird burnt leaves all over the top (the presentation wasn't even appealing) and once I swept them aside I found pieces of fish with scales and opaque salmon. I was mostly upset by the fact that they tried to hide the disgusting fish under heavy \"garnish.\" All of the rolls smelt extremely fishy too. Overall, they changed their menu by raising the prices while simultaneously dropping the quality of their product.", "author": "Brittany R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-26", "description": "Uninspired sushi (it all tastes the same with soggy wrappers), tasteless almost inedible noodle broth, cardboard udon,  weak edamame.  Every year or two, I always forget the mediocrity and go back, only again to be disappointed. \n\nSuch a shame, because the people who work here are ultra nice, and the shop is quaint.  \n\nFolks, if you think this is good Japanese food, I have a bridge nearby to sell you.\n\nEasy solution:  walk a few blocks south to Hibino or Ki.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-12", "description": "Service was amazing, sushi was great and not very pricey. They also give you A LOT of food so make sure not to order too much. Me and my brother split two specialty rolls and two regular rolls. The soft shell crab roll is a must have along with the 2015.", "author": "Robbie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-25", "description": "Very good lunch specials and tasty and fresh sushi! Been there for both lunch and dinner and have not be disappointed. Highly recommend and quite reasonable. Love their veggie soup. Random for a sushi place but give it a try!", "author": "Juju J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-29", "description": "I live very close to and have probably passed by this place a kazillion times. For the first time, I ordered out (next time I go in!) and am kicking myself for not doing so sooner. The Vegetable Udon Noodle soup and the Avocado / Cucumber Roll were absolutely delicious!", "author": "Beth W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-05-13", "description": "Wow! So thankful for yelp- in town tried to find something close and noticed the great reviews and they were justified!  Had the \"dinner special\" - miso soup was good- huge piece of teriyaki salmon with grilled vegetables, PLUS 8 pieces of sashimi! Salad AND noodles that were yummy --- glad I am in Brooklyn for a few more days so I can come back and try some of their rolls--", "author": "kim w."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}