{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-14", "description": "I have been here a ton of times and almost every time I leave with a belly full of sushi! \n\nThe first time I came I had the vegetable terayaki. It was only $7 and it was delicious! It also came with a salad that has a carrot dressing and even came with a cup of miso soup. Not a bad deal at all. \n\nBut then I got the 2 roll sushi special!! I was hooked! I love sushi and it's only $8.75. And the sushi came with the salad and soup top. I love getting the spicy shrimp and crab roll and the salmon roll.  Last time I threw them a curve ball and got two rolls of salmon with avocado! I was one happy camper! \n\nAnd then the other week, my co worker and I got the bento box for $9.50! I couldn't believe my eyes! Shumai, spring roll, salad, house noodles and then you had options for the last portion of teriyaki, california roll, sashimi, sushi roll or tempura. I went for the salmon/avocado roll. I was stuffed like a Thanksgiving turkey. I even had to leave some noodles. Sad! I think next time I will go for the sashimi. So good.", "author": "Carolina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-15", "description": "Iron Chef House is a little small Japanese place that gets filled up pretty quickly during lunch time. Thankfully, we got here early and beat the lunch crowd. \n\nI was craving a kani salad but they don't have that on the menu. I asked about it and they said that they could substitute the crab salad with imitation crab meat. It's not the typical kani salad (cucumber, mayo, roe, imitation crab meat), but it actually has arugula in it. It wasn't bad, but not just what I expected. We also ordered the BBQ grilled octopus. It wasn't bad at all, but there was either some kind of gritty that I didn't know what it was. \n\nWe each ordered the sashimi lunch special. It came beautifully plated with two pieces of salmon, white tuna (I think), and tuna sashimi. There's also two pieces of sushi and a California roll. I love how fresh the fish was. I've been to many low-end sushi restaurants and this was definitely much fresher -- and didn't have to break the bank! The lunch sashimi order came out to about $1/piece of sashimi. It didn't look like a lot of food but with the two appetizers, house salad, and soup, this was the right amount of food. \n\nSince we came for a co-worker's birthday lunch, we also ordered the fried green tea ice cream. I'm not a big fan of fried ice cream but this was surprisingly delicious. It wasn't too oily and the batter had just enough crunch even though it was sitting in a puddle of melted green tea ice cream. \n\nAll in all, a great lunch spot that I'm hoping to return very soon.", "author": "Nilsa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-01", "description": "Delicious food and great service! The monkey roll was so yummy. We came in at 1:30 and were seated right away!", "author": "Shauna H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-24", "description": "I was in the FIDI area and could not find a good sashimi spot in the area so I crossed the Brooklyn Bridge and came to this place!  I got their lunch special of sashimi and sushi, which comes with soup and salad and a lot of it!  Their carrot ginger dressing had a slight aftertaste from what I have had before...so I did not like that.  The sashimi I got was buttery and fresh!  especially the albacore and salmon.  The sushi roll - again had a little of an aftertaste and I think it was from the crabsticks.  Overall I would come back to get sashimi alone!  Their customer service is also really great ...even with a lunch rush you won't see empty water glasses!", "author": "Neha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "My favorite/best sushi place of all time. Since I have been here I can't go anywhere else. Everything is fresh. Quick seating. Good vibe. Love coming here, highly recommend.", "author": "Elizabeth H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-01", "description": "The bf decided to take me here for dinner on new year, 2017. \n\nSince we didn't make any reservation on new year day, we already anticipated a long wait time for our table. There were two large parties, one was for 6 \nwhich sat down right before we could leave our number on the waiting list, and the other was for 12 people, who came 10 minutes after our number was taken. \n\nWe were the only two who were waiting for a table, and there was a table for two who left for more than 10 minutes. While we were waiting for one out of the three waitresses to seat us to that empty table, we saw the chef (or rather the boss) took one of the chairs from that empty table we were supposed to be seated, to the party of 12. \n\nWe stood there for another 5 minutes, one of the waitresses finally saw our existence, and said \"I am the only who knew that you two were waiting for a table,\". Shortly, she guided us to that same empty table we've been starving at for the last 15 minutes. She then realized a chair was missing, and quickly got one for us. And so we finally sat down, and quickly ordered because that same waitress said if we had ordered later, food would come later since there were two larger parties. Therefore, we ordered right away with her. \n\nWe waited as we watched waitresses running back and forth, rather being busy, they looked unorganized and were not orientated  at all. The second waitress came to refill our hot tea, asked if we were being helped. The third waitress shortly after the second one, asked if we already placed our order. \n\n\nWe watched food (yellowtail jaws, spicy yellowtail, lobster sashimi and sushi) arrived to the table of 6, and also food (two sorts of volcano thingies [with flames], and also another lobster sashimi and sushi) arrived to the table of 12. \n\n\nWe waited longer for our food than our table, approximately 40 minutes. However, we only ordered two \"special\" rolls which were not special, and a plate of simple sashimi and sushi which was not out of ordinary like those two lobsters and two volcano plates with flames. \n\n\nWhen food finally came, first waitress apologized for the long wait. Second one came back to ask if everything was alright, and the third one came around asking the same damn question! Yes! You guys were sorry that food took soooooo long to come, but what else could we have done other than telling you guys everything was ok?! We felt rude to walk out of the restaurant and to go to the ramen restaurant we were going to go which was only a block away! You guys kept coming around asking the sameeeee questions, isn't there a better system for restaurants?! How ignorant! How impersonal! So not attentive! \n\n\nWe quickly finished our food, which was not good by the way, not Impressive at all.  I have no idea why some reviews on yelp said their food was good. It was nothing special, not authentic, not even comparable with a local sushi restaurant in Brooklyn. We asked for our check, then the waitress told us that the kitchen was making us a free dessert for making us wait for that long for food, which didn't make much sense. If that's the case, then why didn't you guys decide to give us a complementary soups or salads while waiting for our foods to warm up our stomachs?! I so did not expect to starve, my upper stomach was starting to hurt.  Neither did I expect to hate my first dinner of 2017 this much, to write such long horrible review. \n\n\nNever ever coming back again. What a waste of our time, gas and money.", "author": "Lilian S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-21", "description": "After I went to Japan, I cannot see sushi the same. Came in here after walking across the Brooklyn Bridge and were seated right away around 6pm, which was nice since it was a small restaurant. Everyone here was Caucasian and eating rolls, so I already assumed this place was an Americanized Japanese restaurant. They workers are Chinese, but they cater to American taste buds. \n\nWe ordered the Sashimi Deluxe which came with a salad, nigiris (macakerel, red snapper, scallop, creamy scallop, and salmon), and a Valentines Roll. The salad was had a gingery dressing, which I didn't like so I barely touched it. The sashimi wasn't bad, but very thick. I probably liked the tuna and salmon best. The nigiris were all decent, but the creamy scallop tasted like some sort of potato salad. I think the scallop was the best nigiri out of all of them. The Valentine Roll had a small kick to it, but not bad. \n\nI was surprised the waiters asked us twice if we wanted rice with our sashimi, as if we were doing it wrong.. but I guess they are use to offering it to people not familiar with the Japanese cuisine. Probably won't be back because I didn't think it was anything outstanding, but nothing tasted too fishy/oceany which is a plus. They are also fast.\n\nThe bathroom is also dark and the urinal was clogged, which is gross.. so that docked a star too.", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-04", "description": "Great sushi spot in Brooklyn Heights. I ordered the steak teriyaki and shrimp/vegetable tempura dinner Bento Box which came with a fresh green salad, soup, noodles and shumai. The serving size was impressive and the steak was cooked perfectly. The presentation of the food was also very appetizing. Rolls and specialty rolls here are also very good. Right now I am in love with the Atlantic roll.\n\nThe environment inside is both trendy and cozy, and every time I go it seems to be packed with customers. However, I've never had to wait more than 20 minutes for a table.\n\nIron Chef House is a win in my book!", "author": "Rebecca L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-05", "description": "Delicious sushi with very nice price points during the lunch special. It has an incredibly attentive wait staff. The unsweetened iced green tea is delicious and the sushi menu will leave you wanting for more. I filled up quickly and look forward to a return trip to try some more.", "author": "Serena G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-31", "description": "It was my first time tasting unique flavor of the appetizer that was recommended by the manager.. doesn't much different from other Japanese restaurant but they have a very unique taste towards it and the sadhu mi is really fresh that's like melts into your mouth... very satisfying ^-^!!!", "author": "Itsumi W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-02", "description": "3 stars? 3.5 maybe. I'm not sure.\n\nThere are plenty of sushi restaurants around and this one was the first one I tried around here. It was a pleasant experience.\n\nThe regular rolls are regular rolls. California, Alaska, are always good. I think this place shines when it comes to specialty rolls. One of the rolls I got was their well known Monkey roll. No regrets. A colorful combination of avocado and three sauces. My friends envied me as I ate the entire roll piece by piece. Another roll I got that stood out was a special lobster roll. it was big. It was pink. Each piece was a big mouthful. Loved it.\n\nThe atmosphere was Ok. It felt a little tight and cold air was constantly blowing in (we had window seats).\n\nOverall, nice restaurant. Prices were great for sushi, but I am willing to try the numerous other sushi places close by.", "author": "Jonathan E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-15", "description": "Okay, I'm going to preface this review by saying that I am a slight sushi snob. I don't really like to eat specialty rolls and much prefer my raw fish unadulterated by rice or weird sauces. I also have a tendency to be skeptical of sushi places not owned by Japanese people...am I a food racist? Perhaps, but not really the point of this review.\n\nThat being said, I think this is a SOLID neighborhood sushi joint. As long as you go in not expecting great omakase, I think you're fine. If you want cool specialty rolls, this is the place to go. \n\nThe regular rolls (ie. salmon roll) are actually a great deal. VERY large portions at a good price point. And the sushi quality was surprisingly good :) \n\nI am docking one star because their bathroom is horridly dark and the chef who used it prior to me did not wash his hands (the urinal was still flushing when I walked in...). But if it makes you all feel better, I did check that the sushi chefs use gloves when making the food. shrug.\n\nBecause they sat us as an incomplete party, I am bumping them back up to five stars. I must be feeling particularly generous.", "author": "Sarah H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-11", "description": "Really not very good or fresh sushi. Ordered delivery and pretty disappointed given the positive reviews on Yelp.", "author": "Kamiu L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-21", "description": "Go another sushi restaurant. You can eat same quality sushi with better service. My dish should come with peanut sauce according to their menu description but they might have forgotten it. However, the attitude of a server was so impolite when I asked about the sauce. It was quite noisy inside and he just said that I don't hear you. He didn't even try to hear me. He was just standing far away from me. And when I asked again, he said it doesn't come with sauce, and we even don't have any peanut sauce in this restaurant. Huh? But he finally gave me peanut sauce without apologizing. It felt like he just treated me as a picky customer. I I've never been tread like that in restaurant. Although there were still foods on our plates, another server kept asking us, are you guys done? There was not busy to the point where they push customers to leave. I basically give generous tips about 20-25% for dinner, yet anyway I gave them 18% tips which is too generous for them. I've never left online review before , however I can't utterly stand it. The owner should train servers to have the basic etiquette.", "author": "Chloe K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-20", "description": "Love this place. Reasonable price. Friendly service. Fabulous food. Hours are perfect for someone whose class ends after 21:00.\nReally like this place!!", "author": "Sui H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "I ordered this for delivery. Was amazing. Strongly suggest the Curry Seafood Udon. Fresh, savory, and rich.", "author": "Joshua W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-03", "description": "This place is literally a hole in the wall off of the Brooklyn Bridge. No matter what time of day or night or which day do the week you come this place is always packed. The owner and staff are super nice. The food is to die for. Literally the best sushi and specialty rolls. This place never disappoints. Highly recommend.", "author": "Jennifer K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-30", "description": "Our favorite sushi in Brooklyn Heights. Wide and creative menu with reasonable prices. Actual restaurant is relatively small so expect a wait especially on Friday or Saturday evenings. Good delivery service.", "author": "Jenny F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-16", "description": "Came here again for a sit-in dinner. I got the Valentine's roll -- IT IS BOMBIN. My friend got the Phoenix Roll (also bombin, so I hear) and another friend got their udon [1]. Again, only complaint is that the rice is not as soft and chewy as Sushi Gallery in the 2-subway station. Service is a little slow in getting out the menus and getting us our orders. But we also had no wait and great sushi, so it was still a solid dining experience [2].\n\n[1] Not sure about the udon quality but that thing was HUGE and it had endless stuff in it. Like he was randomly pulling out mini octopuses, clams, tempura, etc etc from that udon.\n\n[2] Try to go a little early. There's usually a wait after 6!", "author": "Judy S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-05", "description": "Been here many times, used to frequent this restaurant but over the last few years I have noticed  slight decline in the quality of service and food. The food as far as Japanese goes is pretty average and doesn't stand out as being any better than the near by competition. I've also been weary of going after seeing the B on the door as many times as I have, and find the flies in there pretty deterring as well. Kind of nice dinner atmosphere there for a date, and the prices seem pretty reasonable, but at times it seems your being rushed through your meal so they can turn over your table for new guests, or so they can take a break. Three stars for being as basic as any other local Japanese spot.", "author": "Jake S."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}