{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-01", "description": "I went there last night with my friend around the time 4:45. The atmosphere was really nice and clean here and the food decor came out really amazing. The waitress her name was Sally, very polite and very lovely looking, I could tell she was new but she sure know how to introduce certain appetizer especially the Iceland. It was very lovely and tasty. We also got house love boat for $60 it was huge but very amazing, especially the special roll. I would defiantly come back here again to eat.", "author": "Charlie Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-05-29", "description": "Two friends and I went out for an early dinner here last week.  The service was inviting and the sushi was delicious.  I can't tell you all of the types of rolls we got based on the server's recommendation but check out the photos to see how beautifully it was presented.  Great place, I'm definitely going back.", "author": "Lissa B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-30", "description": "Food: Their appetizer specials of the day are surprisingly original and good here. Raw scallop with lemons were my favorite. No traditional sushi served here (you can get it, but I advise against it), as seen by the lengthy list of fusion rolls. Fish quality is good, not the best, no one is putting 5 star sashimi into a deep fried roll. However the rolls are well done. Firm, does not fall apart when picked up. They don't really sauce up the rolls, personally I like that, cuts out the fats (sauces are usually mayo based) that messes with the flavor of the fish. If ordering sashimi, the cuts are nice and healthy, they don't really scrimp on size. \nCan't speak about hot food here, never tried.\n\nDrink: Japanese beer and sake. Limited, low end selections.\n\nService: Friendly. \n\nCrowd/Ambiance: Can get crowded but a table always seems to pop up pretty quick. Small restaurant, I like how the sushi bar is situated up top, overlooking the floor. The sushi chefs look like DJs overseeing a dance floor. I guess there is no real reason for me to like it besides my stupid imagination telling me so. Large curtain at front door does not block out the cold winter winds, so bear in mind when eating during winter time. Get a seat in the back.", "author": "Leo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-17", "description": "Awesome sushi spot! Love the food and the fact that they accommodate you by creating any sushi roll or combination you want. I'm super picky so this place is a winner!!", "author": "Beata K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-04", "description": "Went to Ozu twice in the past couple weeks, and I'm going to have to say that they now take the #1 spot for Japanese in the area. They make their rolls exactly the way I want it - a lot of fresh goodness inside without overloading on cheap rice. If you want to get your money's worth on rolls, definitely check out Ozu. $8 for 2 and $11 for 3 rolls for their lunch special. I also loved that they offered brown rice for free when I ordered their sashimi lunch special. I'm a convert!", "author": "Esther C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-02-10", "description": "I just moved into the neighborhood so I'm systematically trying the restaurants around me. After seeing slightly better than average reviews for this place, I figured I'd give it a try.  It was also the only sushi place (there are 3 within a block) that had a crowd on a Wednesday night so I went for it.  I got the 3 Flavor Fish Sushi Dinner which is 2 pieces of ahi, salmon, and yellowtail sashimi with a \"special roll\" that I couldn't figure out what it was.  It was enough food for 16 bucks and the sashimi was good enough, the roll was a bit below average, but the real object of my scorn is the wasabi.  It smelled like some sort of distasteful synthetic variety, tasted the same and wasn't really as \"hot\" as I like it.  Kinda put a pall over the whole meal.  \n\nI may go back to try some their other dishes, but not until I try ALL the other sushi joints nearby.", "author": "Ryan P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-23", "description": "The sushi here is very good and very affordable. There are a wide variety of different rolls and each one that I have tried has been good. It's a small place, I guess you could call it cozy. My only complaint is the waitstaff \"hovers\" constantly.", "author": "Jared A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-12-22", "description": "I like this place and have been ordered on and off for 10 years. The food is really good but I am giving it 3 stars because last 2 times I have had bones in the food. Big no no", "author": "Charles V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-07-20", "description": "Just like other reviewers mentioned, this place is off the charts good. So much so that I am afraid my daily visits to the restaurant cannot be that healthy (sushi is good... but too much of everything and...).\n\nExcellent food, cozy place, nice staff... you name it. The chefs are so inventive, and you just must try one of the house special roles. I would recommend either \"Brooklyn Bridge\" (comes with a special eel sauce) or \"Fashion\" (shrimp tempura predominately + a few special sauces on top).\n\nYou want to have a great sushi experience --- nothing to think about, Iron Chef is your place.\n\nThe only con is that the place is relatively small, so it can fill up rather quickly. That can translate into a 20 min wait on a busy dinner night... but when I come to think of it, if it were any bigger the restaurant would not probably be as good or intriguing as it is now.", "author": "Srdjan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-06", "description": "Nice small place,not too noisym very friendly staff! Great sushi! Place is extremly easy to find, like a 1 min walk away from clark st train station.", "author": "Bella W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-28", "description": "I ordered from here last night because I am pet-sitting for someone in the neighborhood. I ordered way too much, but boy was it good. \nThey were super nice on the phone, the food arrived in exactly the amount of time they said it would, the delivery man was super nice, and did I mention the sushi was super-good??\n\nI got: \nmiso\nseaweed salad\nfancy spicy tuna roll\nnew york roll\nspicy phoenix roll\n\nOK, I should've skipped the miso \u0026 seaweed salad. It wasn't particularly good. But the sushi -- as far as crazy, inventive rolls go -- was out of this world. The spicy phoenix roll was almost incomprehensible. Nuts on sushi?? Yes, nuts on sushi. And it's nummy.", "author": "Alise W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-12", "description": "Good local decently priced sushi. Plus, the ginger dressing is awesome.", "author": "Eleanor B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-05-05", "description": "I was there at the end of their lunch time and my God they didn't really want me there. Wish they had just told me they were closing, but they didn't so I ended up with a pretty rushed, lackluster experience. \nThe waitress sucked and was fighting with the other one, which gave me some entertainment, I just hope they tone it down when there are more people in the place!\nThe fish was yummy though and the environment, other than the fight club waitress scene, was really pretty nice. Overall I think Brooklyn (and in many ways NYC in general) miss the boat a bit sushi-wise, but I'd come back here to try again based on the fish alone!", "author": "Rhubarb M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-13", "description": "This restaurant is right by my work so I've come a couple times, once during lunch and once for dinner.  \n\nFor the lunch special I got the combination box and it was yummayyy.  It comes with salad, rolls, choice of meat, and rice...I really like the ginger too for some reason.\n\nFor dinner I had the spider roll and the tokyo downtown noodles.  Pass on the spider roll...not so impressive.  But the tokyo downtown was veryy impressive.  Also, great service.  Will probably be a regular!", "author": "Jane P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-16", "description": "First time to order from iron chef house.  Tempura made the delivery trip well and was still hot and crispy, not oily, with a decent dipping sauce.  Sashimi pieces were a bit larger than standard, everything was fresh.  Had separate containers for ginger, soy and wasabi, nary a soy sauce  packet to empty on your plate.  Quick service and good quality, at or above standard for NYC sushi take out.  Will order again, after trying a few others.  Could use more soy sauce, and a bit smaller/manageable slices of sashimi.", "author": "Jon S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-02-21", "description": "I was excited to try this place again since they received their A from a B from the health dept. We ordered delivery.  I know this place is very busy but the woman taking my order tonight was unpleasant. I ordered a hand roll and then a regular roll, but instead of saying 'was that a hand or regular, I didn't hear you' she just said - 'you didn't specify, I don't know what you want' I was immediately confused because her manner went so quickly downhill I didn't know what hit me. Anyway- the shrimp tempura roll was too salty. My husbands salmon roll was fine. We will stick to Sushi Gallery even if they can't deliver some days, it's worth it.", "author": "Cecilia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-13", "description": "Freshness counts, perhaps in sushi more than any other cuisine. And Iron Chef House has been reliably on the occasions when my husband and I have eaten here. We typically order the same or similar dishes (sushi deluxe and chirashi over brown rice), and whether it's Tuesday night take-out, Friday night delivery or a Saturday night sit-down meal, we've never been let down.", "author": "Claire A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-03", "description": "my favorite sushi in NY.  have never been let down by a meal there.  fresh and exciting rolls! not your typical sushi .", "author": "Nicole K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-10-03", "description": "This restaurant is simply AMAZING!  I waited till after my birthday to write this review. Why?  Because so then I had the chance to try all the specials they had!  It was so mouth-watering.\n\nThis is a fusion restaurant, so don't bother ordering traditional japanese sushi (not that they are bad, but there are places which are better).  You're here for the appetizers and the rolls!  I'm talking about the tuna dumpling (cooked tuna, avocado, \u0026 crabmeat wrapped together with raw tuna glazed with spicy red wine sauce), the monster (raw fish chunks over crispy thin pancake drizzled with seven different sauces), the lotus rook, the roti, the 2009, the monkey roll, hmmmm.\n\nOf course, not everything is amazing.  The presentation were amazing but they could do without some dishes like the Brooklyn or the 2005.  Their specialty is frying.  Anything with a fried ingredient is for sure to taste good.  I seriously believe they have this little asian guy making 100K a year from just frying.\n\nThis place is small so it is always cramp.  That means you can hear everything everyone else is saying.  That also mean the wait.  OMG, since it gained popularity you are lucky if a seat opens up bc someone was just leaving.  Saying that, make sure you reserve or come in a small group (you and someone else).", "author": "Terry F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-08-23", "description": "The prices are extremely good for the quality of the food and quantity.  Try the tuna tar tar!  The restaurant has a nice atmosphere with an extensive list of alcohol.  The only bad thing was that I sat in a small corner for 2 people and there was a fly that just wouldn't stop.  Besides that this would be a great place to go every week.\n\nWarning: The Kirin roll is huge! :)", "author": "Vincent N."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}