{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-01", "description": "The place is small!! so get there early, other then that me and my boyfriend had a good time, sushi was very good and fresh. Would go there again!!", "author": "Lea S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-10-05", "description": "O...M...G...Thank u fellow Yelpers for recommending this Gem of Brooklyn. The service was Amazing! The ambiance was perfectly non pretencious. And the House Rolls were Phenomenal! This place has officially become a 'Must Eat' local anytime I'm in town! :)", "author": "Allison R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-11-14", "description": "Way overrated. I would say the atmosphere is nice and the sushi is cheap, but there are definitely some weird sushi options. The rice did not taste like sushi rice. The miso soup was served with a spoon!?! The service was a bit pushy. Definitely not authentic sushi. Good enough if you want sushi and dint want to pay a lot. For someone who doesn't know a lot about sushi it is fine but I won't go back. I love sushi and this was not great.I'd give this 2.5 stars", "author": "Vanessa O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-03", "description": "This place has mediocre sushi and terrible service. My best friend and I got food poisoning after eating sashimi here in 2008.  We used to be regulars but after 5 years they didn't give us so much as a decent table or piece of free sushi so we stopped spending our money there especially after getting so sick. There is a far better sushi place on Atlantic Ave now with better prices and food. They also messed up our delivery orders nearly every time we ordered last year so watch out!", "author": "J C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-04-12", "description": "Amazing amazing amazing amazing sushi and such a cute little place (keyword little)  I'm not a huge guy, but I definitely bump shoulders when going in here, but for the sushi that's not a problem at all.  For 7 dollars you can get 2 rolls, and tea which is a great deal, and it's oh so fresh.  If you love sushi come here, you won't regret it.\n\n*note  Like other restaurants they close mid day (like 2) and open again at 4, so make sure you call and verify they will be open before you make the hike.", "author": "Henry B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-07-01", "description": "Definitely the best sushi in Brooklyn Heights proper. This small place is tucked away on Clark Street and you'd be smart to get some of the huge sushi rolls with great fresh fish. I live in Cobble Hill so this isn't always location friendly for me but I've ventured here several times with always great results. Friendly staff and great service also need to be mentioned.\nI'd give it five stars but it's not Nobu.", "author": "carl g."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-03", "description": "I don't understand the hype behind this place... Sushi is mediocre... not fresh and, the chicken terriyaki my boyfriend ordered was the worst I've had... The only good item we ordered was miso soup. We've tried you twice Iron Chef, but won't be back.", "author": "Sara G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-01-14", "description": "Iron chef house is a great place for sushi, it was packed but the service was still very fast. I had the deluxe sushi platter which came with a choice of a house salad with an amazing carrot ginger dressing or miso soup. For the sushi I had an assortment of nagri, tuna rolls, and california rolls all were very fresh and delicious. My bill was around 25 dollars with a large Sapporo which was a good price. I will deffenalty return.", "author": "Marcus A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-29", "description": "Quite mediocre to say the least. Food is decently alright, nothing extravagant. There are several better suited restaurants serving better food. Service is quite horrendous, expect 35-40 mins to receive a roll on a fairly less crowded night. There are certainly better restaurants out there to have a nice experience.", "author": "Prerak P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-25", "description": "Not only are the prices reasonable, but the food here is great. I especially love the dressing they put on the salad. It's some sort of carroty-ginger concoction that is out of this world. If I could have done so without making a scene, I would have licked the salad bowl clean!", "author": "Chitra R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-27", "description": "I'm a little iffy on this place. The sushi is good, just that, good. I wonder how fresh it is...because sometimes the fish looks like someone put it in a bag and then proceeded to toss it against a brick wall. Umm, if you get their sushi only eat it that day, cause it starts looking strange after a day or so. But the price isn't bad.", "author": "r b."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-27", "description": "Great sushi restaurant.  If you love sushi, Iron Chef is a winner.", "author": "Lorrie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-18", "description": "This place is amazing.The sushi is always fresh and every time I go with my husband we get the Love Boat.  Whatever the freshest fish of the day is goes on the boat and there is always some fancy app that comes with it.  Love it.  I live in Queens and make special trips... that should say something.", "author": "Krista M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-14", "description": "Delicious sushi. A little pricey, but consistently good. Takeout sometimes takes a while.", "author": "Sarah P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-09-13", "description": "Great for eat-in or take out. Reliable and quite reasonable. Sushi, udon, bowls, you name it, and Iron Chef does it well. You can't go wrong.", "author": "Craig G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-02", "description": "I LOVE, LOVE, LOVE this place.  We started with the Aged Tofu and the Portobello Mushroom.  My favorite entree is their Chilean Sea Bass in Miso Sauce.  It comes with steamed vegetables, a Miso Soup or Salad  and you have a choice of Noodles or Rice (I personally prefer rice).  They give a generous serving of Sea Bass and I kid you not, the fish totally melts in your mouth!  Makes me hungry just writing this.", "author": "Elle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-07-10", "description": "I wanted to give this place 5 stars at first, but that would mean I'm always having a perfect time when I'm eating there. Although I love Iron Chef House, I have to admit I don't always walk out of there completely satisfied. \n\nDon't get me wrong though: this place is awesome. The atmosphere is very intimate and comforting, thanks to the small size of the place, the beautiful decoration and the softened lights. Service is very serious and professional, sometimes even surprising (don't scream if the waiter puts your napkin on your knees).  And food is excellent, always beautifully, personally decorated depending of the rolls and sushis you have. I usually get a selection of rolls, even if the bento boxes are also amazing. Everytime we go, whatever we chose, we're always having Kirin Roll (soft shell crab), which is absolutely incredible... \n\nNevertheless, I have to say the price of the place is sometimes preventing us from having everything we'd like to have. For this reason, we're only going there for special occasions. Also, avoid Iron Chef House on fridays and saturdays at night, even if you make a (necessary) reservation. The waitstaff is much more stressed these nights, the place noiser, and you might not fully enjoy it. The \"fauna\" you'll find there, which includes a lot of Young Urban Professionals, is not always very pleasant, especially if you get a table before them still waiting in line, because you had the good idea to make a reservation...\n\nAnyway, beside these details, Iron Chef House is one of the best Sushi places in New York without a doubt, and I can't wait for the next time I'll go there!", "author": "Victor L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-10", "description": "While a blizzard hits brooklyn, I think everyone agrees it feels good to stay in warm and cozy and have someone else cook for you :-). I decided to order in sushi at a reasonable price. This was the quickest delivery service I've had in Brooklyn thus far. My sushi was here within 20-25 mins DURING the blizzard. They have a good variety of reasonably priced platters and sushi is pretty good. In $22, I had miso soup, beef broccoli appetizer, 20 sushi rolls, delivered fresh/quick to my door again DURING the blizzard!!!! This place is pretty cool. Try it.", "author": "Asma S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-12", "description": "This is the best Brooklyn sushi place.  Most of the neighborhood sushi restaurants are fair at best.  However, the Iron Chef provides reasonable pricing, nice cozy atmosphere, good music and great food.  You cant go wrong by giving this place a try.", "author": "Michael G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-06", "description": "Awesome food. Live right by here and go all the time. Good prices, big servings, just very reliable. Go!", "author": "Jillian B."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}