{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-11", "description": "Finding decent affordable weeknight sushi spots in near proximity to our neighborhood has been a challenge. We usually finish our meal feeling pangs of regret and mercury shakes. The BF came across Iron Chef House on Yelp the other day and with its good reviews we decided to give it a try. Restaurant is what you would expect - casual, small, and cozy. \n\nWe shared a seaweed salad, house salad, two miso soups, an order of the sushi deluxe, and three maki rolls. Only complaints were that they served us 'white tuna' in the sushi deluxe, which we recently found out is not a 'real' fish. They also gave us a salmon avocado roll when we asked for eel avocado. But nonetheless, the fish was fresh, the service was good and for the price, the sushi was pretty darn good compared to its nearby competitors! At the end of the day, it's all relative right?", "author": "Danielle M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-15", "description": "I ended up at Iron Chef House purely by accident. I ventured out to this neck of the Brooklyn woods for a much better sushi restaurant down the street (just being honest here) without realizing that it's closed on Sundays. Oops. So I decided to get my sushi fix elsewhere.\n\nThe monster appetizer is certainly an eye-grabbing, grandiose spectacle. Tall, round bowl filled with a scoop of fish/imitation crab/pineapple/avocado mixture and sauces. It was ok.. average in fish quality and size.\n\nSeems like Iron Chef's star roll is the Monkey roll since the menu proudly boasts about exactly how many of those bad boys they have pushed out since whatever year, but let's face it, it's really just an overpriced $11 tempura shrimp roll topped with avocado and a sweet sauce. Tasty? Sure, I like fried shrimp. Anything I'd brag about eating or hurry back for more? No, this is more of an item that could be ordered for a toddler or someone who doesn't truly like fish or sushi, not anything that deserves to be put on a pedestal. \n\nSpicy Yellow Dragon Roll is where I have my biggest bone to pick with this experience- all the meat inside of it was blended.. Why?! Sure, the menu claims I'm eating tuna, yellow tail, and crabmeat, but you could have fooled me. Was the fish blended in a food processor? Gross. All I could think about was that the fish used for this roll was leftover scraps from better cuts of meat used for sashimi/nigiri. The soggy tempura crumbs on top didn't exactly improve the situation. For a $14.50 roll, this was a huge disappointment.\n\nIron Chef is not the priciest sushi establishment around, but it is also not exactly a bargain, especially when the quality or creativity is lacking. The menu is insanely long and overwhelming as well. I prefer a less ample selection, but one that is done well. Hard pass for my future sushi endeavors.", "author": "Nataliya M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-04", "description": "Keep coming here for many many years. Used to be my favorite lunch place. \n\nNot anymore, they changed all waitress to waiters. And they make me think how much money I own them and forget maybe! \n\nAsk 3 times for the tea cause it is snowing day, and just want some thing hot. no response at all, the waiter continue for the next table, asked again when he walking passed me, and 3rd time again, he did responded and he said: \"I know, you said three times already. \" I said: \"you didn't show any sign that you heard me though\". I did get my tea finally even it's not warm at all!!!", "author": "Anqi X."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-26", "description": "Quite truly the best sushi in the city for this casual/everyday price point!!! The special rolls are unreal- The monkey roll is simple yet strangely amazing \n - and the fish is fresh. Their gyozas are one of the best I've had and the chicken fried rice is also a Must!! Service also is great. Each person I've come with have all felt the same. Love!", "author": "Sophie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "I love coming here for lunch! You can taste the spices in the food! The waiters are very friendly! Every time that I go there's no wait for lunch, even after you order the food and it's crowded! It's cool when the waiters remembers me.", "author": "Nick S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2019-02-22", "description": "I may order from here again one day but I'm just not sold on this place. Only ordered from here a couple of times but it's never been impressive. Last night ordered the shumai, spicy salmon roll and monkey roll. The monkey roll was really good! Definitely one of those rolls that some people would turn their noses up at for not being legit sushi but make something with sweet dark sauce, shrimp tempura and avocado and I'm gonna enjoy it. The spicy salmon roll was ok. Nothing particularly spicy about it. The shumai was baaaaad. You can buy the exact same stuff from Trader Joe's and make it in the microwave with a damp paper towel so do yourself a favor and don't bother. There's two sushi places closer to me one of which I really enjoy so will probably just stick with those.", "author": "Adam L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-18", "description": "This place has a hidden treasure dish  'lobster ramen'. When I placed the order, I didn't expect it to come out with a whole juicy lobster parking in the middle of your noodle soup, unshelled. It requires some work but is absolutely fresh and tasty. I had to wash my face after finishing the unshelled lobster in the end and got splashes of soup on my white sweater. But who cares, I would say this is the best ramen I have tried in Prospect Park area, all for 18.50!", "author": "Yunyue W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-12", "description": "This is a solid sushi spot.\n\nEach time I've ordered delivery or rocked a lunch special, the rolls have been solid, the fish tasty, and everything taken care of efficiently. They go a little heavy on the rice for my taste, but you can do a lot worse in the area. \n\nPersonally, I prefer to go with a regular sushi dinner, but if you're interested in the wild Americanized rolls with spicy tuna and mayo and crazy names, they do that and they do it well.\n\nNo judgment here either. I also love when they fry tempura crunchies and stuff as many different non-Japanese things into a roll as possible, I'm just trying to be a little healthier, and I don't think all those Japanese folks are living to be 100+ because of all the cream cheese. \n\nIt's probably just the simple, fresh fish, rice and seaweed, and Iron Chef has that down.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-30", "description": "Cool,cozy Japanese restaurant with excellent food and great service,my rolls were excellent,highly recommend", "author": "Oleksandr S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-24", "description": "Simply put, this place is. BK gem.  The location is small and cozy, but comfortable.  I went solo on a Monday, so the crowd wasn't bad, and service was quick.\n\nThe food was served quickly, and the quality was great.  It's an amazing balance of taste, quality, and most important - price.\n\nPut this on your must list.", "author": "Adam C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-15", "description": "This has become my to go to sushi spot! I'd make the 40 minute drive out here any time I'm craving sushi. I've been back here 3-4 times since my last review and both the food and service have been solid each time.\n\nSushi pizza isn't on the menu, but just ask for it; you won't regret it!", "author": "Elaine Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-02", "description": "Tasty and affordable sushi spot in the Brooklyn Heights and DUMBO neighborhoods. I often stop by for lunch after the gym for some post-workout protein. Fish is good quality, solid lunch specials, and the service is super friendly. I always feel well taken care of here. They seem to have a lot of regulars too which is always a good sign, I feel. Not a destination spot, but if you're in the neighborhood and craving sushi, definitely stop in!", "author": "Victoria S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-01", "description": "Heard some really good reviews from friends about this place, they finally took us here to eat. The place is small and cozy, good idea to make reservations beforehand. The service was good, waiters were friendly. We ordered a few appetizers for the table and we loved it. I personally like their appetizers more than their entree. Me and my husband both had the sashimi deluxe. I was able to opt for red snapper instead of white tuna that was included. Rice came in a separate bowl, but it was a bit on the harder side, we prefer soft and hot rice. Fish quality was not bad, it was fresh, but the pieces of sashimi was quite thin. The place seemed to be packed later on in the night. Overall we had a good experience and would definitely come back.", "author": "Amy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-05", "description": "Best price and quality in the neighborhood! Introduced by a friend and it had exceeded my expectations. We tried the steak and sashimi and couldn't wait to order another round!", "author": "Kylie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-04", "description": "I've been eating at Iron Chef House for many years. Their stellar sushi and no nonsense service make this place great. One of the most charming things about eating here is that you can see the chefs making the sushi at an elevated counter. The decor is also charming and cozy. My favorite thing to eat here is the triple spicy roll dinner. I also highly recommend the crazy couple roll and really any sashimi. The fish is always extremely fresh and delicious. This is the best sushi in Brooklyn Heights for sure.", "author": "Renée G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-28", "description": "Do's:\n-Order almost everything on the menu if you're in a group.\n-That being said, wear sweatpants to dinner bc you will be very full. I promise.\n-Walk out with a happy face, knowing that you had relatively cheap sushi (and other Japanese things ofc) in a pretty good neighborhood.\n\nDon'ts:\n-Don't order the Volcano BEEF if you're looking for the dish with an avocado that gets set on fire. Just ask for the 'Volcano'.\n-Don't order the Volcano again because it's really just an avocado with meat, which both tastes like nothing after being lit on fire for 2-3 minutes.\n-Don't complain about how full you are because everything else is well worth the time, taste, and $$.", "author": "Amy L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-21", "description": "Lots of choices and they are delicious.  The monkey sushi is just perfect! They also make the best soba noodle soup.", "author": "DJ W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-05", "description": "Pretty good spot for Japanese. Affordable, quick and delicious. I just wish that the bathrooms were a little cleaner.", "author": "Angela L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-27", "description": "Hands down the best in the area for sushi. Call ahead because the sitting area is small. They held a table for the 9 of us. The food came out quick and everything was amazing. We were so hungry that we did not have to take photos, but the food was presented beautifully and again tasted amazingly.", "author": "Bobby H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-19", "description": "the food here is so delicious. the fish just melts in your mouth and everything is fresh. gets very busy on weekends i suggest going during the week", "author": "Isis S."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}