{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-23", "description": "Like other reviewers are noticing.. sadly something has changed for the worse. This was my go-to sushi spot for 4 years but my last few visits were so bad I won't be returning. The quality of the food has gone way down along with the terrible service and higher prices. Food tastes like its been recooked/ reheated/ refried several times and is smothered in so much sauce that's all you can taste. Dining in recently I had to remind them they forgot a roll 3 times until eventually I just asked for the check and asked that they remove it. The old waitresses that I loved are mostly gone and there are almost always too many people for the number of staff that is there. Most recently I ordered take out and it was so bad I actually threw it out!\nI gave ICH several chances since I noticed the decline but at this point things have only gotten worse. Time to find a new sushi spot!", "author": "Mariana R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-15", "description": "Everything we ordered here has been really really good! Their sushi is great and their veggie udon noodles are unique and super tasty. I would recommend!! Small restaurant, perfect for an intimate meal for a small group or couple.", "author": "HP S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-02-15", "description": "I am still salivating over dessert! Their sushi is fresh here and the dessert was amazing! Their green tea fried ice cream was so perfect. This is the best fried ice cream I've ever had. The batter is crispy on the outside and thin layer of cake on the inside with a scoop of ice cream of your choice. It was just a perfect ending to a great meal. They give generous portions for their sushi rolls and their sashimi tasted fresh both times I've been here. Try their monster appetizer! \n\nService was great! Never really came during busy hours though.", "author": "Anna L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-10", "description": "Definitely a place I'm going to go back to! My absolute favorite was the BBQ squid - I must say, it was just deliciously perfect! Thinly sliced, it didn't taste rubbery/chewy and the tentacle pieces had an awesome bit of crunch almost.  Just loved it!  The rolls were so fresh and delicious! They're quite a generous size as well - difficult to not eat with your eyes (over-ordered we did).  Plum wine was a tasty too.  Great experience! Lovely place! It is quite small though so reservations are recommended.", "author": "Tatyana R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-06", "description": "I'm very torn on this review, because the food is amazing, but the service (and delivery) are AWFUL. Good things first: their grilled octopus, sushi pizza, tuna tartare, and sashimi platter are all excellent. Quality is fresh, the portions are reasonably sized, and the flavouring is quite strong (which I really like, but may not be for everyone). But, we've ordered from this restaurant twice (within Brooklyn) and both times the food has arrived more than 30-45 minutes late. They were very rude on the phone when we called to ask about the status of the order, promising that it would be there within 5-10 minutes (it took another 20-25). Not sure if the service is any better in person, but be forewarned if you order online that you'll be waiting a LONG time.", "author": "Joanna Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-16", "description": "Disappointed with the attention to detail on the delivery through Eat 24.  Requested soy sauce, napkins, plates etc and they completely screwed it up.  Food was so so.", "author": "David W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-01", "description": "I ordered a sashimi and sushi lunch special with brown rice for take away. At first, the waitress told me brown rice are not available now, so i said okay. Later when i paid the bill, i was surprise tht its $13.60 which suppose to be $11 + tax. So i ask her why, she then told me its $1.5 extra for the brown rice.. \nBut didnt she just told me earlier tht they dont hve it. Since they aldy make it, so i had no choice but paid for it.\nIron chef, u should let ppl know tht they need pay extra when they order, not when the bill comes out. \nSashimi are okay, the rolls are tasteless.. \nOver-rate, won't come back again.", "author": "Vic Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-02", "description": "The food was so good, the staff is restaurant was nice , we always like to dinner at iron chef house ,What recommend is the grilled rice ball", "author": "Annie Z."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-18", "description": "Customer service could use some work. Their system didn't process my online order, so I called it in. No mention at this point that they don't take cards over the phone. \n\n45 min later....\n\nMy food arrives. I try to pay with a card. The delivery guy (super nice, super polite) calls the restaurant. The lady answering the phone proceeds to lecture me for ~5 minutes about how they don't take cards over the phone because I can't sign for the order, despite the fact that I have already said I'd find an ATM to pay in cash. \n\nThe food was touch-and-go. Buns: great. Mushroom soup: great. Spicy tuna/avocado roll: great. (Fake) crab/scallop roll: fine. Mushroom roll: AWFUL.", "author": "Erin O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-18", "description": "This is our preferred sushi location in Brooklyn, or all of NYC for that matter. \n\nThe most important thing for you to know is that you must order the monkey roll. Everything is good, but it's all about the monkey roll. Monkey roll, monkey roll, monkey roll. (It's probably good luck to say it 3 times.)\n\nOtherwise, the ambience is lovely, the service is great, and the presentation of everything is wonderful. \n\nOh, and try to avoid sitting right next to the door if it is crazy cold and windy. \n\nEnjoy!", "author": "Benjamin C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-26", "description": "I love this place!  The mushroom soup is the absolute yummiest!  On a cold day I get that and some sushi delivered to my office and it is a bangin' lunch.", "author": "Kalin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-15", "description": "I had the rock shrimp tempura which did not come mixed in the sauce like most places. This was not the best choice on the menu. However, my sister had the Shrimp udon. Hands down the best udon noodles I have ever eaten. I would go back to try to sushi boat.", "author": "Britini W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-05", "description": "Food is great but service has become terrible. It used to be my favorite place for sushi for years but now rude staff makes it unpleasant place for dining with friends. Better to take-out.", "author": "G R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-11-27", "description": "Worth a visit.  I had dinner on a Sunday during Summer and there was only one other table of customers.  The service was attentive, maybe a little too attentive because several servers stood around and stared at me as I ate.  The Vegetable Miso Soup was served much too hot and burned my tongue a little but tasted great.  The Monkey Roll was good but not very memorable.  Overall, I had a good experience.", "author": "Joel L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-04", "description": "This is my go to sushi place in Brooklyn heights. The dinner bento box is a great deal and you can't go wrong with the options.", "author": "Emmett F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-04", "description": "Um damn, this was the cheapest sushi spot I've been to while living in the NYC area that I was actually able to sit down and enjoy. I made rezzies here to dine with some friends before the famous Peter D's bday and I was not disappointed. For $18 I left with a full on sushi coma. Ya, no joke.\n\nMake reservations, it does get packed. Don't be a dick and show up on time, this place literally has 10 tables. I went with the sashimi platter with 6-8 pretty thick cuts of fresh salmon, tuna and .... and.... I forget the last fish type, but it was good. The bento box came with the best miso soup I've ever had filled with fresh vegetables, shumai, noodles and a Cali roll with tuna. Yep. The only flaw in this meal were the noodles. They were cold and flavorless.\n\nFriends had rolls, tempura and sashimi and everyone was super happy with the quality, quantity and of course the price. Did I mention even the sake was pretty inexpensive, because it was. \n\nI'd come again and definitely recommend you go if looking for a quality sushi meal at a great price point. I'd suggest more for a casual event since service here is rushed. They want you in and out and have no problem letting you know. Again, it's a small place so give 'me a break.\n\nCan you find better sushi in NYC? Yes. At this price? I'm not sure.... This spot's a gem!", "author": "Stephanie Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-21", "description": "Think twice before coming here as the staff are extremely inattentive and unwelcoming. I stood by the hostess table for 5 minutes and none of the workers acknowledged me or wanted to come over. The restaurant wasn't even busy as the whole middle section appeared to be reserved. After waiting patiently for 5 minutes, one the male waiters finally comes over asks me how many. After I tell him, he leaves me hanging for another couple minutes before telling me it's a 10-15 minute wait. I stood outside for 20 minutes with absolutely no updates from the staff. This place is an absolute joke and disgrace with such high ratings/reviews.", "author": "Drew E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-28", "description": "Before Iron Chef House I had stopped eating Sushi for over 5 years.  This place got me back on the Sushi Boat, its that good.  The ambiance is very romantic and the service is top notch.  Now, lets get to the food.  The food is amazing.  They put a lot of concentration on food presentation, food taste, and food love.  This is my wife's and I fave sushi place in Brooklyn.  We are big sushi roll eater's and this is what we get:\n\n-BBQ Squid\n-Spicy crabmeat salad\n-Kirin Roll\n-Hard Rock Roll\n- Pheonix Roll\n-2008 Roll \n\nYUMMMMMMY in my big fat TUUUUMMMY!", "author": "Freddy V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-13", "description": "This popular neighborhood sushi joint will definitely become a staple in my dining pattern. I do recommend making a reservation as the place fills up quickly especially during prime times. You really can't beat this fresh fish in Brooklyn Heights though. Only small thing is that my dining companion though they put a little bit too much rice in the sushi compared to more traditional sushi restaurants like Hasaki. But for the price, wuality of food and location it is a great value!", "author": "Andrew D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-16", "description": "One of the best sushi places around, hands down. And, luckily, it's located just a few feet away from our place here in Brooklyn Heights. So, what makes this place so great? Well, first off, the food is tasty! They offer both mainstream rolls (spicy tuna, Philadelphia, etc.) and speciality rolls... and also feature daily chef's specials, bento boxes, etc. etc. Some of my favorite rolls from the menu include the Monkey Roll (shrimp tempura w/ avocado and spicy sauce) and the Crazy Dragon Rol (spicy crabmeat w/ eel, tuna, \u0026 salmon). \n\nAlso tasty at Iron Chef are the appetizers, soups, and salads. I recommend the Yaki Udon chicken noodle soup! Awesome!! As for atmosphere, it's great, too. The place is small and intimate and adorned w/ dark wood fixtures and aged brick... very classy and perfect for an intimate date for two or dinner out with a small group.", "author": "Scott B."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}