{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-04", "description": "Iron Chef House is one of my favorite local go-to spots in Brooklyn Heights. Their prices are comparable to other Japanese restaurants in the area. I love that their menu includes a wide variety. Often, I order sushi to be delivered from here. My favorites are their sashimi, Crispy Salmon Skin Salad, and spicy tuna roll. The restaurant itself is somewhat small, so during dinner hours on weekends there is a wait. Their service is great and the workers are attentive.", "author": "Florance W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-23", "description": "I know that this is a good sushi place. I'm not disputing the deliciousness of the sushi. \n\nBUT We ordered $130 worth of sushi tonight (it was all delicious.) And instead of tempura they gave us teriyaki. I didn't bother to call because it was a group of us and we all needed to eat and we weren't going to make one person in the group wait for the order to be fixed. So after we were done entertaining I called the restaurant to let them know their mistake. The lady on the phone lectured me about how I should have called hours ago and that they would've fixed it.  I said, it's sushi, we can't I'll wait for one person to get their order right.  \n\nI assumed she would just refund us for their mistake. Especially since our total bill was $130\n\nI have zero patience for poor customer service.", "author": "Natalie Venus De H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-09", "description": "There's not a lot of good sushi in DUMBO, but I found out through Eat24 that Iron Chef House over in Brooklyn Heights delivered to my office.\n\nMy lunch order was:\n-Iron Chef Spicy Roll (tuna, scallop, avocado, caviar)\n-Any 2 rolls for $11 (I did the Spicy Tuna/Yellowtail and the Spicy Eel/Crab)\n\nThe fish was fresh, the rolls were well made. They ones I ordered were pretty no-frills, but that's not a problem when you're getting delivery and the rolls are so good. I'd definitely recommend everything I had.\n\nNote: their website is out of date, and prices have since increased.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-13", "description": "I wish I lived in Brooklyn just for this place! Its a little sushi house but with great food.  To start off, had some sort of Toro salad, tuna tataki, tempura, and some sort of black cod fin dish.  The toro is just yumm and melt in your mouth.  It had a great sauce on it too that wasn't too heavy and still allowed you to taste the amazing toro.  The tempura came with 2 shrimps, onion, broccoli, and sweet potato.  I find that some places either have too thick of a batter or too flimsy where its falling off the food.  Here had that perfect balance of super crunchiness but not overpowering.  The fin dish i must say was my FAVORITE. If you are not getting it, you are missing out.  I can't remember the name but just look at my photo and ask for that.  We then finished off with a set of sashimi and everything was so fresh and delicious!", "author": "Ariana K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-24", "description": "Iron Chef House\nNY BK Downtown\n11:30am Friday 24th February 2017\nThree Stars\n\n The place was pretty empty but the waitress/maybe owner was rather assertive and on the edge of pushy. I started with jack's special which had a bed of fried potatoes I.e. French Fries with tuna and salmon on top. I had lunch box combo with Beef Teriyaki, mixed vegetables, shumai, salad, spaghetti, and an egg roll. The steak was cooked medium rare with a bit of sear. The veggies were tender. The spaghetti had a good consistency. The dumplings were steamed from a frozen package as was the frozen egg roll. They served it with a dollop of French's mustard. Tiffany had a Lunch Sashimi Platter which had salmon, Tuna, snapper and white fish. The bed of daikon radish looked like it was cut with a machete. They used whole fresh parsley instead of shiso leaf. The pieces were thick in almost a bad way. Overall the service was too attentive for the place not being too crowded.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-09", "description": "So, I order from Iron Chef House (via GrubHub) probably once per week (not kidding). This alone should communicate how solid and consistent they are. \n\nThe reason I've stuck with them is for two reasons: First, their maguro is always on-point. It's the smooth, lovely texture you want, the vibrant pink-red color, and lovely fresh flavor. Second, they do spicy-tuna rolls the way I like. It's not that smooth, almost tuna-salad texture. It's more of a mix of tiny chunks of tuna in a nice spicy mayo-like mixture. Yum. \n\nThe people who deliver for them are always very kind, as well. I've come to recognize one of them and he greets me very positively whenever I answer. \n\nThe reason I don't go for a full 5-star review is that there have been times were my order showed up much later than expected. When I called one time to just get an update on my order, the person on the other end made me feel like it was my fault for ordering at peak dinner time (and told me to either order at a different time or call in my order rather than use the internet). Didn't make me feel great. Alas!\n\nBut overall, this is my go to sushi order. I'll probably even order some today!", "author": "Jeffrey H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-29", "description": "It was a hot day so we decided no cooking at home and we wanted to try out this restaurant because ownership had changed. We visited this restaurant couple years ago and it was not very good. The quality of the sushi and sashimi was poor. Now  place is cosy and intimate with pleasant chillout music that brings the atmosphere really together. We ordered a salmonskin roll and a sushi\u0026sashimi lunch platter. The fish is fresh and very tasty. The service was quick and the food preparation was improved over the last time we were there. If you like Japanese food, you will like this place.", "author": "Veronica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Such amazing sushi place at an even more amazing price. I love this place and the area located. \n\nDefinitely the best sushi in cobble hill but not the best I've ever had. However. The freshness is 100 and the staff is very nice - they even laid my napkin on my lap lol!", "author": "Naomi Z."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-06", "description": "Waited over an hour for delivery. Unable to call the restaurant because there is a busy tone. The delivery is already late by 20 minutes as I am writing this review. We live about a 5 minute drive from the restaurant.\n\nLove their sushi but wondering if we ever will get it.\n\nPretty upset we cannot leave a message and there is no way to follow up on this...........", "author": "Kathleen H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "Such a great find in Brooklyn! The service was spectacular. Very fast, clean, and the servers were very friendly and attentive. The food (especially the monkey roll) was really good. Highly recommend!", "author": "Diana D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-03", "description": "Absolutely love this place! Great lunch specials. Very affordable. Best spring roll I've ever had!", "author": "Michaela H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "Best affordable and decent sushi in Brooklyn Heights.\nI've been ordering for delivery several times and never experienced issues.\nBeen here for dinner several times and the place was always busy (as well when I stop by picking up food).\nToday I enjoyed a nice bento box for lunch and it was simply delicious and just above 11 bucks (including taxes).\nDefinitely a fan:)", "author": "Anna C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-11-04", "description": "The decor was good but I ordered to pick up and to wait 40 minute for my meal. They said they were busy but it wasnt even a full seated restaruant. Highly considering not to return anytime soon.", "author": "Wilson M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-16", "description": "Amazing lunch special! Very fresh fish. One of our favorite affordable and reliable places around Brooklyn Heights.", "author": "Holly R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-31", "description": "The sushi here was pretty good. Their rolls are a pretty good size. They make it right in front of you and work at a good speed. The tea was really good and very hot. The servers were very attentive and made sure your glass was always full. I liked the sushi here but my favorite sushi place is still sushi gallery down the street.", "author": "Bailey A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-27", "description": "Lovely staff. However I ate here last night and got food poisoning as a result. Would not recommend.", "author": "D D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-04-22", "description": "Iron Chef House is the place to get sushi in Brooklyn Heights. With a dim intimate interior, expert sushi chefs, a broad menu, reasonable pricing, and fast service, its hard to think of anything I didn't like. \n\nIn our trip here, Perry and I ordered the Love Boat, which came with soup or salad and a literal boatload of fresh fish and a few rolls. The fish was varied, from standard salmon, tuna, and white tuna, to amberjack, snapper, and fluke, tofu skins, and eel. Some pieces were sushi, some sashimi, and the rolls were quite tasty. All the fish was fresh, cool, and refreshing. There was definitely enough food for two people without feeling like we gorged ourselves. The Love Boat is definitely easy on the wallet, at about $20 a person. \n\nI definitely would love to come back and try something new on the menu. For now - YAY! I'm a fan.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-07", "description": "This place is \"the tale of two restaurants\". Thursday Friday Saturday, I give it four stars. The food is delicious and fresh. Just what you want when eating raw fish. Sunday Monday Tuesday, I would give it one star. They have no qualms about serving you all the tempura and stale rice. As a neighborhood restaurant that we've eaten at numerous times, as well as gotten take out from, I wish this weren't the case., On, folks. Get it together. A little quality control!", "author": "Adam S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-12-31", "description": "Iron Chef is a pretty standard Asian sushi place. It isn't as authentic as, say, Katsuei in Park Slope, but the food quality is excellent, with a lot of interesting rolls with varied flavors and some other good dishes.\n\nI especially liked the Never No Raw Fish bowl, a mix of different fish, rice and sauce. For the price you get a good portion for 2-3 people and the flavors are excellent. We also had the 2009 roll which beside from having some (again) great mix of flavors, it also was wrapped in lettuce, which made it very interesting and added a nice texture. This is my long way of saying that I am extremely impressed with how their rolls are put together and taste. \n\nPrices are reasonable and service is fast, though the place can get crowded, so if you were looking for a quiet sushi experience, this is not. Overall, I am very pleased with Iron Chef and if you find yourself in Brooklyn Heights and have a craving for sushi, check it out!", "author": "Nick M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-19", "description": "I don't know what happened.  The last 3 times I went there, service was just ok (despite not being very busy) and the food was not good.  I don't really appreciate being snapped at over the phone when calling for takeout. The pork katsu which was very old, dry and obviously had freezer burn.  Looks like some of the management or staff or ownership changed.", "author": "April Y."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}