{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-10", "description": "I love this place...the sushi is delish and the fish soup was so yummy!", "author": "Lisa M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-12-16", "description": "Okay, simple enough:  If you are a newbie to Sushi (cmon! dont be shy) and dont eat much sashimi, this place is not too shabby.\n\nThree of us came here on a Saturday night.  We ordered the Duck Rolls and the Shrimp Dumplings for appetizer, and we all ordered Bento boxes (sashimi, shrimp, salmon).  I have to say, the duck rolls were interesting and tasty (altho I am not a big fan of ducks).  The Shrimp Dumplings were made from frozen packs, thus disappointing.  The bento boxes are just okayyyy.  I do agree with other people's comments on the non-freshness on the sashimi.......\n\nOh, this place is run by Chinese (both waiting staff and kitchen staff)  How do I know?  I keep on hearing them!!!!!", "author": "Juan J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-13", "description": "I Love their sushi.\n\nTheir Salmon Rolls and House Seafood Soup Are amazing. \nI love their creativity and a big variety of different types of food choices.", "author": "Daniel B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-02-19", "description": "The sushi is always fresh, and the specials keep changing, serving up a nice variety of creative rolls. \nIt's small \u0026 familiar. A true local eatery.", "author": "Sara D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-08-24", "description": "This is by far the best sushi I have had since moving to Nyc. Its a little gem hidden in Bklyn Heights. This is Nobu quality sushi without the Nobu price tag. Inside the decor is nice and inviting, the servers are all very attentive. I try and eat here at least once every two weeks. My favorite roll there is the Kobe roll, its raw salmon on the inside and its topped with more raw salmon on the top, it has a hint of lemon zest tucked away under the salmon to give it that umami flavor in every bite. I have tried almost everything on the menu and have never tried something I didn't like. I took a friend there and he ordered the udon noodles. Just beware when you say you want it spicy like the Udon noodle for example they will be sweltering spicy almost inedible for most people, I had to polish off the bowl for him because he could not eat it.", "author": "David L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-26", "description": "This review is based on delivery.  I ordered their lobster roll, asking that the lobster meat not be fried.  This was repeated at least 4 times so I was pretty confident I was going to receive what I asked for.  Nope.  The lobster meat was tempura fried.  And for $17+ tip, I should hold off and buy myself a lobster roll from the RHLP since there wasn't much meat in the roll.  The atmosphere looks so inviting every time I walk by around dinner, but I think I'll try Ani Sushi next time I have a hankering for sushi delivery.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-04", "description": "Excellent sushi spot. Very personal and intimate which makes it a great place to take a date. Inexpensive and a nice variety of sushi to choose from. Great service and extremely nice staff. The sushi is amazing and fresh. Definitely a place I would recommend.", "author": "Kendel O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-01-01", "description": "For the past 5 years this spot has been on my radar and a once in a while place. I don't know why I don't come here more often. The food is consistently good and the service is great, always peppy and up to make a joke or two. Hard Rock roll is one of the best rolls here, gotta try it.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-03", "description": "I love this place. When it comes to sushi, it's all about freshness and Iron Chef delivers. I have known the owners for quite sometime and they are all about quality and service. I have never had a bad meal here. I know that they get the first pick of the fresh fish deliveries going to Brooklyn. That means fresh sushi for you. They are creative in both presentation and decor. The atmosphere is hip and modern, yet cozy and comfortable. I don't east sushi anywhere else in Brooklyn. Everyone i bring here is always impressed. Their vegetable miso soup is one of the best I have ever had and their special rolls are fantastic.", "author": "Kamuti K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-20", "description": "I like this place, good fresh sushi, waiter have great service. Very friendly. Nice environment?", "author": "Jack L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-05-19", "description": "The tempura was so GREASY. Each time I took a bite oil spewed out of it. I went ahead and ate most of it. \nHowever, when I got home I had the WORST STOMACH ACHE. \nBesides being so sick from the tempura I must also mention how the pork dumplings were served with ordinary yellow mustard (like French's) instead of a good Asian style mustard. I will never return.", "author": "Charlemagne R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-14", "description": "Honestly the sushi was deliciously and although we went on a super busy night, we never deserved to be basically asked to leave. We were there shorter than most of the people at the restaurant and when asked if we wanted dessert and we replied no the lady stated \"good, choice\" We were quite bothered by this, but decided to let it go. Now, we payed our bill to be kind and leave and our waitress came back to ask for more tip!!! First off, our bill was over a 130$ and ordered a lot, and left the amount of tip that we believed they deserved which was over double digits, even with kicking us out. How embarrassing! We asked to speak to a manager and she lies that there isn't one, well we got lucky and spoke to the actual manager that was in the back. She lied and stated she never did that. The manager was beyond kind, but sadly no matter how good a place is (food wise) customer service is key and because of that lady with short hair up to her cheeks, she killed it for everyone in there.", "author": "Jacqueline K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-09", "description": "Came here with the gf and we ordered the house love boat for 2. It came with a specialty roll and a bunch of nigiri and some hand rolls. For 45 bucks it was a pretty good amount of fresh sushi for the price. The waitress asked us what kind of fish and style we liked and told the sushi chef and that way he was able to customize the speciality roll to our liking which I thought was really nice", "author": "Brian M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-09", "description": "Iron Chef sushi was a totally unexpected delight. Ordinarily, I've come to expect generic things from sushi restaurants, but this place adds sophistication and playfulness that I didn't expect from a reasonably priced establishment.\n\nOrdered:\nMiso soup - well seasoned and punched up with scallions. \n\nBok Choi Roll - salmon and tuna wrapped in tender bok choi with sweet sauce. What a unique idea to replace the seaweed with exquisitely sauteed bok choi.\n\nVegetable Fried Rice - actually contained vegetables and a nice, deep, soy flavor, accentuated with the brightness of sliced green onions.\n\nPlus friendly waitstaff. This place is a great find - I'll be back.", "author": "Nirmal D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-08-28", "description": "This place is the best japanese restaurant in Brooklyn! The service and food is the best! I've never had a bad experience here...ever!!!", "author": "Sonia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-08", "description": "So, based on the service alone, it is clear this place is not actually Japanese run, but where they lacked in authenticity, they scored in freshness and flavor. And, when it comes to raw fish, freshness is about all that matters... \n\nThe Monkey Roll is incredible. Crispy shrimp tempura. Creamy avocado. Drizzled with a couple tasty sauces. Delicious. Delicious. \n\nThe Deluxe Platter was also a hit. Fresh tuna rolls, Caifornia rolls, and a handful of nigiri sushi. Very refreshing on a hot summer night.", "author": "Lans S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-09-09", "description": "Mediocre. Lunch special Sushi/Sashimi not so fresh. Dull, listless fish sans gleam of freshly sliced fresh fish. Won't go back.", "author": "Tom I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-12-12", "description": "This place is a hidden gem. We live around the corner and eat here at least once a week. The sushi is always good and fresh. Best part is the price! So cheap!\n\nOh and bonus points for presentation, they do a beautiful job on their rolls.", "author": "Chris K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-25", "description": "I live in Brooklyn, however; I have not been to Brooklyn Heights in a while. Last night while walking through the hood, I stumbled upon this place. The name alone \"Iron Chef House\" sounded inviting. I am so glad we decided to stop in. I ordered the aspargus roll and the chef's special kirrin roll and my friend ordered sushi ... sea urchin, eel, salmon, tuna, and couple of other items. All of it was delicious and fresh. My friend was unhappy with the sea urchin, was expecting the caribbean sea urchin but it was from California .. I honestly did not know there was a difference. Overall, I would definitely dine here again and recommend it to friends.", "author": "Roberta R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-05", "description": "I was always get takeout, but this place is always packed when I go pick up my food. It's clear why: the food is awesome. My favorite thing about this place is the fact that you can easily customize your sushi. I always need one or two ingredients that are normally in a certain type of roll to be removed or substituted with something else. They always say 'no problem' and charge the same price. They are super prompt even when it's wall-to-wall. There must be the hardest working sushi chefs in Brooklyn here. The ginger dressing on the salads is amazing. I wish they would bottle that stuff!", "author": "Shanora S."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}