{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2016-07-04", "description": "The food was good. The ratio quality/price is very interesting.\nHowever the service could have been better: please guys make an effort, we just want to spend a good time at your place and you were rushing us. \nThe waiters kept asking us if we were ready to order when we were barely seated.They came five times in 3-4 minutes, we felt really rushed and stressed. In the middle of the meal the waitress was already clearing the table of the sauce, etc. They came to ask us to pay in the middle of our dessert: in spite of the quality of the food, we wouldn't come back there again because of the service.", "author": "Anne K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-01", "description": "I cannot BELIEVE the bad reviews for this little gem!! Every single roll I have gotten here has been amazing. Try the Hana Roll and the Rock n' Roll... so good! The fish is fresh, they restaurant is always full but I have never had to wait, and the prices can't be beat. \n\nThe street they are on is full of sushi places, and this is the best one. The wait staff is also very friendly and attentive.", "author": "Taylor P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-04", "description": "I had a simple Salmon Roll. Rice, seaweed, salmon. Easy, right?\n\nNot so fast. The salmon was not a fresh cut of salmon, it was more of a ground mush of fishy flesh. I'm always skeptical of sushi places that don't offer up whole cuts. Who's to say that they aren;t cutting their salmon with a cheaper fish? A MYSTERY fish!\n\nThe flavor of the salmon was not quite right and I left feeling nauseous and disappointed with the affordable but slightly 'off' sushi. Will not go back.\n\nFile under: MEH.", "author": "Ryan N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-14", "description": "Great little spot that was easy to get into! Had a delicious bottle of saki, 2 apps, 2 meals for about $50. Truly worth every penny. The udon curry will be a regular for me!", "author": "Karina C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-08", "description": "Went for a lunch. It's a small and cozy place in Brooklyn. We were seated immediately, wait staffs are very attentive. They have really good lunch special price. We had sushi and California roll lunch box. It was better than expected. Sushis are very fresh and delicious. Would definitely recommend this place.", "author": "Jin H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-03-05", "description": "Used to love coming here but the last visit was disappointing.  The food was okay but the service was below average.  They wouldn't re-fill the drinks and got a few of our orders wrong and then instead of replacing the wrong item that they messed up on, they tried to sneak in for us to order extra.", "author": "Joe P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-20", "description": "They have a \"B\" out front and that almost made me turn around and find another place for dinner, but something told me to try it out. I am happy I did, because this is what I experienced:\nService = 4\nFood= 3\nAmbiance= 3.5\nMy rolls and soup were great and my husband's were also awesome. The service here is what brings up my review. I appreciate staff who go the extra distance to ensure your experience is pleasant. I will definitely be back!", "author": "C C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-17", "description": "I spoke too soon.I went back with a group if 7.  The duck appetizer was inedible although highly recommended by waitress.  The sushi not only was not as good as last time but the waitress ignored the fact one of us NEVER got her dinner. There are only about 10 tables in this tiny restaurant and it was obvious one person was sitting patiently with nothing on her plate while everyone else was served and eating. After asking for her missing meal at least 3 times, she finally gave up because everyone was done and it was ridiculous. Then the waitress had the temerity to mention to us that tip is not included in the bill.", "author": "Blair W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-08", "description": "I love this place! \n\nThe service is so good and the portions are HUGE! The prices are really cheap too. ($14 for a 3 roll dish or $17 for a combo of soup/salad/noodles/dumplings and 2 choices)\n\nTheir side salmon miso soup is very big and tasty. Our big group enjoyed the sushi rolls, the teriyaki, and the katsus we ordered. \n\nThe place is small. Seating is very limited, but they were very accommodating to our group of 9.", "author": "Hyme C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-21", "description": "I've never left a sushi restaurant with a fishy taste in my mouth and the worse part was that my husband also felt the same way.  \n\nThe food itself wasn't bad. We had the spicy appetizer and the Monkey Roll along with the Three Style sushi with spicy tuna roll.  Aside from the spicy tuna roll which was definitely fishy, the rest was tasty.  Far cry from the best I've ever hard or even delicious, but sufficient to satisfy our sushi craving if not for the fact that we should NEVER EVER EVER leave a sushi restaurant with a fishy taste in my mouth.  We were both so horrified that we feared that we had to run across the street to buy a pack of gum to get rid of the flavor and it took a while! I genuinely feared that I would get sick when I get home. \n\nI will NEVER return to Iron Chef.  Don't be mistaken by the packed house, there are better places nearby, namely the one across the street which is DEAD, but SUSHI is unbelievably fresh.", "author": "Kathy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-25", "description": "The sushi was very good however I wasn't too pleased with their appetizers. The service was great and staff was very friendly! Small place so I can see it getting very crowded on a busy day and the wait may be too long.", "author": "Anel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-03", "description": "I've eaten at the restaurant and also had delivery/take out several times and the food is consistently really good. The Hana roll is the most interesting and delicious roll I've had, ever. One of the best spots in the neighborhood. The fish seems pretty fresh and it's a very clean establishment. This is my go-to spot for sushi.", "author": "Daniela L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-30", "description": "NOT WORTH MAKING A RESERVATION. Went right on time for the reservation and were told we had to wait until after the group without a reservation to be seated. Then, an obnoxious group, who had missed their reservation by a good whole hour, just bombarded in, pushing everyone waiting into a coat rack and the staff seated them first before even the group before me without the reservation could be seated. Hey, if you miss your reservation, you make another reservation or you wait. Such ill mannered people. IF YOU WANT TO GET SEATED ON TIME, LESSON LEARNED. MAKE A RESERVATION 1 HR PRIOR TO WHAT YOU WANT.\n\nFood was decent. I would say 4 stars for the food. Sashimi was not as fresh as I would have liked, which was apparent from color and taste. The dinner special was pretty good (Decent taste and large portions for a great price). The Hana roll was pretty good but the regular Salmon roll not so much. Price was pretty good for the amount and quality of food. If you want to go for sashimi, this place is more of a fusion sushi place. The relatively younger taller waiter and waitress were nice. There is also a short chubbier older lady that is extremely nice. The older shorter skinny woman was just plain rude.  IF YOU RUN INTO A SKINNY OLDER CHINESE LADY, ASK FOR ANOTHER WAITER/WAITRESS.\n\nI was so pissed that I had to wait 1 hr passed my reservation to get seated and then, when trying to ask a question, rudely dismissed  by an older Chinese lady, who seamed to be the manager or owner, that I don't think the food is worth bearing that kind of poor treatment (hence the 2 stars not 1 since the food was pretty decent for the price). IF YOU WANT TO TRY THIS PLACE, EXPECT A LONG WAIT.", "author": "E Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-24", "description": "My coworker brought me to this plave and I strongly recommend whoever loves Asian food should try. I love their Monster and Salmon skin salad. My favourite!", "author": "Tiffany W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-30", "description": "The Iron Chef has some of the best Sushi in the area. Obviously if you spend more, you get better quality so I like to be able to order what ever I want when I come in. But even the low cost to average sushi is great here. The presentation is very appetizing, and I have yet to not like a meal there.", "author": "Clarence M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-13", "description": "This is the first time I've had good sushi in Brooklyn. I was very impressed by the quality of the fish and and menu items. Highly recommend for take out.", "author": "Kia R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-27", "description": "Friendly fast service.\n\nWarm lighting \u0026 decor.\n\nExcellent food.\n\nMy friend ordered for me, which was incredibly helpful as I am just dipping a toe into the world of sushi.  But everything was so good!  Since this place is just a block away from my apartment, I foresee a few trips back in the near future.", "author": "Krista J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-01-28", "description": "Smoked salmon fried rice was incredible, $7 for a large portion, super moist with chunks of salmon.\nAlso tried Alaska roll ($4.50), good but nothing unexpected. 2019 roll is delicious, wrapped in slightly cooked Bok choy ($11.50).\nTwo of us went, and each got a roll, and then split the fried rice - perfect portion.\nSpace is decently sized, and they have a big table you can reserve for a group, looked like it could fit 6-8 people, easily, maybe more.\nFour stars because the staff was SO overinvolved. For example, I took off the paper chopstick cover, folded it into an origami swan, and then dropped it on the table. I swear, fifteen seconds later, one of them darted over, swiped it off, and threw it in the trash. They give you a pitcher of water for the table, but it doesn't matter, because they'll come and refill your water as soon as you take a sip.\nWorth it, and I'll come back, but their hovering was really annoying.", "author": "Audrey C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-03", "description": "Me and my girlfriend stumbled upon this place for dinner after searching for what to eat while in the Brooklyn Heights area and saw that this place had good reviews and decent prices. I'm giving this restaurant 5 stars mainly because it is very good value. \n\nWe ordered assorted tempura for our appetizer, and shared a monkey roll and sushi \u0026 sashimi combination. The vegetable tempuras were fried very well and they were crispy. I love the broccoli tempura, as well as the sweet potato tempura. They are also excellent at making shrimp tempura. The monkey roll was also delicious and slightly spicy. I was very surprised at the size of the sushi \u0026 sashimi combination. For $20, we received a large dish of fresh sashimi   and sushi. The Sushi \u0026 Sashimi combo comes with yellowtail, salmon, white tuna, and red tuna sashimi and sushi, and a California roll. It can definitely be shared between two people, but you might want to get another roll(s) to be full. For the final price, $36.25, this was a great deal for the quality of sashimi/sushi that we got. The fish was very fresh and tasted delicious and the service was great as well. We were also very full by the end.\n\nThe ambience of the restaurant is also great and is  a good spot for couples and small groups. The place is small, so if you don't like waiting, make sure you come early or make reservations.\n\nWill definitely come back here to try their other sushi. I would like the try the love boat next time.", "author": "Jeffrey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-03", "description": "The fact that I walked in there and told them I wanted omakase (Chef's Choice) but I needed it gluten free I figured would be tough enough... But they handled it with aplomb. Solid place. Good food.", "author": "Kurt C."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}