{"aggregateRating": {"reviewCount": 380, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-01", "description": "I'm not even a sushi person and I love this place! My friend who goes to Pratt swears by Iron Chef House for her lunchtime sushi fix. I have to admit, the rolls are pretty amazing here. My favorite is the definitely the monkey roll. I'm the type that is hesitant to try anything other than a California roll at sushi restaurants yet I found myself adventurous and trying new dishes at this place. I trust that the fish is fresh and usually combined in a way that makes me forget I'm eating raw fish. I love how cozy the atmosphere is too. Definitely worth a stop by if you're in the area.", "author": "Irm M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-07-23", "description": "I've come here consistently in the past 5 years.  Great place for sushi!  Near the 2,3,4,5,R,A trains.  Restaurant could use an upgrade.  I typically order the sashimi platter, and just love how they put it together.  Their soups are always delicious too.  If you're in the area, and craving sushi - stop by.  You will enjoy the food for sure!", "author": "Michael C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-08", "description": "Hidden neighborhood gem in Brooklyn Heights. Really easy to get to as it is right off of the Clark St. 2 and 3 train station stop. Don't let the bridges or tunnels stop you from enjoying a quiet Weekday night dinner at Iron Chef House. \n\nPrices are very reasonable and the food is amazing. The lotus root appetizer is great way to start the meal. The special rolls are usually your best bet for the buc. Two special rolls and an appetizer and you should be more than satisfied.  Spicy lobster roll recommended. \n\nNo complaints about the decor and service either. Very zen and peaceful atmosphere where you can just relax and enjoy some fresh sushi.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-18", "description": "Came here last night for dinner with a friend. The people who work here are very friendly, welcoming, and helpful. I ordered the Monkey roll and it was delicious. My only complaint was that the shrimp tempura inside of it was a little too heavy on the tempura and light on the shrimp - but it was SO AMAZINGLY CRUNCHY. Which is a gooood thing. Overall, that, being my only complaint, it was still worth 5 stars. A good sushi spot!", "author": "Katie D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-10", "description": "Their specials and appetizers are pretty unique. The prices are decent and the service is good. Order the fried bamboo shoots", "author": "Oscar A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "This was my go to sushi spot while living in the dorms across the street. why? It was literally the best and most affordable and cozy sushi spot around! they have simple yummy options, unique rolls and cooked food for those who are raw-fish weary. I fell in love with how cute and intimate it is, great for lunch or a date! never had anything but an awesome meal here!", "author": "Devin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-11-22", "description": "I can not think of anything to take a star away for! Everything was just perfect!\n\nThe best unagi I have ever had, some of the specials I have ever seen, and the spicy lobster was fantastic! Even the music was perfect for a great sushi place. I hate going to a Chinese or sushi or anytype of foreign restaurant and they have R\u0026B music playing! Nooo! This is a sushi place yet should have those really cool Chinese music playing.\n\nThe iron chef house had perfect music and a great presentation.  I felt like I was in china or japan, even though I have never been there, it did not feel like America and that is how it should be.\n\nThis place provided a great lunch at a good price and it gave a great experience to a Texan like myself.", "author": "Alex R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-13", "description": "Nice ambiance, the decor and lighting set the mood. To top it off, the rolls I had we're very good. Salmon skin, salmon, Cali and the miso soup was very tasty. Definitely will be back.", "author": "Wayne H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-06", "description": "I have eaten in and done takeout here.  A nice little place with friendly service and fresh, tasty sushi at a reasonable price.  I have tried a variety of their traditional sushi rolls as well as some of the special ones and I have always been satisfied.", "author": "Todd A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-11-02", "description": "First time eating sushi in brooklyn. It's my bf's fav place so of course he had to take me here. Cute small japanese place. We sat at the corner table for privacy and got hot sake since it was freezing outside. Started with 3 diff appetizers. I\"m more of a sashimi person, but this place is def good for their rolls, we then went out to order 4 more rolls. By the end we were both extremely full and still couldn't finish the plate, and we both eat ALOT.  We had another bottle of hot sake towards the end. Total bill he said was only 80 for the amt of food and alcohol we got. Pretty damn cheap. Love the waiters, very friendly and nice", "author": "Shelley C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-07", "description": "A coworker took me here for lunch. We ended up having a sushi bento box. Its not your typical box, it comes with noodles, 2 sumai, soup, salad and we asked for spicy tuna rolls. We were enjoying our good and all of a sudden a swarm of fruit flies start buzzing by us. It was gross. We quickly finished our food and ran out. \n\nThis place would have gotten 5 stars, great spicy tuna and price, but I had to deduct some stars for the fruit flies. I'm glad it was at the end of our food.", "author": "Tassamai S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-09-21", "description": "One of my favorite sushi places in NY! I stumbled upon this restaurant over a year ago when I moved to the area, and I couldn't stay away. They have some really great rolls and fun holiday specials. I went for lunch on Valentine's Day, and they had some really tasty treats! This Iron Chef wins in creativity, taste, and artful presentation!\n\nThis is a fairly boutique-sized place, so it's a really cozy neighborhood spot.", "author": "Olivia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-15", "description": "The sushi was INCREDIBLE!! After a long day exploring the prospect park zoo, we were absolutely starving. It was a gorgeous day, so we decided to take our sushi to go and sit down by the promenade. \n\nEverything was packed up neatly and there was more than enough fresh wasabi and ginger. \nI had some of the most delicious miso soup ive ever eaten, and that's saying something for someone who eats sushi at very least once a week. \nWe shared an incredible rainbow roll, along with a \nSpring Roll (tuna, salmon, white tuna, asparagus, green mix wrapped with pancake without rice) and one of the most AMAZING rolls I've ever had, a Spicy Phoenix Roll which had eel, tuna, and mango on the inside and topped with crab meat and mixed nuts. the mango added a fresh kick to the roll. delicious and unforgettable! we are still talking about that roll a week later. i cant wait to go and actually dine inside!", "author": "McKenzie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-12", "description": "Spicy seafood soup is amazing! It's a bit noisy in this little out of the way spot but the sushi is delicious and the service is prompt, friendly and attentive.", "author": "Pepper P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-16", "description": "Walked in for lunch. They seated me right away. They were able to accommodate my dietary restrictions, the food came out quickly and was fresh and nicely cooked. THE WAIT STAff was a bit overwhelmed and forgot to bring me something I asked for. But the speedy service, quality and the price ($9 for a nice healthy lunch) made it all a good experience.", "author": "Annie L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-16", "description": "I absolutely love this place.  My friend introduced me to it and I've been obsessed every since.  I always get the jalapeno yellowtail appetizer, salmon fried rice, monkey roll, and 2008 roll.  Always tasty.  Always satisfying.  Yum!", "author": "Quinn B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-10", "description": "This is one of my favorite sushi places in the city! It's always fresh and delicious. (Note: I get rolls, not sashimi.) It's definitely good quality fish at reasonable prices, and though the space is a little tight, the atmosphere is pleasant and the service is always quick and friendly. I've never had food here that I didn't like.\n\nIf you're going to go in the evening, it's worth calling for a reservation, as it's a small place that gets crowded.", "author": "Kat S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-14", "description": "This place has great sushi. I probably visit once per week. And the never know rice bowl is awesome!", "author": "James S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-09-18", "description": "Just got off a flight from San Diego and I'm visiting NYC. \nIt's about 8pm, and of course I'm starving. Out the door to the unexpected city that never sleeps! I'm already feeling a love that I once had with this city and it's all coming back! The air is crisp and as nuts as this sounds, I love the smell of a little dirt in the air, makes me feel like I'm at home (which I am)...... (San Diego is of course known for the fabulous weather, and of course, clean air.) I have a smile from ear to ear.\n\nAfter jumping from the N, to the 2-3 train, we have arrived in Brooklyn Heights. A Beautiful neighborhood. Destination \"Iron Chef House\". \nSmall quaint sushi restaurant. The lighting is dim and specks of red lighting surrounding the restaurant. \n\nHostess sat my girlfriend and I in probably the worst table. In the corner of course next to the bathroom. Which I'm totally for being near a bathroom since I am not shy to say but suffer from IBS. \n\nOnce seated, and I'll add seated so close to the next couple over, you can hear every detail in there conversation. Ironically the girl sitting next to me was on the same flight as I was. Weird? No, that's nyc for ya. Anyway I ordered my usual miso soup with out the crunches and a Valentine roll and green tea. The food was ok, not the best. The price was average about $12. For the roll and 3 or 4 bucks for soup. No big deal. When we were finished our meal, another friend had joined us. Making it difficult because of the seating was so tight the couple next to us seemed a bit annoyed. Not my fault this place is so small. With three ladies catching up on some dirt, we were saying inappropriate things that offended them by the looks on there face. We were talking about normal things sex, sex, and what else sex. What else does a group of ladies honestly talk about when they go out to dinner? So I do apologize for that, but come on if you were looking for a date atmosphere this is not it.\n\nThe price matched up to the service. I had to constantly look around for my little Asian waitress to even remember that we were stuck in the corner. Food came out quick. But then....oh no....ooh Christ! Thank god the bathroom was there... When I eat sushi and that happens, to me that mean's it was bad sushi, right?\nI've only gotten that a couple other times at Sushi Deli 1 in downtown SD. And there sushi is pretty cheep.\n\nIn the end with my being happy that I was in NYC, I honestly didn't care really that the service kind of sucked, and my tummy ended up doing flips. \nNothing a Mandarin and soda can't calm down at the bar down the street. And that my friend will be my next review, a bunch of Italian stallions.........", "author": "Clarice H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-08", "description": "this place is REALLLLLLLLLLLY small. i came here for sushi a while ago based off a recommendation from a friend who claimed they make lobster REALLLY GOOD. not quite the case. i'm also not a fan of places that go wild on creating these fancy pants rolls. if you are enjoying sushi, you should have it at it's natural state, with soy sauce and some wasabi.. not with all these funky sauce additions, flakes, and whatever else concoctions. i'm not against having it every so often but  truth be told these types of rolls were made to attract non japanese sushi eaters who aren't familiar or arent keen on eating sashimi at it's raw state, and to mask the discomfort. my experience here wasn't bad but it wasn't good. i have my special sushi joint that is wayyyy cheaper, and wayyy simpler. my kind of style.", "author": "Sasha C."}], "servesCuisine": "Sushi Bars", "priceRange": "$11-30", "name": "Iron Chef House", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "92 Clark St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/7kn00LGJ3dMufIJMXXenow/ls.jpg", "@type": "Restaurant", "telephone": "+17188588517"}