{"aggregateRating": {"reviewCount": 188, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-06", "description": "First time trying Mexican food. I love the food. \n If you have a sensitive digestive system like myself Mexican food is not for you unless you'll be eating at home near a bathroom!!\n\noverall the people were nice \nfree soda refills\nplace to sit and eat\nalso somethings during rush hours it gets really packed.", "author": "Nora A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-30", "description": "NEVER go there at lunch time or you'll find the queue leading out the door and will have a timely wait.\n\nI do however love their food especially the vegetarian or chicken burrito. I feel their portions are a bit large and messy so be careful not to let it drip all over you while eating or ask them to lessen the filling so that your burrito is easier to manage.\n\nI like that there is upstairs seating to accommodate the numbers and that they take debit or credit cards but overall it's nothing fancy, just your average take-out spot with really tasty, healthier food.", "author": "Liesl L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-10", "description": "I put in an order through the app, so everything was right there for them, in writing. I got my food home and they gave me a burrito bowl that was literally just white rice and meat. No beans, salsa, cheese, sour cream...just meat and rice. They also got my sister's burrito completely wrong. We tried to call and nobody picks up. I'm so annoyed. Now I have to cook.", "author": "Jen R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-01", "description": "Meals are same as at any other Chipotle, staff is polite and quick with orders but the place in general is very loud and not comfortable to stay. Sometimes they put the music on and its pretty loud. In other cases there is a bunch of teenagers who make a mess. Seats upstairs are much better, but not always available.", "author": "Kirill V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-05-08", "description": "This is a fine Chipotle - well run, pretty friendly, and relatively spacious.  My wife and I think it might be the best mexican-ish food around where we live, which is a sad commentary but is nonetheless probably true.\n\nHaving said all that, I think this review really should be an ode to the economics of running a chipotle.  This place is always full, and there's always an enormous line.  Either the owner is minting cash, or the profit margins on this kind of food (especially, I suppose, in a big city) are worse than I imagined.  For heaven's sake - the average ticket per person must be upwards of $10.  For high volume fast food.  How could they not be making huge sums of money?  Would love to sit around with Chipotle management and talk food costs\n\nAnyway, I like the Chipotle on Montague.  Order online, and all your problems will be solved.", "author": "Raffi M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-22", "description": "It's a chain place. That being said, I've come to respect Chipotle more and more over the past 5 years. I actually came across a Chipotle in Midtown East that served white rice AND brown rice options. Huzzah! Now we just need them to offer whole wheat tortillas and we're in business.\n\nAt Chipotle, I always get either a chicken fajita salad with no rice and gauc on the side or a chicken burrito with no rice, black beans, veggies, salsa and guac on the side. If I'm feeling very naughty I ask for a minuscule amount of cheese and a DROP of sour cream. That adds up and you know it!\n\nThe people at my neighborhood location on Montague are always pleasant and the space is kept clean. I also love it that the guacamole is a tad cheaper here than the locations in Manhattan. There is often a long line during lunch hours on the weekends but it moves fast and efficiently.\n\nOn a personal note, I wish Chipotle wasn't sleeping in Tabasco's corporate bed... All the hot sauces in every single establishment are all by Tabasco. I would prefer Frank's or Cholula or Tapatio to Tabasco on my burrito!", "author": "Leslie D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-14", "description": "Stay away. Worst Chipotle I've ever been to. Manager will make sure to cheat you on the amount of chicken and guac he serves you. When I asked for a little more chicken given the super small amount of over cooked chicken, he have me a dirty look. Grilled fajitas were not grilled at all. They take advantage of the popularity of the Chipotle name, but won't last.", "author": "Rafael L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-07-28", "description": "$11.25 for a shredded beef topped salad and a little bottle of Poland Spring? An extra $2.25 for a scoop of guacamole??? Why Chipotle? Why are your prices soooo high? The food is good NOT great yet I find myself in here at least three times a year for salads or burritos and feel like a jackass for it every time.", "author": "Tanya R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-08", "description": "Got a steak \u0026 guac bowl, black beans, tomato, corn, cheese. It tastes amazing on a cold and windy day :)", "author": "Paddy C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-20", "description": "I come to this location quite often (2x/week sometimes) and am a fan.  \n\nThe best thing about this Brooklyn location is it's cheaper here than at the Manhattan locations.  \n\nI love the chicken fajita bowl.  \n\nSometimes, their operations are not the most efficient.  During those days, it's usually clear what they need to do.  This is what I'm thinking about while waiting in line.  For example, they should move the 1 person serving just the meat over to a second register.  Throughput would be so much larger and the queue would move faster.\n\nNonetheless, always a good option for lunch for me.", "author": "Ray M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-22", "description": "This Chipotle will send you from the back of the lines to out the door in a flash. The employees work fast and efficient to give you your delicious order super fast and super yummy. Be sure to order from the secret menu! You could order Nachos, a quesadilla, or the legendary Quesarito! A burrito wrapped in a cheese quesadilla! If you happen to work in the area or go to Saint Francis College you should give this place a look. Happy eating!", "author": "Christopher B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-27", "description": "I absolutely love this Chipotle. It is so much cheaper in this one than the ones in the city! \n\nOnly downside is that from 11-2, it's lunch time, and everyone working in the nearby law/office buildings get lunch at Chipotle, so the line is ridiculously long. Also, expect long lines at 5-6.", "author": "Angel H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-18", "description": "Is it me, or is chipotle slipping a little bit? I mean the food is still good, but it's slipping. The taste of the food has fallen off a little bit and the portion sizes are shrinking. The last time I was in there I had to tell him to add a little bit more to my bowl. The lines are still very long at lunchtime but they move kind of fast. And are the prices going up a little? Smaller portion sizes and prices going up, I don't know maybe it's  just inflation?", "author": "Carl B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-24", "description": "Not bad but they're  a liitle too much trying to rush the customers couldn't even hear wat i wanted because they're rushing so much", "author": "Tissy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-14", "description": "Chipotle is where I \"Go To place\" when I can't think of anything to eat. It's always great - no matter which part of the country they're in. I've been to so many Chipotle franchisees (in NJ, NY, OH etc) and they're all great.\n\nMy fav. - Chicken Burrito Bowl. Here's how my bowl looks like:\n\nVerry little rice (although I remember 1 Chipotle franchisee, Motor Parkway, Hauphauge, NY - which started serving brown rice - cooked similar to the way they do their white rice ...that is an awesome idea)\n\nBlack Beans\nChicken\nFajita veggies (onion \u0026 pepper)\nLots of fresh salsa\nsome roasted chili corn salsa\ncorn\nvery little sour cream \u0026 cheese\ntop it off with some Lettuce.\n\n\nSqueeze a lime all over it \u0026 sometime I add Tabasco and/or Jalapeno sauces.\n\n..and then I clobber it all down. \n\nsome days, I would also have a Nantucket Nectar juice to wash it down\n\nHealthy...Tasty....Eternal Bliss!  Aaaahh!", "author": "Gaurav G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-08", "description": "I love their chicken burrito bowls!  It's less messier to eat than a regular burrito, especially if you have to go back to work.  \n\nOne of the reasons why I like this Chipotle location, besides the fact that I work close to here, is because there is additional seating on the second floor.  \n\nHowever, the lines here can be out of this world during lunch time.  The only times that I've seen where the line is not snaking around the restaurant is if it's pouring outside or if it's snowing.  Sometimes, to speed up the process, they do have a staff member taking your orders while waiting in line (only if paying by credit/debit card), and when you get to the cash register, all you have to show them is your receipt, they stamp it, and you're on your way out!\n\nDespite the long lines, if I'm craving for Chipotle, I will wait on that line, even if the regular line is on average 20-25 minutes long.", "author": "Helen F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-05", "description": "The line is pretty discouraging pretty much like every other chipotle in the city but don't worry they move pretty quickly. It's chipotle so you already know what you're getting but the customer service here is great.. Good amount of seats you won't be disappointed.", "author": "Aisha M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-17", "description": "Damnnit I hate the fact that I am giving five stars to a chain restaurant, especially in NYC. I'm not certain the coloquial definition of \"fast food\", but I suppose this qualifies. The thing that separates Chipotle, as I'm sure everyone knows, is the freshness and quality of the ingredients. There's always fresh meat coming from the grill to the chopping board to be enveloped in freshly pressed tortilla wraps. \n\nMy fix: Chicken fajita burrito with mild salsa + a little medium, corn, sour cream, cheese and lettuce. I don't request the crack to be sprinkled on it but I know it's added at some point in the assembly line. \n\nThis part is kinda gross but my favorite thing about Chipotle is every time I burp for the rest of the day I get a little taste of the deliciousness. Sorry, but it's true. And delicious.\n\nAnyway, Chipotle rules and the line (during the random times I've been there anyway) aren't crazy. There's been more than one occasion I've been in and out the door in three minutes. \n\nAlso, I can eat two burritos in ten minutes. It's a fact. I may try three in 20 if I'm dared.", "author": "Mike D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-16", "description": "They suck, they lied to me on the phone, messed up my order and treated me like crap, they also tried to charge me after they promised to me give me a 50% discount after messing up my order. this place sucks big floppy donkey $)\u0026$", "author": "Juan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-12", "description": "The staff at this location are pretty on point. They can overdo the sour cream sometimes as well. My fave is the steak bowl with everything! The Sauza margaritas I thinn are better than the Patron. I've always gotten fresh, fresh food! Beware during the week the teens are in here full force.", "author": "Tawana C."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Chipotle Mexican Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "185 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/5nLCvrULiYvmUFITZW-k-A/ls.jpg", "@type": "Restaurant", "telephone": "+17182439109"}