{"aggregateRating": {"reviewCount": 188, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2012-02-28", "description": "There was a long line ... At 9:30 pm. Really? It moved quickly though. They weren't as friendly as the other Chipotle in the Village, the food wasn't as good either. Eh. It was a few dollars cheaper and satisfied my fix so that's all that matters. \n\nSidebar: I did a little calorie calculation, yikes! I think I should take it easy on the burritos for a while. :c(", "author": "Vana C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-12", "description": "Line moves quickly during lunch so don't be taken aback if you see the line all the way to the door. Food is fresh but my only issue is that my tacos were cold since I don't think they heated the flour tortillas enough. Other than that, if you are a fan of chipotle, this one is a decent option.", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-30", "description": "Unbelievable, i ordered a steak bowl and the guy giggled to his partner and said i should be sticking to tofu.  Poking fun of someones weight is unreal.  Especially when my order costs more then you make an hour.", "author": "Deon S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-12", "description": "I frikkin love this place. Not hungry enough for a whole burrito/burrito bowl? It's not on the menu but ask for a quesadilla with your meat of choice and they'll whip it right up. Come in at the wrong time and the line can go on for days but it moves quickly. Sure they have their off days, under cooked rice once, too salty guac another time but definitely more home runs than strikes. They aren't stingy with the toppings either. Definitely my favorite spot for quick and tastey food!", "author": "Corrin Y."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-01-07", "description": "Went back to see if I could get some kind of compensation, like a gift card for my problems but instead got  a \"bring a friend\" coupon. If I bring a friend, he'll get a free burrito and lousy service.", "author": "William V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-23", "description": "Seriously, who doesn't love chipotle?! I'm in the nieghborhood pretty often because my school and gym are near, so chipotle (CH) has become one of my fav lunch spots. However, as many Chipotle devotees, may tell you, what may start out as an occasional hankering can quickly become an addiction lol. \n\n It is located near a couple of colleges and school, so in addition to the locals and nearby employees,  there is a fair amount of young people who dine here but they are pretty tame and I've never seen them cause a ruckus.  \nMy one gripe with this particular store is the people behind the counter. While on the whole, the employees due a satisfactory job, there are  certain employees, when I see them, I sigh because I know they will get my order wrong. It seems as if they are either in too much of a rush to fill your order or they're simply not listening carefully to customer requests. The assembly line prep of the food is quite efficient, IF the the ingredients you asked for are actually included! \n\nSpeaking of ingredients, IMO, everything from the onions/peppers to the guacamole are fresh and delicious. As someone from a carribean culture, rice is a staple in my diet and as such, I have high standards when it comes to it. I have to say that I am amazed if a fast food place can provide decent rice and Chipotle surely does deliver on that end!  The one exception to my love affair with Chipotle's food, however, are the carnitas. To me, they were pretty bland so that's a selection I won't be making again. \n\nI've been to a couple of other chipotles, but overall,  this particular one is my favorite . Its big (2 floors of seating), there are multiple bathrooms, and of course, the prices are cheaper in comparison to it's manhattan counterparts. Sure, a meal here may cost you more than traditional fast food places but you're paying for quality and the cost difference is about $2, so it's not as if you're going to be breaking the bank.  In a world full of prepackaged food and fried something or other, CH is a fresher, tastier and healthier alternative! \n\nBonus Tip: if you like the burritos but you feel as if they're too big/ too much food for you, order 2 soft shell tacos and ask them to fill them with whatever you'd normally put in your burrito..its like 2 mini open face burritos!", "author": "Cassandra B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-01", "description": "The food was great, but the service sucked. I went tonight and the employees were super ghetto and rude. Prob won't go back to this one again.", "author": "John S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-01-31", "description": "I've eaten at many Chipotles on travel because it's (relatively) healthier and quick.  I have to say this is by far the worst Chipotle I have been to.  The staff is somewhat rude and tries to push the line along despite the bottlenecks. (I.e., nowhere to go).  But worst of all - last time I ate the Chicken bowl it was disgusting.  The chicken taste like left over giblets, bone, fat from the wrong cut of meat.  Maybe that was a one off experience, but the portions are always lackluster as well. Luckily they opened a newer location by Metrotech so I started going to that one.", "author": "W J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-04", "description": "I love Chipotle and in general, I like this location. However, I am now scared. On my way out, I noticed their \"C\" rating from the health department. Ugh! Why didn't I see it on the way in! I won't return until their rating is higher.", "author": "Emily C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "Every once in a while I like to enjoy a rich naked burrito bowl with chicken grilled to perfection with great selection of salsa along with Guacamole and cheese.", "author": "Pluto G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-23", "description": "This location should be called CHEAP-otle.  It's about $2 less for my order than I pay in Manhattan.  A few years ago Chipotle jacked up the prices in NY, but skipped the outer boroughs, and I take full advantage when I'm nearby!\n\nDisclaimer: I'm a chipotle fanatic, and have probably been to most of their NYC locations, but for price and seating, this (along with the one on 18th \u0026 8th in Chelsea) is one of my favorites.\n\nThey have an upstairs area that is rarely full despite the huge crowds, and the long lunch lines move quickly.  They occasionally use a mobile POS (register) device to speed up the process.\n\nOnline ordering is available if you want to bypass the line, but whenever I see someone picking up their order at the register, the cashiers seem a bit inconvenienced and overwhelmed trying to handle the order while staying attentive to the huge moving line they're trying to ring up.", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-03-24", "description": "I love chipotle but this location is pretty horrible. The staff and managers are rude and the food is inconsistent. The white rice is often overcooked or completely flavorless and the chicken isn't always cooked enough. They also refuse to correct mistakes. When a burrito rips or they put the wrong topping on they just expect you to take it and talk back if you say something. They also think they can get away with talking about customers or telling each other to give you the old ingredients so they can put new ones out by speaking in Spanish, but I can absolutely understand what they are saying and it's just rude. The line gets backed up, and one time I asked for guac without being able to see it. When I got up to the counter I saw that it was completely brown and asked them to make me a new bowl without guac but they refused, assuring me that the guac had just been put out. It didn't taste right so I pushed it to the side, but I got sick and was throwing up all night.", "author": "Jeri E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-23", "description": "I am a regular at this Chipotle and it is a chain.  \n\nConsistency is standard of any other Chipotle.  The line can get long around Lunch Time.  If you are looking for a quieter setting venture to the up stairs seating and you will be pleasantly surprised.  The girls that actually prepare your food are cool.  I talk to them in Spanish so it makes it easier to order and receive what it is that I want.\n\nThe clientele wise brings about an interesting mixture of hipsters, law enforcement, lawyers, and 20 some year olds.\n\nDecor Wise: Upstairs is better than downstairs.\n\nUnderground Business:  Lower Level restrooms have to be unlocked by the cashier whereas upstairs they are open and unlocked.", "author": "Carlos S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-13", "description": "Used to be my favorite Chipotle location until Greensboro, NC and ATL, GA happened *sigh*. I'm noticing that the NYC locations aren't as good as they used to be. This location has gotten incredibly crowded within the last two years so the quality is lacking and food runs out. HOWEVER, Chipotle is Chipotle...if you need a quick fi and you're in the area JUST DO IT!", "author": "Shari S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-27", "description": "Another one of my lunch time spots. The food is fresh and I will say that you get in and out of here quickly...granted you don't have any STUPID asses in front of you that hem and haw and never know what they want to order (because the menu changes everyday, right?\n\nAnd the manager is awesome :)", "author": "r b."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-09-25", "description": "I love chipotle but I will NEVER come back to this location. We ordered ahead and when we picked our meal up the portion size was terrible I had tons in my bowl and and my fiancé and barely half in his and as I was eating there was a Huge leaf in my food!!!", "author": "Shannon M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-22", "description": "Order online and skip the long line!", "author": "Piper M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-05-22", "description": "For $8.71 you can feed 16 supermodels for a week.*\n\nSteps to a \"healthy meal\" :\n\n1. Order the burrito in a bowl.\n2. Choose your beans - black or pinto. (16 models choose black beans)\n3. Choose your meat - chicken, pork, beef. (16 models choose chicken)\n4. Add your extras - Models choose salsa, cheese, guacamole, corn. \n5. Look up the nutritional information to confirm how \"healthy\" you are eating. (16 models run to the bathroom)\n__________________________\n* Fine, I ate the whole thing myself.\n\nThere were not 16 supermodels on Montague St., but there was a line that took 13 minutes. I toughed the line out, which moved quickly as they are very efficient at this location. The interior is clean and has two levels in which to consume your fast-food Mexican fare.\n\nTo be completely honest, the food here is pretty decent. However, as long as YOU continue to call this a \"healthy\" alternative, YOU may end up FAT.**\n___________________\n** Stop looking at me like that. I know I should have had half for lunch and half for dinner, but it was good.", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-23", "description": "I like Chipotle in Brooklyn.  FIrst of all, the prices on Montague St.  are more affordable than Manhattan.  Secondly, the decor is more welcoming than other fast food chains.  Thirdly, there are choices in your burrito making, which also adds to more confusion.  I think I waited about 20 minutes before I had time to place an order, so it would not be the best place in a hurry.  It would be great if you wanted something filling and was in Brooklyn Promenade neighborhood.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-21", "description": "a place that waters down the soap in the restroom! I wonder how the employes are handeling the food!!  discusting!!", "author": "The R."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Chipotle Mexican Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "185 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/5nLCvrULiYvmUFITZW-k-A/ls.jpg", "@type": "Restaurant", "telephone": "+17182439109"}