{"aggregateRating": {"reviewCount": 188, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-03-10", "description": "The dirtiest chipotle I've ever been too. Everytime I pass by the grade is always different. It has been a C which does not surprise me. I've eaten from here twice and both times my chicken was over salted and crunchy. Idk if this was because I got the bottoms of the barrel chicken or because someone over cooked and over salted. I will not be back.", "author": "Lucia C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-08-22", "description": "Ubiquitous Mexican in NYC...sadly before moving west, I thought this was the best Mexican for the price. Yes, for the price it's decent, but really nothing special. The chicken salad is the best option, I feel...a lot of food and salad too, so you get to balance the unhealthy with the slightly (barely) more healthy. Although when you throw on all the toppings, it's basically a net zero. I tend to get all the sauces and things to make up for the price. This location was cheaper than all the other NYC ones though.", "author": "Dan M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-08-11", "description": "Very generic. Large lunch crowd.", "author": "Juan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-06", "description": "Good food and extremely friendly staff!!! The line moves quickly and the staff is always friendly and smiling! My favorite Chipotle to go to!", "author": "Amy A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-09", "description": "This is going to be biased because I love Chipotle. This is one of my favorite locations because 1) its in Brooklyn and 2) its pretty lowkey in comparison to most Chipotles I have been to. The servers could have moved a bit faster (it did not help that a big Russian muscle head and a black guy were arguing over who orders their burrito bowl in line first....I didn't know my meal came with a free show, why not? *sips tea*) but nonetheless, I got my food. I wish there was more space to sit though.", "author": "Amber A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-11-16", "description": "I guess I just can't hop on the chipotle bandwagon as much as everyone else. \n\nI have eaten here about 2-3 times. the first time I got a steak burrito and it had pieces of meat in it that were unchewable and had to try to covertly cover my mouth to spit it out into a napkin. The second time I dined here, I made my own \"bowl\", which I also placed steak in and had the same exact issue.\n\nmaybe you just have to avoid the steak but I may consider just avoiding the restaurant.....", "author": "Arielle S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-05", "description": "Ive been so several Chipotle locations and i feel this place makes the chicken very crispy-ish and almost hard. My son usually likes his chicken/steak bowl but he kept spotting out the meat when he was eating his bowl and told me there are hard pieces in his bowl. I took a bite and realized it was cos the chicken were too charred which caused the hard pieces.. He didnt even finish his bowl this time :(", "author": "Linh L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-25", "description": "Okay, I'm pretty sure these people got their $h17 together sanitation-wise because I have eaten here a couple of times with my friends since they moved to the area and I routinely, subconsciously check out the cleanliness gradings as I walk into restaurants. So either it wasn't visible, or it wasn't a C anymore!! lol. \n\nI like the upstairs eating area and haven't had a problem with the food yet. Chipotle seems to be a pretty reliable chain. Great for when I'm craving fake-Mexican for less than $10.", "author": "Katherine R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-01", "description": "Came here on a warm day to enjoy a burrito bowl and it was good!\n\nReally love the well air conditioned interior to escape the hot day. Plenty of seating since there are 2 floors and well spaced out. Staff is friendly handling the orders. \nOrdered a burrito bowl and was jipped with the amount of rice and green peppers. Got plenty of tomatoes and chopped lettuce though.\nCouple this with a drink and the meal was $10. Refills on the soda!\nThe condiment station was clean and well organized. Plenty of lemons and sauces available.\n\nWhat ticks off one star is the shortage of rice in the burrito bowl and management didn't handle this guy at the doorway. He was asking for money while opening the door for customers. Awkward silence entering, but thankfully he was gone when I left.\nOverall, good spot to get a burrito fixing plus a happy dose of AC.", "author": "Kenny L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-01-08", "description": "Food and service is marginal.  It's just an average chipotle with nothing  special. I just go there for the convenience when I am in the mood for it.", "author": "James W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-16", "description": "I Love Chipotle, Chipotle is my life! Seriously I love this place!! Definition of fast food, whether there's a line or not you will not wait as long as in typical fast food places. Also, while you wait you should decide what you'll have to make it even easier on the servers. Always get the burrito bowl, don't like the actual burrito. It's too big and ugh makes me not want it once I'm half way done. The bowl you can eat some now, and save for later. Or lunch like I do lol ORDER ONLINE!! Do not waste your lunch in line when you can pick it up in 20 seconds. Best place ever!", "author": "Walbania M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-19", "description": "I come here at least once a week, and the line is *always* long - whether that be 15 people ahead of me, or 50.... but we know what to do about that.\n\nI always order the same thing, so it's always as I'm expecting and delicious.\n\nThanks, Chipotle, for not making me decide between Monty's, Lassen \u0026 Hennigs, or Garden of Eden for my quick and easy dinner. You win.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-05-05", "description": "I usually love Chiptole but they do NOT appreciate teachers so I may not want to go back. Here's why, I got an email the other day from a friend who sent me a link stating that they are having a teacher appreciation day, buy one get one burrito free (!) but when I went in they said they aren't doing that. No idea why they took the promotion away, but it clearly stated that it was for today. As a regular Chiptole goer I am very disappointed  at that sly move. Would have gave 5 stars if they didn't leave such a bad taste in my mouth! I will certainly keep that in mind the next time I want a burrito, as there are a million other burrito places on my block alone!", "author": "Tiffany R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-08", "description": "If the food wasn't so good I would not wait on the line.. No matter what time of day the lines are too long, but worth it! Just don't go when you're on a time schedule. Staff are always friendly! High five to them, having to deal with thousands of people a day non stop and still keeping their cool! Guacamole is a must! The place is narrow and uncomfortable to eat with people on line looking at you while you eat! Dont like that the seating area is so close to people on line!", "author": "Andy P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-12", "description": "The most amazing Guacamole I've ever had from a chain is from Chipotle. The food is consistently fresh and always good. Not too expensive, and a good change from the normal lunch food.\nIf you go during lunch or dinner time expect to wait in line, but it moves fast. The servers are really nice too.", "author": "Lauren C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-04-01", "description": "I'm sorry but I'm not pleased with they're service the manager waits till we're online to let us know they're closed despite the fact that the doors are still open.IF you are in the area at night do not eat there.", "author": "Trav S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-03-28", "description": "No forks.\n\nNo paper towels in the bathroom.\n\nMessy.\n\nAlways a long line, but to be fair, moves fast.\n\nNot enough seats.\n\nIngredients not well distributed within burrito.\n\nNo baskets/plates.\n\nNo hot water in bathroom sink.\n\nEverything is sticky.\n\nFood is standard Chipotle and perfectly adequate.", "author": "Amy B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-02", "description": "The worst damn Chipotle I have ever been to! Waited on line for over 15 minutes which was not a problem because I love the food. After I pay the cashier doesn't even pass me my bag, I ask for a shopping bag but she tells me those are for bowls! I'm like it's snowing outside she then takes a bag and throws it at me. I'm like WTF!! The customer behind me is even more shocked she says she didn't throw the bag so I ask for the manager and he comes as I tell him what happened I see a camera and I tell him he should review the tape. I will never eat here again! They have the upstairs closed but I ignored the sign and came up alone to eat because people on the line are talking and breathing over me as I try and eat!! This place needs no stars!", "author": "Lexi O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-17", "description": "I LOVE Chipotle but this particular location is the WORST. I had one person totally mess up my order then when I told her \"I don't want corn\" she said, \"Not my problem\".\nToday I decided to give them another chance and ordered soft taco with barbacoa. He put, literally, a PINCH of meat. I thought they were joking but no. He ignored me and went to the next customer. The cashier just pretends she does not understand.\n\nSomeone from Chipolte should check out this place. They are giving them a bad name.\n\nFrom now on I will go to the one on Court Street next to Trader Joe's.", "author": "J. B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-18", "description": "Food was good and  they are more generous with the portion sizes than those at Metro Tech.  The staff are friendly and they are actually listening to you when you place your order and wait for you to say what toppings you want them to add. It's clean and the space is much roomier.", "author": "Tracy P."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Chipotle Mexican Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "185 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/5nLCvrULiYvmUFITZW-k-A/ls.jpg", "@type": "Restaurant", "telephone": "+17182439109"}