{"aggregateRating": {"reviewCount": 188, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-01", "description": "The food is not a surprise. It's exactly what you would expect from a Chipotle. However, this is one of the nicest looking Chipotle's I've been too. Or it's possible I haven't been to enough Chipotle's? There is an upstairs and it's really spacious! The line moves really quick so It's better to know what you want before getting there.", "author": "Israt A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-06-28", "description": "I like Chipotle's food fine.  That's never an issue.  What IS an issue with this location in particular is that they always run out of something: today it's taco shells (not the first time).  Another time it was cheese.  They never have iced tea any more.  WHO MANAGES THIS LOCATION!?!?  How do you run out of anything at 2:30 PM?  If I come in just before you close and you're out of something, more understandable.  But no taco shells at 2:30 PM?  What is happening over here?", "author": "Jonah F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-20", "description": "Chipotle is my favorite fast food place that I have tried to date. The fresh ingredients really make a difference. This one branch however is my favorite in NY. The location is great, but parking in this area is horrendous. If you're in the area and looking for fast food this Chipotle tops all other Chipotles in NYC.\n\nThe service is great. I don't know how they do it but they pack so much into the burrito and give bigger portions than other Chipotles. I love getting the Burrito bowl, with double chicken, fajita toppings, brown rice, black beans, mild, corn, guac, cheese, and lettuce. Put in a little bit of the smoked tabasco sauce and i'm in heaven\n\nOn top of the bigger portions this chipotle gives, It's pretty close to the Brooklyn Bridge Park. Where you can eat with a view. Its amazing there with it being a few blocks away", "author": "Ray L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-23", "description": "Relatively short lines for lunch which is great. Nice staff and they work quickly. They give a decent amount of food, I usually stay and eat so I don't expect an overly full plate. The chips are a hit or miss, sometimes stale, salty or sometimes perfect.\n\nThey make great margaritas here (drink with caution) \n\nThere are two levels of seating so you don't have to worry about having somewhere to sit.", "author": "Bee L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-12", "description": "The food is very fresh and always delicious.  The lines can be long but they move very quickly for the most part. They recently raised their prices, but who hasn't ?. If you love guacamole,  try it, it's very good !.", "author": "Jacqueline E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-04", "description": "I love Chipotle. Anyway, came here today because I was craving a burrito. The line was WAY TOO LONG! I was waiting for about 30 minutes. Thank God, they're opening a new one by Metrotech this coming March. \n\nAnywa, when I got there, I told them that I wanted a burrito with brown rice, black beans and barbacoa. I asked the woman adding the meat to put a little more, she looked upset but did it. I love it with the mild salsa, cheese, and fajita vegetables. Came up to $9. I eat Chipotle every once in a while, so I'm okay. I looked at the steak and chicken once because it was so undercooked. Yuck, are you serious? \n\nWhat annoys me about this location are the long lines and the people hogging the chipotle sauce. The kids running around. The cashier was the one serving the margaritas. I believe someone else should be doing that. It wastes time and holds the line up. Then, there were people throwing cups, forks and tissue from the upstairs seating level. That's disrespectful and juvenile. Too many idiots were in there. \n\nAnyway, I'm glad I left after. I went home and the burrito was pretty big anyway. I enjoyed every bit of it. It tastes better with chipotle sauce.", "author": "Omolara O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-18", "description": "One of the worst Chipotle locations I've been to. Portions are incredibly weak. Usually Chipotle tricks you by doing a lot of rice and very little protein. Here they don't even do much rice, one flat scoop. Meat portion is enough for 2 bites. And they rush and yell. It's very unpleasant.", "author": "Andy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-21", "description": "This Chipotle branch is my favorite in the neighborhood vs Metrotech and Court St (near Trader Joe's). The food is consistent with other Chipotles but the main advantage it has is its large size and dining area vs the others. There are 2 floors and thus ample seating room. Tables and bathrooms are generally clean. The place is quiet on weekends but a madhouse on weekdays (given its proximity to schools and offices). Note there is 1 unisex bathroom downstairs.", "author": "Andrew C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-12", "description": "I love love love Chipotle. So hard. We popped in here for dinner one night in Brooklyn and the line was LOOOONG. Sadly it moved verrrrry slowly, too -- we probably waited 20 minutes before reaching the front. But the food was so damn good I'm not even docking it a star for that. They ran out of steak at some point (or were about to run out) and one of the staff went through the line to tell EVERYONE. I thought that was pretty unnecessary but super nice, since some people did leave when they found out (I'd be pissed if I waited that whole time and found out while I was ordering). \n\nI am used to the Chipotles in New England, but damn, this one really piles the food on. My chicken bowl was PACKED with food and I wanted to eat every single bite. Despite the place being so busy, there was TONS of available seating (including an upstairs area), so we had no problem finding a spot. \n\nProbably my only complaint was the bathroom. Dirty, and when I went to pump the soap, some nasty smelling liquid came out and then the water would NOT get hot so I had to scrub it off my hands with ice cold water. Fun.", "author": "Justine J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-10-10", "description": "It's impossible to actually eat lunch here and debrief for a bit. I get that this is NY and everyone is always go, go, go but it also means sometimes you just want a place to eat that isn't your desk if you have the option that day. They were playing EDM/club music so loud that I had to take it back to the office. And if you work in an office where you are constantly pulled in different directions, you know that getting away for just 30 mins-1 hr is like going to church. So I came back to the office and had to find a place to hide so that I could just eat without being pulled away. Tl;dr: turn down the music!!", "author": "Chelsea W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-03-19", "description": "Being a consistent chipotle eater like me, you begin to know the distinguished taste between every chipotle you go to. I'm usually a person who always goes to the same chipotles but I decided to try this one after coming out of a class today, since it was close and I had a craving.\n   The service there was pretty good and so were the portion size. I decided to take my burrito to go and I realized that my burrito was coming apart and out of the aluminum foil. Which doesn't usually happen to me. Then when I decided to eat my chips they were stale and had way too much salt. \n   I probably would've given a higher rating maybe if I stayed and ate there? But still it doesn't make a difference because this usually doesn't happen to me when I am at other chipotles.", "author": "Donte H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-25", "description": "The food is not clean here!!! I got stomach aches and end up throwing up after I ate here!!! Don't eat here unless you want food poison!!!", "author": "Michael N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-04-08", "description": "I visited three times before reviewing this on yelp........\n\nThe food, the rice bowl, tacos, and salads are awesome My only compliant is the service.. It's so loud, that the servers have to yell at you for them to complete your order. It probably is one of the Chiptole's where the service is Okay.. nothing extraordinary\n\nthe only reason for my return is the food.. which is simply amazing...!!!!!!!!!!!!!", "author": "Jelani R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-29", "description": "Have ate at this location many times. Almost every time the tables are left disgustingly dirty and a mess. \n\nIf you request an area to be cleaned, the workers will brush you off and just stand around on their cell phone instead.\n\nIncredibly unfriendly with sneer remarks and could care less about it's patrons. \n\nThey'll even refuse you service if they don't like the cloths you wear on your back. \n\nThere are so many better operated and tasty establishments in this area of Brooklyn , trust me, look around just on this street alone. You can thank me later.", "author": "Charles L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-02", "description": "Being longtime pizza purveyors, my family and I decided to order some from this neighborhood pizza place, if you can even call it that. This is Trisha McGovern here with another review, this time, I take on the Italian establishment, Chipotle. \n\nIf you want to wait four hours for your pizza and then never get it, this is the place for you. Wanting an authentic taste of Italy in the comfort of our own home, we decided to indulge in the sensational flavors of fresh tomato sauce, crispy, flaky crust, and melty cheese. What we got was none of this. I placed my initial order at around 6:30 on a Friday night, so I understand if they're busy, but by 8:00 we hadn't received our pizza. When I called back to vent my frustrations, the girl who answered said, \"We told you when you were ordering that we don't serve pizza, but you wouldn't listen.\" This is a blatant lie! Not only was my pizza getting cold (if they even made it in the first place), but they were accusing me of not listening when they were the ones who didn't listen. \n\nI placed my order a second time: large pepperoni, extra cheese, and thin crust, and expected to get a second pie for free for the inconvenience. Not only did I waste another two hours of my time, I never got the pizza! By this point, my twin four year old boys, Weymouth and Bellus, were getting fussy because they were hungry. Because we were depending on pizza for food, we had no other food in the house and I had to feed them wet paper towels thanks to this disgrace of a family pizza place. The Chipotle family should be ashamed of themselves, disgracing the long-standing reputation of an Italian heritage. When I called again, they refused to refund our bill because I \"never ordered anything\" so they \"never charged us any money,\" which is the poorest of the poor excuses as to why we shouldn't get our money back. \n\nWhen I asked to speak with a manager, the manager I spoke to explained that they were out of pepperoni, mozzarella, marinara, and crust, and that they don't deliver. After waiting so long, it would have been nice for someone to come over and tell us personally that they don't deliver, but it seems as though customer service is dead today. Not even a free cannoli. We won't order from here again and I told all of my friends about my horrible experience that ruined my weekend and my love for pizza. This place is the worst. If I could give negative stars, I would.\n\n1 star", "author": "Trisha M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-26", "description": "It is what it is. Whenever I get a monster craving for some quick Mexican food, my first choice is almost always Chipotle, even though the lunchtime lines run all the way out the front doors sometimes, and on the fifteenth bite, the food somehow doesn't taste quite as mind-explodingly delicious as the first one did. I like the interior in this one, and even though I always take my Chipotle to go, there always seems to be enough seating for everyone. Lines actually move pretty quickly, but TIP: no matter which Chipotle you're heading to or what time, ordering online seems to be the safer bet. The one on Montague has its own little kitchen window for the online orders - you give your name to the guy, he makes your burrito, you pay, and wham, you're out of there. \n\nMy entirely unsolicited Chipotle haiku: \nLately I've discovered this thing\nCalled a burrito bowl\n\nWhatever happened to the tortilla?\nThat 300-calorie tortilla (yes, it's 300 calories, according to Chipotle's calorie calculator)\nSomehow doesn't taste as good\n\nBut the rice, the beans, the fajita veggies\nThe cheese, the lettuce, the tomatillo salsa\nThe corn salsa, the sour cream, the chicken \n\nIs still so beautiful.", "author": "Joy G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-06-05", "description": "I like this location. The staff isn't entirely friendly. In fact, they seem mad all of the time! However, this location is always packed and I imagine that it takes a toll on their morale. I have worked  in the food industry and I have worked retail my whole life, so I understand the effect people can have on your attitude! They always crank through the line at a quick pace, and I rarely have much of a wait. There is always somewhere to sit and the food tastes just like any other Chipotle! I feel like they always seem rushed because of how busy the location is and this is reflected in the finished product.", "author": "Natasha L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-30", "description": "Holy cow!\nAll my experiences have been positive. \nNo problems with the staff. \nDelicious burritos\nSeating is plentiful. \n\nUsually not crowded  \nPlease come here.", "author": "mark s."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-09-19", "description": "This place is super busy during lunchtime! Best thing to do is online ordering and pick it up. I also believe you get bigger portions as well. \n\nAs always, the food is great but that's because I am a big fan of Chipotle. The lines are acceptable since the service is amazingly fast!\n\nOne thing I would say is different than the other Chipotles out there is they are always stacked with Tobasco sauces. Very quick to refill the empty bottles compared to the other Chipotles I've been to. \n\nORDER ONLINE IS THE BEST WAY TO GO IF YOU ARE IN A HURRY!", "author": "Timson L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-27", "description": "It breaks my heart to rate Chipotle 1 star, but we had a pretty lame experience. I ordered a large (15 orders) catering meal at 10am from their website online paid for it then, etc. It was for a pick-up time of 5:45pm. \n\nI show up with two people to pick up the order and am told by someone that they were under the impression that the order was a prank and that they tried to call me to verify but didn't get through.  -_____-\n\n1. They never called me. \n2. It was paid for online.\n3. I have ordered like this 3 times before in the past and have NEVER been called to verify. \n4. This is complete crap. \n\nSo unmoved by the crap lies I was being told, I demanded that they expedite the meals. Many people waiting in line left because the entire staff was making food but the line was not moving. They comped us a bag of chips while we waited (on my request). We were out of there by 6:05.\n\nWe get back to the meeting and lo and behold all of the orders are messed up. there is absolutely ZERO fajita veggies in any order and ZERO beans in any order either....\n\nWhat the crap? \n\nThey are replacing this order in the near future. I will update and let you know how it goes.", "author": "Andres D."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Chipotle Mexican Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "185 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/5nLCvrULiYvmUFITZW-k-A/ls.jpg", "@type": "Restaurant", "telephone": "+17182439109"}