{"aggregateRating": {"reviewCount": 188, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-30", "description": "Friendly efficient staff. I visited this location around 1120 am and it wasn't crowded. By the time I finished my lunch it was crowded. \nThe food was very yummy! Highly recommend!", "author": "Aida R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-12-11", "description": "Wow. Corporate needs to do some work on this location. \n\nI came in at 1:20 p.m. on a Tuesday. The food line was running out everything and items were not being replaced.\n\nI ordered a chicken burrito bowl, but they were out of chicken. On the prep line, I could a dish full of cooked chicken, but no one was chopping it. I decided to skip the meat altogether.\n\nThe crew had more interest in chatting with each other than taking care of customers.", "author": "Ed W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-27", "description": "As an occasional patron, I am usually out of practice with the assembly line lol. While my husband breezed through his order, I was the one who needed a guide. Luckily, there was no line but I was \"that one\" who asked the server to repeat the question and identify the fresh ingredients. Thankfully, she was patient and professional.\n\nIn the midst of a sizzling summer, this is a great way to refuel with a light meal that isn't piping hot. \n\nI loved the service, ambiance, and price but not the hint of lime on the chips.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-08-08", "description": "Let's start by saying that the options in this area are limited. Most restaurants start of well, but then come down with retrograde amnesia where they can't recall memories of appropriate potions and quality of food. This place is crowded for a reason. They have fresh ingredients, they work quick, the prices are reasonable, and they remember to give appropriate portions. I was in the area and needed a quick lunch. I got my usual salad bowl with no rice. All ingredients were fresh, and I found a nice seat upstairs. There is a restroom upstairs, and it's clean. I was surprised, because this is usually not the case in busy areas. People clean the tables after they are finished eating, and it can be said that the restaurant is clean overall. Staff are friendly, and I would recommend you coming here if you're in the area and need a spot for a quick lunch.", "author": "Donna P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-14", "description": "First and foremost let me start by saying, I LOVE CHIPOTLE and I eat from here often. As of late every time I've come here it's been a hit or miss. It's either a great burrito bowl or an ok one. Today I had the worst burrito bowl ever. IT WAS ABSOLUTELY TRASH. The rice was so hard and over cooked, the beans were dry and tasted very bad. The chicken was ok and the tomatoes tasted like they've just been sitting out all day, I was looking forward to this all day and it just ruined chipotle for me.", "author": "Betino V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-07-06", "description": "Good food, awful customer service. The server had some type of anger or issue towards me. I'm not sure why? \nYou would think someone who paid $40 would be treated with more respect.", "author": "Marz D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-03", "description": "Great location. The food quality was excellent, service was speedy, and the employees were kind. Highly recommend this location over many I've been to.", "author": "Ashley D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-03", "description": "Everyone here was so angry besides the cashier and the servings of food I received were so small and burnt. Worst experience/customer service at a Chipotle. Go to Chick-Fil-A... Be smart.", "author": "Casual L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-04", "description": "One of the Best Chipotle's\n\nI will not get into the nitty gritty about how Chipotole is not authentic Mexican food. \n\nI really appreciated this Chipotle, based on the service by its team members. I visited on a Sunday afternoon and she noticed that some of the meats were \"dry\". So she recommended that I wait a few minutes for them to prepare new food. I have never experienced this action at other Chipotles. Normally, they would pile on the driest and raggediest ingredients your burrito bowl. \n\nThe place was relatively quiet, although I'm sure that is not the case Mondays-Friday, as I can see this would be a prime lunch spot for the area.", "author": "Kwame S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-07", "description": "Went in here one day for two of my coworkers and they both wanted tacos so I politely told the guy that I needed six steak tacos and he looked to his coworker and they started giggling as if something was funny after he said \"six......steak.....tacos\" and yes he did pause after every word. After that I had to wait for one of the workers to finally refill the steak because this place never does anything on time, I say this because I went in a few days later for myself and had to eat 5-10 min so the guy in the kitchen area can take his sweet time putting gloves on so he can slice the chicken slowly. Every time I step foot in here for other people I am reminded as to why I fucking hate chipotle not to mention the many times their lettuce was recalled for giving people deadly shits from e-coli take your money to dos Toros instead.", "author": "Kayla S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-30", "description": "This is the Chipotle that is out of the norm. Don't get me wrong Chipotle is great but \nmost Chipotles give a small portion. \n\nThis was the Chipotle I always went to since I started College in the Fall 2011. Every time I come here my Burrito bowl would be almost completely full. The steak is always fresh and tender. It gets busy during lunch and dinner time. There is always two floors of seats so don't worry about not getting a seat. Service is decent, never had any problem here. My favorite Chipotle for sure!", "author": "Shirley L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-25", "description": "I love Chipotle, and I love this location as it is the closest to my house. The portions are also substantial and all of the employees I've worked with are nice. \n\nHOWEVER, the only problem I have is from the few times I've been here, half of the time the rice seems under cooked and granular. Considering the rice is one of the most important parts of the meal I'm gonna have to give it three stars. \n\nI will still be a loyal customer to this location as it is so far the closest to my house.", "author": "Cora K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-17", "description": "Long lines, very loud, but lightning speed service with consistant filled to the top satisfying rice bowls! Closest branch to me in Brooklyn, if I really had to get my Chipotle fix I would have to drag my husband to the car and have him drive 20 mins to get here.\n\nMy favorite, from any Chipotle, I would say is the chicken wih cilantro rice bowl filled with black beans, topped with EVERYTHING, of course! The pico de gallo is on point, corn salad is refreshing, creamy guacomole and chips, what more can a hungry mom ask for? \n\nThe only thing that's holding me back from giving more stars is the cleaniness. Always, garbage everywhere, dirty tables, I know it's the others enjoying the yummy meal slobbering the food away, but still, should have someone on a cleaning routine, constantly, during peak hours. Also, need to stock up on utensils and napkins, I'm always one of those whose ready to eat walk to the counter and wow no utensils?! \n\nIf you have the time, meal is well worth the wait as the lines are averaged 10 minutes long, based from all my experiences here. Enjoy!", "author": "Amy N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-11", "description": "Well you know what they say... Girls love Chipotle and yes I am one of them! I love chipotle!!! Yes it's Mexican style fast food but it's good! I love that they serve grass fed beef! \n\nThey also have introduced the new sofritos which is a mixture of seasoned tofu and plantains and it is good! It's sooo good that I don't order the chicken or beef anymore! So vegetarians can come here and leave full and satisfied! \n\nI personally like to get chips with my meal and eat it with the bowls! Service is usually fast here! They know exactly how to keep the line moving so don't let lines to the door Deter you from eating here. My Boyfriend and I frequent this spot a lot... I find myself randomly craving it every few weeks or so.... Does that make me weird?\n\nAnywho... for a quick healthy meal this is a great option and alternative to McDonald's and Burger King! I'm so very glad to have chipotle!", "author": "Melanie M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-29", "description": "Good location clean bathroom very nice girl at the front who kept my food while i was going to the bathroom . Good chipotle . They tell you when it s spicy . Nice . I like it .", "author": "Valentine M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-07", "description": "Ok. Got tacos and there was a teaspoon of beef in each one. So skimpy on the fillings. It was nice and empty though and I'm sure it's jammed during the day. So eating in peace was nice. \n\nThe clientele leave a lot to be desired. One woman tried to cheat the cashier on what she ordered. Another got up from her table and spat something onto her seat. Lovely.", "author": "Jennifer E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-04", "description": "Clean. Large. Short lines the past two times I've been. Friendly customer service but also quick which is good. Two floors? That's pretty tight if anyone asked me. Sofritas Rock and the guacamole was good. I'll be back to this location for sure, visited a few more times after this initial review and the service has gotten worse", "author": "Smith J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-01-31", "description": "CROWDED!  But what Chipotle isn't?\nSame quality as the rest.  Staff was nice.  Establishment was clean.  Upstairs seating.  Cash or credit.  Open late.\n\nLove it.", "author": "Cassie V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-01", "description": "Great amazing food from the Mexican cuisine, fast service and non gmo.", "author": "Nicole C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-24", "description": "Excellent and fast service I think basically because it wasn't that busy but I got my order in a timely manner.  Service was great.", "author": "Almaria B."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Chipotle Mexican Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "185 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/5nLCvrULiYvmUFITZW-k-A/ls.jpg", "@type": "Restaurant", "telephone": "+17182439109"}