{"aggregateRating": {"reviewCount": 188, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-15", "description": "If you can catch this location when there is no line, burrito bowl magic can happen! Ample seating, friendly staff, great food!", "author": "Krista J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-24", "description": "I've been to a number of Chipotle locations and this one is definitely my favorite. When you first get there, the line most likely will be long but they expedite like pros and the most you'll be waiting is 10 minutes, which is not bad at all. The food always fresh and delicious and they make their burritos not fall apart when you unwrap them, something that other Chipotle locations do. If you get a burrito bowl, they are generous with the meat and other add-ons, especially if you are a regular (**ahem, like I was when I was in college and lived a block away**). The restaurant itself is spacious, they have seating downstairs as well as upstairs. \n\nHighly recommend this place if you are in the area.", "author": "Jess P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-10-01", "description": "This location is consistently the worst Chipotle I have ever been to. Rude servers that almost always mess up your order because they are talking amongst themselves instead of listening to you. Portions are small and inconsistent - you usually have to ask twice just to get the portion you would get at any other Chipotle. Any specific requests such as \"a tiny bit\" of something, such as cheese, will result in that item being the dominant item in your burrito. Also, without failure the same guy will be opening the door for you, begging for change when you walk in and out of the restaurant - every time you visit without fail.\n\nHorrible. Fail. Chipotle should be ashamed of this location.\n\nDo yourself a favor and walk a bit further to the Court Street location - you will be much more satisfied.", "author": "Robert S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-09", "description": "5 stars for the food. I love how conscious Chipotle is about where they source their food from etc. I like all the healthy options they have, and the employees are always great.\n\nWhat i give 2 stars is to is the atmosphere of this place. Its cramped, you have to sit next to strangers who are texting on their phones and its pretty bare minimum. Come here to eat lunch, don't bring a hot date here! \n\nEverything is made with stainless steel it looks like they clean up at night by using a fire hose lol. \n\nOver all food is great, but bring a book cause if you don't have something to look at its a bit awkward", "author": "Michelle W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-12", "description": "Do you know what makes a burrito great? Yes, specific, individual burritos are made great by the delicious ingredients placed inside. But I want to take this discussion to a higher level.* I want to discuss the burrito as a concept.\n\nThe burrito is great because it's the perfect, self-contained meal. It has everything you need, wrapped up in a neat little delicious package. It is amazing because of its portability, because you can eat something containing juicy meats, salsas, sour cream, guacamole, beans, rice and more all blended together. AND you can do it with your hands, without making a mess of yourself. \n\nSo when you, Chipotle, give me a burrito that is so poorly constructed and so poorly mixed, you are defeating the beautiful concept that is the burrito. \n\nWhat I'm saying here, and I can't believe I'm advocating this, is that at Chipotle, you should get the burrito bowls. If the burritos are going to fall apart, make a mess, and be impossible to eat properly with my hands...you might as well get the stupid bowl, eat it with a fork, and be less of a fat slob. \n\nThis particular Chipotle is extremely popular, probably because of the dearth of other good lunch options in the area. For instance, there will still be a long line at 2:30 pm on a Thursday. But it'll move quickly, and your food will be pretty tasty. Sure, guacamole will cost you more, but they will give you a shit ton of it, along with WAY too much sour cream. But since I shoveled the whole bowl into my face, I wasn't complaining.\n\nUntil I woke up two hours later, exactly two hours behind in my work for the afternoon.\n___________\n\n*That's right. This discussion of burritos. In a Yelp review. I don't see any irony in this.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-09-20", "description": "They never have chips ... It's always so full in there .. They serve smaller quantities than the chipotle in the city ... The food is consistent tho  I guess those are my only complaints", "author": "Raisa V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-29", "description": "Great Chipotle, honestly, but what bothered me was this druggie outside holding the door for the time I was there asking people for money. I feel like it might be a daily occurrence. Sure I feel bad for the man, but shouldn't they do something about it? They could try helping him find a soup kitchen of some sorts because no one wants some guy causing trouble when they've come there to enjoy a meal", "author": "Stella G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-14", "description": "So crowded... so, so, so crowded, always. Once you've been to this Chipotle enough times, your idea of what constitutes not crowded is going to become warped because a not crowded day here is surely a crowded one anywhere else.\n\nSeating however, is not a problem. Though, they need to add another drink machine. There are way too many traffic jams trying to get a soda here.", "author": "Steve B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-09-15", "description": "Super busy during lunchtime! I did the online ordering through the chipotle site and picked up my order which was already bagged and ready for me in 10 minutes after I placed the call! Friendly staff and good food!", "author": "Christina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-16", "description": "my fave location.  I like to have it like once a month and especially while watching The Walking Dead.  Don't ask me why, but it's a nice pairing for me.  \n\nStaff is always nice, fast and most times generous.  You can get a few items made that are not on the board.  On occasion I like getting a barbacoa quesadilla.  It's just cheese and meat.  If you ask for anything else in it, they will charge you the same as a burrito.\nI try not to drink soft drinks often but they usually have a well balanced soda fountain.  I love making lemon cokes.\n\nGo and enjoy.  It's the meal that has just about all your daily nutritional requirements for the day if you get the right one.  \n\n:)", "author": "greg c."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-24", "description": "The food at Chipotle never disappoints. I went with a few friends and they all enjoyed it very much!!\n\nI had a bowl with steak, brown rice, black beans, pico de gallo, hot sauce, cheese, corn, sour cream and lettuce. Every bit was worth it, but I expected a bit more...\n\nNot quality, though, the quality was great. My problem was the quantity. I only got a bit of meat and it didn't last for the whole bowl, so that was a bit disappointing, but otherwise, I enjoyed myself very much.\n\nI'll definately be back soon.", "author": "Jorge C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-16", "description": "Food was good 2nd floor was nice and clean. The workers are excellent. Only flaw PORTION SIZE", "author": "Aanas M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-02", "description": "Nice place.IMy boss has recommended this place.perfect for a date or special occasion out.our waiter was also wonderful.He provided immaculate service including great recommending which dishes were ideal as finger foods", "author": "Sam L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-25", "description": "Food is okay but very addictive. The \"chefs\" need to pay more attention to what theyre doing but theyre quick. \n\nNot sure if they deliver but i know you can order via phone, fax, and even online....but be sure to check your order before you leave. I've had getup orders get messed up enough times to get me opening each one at the counter.\n\nThey take cash and credit (which is perfect on my book) and they have an average selection if drinks behind the register.\n\nGive it a try and you'll deff be back.", "author": "Quincy T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-06-05", "description": "I come here once a week since my school is nearby. The reason I'm giving three stars is because the long lines I have to wait every time for more than 20mins. Also, the forks are extremely dirty with stains and everything that I can't even clean up with napkins. So wash your forks with water.\n\nOverall the food taste good as always.", "author": "Ten N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-20", "description": "Walking in on a Sunday I second in line, I waited 10 mins no one acknowledged I was there waiting while they prepared 15 burritos for this other woman. I probably would have waited longer but the I saw a roach go by. This is not a good location", "author": "Jenny H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-03", "description": "Ok, so this was my first time at a Chipotle. \n\nI was working the nearby Court Street festival and a coworker and myself got on the topic of fast food. Have we tried this? What do we think of this? Finally we get on the topic of Chipotle and she's shocked I never had any. Come lunch time I head over to this location to pickup to burritos to go, The actual location is you're typical bland fast food restaurant layout with really no charm or personality. \n\nOnto the food. The burritos, as my coworkers warned, are monsterous. Thinking I could just inhale this thing, I take it out of the wrapper and sure enough, my guac, rice and chicken go all over the place.  All in all, petty average burrito if you ask me. If you actually make it through a whole burrito in one sitting, you literally feel like you ingested a lead brick. As my coworker recommended to me once I had guacamole and sour cream all over my face and half the rice and chicken was in the wrapper; it's best to keep it in the wrapper and slowly roll the wrapper down as you eat it. \n\nAm I clamouring to come back here or any Chipolte? No. $24.00 for 2 burritos and 2 waters is just ridiculous. But if I walk by one in the future, I'll give their tacos a try.", "author": "Jordan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-24", "description": "First chipotle I ever been to and I love it! My boyfriend bought me here before the movies and the line can be a bit long depends on the time you go", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-10", "description": "Chipotle is great! Great value! Large portion! Absolutely delicious! \n\nThe place is clean too... \n\nBurrito bowl... yum yum... that's a must to get when you're here... =)", "author": "Mr F G And Mrs M S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-14", "description": "4 stars for consistently delicious, fast, fulfilling rice bowls. \n\nI've been a big Moe's fan for awhile but a friend of mine bought me a rice bowl full of black beans, brown rice, lettuce, tomatoes, salsa, corn, shredded cheese, guac, sour cream and I think I bumped Moe's down the totem bowl of delicious southwest foods.  Their tortilla chips and guacamole are an excellent side.\n\nminus one star for this particular branch's staff. Perk up, Guys! You got a good thang goin'!", "author": "Michelle G."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Chipotle Mexican Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "185 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/5nLCvrULiYvmUFITZW-k-A/ls.jpg", "@type": "Restaurant", "telephone": "+17182439109"}