{"aggregateRating": {"reviewCount": 188, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-14", "description": "I loooooooooooooooooooove it! and I loooooooove this specific place.... I have so many memories in there.. Only complain is that it's always busy so I always feel that I'm in a rush to say what I want quickly", "author": "Cristina O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-06-20", "description": "i was very pleased wit the chipotle in brklyn heights\ntill i checked the calorie content online\ni was outraged\nbut its still good food and if u balence the meals rite it u can eat it", "author": "lauren c."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-16", "description": "this is one of my favorite chipotle restaurants. it was rather packed around the lunch time rush hour, but the line moved rather quickly.\n\nfood here is on par if not better, prices are lower than manhattan.\n\nthis place has a upstairs retreat if you just want to get away from the crowded line.", "author": "Ed W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-09-12", "description": "Chipotle had an impressive number of diners on our Wed. night visit. That was a surprise and very unlike the Chipotle experience in San Francisco's SOMA district. \n\nI ordered the burrito with spicy beef. It was delicious, healthy, and fresh. \n\nGood stop for a fast, inexpensive bite in BK Heights.", "author": "Nancy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-09", "description": "Chipotle is great.  Picture a clean Taco Bell meets Subway.  You tell them what you want and they make it all in front of you, add sour cream, guacamole, and whichever meat or beans you choose.  They have juice, soda or beer as well.  Then cover it in Tabasco... whoops too much hot sauce, get back on line for another beer...", "author": "Sean G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-25", "description": "What can I say... it's better than Taco Bell in my opinion.  You probably will like it if you like Mexican food.  There are plenty of seats.  So what are you waiting for.. go get yourself a big tasty burrito already.", "author": "Honn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-25", "description": "This place is probably the best fast food you'll find in the Brooklyn Heights area.  It is reasonably good Mexican fare, nothing incredibly special but very good for what it is.", "author": "B K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-19", "description": "clean for the most part except i saw a really nasty waterbug once, mushed on the ground! but they turn tables like crazy in here so im sure everything is fresh. good food, probably cleaner than the city", "author": "A E."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Chipotle Mexican Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "185 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/5nLCvrULiYvmUFITZW-k-A/ls.jpg", "@type": "Restaurant", "telephone": "+17182439109"}