{"aggregateRating": {"reviewCount": 188, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-25", "description": "Never mind the haters, this place is awesome.  Not only do they have a well spoken staff but the place has good food and wonderful atmosphere.", "author": "Tony L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-23", "description": "The food is great...fresh and flavorful. Only drawback is the long line and staff that makes you feel almost rushed at ordering time. Overall, a usual spot to get good food. Worth the wait in the end.", "author": "Tony C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-21", "description": "I always get the barbacoa beef burrito and the \"red hot\" lookin salsa is always hit or miss with my stomach, but I never learn my lesson because I always get it. Seriously it's just like the chipotle away south park episode..it's that addicting.", "author": "Ralph L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-05-20", "description": "Big heaping portions which are always a plus but the rice was undercooked. Since the rice is a big portion of the meal it made my burrito taste disgusting. I don't understand why fast food chains like Chipotle are inconsistent. Left extremely full but not satisfied.", "author": "Vanessa T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-07-26", "description": "My hubby had never eaten here before, but pregnancy cravings got me to drag him to take me to Chipotle. NOW! \n\n(Seriously, I was shocked someone I knew had never eaten here, but this seems to be the only location in Brooklyn so it does explain a lot. WTF? They need to expand on that note...)\n\nSo I ordered my usual - Barbacoa burrito with rice, pintos, corn, pico de gallo, sour cream, cheese, guac and lettuce all wrapped up in a giant tortilla. The thing was huge and I was excited. I told my hubby to order a burrito but he didn't listen and got the tacos instead and hahaha he had to order another set of tacos because he wasn't full. Though we both agreed these tacos were far better than the one's in the \"hood\" and we live in Sunset Park - taco central. \n\nProps go out to the reviewer who can eat 2 of those things, I barely finished the first one but it was so delicious you bet I finished it! \n\nThis location was nice and clean, upstairs and down, bathrooms were clean and ice cold(?), food was prepped as quickly as they possibly could, but the only downside is it sucks if you never ate here before because the employees are so used to being in a rush they get a little impatient if you are too slow. My hubby wanted to know something and the guy was getting a bit annoyed, so if you never ate here before and don't know how to order here's a tip:\n\nIt's just like a subway but with tacos basically lol. Pick your bread (tortilla, soft tacos, crispy tacos, bowls, salad) Pick your meat  and beans(Steak, Chicken, Beef, Pork, Veggie/pinto or black) Add your toppings (Not many to pick from and guac is $2 extra on tacos???!!!) It's not hard but if you're not familiar with it you kind of want to see everything and this location is not good for that but they handle a rush crowd like no other place in this area! \n\nAlso everyone says it's fast food, and they're right, but you will pay more than you expect from other places, but you will also feel like you are eating a real meal and not fast food. 1 burrito, 3 tacos, 2 fountain sodas, and an order of chips and guac were 25 bucks plus the price of three more tacos! lol", "author": "Juicy K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-02-18", "description": "Yes, a chain is a chain is a chain, and they are all the same but I feel it is my civic duty to let the Brooklyn Heights/Cobble Hill folk know that there is in fact a Chipotle at a very close distance. I stumbled across this one accidentally  and was very excited, as it seems that you can never actually locate a Chipotle in Manhattan when you want one and somehow always stumble on one when it's the last thing you're looking for.\r\n\r\nAmazing burritos, even better chips and salsa!!", "author": "ash h."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-11", "description": "Long lines, very loud, but lightning speed service. They are pretty cheap with the meat at this location as compared to others, but the product is always very good.", "author": "M R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-24", "description": "I'm only giving this place 3 stars because I'm a die hard Qdoba fan and my bf loves Chipotle. But with that being said, I like their quesadilla's and their salads are ok.  At this location, you can always expect a long line.  It is located near St. Francis college, several banks, the courts, movie theater and a lot of city agencies so it's always crowded.  The lines usually move quickly but sometimes it is hard to find a seat depending on the time of day you go.  On the weekends they don't move as fast which is somewhat annoying,  but it is not that crowded.", "author": "CANDICE H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-26", "description": "place is nice, food is make or break , somedays its good somedays its just thrown together cause of the mile long line it has everysingle day. prices are high but on a good day the food can be worth it", "author": "Frankie A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2007-04-28", "description": "I just had my first Chipotle experience today... Holy shit. Free range pork and chicken? FAST FOOD free range pork and chicken? Ridiculous.  Convenient.  And the best damn ambiance I have ever seen in a chain.\n\nWhoda thunk they *were owned by Mc Donalds. Go effing figure.", "author": "Layla C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-04-28", "description": "I can't get enough of Chipotle. It is excellent value for money. I can never quite decide on what to get. It is always a toss-up between the chicken burrito and the steak burrito bowl. The burritos are out of this world - my number one choice. It is not only beyond tasty, but it actually fills me up. Serving sizes are always overly generous, and the ingredients are always fresh, and of good quality. Chipotle is the better alternative over most fast food restaurants, and food chains, and definitely the healthiest. I always feel good after eating Chipotle. The lines at this location are always out the door, but I do have to say that it does move relatively quickly. The counter staff are troopers - very efficient and very friendly. We love Chipotle.", "author": "Markus H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-23", "description": "A lot of choices in the lunch menu fair prices. The burrito bowl is good, even better with guacamole. Can never go wrong with guacamole ;)", "author": "Yuki O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-30", "description": "Fresh and delicious!! Love the tacos \u0026 guacamole. Not too pricey either", "author": "Kenna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-06-01", "description": "Just bc I'm in Brooklyn doesn't mean lunchtime rush hour is any less of a b*tch.  But Chipotle has this wonderful online order-and-pick-up option that I love to death.  Like this:\n\nMe at Chipotle:  \"OMG the line is so looong!\"\nMan on Wraparound Long Line who sees my expression:  \"Isn't it crazy today?\"\nMe:  [striding confidently and smugly to the cashier] \"I'm here to pick up my online order.\"\n. . . . . \nMe three minutes later:  La la la la....\n[Man on Long Line looks wistfully at me as I walk out door]\n\nCan anyone say schaudenfreude?\n\nYeah, every food experience at Chipotle is about the same, but this once comes with ample upstairs seating and cool cashiers who'll laugh at schaudenfreude with you. (3.5 stars)", "author": "Andrea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-20", "description": "Well, I'm pleased. Managed to get a parking spot right across the street. Plenty of places to sit, the grill and food preparation area were spotless. One of my pet peeves is seeing the add-ins mixed together from double-dipping. They didn't disappoint. I never get much in my burrito as I'm extremely picky but this particular location made me the biggest burrito ever and it was great! I'll definitely be back :-)", "author": "Janae F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-11-28", "description": "Chipotle is the best place to go especially for dinner or lunch. Since my college is so close to chipotle, I enjoy taking my lunch break there. There staff are really nice and friendly and never disrespectful. I have been going there for about a year, but in different locations such as 72nd street and 34st and herald square. Even though most of the time during the afternoon and evening is always crowd, I normally just call to place my order or use the app they have for the iphone.  \n\nI normally get the chicken bowl or the salad which have white rice, black beans, chicken, hot sauce, sour cream, cheese and lettuce. And a side order of chips, which is good also. \n\nI ended getting my friends to like it once I convice them to try it. Once you have a taste of chipotle food, you will love it!", "author": "Lateefah S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-17", "description": "not a fan of this chipotle.  steak is always chewy \u0026 manager [franchise owner?] is stingy and cranky, loves to roll his eyes.  theres plenty of places to eat if youre over here, not worth the line that wraps around the restaurant.", "author": "Pat F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-25", "description": "I know it's a chain restaurant but it's good.  This place is always crowded; it doesn't matter what time of day you'll have to wait online. Unless you have the app, I normally just order my food and pick it up at the register.", "author": "Mervin W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-12-20", "description": "I always get my burrito with pork because it's usually hot and more flavorful.....just my choice. Make your own", "author": "Michael D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-12", "description": "You can never go wrong here, that all i'm gonna say. Make sure you order for two because I will be coming by to get my food from you to.", "author": "Ceo J."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Chipotle Mexican Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "185 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/5nLCvrULiYvmUFITZW-k-A/ls.jpg", "@type": "Restaurant", "telephone": "+17182439109"}