{"aggregateRating": {"reviewCount": 188, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-05", "description": "The waiting is worth it. The best burrito I have ever eaten. Decoration is nice, soundtrack too. Organic food and recycling make me love the place even more.", "author": "Rafael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-05-11", "description": "I loveee this place!!! The people are absolutely friendly and can cheer you up just from a greeting. The service is swift and and excellent. I always get the shell tacos with chicken, corn, sour cream, cheese, and lettuce! Yummy  u gotta try it. The margaritas are just right as well as the beer! Nice place to go for a quick snack. Lines may be long at this location but the pace is steadily moving that you don't even notice.  Oh yeah the Guacamole is great too!!!", "author": "Ronnie M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-06-23", "description": "I used to work in downtown Brooklyn so I came here for a lunch a bunch of times. There was always a crazy line no matter when I went. It's also pretty noisy and could be hard to find a seat. Now as for the food, I just don't get it. Just really bland and boring. Not enough seasonings. I use to get a chicken or steak bowl. After the first couple bites, you are just eating the same thing over and over again. Yeah sure it's filling but I wouldn't say its good. I've had much better mexican food before. I would rather go to mcdonalds", "author": "Robert S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-29", "description": "This is my local Chipotle, and it's also my favorite.  It may be just a single restaurant in the chain, but they have real Mexicans wrapping the burritos, and the place is always clean!  I love that the service is very fast and the food is always delicious.  They even add the right amount of salt to the chips and always have fresh guacamole (unlike the Chipotle on 54th and 3rd in Manhattan).\n\nThe staff here is great, the Manager Rosa is awesome, and they make the best food in the neighborhood!  If you're in Brooklyn Heights, grab a burrito!", "author": "Joel T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-02", "description": "Chipotle! For your mex cravings, this is it.  Since there are so many, I'll focus on what makes the location on Montague stand out.  It's got plenty of space, even with upstairs seating, it's clean and very neat.  Line is formed against the wall as you walk in so everyone is kept orderly, it's not a zoo like other locations.  Food is just as good as any Chipotle location, and servers were working hard to keep the line moving.  When you want something quick, and don't feel like going to McD's or some other true fast-food place - stop by Chipotle!", "author": "Michael C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-27", "description": "OK if this was 1999 I would give Chipotle 5 stars, but now it is hard to place it against Applewood and Saul.\n\nI grew up in Denver, I have been eating Chipotle since it opened its 2nd store near DU when I was 15 or 16. When I moved to Brooklyn it was the only thing I missed from Denver food.\n\nSimple as this if you are reading about Chipotle on YELP, get up and go get some. They are all over the place so just go try it. All ingredients are very fresh and everything tastes great!", "author": "Pete R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-10-07", "description": "I love chipotle but the service here was terrible. the lady only gave me a half serving of guac, broke my burrito and made no effort to fix it. The only reason this gets 2 stars is bc the food still tasted pretty good", "author": "Lillian C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-03-14", "description": "Word of warning.  I'm a Chipotle fanboy.  I come to this location about once a week and well, I've lived close to a Chipotle for pretty much the past 7 years -- which means a lot of burrito bols (which is what I always get).\n\nI mean, let's cut to the chase.  These aren't authentic Mexican burritos...far from it.  But honestly, of all the chain places out there, this is the absolute best for me.  The food is consistent at all the locations.  I love the barbacoa...and the steak and chicken are also great.\n\nNow -- this particular location on Montague.  The dining options on this street are pretty poor (honestly, Five Guys and Chipotle are the best, I think).  So the Chipotle here is always a good option if you're in the neighborhood.  The lunch rush here can also get VERY crazy -- pretty much avoid this place from 1 to 2pm, unless you REALLY want Chipotle.  I also like that it's pretty much been the same people working here since I've started frequenting this place.  So we always chat it up and see how everyone is doing and stuff.  And let's just say...if you take care of them, they'll take care of you.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-24", "description": "Chipotle is awesome.. no matter the town. It's a well know franchise whether you get the veggie burrito , soft taco or anything.. it's pretty good. I go whenever I'm in the vicinity. Always on my recommendation list.", "author": "Dre D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-26", "description": "I absolutely adore Chipotle. This location was packed around lunchtime; it looked like an amusement park line for a brand new ride. The line moved quickly, though! \n\nMy favorite thing to get is a salad with chicken, a little rice, black beans, corn \u0026 mild salsa. It's so flavorful you do not even need the dressing. Have some chips \u0026 medium salsa on the side and a $4 margarita and it's heaven!  \n\nPS- The margaritas are a little strong ;)", "author": "April Dawn R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-06-18", "description": "I find it odd at the fact that people are complaining about the staff at Chipotle, such can be said about the NYPD,  my tax dollars pay their salaries but not a second thought do they have about their actions and coming in contact with the public!!! Both sides are wrong, but we all need to be able to point fingers back at ourselves!!!!", "author": "Gemini P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-09-06", "description": "Listen, yo: I am not anti-Chipotle *at all*.  There was a time when I was living in Chicago and was equidistant from three different Chipotles, all about a 5-minute walk in different directions away from my apt.  I was eating at the Chipotles so often that I made sure to balance out my visits about equally between the three different stores, just so that the counter staff wouldn't look at me and say: there's *that* kid again.\n\nBut *this* Chipotle has its problems.  Namely, it's just not very well maintained.  The table tops always seem to be dirty and need to be wiped down.  They seem to have only one or two Tabasco bottles to go around for the entire restaurant .  No fresh limes or lemons by the soda machine.  The ice machine was broken once.  Basically, all of the little details that make Chipotle seem *not* like a fast-food restaurant are lacking at this location.", "author": "Nate S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-04-17", "description": "I love chipotle and it never gets old for me!! This one is the cheapest one and they fill it up the most which makes it even more worth it than it already is!! Ahhh love it!", "author": "Ariel Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-02", "description": "I went here for the first time to try it out since I was craving anything with guacamole at the moment, and it turned out to be great. The food was great. I ordered the chicken burrito and of course guac with chips! Really good! Best guac I've tried by far. The only thing that threw me off was the workers taking our order. Rolling  their eyes and sighing. Other then that everything was great!", "author": "Sue N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-02-24", "description": "I absolutely love Chipotle.  However, do yourself a favor and DON'T look up the nutritional info!  Ever since then I force myself to have half the burrito for lunch and half for dinner.  \n\nThe service is so fast and friendly and the corn salsa is just wonderful.  \n\nALSO NOTE!!!! NO MORE McDONALD'S! \nTo all those who have felt guilty due to the part McDonald's ownership... NO MORE.  Chipotle bought out McDonald's a few months back... so go, enjoy the delicious, fresh, inexpensive, and entirely too fattening burrito with pride.", "author": "Mike P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-12-12", "description": "I've been having Chipotle for about 2 years now from this area and has yet to dissapoint. The menu is straightforward and you order in a subway type fashion. I've had everything on the menu so far so you can't go wrong. This place will certainly fill up your appetite, especially with the Bean Burrito. There's plenty of different spicy sauces and nacho chips you can buy on the side that are great! Though becareful at the times you go, because the line can reach all the way to the door. Oh and did I mention they serve variations of beer? \n\nIf you want good quick mexican food to stay or go that'll fill you up, this is the place to go!", "author": "Steven C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-03-13", "description": "Best potle ever. Really good place to get a quick bite to stay or to go. The environment of that chipotle is also quite good.", "author": "Harry M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-29", "description": "You get your 8 dollars worth of food and authentic or not it's delicious. You can also add to your playlist thanks to their very random playlist. Their guac is delish and actually I just like their burrito/burrito bowls in general. Seating is nice and the line moves quickly even the most ridiculously long ones. Staff are usually pretty nice", "author": "Maimuna I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-31", "description": "Really a solid choice for lunch in the area. Always a big crowd but line moves quickly and more importantly the ingredients are always fresh.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-12-19", "description": "This taco joint is BETTER than Mexico! The workers are nice, the service is fast, and the food is terrific! Skip the trip to Mexico, it is all in Chipolte!", "author": "Ben D."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Chipotle Mexican Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "185 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/5nLCvrULiYvmUFITZW-k-A/ls.jpg", "@type": "Restaurant", "telephone": "+17182439109"}