{"aggregateRating": {"reviewCount": 188, "@type": "AggregateRating", "ratingValue": 3.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-29", "description": "Meh. Ample seating. Relatively busy. Snooty neighborhood. My rice was crunchy. The staff arent nearly as friendly as other branches. Definitely low on my list of Chipotles.", "author": "Brendan Y."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-03-06", "description": "Just visited this nice \u0026 clean location last night. The food was great. Had the chicken soft taco, which are three soft taco's topped any way you want. The food was fresh, and I like the spicy sauce option ~ yummy when combined with the fresh veggies and guac! Sat upstairs and devoured my meal. Nice atmosphere for a Saturday night, no fuss in and out. During the workweek this place gets really crowded, but the line moves really fast.", "author": "Rica L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-05-03", "description": "Looking for a quick healthy bite to eat?\nChipotle serves it up with its organic flair. Choose a Burrito, Tacos or a Salad, and your choice of meat (or go vegan). Then pile on all that extra stuff like Guacamole, sour cream and much more until your Burrito or salad is at least 4 pounds.... LOL\nChicken Burrito w/ Guacamole (Guac. is extra $) with Fountain Drink was $10.30 with tax.  ( Credit Cards Accepted) \nI give my meal four Stars. Tasted Yummers but my Fatt Burrito Broke apart making a messican.. LOL\n\nServers were friendly and served well. Cashier looked a Bit stressed out.\nDinning room was clean and spacious. They have a second floor as well. \nBe prepared to wait because the line is always in affect... \nWork in the Heights??? Order online ahead and pick it up so you can enjoy your lunch hour.... \nThey serve Beer !!!\nOpen Until 10PM on weekends!", "author": "Gus Gus L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-15", "description": "Yummy!! I get the chicken borrito bowl with all the trimmings.  Yes, I love toppings. This place is great, the food is always tasty and fresh.  Try a side order of chips! To me it has a sea salt lime flavor.", "author": "Kalisha E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-01", "description": "Me and my friend dine here at least once a week. I ate here for the first time over the summer and can't stay away.\n\nThe burritos are delicious and filling. I like mine with a lot of rice, black beans, chicken, fresh tomatoes, corn and a lot of cheese. While I am not a fan of guacamole, I am tempted to try it. Everything else is good, I don't see why I should hesitate any longer.\n\nIf you are in the mood for quick and filling, this is the spot. The burrito bowls are pretty much the burrito sans tortilla. You can mix and match, add or subtract from the mostly organic ingredients for variety.\n\nOh, don't forget to try their margaritas, they aren't half bad either.", "author": "Deon D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-07", "description": "Went during lunch....\n\nThe place has a long line to order the food, lots of sitting area, though it does seem quit a bit loud at times.\n\nWhat can i say you get what you paid for..... if you want a fast meal to eat and leave and you are in that part of the area this is the place for you.", "author": "Michael J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-14", "description": "Before this past weekend I hadn't been to a Chipotle in a few years (I have no idea why I was depriving myself for so long).  It was late afternoon on Saturday and the line was fairly long.  \n\nWe were not even up to the counter yet but the lady wanted to know our order.   I decided on a barbacoa burrito with rice, beans, tomatoes, guacamole and sour cream.  My friend had a steak burrito the same way.  The burritos were wrapped up nicely and ready to go, we just had to get to the cashier to pay.  As we were moving along the line closer to the cashier I saw the cheese!  How could I forget?!?  I quickly asked the lady if it were possible to reopen the burrito to add cheese.  She not so surprisingly said \"No\" but she did put some cheese in a little container for me to add to my burrito myself.  The guy in front of me asked if she could do the same for him because he had also forgotten to ask for cheese on his burrito!  She gave him a quick glare before filling another container with cheese.  The guy didn't seem to care, we got our cheese and all was well.\n\nYum, I'll be back soon.", "author": "Ming P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-09", "description": "yummy burritos. they should really add french fries, because personally, a burrito isn't complete without fries. \n\nHalf Carnitas/Half Chicken burrito everytime. it never fails. \n\n...i think i'll have one tomorrow :)", "author": "Ke'Cha Cydney G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-05", "description": "Food is fresh and delicious. Rice is awesome, chicken has tons of flavor, guacamole is superb. Decent prices, fast food with excellent quality. Lines can get very long during lunch and dinner, but it is well worth the wait. One of the best food choices in this neighborhood.", "author": "James C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-20", "description": "I can't believe how long the lines are at this location at lunch - and how efficiently they deal with it and make it worth the wait. High quality high calorie high satisfaction.", "author": "Sam O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-10-06", "description": "I hate this place.  I went there after everyone raved about it, and after having done an intense Mexican food tasting in Sunset Park for work.  Yes, the line moves quickly.  And it does seem fresh, but it's lukewarm at best, the \"burrito\" falls apart in seconds...I could make this food at home with my eyes closed after a stroke.", "author": "Kyle H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-02-16", "description": "I am currently attempting to seduce any Chipotle employee for the purpose of getting free or discounted burritos.", "author": "Kevin M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-01-25", "description": "Their burritos are soooo good!!!! Calexicos is much better and has a home made feel to it, but Chipotle, even though it is totally commercial delivers a great stuff for a great price!:)", "author": "Maria F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-09", "description": "This chipotles has alot of seating and they move very fast with your order. They really pack the bowls and burritos with food and they are friendly. they have upstairs and downstairs seating. The prices are reasonable.", "author": "Chrissa N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-26", "description": "I love crispy steak tacos here.  Their guacamole is really good too.", "author": "J K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-31", "description": "oh my goodness. this is the spot right here. me and my best friend when we always need to wooosa and relax and enjoy what life has to offer. we love every every moment of it. \n\nyes the line is long and they need to have a quick system going for rush hours, but waiting makes you want it more. the mouth watering taste ahhhh! \n\nmy favorite is of course vegetarian soft tacos and nachos with gucamole!!! yum...", "author": "Sharian J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-20", "description": "Yes, I know that Chipolte is a nation wide chain and everybody raves about it but I was not impressed. My chicken burrito collapsed in the middle of my meal because it was to big and I had to eat the rest with a fork. I recently moved from Texas where you can find the best Mexican food so this place was a let down. Did I mention that it is really over priced and you have to order chips with salsa separately? American spin on Mexican food and it just didn't impress.", "author": "Stephanie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-07-26", "description": "My roomie had an intense craving for Chipotle and dragged me kicking and screaming to this place. However, halfway through their carnita burrito with guac and I was hooked. This place has a solid concept down pat and you can taste it. Everything was extremely fresh and flavorful. I'm generally anti-large franchise but this is one place that truly won me over.", "author": "James L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-06-20", "description": "I feel compelled to review this particular Chipotle because it is the first one I ever experienced, and it has changed my life for the better.  It is fast food... and strangely owned by McDonald's?... but they pledge to use the best ingredients available... and it's DELICIOUS!\n\nWhile at work, I usually have to mentally prepare myself in two ways.  First of all, I need to get myself ready for the tastiness.  Second of all, I need to make sure I'm very hungry because I know I will eat the whole thing no matter what and possibly go into a food coma.\n\nIt's not the best burrito in the world, but you get your money's worth and it quick (although the line waiting to order can sometimes be long).", "author": "Daniel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-13", "description": "The veggie burrito with guac (without cheese), is my favorite.  I would prefer brown rice.  Also, I WISH THEY DELIVERED.", "author": "Rhea A."}], "servesCuisine": "Fast Food", "priceRange": "Under $10", "name": "Chipotle Mexican Grill", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "185 Montague St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/5nLCvrULiYvmUFITZW-k-A/ls.jpg", "@type": "Restaurant", "telephone": "+17182439109"}