{"aggregateRating": {"reviewCount": 303, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-26", "description": "Every time we have had a big night out we order the works pizza and it hits the spot. But this place also has great salads and sandwiches for when I'm working from home. Delivery always quick!", "author": "Anna h."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-04", "description": "awesome place, staff, pizza and ambience!!! it made my 4th of july and birthday month!!! 19-days and counting boys!!! thanks for some great pizza and for the perfect birthday serenade from the entire restaurant!!! the birthday hugs and love made my day and night!!! this is why brooklyn is my second home!!!  gina a.k.a. front street pizza's \"china\"!!!", "author": "Gina E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-10-21", "description": "I am a yelp critic and this place hands down is okay not bad thry get 3 stars because their delivery time is not that great", "author": "Adem R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-03-22", "description": "I was on my way to work and wanted to grab a quick to go slice. The outside really has a restaurant feel and I wasn't too sure if this was going to be a quick, to go slice place. Inside was nice, a bit dark but the atmosphere made it cozy. \n\nI ordered a white slice and it was pretty good. Thin pizza, cooked well so not to be all floppy. They had a lot of good looking food too. The pinwheels and tomato sicilian (maybe?) looked great. \n\nService was good and fast. I can't speak to the consistency of this place or Italian entrees but everything looked fresh, smelled good  and I will stop by when in the area.", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-04", "description": "Love the Italian man who cooked our pizza! He was so TREAL! I had to have true NY pizza as soon as I landed in NY! This place was close to where I Stayed, and was so delicious! MMM I had a magarita style and italian sausage! Truly mouth watering.", "author": "Kira I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-30", "description": "This area is a pizza lover's dream with Grimaldi's and Julianna's down the block, and now this hidden gem.  The lines were too long at those 2 pizza places so we stopped by here.  Pizza slices are huge, quality and taste is awesome, and price is very reasonable.  I also tried the sausage peppers and onions hero and it was freaking delicious.  I mean, my hero was loaded with mostly sausage and less peppers and onions.  These guys know what they're doing.  All due respect to Grimaldi's and Julianna's, but this spot is on my list on my visit to the Brooklyn Bridge.", "author": "Gene K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-11", "description": "If your feeling like eating garbage and hate yourself then eat here. The slices there are always too greasy and over priced. I know what your saying, of course dude don't you think you could tell just by looking at it's exterior. But you never know a book by it's cover but with this Pizza place just keep that book closed unless your broke.", "author": "Cassandra R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-09", "description": "4 stars only Because of the cheesecake.  5 stars for accommodating my gluten free wife with a custom gluten free pizza", "author": "Ben H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-30", "description": "I'm a semi-regular customer who usually always had high praises for this place. Last night, I told my out-of-town friends to try this place instead of the handful of other high-profile pizza places in the area. Yes, we arrived right around closing time - but they took our order anyway, knowing that we were going to be staying to eat our meal.\n\nFive minutes into eating our meal, they dimmed the lights and turned off the TV. That's fine - we understood they were closing, so we didn't say anything. Then they started putting up the chairs and began mopping the floors - which was fine too. Then out of nowhere, one of the employees THROWS HIS GARBAGE PAIL ACROSS THE FLOOR, RIGHT NEXT TO WHERE WE WERE EATING, leaving behind a trail of garbage shrewn across the floor. \n\nTurning off the TV and lights were one thing - but throwing garbage around where people (including two young children!) are eating is ABSOLUTELY UNSANITARY and just outright rude. If they didn't want any sit-in diners, they could've told us that from the very beginning!!!\n\nWe did contact one of the cashiers and they said they'd look into it. I do hope this is an isolated incident because I do genuinely enjoy their food. I'm only writing this review to ensure management is aware this is going on.", "author": "Ben L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-10-13", "description": "Walked across the Brooklyn Bridge wanting to try Grimaldi's pizza. That was a big joke. I did not believe in standing line for 2 hours to try pizza. \n\nYelp suggested we try Front Street Pizza; and we loved it! Fast service, lots of pizza types to choose from and lots of seating. Did someone say PIZZA BY THE SLICE?! Yahoo! I was NOT prepared to pay for a pizza pie at the 'other place'. They only have ONE bathroom for the entire restaurant which was disappointing but overall great pizza and I'm glad we didn't have to wait two hours!", "author": "Darina H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-11", "description": "Most bang for your buck in brooklyn bridge park. Very well prices. Food is great. Service is fast. Dinning area is legit", "author": "David V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-23", "description": "So glad we found this little pizza place in Brooklyn. The bf loved his taco pizza, wish I tried it. The vegetarian pizza was good.  :)", "author": "Kat I."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-30", "description": "You would think the pizza is free the way it's jammed packed during lunch hours. Other then the concert crowd the selection is great. I personally love the Pepperoni Wheel!", "author": "Angelo R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-09-13", "description": "Dumbo is my little getaway.... If you want to stay in Brooklyn, but want to avoid Manhattan I come here. I pass by this place a lot and decided to give it a try. I got a regular slice with sliced sausage. It came nice, hot and bubbly from the oven (reheated of course). I do like how it's thin crust pizza so you can really taste all the other ingredients. \n\nThe place is really spacious and can hold large groups. I don't think there are any other pizza places in the area (that I know of), but this place hits the spot without leaving a dent in your wallet.", "author": "Ron C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-29", "description": "This place is just great! Kaos in action here behind the counter - orders shouted out - everyone has a job - everyone knows what has been ordered. It's just interesting to watch if nothing else! Food was great - meatballs - jumbo shrimp. - veggie burger - chicken wrap. All washed down with beer - coffee - and sodas. Great...", "author": "Mark G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-17", "description": "Although it is now almost exclusively overrun with wandering tourists, this is pretty much the last place in Dumbo that you can get great food for cheap. It's def a rung above \"every cheap pizza on every corner of NYC\" that you pass every few blocks. The guys working here are fantastic, they have an infectious enthusiasm that makes for a lovely experience. They have a HUGE variety of slices to choose from, it's reasonably priced, the food is always fresh, and it's a great location. All around a great vibe at an awesome price. Which is why I assume, (as this neighborhood slowly devolves into exclusively botox-loving Stepford Suburban Wives and their nannies,) it won't last long... Get it while you can - just watch out for the 3x wide luxury baby strollers that might take out your kneecaps on your way there...", "author": "Brad D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-08-24", "description": "I brought a high profile client of mine to get some pizza here. The owner leaned over the counter and made inappropriate and disrespectful comments to her about her outfit. He said he had \"thoughts that would send him to jail\". It was highly embarrassing and she was very upset.", "author": "Uuu B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-08", "description": "Tasted ok, unfortunately my friends and I believe it made us sick that night.   Too bad.", "author": "Arlene T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-09", "description": "Best pizza in Brooklyn Heights/DUMBO area. Buffalo chicken pizza is the best pizza they make. A little bit pricey but not too bad. They also make pinwheels which are amazing too.", "author": "Benny A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-18", "description": "I've been gluten free for 4 years but just started my hunt for gluten free pizza last year. FRONT STREET HAS THE BEST ONE YET! The crust is NY style, thin and crisp, but nothing like the grainy cracker-like crusts I've had before. Plus there's a little sweetness that I love! Not a bad price either for a personal pie about 8\". Enjoy!", "author": "Erica L."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Front Street Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LVHDWuYoUFq5OpVt9Xj6JQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188753700"}