{"aggregateRating": {"reviewCount": 303, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "Skip the crowds at Grimaldis and Julianas and head to Front Street. Pizza was great and also the chicken parm but the big winner was the cheesesteak. Amazing. The staff is pure Brooklyn - funny, friendly and keeps the line moving. Big thumbs up from all of us.", "author": "S. S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-23", "description": "After a nice stroll over the Brooklyn Bridge, you can refresh your energy by intaking the best pizza you've ever eaten. It was saucy and doughy and hot, my favorite. I shall return to this wonderful place!", "author": "Daniella L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-04", "description": "Randomly came across this pizza joint in Brooklyn. \nAnd it was surprisingly really good!\n \nGarlic rolls: Good but not the best i ever had. Of course I still ate it all. \n\nPepperoni pizza: The classic- it was a perfect Brooklyn pizza. Thin crust, cheesy \u0026 cheap.", "author": "Jenifer K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-17", "description": "HOLY COW. The meat lovers pizza has large pieces of the different meats on it. And the white pizza is just heavenly. I was able to customize my white pizza to have broccoli, no problem. Have you ever been so full but it was just too delectable to stop? Even after I went to the gym, I couldn't NOT eat the cheesecake. Delivery was super fast too, especially for a Monday night downtown delivery.", "author": "Lenise L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-17", "description": "Great pizza! I often get delivery; however there is a lot of seating to eat there as well. The pizza is rather large in size and a great if you just want a quick bite to eat while in the Dumbo area!", "author": "Brigid K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-05-03", "description": "Excellent pizza served up by wonderful guys. I highly recommend Front Street Pizza. It's well worth the trip in from Manhattan.\nI recommend the pepperoni and sausage pinwheel and the bruschetta square slice, if they have it. If not, all square slices have been winners!\nThe husband likes the standard slice of pepperoni and the chicken and broccoli.\nSooooooo goooooooodddd!", "author": "Laura F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-26", "description": "If you're enjoying the views of Manhattan and get a craving for a New York slice stop here", "author": "Thomas C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-30", "description": "I got the sausage and pepper roll and for 5.95, I would consider it a good deal! The bread was crispy enough. The amount of sausage and pepper was just right! It was not too cheesy at all.  The portion size was fulfilling and I usually eat a lot of food. There are a lot of tables for seating \nHowever, as this was my first time, I was a bit confused where I should stand while I wait for my food. Also, the bathrooms are one user only. \n\nNext time I'm in the area with pizza cravings,I'll come here!", "author": "Luther Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Awesome old school pizzeria. Very friendly staff. Good red sauce establishment. Also delicious stuff besides pizza.", "author": "Craig N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-02-09", "description": "That is probably the best pizza I've ever ate in NY. I've been to a lot of shitty places, either the restaurants charge you a lot of money or the food is fucking disgusting. I've been to front street pizza two times and I just loved it. I'm back in my hometown and I already miss this delicious pizza. First of all they have a lot of different types and every ingredient is fresh! This is like the real NEW YORK PIZZA and if I could, i would give this place 10 Stars!!! BEST PIZZA IN TOWN!!!! Spread the name! Greetings from Germany!!\n\nPS: I also talked to the owner that I love his pizza and that I really love his place. He was so kind to me and so thankful for my words. He loves his job and you can really taste it!! It's all handmade and cooked / baked with love!!!", "author": "Madina S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-05", "description": "Great pizza, no frills place. The counter boy was super gracious and charged my phone after joking that he couldn't do it. We ordered a cheese and a pepperoni pizza. Both of them were crunchy not too salty but they were too hot so we had to wait a bit to enjoy them. The cheese pizza had just enough toppings.", "author": "Millie K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-12", "description": "Very delicious pizza! Owner was super nice and talkative, really made you feel at home! I will be back!", "author": "Ceslie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-22", "description": "Lapin and I came here for a quick dinner one night. We ordered a plain pie, mozzie sticks and a couple of drinks. We had to wait for a bit but it was okay since the pizza was made fresh. There is a generous seating area but some of the tables/chairs were dirty. Also, they only had one stash of napkins and seasonings -- the wait to get something was annoying. The food was tasty and on par of most pizzerias.", "author": "Andie B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-12", "description": "My go to pizza spot for a slice in Dumbo. I usually get a Pepperoni or Buffalo Chicken slice. The Buffalo Chicken pizza here is a must try. I've seen it at other places but its not the same. Its really rich, however. They also make some really good sandwiches. I used to have one called The Heartbreaker. Instant cardiac arrest, but oh so good. Combo of 3 kinds of meat, cheese, onion rings if I remember correctly and fried egg to name a few. So so good. You order the sandwiches in the back, to. So sometimes there is less of a wait for that. Nice cheap lunch in the area.", "author": "Joseph L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-04", "description": "Pretty average pizza. If you want a lot of food at a relatively good price then come here. But with Grimaldi's and others nearby you will definitely be missing out on quality.", "author": "Emmett F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "Had to try Brooklyn pizza and wings! Pizza yummy, wings were awesome. Satisfied my healthy diet cheat day!", "author": "Niki F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-02", "description": "Staff: Great\n\nAtmosphere: Very Clean and Open\n\nPizza: This is where I was disappointed. Front Street has HIGH reviews but the pizza is soggy. My friend made his plain slice flap in the wind like a flag. He then folded it in half and it flapped just as badly. \n            I ordered the Taco Slice ($3.99). They threw it in the oven and it came out minutes later just barely warm with all the lettuce translucent and wilted. It too was soggy. It tasted ok with the hot ranch mixed in with the see-through lettuce. Not the greatest.\n\nBeer: Great prices! They had Radler Lemonade for $3! Score!\n\nIce Cream: They have old school ice cream here like the frozen artificial color pops and good humor!\n\nBack to Grimaldi's!", "author": "Alice L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-12-27", "description": "Don't order delivery from them. The pizza they delivered to me looked NOTHING like the pizza they have in the store. It also smelled like trash. I had to throw it away, even though I don't believe in wasting food. \nEat in the store. Don't waste your time ordering.", "author": "Ria S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-29", "description": "My first experience with locally sourced New York pizza and I came away satisfied. The slices are huge, about a foot long at the tip, and taste fresh even reheated. And they have a fairly massive selection of slices to choose from.\n\nThe staff is on the ball, helpful and friendly. There's plenty of seating, with TVs showing sports. This is a solid spot to get pizza after a walk across the Brooklyn Bridge or spending some time around Cadman Park, Dumbo or Brooklyn Heights.", "author": "Steven G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-26", "description": "The staff here is so friendly and funny AND they make the best pizza I've had while in Brooklyn! Located only blocks from the Brooklyn Bridge entrance, it's the perfect place to grab a slice \u0026 eat it while you're walking over!\n\nTry the lemonade and the little Eggplant Parmesan circle-shaped item! Soooooooooooo good, thank me later.", "author": "Mo R."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Front Street Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LVHDWuYoUFq5OpVt9Xj6JQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188753700"}