{"aggregateRating": {"reviewCount": 303, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-01", "description": "Decent slices that don't seem to leave tourists *or* locals disappointed.\n\nThe sheer variety here is a big plus. 3 slices and 2 bottles of water set me back about 15 bucks, but let me tell you...2 slices and I was freaking stuffed. The crust isn't too hard, and nice and soft on the inside. The buffalo chicken slice was exceptional, and there are quite a few other specialties to choose from. \n\nGreat to-go meal to enjoy on a breezy day by the river.", "author": "Taric W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "I ordered 5 pizza pies from Front Street Pizza for my daughter's  birthday party that was being held at Pier 5. I chose this place because it's our go to spot for a quick slice when we're in the area. They were great over the phone with the large order and the pizza came in a timely fashion. It was just as expected- delicious.", "author": "Kim N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-11", "description": "You haven't done NY until you have a slice.  We found ourselves in Brooklyn and popped in here for a couple of those.  The slices were big, good and greasy - though scalding hot because they run it through the oven prior to handing it off to you.  Not sure how necessary that was, but now I know to ask they don't do that next time.", "author": "Crystal G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-03", "description": "Great place come here like twice a month for lunch .\nThat have great lunch specials Monday - Friday !! \nThey are a must if you are in the area for lunch \nGreat portion sizes they take care of there regulars \nThe chicken Parm is great , lemon chicken and calamari are my go to Friday meal . \nI would eat here more but pasta isn't the best for you lol \nKeep up the great work Front Street pizza team", "author": "Greg K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-04-20", "description": "According to these reviews, you'd think this was the best pizza on earth. Their pizza has it's good and bad days. It's an unexceptional, greasy NY pizza shop. What is awesome about it, is that, along with a few other places, it was a DUMBO original back before DUMBO was a tourist mall. I'm placing an order with them right now...", "author": "Bubbles McTroubles S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-20", "description": "The pizza here saved our night. After waiting for 20+ minutes in line at Juliana's to then learn we'd have to wait another 45+, we gave up on that fancy pizza but still had a pizza craving. At 9:45, we hurried over and arrived just before closing but the guys didn't mind at all. They simply informed us that the kitchen was closed so we'd have to order from the pre-made slices. Each slice was around $2.50 which wasn't bad because they're huge. We also got a spinach calzone. Both tasted pretty good. The employees were really nice and helpful, brought us napkins to the table when we easily could've gotten them ourselves. We also realized that it is located on the corner of one of the best views of the Brooklyn Bridge around. From just outside, you could see the Empire State Building through the Brooklyn Bridge arch. Glad we came here. Only giving four stars rather than five because we got a bit of an upset stomach afterward, possibly because the pizza was out for too long.", "author": "Mia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-25", "description": "My friend and I had intended to visit the Grimaldi's, but looking at the queue outside we then hopped into Front Street Pizza. I'm so glad we did that. It's a small joint in Dumbo. The pizzas were extremely delicious and don't miss their garlic knots which are like $1.5 for 6 pieces.", "author": "Poornima S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-13", "description": "Happened upon this pizzeria after two negative restaurant experiences in Dumbo. Best decision! Pizza wings and fries were delicious. The staff was so friendly and accommodating. Love it!", "author": "Colleen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-29", "description": "The best pizza I have ever tasted in my life is from this Front Street Pizza. During a recent visit to NYC, I ate a ton of pizza and this for me was by far the best. It's not just cheese slapped on dough, it was a perfect blend of ingredients for the most awesome favor. The dough was not too thin or too thick and cooked just right. Their salads were beautiful \u0026 just as tasty.  The guys behind the counter were incredibly friendly \u0026 just straight-up cool.  Seating available inside. We savored this entire visit \u0026 it will make a point to return when back in NY.", "author": "Liz H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-25", "description": "Meh. The spaghetti meat sauce was completely dry. Practically no sauce! I have to bring it home to add my own sauce. My coworker got the chicken parm platter which shockening cost $18!! That's an insane price for a dish that's not gourmet. Will stick to this place for pizza rather than pasta.", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "I've been coming here since I was 15!! Definitely my favorite places to go for pizza. It always brings back great memories. The familiar faces are always here to serve bomb ass slices or mix up some pasta for you. I hope I can one day order one of their amazing pies for my kids. Thank y'all for the years of happy times", "author": "Jay L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-26", "description": "Ok so I totally get that this area is very expensive. The rent and overhead must be astronomical. Pizza was OK. $4 for a plain slice with two strips of roasted red pepper which I don't even like that much. I wanted a plain slice but the guy gave me this instead and I just wanted to get out of there. He also gave me NOT the slice I asked for, which annoyed me.\n\n\nI spent $4 on this slice because I used then restroom here and I wanted to stay honest. They have two single restrooms and allowed guests to use it without the third degree. Very nice. So be nice and buy something if you come in to use the restroom in this otherwise snooty area.", "author": "Gigi A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-17", "description": "We really enjoyed the pizza. A family friend brought us here. The pizza was wonderful and a great experience for the \"New York pizza\"", "author": "Sandra V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-11", "description": "Pretty good food. I ordered the pepperoni \u0026 cheese pinwheel and garlic knots, which were very tasty. The lemonade tastes like it's only made with lemons and water; the healthy way. If you're looking for something sweet, you may want to add a little (or a ton) or sugar!", "author": "Lindsey W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-08", "description": "Nice and cheap pizza place. Family style and very resonable prices. Pizza were thin, cheesy and sauce was flavorful", "author": "Alicia C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-23", "description": "So we'd planned to eat at Juliana's or maybe Grimaldi's because that's what you do in Brooklyn, right? But the host at each door told us they had NO gluten free pizza. Zero. What? How do they get so famous and not have anything besides a salad for customers that have gluten issues? They were packed too. BUT, just a little ways down Front St. we found Front Street Pizza, and guess what? They DID have gluten free pizza. And it was good! And we got there just before the lunch rush and got a table right away. By the time we left they were filling up quickly. The crew was working hard behind the counter and fulfilled our expectations of what eating in a Brooklyn pizza joint should be like, in the best way. We will be back to try some of the other yummy looking things we saw on the menu. Thanks, Front St.!", "author": "Dan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "This place is real deal from the food to the service to the atmosphere. The pizza slices are big and fresh. I had the chicken Marsala, recommended by the guy slinging em behind the counter, as besides from being so nice and cool, he didn't steer me wrong! I was visiting my hometown for a couple of weeks and this was the best meal my son and I had while there. It's the one we'll remember. Soccer (football) on the TVs and all types of people watching it, enjoying authentic as hell Brooklyn pizza. So grateful there was a spot outside! See you guys next time!", "author": "Robyn R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-10", "description": "Pizza was great and the customer service was off the charts !! First time visitor will shout to all who come to walk the Brooklyn bridge to stop in and have a slice or two . I was almost done crossing the bridge and received a phone call from Larry saying he found my purse . We trekked all the way back . They tracked me down on Facebook and the rest is history. Thank you Larry and staff for excellent service and the best slice of pizza I've ever had .", "author": "Heather P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-06", "description": "Awful!  I ordered a chicken roll under the impression that I would receive a roll with chicken, marinara sauce, and mozzarella since that is what they normally are at pizzerias. I received a sandwich with chicken breasts and American cheese on it. Still starving!!", "author": "Victoria P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-21", "description": "This is my 2nd time and satisfied me just the same. I got my usual, buffalo chicken pizza. We also tried their garlic knots, $1.50 for 6 pcs which was a score but we were too full to finish it. The margarita pizza was also good, but the spinach pizza was meh. Anyway, it's always crowded so you gotta wait for a seat.", "author": "Paola S."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Front Street Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LVHDWuYoUFq5OpVt9Xj6JQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188753700"}