{"aggregateRating": {"reviewCount": 303, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-26", "description": "Needed some pizza after a long and hot walk over the Brooklyn bridge.  Walked by the other more popular joints .. Grimaldi and Juliana's and the lines were just too long to deal with while standing outside in the sun.   \n\nHappily we walked over to Front Street Pizza where some local police officers recommended..   we got right in and found a spot at a bar with high chairs.   Had our pizza which was pretty good within a couple minutes.   The service was solid and so were the slices.   The only reason I gave this 4/5 stars is because they could definitely do a better job cleaning up after guests leave.   It wasn't gross but there were straw wrappers and napkins pretty much everywhere.  Maybe it was just a busy Sunday afternoon but they could put a little more effort into cleaning the place up every now and then.  Otherwise it was a great stop and No lines !", "author": "Kevin H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-04", "description": "If you're in Brooklyn, and you're too hangry to wait in line for Juliana's, then swing in here for a slice. \n\nOrder at the counter, find a seat, pat off the grease with some napkins, then eat!\n\nThe crust is nice and crunchy and the pizza has good flavor, just a tad extra greasy then I'd prefer. Thankfully they have plenty of napkins!", "author": "Mandi W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-21", "description": "What did the pizza say to the pizza cutter? \n\nYou wanna pizza me?\n\n::: budum tush :::\n\nOk, this place has the best slices in Dumbo! Conveniently located, always replenished with all kinds of options. Slices are pretty big and decent!!\n\nI always go for the white pizza so as soon as I walked in, i knew what I wanted. This little spot, to be on the rush and on the go was definitely yummy! Our friends got other pizza flavors and they weren't too amused with it. I do have to say they have great service and fresh pizza coming out all the time since it gets so busy. Line can get long but it sure gets moving! \n\nEverything mostly is fast foody, they sell beer on draft from Brooklyn Brewery. Prices aren't the cheapest for the slice but like I said, probably the best slice you'll get in the area. Don't wait to cross over the Brooklyn bridge and go to Grimaldi's or Juliana's. They're both overrated. Believe me when I tell you you're better off with a quick slice right here.", "author": "Marietta C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-03-28", "description": "Came here for a quick bite with my fiance on a Thursday evening. Place was not too busy which was nice. Place has a good amount of seating. A satisfying dinner that did not break the bank. \n\nHeartbreaker hero- it's huge. I shared 1 with my fiance as well as a slice of Buffalo chicken pizza and we were both full afterwards. This hero was filled with lots of different things. Roast beef, fried egg, lettuce tomato, hot peppers , cheese, onions. The bread couldn't even contain everything. It was a very messy eat. Bread felt like it was disintegrating with every bite. My fiance was very bothered by the messiness, but I was fine with it. The beef was flavored really well. The hot peppers gave it a nice sour contrast to balance out the heavy meat.\n\nBuffalo chicken slice-it was interesting. My first time trying a Buffalo chicken slice. Honestly, I just saw a picture on Yelp and it looked good because I thought the white parts looked like ricotta or mozzarella cheese, but it's actually the blue cheese dip. Soo, it was pretty good I think but not really for me. I don't think I really like these heavy slices.\n\nOverall, food was flavorful. I would come back again to try other slices.", "author": "Ada W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-05", "description": "Loved it. Pizza was very good and the crust crispy and at the right thickness. Not thin and not thick. \n\nToppings were plentiful and tasty. Had pepperoni, cheese and meat lovers, which was loaded with meats. The slice was large and filling. \n\nStaff was friendly and authentic, and the location is great if you plan on walking across the Brooklyn Bridge. Can't wait to come back.", "author": "Robert C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-28", "description": "Excellant slices and breakfast sandwiches and pinwheels! Very friendly service! Would like to try a whole pie when time allows!", "author": "Flint L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-13", "description": "It's May.  It's Saturday. Not as crowded. Not a long line.  Ordered and sat right away.  It's New York!  It's a pizza in New York.  What more can you ask?  Would you seriously be able to know that it's not  better than the shops on the main street with ridiculous lines out the door?  I'm a tourist.  All I know is that it's not a previous frozen pizza and that's all I need to know that it's made in house.  That's enough for me to say that I had a New York Pizza.  Instgram: planefoodies", "author": "Loke P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-18", "description": "This place came highly recommended from a local I met while in NYC. IF you're looking for a great slice of pizza to accompany your dope instagram pic (Water St/Washington) I highly recommend this spot. The staff is very friendly and engaged and you'll struggle to find an owner not running around somewhere helping somebody. Great seating options inside as well (and restrooms, which is a rarity in NYC)! \n\nFor pizza, we had bbq chicken, buffalo, taco, and pepperoni. The crust was delicious and the pizza was thin, aka, required to fold in half and eat like a taco (True NYC Style apparently!). \n\nOnly complaint is that they don't offer free refills on sodas. I think one-refill would be totally appropriate considering how high the profit margin is on soda, but, it is what it is. Not something I would dock them for. \n\nIf you're visiting NYC you have to make a trip to Brooklyn. Dumbo is such a unique neighborhood and from here, you can grab a cup of coffee and walk across the Brooklyn Bridge back to the city (I recommend this at sunset, it's amazing! Oh, and free!!!).", "author": "Benjamin S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-07", "description": "Wow. Okay. What a great find. \nWalk into Front Street Pizza and you will know you are in Brooklyn ( old and new ). This staff is beyond hospitality. If I lived here this would be my local spot. The day I wandered in, the place was filled with locals watching the World Cup. It was super busy with great food, reasonably priced and an extensive menu. Happy I stumbled across this place. Down home Brooklyn. If I had a tip - it would be to renovate the bathroom. It's dated and only one stall. I spent $8 for two slices and a bottle of water.", "author": "Lisa P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-28", "description": "Really good!! We had an amazing Greek salad and a calzone.  We stopped here after walking the Brooklyn Bridge. This was a wonderful way to experience Brooklyn", "author": "Stacy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-30", "description": "This used to be my go-to spot when I first moved into this neighborhood. This was almost a decade ago. As downtown Brooklyn developed, this place went backwards. I kept giving this place the benefit of the doubt but over time, nothing was improving. The quality of the food went down and so did the delivery time. The chicken rolls used to come with marinara sauce and it used to taste so darn good. But now, the chicken roll decreased in size, comes burnt, and you have to pay extra for marinara sauce. The garlic knots are a 50/50 chance of being good or burnt. I wish I could list every problem I had but you'd end up reading a novel. \n\nI recently ordered pizza from this place to see if they have improved. In the picture, it looks like my food was mistreated. I don't know if the delivery man got into a head on collision with a taxi driver on the way here, but I didn't pay a delivery fee plus a tip for a limp pizza that looks like it's in need of viagra. Not only that, but it tasted like it was dipped in their toilet water too because of how soggy and lifeless it was. Might as well spit in my food next time. But guess what, there will be no next time.", "author": "Vincent S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-19", "description": "Great service and friendly. Lots of options for the family and kids. Slices are big and good.", "author": "Brittany M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-02", "description": "Trying to make this not an angry yelp review but took a client today for some pizza and were kicked out of our seats because they had a large group come in. \n\nBesides the staff being rude the food here is very average. \n\nGot a couple cheese slices and a sandwich. \n\n\nFirst the pizza was bland and oily- 99 cent slice spots are better than this.\n\n\nI also got a ham and cheese on a roll which was fine but ended up costing 11 bucks when the sign said it was 7 bucks and with my add ons would be 1.50 more. \n\n\nPlenty of better pizza spots in walking distance of this place.", "author": "John W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-05-11", "description": "I liked the garlic bread but the garlic in bread was strong. Good size of slice pizza but they should be more careful in not burning the crust. Lemonade was so so.", "author": "Patricio M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-04", "description": "This is the best pizza spot near the Brooklyn Bridge! If you're walking across the bridge, then stop in here for a quick slice!", "author": "Bryan M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-08-19", "description": "Came across this place while walking back to the subway station after my family and I had visited the ever famous DUMBO (Down Under the Manhattan Bridge Overpass) and we were clueless about where to eat. That's when we stumbled upon this little eatery in the heart of the city. It sits in the corner of an intersection, so that makes it easier to find.\n\nWe ordered one pizza; and it was a good thing we did. It was HUGE. They weren't shy about their ingredients either as it was covered with so many of the toppings we chose. We barely had any room on the table for this pizza pie. LOL If only we knew it was going to be that big, we wouldn't have ordered the spaghetti and salad.\n\nThe freshness and quality was pretty good. As far as the pricing goes, it was reasonable, considering it's in the middle of the city. Customer service was okay. When compared to other eateries, this place doesn't come close to top notch service, but then again it's not a full serviced restaurant. Most of the customers that were coming in there were mostly doing a grab n' go or having a quick bite and leaving right after.\n\nThe restrooms only have one stall for both men and women, so there could be a line for the ladies. This can get really annoying. I know that living in a big city, finding a decent bathroom is the hardest thing ever. For a place that has so many people coming and going, they should have reconsidered the restroom situation.\n\nAll in all, I wouldn't mind eating here again when in the city, but I wouldn't go out of my way just to have a slice of pizza here when it comes pretty close to other places. On the plus side, if you're visiting with a big group, one pizza pie can feed a lot of mouths. LOL", "author": "M-Lin G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-17", "description": "Love this place. Great and friendly staff. Owners are great people. Food is good. I ordered the heartbreaker sandwich and it was huge. Could only eat half but the half that I ate had so much flavor. It consisted of steak, cheese, fried egg, lettuce tomato jalapeños on a toasted hero bread. Yum yum.", "author": "Ana L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-09", "description": "You get what you pay for! Decided to give this place a try because I was craving pizza but I didn't want to overpay for a slice neither. When in New York... \n\nCool place and easy to find. Right by the Brooklyn Bridge Park as well as other shops, markets and cafes. Once inside there's no clear demarcation as to where to place your order. The only thing that was correctly labeled and functional may have been where you enter/exit and where to pay. \n\nWide selection on the menu other than just pizza. Affordably priced for New York and it was relatively good. No wow factor in my opinion. \n\nCustomer service was great as they were conversational and attended to requests in a rapid manner. \n\nTip: Not very clean or tidy. Food left on tables, leaking ceilings, and the women's bathroom well just don't touch anything with your bare hands. If you're a germaphobe pass this one by.", "author": "Uneak H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-11", "description": "This is a solid New York City slice joint, a good place to fuel up before walking across the Brooklyn Bridge. Juliana's and Grimaldi's around the corner get all the headlines, but if you're looking for somewhere you can grab a quick slice and get on with your day rather than waiting in line, this is your spot. Prices are reasonable, and the slices are large. Not the best pizza in New York, but that's not why you come to Front Street to begin with. If you're looking to sit down, there's plenty of seating available, however on the Sunday night that we were there, tables were slow to be bussed and as a result, we had to clean off a table ourselves. Not the worst thing in the world, but it's definitely an inconvenience. Recommended if you're in a hurry and looking for a quick meal.", "author": "Matt L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-12", "description": "This pizza joint is super convenient and located right in front of a photo spot for the Manhattan Bridge. The pizza is sold by the slice, but as in different sizes pies, with gluten-free options! Each speciality slice ranges from $3 - $5, but it is sure to fill you up!\n\nThe specialty pizzas cover a wide range of toppings, and toppings are given generously. I ordered the Buffalo Chicken and Hawaiian. The buffalo sauce was not as spicy as I wanted it to be, but the combination with the blue cheese and chicken made it perfect. After eating the Buffalo Chicken slice, the Hawaiian slice was slightly underwhelming, since it wasn't as saucy or flavorful. I was a little disappointed because one slice of pizza seemed fresh out of the oven (hot and crispy), while the other one was cold. \n\nThe staff is very friendly, and the restaurant has different lines setup, which made it very fast and efficient. I would definitely recommend this location for a snack or full meal!", "author": "Megan W."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Front Street Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LVHDWuYoUFq5OpVt9Xj6JQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188753700"}