{"aggregateRating": {"reviewCount": 303, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-31", "description": "Chicken cutlet sandwich was so good!!!!!!!!!!\nI was drooling so much while eating it.\nAnd it was so huge. Seriously worth your buck.\nWill definitely come back, sometimes I wished I lived in Brooklyn for these reasons.", "author": "Pinky C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-30", "description": "Good pizza the size of my face at a reasonable price? I was visiting a friend in DUMBO that brought me here, had the mushroom slice which was huge and pretty damn tasty. The guys all seemed to really enjoy what they were doing which is always fun and the space itself has enough tables to accommodate a busy Friday afternoon's worth of diners.\n\nMy only regret is not having enough space to try a pinwheel/their veggie lasagna. Next time!", "author": "Felicia Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-09-13", "description": "Great pizza, friendly and quick service, good prices, plus an awesome gluten free crust available.", "author": "Kristin T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-24", "description": "Shared a white slice and thought it was better than Lombardi's.  Guys behind the counter were nice.  Bathrooms were limited.", "author": "Lan N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-05", "description": "Gluten Free Pizza\nGluten Free Beer\nTurkey Bacon\n'Nuff Said", "author": "Jillian R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-30", "description": "While staying in Dumbo for 4 nights, I managed to eat here twice thanks to the shop's convenience and affordable prices.  It is the ideal place for a quick lunch or dinner.\n\nI tried their spinach and mushroom pizzas, an eggplant parmesan hero, a ham/swiss pinwheel, and some garlic knots.  Keep in mind I am not a fat ass...this all was for 2 meals for 2 people, haha.\n\nThe pizza was solid, nothing extraordinary but definitely decent slices and at a good price.  The hero was very good, definitely the most filling thing we ate here, it kept me full all day!  The pinwheel was my favorite, we actually order this both times we came here.  It is LOADED with swiss cheese, which is balanced out nicely with the saltiness of the ham.  The garlic knots were also pretty good, but if I got these again I would ask for some marinara sauce to dunk them in.\n\nIn addition to the food, the people working here are also great!  They seem to enjoy their time at work with random songs being sung from behind the counter.\n\nNext time I am in Dumbo and am in need of a quick meal, Front Street Pizza will see me again!", "author": "Amanda K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-26", "description": "red pepper with spinach is my jam. big slices (thank goodness because the price is absurd.. $3.80), fresh ingredients, sweet guys behind the counter, and conveniently on my walk home from the F train.", "author": "Steph G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-06-01", "description": "Came here for tew pep peps w my friend!!! They were kwik and hawt. The pep pep was greasy, soggy, but D Lish. Would cum back again", "author": "Marc I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-08", "description": "Excellent pizza, great place to grab a quick lunch; very fast \u0026 prompt delivery locally as well. Wonderful staff, they work fast \u0026 that's a big plus during the lunch rush! Delicious fresh pizza! A++++++++!!", "author": "Lisa J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-25", "description": "Food is good...can't beat the service! Of you get the chance try the sandwich that has chicken in it. You can also add your favorite sauces and veggies. \n\n\nIf your thirsty they have great beer and coffee selections. This is a great spot for tourists visitng and need a quick American bite to eat.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-01-07", "description": "Pizza - OK\nPinwheels - Pretty good\nGarlic knots - AMAZING!\n\nThe pizza was decent, but nothing to write home about.  The buffalo chicken half was a bit disappointing, while the traditional roni/shroom was pretty good.  The sauce and crust were both pretty good.\n\nHowever the star of the show were the garlic knots. They were soaked in butter, oil, garlicky goodness.  Some other words I would use to describe them. Chewy, hot, \"low-fat\".", "author": "Steve L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "One of my favorite pizza places! Pretty cheap and once I was short by a dollar and the cashier let it slide. The service gives this place five stars! They prepare food incredibly fast and are very attentive. The pizza is large and yummy. I have tried the chicken and broccoli, pepperoni, and cheese slice. I loved them all. Seriously like this place a lot! There is also an abundance of seating!", "author": "Karen W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-10", "description": "Food crawl stop #7.\n\n5.5 stars for pizza by the slice.\nWhat kinda bull poopoo for the \"no-slice policy\".\nYou know who I'm talking about.\n*sneer*\n\nAnyways, this place was bustling but it's run very efficiently.\nProps.\nThere are several guys behind the pizza station, and even with a dozen people standing in front of them, they remember exactly who gets what.\n\nAnyways, on to the pizza.\nMy first bite of the mushroom slice was impressive.\nGood quality cheese, not just a melted slop on top.\nFlavorful sauce.\nAnd the crust.\nOh, the crust.\nCrispy on the bottom, slightly chewy on top.\nThat was the most perfect crust on a true NYC pizza.\nI personally prefer cheap pizza vs. fancy brick oven pizza.\n\nThis slice ruined my neighborhood pizzeria for me for good.\nSorry, Claudio's.\nI gotta schlepp my big ass over the bridge for pizza now.", "author": "Sophia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-05", "description": "Amazingly good pizza. The plain cheese pizza was actually my favorite as you could really taste the quality products!", "author": "Wendi D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-24", "description": "Instead of waiting forever at Grimaldi's, grab a big slice of pizza at Front St! The owner and his staff are great people and the crust on their pizzas is perfect.", "author": "Jess F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-16", "description": "I really like this place. Everyone behind the counter is so friendly. My company oftentimes uses them to cater very large meetings and the food is always great. Seating is limited due to the sheer amount of people who come here to eat. That says something! I'm a fan of the vodka slice it's sooo good.", "author": "Bonnie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "Great food, good service, great prices and very clean. \n\nChix parm hero was good - the bread was amazing, it was cooked and crispy yet soft and chewy. It was also nicely seasoned with sesame seeds. \n\nBuffalo chix pizza was good - if you like a little kick I recommend it. \n\nGarlic knots were OK - at 6 for $1.50, they were a very tempting menu item but not super satisfying.  \n\nFamily friendly and tons of options! They have both pepsi and coke products as well as beers, wines, coffees and teas. \n\nI would definitely come back!", "author": "Jaclyn T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-06", "description": "Mediocre gluten-free pizza....AMAZING gluten-free veggie lasagna.  To. Die. For.  Well, actually, I didn't, because it was gluten-free.  But anyway, very yummy, huge portion, perfect amount of veggies and sauce.  Their garden salads are pretty good too, black and green olives a nice touch, and yummy low fat Italian dressing.\n\nNice delivery guys too. Sorry for making you schlep so far, but I love you for it.", "author": "Amy R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-12", "description": "Excellent slice for a late night bite! Good to get away from the long touristy lines of Grimaldis.\n\nStill very packed at night, came during the Dumbo Arts Fest and there was even more locals and tourists alike. \n\nLoud band was performing outside, which was kind of annoying but made so much sense while eating a folded Brooklyn slice. Had the plain slice with the bf. Love the amount of cheese on it!!\n\nService is quick and loud just the way it's supposed to be in NY. Try it!", "author": "Lilly T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-02-17", "description": "It's alright....not the worse, not the best. Average. At least the regular pizza slice tasted fresh. Spacious, clean place. If you're a sports fan you might like it better. They broadcast games on their flat screen televisions.", "author": "Angel H."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Front Street Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LVHDWuYoUFq5OpVt9Xj6JQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188753700"}