{"aggregateRating": {"reviewCount": 303, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2009-08-08", "description": "After a day of shooting photos at Brooklyn Bridge park, my friend and I decided to stop here for lunch. I had the small buffalo wings and potato knish. It was a long wait for the food. And it was overpriced for it's quantity. The wings were minuscule and so was the potato knish. It came out to be 5.80 which was ridiculous if you saw the size of the food. Seriously if you want a decent meal don't waste your time here.", "author": "Virginia Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-10-05", "description": "Quick, tasty, cheap, crispy crusty pizza.  Warm and attentive service.  Chill, laid-back vibe--the perfect antidote to the Grimaldi's tourist-trap madness down the street.  I brought a friend here and we enjoyed fresh tomato pizza, buffalo chicken pizza, and eggplant parmigiana pinwheel (yes, that pizza was by the slice! hurrah!)  I wish I could call this my neighborhood pizzeria, but sadly that title goes to Sbarro's (oh the shame).", "author": "Demitasse E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-03", "description": "I'd give this place plenty o'stars just for the garlic knots alone!  I didn't really know what they were at first, but pat on the back to myself for going out on a limb and giving them a try.  So.  Good.  A great alternative for pizza when lines are long at Grimaldi's; these guys are speedy.  Plenty of other options too, but c'mon now, who goes to a pizza place and gets something other than pizza?  Besides the garlic knots of course.  That's a must.", "author": "Becky R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-04-26", "description": "BEST GARLIC KNOTS I'VE EVER HAD. Seriously. All buttery and greasy, and just YUM. I haven't had much NY pizza, but this was pretty good. I enjoy a sweeter sauce, but the pizza was still really good. And they delivered to the Marriott (on a bike) which I feel like was out of their \"zone\" but they did it anyway. If nothing else, go for the garlic knots!", "author": "Amuse B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-05-16", "description": "So this is the thing, I work down the street from Front Street, its too easy to come here. I got to admit, I do prefer Fascati's but it's might just be a phase or because the weather is nice now and I'd prefer to walk a bit. If the weather is bad and I want a slice I come to Front Street - which is like - oh boo hoo me - I have like three awesome pizza choices within a 5-10min walk. But yeah, great slices of pizza here, very cheeky (new york style gruff surly and hilarious) people behind the counter and the slices are huge. And tasty. Oh so tasty.", "author": "Carl C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-02-20", "description": "A great place to get a quick slice for lunch - good pizza and fast service.  Close enough to the park to go and eat there watching the river in nice weather.  Placing your order and picking it up is a bit chaotic - if you're expecting an orderly line, you're out of luck.  But, it all works well enough in the end; just stick with it.", "author": "Lucien V."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-04", "description": "Let me be frank, you really have to \"WOW\" me to earn my yelp 5.  FSP offers the traditional pizza fare.  But I came here to sample the chicken parmigiana. The hero came on a semolina hard roll and standard cutlets with mozzarella sauce.  Not the biggest \"WOW\" factor in the world, but a decent pizza place with adequate seating and good service.  People flock to FSP, well, because of convenience.  There are few options in the DUMBO area for a slice, there's always pies at Grimaldi's, of course!", "author": "Neil P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2006-10-16", "description": "Yes it was the first thing I had eaten in almost 24 hours, but the pizza was great.  I got a huge piece of pizza and a soda for $4.  It's just a run up and order and pay in the same spot mess, but people there were really polite, the employees were quick and it was a comfortable place to stop for food.", "author": "Andy H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-13", "description": "The food is a tad bit more expensive than your average pizza joint but it's definitely worth it! They've got so many different kinds of slices, rolls, and other goodies (soups are yum, sandwiches are huge and delish) that you can find just about anything you're looking for during lunch time. They even have a grill if you're looking for a burger!", "author": "Adrienne P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-07-13", "description": "We stopped here after deciding the queue at Grimaldi's was too much to deal with. I think we chose well - we had the tradtional tomato base and added artichokes, spinach, fresh tomato and prosciutto - that said the last ingredient was more like bacon than prime italian ham. The wait for food once we were seated a Sunday evening was a little long at 45 minutes however the company was good and by the time it arrived we were ready to tuck in. We finished a medium easily between two. Other nice quirks? The wine glasses were not dissimilar to what you might find in a church but did come in funky stone blue, pink and red. All in all, decent service a good feed and relatively thin pizza, I look forward to the NYC quest to find the perfect pizza....", "author": "Nadia G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-23", "description": "Stopped for a quick bite before location scouting the Brooklyn Bridge park.  I'm from California, so I don't know any better, but this tasted like good NY pizza to me.  Got a pinwheel too which was interesting and yummy.  Plus Goonies was on tv...random.", "author": "Yasmine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-07", "description": "Man...this is the spot if you want something quick and cheap without sacrificing quality...\n\nPizza: Fresh, Delicious, Crispy\nService: Quick, Good, Friendly\nPrice: Cheap, fed 5 buddies (at least 2 slices \u0026 drink each) for $35 total, avg $7 each\nRest of Menu:  Man...too many choices, hard to decide...can't go wrong w/ the pinwheels!  less than $2 each....oh man!", "author": "B B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-04-26", "description": "With an absurd line at Grimaldi's (could it really be that good?) Front Street Pizza was the first place we found where we could get some rich blends.  2 buffalo chicken slices, a gatorade, and a tall bud for 11 bucks is pretty legit and the pizza was solid.  Relaxed vibe, good vibe, I like it.", "author": "Mike W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-30", "description": "C'mon it's pizza. Pretty decent too. Had better, had worse. Whaddyagonnado!", "author": "Ez M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-01-11", "description": "Great and Massive Subs! Have not tried the pizza, but there are better options in the area.", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-12-21", "description": "Cheap, good and a nice break from the cold.  They also have sandwiches that looked really good.", "author": "Jessica M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-03", "description": "Not only is the food hear awesome and VERY reasonably priced, but everyone that works there is the nicest person in the world. the food is great, but it's the way they treat their customers that keep me coming back.. sounds really cheesy, but im a huge fan of this place just for that reason.", "author": "Rian R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2008-03-28", "description": "I don't get their prices.  The menu offers up a hero with \"Turkey, Bacon, Fresh Mozzarella, Lettuce, Tomatoe (sic), Hot Peppers, Fried Onions, Mayo on a Toasted Hero\" for $6.95, but apparently, a chicken cutlet hero with lettuce, tomato, onion (nowhere to be found on the menu or their board) is $7.40.  Add bacon and Cheddar and you are up to $9.40.  And the sandwich wasn't even that good.  It had, maybe, three pieces of bacon and two pieces of cheese.  A few blocks away at Jimmy's that sandwich is $6.50.\n\nAs for the pizza, let me put it this way, my office has pizza lunch together every two weeks.  We used to order from Front Street, but have recently started ordering from another place on Henry Street.  Everyone in the office commented on the improvement.\n\nAnd the service?  Very disorganized.  I went at admittedly a busy lunch time, but the guy behind the counter was chatting-up a customer while others waited to order.  Then I paid my $10.40 bill with $21.  He gave me $9.60 back.  When I pointed out I gave him $21 to make the change easier the woman next to me said, \"yeah, he did\" and rolled her eyes.  Guess I'm not the only one.\n\nHow do I explain the positive reviews this place gets?  Limited options here.  If you want a good slice of Pizza, check out Carmine's on Graham Ave in Williamsburg.", "author": "Pfepher P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-20", "description": "When not taking out or eating in at  Grimaldi's, this is my favorite delivered pizza in the Dumbo/Brooklyn Heights area.  Not special, but a solid New York pizza.", "author": "Steven T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-09-21", "description": "Seriously people.  The pizza here is horrific.  They could not possibly make it with cheaper ingredients.  The raves about the pizza are a complete joke.", "author": "Peter W."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Front Street Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LVHDWuYoUFq5OpVt9Xj6JQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188753700"}