{"aggregateRating": {"reviewCount": 303, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-30", "description": "Friendly service and a pretty decent slice. In any other neighborhood this might just be a three star place, but given the complete lack of NY pizza places in DUMBO (Grimaldi's and Juiliana's don't count), Front St gets a bump up.", "author": "J W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-01-24", "description": "Wow, no idea why this place has good reviews.  I tried the pizza tonight and, man, it was seriously the worst I ever had.  Believe me, I WANTED to like it, since the place is a couple blocks away from me.\n\nI'll try something else there sometime...but I would never go near a slice of that stuff again!", "author": "Keith D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-04-15", "description": "I wanted a quick bite before the Yelp elite event and apparently Grimaldi's doesn't do slices, but Front street does!  The pizza wasn't very good, basically what you would get at a Sbarro.  But I was impressed that the place had some ambience -- most pizza places just fail on that. It felt like a neighborhood place.  And the folks here are really polite.  So I will be generous and give them a third star.", "author": "Jim U."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-02-14", "description": "This was the only pizza I got to get on this trip.  It wasn't that good.  I got the Buffalo chicken.  It was kind of bland and the crust was like a cracker.", "author": "Bryan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-28", "description": "Fairly average. Great area of DUMBO.  Good pizza, but not spectacular.  Great prices.  Fast service. AND they take credit cards.", "author": "Mark M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2006-07-24", "description": "This is what I imagine when I think of a real local neighborhood pizzeria!  The pizza is excellent...but they also have tasty salads (for the unbelievably low price of $3.95, $4.95 with chicken) and stromboli, calzones, and even breakfast food.  The best thing about this pizzeria is that it delivers in DUMBO!  Nothing delivers in DUMBO, so this is a really important selling point!", "author": "Krista J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2009-05-27", "description": "DISGUSTING. \nOrdered an office lunch from them for four people and one of my colleagues slurped up through her straw what looked like a mop string - YES, A MOP STRING! It was dirty and disgusting. I called to complain and the best I got was a halfway sincere \"I'm very sorry\". I said we no longer wanted our food and wanted a refund in full. They argued with me, saying that the drink doesn't effect the food. I told him that was ridiculous. He then argued further asking if we'd eaten the food. I said we'd started to, but weren't going to finish, they could come collect the remains. \nHe mumbled \"give me a few minutes\" and hung up on me. \nThe owner / manager? came to the office. I gathered up all the leftover food for him and he offered up no apology, just attitude. We showed him the string and he ARGUED with us that there is nothing like this in his restaurant. We asked him if he thought we were making it up (we are a well respected upscale business), he gave us a half ass reply. \nMy boss (business owner) came up, furious that he had made the journey to pick up the leftovers and offered up no apology or offer to correct the issue and handed him our menu saying we wouldn't be needing it. He took my fax number to send us proof of voided transaction. On his way out, he said that he didn't need to take these \"dregs\". \nSuper professional!\nWhen I turned around, he had left the menu!\nAnd then to add insult to injury, when he faxed the receipt, he also faxed all 6 pages of the menu. \nWill never eat from there again.", "author": "Shara C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-01-29", "description": "Whenever I am in DUMBO and people ask me to point them in the direction of \"the great pizza place here\" I point them towards Front Street Pizza.  Not Patsy's....eh Grimaldis.\n\nFront Street Pizza not only has amazing pizza, but also serves other great food.  Their Veggie Burger with fried onions is killer.\n\nThe service is friendly and helpful and this plus their great pizza is why I will walk down to DUMBO and even take a subway to eat there!\n\nThanks Front Street Pizza!!!  Keep the great food and service coming!", "author": "Dean R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-01-22", "description": "One of my favorite things about eating in New York is that you can walk in to any anonymous pizza place and get a satisfying slice. Well, I walked in to this place, and I'm sorry to report that it doesn't even meet the decent-random-place standard. The plain slice was unpleasantly floppy and oily and tasted Tombstone-esque. The veggie slice was even grimmer -- a congealed layer of canned/frozen-type veggies on top of a soggy crust. They have a big menu -- sandwiches, garlic knots, etc. -- so the other food may be better. But for a place with pizza in its name, this was a disappointment.", "author": "Allison N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-11-14", "description": "A pinwheel and a beer for $5! Friendly guys always there for you. Classic New York joint. Skip the line at Grimaldi's and grab a seat.", "author": "C C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-02-02", "description": "'re hungry because you woke up late this morning and have not had breakfast. It's 2 pm you have not eaten and are you going (late) from a customer who expects a project that you have not been able to finished? \n\nbefore doing other missteps, do this: stop by Front Street pizza, throw a deep breath and get your own slice margherita ... maybe an appointment with your customer will still hurt, but you will have enjoyed one of the best slice of pizza in NY, that you could taste only if  you are in Italy ... (Trastevere in Rome or  mergellina in Naples or \"definitaly\" at  Gennaro Esposito in Turin)!\n\nThree reason to believe to this review:\n\n1. I'm pizza addicted\n2. I've eaten at front street several times \n3. I'm italian", "author": "alex m."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-20", "description": "Searched \"gluten free\" on seamless web and to my delight and surprise, Front Street Pizza came up as an option. Called and had it delivered, after one bite I had to call back to make sure it was in fact gluten free. It is that good, and at a reasonable price! It is pizza like I remember eating as kid. It is probably a good thing I only work in Dumbo once a week, or I would probably grow quite large.", "author": "Mollie R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-01-15", "description": "Ordered a plain pizza for delivery with a friend. The cheese is pretty typical of most decent New York pizzas; the sauce was alright (reminded me a lot of Famous Famiglia); and the crust was thin and crispy. It wasn't the best, but it definitely qualifies as New York pizza. A good choice if you're in the area.", "author": "Adam W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-31", "description": "I want to start this review by stating that I love pasta.  I will eat any type of pasta. I will eat it plain.  With red sauce.  With white sauce.  I would probably even eat it raw if push came to shove.\n\nI ordered eggplant parm with a side of spaghetti for dinner.  I ate three bites (two spaghetti and one eggplant) and threw the entire dish out.\n\nWhen I throw out food, esp pasta food, you know it's bad.\n\nHow do you screw up spaghetti and tomato sauce?  I have no idea.  But somehow, Front Street Pizza managed to make it completely inedible.  It kind of tasted like it was cooked, the microwaved, then left to cool, then microwaved, then left to cool, approximately 10 times.\n\nSuch a bummer because Front Street is like 1/3 of the dining options in dumbo.", "author": "Daniela J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-04-30", "description": "Always good, always fast and always friendly, even when I bring my kids, which is unheard of in DUMBO.  Love this place!", "author": "Jen W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-02-27", "description": "I order from here at least twice a month and I always ask for the large pepperoni pie, my family loves it!! They make pretty good pizza and the delivery is always quick! Am actually eating a slice as I type and boy am I in heaven! The garlic knots and beef patties are awesome as well!", "author": "Yessica D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-23", "description": "The gluten-free pizza is legitimately good.  I agree with the other reviewer.  I've had it twice and will definitely order it again.", "author": "Bill G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-04-24", "description": "after a long walk over the brooklyn bridge, my group could think of one thing: food.  we checked grimaldi's, but not surprisingly, the line was down the street, so we looked around and found front street pizza.\ni got a pepperoni slice and their \"famous\" pepperoni and sausage pinwheel...while the pinwheel was definitely different, it wasn't anything special that i need to eat again.  likewise, the pizza was your standard pepperoni that i think you can find at any shop in ny.  while their prices are reasonable, you get what you pay for...and if it's less than $5, they do not accept credit cards.", "author": "Todd O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-08-25", "description": "Terrible choice. I chose this place because it got 5 stars on seamless web. Big mistake! Pizza was bland and the garlic knots were even worse. I will never order from here again.", "author": "Stacey G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-28", "description": "As many others have pointed out, it's tough to find slices in DUMBO. Being tourists (gasp!) we didnt have all the time in the world to wait at Grimaldi's so we ended up here. I've definitely had better pizza elsewhere but we were hungry and this hit the spot.", "author": "Matt J."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Front Street Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LVHDWuYoUFq5OpVt9Xj6JQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188753700"}