{"aggregateRating": {"reviewCount": 303, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-27", "description": "Pretty decent gluten-free pizza. Thank god! For those times that you want to enjoy pizza, but not be on the toilet the next day. Super pumped about this pizza option in the area.", "author": "S L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-24", "description": "Pizza? Check\nUnbelievably Large Menu? Check\nBeer? Check\n\nNeed I say more. Nope. \nIt's just nice to have  a regular pizzeria in DUMBO that is unpretentious with laid back Pizza-men who have been doing this since they were born. Nothing fancy, nothing over the top..just right.", "author": "Allessandra C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-11-22", "description": "Canceled Breakfast Menu!!!\n\nThis place does not do Brooklyn style pizza justice. However, I don't mind coming here because the guys behind the glass are sweet.\n\nAnyway, I sometimes get the fried calamari on Fridays, and when I am sick of Peas \u0026 Pickles or 7 Stars Deli, I come here for a sandwich, pizza, beef patty, or garlic nots.\n\nFresh lemonade is cheap and tastes great.\n\nNote: Place can get pretty crowded, especially around lunch time...", "author": "Tiffany S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-19", "description": "They have the best pizza and it's not expensive.  They have garlic bites witch are great, also they have gluten free bread, there's many different foods to choose from, it's usually full because of how popular it is.the slices are huge and floppy so even with 1 pice you should be full.", "author": "Lawrence L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "great pizza place, with super friendly service (that truly remembers repeat customers, even with all the passing tourists they get). \n\nused to order the regular slices daily, then started ordering the grilled wraps for lunch. let's just say, these wraps put Subway to shame! the wraps are FILLED with meat, making it a truly satisfying lunch. \n\nthis place is known for their pinwheels, which are amazing (with and without marinara sauce).", "author": "Kayla M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-23", "description": "I digg this pizza spot quite a lot! \nThe staff is always really nice and seem like genuine New Yorkers. Which is a nice change from the guys that almost don't speak English at other pizza-by-the-slice places in NYC.\nThe pinwheels are like pizza pot-pies that are apparently unique to this place. They are really good and reasonable in both girth \u0026 price. \nThe garlic knots are very good and affordable. (6 for like $1.50!)\nThey also have a little deli section \u0026 plenty of seating.\nAll in all a great staple in DUMBO.\nHowever I just can't give this place 5 stars b/c I don't LOVE the pizza. I like it...but something is missing for me.", "author": "Vince O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-09", "description": "Bread knots or whatever were amazing - and GLUTEN FREE BEER!!!!! Yes! great spot for a cheap drink \u0026 snack!", "author": "Audrea Rachelle G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-04", "description": "i gave one star only because i had to. i ordered from them because im a person who never has cash and they accept cards minimum of $5 bucks great. save your money i dont care if you're starving make a peanut butter and jelly sandwich ! i ordered a simple burger and fries i just tried to chew threw that bitch. it was hard and stale as a motherfucker im 28 years and i would need dentures just to eat that hard shit i regret spending my $ on it honestly i dont even think stray cats would bother with it. it was so stale its 5 minuets away from molding just dont order from them do your teeth a favor", "author": "E M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-28", "description": "I know nothing about Brooklyn pizza, but I do know hunger.\n\nA friend and I were passing through DUMBO on a chilly March day when we passed Front Street. Starving and cold, we thought a slice (and cheese fries) sounded like a perfect antidote.\n\nWhile the cheese fries were completely lackluster (orange cheese, freezer-section fries), the tomato pizza was amazing. Fresh out of the oven, fragrant with garlic, and covered with large slices of tomatoes. It was heavenly. Simple and delicious.", "author": "Jennifer R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-07-04", "description": "This is like a high school cafeteria style pizza/whatever-the-hell-you-want joint.  It's not horrible, but if you're going to Brooklyn and you're on the look out for some fantastic pizza, I'd wait in line and Grimaldi's.  \n\nIf you're in a rush and you want a quick square, stop on in and stuff your face.  \n\nIt is pretty cheap and they have a wide variety of food so it's a pretty solid stop as a quick lunch location.", "author": "Mike B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-24", "description": "I went to school in Downtown Brookyln. Dumbo was our escape from the hustle and bustle because it's way more quiet and peaceful. I've been here numerous times and i was never impressed or really enjoyed the food for that matter. With me and my friends it was always \"well i guess we're going to Front Street\". Partly because they are cheaper than anything else you might find in Dumbo and because they have a lot of variety.\n\nTheir pizza isn't anything to rave about at all. They have a lot of slices that all look delicious but are disappointing. Their plain slice is just awful, don't even bother. You couldn't even offer me a free one. \n\nGood:\nvariety (sandwiches, pasta, slices)\ntv with espn/news\n\nBad:\nplain slice is awful", "author": "Rojé G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-30", "description": "As part of road trip from the West Coast, we spent a great deal of time in NYC..  A few times local folks mention to us to try out Gramaldis in Brooklyn. They said it was the best pizza place to go so we gave it a go. The lines though were huge and werent moving very quickly. So we decided to head back to NYC and ended up on our way to the subway.. came across Front Street Pizza.  \n\nAnd it didnt disappoint. The owner welcomed us and made sure our order came out, just like we wanted. The pizza slices were big and the sauce was very tasty.. and not very salty.  \n\nThe place was clean, well run and it seemed all the customers were very happy with being at Front Street.   When we go back to NYC, we definitely will make a visit to Front Street Pizza", "author": "Uggie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-15", "description": "Made a quick stop here before heading out of NY and we loved it. Great prices, I think we paid like $12 bucks for 4 slices and two drinks. I'll take it. The pizza was pretty good, although definitely thin, so it was hard to keep it together. Not a problem, because it tasted great, the place had tons of seating, bathroom was clean and the staff was nice. Recommend!", "author": "Kasia K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-27", "description": "Great Pizza with a tasty crust. No long  lines either. \n\nGarlic knots were delicious. \n\nNext time I will try their pasta.", "author": "Juan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-13", "description": "I had the garden salad and spaghetti and meat balls.  The price was excellent.  The garden salad was fresh but only had olives (black and green), lettuce, cucumber and tomato.  The tomato sauce on the spaghetti was good, not great, but the meat balls were second only to my own!  Nice and clean atmosphere.", "author": "Donald H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-17", "description": "Go here all the time for lunch if anything just for the huge selection of foods. where else can you choose between pizzeria foods, deli selections, and a full grill??\n\nBest stuff to get:\n\nTaco slice: delicious but sloppy. definitely do not get if you end up here on a date somehow or if you care about being judged.\n\nANY salad with grilled chicken: They make the chicken fresh to order, not like most places that simply heat up pre-grilled chicken. SO fresh, so so good.\n\nHotdog combo: 2 hot dogs, fries, and a drink for $6. perfectooOoo\n\nMeatloaf and mash: definitely like home cookin from yo' mama - always needs salt\n\nBowtie pasta with garlic and oil: one of my personal faves, sometimes i get crazy and throw in some grilled chicken and broccoli.. only when I don't plan on seeing my boyfriend for the next 24 hours.\n\nRoastbeef w/ fresh mozz : very flavorful roast beef, they make it fresh as well. some salt pepper n mayo - mMmMmM\n\nGreat service, so friendly - and seriously the ONLY place in dumbo that plays the yankee games!!!!!", "author": "Jessica A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-02", "description": "Good low key option for pizza in dumbo. Not the same wait as Julianna's or grimaldis, and the pizza is nearly as good. Subs are on very tasty French bread. Also serve beer which is a plus for a pizza shop", "author": "Randy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-09-04", "description": "Stopped in after walking across the bridge from Manhattan on Saturday afternoon.  Service was friendly (I think people who say it isn't were probably not friendly to the servers themselves!) .. You have to be on your toes though.. the line moves quickly and you better know what you want!   We ordered slices -- I had the vodka sauce/mozz and plain cheese, my friend went with pepperoni and one buffalo. -- she loved both, I loved mine.  I wish we had tried their \"famous\" pinwheels -- I heard a lot of them getting ordered while we were eating..  The pizza is perfectly thin crusted -- the cheese stays on (and doesn't slide off as soon as you fold it to eat it).. plenty of that delicious pizza juice that dribbles onto your tray to sop up with the crust at the end.. I would go back.  I'd even walk.", "author": "Stefanie K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-11-25", "description": "BEST GARLIC KNOTS in the city. I never thought I'd be raving on about garlic knots but really... they are nothing short of heavenly here. \n\nThe pinwheels are equally amazing (only $1.75) and the pizza is as good of a representation of classic thincrust NY as you can get. \n\nLove this place.... and Larry, Shorty \u0026 the boys behind the counter :)", "author": "Kimberly K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-02-20", "description": "Do not order anything other than pizza. If you order fries, you get tater tots. Explanation will be \"well they're both potatoes.\"  turkey burger looked like it was punched. \n\nEtc etc. blech.", "author": "Jess k."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Front Street Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LVHDWuYoUFq5OpVt9Xj6JQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188753700"}