{"aggregateRating": {"reviewCount": 303, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2013-12-31", "description": "I usually like this place.  However, we got a mushroom pizza on Saturday 12/28/13 and the mushrooms were CANNED.  If you order mushrooms, ask if they are using fresh or canned.", "author": "Nj L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-10-10", "description": "Stopped in here for a quick bite, when in NY gotta try the pizza. It wasn't bad but it wasn't do die for. I like the location and the decor. Staff were fast and to the point, enjoyed some of the live music going on outside.", "author": "Andy F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-05", "description": "This place is a great corner street food for pizza lovers. Quick, cheap, delicious.", "author": "Mert S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-18", "description": "Solid pizza and lively, friendly staff behind the counter. \n\n\"Sal. Sal. Sal! Run this credit card!\"\n\nThe wholewheat pizza for those delusional enough to think it's healthy is tasty, if you're into that sort of thing.\n\nOff the menu item to have, hold dear and make sweet man (or woman)-on-sandwich love to: the reuben. It's not a Carnegie/Katz's Deli situation, but the price is right and as you succumb to a coronary on the way out the door, you'll die knowing that which has killed you has also made you feel truly alive for the first time.\n\nI once called in a delivery order:\n\nMe: Hey, I'd like to place an order, are you guys still delivering?\n\nFS Guy 1: Yeah, what can I get you?\n\nMe: We need 2 pies, 2 dozen buffalo wings and a calzone. \n\nFS Guy to FS Guy 2: Hey, can we make any more calzones?\n\nOther FS Guy to FS Guy 1: This is a pizzeria. We have dough, we have cheese.\n\nFS Guy 1 to FS Guy 1: Thanks a lot jerk-off. \n\nFS Guy 1: Sorry about that sir, I work with a bunch of retards.\n\nClassic.", "author": "Peter F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-01-13", "description": "I am a Chicagoan and there is no debate in my mind who wins NY style v. Chicago style....Chicago. But I am in New York and had a craving for pizza so I thought I would get some.\n\nI got two slices, pepperoni and buffalo chicken. That is one thing about NY style pizza; you can have all these weird combinations. There was also a taco pizza available.\n\nThe pepperoni was pretty standard but I really like the buffalo chicken. I think they combined the hot sauce with tomato sauce because you could taste the hot sauce.\n\nIn addition to pizza they have standard Italian fare, pinwheels and burgers, etc. \n\nIt isn't a bad place to stop to get a slice of pizza in DUMBO.", "author": "Chris M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-16", "description": "This place is awesome. Good pizza, great service.", "author": "Marie S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-06-16", "description": "You can definitely do better.\n\nPros: Average price for a plain slice, fast service, good selection of different pizzas available.\nCon: the pizza itself.\n\nYou could say that this pizza couldn't possibly offend anyone.  It certainly looks like a regular NYC slice - I guess that would only offend Chicago deep dish pizza fans.  It's made from cheese, tomato sauce, dough, and some seasoning.  Its taste isn't horribly repulsive, so that's good.\n\nBut when I do get a slice of pizza, I really don't care too much about how it looks or what it's made of as long as it tastes and smells good.    I want to enjoy every bite, revel in its cheesy and tomatoey goodness, and feel the crispness yet softness of the crust.  That's what I experience when I eat a good slice of pizza.\n\nI can honestly say that I did not enjoy a single second of the plain slice at Front Street.\n\nAs I've said, it's not like this slice tasted bad.  It's just that...it didn't taste like anything.  This had to be one of the blandest, most literally tasteless slices of pizza I've ever eaten.  \n\nPerhaps this lack of flavor was simply a ruse to get me to buy the more expensive specialty slices.  Whatever it is, if I'm ever forced to order anything from Front Street Pizza again, I will splurge just to avoid ever touching their plain pizza slice ever again.", "author": "DC C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-27", "description": "For some reason, they've gotten even better over the last few years. Not sure why, but I'm happy. Seems like the base dough they use is better now. For a great pie without pretensions, this is the place to go (or call).", "author": "Zando E."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-11", "description": "I work in DUMBO, so my food choices are limited. I go here by default because sometimes I just need a carb fix. This review is sounding better and better, right? Well, their tomato sauce is very acidic, so I tend to stay away from their pizza. I'm writing this because I got really bad food poisoning last week from their stuffed chicken, which, suspiciously is on the menu every Monday. I'm guessing they freeze a batch of it and continue to defrost and use prepared food every week. Anyway, got REALLY SICK. Be cautious.", "author": "Jeanie K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-06-01", "description": "I don't like what pizza has become, I like what pizza was. Front Street Pizza is your neighborhood pizza joint and what pizza was back in the day. Look, they're busy making pizza, if the table is messy use a napkin and clean it. The service is completely friendly and the prices are excellent ($2.50/slice) and you can get in and out of there in less than ten minutes if you want, even if you sit down.\n\nI've only been here once and I am sure to give it a few more goes before making a final decision, but my slice had more highs than lows. It's good pizza, a little too greasy for me at first glance as once I have to soak up the grease it makes things a little messy around the table. The crust is excellent and the pizza rides that nice line between thin and too thick.\n\nThe menu is pretty large actually and they have much more than pizza to sample there, including what looked to be some pretty tasty garlic knots. They also had a salad pizza that looked real good as I was peering through the glass intently waiting for my plain slice.\n\nThere are a lot of tables inside and two tvs to keep you busy. However, if you are like me and you bring your kids in there for a quick slice you may have to explain to them why E's Most Shocking Celebrity Meltdowns is actually a decent show, just when you are a little older. I mean I wasn't expecting iCarly to be on, but E?", "author": "Jonathan G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-26", "description": "another great NY pizza. had the sausage. came out of the oven pippin hot so pie kind of broke up on me but still very good.  service was great although ordering is kinda confusing but the kid behind the counter was cool. bathroom on premise! found seats easily at rush lunch hour. even some benches set up outside.", "author": "G Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-10", "description": "We ordered delivery from Front Street for the first time this weekend. Their prices are good but their menu is a little strange only serving a lot of dishes on Sunday. We order eggplant rollatini which we liked but could have had a little more taste to it. We also got a chicken parm and a calzone. I did not taste the chicken park but I was told it was very good. The calzone was ok but I had requested that there be spinach inside and extra sauce on the side and they did not do either. So if you like a lot of cheese inside some dough the calzone is for you. The side of bread that came with the food was stale. I would order from here again but might wait for another Sunday so there is a wider selection on the menu.", "author": "Aimee M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-19", "description": "Fast service, the staff was nice to us. The placement is nice on a well light silent side of the bridge. Clean and the pizza was good. Great place to grab a slice after hanging at the DUMBO park.", "author": "Trey N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-11", "description": "Excellent pizza, garlic knots were different than what I'm used to, but still okay. The pizza is really really great though. The whole place is exactly what you think when it comes to \"Brooklyn pizza\" but doesn't feel forced or lame. Easily in the top 10 best slices of pizza I've ever had. A great stop for a perfect day in Dumbo.", "author": "A S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-06-05", "description": "Kyle H and I are still hunting for a decent item on Front Street's extensive menu.  Their cheese pizza is edible, but if you add toppings you are not likely  to finish your slice.  Their buffalo wings are fried nuggets drizzled in oriental hot sauce.  Their worst item, however, is their \"specialty\": pinwheels.  The horror begins when you order a wheel and they pluck  what you had hoped was simply their display case pinwheel (why else would it look so old?).  They heat it for a few moments, charge you $1.65, and then rid themselves of the abomination forever.  The worst of the wheels is the ham and swiss (i.e. ham and mozarella).  The one time I tried it I ended up with a small puddle of  ham juice in the palm of my eating hand.  Kyle was appalled.  \n\nIf you can manage to walk the extra 2 blocks to Grimaldi's, do so.  I don't know why Kyle and I haven't done this yet.  In any case, don't make the same mistake we do, over and over.", "author": "Bill B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-06-04", "description": "Well I guess I'm a tourist because never have I stood outside a place and waited in line for a seat in the middle of a Monday afternoon, ever. But since we were in DUMBO for a meeting, we figured why not give this place a go since it supposedly had THE BEST PIZZA IN AWWWLL OF BROOKLYN.\n\nWas it THE BEST in all caps? Hmmm, don't know about that, but what I can tell you is, it was DAMN GOOD PIZZA FOR ANY CITY and I definitely liked it. We did a split job with one side housing pep, saus, mush and the other side was all mush. Both were delicious and I liked that the crust is light enough to fold your slice into a pizza taco and that it is slightly burned on the crust. \n\nIt tastes more like gourmet pizza than a neighborhood spot, but either way it definitely hit the spot and I loved it!", "author": "Stephy S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-12-17", "description": "\"Let me get a pizza, pinwheels, a knish, a rueben, lasagna, chicken parm, linguine with clams, roast beef, a hero with the works, a bagel with cream cheese, a fish filet, a turkey burger with blue cheese, and a Fiji water.\"\n\n\"Yo, what do we look like, a supermarket? \nWe ain't got no Fiji water.\"", "author": "Jon S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2008-08-11", "description": "One of my top 5 favorite New York pizzerias. The Lasagna Pizza, when it's available, is fantastic. So are the plain and pepperoni. But here's the main reason I love Front Street Pizza: PINWHEELS!!!\n\nPinwheels are pizza dough baked into a round shape with a glob of cheese and toppings in the center. Front Street bakes them with sausage, pepperoni and eggplant parmesan. And they are only $1.50 a piece!!\n\nI agree with an earlier review that sandwiches and deli prices are unreasonable. You have to be careful what extras you ask for if you care about the price. The daily hot food though is a good deal.\n\nNot completely worth going out of the way for (unless I get a craving for pinwheels) but when I'm in Dumbo this is a top choice for lunch.", "author": "Daniel L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-09-01", "description": "Call me weird, but I'm a big fan of \"shitty pizza\".  By that, I mean the sloppy, greasy pizza that you won't find in a brick oven.  I'd say it's my guilty pleasure.  Plain cheese pizza is the true test of any pizza place, as there's nothing to hide the flavor of the pizza itself, and this place has a great cheese pizza.  It's not my favorite in Brooklyn, but it's running second for sure.  Every time I go visit my boyfriend at work, I have to try not to eat here, in order to preserve the health of my heart.  But I would, if it weren't for that, because it's that good.  \n\nOh, the chocolate cake they sell sometimes there is also amazing.", "author": "Salem S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-04", "description": "So you've heard of the Soup Nazi... well at Front Street Pizza you can find the Sauce Nazi. I've never been to a pizzeria/ italian eatery in NY, scratch that, in the WORLD, that is soo stingy about their marinara sauce.\n\nStory time - I work around the corner and like to goto FSP for lunch from time to time. Sometimes I'll get the bruschetta slice or buffalo slice (both really good), and sometimes I'll get the spinach roll. Now in a normal place, a dry pizza roll would come with a side of sauce so you can enjoy properly, but NO. They make you pay 35 cents for a side of sauce the size of a pill cup. Ya know, I wouldn't make such a big deal over the money if they actually gave you a decent portion, but they give you enough to cover 2 bites of roll! To continue my story, one day I went in and ordered a spinach roll AND a side of sauce, only this time, the side of marinara I received looked even smaller than usual! So I asked the guy, don't you usually give more sauce? At that point, he showed me a different, more familiar cup and said, \"nope, but let's do a test and see.\" So he poured the sauce from cup A to cup B (and when I say poured, I mean dripped, since we're talkin about baby portions here), and says \"looks about the same to me.\" Mocking me!! They're the ones who should be mocked. Turns out, their was about 1cm of space left from the top of the cup after all, and he says, \"you know what, I'll fill it up for ya, how bout that?\" WOWW what a guy.\n\nIn conclusion, FSP has good food. I do like their pizza and other specialty items, but they are the biggest sauce divas ever! For the price of their food, they should be a little more generous when it comes to the little things. And for that, and for mocking me when I just want to enjoy my food, they get 3 stars.", "author": "Bradley D."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Front Street Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LVHDWuYoUFq5OpVt9Xj6JQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188753700"}