{"aggregateRating": {"reviewCount": 303, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2011-06-28", "description": "21 Shrimp with fries for $6.95 was just that.  Oh, they don't clean the intestine lines of the shrimp all that well either.  It'd be safer if you didn't go picking and looking for those types of things.  \n\nYes crispy, but greasy.\nYes fairly cheap, but that's what food you paid for.", "author": "Jaclyn C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "Love this place the food is good, service is amazing. Large place to bring groups. Thank you for a wonderful day after walking across the Brooklyn Bridge.", "author": "Maureen R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-19", "description": "Overall very good service and food. The coffee topped everything off in the end. Very good. Definitely a must-go place when in the NYC area!", "author": "Deniz W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "This is my go to place to get a quick meal when I am in Dumbo for work.  No frills pizzeria with many selections.  Great salad options as well. I usually go for one of the specialty pizza slices, such as taco pizza or salad pizza.  Sort of the place that locals will go to, but given the location there is a good mix of tourists as well.", "author": "Paul K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-05", "description": "The pizza here is amazing! The staff is pretty cool and always eager to help. Unfortunately, the owners son, which somehow has become the \"manager\" is pretty rude. I ordered  a large  pie 2 slices pepperoni, two slices pepperoni and sausage. The menu states 14.95 for the pie, 3.00 for half the pie \"extra toppings\". But I was charge .75 for each slice for the sausage. There is no limits placed on the menu or any other advertisement. When I spoke with the manger he was condescending and argumentative. Being a loyal customer I expected a little respect. BEWARE, customer service is crap here.", "author": "Dee M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-01-18", "description": "I will begin this review by saying I still love this spot! Their food is excellent and FRESH! The crust is thin and crispy and the sauce is amazing! But I am not happy that their prices have increased so drastically AND that the prices listed on the wall are wrong. Caveat emptor...let the buyer beware! \n\nWe ordered 3 slices of pizza (2 plain, 1 sausage), one stuffed shells, one spaghetti and meatballs and two salads. $40 later we couldn't afford to buy water!!!!! Ijk but you catch my drift? I had sticker shock. The salads alone were $5 each!!!!!!!!!!!!!!!!!!!! For a 7\" plate of salad that pretty much was the same as the bag from BJ's and a few errant olives I felt cheated.com.  In the photos you'll see half of my $5 salad. No meat, no cheese, not romaine, arugula, or other fancy leaf no extras whatsoever....just iceberg lettuce out of a bag, 3 slices of cut up cucumber, 2 sliced cherry (not grape, yes there is a difference) tomatoes and dressing. \n\nI probably won't be back, but my tummy at least is in heaven for now. I take solace in the fact that I didn't have breakfast and lunch so technically my meal was $12/per lol!!!!", "author": "Yasmin B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-08", "description": "The absolute best pizza in Brooklyn. Authentic taste at a reasonable price. The entire Leonardi family got this absolutely right.", "author": "Mitchell R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "I go to this place when i want to feel that old New York pizza vibe. This is no non sense straight up good pizza with an incredibly extensive menu. The staff here is awesome and always diligent and attentive.", "author": "Anthony P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-05", "description": "I'm a really big fan of this place. The pizza is good and so are the sandwiches... where else can you find that? A place that has a good deli and pizza joint in one? I'll answer my own question- it's rare! Slices are big and toppings are generous. The vodka sauce pie is delicious. \n\nThey also have this ridiculously awesome lunch special where you pick 2 or 3 items for like $8- great value and awesome food. \n\nYou can't go wrong with their deli sandwiches- esp at those prices. These are real deli sandwiches- not 3 slices of cold cuts- at least 1/2 lb per roll and way more when you get a hero.\n\nThey have 1/2 orders of mozz sticks, poppers and tenders- which is amazing.\n\nWhy only 4 stars? They can be inconsistent- sometimes i've never been happier and others, i'm just satisfied... rarely disappointed. Id say ive ordered from here about 25 times.", "author": "Bethany W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-03", "description": "I'm a big fan of Front Street Pizza in DUMBO. Good pizza, pasta and other fast Italian food. Competent staff. Recommended!!", "author": "Jeff S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-05", "description": "Perfect New York pizza. Tons of options. Great place to come while touring dumbo and grab a quick bite. My three stars are not that it isn't great pizza. It's just that it's exactly what it should be and at a great price with all the surrounding expensive choices. Stand out : white pizza and also the vodka sauce.", "author": "K C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-12", "description": "Yummy deli. The gluten free pizza was amazing!! the sauce was so good. The staff was so nice  and they were super accommodating. My mom had a hoagie and she said she loved it. great place to stop in when in DUMBO.", "author": "Cecilia R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "I travel all the way from long island city to my favorite pizza spot on earth! its so worth it. their pizza is amazing!!!!! my favorite is the buffalo chicken with blue cheese. I have to pinch my self and make sure im not dreaming, its that good. you never had to wait long, no matter the time of day. the line moves quickly. service is amazing, they are very accommodating and friendly I saw this annoying lady change her order twice and the counter guy was so nice about it. Ive tried all the fancy pizza places in manhattan and Chicago and nothing comes close to Front street pizza. Damn it guys now i have to take the train all the way to dumbo, after writing this review. got me craving your pizza like im pregnant or some thing.", "author": "Liam H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-12", "description": "Another packed place for a slice of pizza or whole pie.  There were other things on the menu.  We had 2 cheese slices.  The portion size is a good and the slice was tasty.  Not too greasy and with an additional shake of oregano and cheese, it was perfect.  Customers and locals continued to pour into the place.  Certainly a good sign.  Slices are $2.50 which is a bargain.", "author": "HoyMay P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-09", "description": "I would not recommend this establishment.  After I paid $30 for a pizza, front street delivered the pizza to someone that wasn't me (without checking to see if the person receiving the pizza was me or even calling the number I provided) and after I asked them about the incident, they blamed their mistake on me and refused to issue a refund.", "author": "M B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-19", "description": "If you are taking a walk in DUMBO, then a pit stop at Front Street Pizza is a must. The place has a true Newyork vibe to it with pizza slices displayed right in front. One can either go for their flavors or choose their own toppings. I tried their garlic knots which were not only utterly delicious but were dirt cheap too (6 knots in 1.5$). They also have a large seating area and have a range of pastas, soups and anti-pasti to choose from!", "author": "Neha S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-30", "description": "great pizza by the slice s little removed from the Dumbo and BB madness after walking over from Manhattan. No line to be seated and open tables available at 5 on beautiful Sunday afternoon.  Its not because food and service were sub-par, its not right under the bridges.", "author": "Greg R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-08-19", "description": "Love this place. Owners are probably some of the nicest people on this planet. Yummy pizza with the friendliest service. Exactly what a local should be!", "author": "London K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-06-08", "description": "Love this place, its not one of those pretentious pizza places where it takes forever to get some food.  This place is actually pretty big for a pizza parlor, and has good old fashioned ny style pizza.  Sometimes you just want old reliable, and this is your perfect local neighborhood pizza place.  Reasonably priced as well.", "author": "Rakesh M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-23", "description": "Used to be a place I came to as a kid. With my family and friends. Now the staff is full of perverted sleazy disrespectful dirtbags that sit there catcalling and making you and your partner uncomfortable as you eat and as you walk out. Never coming here again! No respect for women. Lost a handful of old customers.", "author": "Karla P."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Front Street Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LVHDWuYoUFq5OpVt9Xj6JQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188753700"}