{"aggregateRating": {"reviewCount": 303, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-09", "description": "Always tasty one of my fav places, friendly professional staff handles the vast crowd of tourist well. Lots of options including gluten free", "author": "Sherry C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-23", "description": "Front Street pizza seems like a local hotspot for\nPizza and Calzone. It reminded me a bit of Seattle's Pike Place Market. Lots of action behind the counter and boisterous cooks and waitstaff. \n\nWe had been looking for solace out of the rain in DUMBO (area under Brooklyn Bridge). This place was warm, friendly and seemed to have a lot of locals as well as us tourists in need of a good slice. \n\nI was struck as we entered with the memorial etching for 9/11 victims. There also lots of clippings and photographs on the walls so I sense this place has quite the following and is family-run. \n\nWe had a couple slices (huge and fresh) and a salad and a calzone (big as a baby's head). Delicious! Even though it was crowded even at 2 pm, we got a table quickly. \n\nI'd come back here if in the area.", "author": "Courtney S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-11-11", "description": "Stumbled upon this place looking for some good pizza and came out disappointed. They have a lot of variety from pizzas, pasta, sandwiches, burgers, wine, and much more but I would say it's more quantity over quality at this place. It's a casual order and seat yourself joint. I got the vegetarian pizza ($4 slice) and some garlic knots ($1.50 for 6) and 50 cents extra for marinara sauce so not a bad deal for the cost. Downside is they dont warm it up nicely so my pizza and garlic knots were halfway warm making it taste not so great. I'm guessing the pizza might have tasted better if you reheat it at home. The tables are not very clean but they do have quite a lot of space for you to sit down at.", "author": "Ammara T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-05", "description": "Staying in Lower Manhattan, I decided to spend a day in Brooklyn. I walked across the Brooklyn Bridge straight to DUMBO. The walk probably took me about 30-40 minutes. As written in the title, this shop is located right on the corner of Front Street. It was either here or Grimaldi's and honestly, I just wanted a cheap meal knowing that others would be expensive. Upon entering the shop, there is a large glass window honoring those fallen on 9/11. When you walk past the window, there is a glass display of several pizzas and deli meats. The deli is further towards the back. I ordered two slices of pepperoni pizza which were huge and more than enough with a can of Pepsi; it all came to $9.75. The pizza was really good, just super greasy. This is cheap for NYC so I can't complain too much.", "author": "Cayla T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-28", "description": "So happy to find this place. Good food, good service. Family restaurant. No huge waits. Reasonably priced.  Pizza was really, really tasty. Staff was nice. Quick with our food and got everything right. It was a great place to eat dinner with the family, while sight seeing in Brooklyn.", "author": "Jacqui S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "Great neighborhood pizza joint. Pizza is good - way above average. Fun employees, and don't forget to try the (cheap) garlic knots! I have never tried other (non-pizza) menu items, but other food and salads are available. Nice bathrooms and plenty of seating.", "author": "Bruce G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-12-19", "description": "Hands down best eggplant parm hero I've had in a very long time... even though I live in NYC. Great eggplant is hard to find! I'm an eggplant fiend and Front St. Pizza knows how to do it right. I'm in love! Will be back soon.", "author": "Molly B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-07", "description": "Order from where there's a sign that says \"Order Here\". Then pay the other guy. Simple enough.\n\nI had a plain slice and a pepperoni. Both were pretty sizable and reasonably priced. I like that they don't gouge you, even though they totally 100% could with the lack of other slice options in the area.\n\nPlain slice was good. Pepperoni was just okay. Something about the pepperoni just didn't pop. Maybe too thinly sliced, or not in the oven long enough. Didn't really add anything to the slice.\n\nI'll probably be coming back.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-06", "description": "Very good tasting food! I ordered the Greek salad and veggie lasagna. The only issue I had was that they delivered the wrong lasagna, but I called them and they corrected the issue right away and were very apologetic. I would definitely order from them again and definitely recommend this place!", "author": "Cyn C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-05", "description": "This place is easily one of my favorite restaurants in New York. The atmosphere is laid back, you can sit wherever, the prices aren't too bad, and the food tastes amazing. We got pizza which was very good, although it was a little big, we still handled it well. The service is also very good, the employees are nice and respectful. Overall an amazing \u0026 underrated place.", "author": "Haley G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-05", "description": "Full confession - I debated giving 3 stars, but went with 4 so as to not contribute to the demise of local pizza by the slice places. And plus the pizza isn't bad, it's more average. It is still a huge step up from those chemical filled dollar slice places. And the place is spacious and comfortable. All in all, a decent quick bite or cheap lunch,  but not a destination unto itself", "author": "Omar H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-13", "description": "Front Street Pizza\nNY BK Dumbo\n2pm Wednesday 7th September 2016\nFour Stars\n\nI came in a couple slices. I decided on a slice of pepperoni and a slice of mushroom for a total of $6.5. The service was great. The people were friendly and made sure you could get in and out. The crust was crispy a bit of chew without much flour taste. The sauce was light and fresh. The cheese was also light and golden brown. The pepperoni were sparse with a bit of grease. The mushrooms were the traditional plump with water. \n\nMike has a great singing voice.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-12-02", "description": "Ordered Hawaiian Pizza and Sausage pizza. Didn't have to much after ordering. Loses with toppings, these pizzas have amazing pizza sauce and and cheese. \nFinding a place to sit is a challenge. \nOverall, a good place.", "author": "Ishan S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-08", "description": "This place was shockingly the bomb. I got their buffilo chicken pizza. A slice of heaven if you will. Definitely will complete your new york experience.", "author": "Heidi G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-01", "description": "They have gluten free crust! Although the oven isn't solely a Gf oven - so probably not safe for celiac. But the gf crust was super good- thin but not burnt!  The only downside is it took forever... my friends got their pizza and finished it before I ever got mine.", "author": "Katlin V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-25", "description": "Garlic knots garlic knots garlic knots!!!!! OK these are amazing  and inexpensive! Get them you won't regret  it!! The food here is great! I mean come on look at the pic!!!", "author": "Rick B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-29", "description": "I ordered calamari and chicken tenders. I knew I had to wait but after a while I asked. I was told 3-5 minutes. I think my order was forgotten bec. I asked again after 30min of standing and still wasn't done. A few employees checked and were apologetic. Staff was nice. I would've given more stars bec the kids liked the food but that wait was just too long.", "author": "Ti V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-17", "description": "Pretty good, a bit overpriced for allegedly cheap pizza, but I'm going to chalk it up to \"NYC is expensive\" and just leave it at that.\n\nGot a slice of the cheese $3 (although on the menu it said $2.75, not sure why they charged more), vodka margherita, and chicken and broccoli. I think the vodka margherita was supposed to be spicy, but there was no spicy sensation at all. The chicken and broccoli was a bit bland and heavy. The cheese was cheese, pretty decent.\n\nTried the pizza for the novelty of \"Brooklyn pizza\". Honestly there was nothing too special about it. The crust stayed crunchy and the cheese was gooey. Good pizza is good pizza.", "author": "Judy Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-01", "description": "Avoid the crowds and the high prices!  This is very good food with counter service.  We had pasta with red clam sauce, chicken ziti with garlic and broccoli, the garlic knots, two slices of margarita pizza, and 2 glasses of wine for $34.  Very good food at a very good price!!!  Their lunch prices are even less!  Located about a block from the water where you get your beautiful views (no views from this corner street restaurant though.", "author": "B J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-19", "description": "Genuine New York style pizza SO good $2.75 a slice! Bring cash because $5 card minimum", "author": "Sierra W."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Front Street Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LVHDWuYoUFq5OpVt9Xj6JQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188753700"}