{"aggregateRating": {"reviewCount": 303, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-06", "description": "4.5 \nA great NYC pizza place - exactly what a pizza place should be! Gets busy during lunchtime, but lines moves fast enough \u0026 the staff is quick \u0026 pretty awesome (speaking of tuning in to FIFA World Cup past summer!!!) \n\nI'm a pepperoni fan, so their pies are perfect. Not a 5 because I'm spoiled, and I like gourmet snacks along with my pizza, so I end up stopping by Foragers (which has gourmet snacks, but also is not a 5, as it is pretty expensive).", "author": "Anna G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-17", "description": "meh. bland and tasteless. Just go to Forno Rosso on Gold Street. the pizza there will be much better.", "author": "Nick S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-07-20", "description": "All the way from Cali.   Got off the ferry and ventured around instead of your \"local tourist\" pizza place and came upon Front Street.  BEST PIZZA IN BROOKLYN!!! If I ever come back to NY this will definitely be a stop on our list.", "author": "Denise M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-24", "description": "Great pizza and really delicious chicken parm heros at fair prices. Definitely one of the better places to eat in this God forsaken DUMBO area, where good food at reasonable prices are hard to come by.\n\nThe only down side is they get packed so finding a table at peak lunch time hours is a pain.", "author": "Eddie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-04", "description": "This place is an angry madhouse during lunch time, and nobody knows where to stand or order.\n\nI got the calzone once, and it was pretty cheesy and not bad. But fighting angry mobs at lunch makes the food less appealing.", "author": "Mike C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-17", "description": "I really liked their (thin crust) pie. I grew up around Italians and I think the best pizza is sparingly topped. Front Street Pizza serves solid, honest pizza slices that are what traditional pizza pies are all about.\n\nWhen I ate here, the Yankees were playing the World Series (yes it has been a while). But the ambiance in the place as the Yankees played on the TVs in the dining room, while drinking beer and eating great NY pizza made the whole experience much, much better.", "author": "Saul R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-01", "description": "I order from them each time I have a large crew to feed. Good delivery times, fresh, really good tasting pizza. \n\nWhenever I go there to have a salad and or couple of slices, I always come out happy with service and food quality. \n\nA bit procey,  but hey, Dumbo is not cheap.", "author": "Alex A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-09", "description": "I placed an order with Front Street Pizza that was expected to take 30 minutes to deliver. I called after an hour and again after an hour and a half. Each time they told me they \"were really busy so hadn't started my order but would probably start in 30 minutes\". I cancelled my order. The pizza here is fine, but. I different than what you can get in any neighborhood pizza place. I ordered because they're near my office and I thought it would be convenient. Given how wrong that assumption was, I won't plan to order from them again as they clearly didn't value my business.", "author": "Michael L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-28", "description": "Good pizza! Friendly service. A reliable place that turns out tasty pizza with specialty toppings. Not gourmet. But an easy comfort food place", "author": "Leslie M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-01", "description": "Tried to stop in here to order a gyro before leaving for the airport. It smelled amazing so I wanted to grab a gyro which I thought could be made fast?! I was only the second person in line and 20 min later they still has not put in my order. I finally told them I had to leave and didn't even get a chance to eat lunch.", "author": "Alicia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-10", "description": "Nothing fancy but consistently solid food.  Back in the olden times when I was gluten free I would order their gf pizza, which was pretty good.  Now that gluten is back in my life I can say their regular pizza, also pretty damn good.  I wish they were open later but am always excited when they pop up on my grub hub.", "author": "Sarah M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-01", "description": "Great spot to grab a slice in DUMBO.  Stopped by with a group of 6 after the DUMBO art festival and we had no problem finding a seat even though it was pretty busy.  The turnover is pretty quick and the bus boy is totally on top of turning the tables quickly. \n\nWe grabbed a large plain pie which was pretty good. I also appreciate the staff giving us a cup of milk for a 5 year old in our party even though it technically wasn't on the menu.  \n\nIf you're looking for a pizza spot that's great for groups and your in the DUMBO area, you can't go wrong with Front Street Pizza!", "author": "Ed L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-06", "description": "Found this spot by chance after coming from an event in Dumbo, and I was so happy I stopped in! \n\nFirst, the staff is very amicable, almost family-like:) It actually has a very Italian vibe. \n\nNext, the pizza was too yummy- exactly what you would expect from Brooklyn pizza. \n\nThe space and seating area was nice too- we sat by the booth toward the back which was really quiet and pleasant. \n\nHighly recommend if you're in the area!", "author": "Antonia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-24", "description": "Great lunch option in DUMBO (dinner too if you're working late or live in the area) and aside from Grimaldi's really one of the only places in the area serving pizza.\n\nService is quick and efficient and once they recognize you pretty friendly (last time I came here they threw in a free slice of chocolate cake for me and my 2 coworkers).\n\nThe menu is expansive; lots of pizza by the slice options but in addition you can select from a range of Italian standards (penne, baked ziti, chicken parm, heros) as well as gyros and other hot sandwiches. Pizza by the slice is great with a garlicky and well spiced sauce and generous amounts of toppings. The garlic knots are pretty delicious though as other Yelpers mentioned they can be a little stingy about their sauce portion sizes.\n\nThey take credit card if you spend over $7 which is easy with two slices and a soda. Come by for their dinner specials too - giant portions of pasta for $6-$9.", "author": "Jenn E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-01-26", "description": "It's a great place. Pizza is very yummy! Prices are medium, I wish they were lower but still it's not as expensive as their neighbor, Grimaldi.\nThe staff is great. Very nice people, they make you feel like home :) When you stop by and they remember what you usually order, it makes you feel special in a way, doesn't it? And it's not that easy, I eat there like once a month maybe.", "author": "Thorgal A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-28", "description": "Great pizza!! And amazing staff. Is coming from Los Angeles and trying to try some of the best food of New York. This is certainly a stop to make!! New York baby I love it!!!", "author": "Dj N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-07-07", "description": "By far the best slice you can find within walking distance of Cadman Plaza/Brooklyn Heights. Great prices with plenty of cheese and sauce portioned over chewy on the inside/crispy on the outside crust make this place worthwhile.\n\nPepperoni, sausage, and cheese are all good options here. But be warned, literally every other option I've tried at Front Street Pizza has disappointed me (different toppings, pasta, salad, lemonade, etc.) with the exception of their garlic knots.\n\nStick with the basic slice though and you'll be alright.", "author": "Alexander T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-06-01", "description": "I was walking from the F Train at York to Brooklyn Bridge Park, and I was suddenly so hungry that I found myself acting like an asshole. Yes, more so than usual. I needed something to eat immediately in order to masquerade as a reasonable human being again, and Front Street seemed like the quickest option.\n\nI asked the guy behind the counter which was the freshest pie, and he gave me a sausage slice. It did indeed look like it came out of the oven more recently than the host of other options, but I wouldn't call it fresh. I would call it edible. \n\nThat is, except for the sausage, which was downright nasty. Every time I bit down on a piece of it, there was a distinct snap. Not the juicy, crisp snap of a good hot dog. More like the cringe-worthy snap of uncooked gristle. \n\nMuch like several other DUMBO establishments, Front Street Pizza is basically operating a monopoly; when you have no other options in the area, the quality sometimes suffers. I might get a slice here again, but not with sausage.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-11", "description": "This was a kind of terrifying experience due to being in amongst the lunch time rush but none the less probably the best pizza slice I have ever eaten. Ever. Best enjoyed while sauntering up to the Brooklyn Bridge so your eyeballs get a piece of the sensory pleasure action too.", "author": "Rebecca H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-02-18", "description": "Excellent old-school pizza shop within short distance of the Brooklyn Bridge, the ambience is classic diner and the food is very good. The pizza is traditional NY-good, and the stuffed rolls are great too. The waiting area is moderately confusing and the staff seemed quite grumpy, but I do suggest it for anyone who wants to experience good Italian fast food.", "author": "Robert R."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Front Street Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LVHDWuYoUFq5OpVt9Xj6JQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188753700"}