{"aggregateRating": {"reviewCount": 303, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-05", "description": "Clean, quick, fresh, not too pricey :) The atmosphere was friendly and casual, with plenty of seating, so it's a good place to stop if your feet are tired after walking across the Brooklyn Bridge!\n\nTasted amazing too! Pizza in Brooklyn was on my bucketlist and I'm glad I came here to check it off. :)", "author": "Alice Irene H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-12-29", "description": "I had the margarita, meat lovers and white ricotta and spinach and the margarita was definitely the best. Really liked the tomato sauce!\n\nWe originally wanted to go to Juliana's but was not down to wait 1+ hour for pizza so we came here instead . \n\nPizza is okay nothing too special about it. It's not very crispy at all and is very soft.", "author": "Stephanie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-07", "description": "Best pizza place ever .When i worked in dumbo  i use to to go eat there .And these guys just make the best pizza on earth", "author": "Edward W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-12", "description": "Excellent pizza! It was a little too oily but there was a lot of taste. The slices were very big and there were lots of toppings. There were many options and it was a great stop before getting on the Brooklyn Bridge to walk over to manhattan. It was a little expensive but no more than the average pizza in slices in the city.", "author": "Chloé S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "Amazing pizza, delicious hot cocoa, great prices and the people that work there are very nice. \nThis place is a gem and it's really close to Brooklyn bridge park .", "author": "Geraldine Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-22", "description": "I don't get to Brooklyn to often, however, when I do, I always go to Front Street Pizza.  It's very close to the Brooklyn Bridge, a place I love to visit.\n\nFront Street has excellent food, their pizza is absolutely amazing.  Coming from CT where there are many great pizza establishments in New a Haven, this place is as good.\n\nThe workers are very friendly, a very clean place, and an enjoyable experience.\n\nI plan to visit Brooklyn when the weather gets a bit warmer, and, you can bet I'll be visiting Front Street Pizza once again.\n\nIf you like pizza and other Italian foods, you have to visit this place, you won't be sorry.", "author": "Tom P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-30", "description": "Consistent and yummy. My fav is their garlic knots. Pizza is decent. I have gotten chicken Caesar spinach wraps also. Although I usually prefer places that make their own caesar. Their fried chicken sandwiches are good. \n\nToday I had their fried fish, mash potatoes with corn. Good. Just wasn't crazy about the mash. Obviously out of a box but it had that school lunch, flavor but still able to eat.", "author": "Natasha E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-16", "description": "Love this spot; good pizza, quick turnaround and space to sit! Great prices too! I'll definitely be back the next time I'm in dumbo and wanting an authentic NY slice.", "author": "Karen M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-14", "description": "Solid, cheesy, pineapple slice (a little light on the pineapple topping) - but generally, the slice was a classically great slice. Also got a chicken roll, which was just average sized but made up for size with great doughi-ness and flavor. \n\nMore stars for a great location and casual dining area with tons of seating and good NYC people watching windows.", "author": "Vincent R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-30", "description": "Amazing food !!!! amazing service - fast and friendly, with great sense of humor , met the owner - very cool dude .  Very affordable great food . Pizza is amazing ! Great location too !", "author": "Sthefani G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-15", "description": "If you want anything other than pizza, go somewhere else. Even then, the pizza ain't great. But it's edible so, for that, 2 stars.\n\nToday I wanted to see what else they had to offer. I ordered a turkey sandwich, listed at $6, and the cashier asked me what I would like on the sandwich. I ordered mayo, cheese, lettuce. Somehow, the total came up to almost $9. When I asked why, he said the prices on the menu are literally for JUST turkey on bread. All of the \"sandwiches\" on the \"sandwich\" menu are priced for just meat on bread. I then walked to the other side and got pizza instead.\n\nNot only will I not be paying $9 for a basic turkey sandwich, but I also don't respect an establishment with a deceiving menu. \n\nI hope there's another pizza spot nearby.", "author": "Qori B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-17", "description": "I ordered pizza delivery here for the first time. I ordered a regular cheese pie and asked if they would add rocchetta cheese which they did. Delivery ETA was 40-50 minutes but they delivered in less than a half hour after ordering. The pizza is huge and very tasty. Was very happy with my order. A little pricy but comparable to other pizza in the area.", "author": "Chelsea D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-24", "description": "Great pizza Place in New York.  I loved that you could order pizza by the slice.  There were two other places in Brooklyn that I wanted to try but had over an hour wait even for take out.  I had the Margarita Pizza.  Could have used a little more fresh Mozzarella but otherwise it has an awesome crunchy crust and the sauce was really good.  I would recommend!", "author": "Genia S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-15", "description": "Great food, great bunch of guys, the owners take pride in what they do.  I highly recommend this place if you happen to be in the area.  See Sal he will not disappoint.", "author": "Thomas A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-18", "description": "On a trip to DUMBO I was advised by my buddy to get a slice at Front Street Pizza.\n\nAs I biked passed Julia's and Grimaldi's near the water, lines were long and still, prices high and slices unobtainable at the latter. \n\nThis pizzeria was busy at 1:30pm with friendly macho old New York guys straight from a cartoon - a large older Irish man and a young buff handsome Italian squeezing out of his T shirt.   They gave me just enough time to decide, promptly took my order then ushered me through the que like a fun football drill.  \n\nMy slice was topped with sliced sausage, a nice buttery crust, balanced with sauce and cheese.  I'd say a good New York slice prototype.  The kind you imagine as a kid.  \n\nThe break down \nPizza - 3 stars - no frills basic - good\nAtmosphere - 4, simple old New York \nService - 5 old New York - fun, whimsical and a little punchy", "author": "Scott L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-09", "description": "This is definitely a spot what you get is what you pay for. Me and my friend walked in ready to order and there wasn't a clear place to place our order so we kind of was flustered prior to ordering. The tables weren't really cleaned off often (I had to request it to be cleaned) there was a leak in the ceiling. My buffalo pizza was okay no where near real good. The staff were really nice and they had a good selection of what we could watch.", "author": "Reid M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-09", "description": "Meh. $2.75 for a plain slice and $4.30 for a Hawaiian slice. Both were greasy in a boring way. Especially notable was how the Hawaiian lacked toppings. Lots of space to sit inside but very touristy and really not worth it. The enthusiastic reviews are presumably from tourists that don't know better.", "author": "Fatima L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-21", "description": "Best pizza we had on our weekend trip to NYC! Plain cheese and buffalo chicken was amazing!! And the service exceptional, very friendly!", "author": "Heather F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-06-30", "description": "Julianna's and Grimaldi's had a long wait line, so we opted for Front Street.  They provide large containers of garlic powder, salt, Italian seasoning, and salt.  Why?  You will use them on this pizza.  \nMy wife ordered the gluten free pizza but it was inedible.  Fell apart on the plate.\nSad", "author": "David N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-24", "description": "My boyfriend and I come here every time we can make it to Brooklyn. The location is close to the Brooklyn bride, subway station and the famous street with the amazing view of the Manhattan bridge. \nThe food is amazing! The pizza slices are big and very tasty and so are their other meals. I personally love the garlic bread and the Greek salad. \nThere's a lot of seating areas and the staff is very very friendly. The prices are very reasonable since the food is so good.", "author": "Denisha B."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Front Street Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LVHDWuYoUFq5OpVt9Xj6JQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188753700"}