{"aggregateRating": {"reviewCount": 303, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-15", "description": "WHOA! WOW! OMG!  \n\nSomehow this place is situated in more of a business area vs. residential(up N coming) YET IT FEELS SO HOME-Y HERE AND YOU IMMEDIATELY FEEL LIKE A LOCAL.  You're welcomed.  Even tourists(which there's a lot of because of the amazing view just outside -- Manhattan Bridge).\n\nThis pizza is GREAT: the cheese, the crust, the ingredients are all quality.  Let's not forget how fresh it was too. \n* Buffalo chicken slice: tasty, LOADED with chicken which was cooked well(not overcooked nor dry), the crust was thin with perfect color and golden, also LOADED with delicious quality cheese. \n*White slice: fresh, not salty, right balance, very refreshing + also LOADED with cheese .  Spices incorporated at right ratios here haha. \n\nStaff: fast paced AND FRIENDLY. \n\nA LOT of seating inside, tables + stools.  Decent selection of drinks around back + lots of different slices, calzones and rolls up front. \n\nCOME BY IF:\nyou're in the neighborhood.\nwant a nice view and nice pizza+\nyou're at work and want lunch\n\n*I wouldn't go out my way to come and eat here but when I'm near, IM HERE!", "author": "Kadeem C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-15", "description": "Front Street Pizza can not be on a better location! Their chicken buffalo with ceasar dressing is amazing. Their customer service is great. Every slice is fresh. Not only do they sell pizza but other meals too. Such as, sandwiches, salads and pastas. If you're in Dumbo, you should definitely stop at Front.", "author": "Francisco C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-25", "description": "The pizza here is awesome! True Brooklyn style pizza with the perfect crunch to the crust. You can add any toppings to their pizzas for just .50 per ingredient. \nThe vibe in this place also has that authentic New York City feel, which I think adds to the flair. \nWe got it to go and took it over to the riverfront to enjoy the view.", "author": "Jonny R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-20", "description": "Strolled in for a slice while wandering Dumbo, the lines at julianas and Grimaldis were crazy. Its your classic brooklyn pizzeria, that was fast and swift to get the food. However, to be honest the gramma's slice was over-cooked and a bit dry. Maybe I'd give them another crack with a different slice, but I wasn't overly impressed.", "author": "Alan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-16", "description": "While picking up an awesome West Elm Craigslist find in the neighborhood, my hubby and I picked up dinner from this pizza place. They have a great variety of pizza slices to choose from, and pasta, sandwiches, even dessert. I ordered a slice of white pizza while my husband got a slice of plain \u0026 pepperoni. The pizzeria has a lot of seating so why not enjoy your hot slice inside? The guys seemed pretty nice and friendly.\n\nOverall a good place to get a hot slice of pizza or a late bite to eat. Afterwards you can explore DUMBO and possibly spot Lonely Boy.", "author": "Kimberly C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-21", "description": "Yumilicious fun! Incredible food, fast and friendly service, and the ability to SIT DOWN and eat :)", "author": "Maggie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "On the weekend, this neighborhood gets packed with people and it's hard to find a restaurant for quick eats. Walking to the F train, we stumbled upon this place and it was the perfect place to a quick bite. \n\nThe pizza is thin crusted with the perfect crunch. The slices are larger than regular slices. You can't go wrong with a margherita slice (although it only came with mozzarella and tomato - no basil).", "author": "Carol H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-11", "description": "Not a bad place to grab a slice and a beer.  We got a whole Grandma pie and a few beers, sodas, and jalapeno poppers between the 5 of us and I think everything came out to like $50, so it was pretty reasonably priced for the area.  The pizza wasn't the best I've had, but it made for decent eating while watching the Phils play the Mets on the TV.  The location is prime, so you can pop in here before you walk over for some touristy shots of the Manhattan bridge at sunset.  Maybe steer clear of the beer on tap...tasted like the lines could use a cleaning.", "author": "Colin K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-11", "description": "Perhaps the strangest thing is that I come here most frequently just to buy their dough. It's $4 for one doughey dough ball and it's a blast to make pizza in the oven at home with some fresh mozz and basil. \nFront street is the cheapest place on the block and the most accessible. Julianas and the other pizza places charge a lot more for a pie and they do not offer by the slice purchases. Front street also delivers which is a huge plus in the Dumbo neighborhood. \nMy favorite slices are by far their fresh tomato and garlic and their buffalo chicken. Their plain slice can lack flavor, but when I need something quick the guys at Front St are always moving!", "author": "Julianne B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-04", "description": "It's definitely not the best New York style pizza I have tried. There are better pizza places around. I got the Buffalo chicken pizza with barely any buffalo sauce flavor in it. It was tasteless.\nTwo star for the staff who were really friendly and even divided the pizza as per our request.", "author": "Simran A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-06", "description": "The absolute worst pizzeria I have ever ordered from. I ordered two slices and a chicken roll. The penne vodka slice had no penne on it. The regular slice was burnt. The chicken roll was grilled chicken with American cheese on a bun roll. Pathetic.", "author": "Nick L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-07-04", "description": "They have good pizza and heroes but when I called in to pick up a few slices on the 4th, the owner took my order, asked for my name and when I told him I was walking up to the restaurant in a few minutes, he told me no, wait in line and banged the phone in my ear. Mind you, he knew how long the line was in his establishment, I didn't. I was on my way. Dude didn't even explain anything. Just said \"No, get in line\" and hung up. I guess he thought I wouldn't get there so soon. Who cares, these dirt balls won't get any more of my local money nor will they receive business from my friends. All of these pizza shops in the area. Please! Also, #14 (grilled chicken sandwich with turkey bacon and onion), is dry. Add some spicy mayo or something to it.", "author": "Amira A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-08", "description": "Walked in for a slice and a Yoo-hoo (just like childhood). Excellent NY pizza and a very friendly staff. John is a cool cat. He made us feel welcomed like we were from the old neighborhood. I highly recommend this place if you want excellent pizza and good old fashioned Brooklyn hospitality.", "author": "Dave P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-09", "description": "Great pizza. Little wait. Wish would cook little longer. Ask for crispy for they are quick to take out of oven. Great dough. Great pizza. Chill atmosphere. Good for groups and kids.", "author": "Anne N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-30", "description": "Pizza! NY Pizza!\n\nThis is my goto spot and always will be.\n\nFor the price, the food is great. They offer delivery but eating in always tastes the best. the crust is not the thick and has a slight crunch. The sauce is on spot and the cheese/toppings...mmmm. The slices are really big too. You won't need more food after this place. They got a variety of other things to try if you get tired of pizza, but I never got tired of their pizza. \n\nAll their regular/specialty pizzas are delicious. It always hits the spot when I have a pizza craving. The only thing I wouldn't recommend is their double sided, thick, seasame something pizza. I forgot what it was called. My roommates love it and they always get it, but whenever i eat it I get a sick feeling from the overload of grease and cheese.\n\nAnyways, if you can't spend a fortune on Juliana's pizza, go here! It's not perfect for you will not be disappointed.", "author": "Jonathan E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-01", "description": "OK, doesn't look like much but this place is the bomb diggity. their crust is very very good -- just the perfect texture and amount of chewiness \n\nevery once in a while i forget why NYC pizza is so good or take it for granted but front street just reminded me why it's best in the world!", "author": "Pete S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-18", "description": "Authentic NYC pizza\n\nHad two pies delivered to my apartment right around the corner. One pepperoni one plain.  The delivery guy arrived on bike fairly quickly baring a cheesy slab of top quality New York deliciousness.\n\nReally reasonable prices and a fairly large retail store which is nice of you want to grab a slice and hang out for alittle.", "author": "Ryan R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-06", "description": "After fighting traffic trying to get into Brooklyn Front Street Pizza was a welcomed relief!\n\nThis is simply real pizza at a great, non-tourist, price.\n\nThe thin crust pizza was amazing!  And the large pizza is HUGE!  Sauce was great, perfect amount of cheese and the toppings were good quality.  I loved the sausage pizza (length cut sausage).\n\nAtmosphere was very friendly and warm.  Staff was great, friendly, but also intent on their job.  You seat yourself and grab your own food once its ready.  \n\nHighly recommend.  Can't wait to return the next time I visit the are this summer.", "author": "Douglass W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-29", "description": "Love this place. Owners are probably some of the nicest people on this planet. Yummy pizza with the friendliest service. Exactly what a local should be!", "author": "Food M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-05-19", "description": "I've been coming to this restaurant for many years now, as they are one of the best Italian Pizza shops in the area and i have ordered many different items off of the menu in the past years. It is a great shop with awesome people. Everyone at the store is very polite and helpful, and you can tell they really love their business. The place is a decent size, it has many tables, as well as a Men and Women's bathroom.\n\nAll the ingredients they tend to use seem to be nice a fresh, and everything is always nice and clean. In the past 2 years it has gotten a lot more busy which has led to the workers frequently getting the orders \"slightly\" incorrect, but it's not that big of a deal, i can see how crazy it gets when the crowds roll in. I don't know how these guys do it honestly, but they handle everything very well.\n\nOne food on the menu that i'd like to point out are the garlic knots, they used to be fantastic, but i feel like they've gotten a little bit drier with a bit less garlic than they used to have. It's just my opinion though! I still get them often when i order, because they're still enjoyable.\n\nI would like to recommend that you guys try their cold cut sandwiches, as well as hot sandwiches, they are truly delicious, ALL OF THEM. And of course the pizza, duh! Don't just go for the regular slice though, try the ones with the toppings, like the buffalo chicken, or the hawaiian slice, those are my favorite! The pizza here has some great cheese and crust. The crust is not too crunchy so it won't break your jaw like other pizza places do, and the pizza slices are pretty big. Also try their pastas, they are also very delicious. I've tried nearly every pasta on the menu and loved them all!\n\nI remember them also having cannolis at some point, just one time i was there. Those were delicious and i wish they would make them a regular item :)", "author": "Jonathan M."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Front Street Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LVHDWuYoUFq5OpVt9Xj6JQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188753700"}