{"aggregateRating": {"reviewCount": 303, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2010-08-18", "description": "This is one of the local places to the office and is a great lunch option.  The guys who work there are really awesome and you get a good deal for your money.\n\nThis gets a star off because the pizza is not terribly incredible.  It's pretty average to be honest and I never really get it.  If you want pizza, take the walk up to Fascati's.  However, their other food is great for a pizza place.  I really dig the #7 sandwich, their ham and cheese pinwheels, and their fried food.   \n\nPizza: 2.5 stars\nEverything else: 4.5  (it's a pizza place, so rate it for what it is)", "author": "Peter K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-08-31", "description": "We picked up a round pie to take for a nearby picnic on Sunday afternoon ... worth every penny!  Ten-minute wait for crispy crust and tasty tops!  The service was quick and friendly, and made me want to stop in again for more picnic provisions.", "author": "Zenide R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2009-02-25", "description": "I'm inclined to give it 3 stars but there were 2 features that really bothered me about my visit. \n\n1. All of the tables were dirty. There were plenty of workers, behind the long counter, to clean the tables... it would have taken 5 minutes, but apparently at 2:30 pm... they felt it wasn't their job to give their customers a clean eating area. \n\n2. Their pizza wasn't that special. Many of their pies looked like pizza I could get from the suburbs of the Midwest. Given the neighborhood of transplants who moved there from the Midwest, perhaps it's not surprising. I ordered the white pizza because it was one of the very few pizzas that looked like it had fresh mozzarella. \n\nSome positive notes: \n\n1. They were quick; \n2. They were polite; \n3. They have a lot of lunch choices; \n4. There were a lot of tables; and \n5. It's easy to find. \n\nI would like to return and see if the dirtiness of the eating area was an aberration or normal. \n\nI don't want to give them a negative review, but come on... you get one chance to make a good first impression.", "author": "lynn n."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-03-10", "description": "The best pizza in the world. I do not overstate this. THE BEST pizza ever. And yeah, I'm from Chicago. They may revoke my resident status for saying this, but deep dish is not pizza, it's casserole. Blech.\n\nFront Street Pizza has mastered the perfect balance of crust, sauce and cheese. I long for it almost daily now that I'm back home.\n\nOn my last trip to NYC I walked the Brooklyn Bridge roundtrip four times for this pizza. I pretty much ate nothing else. If I could get them to FedEx me a pie I would order them weekly. The staff is great and exactly what you'd expect in a NY pizza place. How they keep track of what everyone in the place orders is beyond me because there's really no line.\n\nI miss you Front Street Pizza. Won't you please deliver to a hungry girl in Chicago?", "author": "Kristina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-03-27", "description": "This is the place to eat. The food is delicious, the have a large selection for breakfast, did I say delicious!!! They change their menu daily, their delivery is pretty fast  and it's verrrry cheap, BOY, what can we ask for more NY? The ambiance and service are excellent, did I mention the pizza, well ok, I'm not a big pizza girl, but O MY, you have got to try them. P,S. You never know when you'll meet a star there. \nThe owners are the best, always in a good mood, (I guess business is great)lol, I love to go there to watch world cup soccer when Italy or Brazil is on, very fun... (not a big USA fan, but hey! I'll support ya 2)\nDaiana Noel", "author": "Daiana N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-12-05", "description": "I LOVE this place!!!!\n\nBest fast slice in the city. It's no Grimaldi's, granted, but how often are you willing to wait 20 minutes outside to get a really good pie. \n\nThere's no better place for lunch in DUMBO. Sausage and peppers, eggplant parm, chicken parm, meatball sandwiches - it's all great. \n\nAnd you couldn't ask for a better team behind the counter. The brothers are awesome.\n\nPlain slice PLEASE!", "author": "Eric J. R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2008-11-30", "description": "On my way to St. Ann's Warehouse to see Black Watch for matinee show, we need to eat something before and found this place near the theatre. It's a deli-pizza place.  They not only have pizza. They also offer some sandwiches too. \n\nWhole-wheat pizza with mozzarella with tomato sauce looked fresh so we ordered it. It had some good amount of garlic in tomato sauce and the crust was crunchy out side and inside was kind of mushy. It was good as a healthy pizza.", "author": "Taiyo O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-23", "description": "Pretty great pizza! Not the worst I've ever had. Really convenient location in DUMBO, I recommend the mozzarella sticks!", "author": "Julia L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-08", "description": "Reliable pizza spot.\nCheap, good house wine.  \nCozy.  Nice staff.", "author": "Smog R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-03", "description": "I eat at Front Street pretty often, but not because I love the food. Mostly, it's accessible and cheap. Aside from Grimaldi's (who have massive lines and don't sell by the slice), it's the only pizza in the neighborhood, and I have to say it's kind of mediocre. Completely on par with every other random pizza place in the city. The guys behind the counter are really friendly and get your order to you quickly.\n\nI've had the chicken parmesan a few times, which is pretty decent, and their grill is alright (I've become a fan of the BLT). Mostly, if you're hungry in the neighborhood and can't figure out what exactly you want, head to Front Street and surely you'll find something you won't hate.\n\nBut would I whole-heartedly recommend it? Not really.", "author": "Davis C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2008-09-24", "description": "This is the ugly step child of Brooklyn Pizza. I know my review is skewed with Grimaldi's being three blocks away. However I don't think anyone there actually tries to make this place better. When I order something I get the feeling like I am inconvenience. I will admit the drinks from the fridge are always cold, so that is a positive. \n\nIf the wait at Grimaldi's is to long and you have a strange medical condition that forces you to eat pizza then take your chances with Front Street. If not wait till you travel anywhere else in New York.", "author": "Mike G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-12-01", "description": "Amazing food, fast delivery! Food tastes amazing every time! Definitely recommend this place to anyone.", "author": "Jojo D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-09", "description": "Last week I was working a temp job in the area and came in here for lunch. This place is packed during lunch time with all the tourists and people who work in the Dumbo area. The service was really good even if it seems a bit overwhelming at first (or maybe it's just my impression of NYC, being from SoCal and all). I ordered a regular cheese slice and it was good, they do have a variety of choices along with sandwiches and pastas I believe. The seating area is very spacious for a pizza shop in NY so that's a plus!", "author": "Anna C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-10", "description": "This place has exactly what I want in New York pizza - quick service and delicious large slices. Atmosphere is very casual with a few TV around. Location isn't great, but worth it if you're in the neighborhood.", "author": "Reid G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-10-15", "description": "So Grimaldi's was an hr wait and we were bout to keel over from hunger and from walking into Brooklyn..\n\nFront Street Pizza jus popped in front of us..  The pizza was allrite.. Da wife actually though the pizza tasted as good as Lombardi's (we're getting a divorce!! haha)  \n\nA typical grill that serves almost everything... It was fun watching the fights that almost happened between the counter folks and the customers..", "author": "Carlo M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-09-03", "description": "I've spent plenty of lunchtimes grabbing a couple of slices here, and it's consistently good pizza. Despite the mayhem of the lunch rush, I always manage to get out of there in 10 minutes or so.\n\nWhen I used to work nighttimes, they would put The Simpsons on the tv, and we'd all watch during our break. Good stuff.", "author": "Erik C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-01-26", "description": "Front street has the BEST gluten free items!!! They not only offer gluten free pizza (which is okay for gluten free, Mozzarelli's  on 23rd is my favorite) but they make awesome gluten free lasagne!!!! It is soo good that I have a hard time ordering other items.  The grilled cheese is fantastic!!!  Just normal grilled cheese the way I remember it to be except they do it gluten free!!! They also don't charge a million dollars for their gluten free items which I am so thankful for.  The guys that work there are the nicest people \u0026 sooo helpful.  I can't say enough about this place...I love them!! Thank you front street pizza!!!!!", "author": "Jennifer N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-13", "description": "When I was in NYC for new year's, aside from the celebrations, I had one mission and one mission only- walk the Brooklyn Bridge, explore nearby Brooklyn, find a good slice of pizza, and walk back to Manhattan. From my point of view, nothing else mattered that day. \n\nAfter exploring the possibilities, I settled on Front Street. Oh, what a good choice. A five dollar bill gets you a HUGE, TASTY, WEDGE (not a slice, a WEDGE) of pizza, a gigantic cup of soda, and some change. Yes, when I mean a WEDGE, I mean a slice so huge, folding it is not an option, it's a necessity, and not doing so probably violates some rule of pizza decency that gets you banned from ever eating pizza again. I was also impressed by their range of other offerings, all reasonably priced, and appetizing to look at.\n\nThe interior was fairly neat, with a couple of TVs to entertain me during my time there. Here's how I know I made a good choice- while I was eating, a fire truck pulled up, and several firemen in full gear, still wet, came in and ordered wedges to go.\n\nOk, I might get criticized for being from Chicago reviewing NYC pizza, but consider this. I tried three places in NYC during my time there, and of the three, only this one warrants a glowing review. Their pizza was huge, tasty, and cheap. You can bet I will stop here the next time I come back. For those of you counting calories, well you have your choice of bridges to walk them off.\n\nTo sum it up: It was worth the walk getting there, now I have to go back.", "author": "roberto a."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-01-24", "description": "They're quick, they take credit cards and their pizza pretty good for the amount of money you are paying but by Brooklyn standards, this isn't really a pizza to write home about. The main draw here is really the variety, making it an ideal place to go for lunch if you are feeling more for a sandwich as opposed to Pizza.\n\nHere I ordered a Buffalo Chicken and a Pepperoni Slice. The Buffalo Chicken one was a bit of a let down, I couldn't really taste much of the buffalo sauce (because they mixed it with the tomato) and the combination of the blue cheese dressing over mozzarella felt a bit awkward for me. I prefer my Buffalo chicken slices to focus more on the pieces of chicken, the blue cheese and the sauce.\n\nLikewise, the peperoni slice while a bit greasy, pretty much met all of my expectations. I'd want the crust to be a bit more crispy but for $2.50, I can't complain too much. It had enough pieces of pepperoni on it to make up for this.\n\nThe tables on the inside were a bit dirty, while I understand that it is a pizza place and not fine dining, it is a bit off-putting. Overall this is the kind of place that celebrates it's modesty but is hardly worth going out of your way to get.", "author": "Chris C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-06-05", "description": "Ordering here is daunting because the posted menus and order taking are a mess.\nStick with the pizza.  Their sandwiches may look good, but for some reason is quite bland and greasy.  Your typical \"friendly\" Bwooklyn-Italian service.", "author": "Dina B."}], "servesCuisine": "Pizza", "priceRange": "Under $10", "name": "Front Street Pizza", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "80 Front St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/LVHDWuYoUFq5OpVt9Xj6JQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188753700"}