{"aggregateRating": {"reviewCount": 20, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-05-28", "description": "This was a two star review. I like the idea of a good Frite. I had my first frites in Belgium at this little cart that was open from 8 pm to 3 am. Heaven! I also love a good truffle sauce/oil and with the price tag thought I'd get plenty. But all I got was the salt, salt, salt. A touch of truffle essence, but not enough to make it worth it. There were plenty of fries, but after a few minutes, I was a bit tired of the salt. The amount of fries (enough for a meal/and very well cooked) is the reason for the third star.\n\nAdditionally, my husband ordered a cheesesteak. He said it was OK. Still three stars!", "author": "Jacqueline F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-04-12", "description": "Dig the name and logo. Not crazy about the fries. They're not bad, just not as good as expected. It also probably has to do with my experience at the DeKalb Market Hall location--$8 and 20 minutes I'll never get back.\n\nMy order was forgotten about. My companion and I were standing near the counter waiting for my name to be called out while everyone behind the counter seemed to be high-fiving each other for slam-dunking all their orders, except mine. After trying to get someone's attention (they all flocked to the back for some reason), finally one of the staff noticed and asked what I was waiting on and also asked for my name. Apparently my name was prematurely checked off because someone had a similar name to mine. They all joked \"what are the odds?\" but to myself I thought \"what are the odds you check off two names and only one order and don't notice someone still standing around, foodless.\" They offered to upsize from small to large. \n\nDespite the gesture, I still would've been fine with the normal size if they didn't have to go through the trouble of trying to rectify the mistake, which it was too late for anyway as the two of us didn't even finish the Dutch Fries. We wanted to relive the beloved European-esque curry ketchup/onion/mayo combo but the flavors and textures fell short of expectations. \n\nP.S. They also failed to tag me in a repost of my photo on their social media.", "author": "Christel L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-05-30", "description": "Came here on a Thursday during lunch hour find it pretty dull no line just one worker on her phone. I have only every had truffle fries from their food stall in smorgasbord which are always amazing. So I was expecting the same, the fries came out paler than what I usually get from them and covered in bunch of dry parmesean that won't even melt on top of hot fries. Anyways I gave it a go and they hardly tasted anything like truffle or fries to say the least super disappointed by the quality. The fries were $8 and really not worth it. So if you want to try their fries get them at the fair!", "author": "Saba N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-22", "description": "The cheesesteak sandwich here is always good. Wish the still had included fries for $15.00. I love the garlic aioli sauce!", "author": "Jovi H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-16", "description": "Seriously \"0\" stars. I went there today at lunch (12:15) and ordered their \"lunch special\" and was told 20 minutes then he was charging me for my drink I pointed out to him it CLEARLY says \" drink included \" then he started arguing with me. Then he starts throwing out his tiny little chest like he wants to literally FIGHT me. Wants me to step outside and fight. Pushing the counter and making a scene. I'm not backing down from this little punk so the girl starts in. WORST Customer Service Ever. \nThis punk needs to be at the UNEMPLOYMENT office. Hope the owner watches the video.", "author": "Ron K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-08", "description": "I've only had the fries and a couple dips but, they are all pretty good.​​ You can tell the \"steak fries\" are hand cut and always come out crispy on the outside and fluffy on the inside. They curly fries also have a good amount of fluffy potato in the middle vs. just being fried to death. Lemon garlic aioli is my current go-to​ dipping sauce, they have 8 total though.\n\nThe food is cooked to order so it's​ always hot and fresh, will take a few moments so factor that in. They have a happy hour special on the couple beers and wine they have, good for a quick afternoon drink.", "author": "Scott B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-09", "description": "THERE WAS A ROCK IN MY FRIES. Do not eat here. How disgusting!!!! Potatoes come from the ground cool but they do not belong in a $10 basket of fries!!!!! I wish I could get 0 stars. I'm going to throw up.", "author": "Grace F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-14", "description": "Should have read the reviews before wasting nearly $8.00 on trash fries! They had clearly been sitting for a while- room temperature and unevenly cooked. Some were soggy others were crispy like a potato chip. The so-called lemon garlic aioli tasted neither of lemon or garlic. It didn't even taste a like a true aioli just mayo with maybe some garlic powder mixed in. \n\nI asked for an additional sauce and the guy behind the counter told me it was $1.00. That's fine whatever but he said twice like I was going run off with their crappy sauce without paying. Never again! Save your money and go elsewhere. The taco pace is really good!!", "author": "Star P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-06-08", "description": "Ordered a large, someone ordered a small... they got the same amount of fries I did. They're container was overflowing while mine was under served.... so I paid $6 more for no reason. Thanks\n\nUpdate: customer service from company is good, but the employees are just rude and tried to make me feel like I was committing some sort of fraud by showing them a voucher. The company gave me a voucher to make up for the experience for a large fries and the employee was very hesitant. I told them to just call the company or the Bedford location to ask. They ended up giving me a small fries.", "author": "Jonathan M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-24", "description": "the truffle fries and chicken cheesesteak are so damn good  !!!  A must try, you won't regret it !", "author": "China M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-27", "description": "Customer service was aaahhh but I'm not here to judge. I ordered the seasoned curly fries, not seasoned. The avocado herb dip tasted rank. Disappointed. I really wanted to like this. Won't be going back. With those prices, the food should be worth your time and it's not. And they didn't have the waffle fries which is what I really wanted. Also curly fries weren't that curly. May have had 5 mini curls", "author": "Joat F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-02", "description": "I've gotten fries here twice- the first was good, handcut fries with their truffle seasoning and their lemon aoli dip. They were perfectly crispy on the outside and tender on the inside. \nI came back again last week expecting the same delicious fries I got the first time, but it seems there's been a few changes. What first had me concerned was the number of fry varieties they now offer- waffle and curly fries usually aren't made on premises, and it had me concerned as I ordered the standard variety. Again I got the truffle fries, but this time was offered two sauces. The aoli didn't taste like it did the last time, and the curry ketchup was really a miss for me, tasting overwhelmingly of just raw curry spice. \nA friend and I ordered together this time (paying/ordering separately) and after they took her order, I had to call back the staff to let them know I also wanted to order. There were also a few other customers who passed and looked intrigued while I was waiting to order, but were turned off by how off the job the staff seemed to be. \nSo I sat down with these fries, hoping for a repeat of my first great taste here. Nope. They're now either skipping steps or straight up using premade fries (my suspicion based on all the other new fry offerings.) They were kind of overall mushy and not well salted, even with the truffle seasoning. So, between the lack of service and the decline in quality, I don't think this is a place in dekalb market I'll visit for a third time.", "author": "April H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-27", "description": "Fries, yay!! I used to live in Williamsburg and on my trips to Smorgasburg would always seek out Home Frite so I could get my fry fix. Was so excited to stumble on them at dekalb market. The fries are as good as I remember, crisp on the outside, potato goodness on the inside. I have my favorite dipping sauces, the garlic aioli and they make an out of this world creamy jalapeño dip that's got a legit kick to it. This is the perfect snack and pretty filling if you get the big size. The fact that I can walk over to the beer place with my fries and get a pint while I snack, mmmm, guilty pleasure!", "author": "Audrey S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-11-30", "description": "I got the original fries and chipotle ranch for dipping. Fries were very fresh and hot out of the fryer. To me, it was on the expensive side, I don't think French fries should cost $7, but they were pretty tasty. It was a lot to eat, and we split between 2 people and had leftovers. The dipping sauce was really good though!", "author": "Bub S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-01-14", "description": "I work nearby and frequent the Dekalb Market often. They offer a lunch special, $10 for a cheesesteak or loaded fries. The time I actually got my hands on one, I enjoyed it. Unfortunately, I've only had their cheese steaks once, not because I don't like them, but, they always have an excuse! On 3 separate occasions, I've gotten to the register and have been told that there are already 4 cheese steaks on the grill and they can't take anymore. The last two times I've been there, the grill was totally empty and I was told the grill is off till the manager gets back from his break. What?! Are we running a business in the busy Dekalb market and you can't accommodate the lunch crowd for the lunch special you offered? What's the point? I decided this was the last time, I can find the same or better food elsewhere, I'm good. They can keep the overpriced fries and lackluster service. At this rate, they won't be there long anyway.", "author": "CHEVON M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-17", "description": "Not much to say but the Curly truffle fries /w buttermilk ranch dipping sauce is like having sex while you're tipsy... amazinggggg! Service was nice and they had a lil white cutie on the fries", "author": "Lipstick L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-28", "description": "My absolute favorite place in Dekalb Market Hall whenever I go shopping at Trader Joe's I always stop here for truffle fries.  I never had a bad experience with the staff, i actually would say they are doing a really good job bringing smile to peoples faces! they always give free samples, the fries are thick cut skin on DELICIOUS SAUCES they make and portions are huge. I recommend them to people who visit as the best fries in NYC. Its a must stop!", "author": "i V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-23", "description": "I only went here because I was on a hunt for some good Truffle Fries and this place disappointed me to the MAXXX. The fries are cut way too big for truffle and the actual truffle doesn't even stick to the fries. I was literally scraping the seasonings from the bottom of the carton with my finger nails and putting it in my mouth after first inserting a French fry in my mouth (pause). I really wanted to enjoy this because the location is super cute but I just didn't.", "author": "Kittie B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-09-23", "description": "Giving three stars for the fries and dipping sauce; they are delicious!  The service is horrible...horrible.  I was there on September 9th.  The young lady at the register was very involved in her phone.  So involved that she couldn't even put it down to take my order.  She barely spoke to me, and when it was time for me to pay, she turned the screen around for me to swipe my card.  I wasn't aware this place was self-service.  After that, she turned the screen back around, all the while never looking up from her phone or speaking to me.  I almost walked away before paying, because I couldn't believe how rude this young woman was being.  The young man that cooked the fries, handed them to me, and also had nothing to say.  Maybe they were both having a bad day, or maybe they don't care.  No need for me to return.", "author": "C C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-08", "description": "Philly cheesesteak was 80% bread and mayonnaise. First three bites were 100% bread and mayo... next bite was a tiny piece of meat covered in mayo and some sort of bbq sauce. There was not another bite because I sadly had to throw the entire thing out. If you are weirdly craving an expensive mayo-only sandwich, this is the perfect place for you!", "author": "T O."}], "servesCuisine": "Cheesesteaks", "priceRange": null, "name": "Home Frite", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "445 Albee Sq  W", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media2.fl.yelpcdn.com/bphoto/PYa5CaKESpKI84GtSoMrkQ/ls.jpg", "@type": "Restaurant", "telephone": ""}