{"aggregateRating": {"reviewCount": 19, "@type": "AggregateRating", "ratingValue": 3.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-21", "description": "My food came very fast. The order was still very hot \u0026 I'm really happy the delivery man came upstairs. I ordered shrimp with garlic sauce and scallop with mixed vegetables. Sooooooo good \u0026 there's a lot of food", "author": "Ewa Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-26", "description": "Surprisingly really good for delivery!!\n\nOrdered the chicken lo mien lunch special with hot and sour soup, along with steamed dumplings.\n\nDumplings were actually house made!! I lot of dumplings that I have had from surrounding Asian places are from a pre made and frozen bag. Lo mien was really decent too, lots of shredded chicken, and full flavored. Hot and sour was a bit lacking in flavor, but had so much mushroom, water chestnut and bamboo in it. \n\nSeamless delivers again!", "author": "Maggie C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-27", "description": "It's a darn shame that as often as I have ordered from this location, I am finally posting a review. \n\nGreat food. Quick service. Only a few feet from work.\n\nMy favorite dishes are potatoes and bananas lol. In other words, I typically order plantains or French fries with chicken wings, smothered in ketchup and BBQ sauce. I occasionally order white rice with broccoli in garlic sauce or Fried whiting fish with French fries. I do hate that it costs more to eat healthy so I have to opt out of the brown rice. Either way, I'm always left thoroughly satisfied without a major hole in my wallet.\n\nI usually order through GrubHub to avoid the \"cash only\" policy. Despite the available ATM, I just don't want to be bothered with additional fees. I do not know how other Asian restaurants operate, but the listed menu price DOES NOT include tax. Be prepared to add an extra dollar or two to your balance.", "author": "Kristia B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "When it's time to slow down from a busy day and you realize you haven't eaten all day, what do you do?! Obviously you eat, duh! I was starving and didn't want to go far. \"Yang Restaurant\" was close by, so I went there to get Chinese. Going in its small, really small. They have seating, which is great, but there nothing much after that. The only thing they have going for them is the woman behind the counter. This lady was friendly and so well spoken. She joked with me, asked questions and promoted the food they sell. That's what you need out of a employee good job. But service is only half the battle, how's the food? I needed to find out and really I didn't have much of a choice, this place was within walking distance. By walking distance I mean like seconds away. It was slow there, except for the phone ringing, so my meal came quick. The cheese wontons had a shape that I have never seen before, they also had a taste as well. That taste was great to be exact! I loved the texture of the wonton and they fill it with more then enough cheese and crab meat. Next cup was the main course. Would it be worth it for me? The answer to the question is yes, it was delicious. The outside was crunchy with the inside being soft and meaty. I loved it a lot. The only two negatives are the dipping sauce was watery for the Wontons, and the broccoli had a funny taste to them. All said and done I will be back. I can't wait to try the scallop and shrimp combo. Also I can't wait to have another friendly conversation with the lady behind the counter.", "author": "Evan C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-03-11", "description": "I stopped by here after some shopping to get some bubble tea that I had been craving. Going off of the lady at the counter's recommendation, I decided to go ahead and choose a new flavor instead of what I know I usually like. Upon tasting and not enjoying the surprising texture (red bean actually had beans at the bottom - not tapioca bubbles- and wasn't just the flavor) I gently asked if it would be possible to change my order and she absolutely refused, stating she would \"just be throwing it away\" and one doesn't get to change their order after getting it. Now, while I understand that this would be a loss on their end, in the spirit of customer service and wanting repeat business, I'm accustomed to a manager making an exception. After all, if your meal isn't to your liking at any other restaurant (even smaller places), they will generally replace it without hesitation to ensure your experience is a pleasant one. I've worked in food service in the past and it's unfortunately part of doing business. \n\nAside from that, cleanliness and general appearance wasn't great: lots of trash blocking one side of the entrance, boxes stacked up and being stored on one of the unused counters, every staff member had headphones in (maybe receiving takeout orders, maybe not, who knows..). The gyoza dumplings we ordered were average and took a LONG time to come out. The dipping sauce didn't even fill half the small container it was in. \n\nI will not be returning: even for a serious bubble tea craving, due to their lack of customer service.", "author": "Claudia L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-18", "description": "UPDATE: changing my 5 stars to 3 stars! Recently they have started asking customers to come down stairs to the lobby to get their food! Um...no! I ordered delivery to my door not the damn lobby. No tip!!!!! \n\nfood is on point! this is my go to spot for delivery when I don't feel like cooking. my husband \u0026 I love to order their hot \u0026 spicy broccoli with garlic sauce! they deliver the food super fast too!", "author": "DashE O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-05-22", "description": "Really bad experience here. The first time I ordered I thought I'd found my General Tso's spot. It was great. the second time it was completely inedible. People say that a lot on Yelp and I'm not one to complain but it was really, really bad. I can power through bad take out but this was awful. Couldn't do it. \n\nSo I call and the lady was sympathetic. She offered to send me new sauce first but why? You want to send me new General Tsos sauce to put on top of my now cold chicken? Gross. So I said I ate the rest of my order and would she mind just giving me a new one next time. She said, \"yes no problem, next one is on the house\" since they admittedly used bad sauce and this one was inedible.\n\n2 weeks later I call to redeem my order and she says would I mind ordering something else? I kinda get it, I give her the benefit of the doubt and order an egg roll and a coke with it so they can make something off of it. And I wait and then she calls back 20 minutes later and says I have to order $10 worth of food on top of my General Tsos. Ok, so you won't be replacing my bad order and making it right unless I order more food? I don't need two lunches! So stupid. I should have just gotten my money back. Don't order from here.", "author": "Rand M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-02", "description": "Combo meals reasonable priced.no complaint about the food. Good spot for your take out lunch", "author": "Bob S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-17", "description": "Delicious seafood lunch combo, and very nice service.", "author": "Arthur D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-29", "description": "I always order delivery from here and the delivery men are super rude. They always yell over the phone they've arrived and multiple times they gave me attitude for not tipping enough. Weeks ago the young man cussed at me about the tips, today he did the same thing again, \"you f*****g make me wait too long, sh*t, f**k. I have to come out my building because he refuses to come inside, and I took 5 minutes which I don't think is a long time. What kind of customer service is this? I have never gotten treatment like this before. Each time the food gets sloppier, I gave them chances. HORRIBLE and DISGUSTING please take your hard earned money somewhere else.", "author": "Kaori S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-01-05", "description": "I really wanted to give them four stars. So many times, these little restaurants get bad reviews because ppl want 5 star quality for 2 star prices. Unfortunately, I can't give them more than 2 stars due to what happened when I was there.\n\nPro tips: \n\nThey were previously No. 1 Chinese on Fulton\n\nThey don't take credit cards\n\nI don't believe the delivery people come to your door.\n\nThe story: I was there this past weekend. First time at the new location. Regarding delivery: she was telling callers that they'd need to meet the guy downstairs, so FYI. I think that's their policy. I don't agree with that, but maybe you won't mind.\n\nSo last Saturday, I stood there and waited about 15 minutes with my card out. Once the food was ready, they told me they didn't take cards. This is irritating in general, but since I get charged a fee of $2.50 by Chase when I use ATM's, this is costly and could've been avoided at any point by telling me while I was standing there with my debit card out. They directed me to their ATM, which charges $2. So my $20 order, cost me $24.50. Part of customer service is communicating. I know a lot these little restaurants don't take cards but I saw no sign and again, I was standing there with my card out.\n\nEdited to add: Hua Long is back open. I suggest going there instead.", "author": "Lanie C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-21", "description": "Worst Bubble tea I have ever experienced. I ordered a Thai tea with boba. The tea itself was flavorless, and the tapioca was HARD. I'm talking rock solid. It was the most unpleasant beverage I've ever experienced. I would not go there again.", "author": "Seth D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-02-13", "description": "Worst chinese food I've ever had. To make matters worse they over charge for subpar food, rip off. My instinct told me to stay away but considering the neighborhood I figured I'd give it a shot. Big mistake and waster of $12. Definitely won't be ordering from here again.", "author": "Jemima E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-10-11", "description": "My experience was that it was not good or bad = 2.5 Stars. Flavor ok but the small dinner portion is filling but less than what I would expect from a Chinese Restaurant.", "author": "David B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-15", "description": "In a neighborhood truly lacking any Asian cuisine, this place is.....okay. Not amazing. But it's good, cheap, reliable B/B+ food.", "author": "Josh A."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-11", "description": "Terrible food. Soggy, either no flavor or else overwhelmed by grease or sugar. Don't go here unless you're desperate.", "author": "Alex W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-25", "description": "I ordered some spicy shrimp and vegetable dish with brown rice; my wife got a tofu dish with brown rice. It wasn't too flavorful and there was way too much rice. For the leftovers, I had to cook some shrimp and more vegetables to add to the rice. They use MSG. I can't tell; my wife apparently has a sixth sense that detects MSG. This food was disappointing for this area with the wide variety of food not too far on Fulton, Lafayette, Flatbush, and Atlantic. At least we tried it and most likely won't be coming back again.", "author": "Eric R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-09-10", "description": "Sushi and Chinese all in one. Employees are very friendly. Healthy options available. Great vegetable lo mein!", "author": "Marissa H."}], "servesCuisine": "Asian Fusion", "priceRange": "Under $10", "name": "Yang No 1 Asian Restaurant", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "109 S Portland Ave", "postalCode": "11217", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/44ygeavwS0uIjxDy4NCkww/ls.jpg", "@type": "Restaurant", "telephone": "+17186259700"}