{"aggregateRating": {"reviewCount": 160, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-24", "description": "I am surprised that it took me a few months to make it over to this place. It's cheap, delicious and quick. The breakfast is super tasty. Loved the mashed up plaintains that I stole off my friend's plate. Very yummy fruit juice smoothies especially the passion fruit milkshake.\n\nI was surprised to find good Dominican in Cobble Hill but this place was yum! And uber cheapo!", "author": "Christine G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-12", "description": "Don't come here for a light, healthy meal.\nDon't come here looking for great service.\nDon't come here if you only eat organic meat/produce.\nDon't come here looking for food that's going to blow your mind with it's subtlety and presentation.\n\nCome here for absurdly large portions of hearty, satisfying comfort food. \nCome here for an official cubano.\nCome here when you need some solid arroz con pollo.\nCome here for maduros as good as you can get anywhere.\nCome here for awesome mofongo that can feed two, for $4.50.\nCome here for a breakfast of two eggs, toast, homefries and coffee for $4.\nCome here to pay as little as $15 for a huge, delicious dinner for two, AND have enough leftovers for another full meal.\n\nCome here for the best value in the area.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-11-29", "description": "I ordered the steak burrito and a side order of tortilla chips.  They were both good.  The quality of the ingredients were very fresh.   The tortilla could be much bigger to wrap around the burrito but all in all it was good.  Im from California so I know about American Mexican food.  The delivery was right on time too!", "author": "Christy R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "Absolutely love this place! So far I have tried the sancocho, cubano sandwhich, and mofongo de chicharron. Each dish was delicious amd tasted authentic (from a Dominican herself). The place has a nice atmosphere its not too big and not too small. The ladies that work there are also nice. Cant wait to go back.", "author": "Yomaira C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-02-24", "description": "They dont acknowledge you when you when you walk in RUDE ! But if it wasnt for there amazing lunch special $7 pernil with rice nd beans or there $12 porkchops i wouldnt stand to be unattended for 5mins ! Great food. Not so great customer service !", "author": "Nolisha C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-29", "description": "Ordered delivery from El Nuevo Cibao to take a break from a few other Cuban restaurants I have my in delivery rotation, and I was impressed.  The delivery arrived well within the quoted time frame and the Cuban sandwich was solid.  I also ordered their tres leches cake to make the delivery minimum, and although it wasn't homemade, it was delicious, so I will definitely be ordering that again as well.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-16", "description": "Some of the BEST Domincan Food. I brought my Dominican friend and she agreed! We ordered Pernil, and it was to die for! The salsa de ajo (garlic sauce) was fresh garlic and was soooooo good kept asking for more! The coffee's were amazing and the morir sonando (milk, orange juice, and sugar) was an amazing drink, had it for the first time there! Everything was delicious and the decor was awesome / industrial / creative use of coffee tins for lights!!! Will def go back! Maduros amazing, and the wait staff was nice, laid back ambience of hipster and dominicans. Didn't have to wait long for food either!\n\nPS-Only 2 small downsides...parking in this area is a problem! and 2 CASH ONLY!!!!  WHY???", "author": "Jaclyn M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-03", "description": "Cibao recently (about a year or so ago) renovated and went from your typical Dominican dive spot to a really nice restaurant more in line with many of the other Smith street spots. Their way of cooking and menu didn't change though. Most of their meals are $10-15 but I went during lunch  (until 4pm) where they have some great lunch specials. Some are served everyday and then there are specific ones for each day of the week. \n\nThe service wasn't that attentive and the communication barrier was a little bit of an issue but overall I had a good experience. Their lunch specials are available in small and large which their menu says ($5/$6). I wasn't asked what size I wanted and my bill was $7 (I guess that includes the 16.6% Brooklyn cool factor sales tax).\n\nI ordered the beef stew which was fantastic. The lunch specials come with one side and rice and beans aren't automatically included so that's what I chose for my side. While the portion of rice and beans was huge, the amount of beef, carrots, and potatoes was much more modest. If it wasn't for the rice and beans I'm not convinced I would have been that full. The beef was however was fork tender and very flavorful. Everything tasted great and I wouldn't hesitate to go back.", "author": "Matt E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-12-16", "description": "Not much for atmosphere but maybe that means more authenticity? Not really sure..\n\nCash Only!!\n\nDominicana Shrimp had tons of veggies ans huge shrimps...\n\nRice with Shrimp was well seaaoned, huge deveined shrimps, mildly spiced so left room for additional hot saucing as per taste\n\nEmpanadas looked amazing and the Cuban looked so so good too!\n\nHuge serving sizes..definitely shareable!\n\nSeems like the perfect place to munch post drinks - except they close at 11, so i guess they're trying to avoid becoming THAT kind of establishment", "author": "Donna K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-04-14", "description": "No idea how this place has 4 stars! Ordered grilled liver with salad. Got two small rock hard pieces of liver that lacked flavor with a regular salad for $12. Really! Never again!", "author": "Jeanette G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-11-29", "description": "I always come here because my boyfriend loves their half baked chicken with rice and beans. While the food here is the standard latino food, the service is below standard. My experience is that if you don't enter the restaurant speaking Spanish, it's a little difficult to get their attention to order. I stood at the bar waiting to order takeout for a while as they chatted with other patrons. Not taking orders. Just chatting.", "author": "Dominique E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-02", "description": "I drove by this place on Saturday and by the name i said i have to come to this place, so sunday night was the time to experience a delicious \" chicken / cheese Mofongo and grill chicken with vegetables, really good food good portion of food, place was really nice and the attention and service at this place was good, cold beers and good food will do again .. great experience. Craving Spanish always and I ended up finding another good place ...\n\ngreat place \nwill do again", "author": "Marcel M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-05", "description": "The vegetable mofongo is amazing! So far this is the only place I have found that makes it. The food is good and the portions are filling.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-01", "description": "I have been ordering from here since 1998 - The food is DELICIOUS and for those who don't know, it is DOMINICAN FOOD!!!  The only spot I order from when I feel like eating authentic Latino Caribbean food!!!", "author": "Enidm1273 .."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-26", "description": "Hungry for a great lunch,forget the sandwich shop,come here and order a Cubano,or perhaps a nice chimichurry (a Dominican style burger). Yums,real tasty deliciosogasmico. What's not to like. Stop by and give it a try. But must pay in cash,they don't take credit cards.", "author": "Carlos C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-06", "description": "The food was ok.When you are eating Spanish food you are expecting the food to be well seasoned, so I was slightly disappointed.They don't even acknowledge you when you come in the door. Good thing my friend speaks Spanish so he yelled out our orders from our seat lml I kid you not then the waitress came over", "author": "Shorell S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-03", "description": "The best Dominican food I've had in NYC. Sancocho was delicious and so were the Tostones, Carne frita, Bistec Sandwich and the Chicharrones de pollo. Yum!", "author": "Joel S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-25", "description": "Great Spanish Food Stylish Old World Decor A Little Slow In Service.\n\nLocated in the heart of Cobble Hill, my aunt and I met a few of my good friends here for lunch before we headed into the city to shop. We were seated immediately and severed water while we browsed over the menu. The establishment was nicely decorated- exposed brick walls, brown leather tufted booth seats, copper tin ceiling tiles and Spanish coffee tin canisters used as bar chandeliers. I felt right at home.\n\nThe menu offered a variety of options but I decided to order Monfongo con Pollo and Platanos Maduros. I hadn't had monfongo for so long and now that I was back home it was a must! I swear fui a Boricua en otra vdia! LOL Anyway, to my surprise the serving portion was large; enough for two people! It was very good! It was seasoned well enough that I could taste the balance of plantains, garlic and chicken. It wasn't greasy or dry. It was served separately with the broth which you'd normally pour over the monfongo but since I'm so particular, I pour as I go. The broth was very tasty not salty or bland and full of robust flavor from the seasoning blended in it. When the broth and the monfogo are married together there is an explosion of immensely divine flavors that makes you shake your shoulders in content. LOL The great thing about the monfongo here is you have options to have it stuffed with a combination of whatever you like whether its cheese, beef, pork, shrimp or veggies.\n\nThe Platanos Maduros was very good. I love maduros I can eat it with everything and anything. Its the sweetness and softness of the plantain that really turns it up for me especially when its ripe and fried in such a way that you get a bit of that naturally sticky sugary burnt part of the plantains mmmm! They done a wonderful job of preparing them in that way. They weren't overly fried and greasy.\n\nHonestly the service could have been better. It was pretty slow. I'm not sure if it was because the dishes are made to order and or they have a busy take-out service needless to say it could be much better. We must have waited for a good 15-20 minutes after we placed our order to get our food. Its not so bad if your not pressed for time and are in good company that it can be overlooked but not everyone has that kind of patience.", "author": "Rochelle P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-27", "description": "Mofongo con Pernil.  Garlicky, moist plaintains mashed up with some amazingly flavorful and tender pernil, all perfectly dressed with the accompanying sauce.  I kept putting my fork down and falling into a food coma haze but could not resist the shrinking mound of mofongo and of course finished the entire thing.  My fellow diner ordered the half chicken with a side of rice and beans and was appropriately ashamed of how little of it he was able to eat.  \n\nThere we are, belly-up and at the mercy of this delicious food that's bound to make us pop, and then the check arrives that reads $15.  Is this real life?  I really hope so.  \n\nYeah the service is pretty much non-existent and they only take cash. *Sigh* I can't hear your griping over the happy hum in my tummy.", "author": "Maeve C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-22", "description": "Stumbled upon this little Spanish jewel while hungry for brunch...Although completely unassuming from the outside and barely there decor inside, the friendly staff and amazing INEXPENSIVE meals make this place a diamond in the rough! \n\nI love a great surprise...this spot is certainly a must!", "author": "Sunshyne G."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "El Nuevo Cibao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "172 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/9116xkw9nAszN39nu11SSg/ls.jpg", "@type": "Restaurant", "telephone": "+17185961501"}