{"aggregateRating": {"reviewCount": 160, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-12", "description": "I love this place. El Nuevo Cibao provides huge delicious portions of food. The menu has a lot to choose from but so far, everything I've tried is delicious. \n\nI dine in and do takeout in Cibao. I love the free HOT bread when you dine it. It's smothered with butter. When I order any beef plate, the meat is always seasoned perfectly. The portions are huge... like I'm not joking. The meat is stacked high, and sides are so filling. My favorite side has to be the rice with pigeon peas! The rice is not mushy, or over/under cooked. It has flavor and not too salty. The pigeon peas are tender and pairs perfectly with my steak.\n\nIf you can wake up early enough for breakfast, you must try their mangu. I usually order Tres golpes. It's mashed plantains with salami, eggs, and Spanish sausage. It's so satisfying when the egg yolks breaks and runs into the mangu. It makes it extra rich and creamy. \n\nCibao also has passion fruit drink. It's sweet but refreshing. I love it when places provide fruit drinks.", "author": "Angela L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-31", "description": "This place is perfect. You get a lot of food for the price, food is delicious and the service is great.", "author": "C L S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-19", "description": "Great place for lunch specials. I've gotten a bunch of different stuff here and I have yet to be disappointed. Lunch special is about $7 and the portion is very generous. The beef stew is my favorite and is very flavorful and the meat is very good. The tripe broth was also one of my favorites from this place and I will be back for sure.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-05", "description": "My go-to when I'm craving Latin food. I've ordered breakfast and lunch from Cibao more times than I can count, and never been disappointed. The pastelitos are delicious and so cheap, and the lunch/dinner items are amazing as well. They deliver pretty quickly and never messed up an order of mine. Definitely recommend this place.", "author": "Amiee O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-01", "description": "Long wait, cold food. Food with metal.... not usually the case but seems to have been the last two times.", "author": "Jazz R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-30", "description": "Spent about $50 on takeout for a family of 3 which wasn't typical. The food was decent but sadly the passionfruit juice tasted like regular Welch's brand from the supermarket rather then freshly made passionfruit for the price charged.", "author": "Luis H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-19", "description": "Only came here for dessert as we had a craving for Tres Leches and Flan.  This cozy little restaurant serves Dominican style food.  Both desserts were a little too sweet for my taste, but my Yelp girls Alexis M., Kemi A., and Mei C. had no problems finishing them.\n\nThe staff was accommodating and friendly. The restaurant was empty when we arrived, but it looked like they had a lot of take out business. We saw and smelled the food being prepared and packaged for delivery, and although we were all full from dinner, Alexis M. couldn't resist placing an order for take-out. Given our pleasant experience here, I plan on revisiting to have a real meal.", "author": "Wendy F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-04-04", "description": "It's hard to find great Dominican food but this place has Great food! Fast delivery! If I lived in NY I definitely would be a regular!", "author": "Susan J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-27", "description": "This is the best hispanic food spot in the neighborhood, in terms of flavor. They are CASH ONLY and the prices are very decent for the amount of food you get (hefty portions). It's not a fancy spot and the service isn't very consistent, but beats Sophie's hands down! I'm a MIA girl and this is where I come to get my Spanish fix when I don't want to spend a fortune for what I know to be very inexpensive food.", "author": "Zareda N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-25", "description": "The weirdest place ever. The people here are sketchy. They hide their cash only sign. I was told to go to the atm to pay for my food and when I return to pick up my left overs my food was thrown in the trash. The alleged owner said I'm sorry with a stone cold unapologetic face. This place ruined my lunch break :( and I regret being hungry around here.  One word for all who think they should come here  skiiiiiiipppppppp no gooooooooo do not eat hereeeeeeeeeeee badddddddd baddddddddd \nBadddddddd maloooooooo no bueno the food doesn't taste that good either \n\n\nDo not enter", "author": "Donny R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-26", "description": "I've ordered off seamless before but wanted to take a walk from my office and stopped by here. The girls here behind the counter are so friendly and fast. And the portions are on point for a great price point. \nThe mondongo (tripe soup) is to die for it's packed with tripe. The chicharron mofongo is amazing as well. The food tastes like it's made with love here. Wayyyyy better Cuban sandwich here then at Sophie's too. A Cuban made better by Dominicans go figure", "author": "Efa O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-01", "description": "Definitely, DEFINITELY dining in the next time! I ordered delivery and it was worth every damn penny. I had pollo mofongo and bistec encebollado with mashed potatoes and passion fruit juice. First, who told y'all to make that passion fruit juice so good?? WHO??! Take me to the person who made that juice! I drank half of it before I even unpacked the food that filled my whole apartment with a delightful aroma. I took a small bit of the mofongo, which was ordered for a later meal (yes, I ordered all of this food for myself because I'm greedy). I made my plate with the steak slices and some mashed potatoes, threw a little grilled onion on top and topped the mashed potatoes with the encebollado that was packaged separately. Man, man, MAN! I don't know man, I might have to bump Bogota Latin Bistro to the side for this place.", "author": "Amira A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-11-04", "description": "I had the Pollo Guisado and it was good. Big portion and Cheap. Dominicans and Puertoricans can cook Latin Caribbean the Best. Hands down.", "author": "Jonathan C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-02-09", "description": "I went here Because my boyfriend and I was craving some Dominican food. Once I got there they told me they don't take card ONLY cash and how there was a atm , chase down the block. Me and my boyfriend had to leave and go to our banks to withdraw money. At this Point we weren't too happy. We ordered our food, I got the oxtail with rice and beans and wasn't that pleased with it since it my favorite dish. But overall I wouldn't go back it ruined my lunch break.", "author": "Cindy R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-02", "description": "This is not authentic Dominican food sad to say ! I am really disappointed as I am half of this culture! The pictures look great but it's completely different from what's in my plate let's begin with the pork colorless! Strong pork taste not roasted at all no browning or crispy skin just gelatinous parts with bland meat no flavor at all really gamy tasting truly disappointing!!! The beans most people think it's soup that's because it's all runny watery! No texture no rich creamy flavor ! The empanada was good but, very small ! If Cibao just so happens to read this feel free to contact me !! And maybe I'll update this review!! Good Luck !!!", "author": "Kenneth P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-24", "description": "The food is delicious and fresh , takes some time to wait for he food but it's so worth the wait. \n\nIf you're Hispanic (Dominican) you'll love this place", "author": "Chastity M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-11", "description": "The Dominican food here is incredible! I came here on a weekday for lunch with a large party. The restaurant isn't big, but we were able to piece a few tables together to fit all 9 people.\n\nWe ordered the pernil, bacalao salad, queso blanco mofongo, chicken pastelitos, tostones, rice and beans, maduros, pollo asado,  bistec encebollado, oxtail stew, and steamed veggies (to be healthy-ish). The prices were reasonable, especially considering the portion size. \n\nEverything was amazing! The pernil had the crispy skin but tender meat. The bacalao salad was salty but also refreshing, which was great for cutting through the fattiness of the other dishes. The meat on the oxtail was incredible tender and literally falling off the bone. The mofongo came with an addictive garlic sauce that tasted amazing when we drizzled it onto the plantain mash. We also finished all four orders of rice and beans. Even though it was only a side dish, the execution was spot on. The rice was flavorful and fluffy, and the stewed beans were both sweet and salty.\n\nOverall, if you're looking for a filling and delicious meal, definitely check out El Nuevo Cibao!", "author": "Sophie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-26", "description": "I ordered online through seamless. com before and the food was great. This time I came personally and got food to go for my husband's recipe. \n\nThe place was very clean, nice music was playing in the background. The staff was very helpful and friendly .\n\nI'm giving them 5 stars because I love the food here, the quantity they serve is fair and the recipes really follow 100% the Dominican seasoning tradition.\n\nFood is flavourful and rich on spices. \n\nAlso, an important note sometimes if you google the restaurant, many names will come up, like, El Nuevo Cibao or Cibao. They said it's the same, so go ahead and place your order. You won't regret!", "author": "Wendrich J. M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-01", "description": "This restaurant was my first ever Yelp delivery experience! Like most deliveries, it's never going to be as good as sitting in, but I liked it.\n\nAmazing value for money and portion sizes. I got the pork mofongo and I split it across 2 meals. Simple, tasty food and easy to pig out on. It didn't blow my mind but it kept me happy", "author": "John M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-03-22", "description": "I don't usually write reviews but! I just ordered their oatmeal and oh my god!!!! It is the best oatmeal I have ever had! I am Spanish and I don't like plain oatmeal. This oatmeal tastes soooo good! I will be ordering more from this place. I am so happy I found a good oatmeal.", "author": "Jacqueline S."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "El Nuevo Cibao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "172 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/9116xkw9nAszN39nu11SSg/ls.jpg", "@type": "Restaurant", "telephone": "+17185961501"}