{"aggregateRating": {"reviewCount": 160, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-29", "description": "Come hungry. Like, really hungry.\n\nStaff is nice, but there were some breakdowns in communication. But we got everything sorted out with some linguistic elbow grease.\n\nThe mofongo is pretty good. We had the one with the Spanish cheese. It comes with a bowl of delicious gravy.\n\nThey also have a fried meat platter, which was a TON of food. It came with fried plantains and fried cheese. Basically, the most unhealthy selection of foods you could think of.\n\nFor my entree, I had the 1/2 rotisserie chicken (was recommended by the waitress vs. the 1/2 fried chicken). The chicken was a bit dry, but portions were big. The mountain of rice \u0026 pigeon peas that I got as a side didn't help. It was good though.\n\nIt was a pretty reasonably priced meal (especially for Smith Street), and I'd definitely come back (after my body completely digests the first meal I had here).", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-08-16", "description": "Was here yesterday with three other friends and ordered way too much. T-bone steak, pumpkin with seafood, stuffed lobster with shrimp, rice with squid, mondongo, sancocho, tostones, mashed potatoes, and a pitcher of sangria. Pumpkin was good, tastes the same as the lobster stuffed with shrimp. T-bone steak was way too salty for everyone at the table, rice with squid didn't have squid, probably gave us the wrong order, mondongo and sancocho was super thick, didn't like it. Sangria was just red wine, no fruits except for the broken pieces of lime and orange that they put on the side of your cup. The waitress was nice but it looked as if it was her first day since she didn't know much about the menu.", "author": "Nancy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-30", "description": "My review is for take-out only---\nHuge portions for the price!  Had the sauteed shrimp and vegetables, and the \"side\" of rice which was a meal in itself.  Will definitely be ordering again.", "author": "Leigh S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-16", "description": "Delightful place, great atmosphere and authentic dominican food.  Excellent Mangu, and I for one like to finish off my meals with a passion fruit batido, even if I haven't deserved it.", "author": "Lito H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-10", "description": "Grew up ordering from here and the food was always good but tonight? TONIGHT?! They outdid themselves. \n\nOrdered pechuga empanizada with yellow rice, red beans (or are they pink?) and maduros to go. Got home and my sweet baby Jesus in the manger! When I say flavorFULL - I mean just that!\n\nThe rice was perfect. Those beans???????? I could taste the symphony of flavors from the sofrito dancing on my tongue. Heaven. The chicken? Crispy yet still tender and moist. The maduros were actually sweet with no weird aftertaste that MOST Spanish restaurants have. \n\nI enjoyed my order so much that I felt compelled to call them and tell them just how wonderful everything was :) I needed them to know how happy they made me LOL.\n\nI am done searching for my \"go-to\" Spanish restaurant when I don't feel like cooking Spanish food myself - this is THE place.", "author": "Jennifer B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-10-24", "description": "Ordered in one night from Nuevo Cibao and the food was delivered quickly within 30 minutes. It came to 30 dollars total and we ordered A LOT of food including one chicken empanada, one beef pastel, sweet plantains, pernil with rice (massive portions) and one mofongo. \n\nEverything was delicious and had great, authentic flavor. The pernil was falling apart and was delicious dipped in the mofongo's side gravy. The sweet plantains were some of the best I've had - extremely juicy. Not a single one in the whole container was dried out. We will have leftovers for at least one meal if not two. I definitely want to go in person and try some of the very interesting sounding Dominican breakfasts that they serve. Highly recommended for inexpensive delicious food!", "author": "Sol C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-12-28", "description": "Do to the fact that I've been tasting Dominican seasoning all of my life it's hard to be neutral so let me just say that if you looking for some legitimate Dominican seasoning/food look elsewhere.\nNote. The cubano sandwich is s good one.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-28", "description": "I wish this place was in Boston. I went in when I had a couples hours to myself in the neighborhood and a hankering for mofongo.\n\nI ordered mofongo pollo, pollo al aljillo, and arroz con gandules.\n\nThe food was awesome and the portions were huge. I definitely recommend this place and can't wait to go back next time I'm in NYC.\n\nThe menu on Yelp has slightly lower prices than what is actually in store, but it's maybe ¢.50-$1.00 off.", "author": "Marina W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-26", "description": "Its hard to get good Hispanic food. But i found it!!\n\nThis place is one of my new favorites. Their morir soñando is soooo good. For those who are unaware of what that is, its a traditional dominican drink. Milk, sugar,  oj, lime, vanilla. It sounds gross but it's amazing. \n\nAnyway...the rice is medicore. Not the best but the beans add flavor. The beef stew is full of so much flavor and has the perfect tendency, love it. The maduro (sweet plantain) wasnt too bad however ive had better. \n\nPrices not too bad. Definitely like it.", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-12", "description": "The food was great. I had the Fried Pork Chops. Delish! My husband had the steak and eggs, yum! And our friends has the mofongo and rotisserie chicken. We will definitely be back. Only draw back, it's cash only. There wasn't a sign but now we know for next time.", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-29", "description": "This place is terrible! They do not advertise that they do not accept credit card and make you pay through a food app. The order was wrong and the protein portion is so small. You will receive vegetables drenched in sauce. The food had an awful after taste. The wait time is ridiculous. Waited 40 minutes for a to-go order and they were not busy. They use boxed mashed potatoes and don't have the audacity to finish stirring the powder. I threw out the food and asked for a refund through the food app I had to use.", "author": "Marina Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-12", "description": "Had to give a full 5 stars since they now deliver to Red Hook via Seamless! Quick delivery, warm, delicious food. Awesome!", "author": "Moses G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-13", "description": "Cuban sandwich, pernil, mofongo all great. Price great. I'm lovin it...ba baba ba baaaaaaaa\n\n\n\nRevisiting my review. Ordered pernil, yellow rice and beans, and 2 empanadas / pastelillos for delivery. This made me question why I would ever order Chinese when I can have freshly made food that tastes like it came from a loving mothers kitchen. Order so we can keep this place around!!!", "author": "Danny R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-17", "description": "Nice spot for a tasty lunch and a coffee while  on call for work. With Allset I was able to enjoy a meal in 15 minutes and leave as soon as a job came in.", "author": "Dan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "This little place never disappoints. We've been here over 20+ times and keep going back for more. We had the filet of sole stuffed with shrimp, the T bone steak and the skirt steak. Also tried the oxtail stew as well as the tripe soup. All excellent. The beef stew and the pernil are sometimes dry but maybe it's bc we often go late at night. The grilled pork chops are great, the fried pork chops and chicharonnes are really delicious too. Always get the yellow rice and beans, along with tostones and garlic sauce. Just thinking about it makes me hungry!", "author": "Cee S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-02", "description": "Super yummy food, huge dishes, great attention to detail -- the warm buttered bread they served was a lovely touch! Thanks Allset!", "author": "Jools And Meg M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-23", "description": "This place is great! I tried mofongo for the first time and it's amazing! I've tried both pork mofongos, \u0026 the chicken kind. I've also had beef pastelitos, \u0026 pineapple shake. The prices \u0026 the food sizes are great!", "author": "Alyea A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-07-17", "description": "Ate at this place with my wife and it was not a good at all. Just 4 words will explain our experience. \n\"HAIR IN HER FOOD\". \nWe notified the waitress about it and she took the plate and then came back with \"i dont know what happened, sorry about that\". I didnt want to waste time arguing over it so i paid the bill, left no tip and will never go back again.", "author": "Gil D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-12", "description": "Was in search of a Spanish restaurant one morning to get breakfast, was there as soon as they opened and got my food quick and it was delicious .. definitely will use them again !", "author": "Eileen H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-20", "description": "Easy casual nice spot for lunch in Cobble Hill. Service is kind, food is nice, prices are fair.", "author": "Gessica D."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "El Nuevo Cibao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "172 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/9116xkw9nAszN39nu11SSg/ls.jpg", "@type": "Restaurant", "telephone": "+17185961501"}