{"aggregateRating": {"reviewCount": 160, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2009-03-27", "description": "Smells great in here, nice and cozy, very sweet ladies running this place. I love the prices, and the buttered bread was sooo good, sunny side eggs made perfectly, my coffee was just right. It was an easy meal, but was given great care and done right. I would love to come back for lunch sometime.", "author": "Richard B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-21", "description": "Came back for lunch. It was actually a very good deal, the chicken was tasty and juicy. They have a good variety of lunch specials.", "author": "Steve B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-08-07", "description": "Good service and good Dominican food. Fills the spot when you need it to.", "author": "Eleanor B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-05", "description": "Cozy Dominican restaurant located in Brooklyn. I was excited to finally try Dominican food in NY to see what all the hype was about... I wasn't disappointed. I ordered the Mofongo with chicharon and was very pleased. Prepared to the T. The only thing that I didnt like was the fact that they only accepted cash :/ but other than that I will definately be back!", "author": "Leslie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-20", "description": "I just moved to Brooklyn a few months ago and found out about this place by accident. This place has great Dominican food. It's like having a home cooked meal and its affordable. It's a must place to eat for anyone who love Dominican food or just good food in general.", "author": "Marcus L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-17", "description": "I'm sooooo happy I found this place! You would think that with so many Dominicans in NYC, there would be more GOOD restaurants here. I could not believe that this place is in Cobble Hill, which made me a little skeptical.\n\nI'm glad to say that it was absolutely amazing and I'm so glad I went and took my friends. Dominican food will probably never be as good as the one my mom cooks, but this was really great. I thought the tostones and mangu (mofongo) were a little dry, but I didn't use any of the gravy they served like my friends did. My friends raved about the pork they had. I ate the rice and beans and salad and it was fresh and yummy (and of course, I had a Presidente beer).\n\nAnother friend asked me if it was authentic and I told her that they barely speak English, so yes, it is, which made it even better. If you want good Dominican food in Brooklyn, this is the place to go. Yaay- my peoples representing!", "author": "C J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-11", "description": "I will admit that the half chicken I have ordered in the past has been rather delicious. However, the last two times I have had delivery issues, and after my last experience, I will NEVER order from here again... After over an hour waiting for my food, I decided to call the restaurant to inquire. I was told that the delivery guy was in an accident. Of course with situations as such, one must be flexible. But the restaurant should have called to notify the affected customers. So, they promised me the food would arrive in 15mins (note I gave them my address once again). When 35 mins passed (and my stomach was begging for food) I called back and was told the food would be there in 2 mins. Not very confident with this guesstimate, I ask for them to call the delivery guy. I've now been on hold on and off for 10 mins and finally I'm told the food was in fact delivered, and to me! Why would I be calling if in fact that was the case?! When I ask to talk to a manager or owner, I'm told he/she won't be back until a week later. But, then no one seems to want to help with a resolution, just a lot of long awkward pauses while they speak to each other with me on the line. Finally, I ask for them to try once more with the address I gave them before and a random man gets on the phone and is INSANELY RUDE. He tells me they are hanging up the phone and I will not be sent another order. I'm sorry but this kind of customer service should be the downfall of a restaurant, I don't care how good your chicken is.", "author": "Lindsay N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-07-01", "description": "Home of the best Cubano I have ever eaten, hands down. The rest of the food looks great as well, but I simply cannot convince myself to turn down the Cubano - for 6 bucks, it is also a great deal\n\nHowever, I only give 3 stars because it is not the cleanliest place I have been in, and the staff isn't very friendly", "author": "Tyler S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-07-11", "description": "The worst take out experience I've had in the neighborhood. I went in to order food, placed my order for take out - grilled chicken topped with vegetables and sat down for about fifteen minutes to wait. A guy came in while i was waiting, ordered his food and it was brought to him in a matter of seconds while I continued to wait. When I finally got the food home - a block away - it was inedible. The grilled chicken was tough and flavorless and the vegetables were hunks of overcooked carrots, potato and a few strings of pepper dripping with what I can only imagine was chicken fat of some kind. No flavor to the food at all, goopy and gross. Thank god Lobo was still open, I threw out my food from Cibao and went over there for some grilled chicken and vegetables that was fresh and delicious. I will never waste my money at Cibao again.", "author": "Dana K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-05-01", "description": "The food has always been great here, and now with the remodeling, I can even take my friends that were a bit suspicious before of the hole-in-the-wall appearance. The skirt steak was cooked to perfection, and the Mofongo is great! Check out this place... great prices, and friendly staff.", "author": "Jen L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-18", "description": "I grew up in the neighborhood and Cibao is a staple and I hope they never leave. They have really good  authentic Dominican/Latin food and the place is casual and the people are personable.  They have recently upgraded the look to keep up with the new appearance and  restaurants on Smith Street, but their prices are still good and the food is excellent. Even if you know how to cook the food yourself, when you dont feel like it, this is the place to be.", "author": "Monica J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-11", "description": "Pretty good... I'm not a huge fan of Latin food but this is really good. The rice is heaven and the breaded chicken was also really good. The only reason I gave it a 4 and not a 5 is that the Chicken salteada was soooooooooo salty!!!! All in all, pretty great! Oh and did I mention that it's dirt cheap?", "author": "Cosmo C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-08-11", "description": "One of the best Cuban Sanwiches (and at $5 a damn good value).  They build it when you order it (unlike Margon or some other cuban delis in the city) with roasted pork (seasoned and juicy), ham, swiss, pickles and mayo (I requested mustard instead).\n\nGreat drinking fuel for the many bars on Smith.  Will soak up both your hunger and the alcohol!", "author": "Likes J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-19", "description": "The food here is amazing.  It's my new take out obsession. Roast pork, ribs, cubano, beef cutlet sandwiches are all delicious.  I even eat their rice and beans and I normally dislike beans but theirs has a nice smoky favor. \n\nCoffee is really good and they even manage to make Lipton tea tasty.  They froth up the milk so it's almost like a tea version of cappucino.  \n\nThe place is nothing to look at but the kitchen churns out food that's comparable to some higher end restaurants. \n\nI would rate it a 5 except I prefer to do take-out to eating there.", "author": "S L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-02-17", "description": "Rightous Cuban sandwich and mango batido.  Maduros good too.  A super busy Dominican luncheonette with lots of take out.  Friendly people at the counter.  Portions are gigantic...If I finish the cuban sandwich, no dinner for me!  The pork is well seasoned, with some crispy skin, and lots of it.  MMMM  I am getting hungry just writing about it.", "author": "John B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-14", "description": "I used to order from here all the time when I worked in downtown BK, and that was more than 3 years ago!!! I still remmeber how good their arroz con pollo is. The rice and beans are delicious and the roasted chicken is juicy and tender, huge portion for about 5 or 6 bucks. Have never been inside this place though, and now that I no longer work here--I crave it all the time! Have to make a stop asap.", "author": "Sam B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-09", "description": "This joint serves great Dominican food in huge portions for cheap prices. The pretty girls at the counter will even press stacks of buttered bread while you wait. I've never been to the DR, but the old gauchos with Presidentes and the blasting reggaeton make me feel like I have.", "author": "Robert R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-10-30", "description": "It's upsetting to me that we had a meal Cibao and that we spent money there. I sincerely wish that the place did not exist. From the outside, it seemed fine, and there were quite a few people inside. All of the tables were full so we stood in a small space just to the left of the door. A family of four was sitting near the door, in a cramped space with two rickety tables in it, near what seemed to be some safes stacked on top of each other. Another table opened in the main section and the family of four quickly switched to it. Later, the mom mentioned something about how it was cold there. The lady who ended up being our server, sat us at one of the two bad tables near the door. Instead of introducing us, giving us menus in a nice way, she barked that she'd intended to give us a different table, until the other family grabbed it. She rudely mentioned that she'll back to get our order. She came back shortly thereafter to take our order. Tried to order: chicken and sauteed vegetables; the last appetizer; and avocado salad. We were told they didn't have that appetizer, again in some rude fashion. She asked if we wanted some kind of meat with the salad, yes chicken. She never mentioned what that would cost, or even that it would cost something. Another table opened up in the main area and we asked to take it. She leads us over to it, again in a rude way, and cleans it off while we're standing there. Shortly after a couple of water glasses were set on the table. They were never filled. The beer we ordered was set on the table in front of the wrong person. Our food came. The vegetables were not sautéed, but clearly steamed. When I mentioned that, she said no that's just how they do it. Then she came back and said well if you really want me to I'll ask them about it, again acting as if I'm wrong. She took the dish away and I got it back several minutes later with some boring sauteed vegetables. Our salad consisted of simple lettuce, simple tomatoes, maybe a third of an avocado, the $4 grilled chicken, and some olive oil. All quite boring, as if some kind of primary afterthought. The food was overall very uninteresting, as if it needed more sauce or something. From the point of getting our food on, we were not in contact with our server at any point. She did not ask how the food was, which I assume she might have done in the same rude fashion. She did not ask if we'd like anything else, such as dessert. I don't know if they even have any. After waiting for her to bring the check for several minutes, we asked for it. $25. A different server took the plates off our table. I sat there watching the lady at the table next to us talk on her phone for a bit about Sandy, use her fork to pick out the marrow of her porkchop. I listened to the little girl repeatedly ask about her second coca cola, which the server also took forever to bring. I looked at another table where the lady asked for a diet coke, at which point she was told they don't have it, but she could try a ginger ale instead. We paid for the food and left. It means something to me to know that I'll never have to eat there again.", "author": "James H."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "El Nuevo Cibao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "172 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/9116xkw9nAszN39nu11SSg/ls.jpg", "@type": "Restaurant", "telephone": "+17185961501"}