{"aggregateRating": {"reviewCount": 160, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-29", "description": "Coming from Miami I ate A LOT of Latin food I mean there were more Cuban spots then McDonalds!! So ever since I moved here I have not had any Latin food.\n\nFinally after walking by this place so many times and watching it be renovated and with the storm and nowhere to go I had to see if BK could match up to the MIA...\n\nI decided to order take out (like I usually do 9 out of 10 times).  I ordered the pollo al  ajillo(chicken with garlic) which came with one side and I chose the habichuelas (rice \u0026 beans) I picked yellow rice and red beans.  I also ordered a side of tostones (fried green plantains) because I love tostones.  \n\nThe order was ready right when they said it would be.  They handed me a bag that felt like i was lifting weights.  I get home and open the bag and start pulling out the items, I was amazed once all the food was out in front of me.  Let me just say everyone was on point when they said WOW DO YOU GET A LOT OF FOOD!  \n\nI didn't know where to start so I decided to try the tostones with the garlic sauce which were not dry or burned.  I wish they gave a little bit more of the garlic sauce bc the amount was really small.  The yellow rice and beans were moist and flavorful and the pollo al ajilo was so good I love garlic so this was a perfect dish for me!! It honestly took me two and a half days to eat all the food, and trust me I have an appetite!!! \n\nSo overall did it match up to the MIA yes it did, Great Dominican food! Now just to find a place that serves great cuban food like ropa veja and picadillo!", "author": "Dena A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-04-10", "description": "Per my friend, they redesigned this spot. It's no longer a hole in the wall now. New tables, chairs, etc with the exception of the canister lights. lol I guess they needed some of the old remnants.\n\nAnyways, we had the cubano sandwich and the steak sandwich. She told me how great the cubano was here in comparison to Margon in the city. They're slightly different here and that may have been due to the fact that the actual presser machine wasn't available yet so the bread wasn't flatted and toasted like it normally is. Nevertheless the ham, pork, pickle, sauce, etc were fantastic! I'm a big Margon fan in the city of their cuban sandwiches but this was equally as tasty.\n\nThe plaintains were crispy on the outside and didn't have that greasy feeling or look to them. Perhaps they used a new machine or new oil but regardless very good.\n\nService was friendly and attentive. Definitely worth going to if you're in the area.", "author": "Samuel C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-20", "description": "My partner is Puerto Rican and loves Monfongo. She loved the flavor, service, and the price. The setup was charming and the staff was friendly.", "author": "Alicia S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-14", "description": "I'm a relative newcomer to the area -- 3 years, but from what I hear, places like El Cibao were quite common on Smith Street about 15-20 years ago when the street had a greater Puerto Rican / Dominican influence.  It is now largely a hipster/yuppie hybrid but it makes me happy that there are still some holdovers that offer affordable and delicious food.\n\nEl Cibao is one of them and is typically filled with Spanish-speaking regulars at dinner, workers during lunch, and families all day on the weekend.\n\nThere's a jukebox that plays Spanish-language hits -- like those from legend Vicente Fernandez.  The TV is always on Univision or Telemundo.\n\nI typically get the arroz con pollo and some water.  And the fried bread with butter is amazing. It reminds me of the traditional Brazilian way of preparing bread for breakfast -- pao na chapa.  The arroz con pollo is very tasty and I typically come here about once a month or so.  The portion is also quite huge and makes for good leftovers.\n\nEl Cibao's main competition is down the street -- El Nuevo Portal.  Cibao I think has a bit more character -- looks like there are more regulars here and it has that hole in the wall charm that I like.  This isn't a knock on El Nuevo Portal bc their food is just as good.  Just an observation.  Both are great in my book.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-09-06", "description": "I came for lunch with my friend on Wednesday and we had to seat ourselves. No one was even looking our way. Only when we sat down then someone glanced our way and came and brought us menus. The menu they gave me was broken in half and the same thing on both sides. I had to read my friends menu. He is Dominican so he was able to explain everything to me because the workers didn't speak English that well.  Then one of the workers who acted as our waitress brought water in a wine bottle and a basket of fried bread. My friend and I were confused about the wine bottle so we had to ask if it was water or free wine. We were assured it was water. The bread was delicious. The water was tap water. When we ordered food the waitress was polite though. She did her job well. However we were practically on our own from there on. \n\n\nThe taste of food was a disappointment. Only one of the appetizers we ordered was worth checking out the place for. \n\nThis is what we ordered:\nPastelitos with beef- These are Dominican empanadas. These were amazing. Not too greasy and the beef and spices used made these very addictive. I would definitely come again just for these pastelitos.\n\nRelleno de papa- This was fried mashed potato balls with ground meat inside. This did not taste good. The mashed potato wasn't mashed enough and it was bland and the meat didn't taste any better. \n\nCuban Sandwich- This was one of the best meals they have in my opinion. It looked like a grilled cheese sandwich or a Panini. Inside was sliced steak and ham and Swiss cheese. The steak was a bit too salty in my opinion but my friend said that it was perfect. It was also very aesthetically pleasing.\n\nSancocho: this is supposed to be a stew however they gave me something that looked so gross. It was more soup than stew. On top were careless thrown huge chunks of carrots. The chicken was overcooked and tough to chew. This is what I came to try and left very disappointed. \n\nArroz con Pollo- I have never seen an arroz con pollo with celery and peppers. I didn't like it that much. It was mildly flavorful, but I didn't feel like I was eating arroz con pollo. It felt like I was eating something entirely different.\n\nI had lemonade to drink. It tasted like powdered lemonade.\nMy friend had a Mamey shake without milk. It tasted like a glass of sugar. And the glasses were small in which the drinks were served. \n\nFlan- is a Jell-O like custard. It was way too sweet for my taste. I took a small sliver and then passed it on to my friend.\n\nThe restaurant was very small. There is a long leather bench from one side of the restaurant to the end. I saw that it was old and ripped in some parts. The tables along side it were placed to far from the benches that at first I sat at the very edge but then my friend and I moved the table closer to me. There are no paintings on the brick wall. The only interesting \"artwork\" are the pendent lamps hanging from the bar table. They were covered in the empty Dominican coffee cans. The ceiling design was interesting though with its silver color and interesting design. Other than that next to the entrance the tables look a bit crowded. It was completely empty when we first came in. Then it started raining and hailing outside and more people were forced inside. It looked more like a scene from Barbershop where everyone comes in just to chat. The inside looked old. They did try to keep everything clean though. But the area behind the bar looked crowded. They did have a beautiful wine rack that stood out among all the other appliances in the way.  The music was regular radio music.  The exterior was more welcoming than the interior. Since this is a cash only place there is an ATM right outdoors which was a hassle getting to in the pouring hail. \n\nAs with most cash only places the food is very cheap. The most expensive dish in the restaurant is the Paella. Everything else is under $10.  They also have a lunch special that is $7.99.\n\nIf i do come back its for the empanadas. Nothing else is really worth a trip back.", "author": "Larisa P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-02", "description": "I wish I could rate the food at this place but we never got to taste it.\n\nLast week, my girlfriend and I had a hankering for Latin cuisine.  So we went to El Nuevo Cibao.  My first impression:  an unprofessional and unfriendly staff.  When we walked in, we made eye contact with at least two waitresses who passed right by us at the door, and made no move to seat us.\nSo we sat ourselves, and waited.  We had just had a great time walking on Smith Street, and we were really looking forward to a great meal.\nTen minutes later, no one had yet given us menus.  Ok, it was somewhat busy, I thought.  I tried to flag down a waitress, who had clearly mastered the art of looking at you, without really seeing you.  She ignored us.  At one point, I literally had my hand up, like I was back in grade school, trying to get her attention.  No dice.\nSo I got up, walked to the counter and got our menus myself.  Browsing through it, the food selection looked good.\nWe waited another ten minutes for someone to take our order before I tried flagging a waitress again.  \nThere was a table of construction workers, sitting next to us, and one commented to me \"Good luck, she wouldn't come to our table either.\"\nAnother ten minutes pass, and she finally stops by the table \"You have to wait a little longer, we're very busy.\"   Seriously?  \nMy girlfriend asked if she could at least take our order, and she replied with \"I told you its very busy\".  Meanwhile, this is a pretty small place, and there were now two empty tables.\nWe walked out.\nWe still wanted Latin Cuisine, and we were lucky to find \"El Nueva Portal\" just one block away (also on Smith Street).  We went in there, were immediately seated, and given menus, glasses of water and bread.  We ordered the chicharon de pollo and mofongo.  Both were delicious.  And the service was no frills, but good.", "author": "John O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-07-08", "description": "Cibao was great until they \"refurbished\" I go to Portal for the real deal now.", "author": "Hank M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-04-20", "description": "Truly Disappointed! food wasn't served warm. Rice tasted iffy. I recommend highly Bogota Latin bistro in Park Slope, instead of this place. That place kills this place in terms of good Latin food.", "author": "Paulina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-08-06", "description": "The best place to get lost on Smith street. Presidente, 4 bucks.", "author": "David N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-06-30", "description": "El Nuevo Cibao is exactly what it needs to be. The food is amazingly good and that's all that matters.", "author": "Dan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-03-17", "description": "Very authentic Dominican/ puertorrican cuisine restaurant. You get a lot of food for the price you pay. This is the type of place I used to go for lunch when I was in college in Puerto Rico. You can't expect the typical overly attentive service. It is casual, and familiar.", "author": "Yadiel R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-06-26", "description": "We were in the neighborhood and went here for dinner based on Yelp reviews and also they got an A in inspection. We got in here just in time before the downpour. I had the shrimp mofongo. It was pretty garlicky and tasty but the mofongo was a bit hard. Daughter had the arroz con chorizo. Rice was ok but her chorizos were good. Husband had the Pigs feet and thought it was pretty good. Service was good but a little slow. Would definitely return.", "author": "L W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-05-08", "description": "Hot Diggity. 4.5 stars.\n\nAmazing Dominicano - the food was great. Perhaps the best maduros I've ever had, a great camarones al ajillo, arroz con pollo, and even the little side salad was nom'able. \n\nDef a no frills place - very simple. Wouldn't say it's super cheap for its basic nature - the camarones were $13, but it's definitely reasonable and has large portions.\n\nIf you don't speak spanish, you're kinda of shit outta luck. My waitress seemed to understand our Span-english crack but only spoke very fast spanish back. Difficult but I made do.", "author": "Rebecca A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-24", "description": "Food absolutely amazing. You have to try and the waitstaff is very accommodating. Overall must try.", "author": "Michael H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-12", "description": "I loved this place,I went to NYC for my bday and found this on yelp .me and my boyfriend had two huge plates of food we got the best fresh side salad,and got a tres leche cake,and the price was great...next time I go back to NYC I'm deff coming here again .best Dominican food", "author": "Nan C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2007-12-02", "description": "Surprised that this small dominican restaurant hasn't been reviewed yet as it's on a pretty central smith street location and it's been there 4-5 years (according to the people behind the counter).\n\nAnyway, I stopped by and ordered dinner to go. I ordered the drunken chicken, which wasn't very good -- way too salty.  As a side, i had the rice \u0026 beans.  The rice was served with uncooked/overcooked chunks in it.  And the beans were way too hard and soupy to be good.\n\nAlso, the prices are too high for what it is, a hole in the wall dominican restaurant.  Perhaps i'll try the $6 dinner special (which i imagine is pre-prepared food) -- if that doesn't impress me, i won't be coming back.\n\nOn the plus side, their passion-fruit shake was very good, although it was simply juice with ice -- not really a shake.", "author": "Jonathan W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-24", "description": "terrible. I ordered aand 45 minutes went by and i called back and the delivery guy did not even leave. Not professional at all on the phone", "author": "Jay S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2009-01-11", "description": "Best Cubana I ever had!  And if you ever want a real cafe con leche, you can find it here as well.  I usually order my food for take out, but today we decided to dine in.  The sounds and feel of it is like eating in a Cuban diner (I could only imagine, since I've never been to Cuba).  Salsa in the background, regulars hanging out watching t.v. and having a beer, and families coming in for lunch after church.  Let's just say, it didn't feel like I was in the states.  \nNext time I dine there I'm trying the Arroz con Pollo.  I heard it's really good as well.", "author": "Em P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-11-22", "description": "The prices are very reasonable at Cibao.  I ordred from Cibao for take out.  The mofongo I oredered, unfortunately, was very dry.", "author": "Felicia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-04", "description": "Tasty, Cheap. Friendly. Not healthy. Pretty Basic. will return (after I lose the holiday weight - that has come on after only thanksgiving. blah!). Not a destination place. But if you are in the neighborhood, stop by!", "author": "Sharon K."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "El Nuevo Cibao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "172 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/9116xkw9nAszN39nu11SSg/ls.jpg", "@type": "Restaurant", "telephone": "+17185961501"}