{"aggregateRating": {"reviewCount": 160, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-30", "description": "Very good option for Dominican food in the work hood. I had the pernil and my friend had the chicharron de pollo. The pernil was super flavourful and a generous portion. The chicharron was enhanced by the garlic sauce that we ordered on the side. Must get this garlic sauce. Super tasty and I mixed some into my rice for even more flavor. Service was quick and plenty of seating, though the restaurant was a bit on the cold side. Still a good option if you are craving some Dominican and I will be back!", "author": "Cynthia M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-15", "description": "Food was really good.  Not amazing, but definitely a good lunch at a good price. I had the pork mofongo (served with a cup of excellent soup) and sweet plantains.  Read some other reviews that complain about poor service.  We were greeted immediately and our order was taken within two minutes.  I'd be happy to go back.", "author": "Patrick C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-27", "description": "best you get on smith street....\n\nalso the cheapest.\n\ncuban sandwiches to die for... traditional well served.\n\nMondongo.. teh best on weds especially.\n\nget a batido de parcha con leche for your kids...and they wil have you there every time.", "author": "Geb B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-05-15", "description": "\"Grandma\" home cooking all the way. I've eaten here a few times. Last time we were there, the women behind the counter were all singing while they worked. A neighborhood joint with Dominican food. Mmmm....Comfort food.\n\nIt's not fast food -- but you'll get a basket of warm bread while you wait. Don't eat it all! Save room for the meal...the portions are generous.\n\nI love the rice and beans. And the sweet plantains (maduros) -- mommy! They are done to perfection, carmelized just enough to have that crispy, sweet stickiness at the edges. My carnivorous husband loves the beef tripe (mondongo). \nHe eats most of the bread too...omnivore!\n\nLooks like a mighty delivery biz too, delivery guys hop on their bikes, ride like the wind, and are back for more inventory -- and gone again.", "author": "Toni T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-27", "description": "Decided on this place since I was craving spanish food during lunch time... I was not upset! \nThe food was delicious and beyond on point!\n\nminus the one star because on the hottest day of last week's heat wave, there was no AC.", "author": "Beautiful Badass E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-18", "description": "Real rating 3.5\n\nHello yummy dominican breakfast! That's all I can base this review on. It was great unlike the service but I totally expect that from my Dominican people.\n\nUnfortunately, they need to fix their health grade, that's when I'll return to try more, I'm keeping my eyes open for them to upgrade to an A. Till then this review will remain short and sweet, when I have a chance to try more I will update my review.", "author": "Pamela B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-09-03", "description": "Being of Puerto Rican descent, I have a pretty good palette when it comes  to discerning quality spanish/Caribbean food. When I read all the yelp reviews, my boyfriend and I decided to give this place a try. Having been there a few times now, I can say this:\n\n-The buttered bread they give you when you sit down is AMAZING\n-The maduros are to die for\n-One of the best Cuban Sandwiches I've ever had--their pork is flavored to perfection\n-The breaded steak is great\n\nI would put this on par with my mother's cooking, and that's a very good thing.", "author": "SM R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-11-14", "description": "Wish I could tell you what the food was like. \n\nI walked in for lunch today and there were only 2 small parties (of 2) \u0026 2 other guys sitting at the counter who seemed like they personally knew the staff. The remaining tables were covered in filth including spilled food left by previous diners.\n\nI stood for a while in the middle of the room looking for a clean spot or hoping that the girl who popped out from behind the counter was going to tell me she was about to clean off a table. No. So,  I decided to sit at the counter since it was clean. I took my time taking off my coat \u0026 arranging myself \u0026 stuff on the stool. Regardless not one of the 3 young women, who were 1-5 feet away from me behind the counter, acknowledged that I was there. They were too busy talking among themselves and the men at the counter. . I looked around for a menu. The only one I saw was at the far end of the counter.\n\nI kept trying to make eye contact with the waitresses but realized that if the room was so dirty and the staff so unconcerned \u0026 inattentive maybe I didn't want to know what was happening in the kitchen. I waited a few more minutes before slowly getting up, putting on my coat \u0026 retrieving my purse. No one noticed or cared. So much for giving the new place a chance. I hope chit chat pays the bills.\n\nBTW - I went next door to Pane e Vino where I had a lovely experience that I will share on this site too.", "author": "Kim R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-18", "description": "Under the radar Smith St. joint that has been there forever. Best Cuban around and an awesome egg sandwich too served on the same cuban pressed roll.", "author": "Brad E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-03-28", "description": "Yet another gem in the Downtown Brooklyn/Boerum Hill area.\n\nI walked in and immediately noticed the hot food on display right over the counter and it reminded me of all of my favorite Dominican spots in the Heights. I sat at the counter and was pleased to find that they immediately brought me a glass bottle of tap water and a glass. It seemed like a nice touch of class without trying to hard and coming off as pretentious.\n\nI asked if there were any lunch specials and was pleased to find a number of different combinations to choose from for $7. Some might bristle at the $7 pricetag, but I can assure you that 1) you'll get your money's worth and 2) this is still a good deal almost anywhere in the city. \n\nENC lunch specials include pernil (roast pork), pollo guisado (stewed chicken), carne de res guisada (stewed beef) and one other meat option that slips my mind every day. On other days, there are a variety of other specials to choose from in addition to the standards. \n\nI was fortunate enough to walk in on costilla de cerdo (pork ribs) day and I have to say, they were outstanding. I received four meaty, well-seasoned ribs with a mountain of rice and an entire bowlful of beans. VERY generous portions. Additionally, I received buttered toast (4 slices) all of which did much to endear this restaurant on me. The meal was so massive that I could've easily eaten half and had enough for another meal at home. However, I'm a porker and hadn't eaten that morning so I polished off nearly everything. \n\nOverall, I was thoroughly impressed with this restaurant, from the service and decor to the food. Furthermore, that I was able to find a quality Dominican restaurant so far from the Heights and the Bronx, I felt like I'd found a needle in a haystack. Great success! (Borat voice)", "author": "Clayton A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-23", "description": "Loved the bread appetiser. Tiny unassuming place. Really liked the garlic shrimp in white wine sauce and my husband liked the boneless chicken dish he had", "author": "Rajashree S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-06-08", "description": "My boyfriend is Puerto Rican and Dominican, so he tends to hate paying for food he grew up eating and could very well prepare for himself. He makes the exception, however, for mofongo, which he'd rather not make at home.\n\nWhile wandering around Smith Street, we stopped in here after he spotted mofongo on the menu. He asked the server how big the dish was because he couldn't believe how cheap it was. I, craving something hearty and comfort food-y, went with arroz con pollo. Both of the dishes were outstanding. Don't mistake that for fancy or unusual, because that it certainly is not, but neither of us could find a single negative thing to say. My man was particularly impressed with the sauce served with his mofongo...I think he said it was tripe stew...or like tripe stew...or something like that. Whatever, it was bomb. So was my arroz con pollo, especially with liberal sprinklings of hot sauce.\n\nWe stuffed ourselves silly (and had tamarind juice - soooooo yummy!) for only $17. For amazing, dirt cheap, tastes like home cookin' food in a quick and no-frills environment, don't miss Cibao.", "author": "Megan C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-05", "description": "I am one pissed off customer - it took TWO HOURS for them to deliver soup and veggies?! Really?! Their food is indeed good but i'm not gonna order from a place that takes two hours to deliver food. Seamless told me it should take about 45-60 min.  A little over an hour is okay, but two hours is absolutely ridiculous.", "author": "Arianna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-17", "description": "Stopped in here last night for dinner. Everything was great. We ordered beef pastelitos which were good and one mofongo with pernil and one with chicharron. Sooo good. The gravy that they give you to put on top was delicious too. The friends we were with had the steak and chicken cutlet with rice \u0026 beans and mashed potatoes. Potatoes looked like instant but everything else was good. It's definitely worth checking this place out if you are in the area. Prices were good too. It came to $70 for 4 people.", "author": "Despina M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-07-04", "description": "I use to come to this place when it was a hole in the wall...they have done some serious renovations to the space and it looks nice. The Food did not change which is great...great prices...tasty meals. We tried, the modongo, chicken soup, fried chicken chunks, rice \u0026 beans and maduros..great all around. The service was efficient and friendly. Will be back again...", "author": "Chris P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-08-31", "description": "Cibao.  Cibao run.  I know, not that funny, right?  Ok, on to the review.  \n\nEven though Yelp classifies this restaurant as Cuban, it is more along the lines of Dominican.  The chicken and rice dish is very tasty.  There was also a guy eating a dish next to me that looked incredible, although I couldn't decipher what it was, and when I asked him, he didn't speak English.\n\nThe dishes are seriously huge, and the check, seriously small.  You could eat until you explode for less than $10.00.  There is also a small variety of different beers you can choose.\n\nAll in all, a good experience.", "author": "Jon C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-04", "description": "This place has fresh traditional Dominican food,  Friendly staff, and quick delivery. Nice looking quaint building,  great for a quick meal or for a date.  I like to order the pernil or the baked chicken. Salad is fresh also.", "author": "Paul L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-02", "description": "This is a new favourite place on Smith Street - comfortable, homey decor, friendly service, generous portions.  The seafood soup (Fridays only) is transcendental. The mofongo is solid, perhaps even slightly stodgy, and I would have liked it to be a bit more moist. Next time I'll get the sweet plantains as a side. Word from the other side of the table is that the Cubano is ok, but not inspired.", "author": "Nina B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-08-28", "description": "We've been a fan of this place for over 4 years, it used to be a little hole in the wall shop (but still charming); but they've recently revamped it up and now it looks as great as the food tastes.  The service is great and the menu is extensive....can't go wrong with anything you order here!", "author": "Estina R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-03-11", "description": "Ay Dios mio! El Nuevo Cibao can easily be passed by. Heck. I'd passed it by multiple times in the past and never noticed the place. Let's just say that it's not the prettiest joint on the block. So when my parents took me here for lunch I was a bit suspicious. But no worries! The food was sabrosisimo! My parents each had some slow cooked steak and onions with rice and beans while I had a pernil (pork shoulder) sandwich and the bill didn't come out to more than $20, with drinks! \n\nFast forward to a year later. When I touched down in NYC a few weeks ago pernil sandwiches dances in my head. And a bunch of other classic NYC foods, honestly. I met up with a friend and took her to El Nuevo Cibao where we split a breaded steak sandwich (she doesn't eat pork, boo!) and not surprisingly it was amazing too. Followed that with some white rice and beans and we were set. I ordered an alcapurria (a meat filled plantain fritter) and it wasn't right. I told the server when I was paying the bill and she didn't charge me. GOD, great customer service too! $12 later we were both full, happy and satisfied. \n\nEl Nuevo Cibao has it all: delicious food fast, great service and prices that you can't beat. If anyone tells you NYC is expensive to eat they lie! It's full of little gems like this one. \n\nMan, what wouldn't I give for a pernil sandwich now.", "author": "Melizza R."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "El Nuevo Cibao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "172 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/9116xkw9nAszN39nu11SSg/ls.jpg", "@type": "Restaurant", "telephone": "+17185961501"}