{"aggregateRating": {"reviewCount": 160, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-16", "description": "Just ordered a bunch of food to go from El Nuevo Cibao and ate like a queen. \n\nThis place is no-frills, authentic Cuban food. And sometimes that's just what you need on a lazy Sunday.\n\nWe ordered the pollo asado, maduros, and arroz con pollo. All of it was super tasty, and for only 20 bucks, that's a bargain. \n\nThe only thing keeping me from giving that fifth star: the rice in the arroz con pollo could have been a bit more flavorful, and some pieces were still white.\n\nBut given the price and convenient location, I'll certainly be ordering again soon!", "author": "Shannon G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-12-30", "description": "While in Brooklyn we looked for a place to eat. Food here is decent . Good portions . We had the chicharone with rice and the liver with plantains. Plates were good. \n\nWaiters don't really come by to check on how things are. But that's ok I guess. They drop a bottle of water at your table and that's it . \n\nOverall good. Be aware. It's cash only and the only place that it will say that in on the cover of the menu which is in very small writing . I had to wait while my fiancé went looking for a bank since the ATM right in front of the store does not work .", "author": "Liz G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-03-08", "description": "Love love love. When I was working in Brooklyn heights, this was the ONLY Spanish food restaurant that would deliver to us! The delivery is great and eat-in service is great. Jugo de chinola is delicious. The chuletas are amazing. The pollo salteado is great. The white rice and beans are delicious. Ahhhh so good. If you want a small appetizer, try the relleno de papa. Seriously flavor packed!! The only thing that wasn't so good was the pastelitos. The one I had was pale and not cooked completely. I could taste the raw dough.   \n\nAlso, complimentary toasted bread with butter already on it is served when you order.", "author": "Catherine M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-23", "description": "Large portions for a reasonable price$!\n\nAfter service a group of 10 of us needed a nice hearty meal. I was able to call Cibao and get reservations for us within minutes, maybe because it was around 10:15pm and they closed at 11, but never the less business is business. We arrived around 10:25pm.\n\nWe were all seated and presented with menu's the prices were great! \nBecause it was late a couple of things on the menu were not available and that was understandable.\n\nI had the Rotisserie chicken with rice and beans. The portions were so large, I was a little overwhelmed but was happy with their generous portions.\n\nCustomer service was average and they were accommodating.", "author": "Sheri S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-19", "description": "Had the family with me to enjoy some mofongos  Three of us had mofongos and at $7 a piece how could anyone go wrong.  The sauce that came with it was delicious and the mofongo with Pernil had a generous helping of meat.    I had the one with pork belly. OMG --crunchy and delicious.  I was happy.  One of us had the stewed Ox tail which came with maduros.  It was good if you like Ox tails but at $14 it was a bit steep in my book.  Maduros were sweet and nicely cooked.  We tried one pastel with pork and planned to order more if we really liked them.  No go.  Little salt and NOT a lot of flavor.  The worst was the texture.  The root vegetables were ground up in a food processor and that makes the \"masa\" rubbery.  Not good at $5.  Will never do that again.  \nAll in all the service was fine and the food was good.  \nThe place is all cash and it was a good thing that I had the cash or I might be doing dishes right about now.  \nEl Nuevo Cibao was pretty good.  I would go again.", "author": "Yvonne G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-01-22", "description": "When I order my food I went to the shorter female she pretended as if she didn't know what I was saying maybe because I wasn't bilingual or something . She looked at me as if I head two heads I asked for extra bread and she said it don't come with it but I know it does. The service was very unprofessional when my order was don't she didn't call me to tell me it was done it was sitting on the counter for 5 mins before I went back inside to get my food.  this establishment needs to learn some costumer service I'm a server and I know how to treat and talk to people! Learn some ethics and maybe I will return thanks the food is good", "author": "Shakeiya K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-10", "description": "I've eaten in the restaurant a few times and have also ordered it on Seamless. All those times, the food has always been solid. Some things can be a bit greasy but that's understandable, as it's more comfort food and not really something to eat while on a diet. \n\nRecently, had the chicken stew but the chicken was a bit dry. The arroz con camarones was great, the shrimp wasn't overcooked, though the rice was a bit under flavored. The pernil was delicious! Well-cooked with some of the fat (sorry, organic hipsters, I love it). On that note, get the pernil mofongo. It's not greasy but they give a large portion of the pork and it's so good! \n\nMy nephew also loved the beef empanadas and he can be a picky eater. Had the tripe soup, which wasn't bad although I've had and made better. It was under seasoned but I think with everything else, it can be compensated. \n\nLast but not least, and this is probably the most peasant of all, but the buttered bread they give...delicious!", "author": "Bennie S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-10", "description": "I have only been here for breakfast about 4 times so my review is based on that.\nLooking for a  quiet place in an overcrowded Carroll Gardens/Boerum Hill/Smith Street area on the weekends is no small feat. I made the trek to this restaurant yesterday for yet another satisfying breakfast.\nI sat at the counter and I was pleased to observe that the restaurant received an A rating from the Dept. of Health. The ladies behind the counter wore hair nets and the food was immaculately divided and placed in pans in an eye shot view.\nI could tell that they were preparing for lunch such as pork or pernil, rice and beans and more.\nI walked in with a cup of tea from elsewhere but you're usually served a glass bottle of water upon being seated. I decided to order the 2 eggs with yucca.\nPrior to being served your meal, they hot press  bread slices in a Panini-like device.\nIt was so good--light, airy and hot.\nThe eggs were cooked to my satisfaction--not greasy and over medium. It was accompanied by yucca topped with pickled red onions.\nIt was a large portion and very satisfying. How can you go wrong with such a plate at only $5.50?\nOn another occasion, I ordered the mofango (mashed fried and seasoned plantains) with eggs which was equally good.\nI'm not Dominican or of Latin heritage but I believe that their food is quite authentic and good.\nI've seen other customers being served lunch and it looked quite delicious--my next visit will be for either lunch or dinner.\nIf you're in the neighborhood, give this place a try.", "author": "Johanna B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-04-22", "description": "Que SABROSO! This is definitely your abuelita's kind of Dominican joint. The mofongo, arroz, pollo guisado...all superbly delicious and certified authentic by my Dominican friend:) You can hear conversations in Spanish floating through the air, cutting through the delicious aromas of your favorite Latin American flavors.\n\nMy friend ordered the mofongo and I ordered the pollo guisado, which was unbelievably  tender and flavorful. To top it off, we had a sweet waitress with a huge smile and a glittery 'BITE ME' t-shirt on. Tasty Dominican food and a sassy-in-the-best-way-possible waitress? I don't have to be a genius to know that's an equation for the best meal ever:).", "author": "Ellie W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-19", "description": "This place is dirt cheap.  Seriously...party of 7 w/ drinks bill came to $107- You cannot find a place this inexpensive and actually have a delicious meal in NY.\n\nThe inside decor is nothing impressive but the food is really really good.  Thankfully there was a Spanish speaker in our party because it helped move everything along.  \n\nOur table ordered a little bit of everything and let me tell you the portions are mountainous (I actually had to look up a synonym for huge because huge just isn't enough).  Between all of us we ordered: arroz con pollo, roast pork, tripe soup, steak with peppers and onions, grilled chicken and chicken stew.  Everything was delicious.  Not one complaint.  All the dishes came with large scoop of rice and small side of beans as well.  It was literally enough food to serve 3 people per dish.  \n\n-1 star for service.  They had 1 waitress for the entire restaurant which was about 6 tables and then 1 person taking phone orders in the back.  Seriously could use some extra help here.  We ended up getting up to ask for take out boxes and to get the check.\n\nDon't expect a ton of service but the food was worth it!  \n\nP.S. - They are finishing renovations, we could here hammering all night with a huge plastic cloth draped over the \"work area\" lol so much for a quiet meal.", "author": "Kimberly L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-07", "description": "This little hole in the wall has great food. I had good Spanish food for cheap \u0026 the staff was so nice!!! definitely want to go back.", "author": "April E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-28", "description": "I really should come here more often because their food is as good as people talk about. I had the oxtail stew and my friend got the pork chop. He was right; you really need to hold onto your belly when you exit this fatty, delicious establishment. Granted the prices are probably a little higher than what you'd see in other places that are heavily populated by the Latin people but this is as authentic as you can access within the vicinity. I leave here thinking \"I quiero El Nuevo Cibao!\"", "author": "Helen C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-09-05", "description": "The chicken was good, but I think the mashed potatoes were instant??  They were definitely gluey and the consistency of instant...", "author": "Laura D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-09", "description": "The beef with onions... very good. However, here are some things they can do better. a) I asked for medium and they cooked my steak well done.. b) they can work on cutting the grease down just the tad.\nThe negative: I ordered sautéed veggies and that means you stir fry veggie. That does NOT mean steam them and then satay them. You know what sauteed vegetables+steamed vegetables =? It equals soggy, and no one likes soggy. \nOn the bright side, their mofongo is a must!!!", "author": "Lisa H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-03-22", "description": "This would be a 3-star experience if it wasn't for the BREAD. The food was all decent enough (rice felt a little mushier than it should, probably cooked with a bit too much water). The pernil was pretty good! The sangria is nothing special but it effectively got me and my friend drunk.\n\nBut dang, I grew up in Puerto Rico and I really miss having a basket of buttery toasted bread brought to your table the moment you sit down. THIS PLACE DOES THAT, AND IT'S PERFECT.  We even asked for more bread to soak up the leftover sauce in our food, and they were happy to oblige!\n\nBy the way, it's cash only, and they don't have an ATM on site, so bring cash!", "author": "Cristina C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-14", "description": "Their food is delicious! specially the masitas de cerdo (fried pork meat) they come with rice and beans...Tip:  If you order aguacate they'll charge you $2.00 for a small piece wrapped in piece of foil.Better if you go to the fruit market and buy a whole one for that money, I returned mine the other day, people deverve a nice salad instead, that was ridiculous!.  Today I Just tried the pasteles they are awesome. Wish they had morcilla (blood sausage). Here is another tip..if you want coffee they don't have latte but they;ll charge you $4.00 for a strong coofee with milk so order the regular is cheaper and it will taste the same. Just saying. Their food is awesome but just be careful with some ridiculous prices when you order.", "author": "Elba D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-10-02", "description": "Stupendous!  I would totally give El Nuevo Cibao 5 stars if they served liquor.  The food was exceptional and the service very friendly.  The bill for two people was only $26.  I nearly full out of my chair.\n\nI had previously strolled down Smith Street and came across El Nuevo Cibao.  I looked in, but dismissed it because there didn't appear to be anything special sitting on anyone's plate.  A few Sundays ago, my boyfriend and I were looking for a place to eat, I used my nitfy Yelp iPhone app and decided on Cibao.  I'm incredibly glad I did.\n\nWe arrived shortly after 6pm and in a matter of 10 minutes the entire restaurant was packed, literally every table seat was taken.  He and I were also the only non-native Spanish speakers in the restaurant -- this should be evidence enough.  \n\nThe food was wonderful.  Like great authentic homecooked -- no skimping on the flavors and portions -- the type of dinner you spend an entire Sunday afternoon preparing.  I had the Pernil with Yellow Rice and Beans and Maduros.  Exceptional.  The pork was moist and flavorful.  The beans... dear goodness, very tasty and the blended nicely with the rice.  My boyfriend had the Pork Belly Mufungo.  He liked it, but was definitely stealing bites of my roast pork.  \n\nAn excellent choice for great food that tastes homemade.", "author": "Tanisha C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-18", "description": "I wanted to like this place because I've been looking for my go to latin place as Tio Pio closed down due to a fire.. but from the MOMENT I stepped in I had nothing but a sub par experience.\n\nI walked in and waited for about 5 minutes to be seated even after asking two different waitresses.. I eventually just sat down. While ordering, I had to grab the waitress myself to get her to give a shit about my order. \n\nI got the roast/pulled pork dish. I noticed everyone had yellow rice but for whatever reason they gave me white rice. Wtf is that? Is it because I'm asian? You give me white rice?! What the **** are you trying to say? I don't know but I had the waitress send back my dish to get me yellow rice and to be honest, I don't think it would have mattered because the yellow rice was weird in itself. Rice would have a random gigantic olive that made that bite really offputting for me. The soup that came with the dish was nothing special. The pork itself.. some parts were super tender and some parts tasted like I was eating plastic.\n\nThis place was not worth walking all the way over, my money, and my time. I'll spare myself further disappointment.", "author": "Eugene K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-16", "description": "Give me one good reason to eat anywhere else but in this fine little establishment. It feels just like it should and taste even better. Can you say authentic!", "author": "Bill S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-21", "description": "Excellent food, great prices, portions and service. I came in yesterday night with a party of 7. The place was actually smaller than I expected and had mostly 2 and 4 seater tables. They start you off with a basket of warm, buttered bread. While we had different orders, let me tell you about my order-- the pernil dish with yellow rice and sweet plantains. It was on point. The pork was melt-in-your-mouth and tender, no bones and didn't have large chunks of fat on there like other places I've been to. Like someone said previously, yes, the yellow rice could have been more flavorful but I'm Asian and I'm used to white rice, so, whatever. The sweet plantains were crispy on the outside and heavenly on the inside. Our waitress was very patient with us ordering food as we were a lot of people and some of us didn't speak English. Had to take about half my dish home since the portions were huge (but I'm not complaining)!", "author": "Cathy D."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "El Nuevo Cibao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "172 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/9116xkw9nAszN39nu11SSg/ls.jpg", "@type": "Restaurant", "telephone": "+17185961501"}