{"aggregateRating": {"reviewCount": 160, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-24", "description": "The oxtail with side of sautéed vegetables for delivery was really good with big pieces of oxtails.  While I wish rice came with each order in addition to the side to mix with the sauce, the veggies were fresh with big broccoli pieces and worth the attempt to be low carb.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-04-26", "description": "Nothing special about this place at all. Rice and beans = bland, Pernil was so dry. I actually went here off the reviews of the Pernil and it just wasn't all that so the reviews are now questionable to me. No skin just fat and dry meat. There's nothing that would make me return this spot. Just save your money", "author": "Michelle O."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-12-28", "description": "Serviceable Dominican fare, at best. Those reviews containing such superlatives as \"incredible\" or \"delicious\" make me seriously wonder about some diners' frames of reference. \nTHAT being said, there's a time and place for serviceable food--give or take MOST of the time. I certainly don't expect to have the socks knocked off my feet seven days a week for every one of the three meals I take in each day. That would definitely exhaust my limited supply of superlatives. So big shout out to all those purveyors of serviceable food: you make the world safe to appreciate incredibly delicious food!\nToday though, I was reminded at just how precious reasonably decent food can be when I was served my red snapper in spicy tomato sauce. Its picture appears below, and no, this was not some Cajun, blackened variation of snapper. After eating the first half of this whole fish, the top of which looked and tasted, well, decent enough, I flipped over to the other side only to discover this burnt concoction. I tasted it, and it tasted burnt. No doubt about it. \nThe coup de grace is that they had the AUDACITY to charge me $30 for this monstrosity. After a gentle protest the manager took off 5 bucks. Which should answer the question I know you're asking, \"so well the food is not so great, how is the service?\"", "author": "vladimir r."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-07-28", "description": "Came to this spot on a Saturday Searching for Spanish flavor food. Got the arroz con pollo dish. I have to say if you are looking for latin flavor this is the place to come... the spices were on point..", "author": "Luis R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Just ordered the Pernil with sauteed vegetables for lunch. The food was delicious! They gave me enough food for three meals!\nThe delivery was quick.\nI'll definitely order from them again.", "author": "Flarican C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-15", "description": "Craving for Latin food and decided on this place fur dinner.  We nice simple but  tasteful ambiance.  We got seated shortly and were given toast.  Was good crunchy buttery toast. We almost bit full off it. \n\nOur dinner order:\nPernil mofogo- It was really good.  The sauce went perfect with the mofogo.\nOxtail stew- my dish- delish. Meat was tender and fell off the bones.  But it was a bit salty.  The sauteed mix veggies were a bit too greasy. Probably too much butter but taste good. \nPork chop with sauteed Mix veggies . Pork was tender and flavorful.  \n\nOverall service was good. We were taken care of.  Food was good and delish. No complaints but they were a bit on the salty side. The oxtail stew was a memorable one. I really enjoyed it so I would definitely go back.", "author": "Jenny G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-14", "description": "The food was tasty and affordable with friendly service. We ordered the oxtail with rice \u0026 beans and the red snapper. It was delicious, especially the red snapper. I would definitely come back and order it again. They also have fresh fruit juices. I got the passion fruit juice which was sweet, refreshing and went perfectly with my meal. I'm definitely planning to come back.", "author": "Ekene A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-26", "description": "Came to El Nuevo Cibao to order take out for dinner as I was in the nearby neighborhood. After reading the reviews, it's definitely true that they do not take credit cards, however, you could order through Yelp (Eat 24) or seamless and use your credit card that way. A little odd with that process, but bring cash if need be! Now onto the food. I ordered the pernil with maduros (sweet plaintains) and the boneless chicken chicharron. The pernil was just okay, a little dry on some parts, but maduros were great! The boneless chicken chicharron was great- full of flavor. I got this with rice and beans. The beans portion was very little so for this part, they could have included more. Other than that, I would give this place another shot.", "author": "Amy W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-12-26", "description": "Regular Spanish restaurant in Cobble Hill Carroll Gardens. I liked the food. It was um okay. Yayos in Parkslope is better. The reason why I give it one star is because of the service. \nI went the day after Christmas with my family to have dinner and the waitress was seriously terrible. It was 6 of us and she only gave us a wine bottle of tap water barely filled all of our cups half way. \nTakes our order. Food comes brings the food doesn't ask if we want anything else to drink or if we need anything else. She walked away so fast I had to call her back and tell her that we need more water and some drinks.\nOh and everyone got their food except my dad. She took his order but didn't place it  \nHonestly not a spot I would recommend to ANYONE.", "author": "Amanda C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-15", "description": "Interesting food adventure here. The prices are so affordable and great portions! Ordered way too much food but still tasted good after reheating the leftovers. Some dishes were delicious and some were decent.", "author": "Laura F."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-07", "description": "Seems I'll never find a Latino fast food joint that does not over salt, serve over cooked food or dry verduras. The magoo though, that's on point (the handful of times I tried it) unfortunately the cheese is just a pool of oil (they could drain it before plating) and the salami/longaniza are ok but could be a whole lot better. Overall a filling take out lunch spot.", "author": "Clari B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-11-16", "description": "Have had this place a few times now since they popped up on Delivery dot com. It has risen to the rank of our top Latin spot for lunch delivery as the previous place we ordered from seems to have totally fallen off the rails in terms of food quality. \n   I have been pretty happy with everything I have had so far. The baked ribs, chicken stew and Cuban sandwich. All of the lunch deals come with rice and beans (excellent beans btw) and the amount of food is quite impressive for the small 7.00 price tag. \n   The Cuban sandwich is whopping. Theres enough pork in there to make a second sandwich and the pork itself is lean and moist with lots of garlicky flavor. Not dry as in some places.  The ribs were also quite tender and had tons of flavor and the chicken stew on the bone was great. The delivery is fast considering they arent exactly around the block from us. This place is a winner.", "author": "Tory L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-20", "description": "The steak and eggs. Amazing. Chicken soup with yellow rice. AMAZING! Sweet plantains...you guessed it AMAZING. DEFINITELY will be back. Very friendly employees.", "author": "Robert J."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-04", "description": "We came here last night for a quick bite before drinks with friends. We walked in and it wasn't super busy being that it was July 4th weekend. Got a table immediately. The waitress was relatively new but friendly and accommodating. We ordered the tripe soup, Maduros, and pernil. First thing that came out was a basket of piping hot crunchy buttered bread! Yummo!! I always love places that bring you the warm bread! A for Effort! The tripe soup that came out was so tasty and good! It had chunks of tripe filed to the brim. There were also some pototoes in it. There was noticeably more tripe than potatoes. It was in a nice tomato based broth. Maduros came out not too greasy compared to other places I've had it. Sweet and gooey with a slight crispness from the caramelization. The pernil was fall off the bone yumminess. Definitely been in the oven for hours on hours end. The chicharron tasty and crunchy. Just as I like it. It came with some rice. We didn't even order much but we were so full we had to bring the rest of it home! Can't wait to have the leftovers. Cheap and good eats! What more can a girl ask for?!", "author": "Sylvia L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-01", "description": "The place has a nice environment for families, friends and couples and the spanish Dominican food in here is delicious. They didn't have potato salad which was kinda disappointing but everything else was great. For example the service was good and I guess my favorite thing to try was their toasted bread with melted butter on top. Woow their bread is extremely delicious and they give you bread like for appetizer and during your dinner which filled me up completely. Their milkshake of Mamei was just the most delicious milkshake ever!!!!!!!!!", "author": "Lissette C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-30", "description": "No matter what you are feeling like, they'll deliver! It is so fresh home made good delicious food. Pastelillos, mofongo, chicken, pork... and they have great wine... you can't go wrong!", "author": "Paloma D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-04-24", "description": "Delicious food!! We had the mondongo soup (tripe), chuleta a la parrillada with white rice and bistec al caballo with maduro. \nPrices were cheap for huge portions! \nEverything was so delicious, I had no complaints what so ever. Would highly recommend this place and will be coming back!", "author": "Jael M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2016-05-17", "description": "First time ordering from this restaurant and I will be back for more. The food was very tasteful and flavourful. I ordered mofongo, steak and eggs, sweet plantains, and lastly rice and beans. \n\nSince this was the first time ordering mofongo I was pleased with the results. It was seasoned very well and the sauce was delicious. My only complaint is that if you don't eat it while it's hot it gets hard as a rock. \n\nThe steak and eggs was covered in onions which gives it a different taste. I ate the sweet plantains with the rice because the oil taste was slightly overpowering.\n\nOverall I would eat here again.", "author": "Tamara T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-16", "description": "The veggie mofongo might be the best food I've ever eaten. \n\nThe staff was incredibly friendly. \n\nPro-tip:\n\nIf you are there with a buddy, go halvsies. You MUST order the mofongo, but if you get the pernil, for example, then you are missing out on veggies. If you order veggie mofongo, then you are missing out on pernil. \n\nMy solution: order a mofongo, and a second dish. Then, split!", "author": "Amy T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-16", "description": "Was looking for a quick spot to check out while in the area.  I found El Nuevo Cibao and looked over the menu.  I ordered the pernil and maduros and it was excellent. The portion was more than enough and I plan to take the remainder as a doggy bag.  The restaurant is small but the wait staff was great and there is a bar.", "author": "Crystal S."}], "servesCuisine": "Latin American", "priceRange": "$11-30", "name": "El Nuevo Cibao", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "172 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/9116xkw9nAszN39nu11SSg/ls.jpg", "@type": "Restaurant", "telephone": "+17185961501"}