{"aggregateRating": {"reviewCount": 18, "@type": "AggregateRating", "ratingValue": 1.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2017-09-24", "description": "If you're hungry, I guess you will eat anything, from just about anywhere.  Today was that day for me.  I went into numerous places in a 3 block radius. Some smelled of old grease, others of garbage. Newer establishments must have no climate control because the doors were eith flung open wide or shut tightly trapping heat like an incinerator. No thank you.  Subway is subway, right?  No it isn't. \nOrdered a regular turkey sandwich (beggar enters, asks me and the tuna lady for $$, stayed to see what money we pulled out?) and it was tossed together in more of a salad on bread fashion than i'd ever seen.  I even had to ask for more lettuce than the scant amount pinched initially. I paid for my sandy with points, no way was my wallet coming out in the with beggar dude and the other loiterers peering towards the other lady and I.  As for the beggar, he lingered from the time I ordered to after I paid and left.  He's prolly still there.  Cashier guy said nothing at all.  \nOk, sandwich time, yaaaayyyyy!!! No, no, no boooooooo!!!! Stale bread is not an option, except for here at 391 Jay St  other than that, the salad sandwich was edible once you got past the toughness of old bread.", "author": "Farrah B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-30", "description": "Welp, the NYC Dept. of Health shut them down today. \n\nStopped by around 1:45 \u0026 found this sign.", "author": "Jonathan K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-10-31", "description": "There's alot of places that I won't eat at on Jay st. , but this is a Subway, how hard can it be to **** up a sandwich? I learned that you can, quite easily. \n\nOne night, on my way to college, I decided to stop and grab a footlong something-something. I asked for Italian herbs \u0026 cheese bread. They opened up the oven and a school of flies came out, buzzing in every direction. Since the sandwich was on special at $3.99, I swallowed my pride and pressed forward :( . After heating my sandwich, I asked for veggies and whatnot on it. They squirted some orange sauce and lots of watery vinegar onto my sandwich, to kill the germs from the flies in the oven, I like the way they think, always one step ahead of the customer, commendable. In their last act of defilement, the lady making my sandwich picks up the dirtiest, slimiest, knife, covered in every fluid imaginable, and lays it flat in between my sandwich. She closes the bread tightly, and wipes the blade in one fell swoop, front to back. The blade comes out the other end clean as a whistle, all the gunk that was on it is now in my sandwich. \n\nI normally don't get mad, but I literally run to the other end of the store and yell for the manager to come out. I tell him exactly what happened. He pretends not to speak english, but quickly breaks out of \"character\" and speaks adequate english when another customer pulls out money to buy a bottled drink (smart man, they can't fuck up bottled drinks, yet.....) . I leave the store, making sure to open the door wider than usual to free the poor flies from the bad food there. \n\nYou can't make hamburgers out of **** a wise man once told me, but yo,  they ain't say nothing about sandwiches! The people who work here have taken this to heart. Eat here at your own peril.", "author": "Josh S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-10", "description": "They don't take customers in the order that they're waiting on the line. If you're not white, good luck. Get expected to be treated like a second class customer!", "author": "S S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-12-16", "description": "Not the most spacious Subway but we stopped here solely on account of some hungry kids...so it did the trick. The kids seemed to enjoy their food just fine and the staff were patient as they waited on 5 kids to decide what they wanted to eat and how to have it made.\n\nIt was 8pm on a Sunday and not very busy in there. They didn't seem to mind a group of young teens who seemed to be loitering but the teens didn't bother us so it's all good.\n\nIf 5 kids were happy, then we were happy. I didn't have anything to eat myself and, thus, don't have have a more extensive review to offer. Pricing was on par with other Subway stores around the city.", "author": "Godley V."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-09-12", "description": "This subways has made me so mad on so many occasions. From now on, I go to the Subway in Court Street. The reason why I don't like the Jay Street Subway: \n1. the employees are stingy. Ask for lettuce and they will put less than 1 cm thick lettuce layer. \n2. most of the people in the store aren't customers. they are homeless vagrants who bother me and ask me for change. most sit in the seats so actual paying customers, like myself and everyone else, have to go somewhere else to sit. \n3. the salads are more expensive than $7 but the portion size is less than the value. \n4. the sandwiches in this subway is 0.67 more expensive than the sandwich at the Court Street subways.", "author": "James D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-09-22", "description": "Very sad excuse for a chain resturant. \nThe line was so long that I was on a \"secondary\" line and I had to call out my order in a very loud voice, so everyone knew I was getting a honey-oat Buffalo Chicken footlong. It tasted disgusting btw. \nThere was no spinach and lettuce. \nMy sandwich only had lettuce and tomato. \nI'm not coming here again. \nBecause I used the previous free-cookie receipt for this order, they did not want to give me a receipt for the current order.\nI love how they do business here.", "author": "Ilene E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-21", "description": "I hardly eat at Subway, but, on this particular day, I was about to get on the F train to Manhattan and I was starving. So, I went into this Subway to get a veggie-patty foot long.\n\nFirst of all, this place is filthy. Fingerprints, dirt, dust, etc. everywhere. All of their condiment bottles were disgusting, their meat bins looked greasy and grimey...like they've never been changed out. Their veggies were far from \"fresh\". \n\nSecond of all, the people who work here are equivalently nasty, AND RUDE. For some reason, the man WOULD NOT listen to me when I told him my order. I said \"Italian herbs and cheese bread\" and he tried to give me just white Italian bread. I tried to tell him that I wanted it \"toasted\" and he started putting lettuce and condiments on without toasting it. I, finally, had to tell him to listen to me when I am placing my order - for starters. \n\nLastly, there were cookies just thrown on the counter, nothing stocked, out of several condiments, cheese was dried up around the edges, and I'm pretty sure I was overcharged AND not given the right change back. \n\nEat at your own risk!! Never again!!", "author": "Jenn H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-18", "description": "I will never come here again and I suggest you don't either! Very dirty, the glass looks like it hasn't been cleaned since 1918. Tables are not wiped down and the staff (at least on the day I was there) was not sanitary. I saw the man make a sandwich with one gloved hand and one un-gloved hand and then ring up the customer. Handle the money with both hands then grab a new loaf of bread without ever changing gloves. I walked in Aprox 4:30pm and who knows if he ever changed them!? Nope. Not happening. \n\nPlease don't eat here.", "author": "Mike T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-10-17", "description": "Subway, Eat fresh. Die waiting.\n\nMetrotech area is littered with places to eat and multiple Subway's around the area. Why does this one seem to always be packed beyond belief? Luckily for me I grab lunch before the rush and the lines don't get too bad until around 12:30. I've been here at around 1:30 and the line was outside the door. \n\nThis place runs really fast which makes up for the ridonkulous line. Nothing special about it but then again whenever is a Subways really.. special? If there was anything I had to complain about is that they don't seem to wipe their knife often after cutting the previous person's sandwich. Why is it a problem? I hate mayo and if the person in front of me got his sandwich with mayo, I'd have a pleasant smear on my sandwich like someone wiped their butt with it (who poops white?!?).", "author": "Eugene K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-01-14", "description": "The employees are so rude especially the chubby guy. he is soooooo f\u0026*king rude! seriously wtf is his problem!\n\nreason why i hate this place:\n\n- keep customers are kept waiting because one guy is making sandwiches and the others are chilling.\n- They in a rush and make your sandwich sloppy.\n- sometimes they put the wrong things into the sandwich topping \n- they are so rude!", "author": "Nora A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2010-03-06", "description": "On my restful non-work day filled with Canto and Mandarin of a classroom setting along with origami workshop to produce lanterns of Chinese red envelopes and tassels, I needed a facility break before continuing on the A train going home.  With a good friend and fellow language enthusiast to travel the long-haul commute home as our routes meet half-way at the southeastern part of Queens via Brooklyn.  \n\nMy friend suggested this Subway restaurant for facilities usage, which crossing my fingers for one available and functional regardless of cleaniness.  This Subway sits directly opposite the Jay Street Station of the A and C line in Brooklyn Heights.", "author": "Tina C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-12-11", "description": "I ate at the subway on jay st the one next door to dunkin donuts ,I had the breakfast sandwich on flatbread I ate steak egg and cheese with sweet peppers lettuce and tomato,the steak look like chopped up dog food they put the sand which  in the microwave it was still cold ,the way they advertise the sandwich they make it look so good but it's so nasty", "author": "Monique B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-03", "description": "I believe this place closed down and rightfully so. The prices felt all wrong, the meat looked like it was there for a very long time and some of the employees were very rude. The lines were huge because they worked really slow.", "author": "Aleksandr S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-06", "description": "This subway has flies everywhere and the food is always scattered outside their bins. The veggies do not look fresh at all and the bread is stale. Not to mention the gentlemen that work there are kind of rude and pervy... Not sure if I just caught them on a bad day - but it was a saturday afternoon after all! Wouldn't expect them to be so sloppy!", "author": "Alice L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-03-11", "description": "Holy Jesus! A functional Subway! This is about as rare as a functional Duane Reade...wait, who am I kidding with that one?\n\nWhen I'm looking for something simple (read: when I'm too lazy to find anything else during my lunchour from work), I head over to the Subway a few blocks away. I have had a fully functional experience every. time. I've. walked. in. there. and I'm STILL in disbelief.\n\nNo repeating what you've said a dozen times (\"foot long turkey on wheat with provolone...no, turkey...yes, wheat bread...no, I said turkey! No, I don't want american cheese, I want provolone...no! TURKEY! Good god!\").\n\nNo burning of the bread while it's toasted. No randomly jumping or diving prices even though you order the same thing every time *cough* Columbus Circle Subway *cough*.\n\nIt's just...reliable. I really can't believe it.", "author": "Shea D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-03-15", "description": "Worst subway i have been to. The food looked old and were all mixed together. The employees were in la la land and looked like they did not want to be there. You tell them you want one thing and they do another.  Customer service was horrible. They need to be re-trained, taught how to listen to the customer when they are ordering and how to clean their work area.", "author": "Mar M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-17", "description": "i go there usually after class, but one day i was there eating and i see a fucking huge rat just pass by..", "author": "Evelina S."}], "servesCuisine": "Sandwiches", "priceRange": "Under $10", "name": "Subway", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "391 Jay St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media3.fl.yelpcdn.com/bphoto/3dSX84oCKIaUIG8UE7jHqQ/ls.jpg", "@type": "Restaurant", "telephone": "+17188522226"}