{"aggregateRating": {"reviewCount": 122, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-06-07", "description": "Prices are unbeatable, and the portions are unreal...We bought an arroz con pollo platter for around $8 I believe, and it lasted 2 people two meals ... crazy! Granted, we were eating other things on the side, but still. We also ordered the grilled cheese. Unexpectedly was on sub bread, and just had melted cheese in the middle, but was strangely so good and addictive. Wish I had some of that right now..", "author": "D L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-28", "description": "My favorite Dominican spot in the neighborhood - breakfast lunch or dinner. And to top it off you really can't beat their prices.  I have never had a bad meal from here and delivery time is very reasonable.", "author": "Josephine L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-29", "description": "Omg. Thank you Diana!!! A hidden gem!!!  This is my new favorite place in cobble hill for lunch. I will tell everyone about it. I'm about to order right now for dinner !!", "author": "Anthony F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-04", "description": "I'll never eat from here again. I ordered takeout about 4PM... not too late so food should of still been fresh. I ordered pepper steak, yellow rice with beans and sweet fried plantains. The best thing was sweet fried plantains. The rice was well just rice. The beans didn't have any taste very bland. The worst of the worst from any Spanish restaurant I had ate at was the pepper steak. It was very under cooked, nothing but tough gristle, it was so unbearable it wasn't edible just so I didn't waste my money I made my own chicken to go with the plain yellow rice and bland beans. NEVER again.. I mean never again. If you plan on going or ordering from here don't.. There another Spanish restaurant a block or 2-3 blocks down. They are about 3 bucks extra to your order but at least your getting good quality food. That's what I get for going the cheap route.", "author": "Latoya T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-12-08", "description": "If I'm ever craving for a real deal Dominican food, this is most definitely my it spot!! My best friend and I generally go here and this is how we usually meet up.\n\nDinner on a Friday Night with my Bestfriend:\n\nNga: Hey, wanna hang out tonight?\nRalph: Sure, what do you have in mind?\nNga: Dinner at ENP\nRalph: Okay\n______\nNga: Hi, I would like to order the grill chicken with extra onion and I would like rice and beans and salad on the side ($9.50)\nRalph: And I would like the pepper steak with yellow plantains and salad on the side. ($10.00)\nWaitress: Would you like anything to drink?\nRalph: Actually yes, I would like a coke please ($1.25)\n_______\nNga: Mmmmm....dude, the food is GOOOOOD, don't you think?\nRalph: Nomnomnomnom\nNga: :)\n_______\n30 minutes later\nRalph: Excuse me, check please.\nWaitress: (hands over the check) thank you\nNga: Dang dude, this is why I love eating with you, this place is always so cheap! \n_______\n\nTotal with Tip: $25 \nDinner with my best friend: PRICELESS\n\nhttp://www.menupages.com/restaurants/el-nuevo-portal/menu", "author": "Nga C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-06", "description": "The only reason why it gets one star was because of the service . I order take out the chicharon de pollo was good ,the pernil was half cooked .. With a lot of red spotting . They gave me the WRONG RICE. I called them 2 times to make sure they got my order right and they still got it wrong , I called and told them \"hey can I get the rice I asked for  , I haven't touched this rice \" Instead of them being curdiest  and saying ok . The lady screamed at me over the phone and spoke to me very inappropriately . I immediately hung up the phone . The food is ok but these people have no class and need to be trained for customer service .. Would only recommend this place if the had better and well trained staff  to not treat paying customers like that .", "author": "Angelo S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-02-06", "description": "Definitely the better of the two options on Smith Street for Dominican food. It's amazing it still pumps out great food and cheap prices with the almost entirely completed gentrification of the surrounding Boerum Hill/Gowanus/Carroll Gardens/Cobble Hill/South Brooklyn/Whatever neighborhoods. There still is a large service population in the neighborhood and the nearby Gowanus Houses contains a majority Dominican and Puerto Rican contingent.\n\nThe food here does not disappoint. Their lunch special runs about $8-10 and it has a side rice and beans, your choice of protein, and another side. I go with tostones, or the fried plantains. \n\nGreat, great service and phenomenal price point for all budgets.", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-09-15", "description": "Best Cuban sandwich I've ever had.  It's a deal for the money too.  Staff is very pleasant as well.", "author": "John W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-24", "description": "Love this place. Spanish food is deliciousssssssss, tasteful, Mmm good. I could keep going. My favorite plate is white rice, black beans with a juicy fried pork chops.", "author": "Irene R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-06-06", "description": "All I have to say.....very good Comida!! \nYou can't go wrong w/ chicken, white rice, black beans, \u0026 maduros!!\nTrust that it is traditional in the way were you aren't rushed, and it may take them sometime to get to you...but its definitely worth it.\n\nMy long time favorite spot closed years ago, and now I found an adequate replacement. Yay!", "author": "Ebony C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-08", "description": "Still love them because their sandwiches are tasty and I prefer supporting small business over chains, but - if you order around prime lunch / dinner time - expect to wait at least an hour for delivery although the quoted delivery time is 30-45 minutes.", "author": "Michelle R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-12-20", "description": "This place is the perfect example that you can't judge a book by its cover. Compared  to the other restaurants on Smith street with their fancy storefronts, this place is pretty easy to pass by. However, they have some of the best, most authentic food you'll find on Smith.\n\nI grew up in Carroll Gardens and this place has been here for as long as I can remember, with the same people working there. They have perfected just about everything I can imagine from their rice and beans to perfectly tender pernil. Be sure to check out their cuban sandwich, it rivals its fancier counterpart in the cubana cafe. \n\nThis place is definitely better for take out as eating there can feel kind of cramped, but either way, amazing Spanish food for super affordable prices.", "author": "Soey J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-23", "description": "I always support this place, we order once a week. Tonight, not being too hungry I ordered guacamole and chips. What arrived was a disgrace, a tablespoon of brown guacamole LOADED with lemon juice, and about 10 chips covering the disgraceful guacamole. I always loved this place for its freshness and hearty portions. $7 for a tablespoon of guac = I've moved on from Nuevo Portal.", "author": "Jackson C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-05-20", "description": "I went there with my wife for the first time we both ordered the fried fish with rice and beans upon eating the first my mouth started to tingle very strange I ate my fish because I hadn't eaten all day my wife ate one little piece and left it needless to say bearly made it home once home I spent half the night on the bowl I will never ever eat in that place again disgusting", "author": "Oscar R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-29", "description": "Awesome, amazing \u0026 the Best Spanish/Dominican Food in the neighborhood! :)", "author": "Rizwan A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-19", "description": "The food in this place is slamming never ate there but I do order from them there breaded steak off the hook there pastelitos  de queso off the hook very nice when I order food always comes to me hot", "author": "Jason P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-08", "description": "This place rocks street cred! It didn't try and go fancy like Cibao. Old school and dirt cheap. Love this place! Cibao got all fancy and not good.", "author": "Hank M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-05", "description": "You will NEVER find another restaurant that serves better Spanish cuisine like this place. I highly recommend the grilled/fried pork chops, fried chicken pieces with the bones in, or pepper steak.  ALWAYS yellow rice (it will knock you off your chair delicious). I have been a faithful customer for over 6 years. I have never been disappointed.", "author": "Fay H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-07", "description": "El Nuevo Portal has been around since I lived in Carroll Gardens and I moved out in 1995. Smith Street was lined with lots of Dominican restaurants. I continued ordering from here even when I moved to Red Hook but I moved away in 2002 BUT every time I ask my kids if they want Spanish food they all say YES. My daughter just took the 20 minute drive with my son's girlfriend and we are getting our usual. Chicken cutlet with yellow rice and beans x 2, beef stew with yellow rice and beans x 2, ripe plantains, french fries, pastellilos. My only regret is that I didn't read the reviews before ordering. I kinda wanna try the Cuban sandwich and the chicken with rice and oh yes the grilled cheese. I would order more often if they delivered all the way to this end of Brooklyn. The only reason that I don't give 5 stars is that the staff is always rushed and mistakes can be made when placing a phone order due to the language barrier.", "author": "Luisa R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-24", "description": "It may be a hole in the wall, but the food is delicious and great low prices for a downtown brooklyn spot. I always come here for lunch and dinner and never left disappointed.", "author": "Chris H."}], "servesCuisine": "Latin American", "priceRange": "Under $10", "name": "El Nuevo Portal", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "217 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/j1mBiMKHDCUAeZJrCmUkYA/ls.jpg", "@type": "Restaurant", "telephone": "+17182461416"}