{"aggregateRating": {"reviewCount": 122, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-25", "description": "Been here three times. We always eat in and order the same thing- pork chop and Cuban sandwich. Delicious!! The portions are massive and it's really cheap.. Don't each too much of the paninid butter bread they start you with, save your appetite for the real meal.", "author": "J P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-21", "description": "great foood for a great price be ready to eat they serve alot of food...  the food is very homemade not to salty properly seasoned.. i enjoy the food and service was on point!!", "author": "Felipe P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-15", "description": "Yesterday, I walked in, and I ordered a Cuban sandwich.  Pickle, mayonnaise, ham, and pernil (roast pork)...all pressed in an European French press.  Hot and heavy with meat selections, it arrived on my table, sitting there occupying my entire plate.  Not that I'm complaining.  In fact, I am rather pleased.  Although I was only able to finish half of it, lucky me---the other half became lunch today.  My hubby decided on the arroz con chorizo (rice with sausage), and it was such a great portion!  The yellow saffron rice was so flavorful and rich.  There were spices inside and bits of olives and random herbs.  It was heavenly.  I recommend this restaurant should you find yourself walking on Smith Street and have a hankering for comfort food.  The place has about 6 tables and some stools in the front.  It may get packed around certain times of day.  When I came in around 5:30 pm, it was not too crowded.  After I finished my meal, the restaurant was full of patrons waiting for a delicious home cooked meal.", "author": "Polly H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-12-01", "description": "Super reasonably priced and good food for this neighborhood. Quick delivery. My favorite are the $7 lunch specials that exist all day. Ask what they have when you call. The usual staples are baked chicken, stewed chicken, stewed beef, and pork shoulder (pollo al horno, pollo guisado, carne guisada, y pernil). Rice and beans are great, as is the pollo guisado and pernil. Good morir soñando too!  Cash only!", "author": "Lauren P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-01", "description": "This is one of those places that you would think twice about going in because of exterior, but once you do you will be amazed. The food is great, and I went back again just to try to other dishes they have available. Each dish is a huge portion, so go with friends and eat tapas style to try it all!", "author": "Roy G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2010-12-21", "description": "Another great, old-school, traditional eatery on Smith Street.  My go-to dish here, like at El Cibao, is arroz con pollo.  The interior has been recently remodeled so it's a lot cleaner and nicer than Cibao's.  But I guess you lose some of the hole in the wall charm.\n\nThere's also a jukebox and TV.  The employees are quick and courteous \nand this place is my go-to take-out in the immediate area.\n\nPrices range from 8 to 15 bucks and I think that's very reasonable when you consider the giant portions.  I'll return as always!  Mmmmm.", "author": "Victor S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-01-03", "description": "you are delicious. you are on my street. you are now my new best friend.\n\npretty standard spanish food done really right. cheap? check. tasty? check. fatty pernil? double check. \n\ngiant heaps of rice and beans, plantains galore, and meat thats just done oh so right. (on top of the pernil, we also had chicken stew and porkchops - all good things.)  \n\ni will be back!", "author": "Crys Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-12", "description": "The French Shrimp is shrimp and eggs.  Amazingly good food and good portion size.  Cash only establishment.", "author": "Jennifer C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-12-29", "description": "I've been eating here for years and I never get tired of it. It's like the only authentic Spanish restaurant in Carroll gardens. The food is really tasty and in pretty big portions. I get the always alternate between the steak with onions with rice and fried pork chops with rice. The steak is flavorful and juicy and the pork chops are fried to perfection. The only reason I give them four stars and not five is because I always order out and sometimes I'm waiting almost an hour for my food. They get a lot of deliveries so I understand. Always order ahead of time like if your walking home or just not starving and can wait. The waitresses have been there for years so after a while they remember your order which is sweet and makes you feel at home. Over all this place is a gem and definitely worth eating.", "author": "Angelique C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-04-11", "description": "been here twice in the same month with a friend...we are both fans of this place as the staff is friendly and attentive and will customize your meal within reason to match your tastes!!!\nmy buddy is a big chicharones fan and they do it RIGHT here...nice thick chopped chunks of fried pork belly . he had salad and maduros as his sides and DIET PEPSI( lmao)\nI the first time had the rotisserie chicken with tostones and salad...and on return visit the stewed chicken with tostones and salad..\nbothe meals were delicious and flavorful and when you are with a friend(s) you can share and still have another meal each to take home.\nprices are very low and reasonable...\ncome on in and enjoy some delisioso latin food!!", "author": "Chino P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-07-15", "description": "This is the old Brooklyn that I used to love. Inexpensive family style delicious Domincan food (or Puerto Rican, in this case Dominican). You get this huge arroz con pollo plate for around 7 bucks and the yellow rice is fluffy and so flavorful. It's enough food for both of us to eat twice no problem. I am sick and just ordered the large chicken soup and had a side of rice. Chicken falling off the bone, perfect consistency carrots and onions and potatoes. Like your Dominican mother would make. Que rico.", "author": "Chauncey Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-05", "description": "The food was very tasty and the portions were unexpectedly large.  Unfortunately the service was not up to par. The meals came out in parts and at different times affecting the enjoyment of it all.", "author": "Lucy A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-04", "description": "I love this place..it's an hour drive for me but I don't care..their food is great..top it off with cafe con leche and home made flan..when I leave I'm as happy as a baby..", "author": "M E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-15", "description": "The food is basic as far as I can tell I am a white guy who might not know the difference between good local spanish food and bad.\n\n The girls who work there, awesome! The two younger girls that work there are worth the visit. My god. If you have seen them and are a straight man then you know what I'm talking about.\n\nCheers!", "author": "Frank S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-07-23", "description": "- very tasty food\n- huge portions\n- low price\n\nThe combination of these 3 qualities is a 5 star review.", "author": "Roel M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-04-22", "description": "My coworker suggested this place because I was looking for a meal that would provide me with more than enough food to last me for lunch and dinner. This place was it! for around $8.50 i was able to get a whole plate of chicken chunks, a separate plate of yellow rice and a side of beans in a bowl. Eating it fresh tasted better than letting it sit around till i was hungry again but thats the price you pay for leftovers. \n\nThe food tasted okay. There was a lot so I ended up having some leftover for the next day also. Even though I didn't want it anymore then. \n\nI'll probably stick to ordering snacks from there like plantains or something and leave the real meals up to another place.", "author": "Devon M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-06-10", "description": "Smith Street is endlessly crowded with restaurants of all stripes. They're usually showy and often gimmicky. But El Nuevo Portal is a quintessential hole in the wall. It's a genuine, homey Spanish spot--insistently good, wholesome, and best of all, inexpensive. A Cuban sandwich from Portal is almost indescribably good. Get rice and beans too. Have a beer while you're at it.", "author": "Joseph M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-08", "description": "Fried pork chop and scrambled eggs so delicious. Really delicious affordable spanish food.", "author": "Jocelynne R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-15", "description": "I really like the food at this place, and have been ordering their take-out for years, but this weekend they committed a mortal sin in customer service. I ordered three dishes, including a mofongo. When I got home and unpacked the food, I realized that they had forgotten to pack the sauce for the mofongo. I called them immediately to alert them, thinking that they would apologize and offer to deliver one to me right away. Instead, the woman who answered the phone kept me on hold while she took several orders, and returned only to insist that they had packed the sauce. When I told her that I did not have time to argue with her about it, she said \"ok bye\", and hung up the phone. Today, my husband, who is as patient as a saint, went by to request the sauce, so we could eat our now day-old mofongo. The lady at the counter gave him a dirty look and said \"you know, we charged you $3 too little for that mofongo\" to which my husband responded \"is that why you did not send the sauce?\" She then proceeded to tell him how rude I was to her on the phone, to which he responded \"that is because you kept insisting that you sent the sauce... \" Finally, a gentleman behind the counter was kind enough to hand my husband the sauce. So sorry that I will not be able to patronize this establishment anymore. Customer service is dead...", "author": "Lizzette M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2007-02-08", "description": "Panchita reviewed the wrong restaurant, as Robert T. mentions. El Nuevo Portal is a traditional Spanish eatery along the lines of other culturally adjacent cuisines such as Cuban. For lunch yesterday, I went to La Taza de Oro in Chelsea, where I got the beef stew, black beans and yellow rice. For dinner then, I went to El Nuevo Portal for the first time -- it's been on my list for awhile.\n\nAt El Nuevo Portal, I got the chicken stew, black beans and yellow rice, as well as an orange soda. I just love this stuff. The beans and rice were flavorful and plentiful -- you could order just the beans and rice and be fine -- and the chicken stew was savory. I'd have preferred it if the chicken had been deboned some, as some of the dish was a challenge to eat.\n\nAlthough the decor is bare bones simple, there's a lot going on. There's a lively Spanish speaking gathering at the counter near the entryway. Lots of people come and go for takeout. The jukebox has legitimate Spanish music in it -- and the TV is tuned into a Spanish language station airing soap operas and comedies.\n\nI'll be sure to eat here again.", "author": "Heath R."}], "servesCuisine": "Latin American", "priceRange": "Under $10", "name": "El Nuevo Portal", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "217 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/j1mBiMKHDCUAeZJrCmUkYA/ls.jpg", "@type": "Restaurant", "telephone": "+17182461416"}