{"aggregateRating": {"reviewCount": 122, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-12", "description": "Ordered lunch from here. Got the Chimichurri sandwich which really didnt taste much like Chimichurri at all. Just tasted like a regular steak sandwich. Not terrible but not what I expected. Meat was tasty but the sandwich had too much mayo and mixing with the tomatoes it got pretty sloppy. Bread was nice and crisp on the exterior though. Go a side of Yellow Plantains and they were pretty good. Flan was pretty tasteless, my coworker said it tasted like the cup and yes a piece of Flan in a paper coffee cup is a rather odd sight. \n    Overall took a bit for delivery but being in Red Hook everything takes long, I would give them another shot when the Latin craving hits again.", "author": "Tory L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-11", "description": "If you're wanting some great Spanish food, this is the place to go. Not only is the food amazing. I've had the Cuban, the flan, the alcapurrias and empañadas all AMAZING. The price is reasonable for Cobble Hill/ Carrol Gardens area. And let me not forget the outstanding customer service, they make you feel right at home. Love it!", "author": "yolanda c."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-18", "description": "This is hands down my favorite Spanish restaurant. The price is not expensive at all and the portion size is great! my husband and I refuse to order from any other restaurants.we have ordered multiple dishes and have never been disappointed. We will definitely recommend this place to anyone we knowm.", "author": "Ambika B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-25", "description": "Great food that never disappoints. The steak was grilled well and my 4 year old approves it. I'd say check it out if you're in the neighborhood.", "author": "Nathline C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-23", "description": "I just happen to drop a client off cross the street I took a look in smelled the food and that was it, I ordered some food amazing!!!!!!!!! I will definitely come back here again and I live in New Rochelle. The trip is worth it.", "author": "Rodolfo G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-08-30", "description": "Their Dominican breakfast is delicious! And had the bistec empanizado sandwich and that was good. So yea, I'm a fan :)", "author": "Veronica R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-10", "description": "This place isn't bad at all. They usually take forever with a delivery but today they were pretty quick.  I like them becuase its super cheap good spanish food.   I got the fried eggs with potatoes for breakfast and I also ordered a side of grilled chicken.  I need my protein.  The coffee is always super strong-AMEN.   The food is a little greesy so you need to make sure you tell them to be light on everything like the butter and olive oil because if not you can feel the heart attack with each bit. \nOver all good cheap and tasty.", "author": "Guido T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-10-10", "description": "What can I say it is typical classic Dominican Restaurant. Big portions of food which is quite tasteful I must say. Like they say the hole in the wall spots are usually the best ones to go to.", "author": "Ronel A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-19", "description": "Easily the best Dominican food I've had from Manhattan to Long Island! We went there for lunch today and I had the fried chicken chunks with the bone in, yellow rice and platano maduros. My husband had the beef stew. Everything was so flavorful and delicious! I'm so glad I found this place and I can't wait to go back!!", "author": "Cortnie G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-02", "description": "I wanted to update my review to all the \" new residents\" THIS IS NOT A CUBAN RESTAURANT, not all latinos are the same, not all food you call \"Spanish \" is the same, I'm a white hispanic and I was shaking my head when I read some of the reviews saying they didn't like the Cuban sandwich here, HELLO! The only reason they make it is because the rich, artsy know better than us types have moved in. This is Dominican Food, pernil,chuleas fritas, tostones, and a presidente frío,", "author": "bill l."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-01-30", "description": "Honest to God bang on with my mom's cooking. This is real Dominican food as it gets. I am very happy that I found a Dominican spot around my workplace. Their portions are on par with like if you were being served at home. 10/10 would return again.", "author": "Wilson G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-07-07", "description": "I love this grub. Its super authentic, good portions, quick service and cheap! I highly recommend coming here for breakfast, lunch or dinner", "author": "Jimmy F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-11-20", "description": "Grilled pork chops delivered to your door, served with a wedge of lemon and lime.  I don't quite know what they use for seasoning but they were tender, juicy, and tasty as hell.  At one point I found myself gnawing at the meat closest to the bone like a rabbid dog.  I'm already thinking about when to order them again.", "author": "James D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-01-18", "description": "I love this place. Their filete a la parilla or en salsa is excellent. Me and my coworkers always band together on Sundays (yes open on Sundays...yay!) and order a ton of food because we are hungry and sad that we are stuck at work on a weekend. Their beans aren't the best but the fish makes up for it entirely!\n\nThey deliver fast except that one time where they couldn't find the office but after we guided the bike dude on the phone to our building, he now has our address embedded in his memory! \n\nThe only thing is that they are a bit overpriced compared to other Puerto Rican/Dominican spots. Maybe because they have more awesomeness packed into their food. Wow...Yelp did not correct awesomeness. Did not know that was a word....\n\nAnyways! If you do eat there at the actual restaurant be prepared for a wait. It's pretty small and when I went it was busy and they had one lady doing tables and taking orders on the phone AND doing the counter. Damn! But yes eat this food!", "author": "Cynthia G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-26", "description": "This place is just okay. Food isn't anything special. Nothing compared to my mom's cooking or other Dominican restaurants I've been to. Yellow rice was bland, bistec encebollado was good but nothing great, maduros were hard and not sweet and soft. Lemonade was great. Chicharron de pollo tasted okay but too hard and dry. Could have had better flavor. \n\nWould not come back. Better places out there.", "author": "Jax J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-07-25", "description": "This place is great l.  Nice people and really good value.  Had grilled pork chips which come w 2 sides and Cuban sandwich.  Both were top notch.  Will def be back.", "author": "Kyle K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-16", "description": "I \"once\" ate food from here 6 days in a row.  An by \"once\", I really mean many times but don't want to come off like I have an addiction problem. \n\nThe portions are huge. Beware.", "author": "Jia L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-12", "description": "I had the opportunity to come and eat breakfast here before work. I have to admit, It was very enjoyable and the food was very well cooked. It may look like any other spanish restaurant, but the food was great!\n\nThe thing that stood out the most was the Chicharron... I mean...\n\nWow. \n\n'Twas delicious, indeed.\n\nI'm definately coming back for more food when I get the chance!", "author": "Jorge C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-09-10", "description": "Went out of my way to pay this place a visit. I got some pork chicharrones (fried pork) w/ rice \u0026 beans and it was soooo good. Can't wait to try their fried chicken chunks next and compare them to Cibao's. They also serve wine now- Progress!\n\nService was fast and friendly too.", "author": "Ro C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-28", "description": "My favorite Spanish restaurant under $20 if you order the lunch special all together in one plate for $8 if you order separate it's $1 extra yummy\"", "author": "Joey L."}], "servesCuisine": "Latin American", "priceRange": "Under $10", "name": "El Nuevo Portal", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "217 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/j1mBiMKHDCUAeZJrCmUkYA/ls.jpg", "@type": "Restaurant", "telephone": "+17182461416"}