{"aggregateRating": {"reviewCount": 122, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-05-24", "description": "The fried pork chops was fantastic. \nI definitely recommend that everyone should try this.", "author": "Fitzroy B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-15", "description": "We've been ordering chicken stew for the office for a while.  The dish is a braised chicken with carrot and potato dish with gravy.  For the past couple deliveries, we noticed the gravy spilt out everywhere and the container crushed.  Not to mention long delivery time of around 45 minutes to an hour even though we are about a 10 minute walking distance.\n\nIt's upsetting since we've been ordering for the office for a long time and we're going to discontinue our business for the future due to the recent change in quality.", "author": "John C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-10", "description": "My husband and I were looking for a place to eat and stumbled upon this gem. Decor is pretty standard but the food is amazing. I had the bbq chicken with plantains and my husband had the octopus with rice and beans. It was fantastic. They give you lots of buttered bread before the meal..so GOOD. Waitress was friendly and service was excellent. Will definitely be back!", "author": "Milka A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-25", "description": "I used to eat here all the time the quality has definitely gone down. The pastellios were incredibly dry, I also bit a piece of bone that was in it. The rice was mushy, and the red beans taste like it was in ketchup. Poor excuse for Spanish food.", "author": "Natalia C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-15", "description": "Food was ordered and paid online for delivery. Despite having an email confirmation showing it was paid for the delivery guy said it was a cash order. The woman at the restaurant said if I wanted my food I needed to give them cash. Sent the food back. Not going to waste my time here anymore.", "author": "Ken K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-08", "description": "Food is great here.  Favorite is the Stewed chicken here.  Saucy, tender flavorful chicken with potatoes and comes with rice and beans on the side.  Great that they packaged it separately.   Good portion at a decent price for the area.\n\nUnfortunately, the delivery people probably stacked alot of weight on top because a lot of times, the aluminum container with the plastic top gets crushed spilling all the sauce all over the place.", "author": "John Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-28", "description": "My go to for a taste of mom's cooking. Of course my mom's is better but it's as close as I can get. The staff is attentive and they remember your likes and dislikes. And I even get to order off the menu if it's reasonable.", "author": "Sara P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-02-06", "description": "The prices they tell you don't reflect the price you pay \nWhen I called back to ask the lady was very nasty\n so I paid more then I should have and on top of that my order was wrong. Definitely my last time coming here", "author": "Roxanne S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-03-28", "description": "Stay away from this place. Been going here for almost two years and will never return. The younger waitress who usually works the evening shift has a MAJOR attitude problem. She will literally walk away from you while you're talking/still trying to order. She brought over the plantains and said \"They're a little cold, sorry.\" And just walked away. She could've easily heated those up but she was too lazy. She forgot both of our drink orders. She never checked on us at all. Our steak sandwich had meat on only half of it. This place is an embarrassment. On top of all that they overcharged us on the bill and claimed it was because of their credit card machine. This is before they even knew if we were using cash or a card. Do not go here! I never write reviews and I am a very patient person but this was ridiculous.", "author": "Miranda S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-22", "description": "Absolutely delicious and savory! I had the eggs with dominican salami, home fries, toast and fried cheese, thats right, I said fried cheese!!!! I cant wait to have wherever other dish they make.", "author": "Michelle B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "Had to try this place. My lady and her family order here all the time and her pictures looked amazing!! Wanted to try something new this morning so I figure I would try them out. Saw great reviews on the mongu (not sure of spelling) but it was great!! Very hearty breakfast and even more leftovers. Defiantly will be returning.", "author": "Ty M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-08", "description": "I went here n used my brand new debit card(first n only place I used this card with) n right away was a victim of fraud... someone was able to take out money out of my card n if it wasn't for capitol one they would've continued to take money out.... if u want to go here don't risk it use cash!!!!!! The bank will investigate but this is foul!!!!! Been going here since a kid smfh", "author": "Mike R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-27", "description": "This restaurant used to be my family's all time favorite. I would order from this restaurant at least 3x a week and it's now to a point where I don't even order from them. Throughout the years, and change of chef's/management, the food has poorly lost its reputation. Their sweet plantains are not what it used to be. It's either: undercooked, or overly cooked and drowning in oil. I ordered oatmeal last night and just a while ago and I was better off buying it from the store and making it myself. The oatmeal was mostly cloudy water and that's it. I would go back and forth with people about their quality of food but now I don't even argue. \n\nI'm sorry it has come to this, but I'm done ordering from this place. Every time I get a delivery I'm always disappointed and I still have hope that the next one would be better. If you've been ordering from them within the past 10 years, you will notice that there's been a big change in food and they no longer live up to their standards. The pernil sandwich are still good but sometimes very dry. I just had to recook my food because it was a mess. Which defeats the purpose of a take-out.\n\nBest advice to you: go back to the original owner or take time to read your reviews and work on what's been reported. I hate to see a company with good potential go to waste.", "author": "Ashley P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-01-31", "description": "The food overall is mediocre. Nothing special. There are two other places nearby (Cubana Cafe \u0026 Nuevo Cibao) that have way better food. \nI recently had their chicken soup and was very disappointed. There were huge chunks of potato, random chicken pieces attached to bone and ligaments. I'm not a fan of eating soup that I have to nibble chicken off of a bone and spit out ligaments. Soup should be comforting and easy to eat. I'll never waste my time with this restaurant again.", "author": "Moses G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-09-10", "description": "Very small place but excellent food big portions you can't go wrong, any chance I get to this area I'm in this restaurant all the time.", "author": "Rodolfo G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-03-04", "description": "A remnant of pre-wine bar Smith Street, El Nuevo Portal offers a dazzling array of meat items. Although I considered going for a bellwether dish of pernil, I was drawn to the Dominican-style pork chops. This turned out be a giant, garlic-laden delight. \n\nAs someone who gets on hooked on awesomely caloric treats then feels guilty for a few minutes, I was pleasantly surprised by the presence of vegetables including broccoli and peppers on top of the pork chops.", "author": "Josh B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-05", "description": "Really good value here - you get a lot of food at a reasonable price. I've always ordered the \"dinner special\", which seems to be pork with a choice of rice, choice of beans, and a side of bread. There may be other meat options for the dinner special, but I can't tell because no one there speaks English all that well.\n\nThe food is good - nothing to write home about - but definitely good. Oddly enough, the yellow rice may be the best thing I've had there. I'm not sure what the hell they put in it, but it's working, so I'm not asking questions.", "author": "Sam B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-16", "description": "I have been coming here for years and I must say, I keep coming back! The staff has chanced but the customer service and great food hasn't. I have had most things on their menu and I love it all! Sometimes when I get there for takeout right before they close, they even give me the big pork bone for my Pit bull dog. Don't be shy to try the variety of delicious variety of items such as bacalao(codfish in sauce) with yuca with onions, octopus salad, Shrimp and garlic; I can go on and on and on. The staff really works hard to give you excellent food and service so I love to show them appreciation with a tip to say thank you. I LOVE THIS PLACE!!!", "author": "Jonn B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "Our local Dominican restaurant in an almost gentrified Cobble/Boerum Hill is a reliable, cheap eats restaurant.  The pernil if you catch it early in the day is succulent.  Go late in the day and all bets are off as it may be drier.  You can order it with rice, beans and maduros or get a Cubano which had the same amount if not more pernil than the entree order.  We never have room for dessert but the flan looks outstanding.  There is also a $7 lunch special which we have yet to try.  They also deliver so if you're hankering for some stick-to-your-ribs nourishment and too tired to cook, this is an option.  The folks here are also very pleasant so eating in is a nice experience, too.", "author": "Wailana W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-24", "description": "Yuca is terrific. Not oily or salty. Fries are fresh and hot. Rice and beans are delicious. The portion sizes are big enough to share. Fast and friendly service.", "author": "Dana A."}], "servesCuisine": "Latin American", "priceRange": "Under $10", "name": "El Nuevo Portal", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "217 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/j1mBiMKHDCUAeZJrCmUkYA/ls.jpg", "@type": "Restaurant", "telephone": "+17182461416"}