{"aggregateRating": {"reviewCount": 122, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2012-12-02", "description": "A simple, no frills Latin restaurant with great food and friendly service.  I recommend it.  Try the chicharon de pollo and the mofongo.  Both are delicious.", "author": "John O."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-01", "description": "Interesting little place. Had the cuban sandwich. All I can say is dont let it get cold.", "author": "Aaron H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-18", "description": "What a value! Empanadas for a buck are killer.  Pork chops with fries and a salad is fit for a king.  Chicken soup and all the sandwiches are excellent.  Try the twice fried beef.  Sounds stupid, tastes great.", "author": "Bob W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2005-10-03", "description": "This chi-chi's inspired mexican resautant must have been a low brow a chinese restaurant in its former life, as the shaded chinese symbols on the wall paper indicate. \n\nThe worst ethnic restaurant on Smith street, you could tell as the ONE waiter in this desolate, uncreative restaurant walks towards you with a bowl of stale bagged tortilla chips and almost tasteless salsa.  \n\nThe drinks were heavy on the tequilla - to the point that you couldn't drink it- and even the warmth running through my veins from the first sip could mask the awful refried beans and verde sauce on the enchillanda.\n\n\nI wouldn't tempt the fates by eating there again. Beware of  Montezuma's Revenge.", "author": "Krissy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-10-23", "description": "One of the best spots for Spanish food in Brooklyn and for a good price, not like the other places in the city that overcharge.", "author": "Jimmy B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2009-02-18", "description": "This place keeps getting burned down and re-opened all the time-- but Im glad the newly renovated but still hole in the wall business is in the neighborhood. \n\nI go here for the baked chicken (dont get the white meat-- its super dry) and sides of yellow rice and beans for $9. A staple for me-- lasts me 2 meals.  Their stewed chicken and oxtail is pretty good too. \n\nBut whats up with their breakfast menu? Its straight up diner, no Dominican/Cuba/Puerto Rican flair to it. Lacks a lot of flavor. Even the home fries sucked.", "author": "Yvonne H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-21", "description": "My coworkers and I occasionally order from this place. I always alternate between the same two things. The Cuban sandwich and the Mofungo. Both are one of the best I've had. We always order so I cannot say what it's like to visit the restaurant, but each and every time we order everyone here at the office is pleased.", "author": "Jeffrey K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-05-10", "description": "Baked chicken, yellow rice and beans. Huge portions, cheap. Pernil excellent as well and tostones are fresh. Yummy comfort food. Service is slow but never unpleasant. Call ahead if you're picking up.", "author": "Jess T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-10-09", "description": "tasty and cheap. i like the chuleta sandwich.", "author": "Keith P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-03-22", "description": "Solid Dominican grub, healthy portions, great local vibe. I used to live up the street, it was our go to place for stuffing ou faces after a long day snowboarding or if we were crazy starving.\n\nTry this and you will feel the love: \n\nGrilled pork chops, yellow rice and beans, avocado salad, tostones. I think it will set you back maybe 18 bucks, food for 2-4. The pork chops are marinated in this amazing sour special something or other. Great empanadas as well.\n\nIf you like something simple: Get the grilled chicken sandwich, lettuce, tomato, may and grilled onions. Put some ketchup and hot sauce on there and you're in heaven. Seriously good chix sandwich.\n\nJust wicked!\n\nNote: Not quite as amazing as it used to be, but still earns 4 stars.", "author": "Interrupting P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-12-21", "description": "where is the grannie at? cuz usually restaurants like these, is the true reminiscence of home cookin'. no frill, spanish speaking cats just agrees  to what you want to order. i'm a sucker for pollo al horno, where the skin falls off and smacks you in the salivating tongue. gulp. oops. is it bad for you? i heard it really isn't. the portion size is true to the heart and soul where gentrification didn't change el nuevo portal into greedy inflatable monsters. cuz u know around the way now, some joints serve you your rice portion in a CUP. i mean A CUP..who does thattttttt?  serving size is also true to what a real abuela will serve back at home...fill up the plate into a heaping mountain then encourage you to be \"respectful\" so eat up.  bargain! rice and beans with chicken. mmmmmm.  honey, you can't get a meal like this any where else on smith st but hereeee-izzy. pocket changeeeeeeeeeeeeeeeeeeeeeee", "author": "Davina L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-16", "description": "As someone who enjoys Mexican food, I felt comfortable. The lady behind the counter is very nice and people here seem to be enjoying their food. Definitely NOT cheap - it cost $10 for chicken rice and beans. I think that can get you a giant sandwich or maybe 2 at fatoush which is not too far away from there.  Food is fresh and they are constantly on the phone cause of the free delivery service.", "author": "Hudson K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-03-29", "description": "I only order here as a last resort, food is mediocre, delivery is either really fast or really slow", "author": "Laywa R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2006-10-06", "description": "I think Kris M. must mean El Pitayo at 213 Smith Street, not El Nuevo Portal. El Nuevo Portal is basically an old-style \"Spanish\" takeout place next door to El Pitayo, which latter fits her description perfectly.", "author": "Robert T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2008-12-10", "description": "Straight up, super delicious Dominican/Cuban/Puerto Rican lunch counter with no frills and no attitude, generally hipster-free and amazingly cheap; puts the faux-Cuban Disneyland outpost up the street, with its microwaved lechón, to shame.  The best tostones (Latino french fries) in Brooklyn - piping hot, crispy on the outside and tender on the inside, just the way mami used to make them, and the bistec encebollado...esta cabrón, chico.  Huge portions, fast service, and lots of the old Smith Street flavor.  Oh, and the Cuban sandwich: hangover slayer.  I love this place.  It's even better than the old LES Castillo de Jagua, and true heads know that's saying something.  Go.  Eat.  Be full, and comforted, and not broke.", "author": "Eric S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2010-02-02", "description": "The Cubano sandwich rocks!!! Ok, it's a bit on the greasy side, but still rocks! On the other hand, the Chicken sandwich did not rock, at all.", "author": "Murpheezzz X."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2009-09-22", "description": "Ah, yes. When I first moved to Brooklyn, I went to this place at least 2x a week. It is a no  frills place where the food and friendly (but straight fwd) service speaks for itself. The food is great quality, clean and HUGE portions. I read some other reviews - - this is NOT a trendy restaurant serving with a huge fake smile on their faces. It is an authentic NYC eatery that existed before all the yuppies moved in (myself included). Contrast to a lot of closed businesses on Smith Street - this one has actually EXPANDED to include a sister location up the block (I forget the name). I recommend rice and beans, the Cuban, breaded steak or chicken sandwich. When you ask for a bacon egg and cheese sandwich, you will get it on a submarine roll! Guys, if you have friends in town who want to eat at a real NY restaurant - take them here.", "author": "Christopher O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-19", "description": "Yesterday, my friends and I ordered about 8 pounds of Pernil ($12) from El Nuevo Portal and had it delivered to a stoop we don't even own. Our order arrived within 10 minutes and we were not judged by the delivery man or the establishment for having very bad Spanish. Too bad the rest of the neighborhood was judging, especially the crowd that was there for \"Bastille Day\". We also acted like we \"dropped\" our soccer ball into the path of oncoming pretty women a bunch of times because we were in such a good mood and normally, 20% would be angry, but because of the great food and the good time it brought, our joyful antics were appreciated. There was one girl that was disgusted by us, though. She looked at the ball as if it were a turd. In the end, four grown people that were very hungry could not finish what we had ordered. This place is our favorite because it does not judge and it has incredible food.\n\nOur 2 lady friends that joined us agreed that the food made them forget about the handsome Frenchman who vaguely resembled 32 year-old Ignacio \"Nacho\" Figueras, only not quite as dark and probably not as good at polo, if just for a moment.", "author": "Allan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-04", "description": "Delicious baccalao, great rice and black beans, yummy gandules and green plantains.  I'm not much of a red bean person, but the ones I saw there looked great so I may have to try it.  HUGE portions.  Looking forward to trying more dishes, but the baccalao keeps reeling me in.  Next time: sweet plantains!  Nice people working there too!", "author": "N N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-07-23", "description": "I love this hole in the wall.  It's got enormous portions, a laid-back vibe, tasty Cuban sandwich, and it's super cheap.  Try the yuca, but make sure you split it with a friend.", "author": "S D."}], "servesCuisine": "Latin American", "priceRange": "Under $10", "name": "El Nuevo Portal", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "217 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/j1mBiMKHDCUAeZJrCmUkYA/ls.jpg", "@type": "Restaurant", "telephone": "+17182461416"}