{"aggregateRating": {"reviewCount": 122, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-30", "description": "Just stumbled upon this spot! I know that this area is in the middle of some heavy gentrification so it makes me happy to see a small family owned place like this with awesome food thriving. The pastelillos and yellow rice with sausage were AMAZING! As a California native I've become pretty accustomed to Mexican and Salvadoran cuisine so this food was a nice switch up. I don't have much to compare it to, but I'm pretty sure this is high on the list of good Dominican spots. It's a must go!", "author": "Jade O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-10", "description": "I shamefully order food from here probably three times a week. It's absolutely amazing, it tastes fantastic, it's super cheap and you get a huge portion! What more can you want? I couldn't recommend this place enough, breakfast lunch and/or dinner.", "author": "Matthew P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-12", "description": "My routine breakfast hunt for a Spanish breakfast and found this .. the food was delicious and the drink was tasty! The girls in front were really nice !", "author": "Eileen H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-10-31", "description": "WOO my 100th post.\n\nThis restaurant was delicious!  First off, I would have to say that the staff were very hard-working.  Although there were more customers than the staff could seem to handle during the lunch rush, they still pulled it off with a smile.  Kudos to you, El Nuevo.  Because of that, there were not enough free tables that were clean, but our waitress apologized before we even had any thought of complaining.\n\nI looked at the place and I wasn't expecting fancy decor, but expected family-oriented atmosphere and completely received that vibe.  The portions were huge and hot off the fire.\n\nThe bread that the waitress gave us was fresh out of the oven it seemed, with lots of butter flavor.  More importantly, it was not soggy, but crisp to the bite.  Yummy!\n\nMy Rice with Chicken arrived and was completely overwhelmed by the mountain I had on my plate.  My first thought, \"Oh I cannot finish this\", and it was a true statement... The chicken was tender and I loved the onions.  I realized that it was listed on the menu as \"Rice with Chicken\" insinuating that there was definitely going to be more rice than chicken.  However, I was still not disappointed!  Hot and FRESH.\n\nI enjoyed the breaded beef steak!  It was a nice new texture to explore on sandwiches.  At the end of our meal, I took a portion of the rice and a small bite of the sandwich,home, so I could eat it the next day.  Even still, the flavor kept and was equally nice to my taste buds.\n\nWhen my boyfriend and I were leaving, I was peering over to our neighbor's meal at the next table.  Dang, he ordered some kind of stew.  It smelled so good and we could tell that he was a regular there.  Next time, we shall try that!\n\nRead more: http://pinctoradventures.wordpress.com/2013/10/27/el-nuevo-portal", "author": "Pinky C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-11", "description": "DELICIOUS CONSISTENTLY DELICIOUS! I am never disappointed at El Nuevo Portal. I love their pernil (roast pork), or oxtail (rabo) always. My friends love their chicken. Their pastelillos are delicious. ARROZ CON GANDULES TO DIE FOR. If you haven't eaten here or taken out it's delicious. QUICK AFFORDABLE AND EXTRAORDINARYYYY (my mouth is watering while I write this)", "author": "Karla A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-08", "description": "Yummy Hispanic food without the heavy feeling and the greasy burps afterwards. The food is fresh and authentic to how it's done in DR. Great portions as well.", "author": "Janice W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-05-03", "description": "The food USED to be good. I have stopped ordering from this place as of last week. The food used to be delicious but my last few orders, the rice was hard, the chicharron de pollo, the steak and beans has NO flavor. The chicken cutlet is so thin the bread crumbs fall off the meat. I've given this place way too many chances. The pork chops and tostones are very good.", "author": "Jacqueline T."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-05-09", "description": "Great food, service without a smile! We were in a rush, but wanted something light. Ordered up a Cuban and a plate of rice and chicken. Cuban sandwich was awesome, tons of shredded pork. Rice and Chicken had a great line flavor, really enjoyed it. Food \u0026 atmosphere would make this an easy 4+ star, but our server copped 'tude from the  get go.. Not really sure why, she had it from my first 'hello', to when we left.. She was smiles to other patrons tho, so it came off very intentional..", "author": "Duane S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-06-28", "description": "Generous portion (chichen and rice), fresh (salad), not too fried (sweet plantains)  and tasty Spanish food. Fast delivery. \nWhat's not to Love?!", "author": "Nataly H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-11", "description": "The dominican breakfast of mangu, fried eggs, cheese and salami is one of the best I've ever had! This breakfast can be hard to find in this part of brooklyn. Asked for an extra egg and extra cheese for $9 total. So worth it!\n\nThey also have a good variety of food for lunchtime. They have delicious beef empanadas that are $1.50. Fresh squeezed orange juice. Soups are yummy too. \n\nAll the waitresses here are dolls.", "author": "Elizabeth N."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-13", "description": "Great service and delicous food. White rice and beans are excellent as well as the pork chops and pollo a la plancha. Great prices as well.", "author": "Billy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-27", "description": "I get breakfast from here all the time . Breakfast special 2 so cheap and so filling . This is definitely my go to spot when it comes to Dominican food in the dumbo area .", "author": "Valeria G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-25", "description": "Okay, so I have to be really specific here with my rating. This was easily a 4.5 experience, but until Yelp gets with the halfsies program, I'll keep the 4 star rating up...\n\nSo needing a much needed nerd day to watch 2 nerdy movies back to back (Catching Fire and Thor 2) Ingrid S. and I needed to first get some breakfast fuel. We looked for boozy brunches but places in Brooklyn weren't catering to us on a week day so we had to be creative in order to achieve our lush needs.\n\nIn a sea of hip bars and cozy dining establishments all along Smith and Bergen streets I spotted this no-frills Latin food place and my lil Hispanic heart began to flutter. I knew this could be the start of a yummy, inexpensive breakfast with at the very least a cold beer or 12.\n\nUpon us seating ourselves our waitress brought us a menu. Lots of yummy Puerto Rican/Dominican dishes on this menu but we opted for more traditional breakfast fare. \n\nThen out of nowhere (okay, it came from our waitress) a complimentary (yeah, FREE!!) basket appeared with warm, buttery bread. We gobbled up that bread as if we had never had buttered bread before. But in all seriousness - that was some bangin' ass bread, possibly homemade. Mmmmm...buttered bread.\n\nI ordered a sausage, egg and American cheese sandwich, they don't have conventional rolls so my options were regular bread, I think an English muffin and Italian bread - I went with the last option, I mean...dah. \n\nMy sandwich came pressed as if by a Pannini presser - YESSSSS. Also they did that thing where they made the eggs with the cheese in the center so that it melted and oozes out with each bite. I kind of hate when people make an egg and cheese sandwich with jut plopping the cheese on top of a cooked egg and the heat doesn't melt the cheese - I mean DAMN, this isn't fillet minion, thankfully El Nuevo Portal got it right. Also, my sausage was delicious and not burnt...huzzah.\n\nIngrid ordered a Western Omelette which came with green bell peppers and ham. Her eggs were slightly over-cooked and I personally think it would have been fantastic with some mozzarella cheese, but sometimes dairy products don't agree with her sooooooooooo she was content being cheese-less.\n\nHer meal also came with fries which I happily assisted with, I mean - I was just looking out for her calorie intake and decided I would take one from the team. What kind of friend let's her friend inhale all the delicious carby, starchy, potatoey calories by themself? Let's just say it wasn't much of a sacrifice as much as it was a labor of (yummy, fried) love. The fries were good. Actual potatoes in there and they came out fresh from the oven. Om nom nom nom!\n\nI also developed a special relationship with the Jamaican Parrot Hot Sauce that they had on the table. My attachment to hot sauces is still very, VERY new and my taste buds are still no0blets in the wide world of spicy things. This hot sauce was spicy and I didn't think I could handle it, but then I drowned the inside of my sandwich in it and mixed a healthy amount into my ketchup and I was set.\n\nAs far as our quest for beer went we both ordered Presidentes only to be informed about 10 minutes after placing our orders that they were fresh out. We each ended up getting Coronas instead. Bottles were plopped in our midst and large wine goblets followed alongside a generous bowl of limes for our pursual. CORONAS IN LARGE WINE GOBLETS? YES PLEASE. We were the classiest broads in all of Brooklyn-land.\n\nNeed a cheap, tasty, no frills breakfast in this neighborhood? Want it to come with beer in a large wine goblet? Then this is your place :).\n\nAt the end of our meal we each ordered an empanada (yellow cheese and white cheese) to go as we went off to our nerd movie jaunt. They were decent, probably better had I eaten them warm but instead we noshed on them enthusiastically about 2 hours after getting them. They were still tasty and at only $1.50 each, pretty comparable with some of Queen's finest empanada establishments.\n\nI'd totally be up to coming back here to try some of the actual Latin food which is their focal point. Plus beer in wine goblets...MAY BEER IN WINE GOBLETS BE FOREVER IN YOUR FAVOR!!! :)", "author": "Stephanie P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-08", "description": "Worst food I have ever had. \nDo yourself a favor and eat somewhere else. \nOrdered a Cuban sandwich from this restaurant, received it with MAYO. Since when does any Cuban sandwich have Mayo on it instead of mustard? \nCalled them to complain \u0026 the girl tells us that due to the neighborhood the \"white people\" prefer it that way!", "author": "Gabriella B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-11-23", "description": "Options for brunch/breakfast/early lunch on a Friday are a bit limited. I was searching for at least a place that served alcohol before noon on a weekday and that was my challenge. Steph P. and I stood debating between Cafe Luluc and this place. I let her pick. But I definitely want to go try the pancakes across the street some day. This shouted \"I am cheap and will provide you with decent enough breakfast foods and some bottles of beer.\" Your wish is my command. \n\nOne of the nicer touches and shocking was that the waitress set down an actual bread basket with melted butter. It went amazing with the Parrot hot sauce drenched on top. Steph got a breakfast sandwich with cheese and some kind of meat. Bacon, sausage, ham? I think all of those are available options. I went with the western omelette: slightly over-cooked eggs with green bell pepper and ham. Kind of happy there was no cheese in it because my stomach couldn't handle it. Option of fries or potatoes on the side. Went with the fries so Stephy could eat half of them. The highlight of the experience most def. was getting a wine glass to pour my Corona into. CLASSY. I love drinking Corona from a goblet on a friday afternoon instead of going into work! This is also why they got 4 stars.The failure of the experience was that they ran out of Presidente but it took the waitress about 20 minutes to come back and inform us of this. \n\nOverall, I'm moderately pleased with the breakfast and assume that their lunch/dinner food is a million times better. I'd have to come back to actually try that. Super cheap. Super friendly. Also, we took empanadas to go. They are $1.50 each and come in chicken, beef, and yellow or white cheese. Do it.", "author": "Ingrid S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-08-03", "description": "Some of the Best Foods are from the lil joints that've been around *Forever*!\nGenerous portions! \nMouthGasmic Flavors and Many selections to tantalize!\n\nNOTE: This is NOT for people on a Diet!\nThe Vegetarian selection is Minimal!\nSometimes the staff is a lil snippy; Especially when they're Busy...handling newbies, or Rude people!\n\nFor Omnivores... It's a Bountiful Cornucopia!\nSome of my favorites include:\n\nBreakfast Mangu with fried queso blanco (granted-some times they Dont fry the cheese) and onions! Aaagh! Just thinkin about it has my mouth watering!! Lol\nAND, if you can manage to eat the whole order; you'll likely be sated til dinner!! =D\n\nCarne Guisada aka Beef Stew - the sauce oooh the sauce! Carrots, potato, the sauce!! Tender chunks of beef! The sauce!! \n\nPollo Al Horno aka Baked Chicken - the meat nearly falls off the bone!! The aroma, the slightly crisp skin... Oooh!! (You need to place in a toaster/real oven to get it crisp again if you order*Take Out*....which is better than delivery for This dish)\n\nAll Entrees come with choice of Rice n Beans (YES!) OR Plaintains n Salad OR Fries n Salad\n\nShrimp with Garlic SAUCE... The scent wafting into your olfactories will intoxicate you!! The shrimp has a slight *snap* texture and the delicious sauce just glides down to your tummy, as it drips down your fingers....Oh......well...I eat them with my fingers...\n\nI almost ALWAYS Take Out; cos I don't want any *strangers* to see me Licking the plates...", "author": "VioletL P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-11-17", "description": "Really really good Dominican food. They make good chickens and beef stew! I order delivery from here most of the time but I finally decide to eat at the restaurant. It's not a big place it's pretty small but you can smell the good food down the blockkkk! I always either order the beef stew or oxtail with rice and beans and my BF ordered the half chicken with rice and beans. We also ordered a side of avocado salad! It was reallllllllly good and the people there were really nice! Officially love this place and this is my to go Spanish restaurant in Brooklyn! Must come and try out their stews!", "author": "Megan L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-12", "description": "Definitely Bad Service! Great food! But very bad service! Ordered takeout standing in the narrow doorway. They literally gave orders to people that came after me as I still stood there waiting. Lady didn't say anything to comfort why it was taking so long. The crowded doorway emptied as I stood there still waiting almost 30 minutes! All for 2 fried pork chops! Amazing how you are treated when they don't know you \u0026 you don't speak Spanish. Just terrible service!", "author": "Mercedes Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-25", "description": "Authentic Dominican food, big portions, and at a reasonable price. What's not to like? I recommend checking out dinner specials. Tonight's- the chicken stew- was merely $8. The tender chicken falls right off the bones! I can also personally recommend the Dominican chicken ($13), which was tangy and tasty.", "author": "George S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2013-10-14", "description": "Beef Embocellado (myself, beef with grilled.onions)\n4.0/5, good onion flavor, portion was fine\n\nMofongo con Pollo (her)\n4.5/5 Mofongo looked like it was dry but it was definitely not, was actually delicious.\n\nMangu (a side dish, was mashed green plantains cooked into a stew, took some home)\n5/5 One of the better versions of this, classic Dominican comfort food done right, great portion as per usual.\n\nMorir Sonido (drink, myself)\n4.5/5. Portion was a bit small but the flavor was very good, good amount of vanilla/milk.\n\n4.5/5 with giant portions. Rice was good and beans were solid as well.", "author": "Glenn C."}], "servesCuisine": "Latin American", "priceRange": "Under $10", "name": "El Nuevo Portal", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "217 Smith St", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/j1mBiMKHDCUAeZJrCmUkYA/ls.jpg", "@type": "Restaurant", "telephone": "+17182461416"}