{"aggregateRating": {"reviewCount": 201, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2019-01-09", "description": "Not amazing, not terrible! Had the mushroom toast and baked eggs; both homey foods and very filling. Eggs were a tad watery and seemed like just a scramble and the toast was a little sloppy looking but tasted good. \n\nCoffee was mediocre for the area.", "author": "Sam C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-15", "description": "Was told I couldn't use the bathroom unless I dined in. Getting coffee or take out wouldn't be good enough. Ree-dic-u-lous. \n\nA customer is a customer is a customer.", "author": "John J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-05-19", "description": "The food overall was good but the service was terribles at the end we paid for our food but then they decided to give a 20% tip without telling us in advance and then they had the nerve to tell us it's because they thought we were tourist which is completely unacceptable and then they told us to get out because they thought we were making scene never coming back again", "author": "Yong C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-06-07", "description": "Pretty decent cafe. I usually order take out from here.\n\nFor then area this is one that has a good amount of healthy, \"clean\" (not that greasy), fresh options.\n\nI only knock off the stars because their delivery service is very inconsistent. Sometimes they are quick but usually they are late!\n\nPs - try their roasted squash, peas with bacon and salmon\n\nSo gooood.", "author": "Viren G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-04", "description": "What a joke this place is! So I go in to get a brownie to take out and for $4.50 they give me literally a half a brownie... It was probably 1\" x 3\". I said no thank you and got my money back I suggest going elsewhere and less you enjoy getting ripped off", "author": "M G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-06-23", "description": "Came here to escape my own hangriness after spending a whole afternoon at the Brooklyn Flea. The plain-ish storefront doesn't do justice to how chic and hip and refreshing this place feels once you walk inside!\n\nI shared a market vegetable platter and every bite of vegetable was juicy and perfect. I'm quite a veggiephile so I always appreciate when vegetables are presented at their full glory, and this place did quite well!", "author": "Nancy H."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-12-12", "description": "Reading their menu, they seem like a cheaper version of Westville (yes, I know Archway was in DUMBO first). They have protein and market veggie platters, sandwiches, and soups.\n\nI went with the soup and half sandwich deal ($13 + tax). You have to call them to find out what the daily soups are, which kinda sucks when you just want to order online really quickly.\n\nSoup of the day was a vegetable dumpling soup (tomato based), which wasn't the greatest. But it was a cold winter day, and it was a good portion.\n\nFor my half sandwich, I did the rotisserie chicken with pesto. A little on the dry side, but it was otherwise fine. Nothing remarkable.\n\nService for pickup was quick (like 5-10 minutes). I'd stop by again for a quick lunch.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-08-29", "description": "Sometimes a guy really needs coffee and sometimes he really wants an iced latte and his friend needs a strong shot of espresso. When I walked by I noticed that Archway Cafe had an espresso machine and a barista so this seemed like a match made in heaven. Alas, it was not.\n\nThe people working the front struggled with an order consisting of 1 large iced vanilla latte with an extra shot and 1 espresso to go. When they finally figured out how to make this very complex order my friend stated that espresso was weak and watered down. As for my latte, it seemed to have no espresso in it and I'm positive I didn't get my extra shot. The cost for this debacle was $9. There is better coffee in the area seek it out.", "author": "Austin C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-24", "description": "The owner  of the place was extremely rude and disrespectful! We came with a group of 7 inside to get hot drinks to go and to use a bathroom. Two of our friends didn't get anything to drink, but they used a bathroom. And this guy treated us like homeless people who wanted to use their bathroom for free. And while we were waiting for our friend, he even asked us to go outside! I don't suggest this place, because customer service is less than a zero!", "author": "Daria M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-24", "description": "For the \"nice\" service the main guy gave to me and my friends on Christmas Eve. He told us to get out, even though everybody in our group purchased drinks and were waiting for one friend to finish his order.", "author": "Valeriia N."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-11-28", "description": "Unfortunately, the word of the day here was mediocre.\n\nMy scone was spongy and bland and my tea was bland.\nMy husband said the same about his latte and chocolate croissant.\n\nOnly thing not mediocre here was the friendly service and cozy interior that lured us in-over all not the worst way to spend a half hour of my life but I'd rather enjoy my food a little (lot)  more.", "author": "Allana D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-10", "description": "I went to have a meal with my friend at Archway Cafe and I ordered the pulled chicken entree. When it came, the meat did not taste fresh but I ate three bites to try to be polite. At the end of my meal, I expressed to the establishment that my meal was not fresh. I got my check with nothing taken off of my bill. When I inquired with the staff about not charging me for a meal that had gone bad, they mentioned they would have to deliver the message to management or the owner. (BTW, the staff is congenial and kind and I have no qualms with them.) After I left Archway, I got sick and was sick for the rest of the day. Today, the owner called me after I inquired again about my meal. He was dismissive and rude. When I asked for a refund, he said he could give me a discount on a future meal. Why would I go back to a place that got me sick? He then began to raise his voice at me mentioning that I was threatening him when I merely said I would place on honest review on Yelp to inform others about the quality of food and treatment. That is not a threat. I had to get off the phone but did try to call him back again with no answer. Bottom line: Food is bad tasting, food is not fresh, the owner is angry and volatile and there is no peaceful discussion toward resolution. This is one of the worst eating experiences I've ever had.", "author": "Honest 1."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2019-03-02", "description": "Stopped in for a quick breakfast and juice with some friends while visiting Brooklyn. The food is fair and priced accordingly, and with a nice menu. The juices are great. Unfortunately the poor service this cafe offers is so under par it makes. the entire experience worth passing over. Save your time and try some nicer food spots to avoid the staff trying to rush you out. Disappointed given the food and atmosphere/aesthetic.", "author": "Jacob G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-22", "description": "I have only had coffee there so far but will soon try their spinach puff. The atmosphere is great. Employees were polite. The service was great. I enjoyed the artwork on the walls and a good rest after a business meeting and will return.\n\nThe bathroom was clean.", "author": "Louiza P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-09-09", "description": "The food is mediocre and the service in my experience, either rude or pushy. I'm sure they are nice people but I've only had my food for maybe 10 minutes and I've had 4 servers try to take my plate. Once I came and asked to use my computer and they said sure, so I ordered food, and then got my computer out. Then they told me there's no WiFi. I've given this place a try a number of times because it's convenient for me and I want it to be good- but it's just not.", "author": "Katie P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-16", "description": "Food was really great (prosciutto and mozzarella pesto sandwich) as was the Cortado. I was a little confused about how to get served when it was slow in there as I ordered at the bar and then sat but saw other people being seated by a hostess. Draws a great lunch crowd and is in a good location. Biggest issue I had was that they didn't share their WiFi password. The service in this area seemed really slow and I really wanted to try and get some work done but was not able to.", "author": "Kati B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "My favorite place in DUMBO brooklyn! \n\nMy friends and I came here to enjoy brunch. I started off with a fresh carrot juice, which was delicious. I ordered the mushroom with potato toast. It was good! my friend liked mine more than her avocado toast, but the avocado toast was my fav.\n\nThey put a lot of avocado on it, and it kinda tastes citrusy with scrambled eggs on top. It is mouth watering. \n\nThe servers here are super friendly as well.\n\nThis will be my go to breakfast place whenever i come back.", "author": "Erika M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-25", "description": "I love their siracha egg sandwich on brioche, and their green juice. Fresh squeezed! It's a funky little space with good food. I'm a regular.", "author": "Rosie V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-21", "description": "Had brunch here a couple Sundays ago with a friend after the DUMBO flea market. She had been here before for coffee and sandwiches and enjoyed it, but had never gone for brunch. Food was delicious! \n\nShe ordered a Mediterranean salad dish with eggs and bread and ate every morsel. The portion was good sized and the combo of veggies with the salad greens and eggs worked well.\n\nI had the house made gravlax and was super impressed with how much salmon I got. It seemed like as much as you get if you buy one of those packets of smoked salmon in the market which is meant for multiple people! The dish was served with the most delectable creamy savory scrambled eggs I have ever had in a restaurant, plus I got toast, sour cream with capers and chopped onions. Scrumptious!\n\nThis place also makes fresh juice and I got a glass. It was also awesome!\n\nThe only down side was that their one and only bathroom was out of order, and though they had an arrangement with the restaurant down the street on the corner so patrons could use those facilities, that place was also busy and also only had one bathroom, so the line was super long. \n\nAnyway, I am sure they will fix the toilet at some point....til then the food is definitely worth your time!", "author": "Jen P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-08", "description": "2,5 stars !\n\nMy brother used to have an office on Jay Street and he said he had been to this place before and it was okay so even though the Yelp reviews were low, we wanted to give a chance. We put the prejudice aside and started to check the menu. I should say, the way menu looks and the explanations are promising. \n\nI ordered the mushroom toast and a latte which is a criteria for me to rate a place especially who serves breakfast and brunch. Their breakfast menu is until 4 PM. We got there at 3 PM. My husband and brother ordered sandwiches and friend got eggs with some bacon, cheddar cheese and mushrooms. As for the drinks, hubby got chai tea latte, brother fresh orange juice, friend early grey tea.\n\nI should say, one of the \"not latte like lattes\" I got. More like warm milk with some cheap espresso or maybe regular coffee. Chai tea latte had tea bags inside. Fresh orange juice was probably Tropicana. I would rate the drinks 1 star.\n\nService on the contrary was very attentive and kind. All orders were taken correctly and served within a reasonable period of time.\n\nI enjoyed my mushroom toast. Side bread was also good. Rest of the group were also happy with their food.\n\nWe got the check with 20% service charge included. WHY? I can not remember if the menu states that but even if it does, come on guys, are we a group or tourists? I am afraid they think people will not tip due to their ratings but I suggest them to remove the service charge and find a barista, better cups for drinks and real espresso.", "author": "Ceren A."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Archway Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "57 Pearl St\nSte B", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_Wy4I8VTrCQ9b28aMhLKWg/ls.jpg", "@type": "Restaurant", "telephone": "+17185223455"}