{"aggregateRating": {"reviewCount": 201, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-09", "description": "If I could give this place no stars, I would. Crap food and even worse service. Still waiting over 30 minutes for a plate of veggies I paid $12 for. The absolute worst place in DUMBO. Really hoping they go out of business.", "author": "Amanda R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-12", "description": "I have never felt so insulted at a restaurant. Stay away from here at all costs!\n\nI'll be completely honest - the food was actually pretty good. The pulled pork, veggies, and wild rice were very well cooked. However, what really ticked me off was the service, dishonesty, and the rude and unprofessional person handling the bar. When we got the check, we realized that we were charged $1 more than what the menu stated. By that point, our card had already been charged so I asked the guy at the bar who was handling our bill how come we were charged more, and he stated nonchalantly that all the prices were increased by $1 and that they needed to update the menu but that it was on the wall menu board. I was a bit shell shocked and just let it go. However, after thinking about it, if they had changed the prices, at least they could 1) have the waiter tell us the menu prices weren't correct, 2) have a little sticky note on the menu saying the menu was being updated, or 3) just get new menus!\n\nI asked for my $3 back for our 3 entrees, but the service the guy at the bar gave back was cold and nonchalant. He basically shrugged and acted like he was doing me a huge favor by refunding me $3 with no apology for the hiccup. I was like \"That's it? Are you guys not going to do anything about it?\" to which he responded \"You got your money back didn't you?\" and then proceeded to walk out on me and ignore me without any sense of sympathy for the mistake. It's sad because this restaurant is actually pretty cozy and feels homey, but the attitude and inhospitality totally ruined the experience.\n\nI could care less about the $3 at the end of the day, and to be honest the food was actually really good, but rest assured you will never have my business, and I will make sure to do my best to spread the word on how bad this restaurant is.", "author": "Sean L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-11", "description": "We had a really bad experience! They tried to cheat on us when they gave us the receipt. Tourist-trap and very unfriendly. Don't go!", "author": "Jules K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-09-08", "description": "Due to lack of food vendors at the Essence Street Style Block Party (9-7-14) me and a friend looked in the surrounding area for food. We were starving and this was the first place we saw and the menu was decent. Before we walked through the door we noticed a sign that read, \"Bathroom out of order.' I ordered the Mozzarella Salad and my friend ordered a Chicken Cesar Sandwich with cheese. The food arrived quickly, but they forgot the cheese--we sent it back and it took several minutes to return. My salad tasted okay, but it only had two halved cherry tomatoes. My friend enjoyed her sandwich. The waitstaff was courteous and accommodating to my table, but they were very rude and short with the patrons sitting one table away. \n\nI heard the group ask for the check and the waiter returned and threw the bill on the table and walked away. My friend and I stopped eating and looked at each other like WTH just happened and the group began to explain. They said they were waiting for over 15 minutes and hadn't received water or menu--someone finally came to take their order, but the food was taking extremely long. I not certain in they bought out the 2 of 3 meals and the other person decided they could no longer wait or if the no food arrived, but one patron decided to cancel their order because they had to go. When the waiter returned one of the guest  nicely informed him that he was being rude and that it was uncalled for and he apologized. \n\nWe got our check and before we headed out I asked a staff member who was blocking the pathway to the bathroom what happened and she 'claimed' too many people used it and it was out of order. You'd think this was where my story would end, but unfortunately it's not.\n\nWe met up with two other friends who were waiting to get their kids faces painted and when they said they were hungry we suggested going to Archway since it was just around the corner and they had seating to accommodate our group. We go inside and see the entire top seating area is closed off. My friend asks the manager what's going on / why is it closed? He rudely responds I can close whenever I feel like it! My friend and I discussed this at our first visit, but I was crystal clear on our second that they were not happy to have a majority of African American patrons that day. Next stop Department of Health to report their supposed out of service restroom.\n\nEdit: After reading some of the other reviews it seems the staff may just be a-holes. Every color of the rainbow has had bad experiences and it seems their restroom is almost always \"out of order\".", "author": "Tawana C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-27", "description": "I'm on a pretty specific diet and typically bring my own lunch to work. On occasions when I don't, I come here to get lunch. I am a BIG fan of the pull chicken platter with brown rice and roasted veggies -- topped with chipotle sauce. \n\nDelicious, healthy and they also have a great iced tea. They accept credit card (another plus) and you can sit outside nearby to have lunch if the weather is nice.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-08", "description": "this place sucks. never gave me my change back. pretended like i never ordered anything? wtf?", "author": "Daniel K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-09", "description": "Don't waste your time eating here. Archway has such potential to be a really good cafe, especially because of its location, their seating, cute decor... and yet it's so mediocre that you would rather not go back and waste your money. I ordered the Avocado Toast and my friend ordered the bacon egg \u0026 cheese sandwich and both were just bland. No seasoning. We came in hungry and left unsatiated.", "author": "Michelle M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-30", "description": "Avoid this place. Very mediocre food, consistently terrible service from a staff who appear like it's their first day working. Won't split a bill 3 ways. Hope this business closes and something better comes to this space.", "author": "Kyle R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-08-15", "description": "I work in Dumbo and live nearby, so I am always in the neighborhood.\nI've eaten in and had take-out from Archway a dozen or so times over the past year.\nFood is decent, but overpriced. That's Dumbo though. I've recommended it to folks in the past.\n\nLast weekend, the owner was so rude to me however, that I won't be going back. And I won't be recommending it to anyone in the future. From reading some other reviews here, it doesn't sound like the first time this guy has treated his customers so poorly and in a neighborhood that is growing, where restaurants and cafes are opening monthly, I don't feel any need to keep patronizing his mediocre business. \n\nDo yourself a favor and support the many other local business owners who actually care about their customers and add positivity to the community.", "author": "Al H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-05-03", "description": "Nice spot for coffee and/or a quick meal. New personnel is awesome! The only thing I miss here is wifi.", "author": "Natalie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-17", "description": "Well I should have read my own Yelp review... \n\nI have officially deemed this \"Never returning again\".. I really wish we could get some viable food options in Dumbo,I just can not understand why these places are just so f-ing piss-poor\n\nWent to get lunch today, the girl behind the counter said that I could not sit there because there was too much foot traffic, then why the F do you put seats there??? Plus there was not a single person standing anywhere near the front of the restaurant. Instead she wanted to stick me in the back that resembled a waiting room at the DMV.. What the fuck Archway, why does your service suck so bad?? I mean you food is OK, but your hospitality is just so lacking. Well there goes another neighborhood joint that I will not be returning too, pretty soon im going to have to go into Manhattan to get lunch when I work from home, kinda defeats the point..", "author": "Paul D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-09-01", "description": "After coming here for a month I really enjoyed this place. I've dined in and enjoyed their breakfast but their iced cafe au lait is my favorite. So if I need coffee I come here. It's just under $5 which is more expensive than what I normally get at any other spot but it's amazing. So just yesterday I went in and found  out they implemented a $5 minimum. Umm okay. Today I went in and ordered my usual iced cafe au lait and a Nutella banana croissant when I saw that they had my favorite blood orange San Pellegrino I decided to get that instead of a croissant. Well the chick with the accent decided to tell me to make up my mind. Not charging $7 for a croissant with a smear of Nutella and a $.50 banana you won't speak to me like that. I didn't pay for my order yet and no one made the croissant. I'm able to change my mind if I so please. She made it seem like I come in here everyday confused on life. I usually have my shit together. Speak to the customers like they pay your bills. I have no need to continue to spend my money here. I have a Starbucks a block away from me and many other establishments near my place of employment.", "author": "Amira A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-04-12", "description": "My office is just a block away from Archway and I eat there several times a month. I always get the Turkey BLT or the rotisserie chicken entree. The people that work behind the counter up front are always really, really nice. I've never had a problem here ever. I can't comment on the sit down service as I always take my food to go. \n\nMy only feedback is that I wish they had the larger 21oz bottles of San Pellegrino sparkling water.", "author": "Kristofer H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-22", "description": "My friend and I stumbled across this place after walking the Brooklyn Bridge - so glad we did! It's a cozy little cafe type place with a bar and table service that's perfect for grabbing a quick lunch. The grilled cheese was outstanding... it came with fontina, cream cheese, tomatoes and pickles on it! Prices are pretty decent, $10-15 for most sandwiches, and they have a lot of options! Wine is pricer but beers are cheap, I got a Corona for $5.", "author": "Rachel R."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-10-24", "description": "Ordered two of the daily specials with a friend, pastrami sandwich. Nice ciabatta bread, good seasoning on meat that had fat running through it so tough it had to be ligaments. Dirty tables with drinking glasses upside down. I've never seen this done without a clean napkin placed under neath, highly unsanitary. Too many good places to eat in Brooklyn to return to this Dumbo dump. Giving it an extra star for its price.", "author": "Peter A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-05-04", "description": "The food was alright and a bit on the pricey side. The service was extremely friendly and we didn't have any problems. The cafe is clean and bright, perfect for the sunny morning we visited on. I wouldn't go out of my way for it, but it's convenient in the location it's at and I'd stop in again for coffee and juice.", "author": "Gloria H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-09-26", "description": "If you want to stay and eat, don't order at the counter. Better yet. If you want to eat here, consider literally anywhere else. The service is slow and the staff is disorganized. The sandwiches were okay, but the experience was terrible. I'll never return.", "author": "Jacob H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-17", "description": "\"Please do not flush toilet paper down the toilet.\"\n\nThis is a real thing. It is a sign they hang on the single, small, unisex, closet sized bathroom in this place. How cool is that? I'm going to print out copies of this sign and hang them up all over the city. Garbage day will be the worst!\n\nMy buddy and I went to Archway for the coffee. I think I tried the Dumbo Mocha. It tasted like mocha, but in an I be done seen 'bout everything way. The only way I'm giving a coffee shop less than four stars is if they give me decaf. But if that ever happens I will set fire to the Internet.\n\nI was going to skip reviewing this place because I don't usually review coffee shops, since coffee is coffee. But then I saw all the other bad reviews and since Dumbo is turning into a hipster town I can now say that I liked Archway Cafe before it was cool.", "author": "Micah A."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-06-01", "description": "Kind of an odd space. I suppose it's like a souped up cafe. It could use more seating in the front, and the high tables are not the most comfortable. However, the menu is large. I wouldn't necessarily seek out this spot; I could see bringing my parents here if I happened to be in the area already, I suppose.", "author": "Jess L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-06-07", "description": "This review is for breakfast on a Saturday morning. Ordered 2 baked eggs (basically like a scrambled omelette baked in an oven) with salmon and spinach. Food was great. Juice was a bit warm and frothy. Service and kitchen were prompt and courteous. Location is right next to DUMBO and practically right under the Manhattan Bridge so the train can get a bit loud. Will prob return for breakfast again.", "author": "Dan K."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Archway Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "57 Pearl St\nSte B", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_Wy4I8VTrCQ9b28aMhLKWg/ls.jpg", "@type": "Restaurant", "telephone": "+17185223455"}