{"aggregateRating": {"reviewCount": 201, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2011-12-22", "description": "I'm torn between giving this place 3 or 4 stars, but in the end, I'm a fan because this place is better than all the other lunch spots in DUMBO. \n\nI like going here to order a sandwich to-go. \nPROS: \n-Sandwiches are delicious! I recommend the Roasted Chicken, Salmon, and Mozzarella. \n-Decent price ($7.50) for the quality and size of sandwich. \n-They're ready pretty quickly. \n\nCONS: \n-It kind of annoying that they charge about 65cents extra if you pay by card vs cash. Shouldn't those costs already be considered in the price? Why penalize me for paying with my card?\n-I'm always being up-sold on a coffee or beverage. If I wanted that, I would have ordered it. \n-For sit-down occasions, service can be slow and not very attentive. \n\nPersonal small disappointment: They used to give a little side-salad along with the sandwich when eating in. Recently that hasn't been the case. Additionally, the sandwich wasn't even presented on a plate but was instead wrapped as if taking it to-go. You'd think that when eating-in they'd make the experience a little more special. \n\n(I know there's more cons than pros, but the food really does taste good!)", "author": "Judy P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-01", "description": "Stopped in because I was too hungry to go anyplace else and so glad I stumbled upon Archway! Had the mushroom, barley, kale soup and the avocado sandwich. Delicious! Chill ambiance, good music. Will definitely be back here.", "author": "Jessica R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-03-24", "description": "Been here twice and love this place. Had the turkey BLT and pulled chicken platter. Both excellent. Greek salad built on mixed greens so so. Prefer romaine. Reasonably price. Quiet when full.", "author": "Mark G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-07-18", "description": "I made a yelp account just to review this place. Overpriced garbage. Why should I pay $13 for a tiny microwaved frozen tv meal???? And the service was even worse than the food. Such a rude waitress!!!", "author": "Aakanksha S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-02-05", "description": "I feel like this place is underrated.  It's the best lunch place in DUMBO and their bread is amazing.  I really like.  Very local.", "author": "Alec R."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-21", "description": "I used to be a frequent customer but now feel I would never return.\n\nI ordered a sandwich which was shown on their menu as being 8.50 and was charged 9.80 with tax - not exactly the correct maths.\n\nI questioned this and was told they jst changed the price but not the board which advertises their prices. I was offered neither an apology or a refund. Horrendous customer service", "author": "Sam T."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-03-02", "description": "Went in here one sunday morning because their sign on the corner said brunch and i was craving some breakfast food and it was like 1 pm .. well since i was on this street i figured why not here..perfect.. NOT... nothing about their menu was \"brunch\" like ..so i ordered a turkey sandwich and tet.. sandwich wasent bad but it was small for the price..and not to mention the shakira playing in the background not good.... so small sandwich and cup of tea $12 + tip $15..i asked to use the restroom and it was out of order..so im out of 15 bucks and wanting to pee like a race horse.", "author": "Luis C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-12", "description": "Pssh. Avoid - especially for lunch in DUMBO. Even though the guy behind the counter wasn't as rude to me as my fellow companions - he was a jerk. Never told any of us that they only had one bread option for the day (even when we all ordered something other than that bread), got orders wrong, charged extra for add-ons that actually weren't on, didn't apologize when we called \u0026 complained about it -- and even tried blaming us. The food - overpriced, small sandwiches and while they aren't BAD - they are definitely not worth the money or the stress in dealing with the place.", "author": "Daniela A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-11-30", "description": "Great little lunch spot. My friend and I both got the soup + sandwich combo. I got prosciutto di parma and my friend got the smoked salmon. They were both tasty and the right amount of food (not too much, not too little). The inside is cozy with great original artworks on the walls and our server was very nice (unlike all the other reviews). Maybe we lucked out that day, but I'm definitely going back.", "author": "Didi R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-05-01", "description": "who thought an egg sandwich with pesto and pickles would be delicious? ($9) reasonable prices and uniquely delicious. a good find", "author": "Jenna M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-11-01", "description": "excellent little cafe in dumbo right by the archway hence the name, prosciutto sandwich is the best and a delicious array of baked goods, its definitely a hotspot for italians in the area", "author": "Karen G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-04-21", "description": "Once a week I go over to Archway for what is the best chicken caesar in the city. Actually, it's not a caesar as a strict constructionist would put it: a variety of greens instead of romaine, lots of grated parmigiano, a dressing with a nice touch of heat and as an added touch, stuffed grape leaves. The chicken is roasted perfectly, and there are plenty of croutons. I also go to Archway frequently for their smoked salmon sandwich, also as good as can be found in this \"hot,hot\" neighborhood. This is the kind of place that gets dissed by young and unimportant people with fancy ideas about themselves (see the comments) but if you have an ounce of patience and a milligram of taste, it gets the job done very very well!", "author": "Michael M T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-06-03", "description": "Delicious sandwiches. Delicious bread. Especially the Brie and the Portobello sandwiches. (Add chicken to the portabello!", "author": "Geoffrey N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-04-16", "description": "Service was fast. The side of salad that came with the sandwich was delicious, I actually liked it better than the sandwich. The Omelettea sandwich was really good - it was actually bit too filling for me and I could barely finish it.", "author": "Sandra K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-01-15", "description": "Terrible place. They gave me the wrong order twice and, instead of apologizing, refused to refund me. Stronzoni.", "author": "James R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-03-16", "description": "I work in the area and this is my third time ordering from Archway. First time eating in was great. Second time ordered through seamless and didn't get any utensils (and didn't request not to) but it was good once I found some. Third time I ordered over the phone since I know seamless takes a big cut from the businesses, not only did I not get any utensils again, but also, my Turkey BLT had no lettuce, and the bacon looked like it was barely cooked, like the re-heatable stuff you can buy at the grocery store these days. When they get it right, the place is good. Hopefully they can step it up for their to go orders.", "author": "Brandy C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-30", "description": "Love the Archway Cafe. Been going there for 2 years.\nReally good Panini's \u0026 fab spinach pie!\nBest breakfast sandwich - EVER!", "author": "Kate G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-12", "description": "These reviews are hilarious and pretty on point. Dumbo does have some horrendously over priced places to eat, really sub par food comparatively. i worked there for years and struggled everyday to find something decent. This spot is really funny though, sandwiches were like 300% salt and bread was not so fresh. \n\nI wonder if this place is reading these reviews and plan to improve their food/vibe? What the hell is that about no bathroom? I wasn't planning to go back anyway, but am also curious about social experiments.", "author": "katy w."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-15", "description": "Overpriced and won't let you use the available outlets for your laptop and will actually tell you that you've sat there too long on the wifi after a short amount of time. Unbelievable, will never be back.", "author": "MaryAnn G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-08-20", "description": "I've had great food from here before: overpriced, but still good quality.  However, beware of the 'avocado toast' listed on their breakfast menu.  In short: should be called a large spicy guacamole with a side of toast.  it's not BAD, per se, but for breakfast....?  all I'm saying is, where are my chips?", "author": "Rebecca R."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Archway Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "57 Pearl St\nSte B", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_Wy4I8VTrCQ9b28aMhLKWg/ls.jpg", "@type": "Restaurant", "telephone": "+17185223455"}