{"aggregateRating": {"reviewCount": 201, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 2}, "datePublished": "2015-07-20", "description": "This place was a nightmare. \n\nThe waiter practically cost us a trip to the hospital! The only reason this place gets a second star was because what I ate was decent - not the best i've ever had but it was pretty good. The main reason I will not return to this place is because similarly to many of the other comments, the servers were beyond RUDE.\n\nIf you have any type of food allergy, I do not recommend coming here. My friend is deathly allergic to cashew nuts. She ordered a mozzarella salad. When the dish arrived, there was pesto all over the salad. She had a bad experience with pesto before, because a lot of pesto sauces have cashew nuts in them. The minute she saw pesto, she asked the waiter if there was any nuts in the pesto, and said no and acted like he didn't want to be bothered.\n\nShe took one bite of that pesto and right away her throat started closing up. We called back the waiter and asked again, and he had an extreme attitude like he did not want to be bothered. He came back informing us there were nuts in the pesto sauce after his original mistake. We then asked what type of nuts, and with an attitude he said \"I don't know. I have to ask again the same thing I just asked.\" and rudely walked off. When he came back, he told us they were cashew nuts.\n\nMy friend ran into the bathroom and began vomiting, and having a bad allergic reaction. We had to leave and the waiter was like \"You should warn people before you have a food allergy you know.\" And we asked originally the other waiter how she is allergic!\n\nThe other worst part was when we were leaving they still charged her for the salad! She took only one bite and began vomiting, and they still charged her. Both of our bearded waiters were extremely rude, and that was the last straw. We called over a different waiter named Jose and he was extremely helpful. He wasn't the one who messed up the order - but as we were leaving he came to our table to make sure my friend was okay and apologized to us - when neither of the other dumbo waiters even said one word! Jose was extremely kind while the other two should be fired. When we left my friend continued vomiting in the street thanks to these guys and we got her the appropriate medical help. \n\nSo overall, this place gets 2 stars for decent food and Jose. Other than that, this place was a waste of time and money and served someone food they are allergic to. DON'T COME HERE IF YOU HAVE FOOD ALLERGIES!", "author": "Emily D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-08-09", "description": "horrible service. cheap lattes. overcooked eggs. low quality ingredients. waiters argued with us that they used two eggs to make our side of scrambled eggs, when it was clearly one egg. avoid at all costs.", "author": "G B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-21", "description": "UPDATE! I decided to give them another shot after the manager called me \n to apologize for my bad experience. Bad move on my part. AGAIN there was food missing from the order when it was picked up. Luckily we realized before we left. Today, A co worker ordered from there again  (after I had STRONGLY advised against it) and after placing a rather large order, had 15 items missing come pick up time. When he went back to pick up the missing items, they tried to make him pay for them TWICE claiming the items were in the bag, not missing. \n\nThese people do not respect their customers, and they will ruin your lunch hour if you let them.", "author": "Lizzy S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-25", "description": "Terrible service! I ordered a round of expresso for a group and the guy working in the front had major attitude issues. For example, I asked for water and he didn't acknowledge me or look at me. So, I asked again and he didn't even turn to look at me and said \"it's coming\" in a very annoyed tone. This  is after I gave him a 20% tip for the coffee which was ok and not worth having to deal with someone who clearly does not want to be there. Word of advice....if you don't like what you're doing then go do something that you do like!", "author": "Chris S."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-06-30", "description": "Well, this is my third time visiting and likely my last. It's really close to work so I've joined folks there for lunch. The first time I felt really uncomfortable after whatever I ate must have been filled with grease and this third time I decided on the BLT salad which was drenched in dressing in covered in really poor quality turkey lunch meat. I think they are skating by on their looks because it's cute inside and underneath the bridge but the food is poor quality in my experience.", "author": "Attia T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-29", "description": "Good sandwiches, great selection of salads, home baked cookies, nice local sodas and a  lot of tables outside if you want to enjoy the sun. \nStaff is not super friendly but absolutely kind enough :)\nLocal artist are showing art inside and the place feels kind of dumbo-hip :D", "author": "Erika L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-03-26", "description": "Worst service ever! I would never come back here. The food was terrible and the people were even more terrible that worked here.", "author": "J K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-04-23", "description": "Incredibly rude service. The guy behind the bar greeted me with an attitude. Then, I was informed that they don't allow laptops in a very impolite way, as if I was asking to do something unimaginable -I was literally the first customer of the day, sitting alone in the table area-. I felt so uncomfortable that I walked out without even touching my coffee. Of course, the guy behind the bar didn't bother to reply to my \"bye\" when I left.", "author": "Felipe V."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-05-20", "description": "Not recommended unless you want a cheap place for a sit down meal with middling food, and you want to skip desert. \n\nPulled chicken was ok. Turkey sandwich was ok. But the apple pie was an atrocity - totally artificial gross filling gunk and wierd chewy crust. Was it pre-made? Seems hard to get something that bad pre-made. \n\nService was shockingly slow to take our order and to bring the bill, but super fast with the food. So that's wierd.\n\nPrices were pretty low for Brooklyn, given the ambiance of the place. But only reasonable given how disappointing the food was.", "author": "Noah S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-10-24", "description": "As a pure coffee enthusiast, the coffee tastes great here. It's well prepared and served toasty. I'm always seated exceptionally with a menu and a cup of water by the friendly waiters. The ambience of the place feels cozy and welcoming. Nice pieces of art and music to indulge in while I sip my coffee. The sandwiches are delicious too. They come with a side of mixed greens, which I also get a bag of Rosemary chips to go along with  for some extra crunch. Nice place for a date but also a great neighborhood to enjoy my order on the go.", "author": "Kristi L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-08-12", "description": "OK, so I love Archway as one of the only easy, somewhat affordable lunch/cafe options in DUMBO. But after visiting this place for 2 years, I am writing a review as a lady who has experienced consistently awkward, inappropriate customer service here lately. \n\nWhen I come in to purchase coffee, or to have a quiet work lunch, I have repeatedly been engaged in awkward conversation with more than one male employee here who has gone beyond offering innocuous compliments to instead ask weird, condescending/annoying/invasive personal questions about my appearance or pushing flirting after I've indicated I'm not interested/uncomfortable. \n\nI have worked in customer service at cafes and welcome a friendly relationship with a barista or polite conversation, but that's not what this is. Owners, talk to the men you hire about respecting personal boundaries or you're going to slowly lose customers who don't want to deal with unnecessary mansplaining and awkwardness at 9am when there are 10 other cafes in the neighborhood.", "author": "Anne M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-22", "description": "The food here is mediocre at best, however, my issue revolves around the horrible management. The owner of this establishment told my friend with a service dog \"Fuck You\", even as she was quickly compliant with his request for her to take the dog outside. We had completed our meal and were awaiting to pay the bill when this occurred (each spending around $45). The dog laid under the table silently the entire time. The wait staff couldn't have been nicer, but the owner of the restaurant completely ruined this experience and it was horribly embarrassing and rude to the other diners. We will be reporting this to the Better Business Bureau immediately.", "author": "Meg L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-09-27", "description": "My friends and I ordered, paid and then wanted to sit down in their dinning area. We were told no. So our order wasn't good enough? Yet they had plenty of tables. Guy managing was rude.\n\nThe food was good. Better selection than all the food trucks.\nService poor. Not friendly.", "author": "Norma S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-03-26", "description": "They tried to charge me three times the menu price for the side. And they were very impatient to get me out of the door when we were still half hour away from the closing time. Rude!", "author": "Ece E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-25", "description": "Are u a vegetarian? I said vegetarian, not vegan. If you are veg, come here! At long last, someone gets it! Amazing food, amazing wine, and great decor. Idk how this place got anything less than 4 stars on yelp, but I guess haterz gon hate. To all my fellow vegetarians, please support restaraunts like this. They even have a separate vegetable combo list! I'm not talking about cold salads, I'm talking hot, interesting vegetable dishes. For the love of meat free meal options, come!!!! P.S. The Halloumi Grilled Cheese is heaven on a baguette (just sayin).", "author": "Alexa K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-10-07", "description": "I was there for the DUMBO art festival on a Saturday...\nThe place was packed but I managed to squeez myself enough to order a latte.\nLet me re-phrase....\nI ordered an espresso based baverage that was burnt and sour to the taste.\nwtf? \ni made my way to their bathroom and a guy stoped me asking for my receipt informing me that i couldn't go to the bathroom without a receipt....\nI AM HOLDING YOUR COFFEE what other proof you want?\n\nThe staff was rude and dismisive.", "author": "Katerina D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-05", "description": "Came here with friends from Spain who said it was the best lunch they had since they got here. Had lots of veggies. Food, drinks and service were perfect.", "author": "Amy G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-08", "description": "Wow.  This is THE MOST rude service I have encountered in my 8 years living in Brooklyn.  One particular twerp waiter became upset when I accidentally spilled a little coffee.  I was upset for the rest of the day!  Why not quit your job if you're so unhappy? Instead you make everyone else miserable with your terrible service.  Hopefully this place will go out of business so we can get a better coffee shop in Dumbo.", "author": "Carmine F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-05-08", "description": "Little prick waiter got angry when I spilled my coffee.  Ruined my day.  Never again.  This is rude NY at its worst. Please go elsewhere for your pal Joe!  Brooklyn Roasting Company is just a block from here!  Thank you.", "author": "Joe I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-04-18", "description": "People will learn the importance of Customer service one way or another. Don't hire rude people to work at your establishment. There are a bunch of other places I can give my money to without having to deal with the attitude I received when calling your restaurant this morning.", "author": "Ronnie L."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Archway Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "57 Pearl St\nSte B", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_Wy4I8VTrCQ9b28aMhLKWg/ls.jpg", "@type": "Restaurant", "telephone": "+17185223455"}