{"aggregateRating": {"reviewCount": 201, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2016-11-09", "description": "Had what tasted like avocado spread from a bag on ordinary toast with pre-prepared scrambled eggs on top! No nice poached organic eggs here folks! Ordinary for Gourmet Price!\nThen an 'ordinary' small cup of drip coffee for $3 didn't come with a refill... Hmmm... I was ticked!\n\nOn  a positive note, though I cannot recommend the place, the staff were nice enough... even understanding when I seemed shocked that I'd have to pay for a refill on regular brew... He did explain the coffee beans are expensive/ special, but honestly the brew was ordinary.  OK, enough, just don't expect too much!", "author": "Edward E."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-10-16", "description": "If I could give zero stars, I would. I came here with my boyfriend looking for a quick bite near the Brooklyn Bridge Park. We sat down quickly but we waited over 20 minutes and no one came to ask what we wanted to order. The menu looked like they had good food but it's a shame we didn't have the patience to stay after the table next to us who came after us, was served first. And not to mention, the waitress passed by us about 4 times before we decided to walk out. Very upsetting.....", "author": "Lily F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-09-08", "description": "Great sandwiches... when they get it right and don't touch them with their grubby fingers...\n\nIt's overpriced. There's a deli not too far from there that would make the same sandwich for $6. Here, I paid $13. As in I could have purchased 2 from the deli and had a dollar left over for a poland spring. \n\nWe walked in for a quick lunch and they asked what we would like to order. We stared at their huge chalkboard wall of a menu for way too long and still asked questions and placed orders with substitutions. Fun fact, you're only allowed 2 substitutions and if you ask for something that is supposed to be added to the sandwich, they'll place it on the side. -___- \n\nAfter placing our orders we looked at the tables trying to decide where to sit. A rude employee approached us and said \"the next time you want to stay, place an order for table service!\"...um, ok... wouldn't that have been important to let us know when we were... I don't know... looking at the menu like aliens that have never been to this strange planet of yours? We instantly decided that we would leave instead of staying for lunch. \n\nThey sent the sandwiches out 10 minutes later and didn't know which was which (because they were wrapped to go). It was in this moment when the brilliant sanitary server decided to unwrap and open my sandwich to make sure it was mine... thanks... needed a bunch of extra fingers in there for verification. She smiled and said \"see I didn't touch it\"... oh, but you did. \n\nI would avoid the place. Not worth it monetarily or experience-wise. The ambiance looks cool but we've all seen things that looked cool and were not after experiencing them. Good luck to you, I simply offer you my 2 cents.. or $13 in this case.", "author": "Ash S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-03", "description": "Delicious salads + sandwiches. Great for breakfast and a quick lunch. Highly recommend the turkey BLT and the rotisserie chicken salad. \n\nSoup changes daily. Wide variety of market vegetables and all at a reasonable price.", "author": "Bea I."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-06-30", "description": "Not a very welcoming place.  Went in to ask for a cappuccino asked to use the restroom but was told I had to be a customer to use the restroom .  Felt awkward as I came in to purchase a hot drink.  No customers to be seen. It was about 10:00am.  Maybe if they were friendlier they'd have more customers.", "author": "Lena` M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-10", "description": "The food and cappuccino are good! No complaints there! But the bar staff...not very friendly, not quick to greet you. I'd love to make this my go-to spot when I'm down at Brooklyn Flea (for a healthy bite to eat)...but their staff needs to get it together. Ambience and me u are great! So I'll try them one more time in the future...", "author": "Heather H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-12-12", "description": "Wandering in off the old cobblestone streets of DUMBO you have an eclectic and refined medium sized cafe that serves some elegant, appropriately sized treats. The vibe is just the smallest bit upscale without taking itself too seriously.", "author": "Dominik D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-09-12", "description": "Stopped in for a glass of wine before a wedding across the street as the marquee said 'cafe and wine bar'.  NOTE - for this location, the cafe is primary. There was a limited selection of wine but both red and white were fair priced. My friend and I chose to have a glass of prosecco. I'm NOT a wine snob but it was the first time I had prosecco measured out in an individual carafe and the poured again into a regular wine glass. There was very few bubbles to enjoy after a double poor where the bubbles were bruised and dissipated  - lesson learned when ordering wine in a FOOD first wine bar. \n\nSo, wine bar was a bit of a loose term in the name of the establishment. The choices for wine - including the prosecco was 4-5 of Red and White each. Wine bar cafes with Wine first and the food 2nd is NOT what you get at this establishment. We didn't eat or order food - but clearly with such minimal selection on the wine - I do not believe this is a wine FIRST wine bar, cafe.", "author": "C C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-24", "description": "The girlfriend and I were in NYC for a long weekend and stopped in here for brunch. Absolutely perfect. Home fries were glorious and entire meal was delightfully filling. Great coffee and service, even the new guy that was training. Awesome little place.", "author": "Travis M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-21", "description": "The actuall store was cute, it had a lounge area in the back which was nice for people who want to sit, or work. My sister and I ordered coffee from here and it was $2.80 I believe, which is a pretty good price.  The coffee was good except it left a weird texture in my mouth. The guy working looked busy and hardly made eye contact but was kind. Overall a decent place but I wouldn't go there for coffee.", "author": "Jenlee Z."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-31", "description": "This is my second time having breakfast at Archway Cafe. This is a very good value-for-money local cafe. Portions are large, the food is well prepared for the price, and the service is good. You can sit on the mezzanine level if you would like to dine in or eat at the bar area if you would like a faster meal. \n\nCome here for what it is: a reasonably priced casual local cafe with good lunch and breakfast options.", "author": "Eric C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-24", "description": "Stop giving Archway 1-Star reviews - it's my go-to breakfast spot you jerks. Come here all the time and have personally never had a bad experience with the staff, food or drinks. Everything about this place is just fine.", "author": "Ryan D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-22", "description": "Ate here 5 times and had 3 different meals and all were fantastic! The quality of the food here is great IMO. I've had the turkey BLT (omg, the bread is amazing), the baked eggs (so fresh), and the vegetarian chili and shepard salad (also so fresh). The delivery comes so fast, but I'm also close by in Dumbo. I called once when they just closed and they were willing to take my order as their last delivery, so I think their service is great too. Only once did my order take kinda long. I look forward to continue ordering and highly recommend the items I mentioned.", "author": "Kimberly M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-11-28", "description": "I have never eaten here, but as someone who has visited numerous times for a coffee item, I am surprised at the low star rating. Again, I can't speak to the food... yet. But, if you're looking for a good cup of coffee in the neighborhood, don't be turned away. This place is worth a visit!", "author": "Andrew M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-20", "description": "I got the salmon sandwich and it was a really good amount of food for 12 bucks. Service was great- received my food within 5 minutes of ordering. Definitely would go back.", "author": "Omar M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-31", "description": "In the heart of Dumbo lies a sweet little cafe with quaint little menus and local art decorating the walls. This cafe is called Archway, and they serve excellent fresh food and yummy coffee. Been here more times than I can count--their vegetarian friendly menu is great for breakfast or lunch. \n\nIt's Dumbo prices, so be prepared to shell out at least $10 for a breakfast sandwich, but it is super healthy and well worth it in taste.", "author": "Niomi M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-18", "description": "I love their prosciutto sandwich. It's my second time here only but I'll definitely come back. The carrot artichoke soup was excellent too.", "author": "Frank D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-12-17", "description": "It's not only about food but about customer service. I went to Archway excited to try them out especially since there are not that many reasonably priced eateries in DUMBO. So imagine my surprise when I placed my order and the price that was rung up was considerably higher than what was listed on their own website, which is what drew me to them in the first place. I pointed it out to the counter person taking orders and he tried to explain to me that it wasn't their website when it clearly was: http://archwaycafe.com/. No one behind the counter wanted to match the price, not even the MANAGER who admitted there was a discrepancy in price but blamed it on the company who they hire to maintain their website. \n\nSo one of two things happened 1) You know there is a price discrepancy in your favor and you don't fix it because you're crooks or 2) You expect me to believe that Archway doesn't control nor provide pricing information to the people who do your website. There are options in DUMBO, i.e. Atrium, Foragers, Peas and Pickles, Allmar, River Cafe, Dumbo Kitchen, Dumbo Taco, Untamed Sandwiches, Glaze, Westville, Thursday food trucks and Seamless will deliver Shake Shake, which is within walking distance. Archway, can you really afford to turn away customers because you want to be cheap?\n\nSide note: I did not buy anything from them, it's not the money, it's the principle. Don't pee on my leg and tell me it's raining, that's just insulting.", "author": "Cynthia W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-27", "description": "Tried this place twice, pretty disappointed both times. Anything labeled \"avocado\" or \"guac\" comes from a giant vat of pre-prepared guacamole from somewhere else. It's really not good at all. If the owners read these, I highly recommend you stop using that product OR at least advertise it appropriately on the menu. I ordered avocado toast and received literally a cardbooard tub of store guac with some cold toast..", "author": "CJ L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-04-20", "description": "The staff is really responding to negative Yelp reviews by being extremely polite and helpful. The food was actually delicious and the atmosphere was nice for a mid-morning breakfast. I eat breakfast in DUMBO/ BK Heights 4/5 days of the week and was pleasantly surprised to find Archway to be a nice change from BK Roasting and the like. \n\nGive it a shot and be vocal with your feedback- they'll appreciate it!\n\nThe only thing I didn't like was the high cost for breakfast dishes. They were innovative twists, but still had basic ingredients nonetheless. Knock the prices down by $2 and you'll gain a regular diner.", "author": "Courtney F."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Archway Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "57 Pearl St\nSte B", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_Wy4I8VTrCQ9b28aMhLKWg/ls.jpg", "@type": "Restaurant", "telephone": "+17185223455"}