{"aggregateRating": {"reviewCount": 201, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-23", "description": "One star is for coffee they are serving, which is pretty good. I used to order often from this place and food was decent. Then it just started going downhill. I promised myself that I am done with this place. Did not go there for about 2 months and then decided to give it another shot. I ordered vegetable platter (hummus with vegetables) and threw it out because it tastes like soap. Never again!", "author": "Iryna S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-02-08", "description": "Don't let the looks impress you.. this place is overpriced, the food is below standard, and the service is very snooty. \n\nSomething basic like serving hot soup seemed  too difficult there.", "author": "John C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-03", "description": "Looks can be deceiving, better off at McDonald's.  \n\nThis was my first time at the cafe and it seemed promising. The interior was nice and the hourly stuff welcoming. When I asked a question about the menu the girl taking my order was training and didn't know so she asked the owner/manager. Not only was he extremely rude, he literally told me \"can you not read the menu?\" \n\nThe fact that the owner didn't  know how to deal with customers and the portion sizes were extremely small for the price are the main reasons I'll never come back or recommend the place to anyone in the dumbo area.\n\nAs I got back to my office I told a fellow co-worker about my experience and almost half of the office chimed in talking about very similar experiences. \n\nIf you're not lucky or a 2 year regular, you WILL have a horrible experience", "author": "Scot G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-14", "description": "Ordering food here is a mistake. The vegetable platter is literally prepackaged guac and sabra hummus you'd find in a deli, with a scoop of the same steamed vegetables you'd get on a deli sandwich, for $15 + tax/tip. Thorough ripoff. The coffeeshop portion is fantastic though, perfectly brewed La Colombe and a good selection of treats. Still doesn't compensate for overpaying for bad food.", "author": "Mike S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-07-29", "description": "Good croissants! Local art. Sweet decor. The inside is very calming and cute. Overall charming and right near the bridge! I love to come here during breaks! Can be a bit pricey but totally worth it! Super convenient for takeout too! Not super friendly but nice people. \n\nBest croissant in the area.", "author": "Marie K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-01-10", "description": "We tried the Archway last night for the first time since it's right around the corner and we didn't feel like cooking.  We got takeout.  It was absolutely inedible.  The salmon was totally overlooked into rubber even though we asked that it be medium rare.  The vegetables were grey and obviously had been overlooked hours before.  The lasagna was barely passable and was a size that equals about half an appetizer even though it was listed as a main and priced accordingly.  When we called back with our comments, their reaction was sorry.  No thought of giving our money back or offering a substitution.  No way to treat customers and build any kind of loyalty.  Never again.", "author": "David C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-05-03", "description": "Food is somewhat overpriced but critically, the service is abysmal. The server displayed considerable disdain towards me, and ignored me more than once. \n\nOtherwise, the atmosphere is nice and the location alright, just across from a public  outdoor seating area.", "author": "B D."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-12-29", "description": "It looks like a cute little cafe, which is why we went inside, but once we were inside, it became a lot less cute. First of all, they have a 20 minute limit on their wifi. Ok... So you don't want me to sit here for longer than 20 minutes, I get it, but it's not nice.\n\nTheir scones are pretty dry. The coffee is kind of burnt. And when my husband ordered a vegetarian dish, they brought him an egg dish instead. When he pointed out that it wasn't what he ordered, the waiter tried to argue that it was a vegetarian dish but eventually backed off into the kitchen to inquire. He came back and said that the reason they had brought this dish out instead of the one he had originally ordered was because they didn't have hummus. Umm, ok.\n\nDon't be deceived by the decor of this place. You're better off going somewhere else.", "author": "Olga P."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-11-07", "description": "Go here if you want a long wait and rude service. Actually, you're better off going to the DMV. My girlfriend and I went to the NYFOL today, and it was so cold we had to stop in here for some warmth and a hot chocolate. Unfortunately, I didn't Yelp it first. Silly me. The place was packed. The server behind the counter was competent enough, but the fat man named Arthur that was guarding the seating area was a huge (literally and figuratively) dbag. After placing my order for my girlfriend's hot cocoa, I went to go sit with my girlfriend, who had luckily found a table. I was immediately stopped by Arthur, who told me that outside drinks were not permitted. I had bought a coffee from Starbucks an hour ago and I was still working on it, and I'll be damned if I had to throw it away to buy another one just to sit with my girlfriend. I replied that I had ordered a drink from this establishment as well, and he replied that I still couldn't bring my drink to the table. Confused, I asked if he was kidding. He looked directly at me and replied, \"Do I look like I'm joking?\" I shrugged, finished my coffee while waiting the 10 minutes it took for them to pour premade hot chocolate into a cup, then left my empty coffee cup on the counter to sit with my girlfriend. Arthur immediately told me to throw my cup away. Sorry, I didn't realize that that was my job. I ignored him and left it there to show my disdain. \n\nSo here's to you Arthur. I don't know whether you're the uncaring owner or just an employee that's bitter about his life, and honestly, I don't care. Paying customers shouldn't be treated with such disrespect. Do yourself a favor and heed your Yelp reviews.\n\nPS. The hot chocolate was way too milky and cloyingly sweet.", "author": "David S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2014-03-17", "description": "It's ok, I guess. I work right upstairs so it is convenient for me to come here. I only come here if I'm extremely bored of the other neighborhood places or if I am too lazy to walk the extra block to someplace else. \n\nTheir sandwiches are OK, but nothing to write home about--WAY overpriced for what you get. They usually have a pretty decent selection of baked goods, like cookies and muffins. \n\nDespite what other Yelper's have written about the staff, I've never had a bad experience with them, nor have I encountered the owner (which would seem to be a good thing).", "author": "Katherine C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-01-11", "description": "The interior was nice, and I liked the art on the walls...\n\nThe staff was not nice, and they forgot a whole 2/3 of the order.\nThey had outlets, but the outlets were all taped up, so I couldn't recharge while I sipped my tea.\nI can't complain about the drinks because there is no way to mess up chai tea...\nThe brownie was dry -- very dry.", "author": "T T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-18", "description": "Hahaha the owner of this place is like a joke seriously. After leaving a review based on the service I was given few weeks back. I went today to eat and see if things might of change because I believe in second chance . The owner actually told me he's not serving me food because of the Yelp review I left. Ha hahahaha. So guys don't go there if u left him an honest thought review. Sad guy I tell u. I might just go back again to make him cry again. Lol", "author": "Max D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-10-04", "description": "First of all, I always get take-out from here so this review has nothing to do with dine-in experience.  They got a relatively wide collection of sandwiches, and I think they are decent in quality and portion size - not saying they are overwhelmingly big, but they are about the right portion for a quick lunch.  Staff at the take-out counter is usually very friendly and helpful. And I almost forgot to mention, their smoothies are the best!", "author": "Tommi G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-30", "description": "Wow, talk about a mix of reviews!  Well, I actually enjoyed my visit here, and would gladly go back again.   The menu was large and interesting enough, and the service seemed perfectly fine.  The BBQ pulled pork sandwich I ordered was as good as any other I've ever had, and it came with a small side salad \u0026 decent coleslaw.  The water served was basically room temperature (some ice or a refrigerator would've been great)...but it tasted fine and was thoroughly enjoyed considering how hot the day was.  In all, it's a nice little spot in what is clearly a neighborhood on the rise, so I hope it sticks around.", "author": "Jim H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-08-04", "description": "Staff was off putting and rather rude. We arrived at 6 pm on a Sunday, purchased a coffee and cookies and were told that we weren't permitted to use the rest room because \"it had already been cleaned and they were closing.\" Mind you, we were literally the only patrons in the entire cafe. They then proceeded to tell two other prospective patrons not to come in because they were closed. Spend your money elsewhere, it seems like they don't need it.", "author": "Elizabeth Z."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2012-12-07", "description": "Cool space. Nice interior with a clean feel.\n\nIt ends there. Over priced and stuck up. I was told that I wasn't allowed to plug in my computer. Seriously? You're a coffee shop, not a French Bistro. \n\nCoffee was mediocre. I had a slice of pie ... meh. \n\nI wont return.", "author": "Anthony V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "I love this place on the facts that --- I really really really really really like their jam and brie sandwich. I like the rolls they use, and I've introduced myself to one of the servers-managers named Brandon. He seems to really care about what he's doing. I've been here at all hours of the day, but really the Archway is in my rotation for picking up a nice chicken salad (with the greens -- not chicken salad as in chicken and mayonnaise) for lunch. \n\nI hate this place because because because --  These guys don't have alcohol. So, one could stay anonymous I guess. Not so hot for desserts.", "author": "Gordon E."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-14", "description": "The Bad: This is in the up and coming Dumbo Neighborhood of Brooklyn. This is a place for true New York City residents only. I don't think this restaurant is meant for tourists. If you don't live here, it's going to turn you off. \n\nThe Good: This is an excellent place to get food right before work or during a lunch break. For dinner it's a relaxed occasion. It's casual dining, so if you want to get a bite with your co-workers it's perfect. It's French cuisine, and the restaurant has a cosmopolitan, worldly feel to it. I've seen a restaurant in Washington, DC called DGS which did similar overtures accommodating customers, and the proof is the consistent quality.", "author": "Jacob G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-09-10", "description": "Came here for a quick lunch with coworkers. For 3 sandwiches and a coffee ----35 bucks!? O.o? \nI ordered the avocado sandwich and it was good --tomato, lettuce, onions. I need to check this place out once more before I completely write it off.", "author": "Jessica S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2016-06-02", "description": "I was the only person sitting in the upper cafe area and I was doing some work on my laptop when I was informed that laptops are not allowed. Crazy. So I took my salad (which was decent but not particularly inspired) to go and will not be returning. Sad, since they clearly need business -- but I guess their quest for \"purity\" in the form of a laptop-free zone trumps their interest in catering to customers. I wonder if they will ban conversation next? This is not the Ritz -- it's a casual place with sandwiches, salads and coffee. And the coffee was served to me in a plastic cup! Hardly formal service. Pretty crazy that they seem determined to drive away customers.", "author": "Daniel C."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Archway Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "57 Pearl St\nSte B", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_Wy4I8VTrCQ9b28aMhLKWg/ls.jpg", "@type": "Restaurant", "telephone": "+17185223455"}