{"aggregateRating": {"reviewCount": 201, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2015-07-24", "description": "Oh boy. Where do I start. They got three items on our order wrong, and apologized for it over the course of the meal. We are pretty laid-back folks, so didn't send the food back, and just ate what they gave us. Then, when they brought the final bill, they billed us for the original items that we didn't actually get, which were more expensive. When I called it out to the waiter, he took the bill to his manager. When he came back, he explained that since the items we ordered were cheaper than what they gave us, they were going to leave it as is. But the items weren't cheaper! The waiter returned to the table four times, bouncing back and forth between us and his manager, before they finally admitted they made a mistake. Then they charged my credit card with the value of the original, incorrect bill, and threw in a few dollars cash compensation. On the way out, we checked the menu, and discovered that they did the math wrong and didn't compensate us enough. The food was good, so no complaints there, but oh boy, that service. Time to sign your employees up for Kumon.", "author": "Alan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-03-20", "description": "We ordered smoothies and the tiramisu cake. They were both SO delicious. The tiramisu was so soft and rich and one of the best I've had before! This place is both a cafe and restaurant. Service was excellent. I really enjoyed the layout of the space and the decorations. I would go back!", "author": "Jenny K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-10-19", "description": "Unbelievably rude manager( perhaps owner)! Three of us ordered coffee and desserts at the front and were told to take a seat towards the back. We were then told the area was closed ( there were two tables with customers seated there) . When I explained we had been told to take a seat, the manager intervened , asked why I was so \"nervous\" and said if weren't having lunch , we couldn't sit in the only available seats and should stand at the counter.", "author": "Rory B."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-04-22", "description": "The problem with DUMBO is that there aren't many places to go for lunch. This place isn't great--it's not even good. It's slightly less than okay. But, looking at other options in the hood, I get tired of paying Foragers prices, the food at reBar isn't even close to okay, and sometimes I don't feel like taking a risk on an unknown quantity. I can hit up Archway Cafe, get an almost decent sandwich--really, it is hit or miss, sometimes it's even better than decent--and spend around $8. That counts for something. But if there were a de facto okay place to eat, I'd go there over this place. I just haven't found it yet.\n\nSome factlets: guy behind the counter is surly, neighborhood cops come here and eat lunch, the ingredients are not decidedly not Grade A, etc. You get the picture.", "author": "Jake D."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-05-04", "description": "Made a quick visit here after not being able to find Retreat around the corner (not sure if now trading as another business or I just can't navigate!) \n\nAnyway, nice looking place with good music. Not the friendliest of service from the guy with the glasses but the younger boy who brings the food/cleans the tables seemed much friendlier.  We only had coffees and cakes. Would have given 3 stars however my cookie was a bit stale so overall experience 2 stars.", "author": "Andrea W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-12", "description": "Rudest service ever.  When I ordered a cappuccino, I got a scowl, presumably because I wasn't ordering food.  I mean, it's a coffee shop, right?\n\nThe place looks cool, very neat art on the walls, and the coffee was good.  The Wifi was fast, which is also good.\n\nBUT THEN, I got up to go to the bathroom and asked the barista where it was, and he, without even looking up from his laptop, said they had no bathroom.  I'm sorry, this is a sit-down food service establishment with no bathroom?  He ignored me, but I pressed further.  \n\n\"Where do YOU go to the bathroom?\"  Well he uses the barbershop next door, but they wouldn't let me use it.  He didn't seem to know or care about any concern I was having, and kept trying to brush me off so he could watch the cooking show on his laptop.\n\nSo unbelievably rude.  Never coming back here, that's for sure. What a jerk.  \n\nNo wonder the place is totally empty.", "author": "Eric B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-08-15", "description": "I just absolutely love the smoked salmon sandwich to-go. So much flavor! I'm always terribly sad when it's all gone.", "author": "Jonathan J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-03-10", "description": "I live in DUMBO but have never been in this place before.  I went today to meet a friend for lunch/coffee and studying.  The place was empty which was perfect because we wanted to sit and study for a while and were looking for a place where there would always be an empty table because if at any point the restaurant had been filled we would have given up our table for someone else.  But as it was, we were lucky and there were MULTIPLE free tables all afternoon.  We had lunch and coffee and desserts and tea and everything was pretty decent.  Our server was very nice and good at his job.  Then much to our surprise and dismay, the manager (perhaps owner) came and asked us to leave since the general policy is that laptops are only allowed for 20 minutes...\n\nWell, maybe if you weren't so rude, you'd have more customers...no wonder the place is so empty...I certainly will never go back there again...and I am actually studying for a big exam and would have gone there a lot...I'll take my business back to rebar where the food is better, the people are nicer, and you can even get a beer at the end of a study day...", "author": "Juliana G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2010-11-08", "description": "The owner gave me unnecessary attitude when I asked for a \"Half-Caff Coffee.\" He told me he didn't know what that was. Hello? You make COFFEE. Its half-decaf, half-caffeinated coffee. Please don't be so rude when you just opened for business. I am gonna tell my friends not to patrionize your shop.\n\nP.S. Your font type for your logo sucks. You mind as well use Comic Sans.", "author": "Yen D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-07-10", "description": "We live in DUMBO and stop here all the time. A few of the staff recognize us when we come in but have been friendly since our first visit. It's not always \"Hey! How are YOU buddy?!\", big-smiles friendly...but friendly.\n\nI can only speak for the grilled chicken Caesar sandwich, which is served warm on a fresh ciabatta roll. Absolutely delicious. I've tried the Greek sandwich too, but it's just too much feta for me. Coffee drinks are good here too if you like it on the strong side. I grab a cup on my way to work a couple times a week.\n\nThe ambiance lacks a little something. They appear to be taking a gallery approach in the elevated dining room which is appropriate for the neighborhood (at least until the suits finish the DUMBO takeover), but could use a little something...I'm not sure what.\n\nI'd like to see a few new sandwiches or menu items pop up once in awhile just to shake things up a little. Other than that, this is a great little spot for lunch.", "author": "Sean J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-02-23", "description": "If it were an option, I would give this 0 stars. There was hair in our food and the manager refused to give us a new dish. Too bad because I used to be a loyal customer. Will not be going back.", "author": "Samantha O."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-06-25", "description": "Um, so I went in there for a chai tea latter, and instead of saying, we don't have chai tea latte (a mix) they put two teabags in a cup with hot water AND steamed milk. Because of the ratio of milk to water my drink was very watery and instead of charging me the cost of tea, they charged me the cost of a latte which was nearly $5.", "author": "Laura F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-03-21", "description": "They are nice-ish and the drip coffee is fine, but the espresso is terrible. Better off going to rebar or BRC.", "author": "Lisa G."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-07-11", "description": "After experiencing a divine \"Iced Dumbo Coffee\" one day, I was sure this was gonna be my go-to DUMBO coffee stop during the day. \n\nThe next day when I went in and was informed that they had run out of the great chocolate they used and the remaining stuff was gross, I was mostly thankful and impressed with the honesty and advice.\n\nSince then, the vibe and my service has only been lukewarm at best and I hardly felt any more welcome on my 6th day in a row than the 1st. Mostly I just feel like I'm wasting someone's time when trying to decide on what to order, even though it's rarely busy.\n\nMaybe my standards are too high, but there are a dozen coffee shops in five blocks, and if you want to convince me not to just go to the ultra-friendly Starbucks or ultra-chic Brooklyn Roasting Company down the street, I'll need something extra. \n\nWhat a New York coffee snob I'm becoming....I'm ashamed to have posted this review even if it's the truth.\n\nOops.", "author": "Dan B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-09-15", "description": "While my sandwich (brie, chutney, arugula, and apples) was delicious, the environment for a lone eater was tense. When I came in there was a long line, although several tables were open. I got into the line and ordered my sandwich to stay. Apparently that's against the rules here, and my order came wrapped to go. I asked for a plate and was denied by the manager, who told me they didn't have time to plate it and I should have ordered it to stay. I informed him that I did order it to stay, and he still refused to give me a plate. I sat at the bar and ate my sandwich off the wrapping, which would have been the end of the conflict if the manager hadn't hovered around me every time I stopped eating. Distracted from my reading, I chomped through the sandwich and tried to play nice...", "author": "Rita C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-05-21", "description": "Quality of sandwich is great, My go to spot for a quick walk and grab the sandwich right under the bridge. Like the quality of the bread.", "author": "Pluto G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2014-12-05", "description": "If I could give this place zero stars, I would.\n\nLet me preface by saying I've come in here a couple of times before, and I've never really had a problem with them. But this time I got so upset that I had to write a friggin' Yelp review on this place. \nI came here to get lunch. I didn't even sit down, just grab 'n go. They don't have it written anywhere that they have half soup, half salads, but they do (I came with my coworkers who ordered half soup, half sandwiches). They didn't even have the price for that written on their boards. \nI got a half soup, half smoked salmon salad. Apparently it was 15.25. The waitress didn't even tell me how much it was until after she swiped my card. I even asked her if it was the full smoked salmon salad (which is only $10) and some soup. \nMy order came and it was a dinky ass salad with soup. I asked the lady who came out with it why it was $15.25 for both things. She said it was 12 (or so) for the half soup/half salad, with an extra $3 for the salmon. \nI asked if I could get more salad because really, a FULL salad is $10 and i'm PRETTY sure the small soup doesn't cost $5. She said she'd ask the manager. And yes, this is my fault, but really if you do the math it doesn't really add up. \nThe manager comes over and I tell him that a full salad costs less than what I just got, and if he could just give me a full salad instead and he tells me, \"Well, it's your responsibility. Your ordered it. I can't do anything for you. We'll work it out though. Next time you come, I'll give you a drink or something.\" \n\nOkay, you could have just said no or something but you didn't have to be rude about it. I was so upset that I just left and vowed never to come back here. Not friendly at all.", "author": "Laura N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-14", "description": "Despite the reviews below, I loved this place! First time there today for lunch and will definitely not be my last! Didn't have to wait for a table; I ordered the rotisserie chicken salad - DELICIOUS! My coworkers got the carrot cake, double chocolate brownie, chicken caesar salad and rotisserie chicken sandwich -- the service was great and the portions were huge for the price. Highly recommend it!", "author": "Megan T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-03-07", "description": "I find the sandwiches here really delicious, and everyone I've ever brought here feels the same way. I was really shocked to see so many negative reviews. \n\nThe bread is terrifically crunchy without being too tough, and the ingredients all seem quite fresh. The coffee doesn't quite stack up to Brooklyn Roasting Company a few blocks down, but it's not bad at all.", "author": "Jamie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-10-16", "description": "I was here earlier this week and had the kale soup. It was nothing short of amazing. I go for coffee everyday and fine decided to try the food on a whim. Unfortunately, menu prices are not always accurate so prepared for that.", "author": "Shar S."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Archway Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "57 Pearl St\nSte B", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_Wy4I8VTrCQ9b28aMhLKWg/ls.jpg", "@type": "Restaurant", "telephone": "+17185223455"}