{"aggregateRating": {"reviewCount": 201, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-24", "description": "Help yourself and don't waste money on this place. Want to be treated like s**t? Then this is a great experience for you. You'll buy drinks at this place and will be kicked out. Creep owner just stands at the front desk and stares at you. Not wasting my time arguing with this prick but anyways, hope you'll see this and change your mind about visiting this trash place.", "author": "Anton J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-12-24", "description": "So upset that I couldn't put 0 stars! Such a nice cute coffeshop with the rudest customer service ever! We came with my friends to get some drinks for take out. And I guess to use the restroom that's a normal thing, especially when you bought smth. But the owner of this place definitely doesn't  think so! He kick us out as soon as we paid for our drinks and he said that we can drink it outside if we are not buying anything else!!! Thanks for \"welcoming\" us, man!!!", "author": "Darina S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-08-20", "description": "Delicious breakfast or lunch spot in otherwise bleak DUMBO.\n\nService can be a little slow, but the prosciutto sandwich, tasty coffee, and salad options make up for it. \n\nTake an espresso to go after!", "author": "Cassie W."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-11-25", "description": "Went to Archway Cafe the morning after Thanksgiving to get some pastries to take back to my house for my guests.  Later in the day one of my guests whispered in my ear that the pastries were hard as a rock and clearly totally stale.  I was very embarassed and went over to Archway that evening to speak with the manager.  He told me he wasn't in the cafe in the morning so he coulen't opine on what was served nor do anything about it!!  He did not offer an apology nor a refund!  In fact, he was simply not interested in my feedback.  With stale pastries and a manager like that, I will never be eating at Archway Cafe again despite living in the neighborhood.", "author": "Roberta F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-29", "description": "it's Sunday in dumbo. Of course there's going to be a lot of random people... horrible attitude from the main cashier chick.", "author": "Yoshi T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-17", "description": "A cozy little place where the food is always good and the staff is always friendly. I come here often because I really enjoy their coffee:)", "author": "Kelly F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-12", "description": "The owner was not very welcoming. I had ordered a juice to go and was not allowed to use the rest rooms.", "author": "tung y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-01", "description": "Nice little place to stop in for lunch. They have a very laid back vibe and they do a bit of everything, coffee, lunch, dinner and drinks. \nTheir menu is on the healthier side but it has variety. There is a soup + sandwich or salad special at lunch. I chose the portobello salad, which was flavorful but light.  The marinated portobello mushrooms were soft and satisfying. The fresh greens were tossed in a light pesto dressing with a nice dollop of fresh ricotta and a surprise stuffed grape leaf on top. My dad ordered the salmon burger which was a nice size and came with a small side salad.", "author": "Julianne B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-03-18", "description": "First time. Got the smoked salmon sandwhich - it comes on a ciabatta bread with cream cheese tomato and greens. I prefer bagels and lox the traditional way but this was really good! Will come back to try more. Of course it's pricey...but typical for dumbo", "author": "Amanda S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-18", "description": "Really crappy customer service. Mean owner(?). Sub par food. Avoid. I'd rather go to McDonalds.", "author": "Anshul G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-04", "description": "Good spot for breakfast: great selection of juices and coffee.\nThe gravlax is good as well as the breakfast sandwiches.\nYou can pass on the pastries", "author": "Hélène A."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-07-15", "description": "I went there with my daughter for the first time. We ordered omelets with veggies. I must admit that the veggies were fresh and the omelets tasted good. I was extremely disappointed about the extra charge for additional cup of coffee. The first cup of coffee was $3 and I asked for a second cup, I was charged $3 again. It definitely left a bitter taste and I shared my experience with the waiter. Almost anywhere I have eaten breakfast, there was a free refill for coffee. We decided not to dine there anymore unless the place changes its policy about coffee. I forgot to mention that the service was great and we left a nice tip.", "author": "Shula L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-20", "description": "Delicious food and excellent service! There were so many items on the menu I wanted to try. I can't wait to go back for more. We ordered the cold tomato soup and the grilled cheese with pickles. Both fantastic!", "author": "Amanda T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-10-28", "description": "I have lived in the neighborhood for 5 years and have been grabbing a quick bite there with friends and family for some time. I will NEVER go there again. \n\nMy family arrived (starving!) after a long flight and I took them to Archway Cafe for brunch before I headed to work. The 4 of us ordered juices and meals all at once. The juices arrived and we sat for 25 minutes waiting... \n\nThe server arrived to say our food orders never made it to the kitchen and she has to take our orders again. She blamed it on a machine which seemed unlikely considering our drinks arrived. And no she DID NOT APOLOGIZE! Because we had eaten there so many times (actually we were there the previous week with houseguests) my husband and I reordered hoping to let Archway redeem itself. She returned promptly to say they would no longer be preparing our breakfast options (i.e. Our original order) because they were a few minutes past the breakfast serving time. Again, NO APOLOGY. She had the nerve to ask what else we wanted to order!!!! I told her nothing as this was beyond insane and she said ok she would get us our check. I asked what check? She expected me to pay $16 for juices after they wasted 35 minutes of my time? We then walked with her to the bar where she reported the issue to a man behind the counter. His incompetence was magnificent.\n\nHe asked me \"What's the problem? So your food didn't come but here is your check for your juices... You're drinking them!\" I said ok well you can drink them and we left them on the bar for him. He replied: \"Well I guess that's the kind of people you are.\" Yes, yes it is. We are the kind of people who expect actual customer service and an apology when that service level is substandard. \n\n(\"My apologies, it's on the house guys\"... That phrase exists for a reason.)\n\nI don't know his name but I will refer to him as Mr. Uneducated. I hope he is the owner because he is certainly not a manager! I rather he be ruining his own business than someone else's.\n\nMr. Uneducated, in spite of my humble appearance, I am a successful Business Manager with a prominent American corporation. I handle internal and external service and operational complaints all day so I know the value of my client's $16. For instance: I am always in a hurry and have paid for 2 cappuccinos at Archway to meet the minimum credit card total, just to purchase 1 on my way to my mani/pedi in the area (where I am a valued customer). So yes, Archway owed me cappuccinos! If one customer spends $100 per visit with me, I rather comp them the $16 as a reasonable apology in order to have them return to spend that $100 again and again. Had you even APOLOGIZED and INVITED us to return the following day at a set time when you would have our exact breakfast order ready, I would have encouraged my family to go while I was at work. They would have tipped well out of appreciation for the consideration. \n\nBut alas Mr. Uneducated does not know how to solve the problem created by his team and punishes the customer instead of valuing them. My best friend in NYC co-owns and manages top NYC restaurants and bars. Let me know if you need him to stop by to teach you everything you clearly don't know Mr. Uneducated! I can recommend some good business literature for you too! \n\nFYI we went to Almar instead for a 3 course meal for 4 (do the math) where the food and service were both excellent and I have eaten there twice more this week alone, just to avoid the horrible Archway.\n\n*", "author": "Colette F."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-21", "description": "Grabbed some breakfast here. Located right next to the Brooklyn flea market on Sundays. Baked egg meals were really tasty and the sausage, egg, and cheese sandwich was delicious. It's in a small place, but the atmosphere was light.", "author": "Briana M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "I've only had take out from this place, but in an area that seems to offer very few healthy/fresh lunch options, this place is a godsend. I've had the salmon platter with various vegetables as sides (Brussels sprouts, roasted squash) which were all quite good, as well as their tasty wild rice. I also enjoyed their maple lemonade with my meal. \n\nPretty sure this will become a regular lunch spot for me, especially because there are many other things on the menu that look tempting. My coworkers spoke highly of the roasted chicken salad with pesto.", "author": "Nicole T."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-11-20", "description": "At first I was shocked to see a 2 1/2 star rating but now I get it... Ordered an overprice half soup, half salad. The chef double/ triple wrapped the soup container in plastic wrap to make sure it didn't spill. Great but then it look me almost 5 minutes to unwrap the soup without making a mess. Even being careful the soup slipped u from my hands and spilled all over my phone and work desk!\n\nI called Archway explaining what happened hoping there would be some compassion to get a new soup (since I just left that place). I got such a rude response about how they're not going to pay for a soup I spilled. Ugh EFF THAT!!!\n\nThere are so many places around DUMBO to get better tasting and better priced soups! I only came here because I like to be loyal to my neighborhood restaurants and cafes! NEVER COMINGG BACK AGAIN AND NEITHER ARE MY COWORKERS.", "author": "Erica S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-01", "description": "The food and service here are exceptional! I've enjoyed coming here for breakfast, lunch, or dinner for a long time !", "author": "Nick K."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-04-13", "description": "I have worked in Brooklyn for over a year and a half and frequent Archway often for lunch. I have a severe food allergy to peanuts and treenuts and have always told the person at the bar when they input my take out order. Never had a problem until today... when the manager proceeds to come up to me for the first time ever and tell me that he will not take responsibility for people who \"claim\" to have severe food allergies. I asked why this was the first time I was being notified that it is not safe to eat here and he said well I am \"telling you now\" and \"that he does not want to be responsible if I have an allergic reaction\". I told him that a lot of other restaurants are always very accommodating to my food allergies and what he is essentially telling me is that he and his staff will not take the extra steps to ensure a safe eating experience and he said they \"prepare 500 meals a day\" which clearly means they don't have TIME.\n\nWith allergies being on the rise (no matter what food it is), restaurants need to learn how to accommodate and if they cannot 100% guarantee no cross contamination will occur, then they should respectfully let the customer know as opposed to the way the manager at Archway Cafe in Dumbo Brooklyn handled it. \n\nEven if you don't have allergies, is it really worth eating at a restaurant that clearly doesn't take peoples lives into consideration and would rather lose money than excel in customer service and experience?", "author": "Nicole W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-22", "description": "Customizable\nsmoothies for like 8 bucks or\nsomething. It's okay.", "author": "Linda W."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Archway Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "57 Pearl St\nSte B", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_Wy4I8VTrCQ9b28aMhLKWg/ls.jpg", "@type": "Restaurant", "telephone": "+17185223455"}