{"aggregateRating": {"reviewCount": 201, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2014-10-23", "description": "The food is very good and the service couldn't be better. We use this place as our go-to restaurant close to home.", "author": "Eusebio P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2013-06-23", "description": "Went to this place yesterday afternoon. I got the chicken salad and my friend go the pulled pork platter.  Both were very good.  Our waiter was a sweetie. Service was more than prompt.   Don't know what the other problems were, but they sound like a bunch of spoiled 5-year olds who only want their lap-tops to work and cry WAH WAH WAH if there aren't enough sockets or something ridiculous like that.  This is not your living room this is a cafe.", "author": "Diane S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-02-14", "description": "I just started coming here recently and I love the food selection. I normally stick with the roasted salmon or a omelette for breakfast. Both taste great in my opinion, the staff is super friendly, and the atmosphere is very calm and relaxing (perfect for a lunch time get away).", "author": "Malika B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-05-13", "description": "Food is good, but the impatient/dismissive/rude service is enough to leave a bad taste in my mouth. In one trip, the cashier greeted me with a snotty/impatient attitude, refused to let me change an order that he only keyed on 2 seconds prior, gave me a sandwich when I clearly ordered a salad and wouldn't correct the problem, and wouldn't print me out a receipt when he forgot to give it to me the first time. He seemed like the more senior position in the cafe, but had a total lack of professionalism and courtesy. Will continue to go here because I like the food, but will absolutely turn right back out the door if he's the one to be taking me order in the future.", "author": "Em C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2011-11-20", "description": "third try over 4 months or so and surely, was unimpressed....\n\nThe first time I tried it was because it was new, I remember the sandwich having way too much gorgonzola cheese because the server was unsure of how to make the sandwich, the second experience would've gotten 3 stars because it was average at best, today I stopped in for a cup of coffee....\n\nThe server seemed somewhat bitter or perhaps just unfriendly, I ordered, \"Can I just have a cup of coffee?\" I received a LARGE rather than a small which I would expect since she didn't ask what size I wanted.  Really? I kept quiet, paid the 2.50 and it was comparable to a bodegas coffee at best!  No flavor, ultra light, didn't finish it.  I'm gonna walk the extra block or 2 to Starbucks or Brooklyn Roasting Company to get a decent cup of coffee.", "author": "Joshua F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2014-07-23", "description": "I love this place. I get delivery at least once a week and its always delivered quickly. The bread on the sandwiches is awesome.", "author": "Brittany F."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2014-05-28", "description": "The atmosphere is nice. Someplace to come with some friends and hang out. The service needs improvement. There was a miscommunication with how the sitting arrangement were set up. The waiter did not explain anything to myself or those in my party. He only took our drink orders, slammed them on the table and gave us a smug attitude to go with it. The food is OK however due to the snotty service. We won't come back nor will I recommend it to anyone.", "author": "Jay C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2011-08-29", "description": "Just had a wonderful cappuccino here the day after Hurricane Irene.  Everyone in the cafe was smiles.  I've never had a bad cup of coffee here.", "author": "Lindsay M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-12-12", "description": "A group of us went there to try it for lunch, nice atmosphere but poor service and expensive average-at-best food. We all ordered sandwiches (one person getting a $2 add-on on theirs) and not a single sandwich was correct. Without apologizing, we were told that they \"don't do custom orders\" even though we ordered directly off the menu. Our friend was still charged the extra $2 for the add-on that wasn't added. It was somehow all our fault. Even with the few food options in Dumbo, I would avoid this place and go anywhere else.", "author": "Antonelli B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2010-11-12", "description": "Class act.  Awesome vibe with music to match.  Double shot espresso reccomended", "author": "Roger K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2011-02-03", "description": "I go to this Cafe frequently, and I have to say the food is good and the management is friendly, if you are human being. \n\nIf you are a typical NYC Brat who wants it \"YOUR WAY RIGHT NOW\" or you'll have a temper tantrum on your IPad, this isn't the place for you. \n\nIf you are used to a more European style of service, where you walk through the door, say hello and act like a human being, then definitely come. \n\nThe manager here always shakes my hand and asks how I'm doing. \n\nI frequently forget to bring cash, and management lets me return and pay at a later time. \n\nIn any case, haters gonna hate, but I love this place.", "author": "Davyde W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2011-04-19", "description": "Some great sandwiches to choose from  - the \"mortadella, sun-dried tomato provolone, artichoke hearts\" was great - but there seems to be some disconnect between the kitchen and the menu. The \"brie, pear, arugula, jam, mustard\" was really tasty but would have been better if there was actually some arugula. And the \"smoked salmon, cream cheese, red onions, tomatoes, lettuce\" was delivered as \"smoked salmon, pesto, capers and pickles\". Huh. Things are also a bit slapped together...not a lot of love on the cutting board. Hit or miss.", "author": "John S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-24", "description": "This is my first yelp review but I'm so miffed that I had to comment. We came in on a Saturday afternoon to have lunch and get a little work done - all was fine until the overweight manager with glasses came over to our table and scolded me for having my laptop plugged in to the outlet next to our table - apparently the electricity was \"'not for customers' use\" and I was supposed to know this though there was no sign or other indication. He then told us that our internet time was \"up\" and went downstairs and abruptly shut off the wireless! All before we even got the check for our lunch. When he came back upstairs we asked him to please bring the check since he was in such a hurry for us to leave (btw the cafe was 2/3 empty) and without making eye contact he dryly said \"pay on your way out\" and walked away. (The tables around us had received checks to their table by their waiter, who was very nice.) Unbelievably rude.", "author": "Kat K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2012-03-25", "description": "I usually go to DUMBO on my days off to unwind with an Americano and good music to get away from the hustle and bustle of Manhattan. Came here on a Saturday afternoon, didn't have lunch so went in to the nearest place I could find to grab a quick bite. The place itself wasn't too crowded so that was good as I wanted some quiet time. Their main food option are sandwiches and there are plenty of coffee drinks. I liked the fact that they had artwork and framed paintings on the walls which gave it somewhat of a \"hip and creative atmosphere\". I got the Prosciutto Di Parma sandwich which was $7.50 and an Iced Americano for $3.50. The sandwich was good but nothing special and Americano was alright as well. The server guy was attentive and friendly. The only downside was that the music they were playing in the background was Salsa or some Latin Music you would hear on a beach resort in Cancun Mexico. If they would've put on Norah Jones, it could've earned an extra star but for now, it's 3 my dears~", "author": "Old Fart M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2012-10-21", "description": "Great place! I've had a business in the hood for around 2 years. In that time, I've personally consumed 100s of archways tasty turkey BLT on panini and served it up during many client sessions. Always great. After a hard night at jay st bar, nothing's better than Arty's breakfast sandwich. Super tasty. Arty himself is a great guy-- never experienced a bad moment with the guy-- usually walk away after having a laugh. Most negative reviews here are Internet related. Idea: shut your computer off while you eat. It's good for the soul, and digestion.", "author": "B C."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-03-18", "description": "worst ice coffee ever. i watched them pour regular coffee into a cup with ice, resulting in the weakest most tasteless coffee i have had in a long time.  great location, absolutely terrible ice coffee..... i wont return.", "author": "Andrew W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-02-27", "description": "I came in here to get a sandwich to go. I got the mozzarella sandwich. The bread was warm and tasted really good, if not homemade. If they don't in fact make their own bread then I am assuming it was just brought over from some place that took it right out of the oven. The overall sandwich was pretty good. My only mild complaints are that the mozzarella was a little runny and looked gross... but it tasted good, and the sandwich was really tiny. I probably could have easily eaten two. The service was fast, and I didn't have any problems with rudeness, as others state in the reviews.", "author": "S H."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-01-21", "description": "Whats worse than terrible? Archway is. But let me take a step back for a moment. You see, everyone that comes to dumbo soon learns that it is easily the worst neighborhood in nyc to try to eat in. From terrible food to ridiculous prices it is through and through a dumpy hell hole. It is for that reason alone that this atrocity can stay in business. To be fair, the food is okay. It's every other aspect that struggles so hard. Starting with the bro that works behind the counter. If a frigid reception, crusty interaction, and down right rude speech is what you're after then this is your spot. If you also like not getting a check so that said bro can make up a price as he sees fit...jackpot. Unfortunately this ogre is terrible at math and cant keep them consistent making it dreadfully obvious that that's what he's doing. Sounds great right? Welcome to Dumbo.", "author": "john s."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-07-19", "description": "The man who runs this place is so rude. Not only is he obviously a complete terror to work for (barking orders at his waiter and chef as he checks his phone), but he was incredibly short with me, telling me to leave when the place was empty. It was true that I had been working there with a laptop for more than an hour, but I certainly wasn't preventing anyone from getting a seat. (Before that they'd passive-aggressively shut off the wifi.) But I wasn't freeloading--I bought an incredibly overpriced water and one of their mediocre sandwiches. 8 dollars for a piece of bread smeared with hummus? Get real. Even though I live in the neighborhood, I won't be going back...", "author": "violet l."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2011-09-24", "description": "The worst iced coffee ever! The manager was berating an employee right in front of me and it wasn't even busy. The iced coffee has a smoked flavor. When I asked if they had a bathroom. He told me it was \"out of order.\" Avoid at all costs.", "author": "Mandle F."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Archway Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "57 Pearl St\nSte B", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_Wy4I8VTrCQ9b28aMhLKWg/ls.jpg", "@type": "Restaurant", "telephone": "+17185223455"}