{"aggregateRating": {"reviewCount": 201, "@type": "AggregateRating", "ratingValue": 2.5}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2015-08-04", "description": "I go here probably once a week for lunch and am always happy with what I get. Their pulled chicken entree is my favorite! I also love their sandwiches and salads. And, I've always found the service to be really friendly and prompt. I'll continue going here as long as I work in dumbo.", "author": "Catherine M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-08-18", "description": "The pros? It's a pretty aesthetically appealing place. Part of the cafe is lofted, and the space is filled with interesting modern artwork. It has a homey, industrial feel, and the music is top-notch.\n\nThe cons? Their hours are wholly inconsistent. I've tried to go there multiple times since I've moved here and they're just randomly closed (but welcome to DUMBO), which is frustrating. \n\nI ordered an Arnold Palmer (half tea/half lemonade), and it was flavorless. I've had their coffee, and it's nothing to write home about. \n\nThe barista was indifferent, bordering on rude. I had some work to do, so I asked if they had wi-fi. She said yes and mumbled something about a 30-minute time limit. I took my drink and found a table. The wi-fi was locked so I had to go back up and ask for the password.\n\nThen, after my 30 minutes was up, someone actually came over to remind me that I had to go... which would have been understandable if the place was busy, but it was dead. Terrible service.\n\nThere are much friendlier places to go in DUMBO (with better drinks). I won't be going back.", "author": "Greg C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2016-09-24", "description": "Ended up here today and because I was really hungry decided to grab a bite. I chose the veggie platter with hummus. Hummus was ok but the rest not so good. The vegetables looked and tasted like canned food, watery and weak. They threw in a few leafs of salad and that was it. A bit of a tourist trap since it is next to the bridge and water.", "author": "Denise S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2016-09-20", "description": "Excellent iced coffee! I've never had anything else there but the menu looks great as do the pastries in the front.", "author": "Jamie L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2013-05-22", "description": "This review is strictly on delivery orders.\n\nOrdered here twice for work. Disappointed that it's a minimum $20 (!!!!!) for delivery. That is ridiculous ... and the problem is the salads are so yummy and carefully made. I can't say no. But seriously. Think about changing the minimum. Not fair for people who want to eat a good meal in the area and can only eat for one person.", "author": "Evmorfea M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-01-07", "description": "The bacon, egg and cheese on ciabatta is delicious, but only served until noon. Wait staff is efficient and friendly. Cute place to grab coffee and read for a bit. I love that they have chinotto, yum!", "author": "L G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2015-08-14", "description": "This is not something I have ever done but my experience at Cafe archway was so vile that I felt the need to express. The pleasant atmosphere was overshadowed by severely poor service. A server who rolled her eyes several times while talking to me. I get it, you don't like your job. I wouldn't like working for what I assume was your owner/manager. \nAfter taking a single bite of my sandwich, The taste was not something I anticipated. So I kindly asked if we could swap it for something else. The server rolled her eyes and went to her superior. He brought the sandwich back and proceeded to argue with me about why this was the most popular sandwich and the sandwich doesn't taste right because of the sauce I chose to put on it. I have been in the restaurant since I was literally a child and currently work in high end dining. When a customer expresses dissatisfaction over a dish - instead of arguing - you try to get them something they WOULD like. I explained this to the manager who didn't seem to see the purpose of customer service. I asked to pay for my drink and noticed him gossiping at the bar with a server about me. After I paid and I was walking out. The owners shit-eating grin was burned into my memory.  Doesn't matter what the case: customer is always right, you asshat.", "author": "Danielle E."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2015-04-04", "description": "Wow ok. No idea this place had 2.5 stars. I so far have not had a terrible experience there. The pulled pork or pulled chicken entrees are pretty decent (the sauce is what make them). Other than that, I can't really comment on what everyone else is saying, but I'll be on the lookout!", "author": "Mike C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-28", "description": "This is such a great place to have in the hood. Breakfast and lunch options that are healthy seem to be hard to find. The servers are so hospitable and kind. No laptops in the afternoon, but you can carve out a great spot for coffee and a snack with some work in the morning.", "author": "Lindsey S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-07-07", "description": "I get lunch here more often than I'd like to admit. The service is on par when you eat on site, and the delivery times are pretty quick when you decide not to. The food is great, and so far I haven't been disappointed. My only complaint was the constant trains overhead made conversation a little difficult, that's out of their control. All in all I'd recommend this place.", "author": "Jonathan B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-11-01", "description": "Went in here for the first-time - late Friday about 5:00pm and this place was DEAD. I mean literally NOONE. So, I ask the waiters if I can sit with my laptop and some notes. I order a coffee (tasty + fast service, + friendly waiter) Then about fifteen or so minutes after that order a sandwich (decent) I finish that up and then keep working. By that time another group of 5/6 who came in for coffee only had come and gone and there were only two folks sitting at the bar besides the wait staff. Then, the waiter reluctantly tells me the owner called and asked that 'noone stay in the dining area' longer than an hour. I look around and wonder (1) where the hell is this mysterious manager and (2) noone is here, like NOONE, are you serious? I have never run a business, but I have a feeling it helps a business to have folks INSIDE and not send them out. \n\nI slowly pack up (and overtip the waiters since it sounds like their boss sucks) and then look around and discover a camera over the door where said intrusive manager who needs to find a way to invite people to his business and not send them away was watching me (I am SO not coming back and also SO creeped out)", "author": "Paula W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-01-03", "description": "I've passed by Archway Cafe many times walking from the F train in Dumbo. Ordered the Pulled Pork Sandwich on seamless and picked it up on my way to a friend's apartment. The sandwich was delicious and not too badly priced for the food. The roll that it was on was also very fresh tasting. I would definitely get this again.", "author": "Katie O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2015-05-11", "description": "They've really improved their business over the past few years. Quick delivery and the food is delicious.", "author": "Kathryn F."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2012-03-06", "description": "Where do I begin...\n\nI know more about Archway than most.  \n\nTo all of you asking about the bathroom--it's always out of order because there isn't one.  He walks down a long hallway to go to the bathroom in the basement of the building, which is, of course, against the law.\n\nTo those of you who complained that he gives larges instead of asking--he yells at his staff when they automatically give smalls.  More $ for larges, of course.\n\nThe food storage is not up to snuff.  I'm sure they got a terrible grade from the health department.\n\nWorst of all, in my opinion, is that the owner (the rude guy) hires staff, says he'll pay them in cash and then puts them off with excuses, until they quit.  HE NEVER PAYS THEM.  Hundreds of hours, hundred of dollars...so sad.  \n\nFormer business partners come in often, yelling at him about ripping them off for thousands.  It's nerve-wracking.\n\nThe internet is often \"out of order\" because he doesn't like when people stay for long periods of time.\n\nThis place is run illegally, improperly and with no regard for other human beings.  It should have gone out of business a long time ago.", "author": "Meghan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2014-08-28", "description": "Definitely one of the best places in Dumbo for breakfast delivery. Good food delivered in a timely manner. I order from them almost every morning when I get to work.", "author": "Ripov V."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2015-02-14", "description": "We live in the neighborhood and love Archway. I've never been able to figure out why it's never crowded as the food is great, staff is friendly, and the ambiance is similar to a small European cafe. Stop in and give it a try!", "author": "Danielle D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2012-05-28", "description": "Zero complaints here. Looks like maybe the owner has read some of the reviews, as today's server claimed it was only her second day and there is a help wanted sign in the window.\n\nOur table of 5 all got our orders surprisingly fast. I enjoyed the omelette sandwich, which was large and hot. My side salad of arugula, salt and lemon was a pleasant surprise. \n\nMy wife's \"grilled\" cheese (it wasn't grilled) was tasty as well. I'm personally not a fan of ciabatta rolls, but they seemed to know how to work them well.\n\nLooks like I'll be visiting Dumbo more because of work, and I look forward to another visit. Hopefully I won't have a bad experience like mentioned in many of the other reviews for this quaint little spot.", "author": "Dustin H."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2015-12-10", "description": "Like all places in DUMBO, Archway is overpriced for what you get. The food is passable, though if there were more lunch options in the neighborhood, I would never go here. The portions are small, the food is expensive, and the service isn't great either.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2013-11-06", "description": "Been there a few times, since it is so convenient to that part of DUMBO, but unfortunately it has not improved much.  The final insult came in the form of the sloppiest, most mayo laden tuna sandwich I have ever.  If I was not in a hurry I would have returned it.  And the communication skills of the staff and owner are not really the greatest.  You just don't feel welcome there.", "author": "Jon G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2013-04-22", "description": "Puck off, Archway. I am paying you $$ for a mediocre sandwich, please treat me like a customer. Basically, the food isn't good enough for me to want to come back here and get treated the way I did by the staff.", "author": "Nico S."}], "servesCuisine": "Breakfast \u0026 Brunch", "priceRange": "$11-30", "name": "Archway Cafe", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "57 Pearl St\nSte B", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media4.fl.yelpcdn.com/bphoto/_Wy4I8VTrCQ9b28aMhLKWg/ls.jpg", "@type": "Restaurant", "telephone": "+17185223455"}