{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-31", "description": "Tried nearly all of the menu with friends. Big, bright flavors, lots of spicy, everything tasted fresh.\n\nA great addition to the neighborhood, and some of the best Chinese I've had in NYC period.\n\nHoping they add delivery to their lineup soon!", "author": "Rich J."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-11-08", "description": "The wei serves good Chinese good, however the service can use improvement.\n\nThey apparently have a policy not to give you extra meat on the side (that you will actually pay for).  Their policy which makes absolutely no sense is everything must be served in the bowl - nothing on the side.  This is literally the first place in NYC to ever implement this stupid policy especially that you are paying for all you are getting.", "author": "Imane D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-28", "description": "They give alot of rice/noodles. You can choose two different rice/noodles, but only 1 protein.  Tried the mapo tofu and beef and string beans and the beef is reaaaalllyy good. Not many people there on a Friday night.", "author": "Monica L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-28", "description": "I want The Wei on every block in NYC. Solid traditional Chinese fare served in a fast casual style. All your classics in one bowl--I got mapo tofu, eggplant, string beans, scallion fried rice. Each item was executed well...that bowl could have easily melted in a pile of saucy mush, but these cooks are doing some sort of wok magic behind-the-scenes because everything complemented all other components both in flavor and texture. Highly recommend!", "author": "Monica C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-07", "description": "Was expecting more with all the good reviews, but this place really did not wow me. Nothing was terrible, but everything was kind of boring and a little bland. No better than any other fast food place pretending it's something more. This is just Chinese chipotle and I wasn't impressed. I was expecting a step beyond that.", "author": "Bea L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-04-27", "description": "The local Chinese version of Chipotle. Really solid choice for lunch. The serving is enough for two meals and everything was good. The Garlic String Beans were a little salty but definitely works with the slight sweetness of the eggplant and roast pork. The Passion fruit tea with lychee jelly was sweet and refreshing. It wasn't crowded at lunch (~1pm) and the servers were friendly and efficient.", "author": "Rudi M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-17", "description": "Love this place! Walked by to go to DeKalb Market until I got distracted by the plate of food some guy was eating in the window.  I walked in to check it out and I was greeted by some of the most kind staff that I have ever encountered in NYC! Usually staff are just in rush and no time is wasted on being kind so this was extremely refreshing. They helped me order since it was my first time and all their suggestions were DELICIOUS! Did not fail with anything :) so good! Not to mentioned the portions are very generous! Overall so impressed. Found my new go-to", "author": "Bernadette D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-09-15", "description": "Came here to pick up food with my fellow coworkers for lunch. It's basically a Chipotle style Chinese food spot with a simple menu. My combo was the green fried rice-Market chicken-bok choy with sour cabbage and pickled radish. To my surprise, it actually tasted good. The chicken was more on the tender side than the dry side. Not overly sauced up. Rice was fluffy and hot with a nice hint of a scallion taste. Bok choy tasted fine and crunchy. Not salty. Staff were friendly. Would come back to try the other proteins on the menu. 3 1/2 stars, but rounding up.", "author": "Cory D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-25", "description": "I cannot wait to go back. I just went in because I was in the area. I'll be a happy returning customer always. It has a chipotle concept but nothing but great flavor. Enjoy!", "author": "Jassiel M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-14", "description": "A great new spot that's easy to get to by train. Nice fresh take on Chinese food thats readily available. You must try the green, scallion infused, rice... it's awesome with the steak and string beans. Oh, and the cold noodles are a whole meal in itself even though it's listed as a side.... so good!!!", "author": "John F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-11", "description": "Best mapo tofu I've had this side of the Atlantic -- Avenue and Ocean! Clean with courteous service. Mapo tofu has the mala flavor that often goes missing from the more Panda Express type spots. They even have the red can iced herbal tea. Two thumbs up!", "author": "Charlito B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "This place is very tasty and affordable .I think the stand out is the green fried rice infused infused with scallions.", "author": "Patrick '."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Great new addition to the neighborhood. Food is great. Do yourself a favor and get a bubble tea too!", "author": "Konrad B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-05", "description": "Found this place because of MealPal.....So far only had the chicken, but it so clean and fresh! This is my new spot for lunch now.", "author": "Sheneque A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-23", "description": "Delicious! I am eating my bowl right now and trying to understand how it is so flavorful. HUGE portions, with a protein and 2 veggies, enough to save for two meals. Prices are standard, not cheap, but about what you would pay for Chipotle. And the workers are very friendly. Def recommend!", "author": "Ian M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-28", "description": "Uniquely fresh and delicious Chinese food!!! Highly recommend the green scallion fried rice, popcorn chicken, and taro bubble tea! Everything on the menu was incredible. Love that they offer vegetarian options! Great value, I was so full from their lunch special. Finally a piece of Flushing in Brooklyn! Can't wait to eat at The Wei again.", "author": "Vi M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-03", "description": "Not your old time , regular, fast food Chinese place I've been use to it was clean modern different fun I like you get to chose your base , protein, vegetables...\u0026 so on \u0026 so on ....  it's like a upscale chipotle for Chinese food but better I guess.  Any way \u0026 it wasn't that heavy sauce'd food I was use to w/ other take out ...... glad to have this place by my work", "author": "Joseph W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-09", "description": "Really love this concept! Great tasting fast Chinese food. Good sized portions. Love fresh scallion/green onions. Love that I can order tofu with varying flavours. Yum! This is Chinese fast food I can trust that what's in it.. sorry not sorry.", "author": "Hadiza A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-12", "description": "The Wei is delicious! For about $10 you get a giant bowl of food. My boyfriend is an extremely happy eater and even he was full. It's Chinese \"Chipotle-style\" where you pick your protein and base and sides. The bright green, scallion-infused fried rice is heavenly. The place is small and casual and perfect for a quick bite.", "author": "Allison P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-18", "description": "Solid chinese food, you get your choice of base i cluding noodles, fried rice, and veggies, then meat and sides for around $10. May seem pricey for Chinese but it's plenty of food to cover even the biggest appetite. My girlfriend and I shared a bowl and were both full. Food tasted better than Panda too, very authentic and everything didn't taste the same.", "author": "Arthur V."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "The Wei", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qqTOxjfWxFEUpn9AKt44Ow/ls.jpg", "@type": "Restaurant", "telephone": "+17182608888"}