{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-18", "description": "Great place! Le boyfriend loves it too. He'll ask me to pick up a bowl on my way over, even though he lives on the UES! \n\nThere's not much else to be said about the menu options. The other reviews do a pretty thorough job.\n\nAnyone who says the portions aren't large enough must eat like a linebacker. At Wei, they definitely pile it on!!!!", "author": "Shirley Z."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-18", "description": "The Wei is a great addition to Downtown Brooklyn! I'd say it's sort of a Chipotle-style Chinese hipster eatery with great affordable and filling options! Everything tasted fresh. The staff was also very friendly and attentive. You choose your base, protein, 2 veggies, and whatever toppings. I got:\n\n-Green fried rice: I really loved this rice! They infuse jasmine rice with a scallion sauce and fried eggs. It was a generous portion. It makes me want to make my own. \n-Black bean steak: Really loved this steak. It didn't taste as oily as beef usually does at your traditional Chinese restaurant. It definitely had a lot of flavor--didn't feel necessary to add any spices. \n-Sichuan eggplant: Although very delicious, it was a bit on the oily side. I would have preferred less oil, but still loved the eggplant nonetheless.\n-Shanghai Bok choy: Nothing special here--tasted like what you would expect from sautéed bok choy. \n-Fried crispy shallot, sesame seeds, and pickled radish: I love that they had garnishes to top off your bowl! The fried crispy shallots added great texture and I loved their pickled radish. It was the right amount of tart I needed for my bowl! \n\nI'll definitely be returning back to this place! They also sell bubble tea for $4--it's one size only. The size is what you would consider a large at other bubble tea places. Didn't get to try it, but will next time!", "author": "Gena L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-07-03", "description": "I love Asian foods but when to try new Asian restaurants I always feel intimidated. This place is self service you can get it to go or you can eat over there. The service is fast, I really liked the place, it's quite modern and their bowls are pretty good. They close too early, they are open till 9 pm that is the only thing I would criticize.", "author": "Bella A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-20", "description": "Chinese Chipotle? Yes please! The string beans and Sichuan eggplant  - those are the things which serve as a main reason everyone should give this place a try.", "author": "Peter O."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-16", "description": "I sooo wanted this place to be amazing !! I live so close by and I needed some authentic Chinese food. I ordered the green rice with chicken bok Choi and seasonal veggies. Like other yelpers reviewed... it's moderately priced. I paid under 11 bucks for one bowl.  I was so excited to munch on my first bite... but I was disappointed.  My chicken was overly salted and my bowl was drenched in oil.  I really had higher expectations for this place.  Maybe I just went on an off day??? This is a new spot and I think they've been open for only a couple of weeks.  They still gotta tweak a few things but I'll be willing to try it again maybe in a few months when they get a handle on things (the salt... the salt was killing me).    \n\nThe decor of the place was cool, I'm sure the LIU kids across the street would appreciate it. It had a laid back vibe with rustic wood/metal tables and chairs. Would probably help if they had delivery too.", "author": "Connie L."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-27", "description": "Some compare the Wei to a nicer Panda Express but as my friend said \"I'd rather eat at Panda Express\". First off, the green rice was mushy. How can an Asian restaurant mess up rice? The veggies we had were overcooked - both string beans and eggplant. The noodles were ok, and the pork was good. The sauce for the pork is really sweet so I suggest getting it on the side. We also got the steak and it was exactly like cheap Chinese food beef, so I wouldn't recommend it. It's nice they give you variety and it comes in a nice biodegradable package. But otherwise, your average Chinese takeout is cheaper, fresher and tastier.", "author": "Julianne G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-03", "description": "Good dumplings are hard to find but this spot has great ones. The staff is super friendly and awesome as well. Told me the popcorn chicken was spicy and it was so amen to that fire. Definitely got my monies worth!", "author": "Elvis S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-08-13", "description": "This is a step up from the mall Chinese spots.  I tried the scallion fried rice, beef, string beans and bok Choy..... the entire dish was oily. I didn't need any lip balm after eating, I can just imagine what it's doing to my arteries! \n\nThe scallion fried rice had no resemblance that scallions were introduced to this dish. It literally tasted like plain white rice..\n\nThe beef was the weak link... no flavor what  so ever. \n\nThe book choy was tasty but too oily.\n\nThe string beans were winners! Yummo! I wld have been happiest if I had the string beans and the rice as the whole dish! \n\nI love the concept, but the execution missed the mark for me.  It might have been better w/ the grilled chicken and double string beans...", "author": "Shea G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-07", "description": "The chipotle of Chinese! The wei is a great option in Downtown Brooklyn for lunch where you can make your own bowl with a rice or noodle (try the scallion infused rice!) a protein (tofu, chicken, pork, beef,) and veggies galore (my favorites are the string beans and eggplant!) it's consistently delicious and can definitely be saved for a second meal since the portions are large. I believe the Wei is a small chain but I think they have potential to be the next chipotle!", "author": "Rachel M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-21", "description": "I came here for lunch and tried the green fried rice with grilled pork. The veggies were actually my favorite part of the meal. The string beans and bok choy were delicious, cooked well, and nicely seasoned. The pork was a bit greasy and there were some extra chewy pieces of meat. Friendly service. Food is reasonably priced and portion sizes are large - large enough for two meals.", "author": "Lauren W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-03", "description": "Was in the area looking for dinner. This is a chipotle style Chinese restaurant! Great experience, will come back soon! Gotta try the green fried rice next time!", "author": "Daniel L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-05-10", "description": "My first time trying this place and it was pretty decent. They have two of my favorite vegetables: eggplant and broccoli and that will be the reason that I'll be coming back again. I forgot what it was called but I got the crispy popcorn chicken as my protein. I regret getting that one because it was deep fried and it didn't seem to go well with the other healthy components of my meal, but it was definitely good though! I just wish they had more sauce options (only have 4 sauces) because I did want sauce in my bowl but none of the sauces sounded appealing.", "author": "Ada C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-17", "description": "Not bad, would definitely come back. \n\nI have such a soft spot for these new fast casual Chinese food places that are emulating the hugely successful Chipotle model. They taste healthier and fresher than a lot of Chinese food at the same price and I love the customization. The Wei is pretty good, all the flavors are there but there are some missteps that prevented me from loving this place more. \n\n- The crispy mala chicken wasn't crispy and there wasn't that much chicken itself, most of it was breading. The chicken itself wasn't spicy to the level I was expecting. However, the portions were GREAT - I got so much chicken in my first spoonful I was already pumped about this place, but then the employee gave me ANOTHER huge spoon of chicken and then ANOTHER. Given that, even though the chicken wasn't as crispy as I usually like and had a less punchy flavor than I'm used too, the value for what you get is pretty good. \n- The beans were pretty good - flavorful, soft, and a very generous serving again. The only problem is they were slightly lukewarm, so they weren't as enjoyable as they could have been. \n- The green rice was great! I'm not a huge carb person (omg what's wrong with me), but it was super flavorful and delicious by itself. Usually I don't like carbs since I find them to be tasteless vehicles that dilute the flavor of other more delicious things, but I ate the rice all by itself the next day for dinner and it was awesome. Definitely one of my favorite components of my meal. \n\nWhen I was leaving, I saw one of the cooks eating a bowl of beef noodle soup in the restaurant by the window. As I walked by, I smelled it and I literally stopped walking because it smelled divine. Whatever he was eating, I want THAT next time haha", "author": "Katherine J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "This place is SO good. In a nutshell, it's a 'chipotle style' Chinese place!  Really reasonable prices and so much value for what you get.  Please don't compare this to fast food Chinese (read: Panda Express) because this place is so so much better.\n\nPrice is just around $10 a bowl.  You get to pick a choice between rices and noodles, two veggies, and some array of toppings.  You really can't go wrong with the roasted pork and green rice!  Plenty of seating inside if you want to stay but it's designed to be fast casual.  Portions are really generous so prepare to take some home with you.", "author": "Brandon P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-22", "description": "Shockingly fast, and a very generous portion size for its cost. Would recommend for anyone in a hurry.", "author": "Larry L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "My search for the perfect office lunch spot is finally over, I've found The Wei! The fried chicken was hands down the most delicious fried chicken I've ever had. Perfectly moist and mildly spiced. I ordered their scallion fried rice as a base accompanied by yummy fresh string beans.", "author": "Irene C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-07", "description": "super dank Chinese fusion food. super fast, dank, fresh food. would 9/10 recommend. different choices of proteins, veggies, and bases. even get to pick a garnish. check it out and i'm sure you'll be impressed", "author": "Ryan L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-25", "description": "This is amazing fast food. It's kind of like chipotle style ordering: pick your base rice, veggies, meat, and toppings.\nThe scallion rice tastes like buttery garlic rice goodness.\nALL their vegetables taste AMAZING. I would eat vegetables all the time if they turned out like theirs; can't go wrong with any of them.\nTheir popcorn chicken tastes amazing and I personally like it more than the char siu pork.\nCan't wait to go back.\n\nWow!!!", "author": "Nina K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-02", "description": "The food is good.\n\nThe concept must be celebrated!  We need places like The Wei to somehow elevate the status of Chinese food in American culture.  Instead of cutting corners and going always for cheap, lets add in value.\n\nGive the people friendly atmosphere, a clean environment and good portions and they'll pay the higher price tag.", "author": "Chao L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-21", "description": "I love it! It's simple, but a lot of food in one bowl, and not greasy like some Chinese food. I've only started coming here about two weeks ago, and been there 5 times! I've had the market chicken, which is good. I think they use chicken thighs though, so if you're into healthier options like grilled chicken breast, you won't get it here. The seasonal vegetables taste like vegetables in white sauce to me, its very good. I also usually do not like string beans, but the garlic string beans are cooked well and taste good. The eggplant was okay, did not really like that, but I'm not an eggplant eater. I also had the beef. Meat was good, but the little black beans that came with it was too salty. Green fried rice is good, wish they would put more in the bowl!", "author": "Lauren W."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "The Wei", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qqTOxjfWxFEUpn9AKt44Ow/ls.jpg", "@type": "Restaurant", "telephone": "+17182608888"}