{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "This is the the Chinese food I've been waiting for, not just in the Asian food desert that is Brooklyn, but in NYC in general. My brother and I grew up in the San Gabriel Valley in California which has the highest concentration of folks who are Chinese/Taiwanese, so we are picky about Chinese eateries. While visiting last week, he agreed that he would eat at the Wei at least once a week if it had an LA outpost. \n\nThe food is solid and represents true value for your money. I have never been so happy with a fast casual option in my life, and I hope the Wei is able to open more locations and go nationwide. The mala chicken is out of this world, and the roast pork (char siu) is superb. I love the bok choy and green beans, and the hubby is obsessed with the eggplant. Their passion fruit sweet tea is perfect - not too sweet and huge so I'd even go in there if I wanted bubble tea only (they make that too). \n\nAs I get older, I'm more aware of the power of each dollar I spend, and the Wei is one of those places that I want to wholeheartedly support as often as I can. They opened up just this past December, so stop by and support a startup with great service and a solid product. Bonus: easily accessible location right off of the Dekalb subway station. If you don't like this place, I don't know if we can ever be friends.", "author": "Kim L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-29", "description": "Found this place through Yelp because it was close to the hotel I was staying at in Brooklyn.  Very very good food.  I liked the choices, especially the vegetables.\n\nI wish there was a place like this in Philadelphia.", "author": "Michael J."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-11", "description": "Third time here and love it! My favorite is the Mala chicken bowl with eggplant and bok Choy , yuuummm!", "author": "Nia N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "Like someone else said this is like the Chipotle of Chinese food and I love me some Chipotle. It was about $21 for two bowls. We both enjoyed. I got the market chicken and my boyfriend got the catfish. All of the employees are super friendly. This is my 2nd time here and I'll be back. A con would be that the food is oily but not to the point that I won't return.", "author": "Latoya D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-15", "description": "Finally a Chinese fast food place that's clean with good taste. This spot reminds me of shop house kitchen. Its like an Asian chipotle but still has enough flavor. I had the mapo tofu with green beanand eggplant. It was all delicious. I also had a the toppings and I recommend the green fried rice. At $10 it really is reasonable. The best part is I don't think they use any if maybe just a tad of MSG.", "author": "Jeremy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-09", "description": "Im in LOVE...Came across this place by accident. Which is odd because its LITERALLY a block away from my job. Had the noodles with Mala chicken, garlic green beans and eggplant and im hooked!", "author": "Ruby F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "It's so delicious here, I had the jade fried rice and lo mein with the ma po tofu, eggplant and bok choy.  Yes all that deliciousness in one bowl.  The quantity is also amazing, I feel like it's a an amazing meal. A beautiful space, great location, right by the Q and Juniors, and just an overall well executed concept.  I hope to be back soon!", "author": "May P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-10", "description": "Better-than-your-average quick Chinese food spot done fast-casual style. Not overly greasy, everything was fresh. Friendly staff.", "author": "Agnes C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-20", "description": "Great chipotle-esque spot but chinese. It is a little greasy but oh so good. We got 2 entrees for 4 adults and it was plenty!! The vegetarian options are excellent!", "author": "MR S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "The amount of food we got for the price was great. On top of that everything was tasty and good quality when it came to the meat and veggies.", "author": "Carlos F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-28", "description": "An awesome place where you pick your protein, veggies and toppings.  Made very well and you can tell it's quality especially for fast food.  Had the mala chicken over veggie fried rice, bok choy, and eggplant.  So glad to have it in the neighborhood.", "author": "Sarah K."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-23", "description": "I don't usually go to places that close this early on the weekends because it's just too hard to get there.  Since they close at 9, you've got to get there no later than 830 to be guaranteed service, which means I have to leave the house no later than 7 pm to get this food.  That's really hard!  Despite the challenges, I've made it here twice.  The food is excellent.  I love the green fried rice and how they really respect the vegetables.  The string beans and eggplant are my favorites.  I like the black bean beef, though it can be inconsistently chopped into too-large pieces.  The Ma La Chicken was a pile of crumbs the time we ordered it, it was near closing but it should have been taken off the menu since it was only old crumbs left.  One time we wanted to come here and they ran out of food before we arrived.  Another time, they started running out of food while I was in the store.  I wish they were open later with more locations so they'd never run out!  Excellent pear tea and Herbal tea in cans.", "author": "Rose P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-21", "description": "Simple, quality experience. While there aren't a lot of menu choices, what they do offer is quite delicious. My roast pork and egg plant over white rice was so good and the portion was very generous. I will gladly come back to this restaurant anytime I am staying nearby", "author": "Rob I."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-09", "description": "What a surprise! We left the Alamo Drafthouse movie theater hungry and disappointed with their food and then stumbled on The Wei on our walk to the train. WOW. One bowl fed me for three meals. They have a homemade spicy sauce that is out of this world. They even have options to go all vegan if you want. Seriously - it's so good. And we met the owners who are really nice guys. I wish they had one in South Brooklyn. Very reasonable prices especially since the portions are huge!", "author": "Aleida K."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-22", "description": "Went here again yesterday , bought the fried cat fish ... It was cold along with everything else besides the rice..... meats should always be warm or hot . Something they should consider", "author": "Samantha B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-18", "description": "God bless this place. Kind of a chipotle esque fast casual Chinese place. The portions are great for the price and the food is good quality. It's not the most challenging cuisine but very satisfying. Looking forward to coming back and trying their other options.", "author": "Kyle P."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-28", "description": "Not particularly fresh food-pre prepared, kept hot and waiting to be served. Mix and match bowls with four or so choices of protein, veg, rice/noodles. Popcorn chicken chewy and greasy, mapo tofu was ok, egg plant was sweet and very oily, pork dumplings were all wrong-like a bit of cheap sausage in a too thick dumpling.", "author": "Duncan W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-09", "description": "Not only did they let me in 3 minutes to closing, the food was still AMAZING, and they treated me like royalty.  This is rare, especially in NYC, to walk in close to closing time and still receive top notch customer service, AND food that taste as fresh as the start of the day.  This has been my second amazing encounter with The Wei, and I'm sure it won't be the last.  Shoutout to all the workers there, they all work hard to make the atmosphere awesome.", "author": "Khaalida H."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-10", "description": "Since there arent any good chinese restaurants in the area, this place is to go if craving for chinese food. Portions are big and enough share with coworker./friends. The mala chicken does have the right kick to it.", "author": "Michelle L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-14", "description": "I have ate wei a hand full of times. Only complaint is the same for all fast food joints, not quality food. Meats are fatty and inedible at times (just don't get meat). There is something salty (I have it narrowed down between the string beans and a sauce). I haven't had a bad experience with wei. Overall I say try it out if you're around for work purposes (there are plenty of actual restaurants for good food). Get the green rice it does not disappoint.", "author": "Clari B."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "The Wei", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qqTOxjfWxFEUpn9AKt44Ow/ls.jpg", "@type": "Restaurant", "telephone": "+17182608888"}