{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-26", "description": "Great stop for lunch or dinner. Portions were good size and filling. We tried the White rice, noodles, chicken, pork, broccoli, green beans \u0026 boc choy.\nIt all tasted great and we look forward to returning.", "author": "Curtis G."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-06-02", "description": "Happened to be in the area and walked by Panda Express which really made me crave Americanized Chinese food. Since I feel like it's ridiculous to eat there outside of being at a mall in suburbia or at the airport (this is NYC after all, foodie heaven) I pulled up Yelp to see what other options were around and happened upon this place. \n\nThe service was great, food, not so much. I got the veggie fried rice, steak, bok choy, and green beans. I also tried a sample of the fried chicken option which was kind of dry. They said I could add a sauce but decided to just go with the steak. Turns out even though it's saucy, the steak didn't have much flavor. The bok choy was nice and crunchy but way too salty. The green beans were overcooked (I prefer them crunchy and bright green) and also salty. Veg fried rice was good. Portion was also pretty good. I had a hard time finishing it and it definitely could have been two meals for me. I think next time I might just go to Panda Express...", "author": "Nadia A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-14", "description": "So from once you open the door your are greeted. So that's already a good start. \nThey have different selections not a huge amount but enough to make you think twice should I get this or that ? Hmmm \nI chose the Asian scallion infused rice. ( it's the green one) don't worry it's delicious. I got the chicken and veggies. Next time I will add eggplant. Everything was nice and clean. Definitely a nice authentic place. \nWill be coming back soon.", "author": "Yajaida M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-09", "description": "Regrets, I've had a few:\n\nOne such regret is the components I chose to create my Bowl at this place.  I went with Green Fried Rice, Ma-Po Tofu, String Beans, and Eggplant.  The Veggies were so oily and the Ma-Po Tofu was so saucy that together they drowned out any possibility of tasting the Green Fried rice that everyone keeps raving about.\n\nIn contrast, the kid chose plain ole White Rice, Char Siu Pork, and Bok Choy, keeping things minimalist even though he had the option to include a second veggie. He may have been on to something because in doing it this way, with just a drizzle of Char Siu Sauce on the Pork, it was possible to taste each ingredient individually.  \n\nI am one of those weirdos who truly adores Tofu.  But with this concept, I'd rather see cubes of it marinated and baked, or breaded and fried, with the option to add some sauce on top.  Ma-Po Tofu, which I love on its own, just doesn't work here.\n\nGot a kick out of the uber cheerful, \"Welcome to the Wei!\" we were greeted with when we walked up to the register to order.  In fact, the 'counter dude' was super friendly and welcoming, and in relative, fast-casual terms, the space was pleasant enough to warrant a bit of lingering.  Thanks to these personalized touches, as far as ambiance goes, this spot ranks a few notches above Chipotle.  Am going to give it another try to decide if that comparison holds true for the food.", "author": "Yael D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-05", "description": "Very good food. Staff was fantastic and prices were reasonable. If you are heading in the area you must stop by and try it for yourself. Very nice selection of food.", "author": "Brian M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-04", "description": "I wanted to like this place but taste-wise it's meh. I got the scallion rice which was ok (I'd prefer regular fried rice). The pork was a bit dry but was mostly meat and not fat which was good. The bok choy and egg plant were nothing to write home about. Overall, considering the portion size it was an ok meal for the price. I would've ordered the Malta chicken but it looked dry and mostly deep fried flour with a little chicken piece.", "author": "Achiaa P."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-04-22", "description": "We went here today and half the food was cold. Dumplings were cold and yucky. We ended up throwing away most of our food. \n\nThe food was not fresh, we were so disappointed because of the incredible reviews! \n\nI think this place has gone downhill or else they leave old food out all day. It tasted like bodega Asian food. \n\nNow $30 later we are hungry and still craving dumplings. Really sad.", "author": "Kelly G."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-19", "description": "Chipotle meets Panda Express, basically. Choose a rice, a protein, some veggies, and some toppings, but with options you'd expect to see at Panda Express instead of Chipotle.\n\nThe one notable thing here is the mapo tofu, which is mildly ma la and has basically the right flavor. It's not great, but it beats the meats they have, which are, no lie, pretty much what you'd expect to get at Panda Express.\n\nIt's a little pricier than Chipotle, which seems a bit much for what you get (portions are large, but it's mostly rice). That being said, this place is great if you want a fast food place you can get in and out of in 15 minutes including the wait, and you want some food that actually has veggies (no, one lettuce leaf on a burger or 3 slices of button mushrooms on pizza don't count). However, if you can spare 40-60 minutes for a meal, you can do better for the same price in the area.\n\nThe service here has been great every time I've gone. They're really on the ball and keep things moving even when there's a long line, and unlike most places, where people get a bit lazy when things are slow, people here are still really quick and attentive even if you're the only person in the place. The biggest downside to this is that they don't accept tips on a credit card, so if you're like me and don't carry much cash, you have to tip in cash. But that's a pretty good problem for a restaurant to have as its worst service problem.", "author": "Dan L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-29", "description": "I don't visit my Downtown Brooklyn office often -- basically about once a month, so when I noticed a few new eats around the area, I made sure I scheduled my time to visit one of them. This time, I picked The Wei. I thought it was pronounced like \"way\" but my coworkers pronounced it as \"Wii\". I don't know for sure, but I think they are wrong since I'm always right . . . haha. \n\nAs many have mentioned and it seems to be the new fast food trend, this is Chinese Chipotle. As Chinese, I was a little skeptical. How good can this stuff be? I ended up getting the green rice (I would've gotten the white rice but it was the last bit in the pan and didn't look fresh. In fact, it was made into a heart shape. I don't want played-with food.) I also got the pepper steak with fermented black beans as recommended by the guy behind the counter. I then got the broccoli and green beans. It was a pretty big bowl, so I didn't opt for any sides. \n\nWhen I got back to the office and started eating, I was surprised that the food taste pretty fresh. I would've preferred to have a little more rice and it was a tad mushy, but it was decent. I was surprised (and thankful) that the scallion was all cooked in and infused in the rice. I don't like raw scallion taste. I think they also put a little ginger in cooking the rice for flavor. I got plenty of beef pieces and they were tender and not overcooked. I particularly liked the vegetables and I'm not a real veggies gal. The green beans were exceptionally tasty. If I knew in advance, I would've gotten two portions of the green beans and forget about the broccoli. \n\nIt's a big pricey as I know my mom can cook all this, but I'm glad to have a place like The Wei in the neighborhood that doesn't otherwise have much close to authentic Chinese food.", "author": "Nilsa L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-02", "description": "Solid lunch/dinner option near LIU campus. \n\nI came for lunch by myself and wished I had a friend to share with - portions are huge! \n\nAs others have noted, this place utilizes the build-it-yourself bowl style (base + protein + veg + toppings) popularized by Chipotle, by Chloe, and a million other places. It's a winning model!! Who wouldn't like to have complete control over building an awesome meal? \n\nI chose the green scallion rice base, with market chicken, bok choi and string beans, and all the toppings. The rice had a subtle but fresh and bright flavor and was nice and fluffy. The market chicken was great quality, with little to no gristle/weird bits (I got the sauce on the side and didn't think the chicken needed it - just makes it sweeter). The chicken is dark meat like thigh/drumstick and very tender. The veg were awesome!! Bok choi was fresh and crisp and the string beans were softer with a lot of good garlicky flavoring. I loved the radish and sour cabbage toppings, which brightened and added a bit of acidity to the plate. Overall a huge, delicious and satisfying meal!!\n\nI would definitely return. One thing that would be great would be a brown rice or maybe veggie base to have a lower carb option. Enjoy!", "author": "Heidi C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-28", "description": "Average Chinese \"fast food\" served Chipotle style.\n\nThe pros:\n-friendly staff\n-fast service\n-very large portions, I could barely finish it\n-very filling \n-green beans were delicious\n\nThe cons:\n-TOO oily...\n\nIn short, because of location and convenience,  I am likely to come back here again. The portions were large and I was so full with this meal that it ended being my only meal of the day. I think that's partly because they only use rice or noodles as a base, so you would be ingesting a heavy carb loaded meal if you came here. I know that Chinese food is typically quite oily but this was too oily for my taste. Next time, I won't be ordering the fried rice and will just ask for regular steamed rice, instead.", "author": "Lucy M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "The Wei brings legit Chinese Cantonese/Sichuan food in a modern setting, at an affordable price point. With really friendly staff, a decent amount of seating, and large portions, I hope the Wei sticks around for a long time.\n\nMost non-Chinese people think of Chinese food as greasy fried rice, pork egg rolls, and general Tso's chicken. The Wei serves something between the flavors of legit throwback Cantonese food and the Americanized take out they may be familiar with, but in a Midtown lunch friendly efficient manner with compostable bowls. The flavors are authentic, with plenty of garlic, scallion, sesame, ma la sichuan peppercorns. For hubby and me, being Manhattan Chinatown natives, it tastes like home. None of the flavors are over salted or sweetened to cater to the masses, they're as they should be, if a little less spicy than I'd like. We tried the fried green rice, ma la fried chicken (very tasty, spicy fried chicken bites!), the ma po tofu (soft, not firm tofu), the garlic eggplant, sautéed string beans, bok choy, and broccoli. For real, everything was delicious. Both the chicken and tofu were the right kind of spicy, the veggies were perfectly tender and seasoned, not drowning in salt. The rice is green with scallion and has some egg and is tasty in its own right. I will note that the fried rice is oily and if you're watching your calories, get the plain jasmine rice. You can also add toppings like scallions, sesame seeds, shallots, and pickles. On top of it all, for $10.50, you're getting well over a pound of food - the 9 inch bowl is filled to the rim. By Midtown lunch standards, this is a steal. By Chinatown standards, you're probably overpaying by $3, but if you care that much, go walk the Manhattan Bridge and waste your time instead. The original bubble tea is also really good, with a fragrant black tea, just enough sugar, and chewy (unsweetened) tapioca. It's only served cold, but there was no ice in the large cup, so I think it was a good value. No powder mix here.\n\nThe process is easy - you line up on the left, pick your rice base, add a protein, add two veggies, add toppings, and pay. Everything is scooped out in front of you as you go down the buffet line. I found that I had a lot of rice leftover, so going forward I may ask for less.  The staff was really great - we showed up before they technically opened, but she waved us in because they were ready to go. She also was happy to mix some of the items so I could try a little bit of chicken, even though I got tofu. And when we got a bubble tea but the bubbles weren't ready, they hand delivered the tea to our table. \n\nI think there's seating for about 30, mostly stools and two tops. While it's not romantic or anything, its clean, efficient, and comfortable to sit for a quick meal and people watch. I THINK they have a bathroom but I didn't look. No steps, so ADA and stroller friendly. Not a place I would bring a big group though, unless you're visiting off hours.", "author": "Suanne L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-03", "description": "We went back today and tried the steak and the mala chicken. Both delicious but I enjoyed the beef more than the crispy chicken. The other components are consistently good. Left the place full and happy.", "author": "Nancy N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-31", "description": "This stylish, fast casual (fast food) version of Sichuan Chinese is as good as it gets if you're craving Café China or Spicy and Tasty, and stuck in downtown Brooklyn.  It follows the Chipotle model:  walk up to the counter and you pick your choice of 5 or so proteins, 2 veggie sides, and a carb base.  There are ample condiments to scatter on top, and everything is packaged in a compostable vessel.  There are more than enough tasty bites to fill you up completely for a long time.  I picked the unhealthy mala chicken (good, but very light on the mala), the healthy green beans, and the sauteed eggplant over the green scallion fried rice.  Preparation, esp for the veggie elements tasted authentic and were outstanding.  The chicken was a bit overfried, but the seasonings more than made up for it.  \n\nI've never been a huge fan of Chipotle, but I LOVE THE WEI.  Tasty, cheap, and as authentic as it gets for fast food. The whole thing, which probably weighed about a pound and a quarter, cost me $10.34.  That's value, people!", "author": "Kayo N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-27", "description": "One of the worst meals I have ever had. Terribly overpriced for stale meat and vegetables plopped over white rice.", "author": "Oliver P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-22", "description": "Chipotle of Chinese food. I love Chipotle.\n\nOr if you're more traditional, it's kind of like those bien dang places that had like 20 items you could choose from, and you can choose four to six different things to put into your take out box. Except you have less choices here and it's more expensive. The plus is that the quality is better here.\n\nI've only ever ordered the green rice, which I really like. And the only protein I've ordered thus far is the mapo tofu. Because this is clearly modern Americanized Chinese food, I wasn't surprised that it's not anywhere near how spicy mapo tofu should be. But I'm genuinely appreciative that they didn't skimp out on the ma of the mapo tofu.\n\nIt's hard with Chinese food to pick what you're going to curate your veggies to be, but they did a really good job here. I  especially love the eggplant and string beans. The broccoli thing is clearly directed at the less traditional folk, and the bok choy is bok choy, I can't really say I like it or dislike it. It's easy, it's simple, it's approachable.\n\nI don't like the bubble tea here. I mean, they're not a bubble tea place, so you have to go in with that attitude, but I had some hopes. The bubbles were way too soft.\n\nI really like they guys here. They're very nice, very appreciative of their costumers, and always try to keep the spirits of those in line up and work to speed things along.", "author": "Melody C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-21", "description": "The Wei is new to Ft. Greene and is wei convenient being located across the street from my university! Wei cool!\nI had the veggie fried rice with marinated silken tofu, garlic green beans and bok choy with pickled veggies and sesame seed toppings. All of which happily marked with a \"V\" for vegan!\n\nWhat you can expect:\nLarge portions\nModerately priced American-Chinese foods\nHigher quality ingredients than your hole-in-the-wall you paradoxically trust with your GI tract that makes you question life choices\nDelicious food!\nModern atmosphere with some \"gnarly\" real wood furnishings! (geddit? sorry, I'm board)\nCool 80's / 90's / early 2000's rock and alternative\nFriendly employees that enthusiastically greet you at the door\nHaving it your wei\n\n\nAs ol' Blue Eyes would say, \"I had it all... myyyyyy weeeiiiiiiiiii\"\n*slow clap*\n*curtain closes*\n*stops typing*\n*clicks post review*\n*regrets narrating actions on Yelp*", "author": "Michael W."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-02-07", "description": "I really enjoyed the fast casual concept, and modern take on Chinese food. The interior is nice with seating for dining in. However, I thought the food was mediocre, and was disappointed that I spent $11.50 on food that I could have ordered from my local Chinese takeout place for half the price and same taste. I ordered the black bean steak, which was very tough and hard to chew. The scallion rice was okay, nothing special. I did enjoy the sautéed string beans -- that was my favorite. Would I return again? Probably not", "author": "Xenia M."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-06", "description": "I wanted to see what the hype about this place was about they make it easy for you to select what to order. I did so with pride hope that it would be all that i have read about but was somewhat dissapointed to me personally the food was too greasy for my liking. The only thing i enjiyed was the dumplings the sauce was delicious. Don't know if i will try it again.", "author": "Almaria B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-11-28", "description": "I absolutely loved everything about this place. From the fact that it was like a much cooler, much yummier, and even much better value than the idea of Chipotle, to the fact that even though it was obviously the end of a long day, the staff were super nice and helpful. We went here after seeing a taping of Jimmy Kimmel in BK and we looked for a quick, not too pricey, yet highly rated place on Yelp so we thought we'd give this place a try! I am SO glad we found this place and I've been recommending it to friends ever since. I had a delightful mix of veggies and meat and my friend had the same - but with seafood. Everything in the bowl was cooked and seasoned to perfection. So often, when you get everything in one bowl, you find that everything tastes the same. This was NOT the case here. Everything added layers of flavor and texture to each bite. Also...scallion rice?!?!? Yes!!! Such a great idea for a fast place to have that kind of flavored rice. I wish this place was closer to me (all the way in uptown Manhattan), but I can say I'll seek this place out again soon - even though it feels far away from home :P", "author": "Nina K."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "The Wei", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qqTOxjfWxFEUpn9AKt44Ow/ls.jpg", "@type": "Restaurant", "telephone": "+17182608888"}