{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-25", "description": "Sooo yummy! Great, friendly service and clean spot. I got the steak, noodles, bok choi and green beans, and I devoured it. My husband got the catfish, green fried rice, bok choi and green beans and raved about it. Despite shoving our faces, neither of us feel disgusting after. Major win and all for under $25.", "author": "Kelley R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-03", "description": "Everything was AMAZING. I had the mala spicy chicken, eggplant, and green beans with the jade rice. The chicken may look super spicy but it had just the right amount of kick. The vegetables were my favorite! It is a lot of food for a reasonable price. I also ordered a matcha bubble tea. I love places serve GOOD food and bubble tea. The staff there are very friendly! So happy to have found this gem in Brooklyn!", "author": "Samantha L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-15", "description": "A Chinese chipotle, except with more authentic Chinese food than your average American is used to. You got your base carb, protein, two veggie choices, and garnish. My first meal from here on this cold winter day was green fried rice, mapo tofu, eggplant and spicy radish; topped with pickled shallots. The spiciness of the tofu and eggplant were amazing and the flavor of the green fried rice was out of this world. Did I mention that they also serve bubble tea here? And it's pretty damn good.", "author": "Michael M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-30", "description": "I've ordered from The Wei within the first week that they opened, and I will most definitely keep coming back! The food is delicious and authentic, almost as if I was cooking at home! The prices are decent, but the good food is worth every penny!", "author": "Melissa W."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-10", "description": "Good for its price. Taste is really good. Best thing about this place is that its a quick lunch spot. It took me less than 100 seconds to get out of the place with my lunch.", "author": "Sameer J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-07", "description": "A quick lunch option for the neighborhood, although it's basically fast food. Vegetables are unfortunately overcooked. Bubble tea is delicious though!", "author": "Marion C."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-01-07", "description": "Green fried rice is so dry today and not much flavor, will try again later. Consistency is important.", "author": "Dizhong S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-01", "description": "Gave this a try today and I was impressed. Seems like they're aiming to serve Chinese food with a layout, pricing and quality comparable to Chipotle. I'm a fan.", "author": "Sam M."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-19", "description": "This place is too legit.  I appreciate that the food isn't too dumbed down and remains authentic tasting.  I've tried the Mala and market chicken, and the steak...they're all delicious along with the rice/noodles, veggies, and toppings.  It makes for a nice balanced meal.  Overall, a great addition to the area.", "author": "Ryan P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-08", "description": "Great service and atmosphere. Staff is very friendly and food is great. One suggestion I would give is to have a more variety or maybe a daily special. Otherwise excellent :)", "author": "Lauren V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-08", "description": "Amazing food, great staff, and conveniently located right by the Q B R 2 3 4 5 train lines", "author": "Jackson M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-17", "description": "Came here the other day and got the mala chicken. It was good but I've had better. The staff was so friendly, and the environment was really awesome. Because of this, It's safe to say that I will be coming back to this place.", "author": "William D."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-08-04", "description": "I was impressed with this chipotle-style sichuan-ish fast food. The flavors were very good and much, much, much more authentic-tasting than Panda Express. It seemed like all the ingredients were really fresh too. The string beans were great. My only complaints were it seemed a bit heavy and oily (well, what was I expecting ordering deep fried chicken and sautéed eggplant...) and it seemed like it had been sitting out a while (it wasn't hot enough). Also, here's my list of unnecessary wishes: (1) I wish they had brown rice (even though I know that's generally not found in China) (2) please sauté the eggplant better so it's less soggy (3) please use less breading and more chicken in the mala chicken.", "author": "R C."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-09", "description": "Like others had mentioned, this is Chinese food version of Chipotle.  Food tastes better than those from typical wall in the hole Chinese joints, and the portion is generous.  I found myself a new option for dinner takeouts!", "author": "S H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Totally affordable, straightforward Chinese food in the heart of downtown Brooklyn. \n\nVegetables were fresher than I've eaten at any Chinese restaurant. Noodles were perfectly balanced in flavor and texture. \n\nThis place offers an ordering system similar to Chipotle -- pick your protein, starch, veg. and garnish options. Looks to be a family-owned small business which I am always happy to support. \n\nPro tip: Try the bubble tea and pork.", "author": "Bobby D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "Chinese food chipotle style. Great choices for all.  The ma po tofu is super tasty.  Loved all the pickle toppings too!", "author": "Veggie P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "I go to school right across the street so this place is really convenient. I got Veggie-Fried Rice with the noodles, Mala Chicken, garlic string beans, Bok Choy and Fried Crispy Shallot. The food was really good. Its also very affordable and they serve your food fast.", "author": "Laura A."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-06-08", "description": "Interesting take on Chinese food. Very tasty and affordable. Their bok choy is really good.", "author": "Grant H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "Great food, awesome service, amazing prices.  The food was very fresh.  I got the green rice with crispy catfish, eggplant, and bok choy. My husband got the veggie fried rice with roasted pork, eggplant, and green beans.  Everything was delicious! And for all of that,  we paid $24 combined.  Nice to have something healthy and affordable in the neighborhood.  The Wei...you have definitely gained some regular customers!!! And please keep the catfish on the menu!! I loved it!", "author": "Toya R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-11", "description": "Like a Chinese Chipotle! The food was all a bit on the salty side, but the portion size was good and left me satisfied. The catfish was good at first, but the food gets bland and super salty once you're no longer all that hungry.", "author": "Karen C."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "The Wei", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qqTOxjfWxFEUpn9AKt44Ow/ls.jpg", "@type": "Restaurant", "telephone": "+17182608888"}