{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2019-03-15", "description": "I'm so excited we discovered The Wei.  We've ordered through caviar delivery service. As mentioned before, you pick and choose fresh ingredients to make your dish. \n\n\nThis is a great addition to the area as other Americanized Chinese restaurants in the hood are grease pits.  \n\nThe wei is the complete opposite, fresh ingredients and not greasy. Portions are huge so expect leftovers.", "author": "L M."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-01-21", "description": "They completely ignore request concerning food Allergies.  \nI explained my food allergies and then asked \"can I eat this?\" about each item on the cafeteria style line. \nI was told \"yes\" about each item.\nThank goodness for my Eppi Pen!\n\nI wouldn't recommend this place to anyone.\nIf they don't know what's in their food - I wouldn't recommend eating it.", "author": "Local And World T."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-04-11", "description": "I like their chicken options here and it's great casual take out but served in a chipotle style way. I like coming here during lunch and their chive rice is so good! My friend enjoys their lo mein. Either way they are both good in my opinion.", "author": "Tracy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-01", "description": "Yes, this is like chipotle for Chinese. But better. No dumb upcharges. \nMom and I came close to closing one night, needing food after a long day. I got the roast pork bowl over green fried rice, and she got the chicken over noodles. Both of us got the eggplant and garlic green beans. I have to admit I wasn't expecting the best quality considering they were about to close, but it was still REALLY good regardless. Not a choice for ambiance perhaps, but the food they make is worth making a trip for. The bowl for me was easily two meals, making the $13 price tag not at all bad. The veggies were fresh, and the meat wasn't dried out. That, and they weren't trying to run everyone out of the place 15min before close. I'll definitely be back, and plan to try their tofu next time!", "author": "April H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-02-28", "description": "The food here is amazing and plentiful. Enough for leftovers. The string beans and eggplant is particularly amazing. I love this place. The beef is my fav meat topping. The staff here is always friendly and this place is well kept.", "author": "Estela S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2019-01-10", "description": "Love going here for lunch. It's much better than takeout Chinese food and it's chipotle style dining. The roasted pork is cooked to perfection and is so tender and juicy. I've tried pretty much every protein on the menu and I have yet to be disappointed and I really like he catfish. The rice and sides you get in the bowl are all fresh ingredients. I usually go to lunch around 1 and it's never too packed.", "author": "Daniel P."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-24", "description": "This has become one of my favorite lunch spots whenever I'm in the area and I'm craving Chinese food! It is conveniently located a the corner near the Dekalb train station. There is plenty of seating inside.\n\nOrdering food is the same concept as chipotle where you build a bowl: choose a base, protein, sauce, 2 vegetables and garnishes. \n\nI absolutely love the green fried rice (scallion infused) as my base - everyone must try this!! I tried the market chicken, it was good but a little dry. I had the garlic string beans (typically my favorite) but I thought it was overcooked and extremely oily. I also had the broccoli but nothing special. I loved topping off my meal with the fried crispy shallots. They also have a lot of other authentic garnishes. \n\nThe bowl was about $10 and it was a huge portion! \n\nMy only complaint is that the meal was super oily (but I guess it is normal since it's Chinese food?). I also hope to see them change up in the menu every now and then.", "author": "Leona L."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-01-19", "description": "The Wei\nNY BK Downtown\n4pm Friday 19th January 2018\nThree Stars\n\nThe asian chipotle. \n\nPick a Base: Noodles. The lo mein style noodles were a bit dry and probably been sitting there a while. \n\nPick a meat. Popcorn Chicken was crispy and delicious at first but got chewy and boring by the end. It said it was spicy but it was white girl spicy. \n\nPick a Sauce. Teriyaki. Sweet and Salty. \n\nPick 2 Veggies. Blistered Green Beans were excellent. It was just like chinatown\n\nPick some finishing stuff. The pickled cabbage, turnips were also very tasty. \n\nOverall it was quite good.", "author": "Leonard L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2019-01-12", "description": "This is 4 stars for cheap Chinese takeout. It's not le bernardin, it's not Atomix...take this as a review for what it is. Now that we've gotten past that, we had a great lunch at The Wei. A nice selection of proteins, great sides, good variety of sauces and toppings, very generous servings. Protein was well-cooked and staff was LOVELY. You can easily share a dish between two adults unless you are very hungry.", "author": "Julie B."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2019-04-16", "description": "I've visited The Wei about three times, including yesterday.\n\nI tried giving this restaurant a chance but the food isn't that great considering the price. I've ordered several chicken dishes. I would get lukewarm meat that had more fat than I like. Surprisingly, the taste is good. The eggplant tastes good as well but has an off putting gooey texture (more gooey than normal). When I had the bok choy, it was salty. The broccoli was on the cold and hard side. Their rice is good. I don't know if this is a consistent thing or if I've been consistently unlucky.\n\nThe cashiers and servers are okay. The restaurant is conveniently located near several buses, train stations, malls and retail stores.", "author": "Emily V."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-04", "description": "If Chinese food and Chipotle had a baby = THIS (minus the E.coli, of course)\n\nCame here on a weekend for a quick late lunch. You first pick a base (options include white rice, green fried rice, veggie fried rice and stir-fried noodles), then pick the protein (from roast pork, market chicken, mala chicken, black bean steak, ma-po tofu, crispy catfish), then choose two veggies (that includes sichuan eggplant, garlic string beans, shanghai bok choy, seasonal veggies). Lastly, choose a garnish from fried crispy shallots, sesame seeds, scallion, sour cabbage, pickled radish and sour spicy turnip. \n\nSides include boiled pork dumplings with their homemade sauce ($4.25), cold sesame noodles tossed in sesame peanut sauce ($4.25), boxed sides where you can choose a base or veggie option ($4), hand-wrapped spring roles ($3.75), deep fried wonton chips served with a sweet dip (1.75) and mini sesame balls ($3.75).\n\nDrink options include coke, diet coke, ginger ale, sprite, iced tea, seltzer, bottled water, snow pear drink and chrysanthemum tea. All are $1.50 except the herbal iced tea is additional 50 cents so $2. They also have the sweet tea options, which include passion fruit and lychee ($2.50). If you want to add lychee jelly, it's an additional dollar so $3.50.\n\nAlways go with the green fried rice as your base, it's so good! I went with market chicken cause you can't ever go wrong with chicken. Then I asked for double portions of their garlic string beans, wasn't really interested in their other veggie options for some reason that day. As for the garnish, I went with the shallots. Of course I had to try their bubble tea--got the passion fruit with lychee jellies. I have no regrets on ordering any of these. One thing that stood out for me were their string beans. They're so addicting! You just keep going for it until you realize that you can't fit another string bean in your belly anymore. Also loved their bubble tea, it was very refreshing. Maybe they can add a bit more lychee jellies next time? :)\n\nI got full halfway and took the rest to go. It wasn't too crowded when I went so it wasn't hard grabbing a seat but I can easily imagine this place getting packed on some days/hours. Also, the wait for the food wasn't too bad. You can also self serve a cup of water in the back, near the entrance/window area. I don't have anything negative to say about The Wei except that I'm happy I found a place that serves delicious, semi-healthy, nicely packaged Chinese food in the area. There are so many combinations to try! Definitely coming back to try their other options.", "author": "Christine S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-11-20", "description": "The portions here are large, more than one serving so the value for your food is good in that regard. \n\nThe idea of this restaurant is similar to chipotle or other fast food options where you build your own meal from the provided options. The workers were very friendly and let us sample the proteins before ordering them. The food was not very warm and there were limited sauces so I felt my meal lacked some flavor.\n\nOverall a good concept and a good spot to return to when you need the convenience of \"fast food\" that tastes better than most.", "author": "Allie B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-10-14", "description": "Fresh ingredients! Close to Barclays and always a good amount of people dining in. I've been here several times and haven't been disappointed yet. Rarely do I like how bok choy is cooked at other places but The Wei has the perfect making of crunch and salt that makes me get an extra serving.", "author": "Jasmine S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-01", "description": "Quick and casual, with above average portions truly making it bomb. This place is the Chipotle for Chinese food - you choose your base, protein, veggies, and garnishes, as they fill your bowl up to the brim. I got the green fried rice \u0026 veggie fried rice (half \u0026 half), market chicken, Sichuan eggplant, garlic string beans, and a variety of garnishes. First time I've seen green fried rice, which seems to be a specialty here, and they were kind to fill my bowl with a freshly made batch of it! Glad I call this place part of my neighborhood and will be back the next time I want to grab a quick and filling bite.", "author": "Yang Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-10-06", "description": "Regular customer using meal pal. Mala chicken + string beans are great! Chicken crispy with a slight taste of \"mala\". Definitely not the authentic mala taste you can get from flushing restaurants but this will do for a take out spot in Brooklyn. String beans are also crisply cooked but on the salty side. For the meal pal price of ~$6, its a great deal. Minus one star on \"hit or miss\" on the customer service. Most of the times it seems like the customers are the ones who are smiling, giving eye contact and saying \"thank you\". Customer service training is recommended :)", "author": "Raymond Y."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-06", "description": "Chipotle-style Chinese spot makes for an incredibly tasty meal for a decent price (~$10 for a bowl). The portion size of all the ingredients were super generous making for a huge meal aka I could not finish it all in one sitting. \n\nHad the green rice (which looks odd at first but is delicious), the pork (you can hardly ever go wrong with char sui as by design its incredibly flavorful), \"pork sauce\" (server called it that and it was a tad bit too sweet for my liking but still good), eggplant (yum!), string beans (my favorite out of the two veggies I got) and assortment of garnishes. All the ingredients really complement each other making for a super cohesive dish.\n\nServers were nice and immediately greet you as you walk in. Plenty of seats to have a quick bite to eat inside. \n\nWill definitely be back!", "author": "Len N."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-07-12", "description": "Karaoke In The Style Of Fastball*:\n\nWe made up our minds, and we wanted snacking.\nWe needed food before the sun went down that day.\nThe Chinese food in the hood, it is so lacking,\nBut what were we doing without ever eating The Wei? \n\nWe drank all the wine, and we got to talking.\n\"Goddamn I want some char siu pork, today.\" \nAnd when she agreed, we started walking,\nIt's a good thing we knew just where we could be finding The Wei.\n\nThat's probably enough of that. The Wei is fresh, fast, and flavorful. They will load you up on the pork (less so on the chicken), and even if you eat it all in one sitting (not advised), you won't even feel terrible afterward. \n\nPlus, the vegetables are actually green, and don't look taste as if they have been cooked to death. This is a win.\n_____________\n\n*https://www.youtube.com/watch?v=b0wfu3tOrtQ", "author": "Peter D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-22", "description": "wow i randomly decided to order from here while cooped up in the library of my school. I got the chicken market bowl with green rice and eggplant and greenbeans and a lychee jelly drink. My only qualm is that for delivery it was a bit too expensive BUT in store, great price. \nthe chicken was the most tender i've had from take out/ fast food. all good flavors, fresh. looking forward to tasting more", "author": "Sacha-Avi S."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-08-16", "description": "I paid $10.89 for: Market Chicken Bowl +Veggie Fried Rice + Sichuan Eggplant + Garlic String Beans.\n\nI opened up the cover and they gave me free hairs and very dry food.\n\nI contacted the restaurant about voiding my transaction because it was unacceptable. Dead silence..just like when I opened up the cover to the food. What a waste of money and in addition, they aren't customer focus/service competent.", "author": "Evy F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-08-20", "description": "Solid. Love this place. Craving noodles and some tasty roasted pork? Look no further. I've never been inside but ubereats this whenever I get a hankering for a bowl of happiness.", "author": "Aly O."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "The Wei", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qqTOxjfWxFEUpn9AKt44Ow/ls.jpg", "@type": "Restaurant", "telephone": "+17182608888"}