{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-13", "description": "Asian chipotle is a good description. It's basically grease. Fine if it's cold and you need a quick meal but nothing to rave about.", "author": "Z B."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-27", "description": "Food was great - closest I have had to being authentic cantonese. (String beans are the best!!) Pickles could have had more salt/seasoning but food overall was great. Staff super friendly and helpful.", "author": "Michelle S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-01", "description": "This place has become one of my favorite spots for a quick bite. Fast service and the food is really authentic. You pretty much can't go wrong with the selections they have.", "author": "Bo J."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-01-23", "description": "Like a few others, I will say I like the concept and really want to like this spot. But the food is inconsistent, twice now when I've gotten the chicken  it was essentially just hard nuggets of fried breeding (and not hot), the only time I had the pork it was very tough and had clearly been sitting on heat for a while to the point of getting overcooked. Today I looked at both offerings and was offered a sample of the chicken, was wasn't even lukewarm. The gentleman who gave it to me tried it and agreed, then told me fresh chicken would be out in 6-7 minutes. Ten minutes later it came out, and even fresh there wasn't much chicken under all that breeding. It was also over salted. Not sure I will try again as I've invested $50 in consistently mediocre food and after a handful of tries they can't seem to nail it.", "author": "Alexandra S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-22", "description": "Very good chipotle style good quality chinese food. Only wish they offered soup.", "author": "M R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-29", "description": "Love the mala chicken and green fried rice and eggplant! They are also very friendly and the ambiance is modern and fun.", "author": "Nhesthy O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-25", "description": "Discovered this place by accident on my way to pick up cheesecake from Juniors for a friend. Glad I stopped in. This place is great!  The food is delicious and the staff was very friendly. The food was so good, I returned 2 days later...  Have visited 2 times during their first opening week- I had the veggie rice, tofu, bok choy, and eggplant,along with a few garnishes. The second time, I tried the lo mein, tofu, string beans, WoW... I love the eggplant.  The string beans were also a hit.  Next time, I'll have to try the other rice.  I've told all of my friends to try you guys. Can't wait until you start delivering to Fort Greene.", "author": "Frances L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-16", "description": "SO thankful for this spot in Downtown Brooklyn (DoBro Bro!). The staff is so nice and this is my new go-to spot for quick and healthy eating.  Eating with chopsticks took too long that I had to switch to a fork to scarf down the yumminess!  Sooo good! Welcome to the hood!", "author": "Jennifer L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "I've been dying for good quality, fresh, but classic Chinese food in the neighborhood. This place hits the spot!! Quick, yummy, and comfortable experience. I had the noodles with silken tofu and string beans with mixed veggies. I was surprised by how much I liked the string beans-- they were just the right amount of crispy. I also tried some of my friends' eggplant which was amazing! The portions are huge too-- I'll definitely be back.", "author": "Nadiya C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Absolutely delicious, authentic and affordable Chinese food - a rarity and a gem in downtown Brooklyn area! The popcorn chicken, mapo tofu , eggplant and green fried rice is a must! Also appreciated the fact that you get 2 veggie choices and 1 protein - food tasted super healthy, non-greasy and just awesome", "author": "H K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "First off, you MUST order the green fried rice. It was my first time having it and I was surely not disappointed. The food, decor and vibe of this whole establishment was top notch and I will definitely be returning. Service was quick and the food tasted great. They even have desserts for your sweet tooth!", "author": "Jahde +."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-25", "description": "This is not the cheapest fast food around BUT it is quite tasty and a good deal. The amount of food is huge. I had a bowl and nothing else and I was absolutely stuffed. Granted I am not a huge person, but I am also not a light eater. The bowl is well balanced in terms of the amounts of meat, carbs, veggies, and garnishes. This isn't a place that gives you 3/4 of a bowl of rice and 2 pieces of meat. They also get thumbs up for unusual and tasty flavors. I got all of their garnishes and they were all pleasant, different, and went well with the food. In terms of the main ingredients I got the pork, the green rice, the eggplant, and the bokchoy. None of these were unusual but all were solid and the unusual thing was to have such a good combination of ingredients in one dish. Maybe the bokchoy was a bit overcooked. The one negative comment I have is that the sauce that comes with the pork is absolutely disgusting! Fortunately, my partner advised me to get it on the side. And I *STRONGLY* advise anyone who hasn't it tried it to do this. I can imagine it would have ruined my entire dish. I am kind of amazed how the same people who came up with rest of the menu managed to make that unholy monstrosity.", "author": "Aliz C."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "The Wei", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qqTOxjfWxFEUpn9AKt44Ow/ls.jpg", "@type": "Restaurant", "telephone": "+17182608888"}