{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 4}, "datePublished": "2017-12-15", "description": "Hefty portions, the scallion-infused green fried rice  was delightfully subtle to me as the other food was mixed in. They actually use szechuan peppercorn in the Ma Po tofu. Green beans and bok choi were solid, although I'm not a fan of the large pieces of garlic. Fried onions topping added extra texture to the bowl.\n\nMini Sesame balls were a sweet, red bean based dessert - being smaller improved the typical crust to innards ratio; seeds and dessert were perfectly toasted. GF and I enjoyed that.\n\nThe portion is right for the price ~10 - could feed two. You have different protein choices as well. I wouldn't say it's mindblowing but it's a solid spot for a fast, weeknight meal. I could see myself adding this to my regular rotation of weeknight eats.", "author": "David N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-11", "description": "This is my favorite place because it is quick authentic Chinese food. The only thing is that it is a bit oily but it tastes so good. If you want to cut back on the calories you can opt out of the sauces. The portion is huge so $12 for this is more like a $4 or $6 meal depending on how much you eat. Highly recommend this place and hope they open more stores", "author": "Annie C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-21", "description": "To be honest, I was a little bit skeptical about an Americanized Chinese restaurant being good because I associate that to typical take-out places or chains (like PF Chang's) which are usually just okay. Boy did I prove myself wrong! I was surprised by how much I actually enjoyed this place.\n\nUnlike all other Chinese take-out restaurants, The Wei is chipotle-style where you choose your base, protein, veggies, and garnishes. I got the green fried rice as my base, mala chicken for the protein, garlic string beans and Shanghai bok choy for veggies, and fresh scallion, sour cabbage, pickled radish, and sour spicy turnip for my garnishes. I swear to god, I've never tried better bok choy in my life. I don't know what crack they put in there but it was damn good. The mala was a little dry but it was so flavorful! The green fried rice was unlike anything else I've ever tried before and, honestly, everything just meshed so well together. If I lived as close to this place as my brother does, I think I'd go broke here weekly. Total was $9.50 plus or minus some, which I think is a really good price for this style of restaurant AND for the portions! This one bowl is a meal and a half for me, if not two. So worth it and so good!! Also, service was extremely quick! \n\nSeriously, I can't wait to visit my brother just so I can have an excuse to come back here haha. This is surely da wei to go.", "author": "Winni C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-09-29", "description": "I had a college tour around the area, my friends and i were craving chinese food and we found this gem. This place was honestly so amazing, the interior is gorgeous by the way, it's a simple casual dine in yet somewhat modern. The food was also amazing, it's sort of like the Chinese of chipotle but honestly i might prefer The Wei. And the food, itself was visually pleasing to the eye. The staff too were great, very polite, sharing smiles with us. The music and ambience gave a very chill, calm vibe.Overall, great place to visit. Highly recommend.", "author": "Emily L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-21", "description": "[Insert joke about that Fastball song \"The Way\" here]\n\nAll poorly executed jokes aside, The Wei is pretty awesome. Sure, people like to call all fast casual restaurants \"The Chipotle of [cuisine]\", but that's a pretty apt description.\n\nAt The Wei, you choose a base, protein, 2 veggies and optional toppings, served in a bowl.\n\nI went with the green scallion fried rice (delicious), with mala chicken (popcorn chicken with Sichuan chilis), with spicy eggplant and garlic string beans, and topped with fried shallots, scallions, and sour spicy turnip.\n\nThe chicken could've been warmer, but everything else was great. The scallion fried rice was unique, and I could eat it every day. Loved the veggie sides, though a little on the greasy side.\n\nHere's a tip - their portion sizes are pretty big. So save half your meal and it'll be much better the next day after all the flavors and sauces have melded together. The chilis and the chicken didn't seem to be well integrated, so the chicken by itself wasn't that spicy. But after a night in the fridge the whole bowl was nice and spicy.\n\nAlso had the veggie spring rolls, which were delightfully crispy, but wasn't anything special without the sweet and sour sauce.\n\nWas it all down with $4 matcha bubble tea, which was okay.\n\nThe bathroom situation is a little weird. They share a hallway bathroom with a podiatrist and a security training office, and you have to enter a code.\n\nThe Wei is affordable, yummy, and definitely worth trying.", "author": "Kenny C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-01-23", "description": "This place was awesome. If you're getting sick of the food (and prices) at dekalb market, don't miss The Wei which is right around the corner, just as flavorful, and not quite as expensive! It's basically the Chinese version of Chipotle but even better. You start with a rice base and you layer on protein, sauce, veggies, and add-ins. I got the roast pork with garlic string beans, broccoli, and green rice. Every layer had so much flavor and really together made an amazing lunch experience. The pork is salty and crisp, the broccoli is perfectly cooked, and the green rice is loaded with scallion flavor. My friend got the popcorn chicken as his meat which was equally as good as the pork - crispy and light tasting. I will certainly be back as the bowls are filling and come at a great value.", "author": "Sam E."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-07", "description": "The Wei is an affordable, fast-casual restaurant that delivers huge and tasty portions of Chinese food in a build-your-own-bowl kind of format. It's definitely a great option in the Downtown Brooklyn / Fulton Street area for when you're starving and want something a little different.\n\nAlthough there's plenty of room for seating, they do a brisk takeout operation as well; I was in and out in about 10 minutes, even with a moderate line during prime lunch hours. I went with their green fried rice, char siu pork, sichuan eggplant, broccoli, and all of their miscellaneous toppings.\n\nPortions are absolutely MASSIVE (including protein!); I seriously could not believe how much pork they ended up giving me. I really enjoyed the (somewhat fatty) sweet pork, silky eggplant, and crisp broccoli. The flavors honestly reminded me of take-out Chinese food, but in a slightly more upscale format. Either way, everything was delicious and I was absolutely stuffed about a third of the way through my bowl.\n\nI will agree with the other reviewers that the food is super oily: this is not a light meal. I too found a puddle of oil at the bottom of my bowl, so this may not be the best option if you're watching your waistline. But if you want a hearty meal with plenty of leftovers, this is a good spot and much appreciated in this area.", "author": "Marina S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-12", "description": "Located directly across from Juniors I stopped in for lunch and was surprised that it was not crowded considering we are in downtown Brooklyn. \n\nLocation is clean with seating for about 20. \n\nIt's a \"chipotle\" style set up; you pick your rice, protein etc. \n\nI had the green rice, chicken (thigh meat which I normally wouldn't eat) 2 vegetables and scallions. The garlic sauce which was a more like soy sauce was on the side at my request. Not much of a garlic sauce. \n\nThe rice was fresh and with the exception of the color it was regular rice. The chicken was moist and tender. The boy choy was over cooked and the green beans were excellent. \n\nThe bowl gives you a really nice portion size and a larger serving of rice then chipotle. \n\nLunch met my expectations based on reviews on Yelp and recommendations. \n\nThe employees were short and direct and knowing that this was my first time I expected more of an explanation. I did taste the pork and it was dry. \n\nThey do not give veterans or students a discount. \n\n3 = Average. \n\nNothing blew me away. Great alternative to fast food. About $10.", "author": "Amy S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-05-18", "description": "Absolutely insanely amazing dumplings - I'm Chinese and have eaten many dumplings. \n\nAnd the staff is v nice. Would move boroughs for this shop", "author": "Sally G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-11", "description": "Really pleased with this place over the past few months. The food is consistent, the green rice is delicious, and the workers are fast and efficient. I'm not a fan of the beef option but the pork and chicken are excellent. Interestingly every time I stop by later at night I see them meticulously cleaning the kitchen. I think that's a good sign!", "author": "Kathryn S."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2018-03-30", "description": "Sorry to be derivative of all the reviews of \"The Wei\". Writing that I will reconfirm the experience is Chipotle for Chinese food . I will add that timing is important. It's important that you try to get the freshest dish as the bottom of the pan can be oily. This is not a place for a date or new relationship; it's a place to eat decent food and leave.\n\nThe people working here are very nice. If you're looking for a place to eat before going to Trader Joe's or Target this is a good option. Once you figure out that 90% of the food stands in Dekalb market are over promised and under delivered it's nice to get a decent meal with out getting ripped off.\n\n\nLunch is for take out. After 3:00 seating is very easy even if ambience is lacking.", "author": "Thomas Q."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-04", "description": "I had mealpal deal \u0026 got Wei's roast pork and garlic string beans bowl. The roast pork was juicy and just the right consistency. The string beans were fresh to taste. It was the tastiest rice bowl dish I've had in a while. \nThe seating is limited. The time you go depends to how busy they get. \nYou walk in, you choose what rice you want, the protein and three choices of vegetables. They do have tofu for the vegetarian peeps.\nI usually go in to buy and take out. I would definitely go back again to get the dish even if it was not a mealpal deal.\nEnjoy!", "author": "May Y."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-10-25", "description": "No. Stop it. Right now. \"Chipotle of Chinese food\" and you give it 5 stars? Just. \n\nNo.\n\nCan we put an end to college students not knowing what authenticity is and paying more than they would for real Chinese food made by real Chinese people in a real Chinese restaurant?\n\nCan we stop serving food in-house in compostable bowls? \n\nCan we stop rating a place 5 stars because of the hipster decor?", "author": "Scott L."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-05-19", "description": "Overpriced,oily and under seasoned food. \nOrdered the steak with eggplant and asparagus. Everything was covered in oil and tasted like nothing", "author": "Kenny T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-02-15", "description": "Food is very good \u0026 different from what you usually see! It's like a \"chinese\" version of a subway or chipotle style restaurant. You pick a rice/noodle, a meat, veggies \u0026 toppings for your bowl. The ingredients are very fresh and were satisfying. I really enjoyed my meal here. I also tried the lychee mango tea and it was yummy. I would go back here again, definitely a place everyone should try :) Also the staff was very friendly! It was a little slow paced when I went (Thursday afternoon) but they were upbeat and when I went to try to buy a water bottle the girl at the register first informed me they have a water fountain near the window in the front of the restaurant which was very nice to save me some $ :) It's the little things in my book!", "author": "Amanda T."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-08-19", "description": "This place is like Chipotle, but Asian! So, so delicious. My fave was the garlic eggplant - I actually felt like this place cooks it better than any other Asian place I've had it at. Probably my fave eggplant of all time, it was very flavorful and tender! The mapo tofu is also great. Though a little expensive for Chipotle-style food, the portions were very large and both my friend and I took half of it home, so overall you're getting the bang for your buck. I would highly recommend this place for a quick, delicious meal!", "author": "Li W."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-07-23", "description": "Oh the Wei. I have become so obsessed with your rice dishes, and I'm pretty sure half my office is also now equally obsessed (too) because of me. In fact, some of them even order the dishes to take back into Manhattan for dinner with their families! \n\nI always get the scallion rice, and I LOVE the Mala chicken -- though I wish they would put in more dried chili's, either I get too little or none at all -- and the Tofu. Veggie-wise, I love the eggplant, the green beans and the bak choy. The sesame mochi balls are sticky yummy goodness and the lychee iced tea is my JAM. \n\nIt's rare that a week goes by and I don't order from them. At some point in the future, I will have to set foot into the restaurant. For now, I shall revel in the joy of delicious food arriving at my doorstep at home and at work.", "author": "Shu Jin S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-12-06", "description": "I was surprised by The Wei! I've seen it on Instagram posts, I've read about it on Yelp, and finally visited their only location last Friday for a pre-movie dinner.\n\nIt's like a Chinese fast-casual restaurant, the likes of which imitate GRK or Chipotle. It kind of reminds me of the box lunches you can get at a Chinese restaurant - but this one has an Americanized twist on it. \n\nAuthentic Chinese restaurants (not take-out) will typically have lunch options, where it's like $7 for white rice, a protein, and a vegetable. The Wei takes this concept and introduces it to non-Chinese America. It's really great! It had a true Chinese American vibe to it, which felt super cool.\n\nA standard meal is a huge portion. I got the scallion rice, the char-siu protein, the green beans and the bok choy. All in all, the meal cost maybe $11 but it was such a huge portion of food. I split mine into two meals. The scallion rice was a fun twist on something boring and I really liked the flavor of it. The char siu was good with the sauce they put on it. The veggies for me really nailed it all down for me. \n\nWe also got juice boxes of the sugar cane tea and the chrysanthemum tea. And ordered the sesame balls on the side which, surprise!!! were also hot and yummy. \n\nMy only wish is that The Wei were closer to my work, so I could have it all the time. I really hope this place makes it and expands in NYC. A really great addition to the fast-casual dining scene in New York!", "author": "Stephanie F."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2018-06-04", "description": "yo straight up I thought this place was going to be some kinda horrible americanized chinese food \n\nbut i was surprised\n\nfirst of all everything was extremely fresh \nthe portions are huge for 10$ and honestly \nit was the best americanized chinese food i had in my life \n\nthis place could do well even in Chinatown i bet", "author": "Andy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-24", "description": "Think Chinese fast casual (aka a Chinese Chipotle). The Wei is conveniently located near the subway and BAM, perfect for a tasty, efficient dinner before a BAM show. The Wei is very generous (maybe even too generous) with its servings. Give the spicy chicken a chance. The veggies are well made and seasoned as well. Great spot, hope they expand to Manhattan sometime!", "author": "Michael C."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "The Wei", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qqTOxjfWxFEUpn9AKt44Ow/ls.jpg", "@type": "Restaurant", "telephone": "+17182608888"}