{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2018-04-03", "description": "I absolutely love the food in here!! I have it often for lunch and the servings are big enough for me to have the other half for dinner. My favorite thing? The rice with spinach.", "author": "Kiki Q."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-10-13", "description": "Generous portions for a great price! I had white rice, tofu, eggplant and green beans. It was delicious! Although it was a little bit too spicy for me, I was happy that our mixed group of plant and meat eaters all were able to eat!", "author": "Lauren K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-04-19", "description": "I liked the food so much, that I went back twice in one day (April 18). If you are a vegan like me, don't fret, they have delicious vegan options and it's clearly labeled. Whatever you choose, make sure you order the eggplant. It's delicious! \n\nI had the vegetable fried rice, tofu, green beans \u0026 eggplant. The sesame balls are also a must.\n\nKeep playing that 90's RNB.", "author": "Michelle N."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-01", "description": "Great little lunch spot. Quick rundown: \n\n- It was a ton of food... I ate half, then stir-fried the other half later and it was amazing\n- Maybe too much protein? I'll file that under good problems to have.\n- Scallions and rice are my favorites, so now scallion rice is my favorite\n- Delicious veggies, everything tasted fresh\n- Loved all the accoutrements (is there a mandarin word for that? ...google says: 装备)\n\nHonestly it was even better as leftovers, so maybe a hot wok at the end of the line would bump the satisfaction up a notch, but certainly no complaints. Will be back.", "author": "Jake D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-09-12", "description": "This restaurant has quality fast Chinese food.  Their system is simple and quick: pick a rice or noodle, a meat (protein), 2 veggies, garnishes, and presto!  You have an inexpensive tasty, mouthing watering meal for $10. I picked the noodles \u0026 green rice (yes, you can pick two), the roast pork with the sauce, \nEggplant \u0026 green beans, and salty pickle garnish.  This is not Chinatown type food, but close to authentic as it will get in downtown Brooklyn.  The eggplant was cooked to perfection, not too mushy, and the green beans were skimmed through oil before being sautéed so they had some crunchiness-very good and tasty.\n\nMy daughter had the green rice, spicy fried chicken, green beans and a broccoli \u0026 carrot medley. \n\nAt first, I thought about combining two proteins: roast pork \u0026 the Ma Po Tofu, a natural combo for a Chinese dish, but the server said it would cost an extra $3, so I declined.  \n\nThe restaurant was clean, small, but adequate for a fast food setting.\nBeing Asian, I can say this without this being a racist remark:  I was glad to see two brothers (Asians) cooking in the back, who came out front regularly\nto check on the food quality \u0026 quantity.  Needless to say, I will return to the Wei.", "author": "Ronald Y."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-01-04", "description": "I have been checking out different Asian food spots on my free time and this is one of the places that I added to my list. The place had great service and a decent selection on their menu. Reasonably priced as well. Food here was really delectable and tasty. I have yet to check out the rest on the menu but will definitely bring a friend here next time.", "author": "Jenna B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2018-02-14", "description": "Sometimes the proteins are cooked too long but the noodles are always excellent. The bok choy and eggplant are my favorites!", "author": "Xavier W."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-02-26", "description": "This is pretty much the Chinese takeout version of Chipotle.  You basically pick a base, a protein, two veggies, and unlimited toppings.  I looked at the reviews ahead of time and noticed that the green fried rice was the popular choice and decided to choose that as my base, tofu as my protein, and Sichuan eggplant and garlic string beans as my veggies.  It was a bit pricey at a little bit over $10, but it was a lot of food.  It's safe to say that I was left feeling a little disappointed.  I felt like I was eating overpriced Chinese takeout.  I will admit that the green fried rice was good and the Sichuan eggplant was super tasty, but everything else was pretty basic.  I didn't really find anything special with what I was eating, and the food was actually really oily.  There was a pool of oil at the bottom of my bowl, which is really unappetizing.  I'm just gonna say that I will probably not be back.", "author": "Liana M."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2018-02-25", "description": "The food was very disappointing, overly saturated with grease.  The chicken was all breading and lacked real meat.  The staff was cordial and the facility was clean, but the food was too bad for a positive review.", "author": "Bryan B."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-07", "description": "It's Chipotle, but with Chinese food, and better.\n\nThe spring rolls were great.\n\nThe green rice is weird and real good.\n\nGet after it.", "author": "Will R."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-24", "description": "I honestly come here a little too often, but there's no shame in the food game. \n\nTheir green, scallion rice is out of this world- completely unique (only one other spot in Flushing makes it) and it's unquestionably the most favorited item on the menu. \n\nThe eggplant \u0026 ma po tofu are also delicious, but alas... I'm a self proclaimed side-chick. Seriously- don't miss out on the cold sesame noodles (SO underrated), fried wonton chips, and the thick-skinned pork dumplings (i.e. my ideal comfort food).\n\nGreat food, well-priced, cool space, positive vibes, friendly staff. These guys are awesome.", "author": "Stephanie H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-11", "description": "Easy menu with fresh Chinese food. Great addition to the neighborhood and right across the street from Junior's.\n\nPick your base, protein, 2 veggies and unlimited toppings! The green rice and eggplant are a must.", "author": "Danny B."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-04-25", "description": "The prices here are affordable but I was disappointed by the taste of 50% of our order (my boyfriend shared a bowl, dumpling and spring rolls). Maybe we ordered the wrong things, so I'll likely try again, but basically... the noodles (our bowl base) had some Szechuan flavoring in it that I wasn't expecting (though I'll say I'm biased because I'm not a fan of Szechuan-style food), and the mapo tofu (our protein choice) was slightly on the bland side. The dumplings and spring rolls were solid, but I wasn't impressed overall considering the bowl was really the lions share of our meal.", "author": "Jane N."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2018-09-03", "description": "Used to really enjoy this place, but quality control has gone way down. My chicken was cold and dried out and so was the rice. The food was clearly not fresh and when I went back to the counter to complain, they told me it was \"impossible\" since there was a steamer. Won't be going back.", "author": "A L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-13", "description": "Tons of delicious food for a very reasonable price, really friendly staff and a pretty space. This place is addictive. \n\nMy suggestions/requests to them would be: offer a brown rice option! And make your mixed vegetable option vegan, too. Sometimes a girl wants some broccoli, and I bet the non-vegans who usually order it won't even notice if you took out the fish sauce. :)", "author": "Alicya P."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-10-16", "description": "lol who said they'd rather go to Panda Express than The Wei??? that's an insult. \n\nI've been coming here a little TOO much. This is THE best fast food place right now for me. I think it's always amazing to see Asian cuisine getting more accepted and moving into \"mainstream\" dining. \n\nEverything about The Wei is perfect. The employees are incredibly nice and don't just stare at you like at Chipotle or any other boring franchise fast casual place. The portions are huge. They really do not skimp on you. It's to the point where I feel like I have way too much protein and garnishes where I feel overwhelmed but in the best way possible because there's also a lot of rice so everything's amazing and balances out in the end. A bowl can last me 1.5-2 meals. \n\nPlease don't change", "author": "Kale H."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-13", "description": "Welcome to Brooklyn, and a bigger welcome to the 1st fast-paced Chinese restaurant of its kind.\nSimilar to a Chipotle type of experience, but with AMAZING Chinese food, and even better staff;  NOT to be confused with the typical MSG, heavy on the salt, questionable ingredients, or rude staff.\n\nThis place contains the following:\n-Amazing staff\n-Amazing food\n-Real / Healthy Ingredients\n-Great for dine or Take away\n-Great / Easy to access location\n\nStop in and check it out, you definitely wont be disappointed.\n\n#LetMeShowYouTheWei\n#TheWeiBrooklyn", "author": "R D."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-05-21", "description": "Quick and easy: pick a base (white/fried/green rice or noodles), pick protein (meat or tofu), pick veggies and toppings. Tasted really good but 3 stars instead of 4 bc of the indigestion I got after.", "author": "Thy L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-21", "description": "Eating at the Wei reminds me of what I used to think Chipotle was before their massive expansions and E-coli scares. Most reviews describe this place with the usual buzz words of high-quality and fast-casual. Those people are right, this is one of the few places in New York City where you can get high quality Chinese food in a casual setting and at a much lower price point. \n\nI got the Mala Chicken, Eggplant, and Green Bean all under a base of Scallion fried rice. The first thing you are going to notice is the sheer volume of food they give you. For around 10 dollars I got a massive amount of food I could not finish. You also get a pretty good rendition of Chongqing Chicken with plenty of fried Szechuan peppercorns. It's no Han Dynasty, but it's good. The real standout were the green beans. They were probably laced in some sodium-heavy sauce, but they were super good. I would not be surprised if this place expanded across the city, even though it was nearly empty when I arrived at prime lunch hours.", "author": "Jonah R."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-22", "description": "Incredibly fresh, flavorful, and affordable.  I chose the green rice base with pork, broccoli, green beans, and several of the toppings, with sauces on the side.  I received plenty of food for two meals, but I couldn't put it down and barely managed to save enough for a small meal the next day.  I liked the availability of several sauces, including several hot sauces.\n\nWould be nice if you could do half-and-half or combo meats instead of adding a whole extra portion of protein and if there were a veggie base option, but those are only minor quibbles.  I definitely would go back.", "author": "Natalie J."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "The Wei", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qqTOxjfWxFEUpn9AKt44Ow/ls.jpg", "@type": "Restaurant", "telephone": "+17182608888"}