{"aggregateRating": {"reviewCount": 212, "@type": "AggregateRating", "ratingValue": 4.0}, "review": [{"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-11", "description": "I came here for lunch with my friend and I was highly impressed by the service and and quality of food service at this new establishment. The staff behind the counter- friendly, kind and make great recommendation if you have any questions. The options 1 base 1 protein 2 veggies and garnishes of your choice. I had the green fried rice, fried catfish with eggplant, Shanghai Bok Choy and sour spicy turnip. It was Delicious. The sour spices turnip  had a tangy crunchy mild spiciness, very playful on the palate. As far as the rice I didn't really taste anything spectacular but the catfish was fried well not hard not soft but just right. The eggplant and book choy were steamed and still had some type of crunch but still soft. The food was fresh and edible, the only thing I wish I could change is nothing it was a pretty decent cheap lunch option. Great for the price. The restaurant was cozy, semi-medium in size but with enough seating for everyone that decided to stay and eat.", "author": "Shari J."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-03-22", "description": "It is set up like Chipotle, where you pick and choose parts of your bowl. Not that much different from any other Chinese take-out hole in the wall. The food is really salty and drenched in sauces. I was expecting more flavorful and fresher food.", "author": "Al L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-12", "description": "We came 20 minutes early, pulled the door handle and started to walk in the other direction. Then a friendly face appeared, opened the door and let us in early. All the dishes were not yet in place, but that didn't matter - what was there was delicious. The concept is simple: pick a rice/noodle base, a protein, and two veggies. Fast, simple, tasty.", "author": "Tom S."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-04-06", "description": "Prompt service. Excellent prices. \n\nI love the pickled radish and spicy turnip. \n\nLots of vegetarian options. Meat too. \n\nEnough space for people to sit and enjoy a meal. Have been there twice and it's been a consistently good experience.", "author": "Pat S."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2016-12-13", "description": "Authenic chinese foods spot in this neighborhood! Bubble milk tea was good. Love the roasted pork and that green rice. Lo mein was juicy and not like those dry cheap ones. Would be my go to chinese foods spot from now on!", "author": "Mei G."}, {"reviewRating": {"ratingValue": 1}, "datePublished": "2017-02-28", "description": "We went there wit our kids before visiting the transit museum. I was looking forward to a fresh take on Chinese fast food. Unfortunately after a few bites into my\nMeal I found a hair imbedded in my food that did not belong to me! There was an African American server who had long extensions on and her hair was not tied back or covered. So I know where the hair came from. \nI went to the register and received many apologies from the cashier along with a refund. \nI will not be returning as it was unsanitary conditions.", "author": "Snober L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-14", "description": "Just finished lunch here and I must say I was pleasantly surprised. When I see 'casual Chinese' I'm always a bit wary. The scallion infused rice with Mala chicken, garlic string beans and bok choy were the perfect lunch on a cold day! Will definitely come back when in the neighbourhood", "author": "Steve G."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-11", "description": "Victor, who I think is the owner, is so accommodating. My boyfriend I have been there twice and he's altered orders and made everything special to the way we've wanted. The staff is friendly and informative and the portions are huge. It's definitely a positive addition to the neighborhood.", "author": "Morgan C."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-01-22", "description": "Excellent and friendly staff at this Asian version of Chipotle. Had the steak and bok choy and tried the spicy Mala chicken and both were delicious and had reasonable prices. It was nice being able to down a bubble tea with my meal instead of just  a Coke. Will come back to try their dumplings and other side dishes as well.", "author": "Alex A."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-03-21", "description": "I highly recommend this spot. The food is fresh and delicious. I recently treated my team to dinner and it was AMAZING. Stan and his staff were wonderful. This is the place to go when you want good food fast!", "author": "Regina D."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-23", "description": "Casual takeout/eat in spot with yummy food. We stopped in for a snack and had the sesame noodles and the pork dumplings. I can't wait to try the bowls. The prices are totally reasonable. I second/third/fourth the request for brown rice and a veggie base option.", "author": "sarah K."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-05-09", "description": "Amazing. The green fried rice is to die for, I've tried to replicate it myself but I haven't been able to. Defo get the little fried wonton chip things. We stayed in Brooklyn over Christmas and ended up eating here literally once a day. It's super cheap and delicious with a casual, clean atmosphere.", "author": "Aubrey L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-05-05", "description": "The Wei is a delicious deal for the price. As others have noted, it is the Chipotle of Chinese food and they give you good quality food, and a lot of it. I love their green fried rice and their tofu is delicious too! Great for a quick lunch or dinner if you're feeling rushed or too lazy to cook. I only wish it were open later!", "author": "Vanessa R."}, {"reviewRating": {"ratingValue": 3}, "datePublished": "2017-07-22", "description": "The broccoli and string beans were excellent, but the fried chicken chunks were tough and flavorless, though with a ridiculously large quantity.  The boiled dumplings were pretty standard and come from a bag - not homemade or anything.  Slightly better than your typical hole-in-the-wall Chinese place.", "author": "Phillip L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-03-03", "description": "The food is very yummy!! I loved the eggplant and the mala chicken was exceptional. overall  if you're craving moderately priced Chinese food I'd def recommend. I'm not sure if they deliver yet as they are pretty new. In few words I'd say this is like a Chinese food version of Chipotle, and I have to say I don't hate it.", "author": "Aury O."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-06-15", "description": "The food is delicious and the portion size is A-MAZINGG! You get so much for a little over $10. The service is quick and employees are friendly. Definitely recommend if you are looking for some good Chinese food that is more than just your average Chinese takeout food.", "author": "Helen L."}, {"reviewRating": {"ratingValue": 5}, "datePublished": "2017-02-14", "description": "I will definitely be returning soon.\n- very quick service (Chinese chipotle)\n- friendly \u0026 helpful staff\n- go when hungry as portions are HUGE\n- I recommend the green rice \u0026 tofu, green beans \u0026 eggplant were incredible \n- friend Loved the pork dumpling side. His chicken had some gristle but still liked it\n- reasonable prices \n\nOn the downside, it was quite heavy in oil \u0026 sauces \u0026 msg so it is definitely is not the healthiest meal. I think it's worth it for a once a week/month cheat meal though ... 5 stars !", "author": "Liz C."}, {"reviewRating": {"ratingValue": 2}, "datePublished": "2017-10-30", "description": "The food is good. The lady who served me gave me attitude.  I hope they would train their staff and let them know.", "author": "Emily L."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-02-07", "description": "I grabbed a quick bite here last night and was very happy with my meal. I got the green rice with roasted pork, bok choy, string beans, scallions, and fried shallots. I really enjoyed mostly everything, especially the pork. The only thing that didn't bowl me over was the bok choy, which was a bit bland. Next time I'd try to the eggplant in its place.\n\nThe portions are huge. I came after working out and was starving, and couldn't even finish my bowl. \n\nIt's got a fast-casual, Chipotle-esque vibe, but if you're looking for a quick bite or easy take out, I'd definitely recommend. \n\n(Oh and it's not really visible because it's through a door and down a hallway, but they do have a bathroom.)", "author": "Tara M."}, {"reviewRating": {"ratingValue": 4}, "datePublished": "2017-01-08", "description": "The Wei is great! Went there for the first time last week. Noodles were a bit greasy, but the green beans and eggplant were terrific. Staff are very friendly and welcoming; service is instant; value is good. Even the drinks are reasonably priced.", "author": "Paul S."}], "servesCuisine": "Chinese", "priceRange": "$11-30", "name": "The Wei", "address": {"addressLocality": "Brooklyn", "addressRegion": "NY", "streetAddress": "30 Dekalb Ave", "postalCode": "11201", "addressCountry": "US"}, "@context": "http://schema.org/", "image": "https://s3-media1.fl.yelpcdn.com/bphoto/qqTOxjfWxFEUpn9AKt44Ow/ls.jpg", "@type": "Restaurant", "telephone": "+17182608888"}